{"job title": "Data Scientist R2R", "company": "", "city state": "– Texas, USA", "rating": "NA", "job description": "This position supports the Senior Manager Global Process Automation &amp; Reporting in automation and reporting of business processes in the R2R area.\n<br><br>\nThe position will work very closely with the R2R Process Architect, the GPS R2R team and the CAO organization to drive and coordinate process automation and reporting activity. This individual will be tasked with driving process automation activities. This position will support and exploit automation of business processes through the implementation of Robotic Process Automation (RPA).\n<br><br>\nThe position will develop a standardized and automated way of reporting of how business processes are executed and is responsible for setting up and maintaining KPI/PPI reporting for the R2R process and agree this with the R2R stakeholders. This reporting will drive standardization of business processes by identifying opportunities for change and areas of non-compliance.\n<br><br>\nThe position will use process mining techniques and tools in order to find opportunities for standardization and automation and will work closely with the R2R team on developing dashboards/reporting utilizing this tool.\n<br><br>\nThe position will play a role in LyondellBasell's RPA Centre of Excellence, initially set up as virtual but moving to a stand alone organization.\n<br><br>\nRESPONSIBILITIES AND ACCOUNTABILITIES:\n<br><br>\nGeneral\n\n\n<ul>\n<li>Responsible for driving and coordinating process automation and reporting activity in finance, but mainly in R2R area.</li>\n<li>Stay up-to-date with RPA / AI technology, capabilities, business applications, process mining and be aware of innovations in this area.</li>\n</ul>\n\n<strong>RPA</strong>\n\n\n<ul>\n<li>Capture and manage all incoming RPA demand for R2R or other areas within finance</li>\n<li>Identify processes that are feasible for automation with recommendations for benefits and savings.</li>\n<li>Conduct RPA process assessments to determine potential processes to be automated and lead discovery and design workshops for R2R.</li>\n<li>Participate in benefits case / cost savings discussions</li>\n<li>Enable financial management and benefits tracking for identified automation opportunities</li>\n<li>Attend RPA governance meetings and complete assigned RPA trainings</li>\n</ul>\n\nProcess Mining\n\n\n<ul>\n<li>Develop a standardized and automated way of reporting of how business processes are executed using process mining techniques</li>\n<li>Use process mining techniques and tools in order to find opportunities for standardization and automation and will work closely with the R2R team on developing reporting/dashboards utilizing this tool.</li>\n<li>Deliver reporting to Business Process Owners and other senior leaders on a regular basis and as requested.</li>\n<li>Find business optimization opportunities and discuss these with R2R stakeholders on a regular basis to come to savings plans/projects identified using process mining tools (like Celonis)</li>\n</ul>\n\nPPI/KPI Reporting\n\n\n<ul>\n<li>Develop business reporting that will identify standard versus non-standard process execution</li>\n<li>Setting up and maintaining KPI/PPI reporting for the R2R process and agree this with the R2R stakeholders</li>\n<li>Automate business reporting to drive process compliance.</li>\n<li>Develop communication to support business process reporting and drive process compliance\n<br><br>\nPERSON SPECIFICATION:\n<br><br>\nEducation:</li>\n<li>Bachelor's degree in Business, IT or Management</li>\n<li>Master of Business Administration or Finance preferred\n<br><br>\nSkills:</li>\n</ul>\n\nOrganizational and Soft Skills\n\n\n<ul>\n<li>Excellent communication skills with ability to explain technical concepts in business terms.</li>\n<li>Self-starter with the ability to appropriately prioritize and plan complex work in a rapidly changing environment</li>\n<li>Workshop and meeting facilitation skills</li>\n<li>Results oriented with ability to produce products that deliver organizational benefit</li>\n<li>Strong critical thinker with problem solving atitude</li>\n<li>Strong conceptual and analytical skills - demonstrating outside-the-box problem solving skills\n<br><br>\nProcess skills</li>\n<li>Very strong knowledge of R2R end to end processes</li>\n<li>Deep understanding of the business and finance processes within the Petrochemicals business R2R model</li>\n<li>10+ years of experience in an R2R process, finance and/or shared service environment,</li>\n<li>Good understanding of main drivers and reporting needs in R2R process\n<br><br>\nProject Management skills</li>\n<li>Strong program/project management skills</li>\n<li>Knowledge of business case development including cost/benefit analysis, NPV\n<br><br>\nTechnical Skills</li>\n<li>Awareness of automation software capabilities</li>\n<li>Strong Knowledge of databases and SAP</li>\n<li>Knowledge of Robotics Process Automation ( RPA) technologies</li>\n<li>Understanding of process mining</li>\n<li>Good understanding of Dashboarding tools\n<br><br>\nLicenses &amp; Certifications:</li>\n<li>Process Re-engineering, Six Sigma or Lean Six Sigma experience very beneficial.</li>\n<li>CPA, CA, or equivalent preferred</li>\n<li>Certifications in any Robotics Process Automation tools preferred\n<br><br>\nCritical Competencies/Behaviors:</li>\n<li>Process Management</li>\n</ul>\n\nGood at figuring out the process necessary to get things done; knows how to organize people and activities; understands how to separate and combine tasks into efficient work flow; knows what to measure and how to measure it; can see opportunities for synergy and integration where others can't; can simplify complex processes; gets more out of fewer resources.\n\n\n<ul>\n<li>Technical Learning</li>\n</ul>\n\nPicks up on technical things quickly; can learn new skills and knowledge; is good at learning new industry, company, product, or technical knowledge - like internet technology; does well in technical courses and seminars\n\n\n<ul>\n<li>Organizational Agility</li>\n</ul>\n\nKnowledge about how organizations work; knows how to get things done both through formal channels and the informal network; understands the origin and reasoning behind key policies, practices, and procedures; understands the cultures of organizations.\n\n\n<ul>\n<li>Comfort Around Higher Management</li>\n</ul>\n\nCan deal comfortably with more senior managers; can present to more senior managers without undue tension and nervousness; understands how senior managers think and work; can determine the best way to get things done with them by talking their language and responding to their needs; can craft approaches likely to be seen as appropriate and positive.\n\n\n<ul>\n<li>Presentation Skills</li>\n</ul>\n\nIs effective in a variety of formal presentation settings: one - on - one , small and large groups, with peers, direct reports, and bosses, is effective both inside and outside the organization, on both cool data and hot conversational topics; commands attention and can manage group process during the presentation; can change tactics midstream when something isn't working.\n\n\n<ul>\n<li>Business Acumen</li>\n</ul>\n\nKnows how the business works; knowledgeable in current and possible future policies, practices, trends, technology, and information affecting his/ her business and organization; knows the competition; is aware of how strategies and tactics work in the marketplace.\n\n\n<ul>\n<li>Creativity</li>\n</ul>\n\nComes up with a lot of new and unique ideas; easily makes connections among previously unrelated notions; tends to be seen as original and value-added in brainstorming settings.\n<br><br>\nComputer Skills\n\n\n<ul>\n<li>Strong computer skills and proficient in MS Office Suite including Word, Excel, Visio, PowerPoint</li>\n<li>Extensive user of SAP systems</li>\n<li>Strong RPA knowledge</li>\n<li>Strong Process Mining tool knowledge</li>\n\n<strong><li>Dashboarding tool knowledge\n<br><br>\nLanguages:</li>\n\n</strong>\n\n<li>Strong verbal and written English skills required, additional European languages are desirable.\n<br><br>\nLyondellBasell (NYSE: LYB) is one of the world's largest plastics, chemical and refining companies and a member of the S&amp;P 500. LyondellBasell (www.lyondellbasell.com) manufactures products at 55 sites in 17 countries. LyondellBasell products and technologies are used to make items that improve the quality of life for people around the world including; packaging, electronics, automotive parts, home furnishings, construction materials and biofuels.\n<br><br>\nMust be at least 18 years of age and must be legally authorized to work in the United States (US) on a permanent basis without visa sponsorship.\n<br><br>\nLyondellBasell does not accept or retain unsolicited résumés or phone calls and/or respond to them or to any third party representing job seekers.\n<br><br>\nLyondellBasell is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, veteran status, and other protected characteristics. The US EEO is the Law poster is available here.</li>\n\n</ul>"}