{"job title": "Data Scientist", "company": "1st Merchant Funding", "city state": "– Miami, FL, FL", "rating": "3.8", "job description": "<strong>Summary of Position:</strong>\n<br><br>\nThe Data Scientist will be a key member of the leadership team of 1st Merchant Fundings online business lending division, a rapidly growing line of business at the intersection of finance and technology within 1st Merchant Funding. This thought leader will use machine learning and other techniques to design, evangelize, and implement state of the art solutions for online decisions.\n<br><br>\nThe Company is leveraging PowerForce® a proprietary business funding platform, to substantially increase our efficiency and funding levels. We are expanding our footprint including online lending and real-time decisions. We believe we are in a unique position to service our customers by leveraging very large datasets in new ways. We are looking for top data scientists experienced at applying machine learning to mission critical big data tasks. Fully automated lending calls for a machine learning approach because it requires the prediction of human behaviors that are complex and hard to model. This role offers tremendous scope for creativity and real world impact. We have current and future projects in streamlining data analysis, natural language processing, deep learning, fraud detection, and more. Data Science at 1st Merchant Funding is a high priority activity, and theoretical analysis and innovation are also welcome. The Data Scientist will be responsible for putting models into practice after testing.\n<br><br>\nAs a deep domain expert, the Data Scientist will partner with technology and business leaders to build new services that surprise and delight our customers.\n<br><br>\n<strong>The key strategic objectives for this role include:</strong>\n\n<ul>\n<li>Build predictive models including but not limited to credit risk, fraud, marketing response and propensity</li>\n<li>Implement and test models and deploy ready versions to production</li> \n\n<li>Risk management across diverse geographics, products, and customer types</li>\n<li>Identify new data sources and/or patterns that enhance predictive modeling capabilities</li>\n<li>Discover opportunities within data</li> \n\n<li>Ability to independently learn new technologies</li>\n<li>Work with multiple, complex data sources at large scale</li>\n<li>Highly motivated to tackle multiple projects in parallel</li>\n<li>An excellent communicator with ability to effectively collaborate with business teams, technical teams, and others</li>\n</ul>\n<strong>Skills and Qualifications:</strong>\n<br><br>\nBachelors Degree in Computer Science, Math or related disciplines with 4+ years industry experience OR Masters Degree with 2+ years experience including:\n\n<ul>\n<li>Strong background in applying statistical machine learning techniques to predictive modeling</li> \n\n<li>Strong knowledge deploying models into production</li>\n<li>Hands on experience in predictive modeling and analysis</li>\n<li>Strong algorithm development experience</li>\n<li>Proficiency in programming in Python, R, SQL, and shell scripting</li>\n<li>Experience with SQL, PHP, and Bash</li>\n<li>Experience with Data Mining, Unstructured data, Deep learning, Artificial Intelligence, Machine Learning, Decision Trees, and Predictive Analytics</li>\n<li>Great with math and statistics</li> \n\n<li>Fluency in big data platforms, Hadoop, Mapreduce, Hive, Spark</li>\n</ul>\nFinancial services, payments, and/or lending background is a big positive.\n<br><br>\n<strong>Why 1st Merchant Funding?</strong>\n\n<ul>\n<li>Casual work environment</li>\n<li>Full Benefits</li> \n\n<li>Health</li> \n\n<li>Dental / Vision</li> \n\n<li>401k</li> \n\n<li>Competitive Compensation</li> \n\n<li>Paid Time Off</li> \n</ul>\nRelocation assistance available.\n<br><br>\n1st Merchant Funding LLC and its affiliates are equal opportunity employers that exercise high ethical standards and are committed to complying with all laws in the jurisdictions where they conduct business."}