{"job title": "Scientist, Small Molecule Lead Discovery", "company": "23andMe", "city state": "– South San Francisco, CA", "rating": "4.9", "job description": "<strong>Who we are</strong>\n<br><br>\nGenetic testing makes it possible for each of us to understand our bodies in ways that were unimaginable only ten years ago. 23andMe continues to lead the way in making this information accessible, understandable and actionable for our customers, most of whom have consented to participate in research. This consumer-driven research model is powered by a wealth of genotypic and phenotypic information that has the potential to improve human health through advances in genomics.<br><br>\n23andMe's Therapeutics team is committed to discovering and developing new therapies that can offer significant benefits for patients. This dedicated research and development group identifies novel targets using 23andMe's genetic database, generates lead compounds for these targets and performs preclinical research to advance programs for clinical development. The team currently has research programs across several therapeutic areas, including oncology, skin, respiratory and cardiovascular disease.\n<br><br>\nWe are seeking an outstanding Scientist to join a collaborative, cross-functional research team aspiring to discover and develop innovative medicines to help patients. The successful candidate will be self-motivated, independent and creative researcher with a high degree of analytical and troubleshooting skills.\n<br><br>\n<strong>What you'll do</strong>\n\n<ul>\n<li>Lead and represent project to senior team</li>\n<li>Independently research, design and conduct molecular, biochemical and cell biology experiments to advance small molecule (and antibody) therapeutic programs</li>\n<li>Generate, analyze, document and present complex experimental data in project team meetings</li>\n<li>Communicate effectively and work collaboratively with other colleagues to drive the progression of the project</li>\n</ul>\n<strong>What you'll bring</strong>\n\n<ul>\n<li>PhD in Biochemistry, Chemical Biology, or related field with 2+ years of postdoctoral research experience, or MS with 10+ years' experience, or BS with 15+ years' experience with an outstanding publication record</li>\n<li>Deep experience in developing enzymatic and biochemical assays suitable for HTS or lead optimization, HTRF, fluorescence intensity, coupled assay, microcalorimetry, or SPR with small molecule ligand, etc.</li>\n<li>Hands-on experience in determination of potency and selectivity, and mechanism of action of leads in biochemical, biophysical or cell-based assays</li>\n<li>Hands-on expertise with automation equipment, such as workstations, pipettors, bulk dispensers, dilutors, or microplate readers</li>\n<li>Hands on experience with data processing, data management using curve-fitting software or chemoInformatics</li>\n<li>Expertise in liver metabolism diseases or oncology research</li>\n<li>Critical thinking with high degree of innovation and analytical skills</li>\n<li>Outstanding troubleshooting skills</li>\n<li>Excellent organizational and communication skills with an ability to work both independently and in a team environment</li>\n</ul>\n<strong>Pluses</strong>\n\n<ul>\n<li>Industry experience</li>\n<li>In silico screening or structural biology background</li>\n</ul>\n<strong>About Us</strong>\n<br><br>\n23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its \"50 Smartest Companies, 2017\" list, and named one of Fast Company's \"25 Brands That Matter Now, 2017\". 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. More information about our Therapeutics team is available at https://mediacenter.23andme.com/therapeutics/.\n<br><br>\nAt 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individual's race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.\n<br><br>\nPlease note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}