{"job title": "Data Scientist, Ancestry Product", "company": "23andMe", "city state": "– Mountain View, CA", "rating": "4.9", "job description": "Are you fascinated by genetics, passionate about bringing science to the everyday consumer, and interested in revolutionizing how people interact with their DNA? We're looking for enthusiastic people with a variety of backgrounds to contribute to the development of consumer genetics applications. Your work could help millions of people understand their genetic information and use it to make impactful life changes. Come join 23andMe's Ancestry team!\n<br><br>\n<strong>Who we are</strong>\n<br><br>\nSince 2006, 23andMe's mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of what's possible to help turn genetic insight into better health and personal understanding.\n<br><br>\n<strong>Who you are</strong>\n<br><br>\nYou have a passion for science and believe that it is important to make genetic information accessible, relatable, and useful to everyone. You want to use your data skills to build personalized new features for our customers to better understand their own genetics. You have an innate curiosity about user behavior and an aptitude for analyzing it to produce actionable insights. You are comfortable evaluating findings from scientific studies, have a high quality bar, and are a stickler for detail. You enjoy working in cross-disciplinary settings and are always looking for ways to improve the way your team gets things done. Like us, you are mission-driven and want to contribute to something that truly impacts people's lives.\n<br><br>\n<strong>What you'll do</strong>\n\n<ul>\n<li>Develop methods and perform data analysis on genetic and phenotype data to shape new and existing features (e.g., Ancestry Composition or DNA Relatives).</li>\n<li>Analyze customer behavior and design experiments to help our team build awesome, data-driven products.</li>\n<li>Collaborate with cross-functional teams, including Research, Engineering, and Marketing, to take early stage projects to market.</li>\n<li>Communicate findings both verbally and in writing to both technical and non-technical audiences.</li>\n</ul>\n<strong>We hope you have</strong>\n\n<ul>\n<li>MS or PhD in statistics, computer science or quantitative biology.</li>\n<li>Industry experience preferred.</li>\n<li>Experience with statistics, machine learning and data visualization</li>\n<li>Skilled in R, Python, and SQL. Google Analytics a plus.</li>\n<li>Familiarity with fundamentals of biology and human genetics.</li>\n<li>Excellent communication skills; this role requires regular interaction with team leads from each part of the company.</li>\n<li>An ability to work with minimum supervision to deliver well-designed high-quality work on time.</li>\n</ul>\n<strong>Interested?</strong>\n<br>\nSubmit your resume and a cover letter letting us know why you are excited about this position and why you are a great fit.\n<br><br>\n<strong>About Us</strong>\n<br><br>\n23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its \"50 Smartest Companies, 2017\" list, and named one of Fast Company's \"25 Brands That Matter Now, 2017\". 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. 23andMe is located in Mountain View, CA. More information is available at www.23andMe.com.\n<br><br>\nAt 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individual's race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.\n<br><br>\nPlease note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}