{"job title": "Scientist, Computational Biology", "company": "23andMe", "city state": "– South San Francisco, CA", "rating": "4.9", "job description": "<strong>Who we are</strong>\n<br><br>\nSince 2006, 23andMes mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of whats possible to help turn genetic insight into better health and personal understanding. <br><br>\nOur Therapeutics team is committed to discovering and developing new therapies that can offer significant benefits for patients. This dedicated research and development group identifies novel targets using 23andMe's genetic database, generates lead compounds for these targets and performs preclinical research to advance programs for clinical development. The team currently has research programs across several therapeutic areas, including oncology, skin, respiratory and cardiovascular disease.\n<br><br>\n23andMe is seeking an outstanding Computational Biologist to add to our collaborative, cross-functional research team focused on discovery of novel therapeutic targets and their development in our laboratories. Successful candidates will have demonstrated experience conducting creative and independent research analyzing a broad range of genomic data sets with an emphasis on understanding the underlying biology.\n<br><br>\n<strong>What you'll do</strong>\n\n<ul>\n<li>Extend existing target discovery efforts to incorporate additional data types and novel analysis methods</li>\n<li>Work toward identifying clinically relevant disease subtypes and associated therapeutic targets</li>\n<li>Contribute to ongoing therapeutic development programs</li>\n</ul>\n<strong>What you'll bring</strong>\n\n<ul>\n<li>PhD in computational biology, biostatistics, statistics, or related quantitative field</li>\n\n<strong></strong><li><strong>Expertise in several of the following:</strong>\n\n\n<ul>\n<li>Analysis of RNA-Seq and microarray data</li>\n<li>Analysis of other large omics data sets</li>\n<li>Genetics</li>\n<li>Fine mapping of genetic association signals</li>\n<li>Linear and nonlinear modeling of statistical data</li>\n<li>Machine learning</li>\n</ul>\n\n</li>\n<li>Experience developing robust data analysis software in R and/or Python</li>\n<li>Strong communication skills, and a particular ability to communicate data analysis results to non-specialists</li>\n<li>Demonstrated experience working on interdisciplinary teams\\</li>\n</ul>\n<strong>Strongly preferred</strong>\n\n<ul>\n<li>Industry experience in pharmaceuticals or biotechnology</li>\n<li>Knowledge of biology in at least one disease-relevant area (e.g., immunology, oncology, cardiovascular disease, etc.)</li>\n<li>Strong publication record</li>\n</ul>\n<strong>About Us</strong>\n<br><br>\n23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its 50 Smartest Companies, 2017 list, and named one of Fast Companys 25 Brands That Matter Now, 2017. 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. More information about our Therapeutics team is available at https://mediacenter.23andme.com/therapeutics/.\n<br><br>\nAt 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individuals race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.\n<br><br>\nPlease note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}