{"job title": "Scientist I - Data Collection", "company": "23andMe", "city state": "– Mountain View, CA", "rating": "4.9", "job description": "We are looking for an enthusiastic data collection scientist with a track record of innovation and success. 23andMe has the worlds largest research database of participants with both genetic and self-reported data. Data collection for scientific research is critical to our mission and we are looking to add to our strong team. Individuals with education and experience in survey methodology or alternative self-administered instruments (e.g. cognitive assessment) are strongly encouraged to apply. The successful candidate will have substantial influence on data collection strategies and methodologies.\n<br><br>\n<strong>Who we are</strong>\n<br><br>\nSince 2006, 23andMes mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of whats possible to help turn genetic insight into better health and personal understanding. In addition to the genetic data generated for each customer, we also collect data about their medical history, traits, and behaviors through online research surveys developed by our trained survey methodologists. Over 220 million questions have been answered already, and this number increases every day.\n<br><br>\n<strong>What you'll do</strong>\n<br><br>\nWe are looking for an experienced survey methodologist or health data scientist to work on our dynamic and growing data collection team. This person will have a vision of the future of data collection and will help lead, develop, implement, and test new measures of health conditions and behaviors. In addition, you will also be involved across the company on data collection, measurement and other related research efforts.\n<br><br>\n<strong>What you'll bring</strong>\n\n<ul>\n<li>Advanced degree in relevant scientific disciplines (e.g. public health, statistics, psychology, sociology, epidemiology, demography),</li> \n\n<li>Experience in design, deployment and analysis of surveys, self-administered tests, or similar measures</li>\n<li>Strong communication skills</li>\n<li>An ability to work to deadlines</li>\n<li>An ability to work on teams, in a fluid and highly collaborative environment</li>\n<li>Experience conducting qualitative and quantitative research</li>\n<li>Flexible and capable of managing multiple projects with overlapping deadlines in a landscape of evolving priorities</li>\n</ul>\n<strong>Pluses</strong>\n\n<ul>\n<li>Health research experience (e.g. community health, public health, clinical health)</li>\n<li>Understanding of genetics</li>\n<li>Quantitative data analysis experience</li>\n<li>Management experience</li>\n<li>Prior experience with Unix and XML or HTML</li>\n<li>Some familiarity with Python or another programming language</li>\n<li>Strong statistical skills and experience with a statistical program such as R, SPSS, or Stata</li>\n</ul>\n<strong>About Us</strong>\n<br><br>\n23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its 50 Smartest Companies, 2017 list, and named one of Fast Companys 25 Brands That Matter Now, 2017. 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. 23andMe is located in Mountain View, CA. More information is available at www.23andMe.com.\n<br><br>\nAt 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individuals race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.\n<br><br>\nPlease note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}