{"job title": "Data Scientist", "company": "2U", "city state": "– Brooklyn, NY", "rating": "3.9", "job description": "<strong>What We’re Looking For:</strong>\n<br><br>\nUnder the guidance of the Director of Data Science, the Data Scientist will lead advanced analytical research and development. This is a highly quantitative role that requires analytical aptitude, strong programming skills, intellectual curiosity and the ability to communicate results effectively.\n<br><br>\n<strong>Summary / Objective</strong>:\n\n<ul>\n<li>Machine learning and model building for projects involving various teams across the company, including sales, marketing, human resources, finance, and operations</li>\n<li>Predictive modeling and segmentation to support prospect scoring and consumer targeting</li>\n<li>Data exploration to identify drivers &amp; trends within our business</li>\n<li>Ad hoc analysis and reporting as needed</li>\n</ul>\n<strong>Things That Must Be in Your Background:</strong>\n\n<ul>\n<li>Degree in statistics, mathematics, computer science, economics, or other quantitative field required; Graduate degree preferred</li>\n<li>2-4 years of experience working with advanced analytic techniques in classification, regression, optimization and text analytics</li>\n<li>Experience implementing machine learning algorithms (Random Forest, SVM, etc.) in production settings</li>\n<li>Proficiency in either R or Python</li>\n<li>Familiarity with data extraction across different database architectures</li>\n<li>The ability and desire to identify and deploy novel solutions to business problems</li>\n</ul>\n<strong>Other Attributes That Will Help You in This Role and at 2U:</strong>\n\n<ul>\n<li>Strong interpersonal &amp; communication skills</li>\n<li>Ability to maintain a fun, casual, professional and productive team atmosphere</li>\n<li>Excellent communication skills with the ability to communicate in a courteous, tactful, and concise manner</li>\n<li>Ability to work with a diverse team in a fast-paced environment</li>\n<li>Enthusiasm and the ability to thrive in an atmosphere of constant change</li>\n</ul>\n<strong>EEO Statement:</strong>\n<br><br>\n2U is an equal opportunity employer that does not discriminate against applicants or employees and ensures equal employment opportunity for all persons regardless of their race, creed, color, religion, sex, sexual orientation, pregnancy, national origin, age, marital status, disability, citizenship, military or veterans’ status, or any other classifications protected by applicable federal, state or local laws. 2U’s equal opportunity policy applies to all terms and conditions of employment, including but not limited to recruiting, hiring, training, promotion, job benefits, pay and dismissal.\n<br><br>\n<strong>Note</strong>:\n<br><br>\nThe above statements are intended to describe the general nature and level of work performed by individuals assigned to this position, and are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed.\n<br><br>\n<strong>About 2U</strong><strong>:</strong>\n<br><br>\n2U partners with leading colleges and universities to deliver the world’s best online degree programs. Our Platform, a fusion services and technology, enables schools to attract, enroll, educate, support and graduate students around the world. Our company culture is united by our No Back Row® philosophy; the idea that when we each lean in and do our part, we are better individually and collectively.\n<br><br>\n<strong>2U Diversity and Inclusion Statement:</strong>\n<br><br>\nAt 2U, we are committed to creating and sustaining a culture that embodies diverse walks of life, ideas, genders, ages, races, cultures, sexual orientations, abilities and other unique qualities of our employees. We strive to offer a workplace where every employee feels empowered by the ways in which we are different, as well as the ways in which we are the same.\n<br><br>\n<strong>Why It’s Great to</strong> <strong>Work at 2U:</strong>\n<br><br>\n2U offers a high-energy work environment that’s both challenging and fun. We work hard, but our offices are casual and social places. We wear jeans to work and fuel brainstorming sessions with snacks and seltzer.\n<br><br>\n<strong>Benefits:</strong>\n<br><br>\n2U offers a comprehensive benefits package:\n\n<ul>\n<li>Medical, dental, and vision coverage</li>\n<li>Life insurance, disability and 401(k)</li>\n<li>Unlimited snacks and drinks</li>\n<li>Generous paid leave policies including a PTO allowance for your vacation, personal, or sick days</li>\n\n<strong><li>Additional time off benefits include:</li>\n\n</strong>\n\n\n<ul>\n<li>time off to volunteer for non-profit organizations</li>\n<li>parental leave after 12 months of employment</li>\n<li>holidays that include a winter break from Christmas through New Year and more!</li>\n</ul>\n\n<li>Tuition reimbursement program</li>\n</ul>"}