{"job title": "Manufacturing Data Analyst", "company": "3D Systems", "city state": "– US-SC-Rock Hill", "rating": "3.3", "job description": "<div> <div><div>Manufacturing Data Analyst - 180000JB</div><div><div>Description</div> Job Description:\n\n\n<ul>\n<li>Interface with top Production management to understand opportunities to enhance collection and statistical analysis of data to drive key manufacturing metrics associated with quality, efficiency, cost and continuous improvement.</li>\n<li>Assess current systems and tools, and devise plans for improved accuracy, efficiency and utilization in collaboration with Production and IT.</li>\n<li>Represent Production as key stakeholder for IT projects to define and meet internal customer requirements, perform alpha testing, coordinate beta testing, assemble and interpret user feedback, train end users, and oversee roll out across three shifts.</li>\n<li>Build tools for internal customers as needed to enable meaningful analysis and summary of data especially in the area of parametric electrical test data of products.</li>\n<li>Interface with other departments within the company to guide development of appropriate statistical analysis of data, tools and metrics.</li></ul></div>\n\n\n<div><div>Qualifications</div>\n<br>Qualifications:\n<br><br>\nEducation/Experience:\n<br><br>\n--Bachelors degree is required. 4-Year -- Engineering degree preferred with experience in relational databases, data regression analysis, manufacturing monitoring and control using Six Sigma analysis and tools.\n<br><br>\n--Statistical expert.\n<br><br>\n--Certified Black Belt preferred.\n<br><br>\nWork Requests:\n<br><br>\n-Perform work activities and complete duties in a timely manner.\n<br><br>\n-Demonstrate punctuality, reliability and acceptable attendance.\n<br><br>\n-Accept responsibility for assignments.\n<br><br>\nKnowledge, Skills and Abilities:\n<br><br>\n-Must be expert in relational databases\n<br><br>\n-Solid understanding of web services and the http protocol\n<br><br>\n-Must be expert in leveraging tools and frameworks to analyze and summarize data\n<br><br>\n-Must be familiar with manufacturing monitoring and control methods\n<br><br>\n-Prefer experience within electronics assembly industry\n</div> <div>3D Systems is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, color, ethnicity, religion, sex, age, sexual orientation, genetic information, marital status, gender identity or national origin or because he or she is an individual with a disability or a disable veteran, Armed Forces service medal veteran (referred to collectively as \"protected veterans\"). The Company also provides applicants with equal employment opportunities without regard to pregnancy, childbirth, medical needs arising from pregnancy or childbirth, and related medical conditions including, but not limited to, lactation.</div> <div>Primary Location: US-SC-Rock Hill</div><div>Work Locations: <div>USA-SC-Rock Hill-Marine Drive</div> <div>700 Marine Drive</div> <div> Rock Hill 29730</div></div><div>Job Level: Entry Level</div><div>Travel: No</div><div>Type of Position: Employee</div><div>Job Posting: Jul 23, 2018, 2:54:00 PM</div></div> <div><div></div></div></div>"}