{"job title": "Data Scientist *âž", "company": "3m", "city state": "– Maplewood, New Jersey", "rating": "3.9", "job description": "<strong> Job Description:</strong>\n<br><br>\n<strong> 3M is seeking an experienced Data Scientist - Digital Twin Technology for the Corporate Supply Chain Operations &amp; Services organization located in Maplewood, Minnesota. At 3M, you can apply your talents in bold ways that matter. Here, you go.</strong>\n<br><br>\n<strong> Job Summary</strong> :\n<br><br>\nThe ideal candidate for the position of <strong> Data Scientist</strong> is passionate about digging into large amounts of data, both known and unknown, structured and unstructured. This individual must have a strong interest in developing data and analytics solutions to address business problems, can interact effectively with both the technology teams and the business units. You will contribute significantly to the vision of our data environment and our capabilities of analytics and data science.\n<br><br>\n<strong> This position provides an opportunity to transition from other private, public, government or military environments to a 3M career.</strong>\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Conduct a variety of data analytics such as: predictive modeling, statistics, machine learning, data mining, and other data analysis techniques to extract insights from structured and unstructured data.</li> <li> Research and explore data sources, work with data and systems experts to understand the data and what it represents</li> <li> Participate in projects related to machine learning, data mining, signal processing, sensors and electronics and computational statistics</li> <li> Work independently to develop data solutions, understand, break down and explain complex algorithms</li> <li> Use various forecast methods including time series, neural networks and other non-linear methods</li> <li> Implement relevant computational algorithms in software that support 3M business</li> <li> Build strong working relationships and communicate effectively with other engineers and data scientists</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess a Masters degree or higher in a science or engineering discipline from an accredited institution</li> <li> Minimum two (2) years of data analysis experience (e.g. predictive modeling, statistics, machine learning, data mining)</li> <li> Experience in programming in Python and/or R</li> <li> Experience in machine learning and statistical algorithms</li>\n<strong> Preferred Qualifications:</strong>\n<li> Ph.D. in Data Science, Computer Science, Applied Mathematics, Statistics or other directly related field</li> <li> Experience in programming (e.g. R, Python, Matlab, C++)</li> <li> Experience with machine learning tools including SVM, logistic regression, and random forest</li> <li> Experience with deep learning methods and applications</li> <li> SAP experience</li> <li> SQL experience</li> <li> Experience in computer or scientific programming</li> <li> Experience with big data and big data platforms</li> <li> Solid communication skills</li>\n<strong> Location:</strong>  <strong> Maplewood, MN</strong>\n<br><br>\n<strong> Travel: May include up to 10% domestic/international</strong>\n<br><br>\n<strong> Relocation: Is authorized</strong>\n<br><br>\n<strong> Must be legally authorized to work in country of employment without sponsorship for employment visa status (e.g., H1B status).</strong>\n<br><br>\nResponsibilities of this position may include direct and/or indirect physical or logical access to information, systems, technologies subjected to the regulations/compliance with U.S. Export Control Laws.\n<br><br>\nU.S. Export Control laws and U.S. Government Department of Defense contracts and sub-contracts impose certain restrictions on companies and their ability to share export-controlled and other technology and services with certain \"non-U.S. persons\" (persons who are not U.S. citizens or nationals, lawful permanent residents of the U.S., refugees, \"Temporary Residents\" (granted Amnesty or Special Agricultural Worker provisions), or persons granted asylum (but excluding persons in nonimmigrant status such as H-1B, L-1, F-1, etc.) or non-U.S. citizens.\n<br><br>\nTo comply with these laws, and in conjunction with the review of candidates for those positions within 3M that may present access to export controlled technical data, 3M must assess employees' U.S. person status, as well as citizenship(s)."}