{"job title": "Data Scientist - 3m", "company": "3m", "city state": "– Minnesota", "rating": "3.9", "job description": "<strong> Position Description</strong>\n<br><br>\n<strong> Job Summary</strong> :\n<br><br>\n3M's mission is to solve the unsolved, innovatively. As a 3Mer, you will be applying your skills and knowledge to bring science and innovation to life in diverse markets that include healthcare, energy, infrastructure, transportation, and consumer. Our teams are working on some of the worlds toughest problems from preventing infections in healthcare, to readying the world for autonomous transportation. 3Mer's are inventors at heart.\n<br><br>\n3M is seeking a to join the Corporate Research Systems Laboratory (CRSL), which collaborates and innovates with all of 3M's businesses and divisions. The CRSL lab is a collaborative environment with cross-functional teams responsible for designing and developing digital technologies from the hardware and electronics, to algorithms, data analytics, artificial intelligence, internet of things, modeling, simulation, and the software application software layer. A successful candidate will work side-by-side with scientists and engineers in broad disciplines to include electronics, mechanics, software, artificial intelligence and advanced analytics.\n<br><br>\nThe ideal candidate will have exceptional technical expertise and fearless creativity, be curious by nature, have a passion for learning and be comfortable in the ambiguous early-stages of technology development. At 3M, our data scientists, analyze data, create algorithms, and develop real-world solutions leveraging deep learning, machine learning, computer vision and algorithm engineering. In return, they will work with an exceptional team to solve hard problems and learn new skills.\n<br><br>\nThis position provides an opportunity to transition from other private, public, government or military environments to a 3M career.\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Leverage data science expertise to develop new technologies</li> <li> File patent applications, publish and present at appropriate conferences</li> <li> Assist in the development of other technical employees, contract workers, tech aides, etc.</li> <li> Contribute information to the technical strategic planning process.</li> <li> Learn constantly, dive into new areas with unfamiliar technologies, and embrace the ambiguity of research problem solving</li> <li> Analyze, develop algorithms and deploy solutions based on real-world data</li> <li> Ensure 3M's data analytics capabilities are current with the state-of-the-art</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess a Masters degree or higher (completed and verified prior to start) in a science discipline from an accredited institution</li> <li> Minimum five (5) years of combined professional or academic experience in one or more of the following areas: algorithm development, software engineering, machine learning, statistics, and/or numeric methods in a private, public, government or military environment</li>\n<strong> Preferred Qualifications:</strong>\n<li> Training and/or experience in deep learning, machine learning, data science, computer vision, artificial intelligence, statistics, and/or applied mathematics</li> <li> Fluent in one or more programming languages (e.g. Python, MATLAB, C, C++, Java, and/or R)</li> <li> Experience with Azure and AWS cloud services and data analytics tools</li> <li> Experience working in a cross-functional software development environment that includes hardware and software integration</li> <li> Ability to deal with the ambiguity of early-stage scouting and evaluation of new opportunities and the flexibility to change direction as additional information becomes available</li> <li> Self-motivated and self-directed</li> <li> Experience following disciplined development practices</li> <li> Strong scientific and technical acumen, with demonstrated interest and ability to make connections between science/technology and real-world concerns.</li> <li> Excellent communication skills (written example required)</li>\n<strong> Travel:</strong>  May include up to 10% travel domestic/international\n<br><br>\n<strong> Relocation:</strong>  Is authorized\n<br><br>\nThis posting is for a Data Scientist position at 3M Maplewood. 3M anticipates that multiple openings for this position will occur over time, during the next year. Qualified applicants may be considered as Data Scientist openings occur at 3M Maplewood, and 3M will accept applications for up to 1 year from the posting date of this requisition. Applications will be kept open and active until April 20, 2019. After that, the posting will be taken down and applicants will need to apply/re-apply for available open postings at that time."}