{"job title": "Process Data Scientist - 3m", "company": "3m", "city state": "– Minnesota", "rating": "3.9", "job description": "<strong> Position Description</strong>\n<br><br>\n<strong> 3M is seeking a for the Corporate Research Process Laboratory in Woodbury, MN with specialization in Machine Learning, Deep Learning, Computer Vision, and/or Algorithm Engineering. At 3M, you can apply your talent in bold ways that matter. Here, you go.</strong>\n<br><br>\n<strong> Job Summary</strong> :\n<br><br>\nAt 3M, Science Applied to Life isnt just a slogan its what our data scientists do every day. Our data scientists analyze data, create algorithms, and develop real-world solutions for many businesses and markets to help improve lives of people with respiratory issues, enable autonomous transportation, keep workers and soldiers safe, and advance health information systems. Our broad market presence and global reach enables your work to have significant impact. 3M is headquartered in the beautiful Twin Cities of Minnesota, known nationwide for their outdoor recreation opportunities, thriving arts, professional sports, and high quality of life.\n<br><br>\nThe person hired for the position of <strong> Process Data Scientist</strong> will work in the Measurement and Process Analytics group in 3M Corporate Research Process Laboratory. The main responsibility will be developing and applying techniques in the areas of machine learning, deep learning, artificial intelligence, and/or computer vision for sensors, inspection systems, lab and manufacturing processes and products that create new opportunities for 3M and will develop digital manufacturing solutions, capitalizing on 3Ms unique materials and processes, advanced technologies, and global reach.\n<br><br>\nThe Measurement and Process Analytics group is responsible for designing, developing and integrating novel inspection and measurement technologies for 3M manufacturing and process/product development. This position requires working with multi-disciplinary teams and the ability to analyze a diverse range of data sets. The candidate will have a high degree of initiative to develop and execute a project plan and must have the ability to identify and propose new project opportunities and set directions for creating a technology platform based on data analytics. The Data Scientist position will contribute to the development of new measurement and inspection capabilities in support of the complete range of 3M products and processes. The candidate must have superior inter-personnel skills, be able to inspire and motivate team members, and influence the invention of new technologies that impact 3M businesses.\n<br><br>\n<strong> This position provides an opportunity to transition from other private, public, government or military environments to a 3M career.</strong>\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Leverage expertise to develop and lead new technologies for data analytics in manufacturing systems, providing new growth opportunities in addition to supporting existing 3M products and businesses</li> <li> Collaborate with research teams in corporate research and in business labs as well as global teams to build capabilities and applications to solve emerging challenges</li> <li> Create highly custom algorithms seeking to capitalize on value in various datasets; images, time series and multivariate inputs</li> <li> Develop and implement valuable data analytics algorithms such as predictive modeling, statistics, machine learning, signal processing, computer vision techniques in software to support 3M businesses</li> <li> Collaborate with a team of physicists, engineers, chemists on both theoretical and practical projects that will use his/her scientific, mathematical and computational skills to drive new-to-the-world technology development and introduction</li> <li> Provide strong understanding of internal business segment (stakeholders); present results in a clear and concise manner to multidisciplinary teams and management, making recommendations for change and extending capability by implementing potential advancements</li> <li> Create examples, prototypes and demonstrations, document intellectual property, file patent applications, publish, and present at appropriate conferences</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess a Masters degree in a science or engineering discipline (completed and verified prior to start) from an accredited institution</li> <li> Minimum five (5) years of experience in process and/or manufacturing systems data analytics (e.g. predictive modeling, machine learning, data mining, image processing, computer vision) in a private, public, government or military environment</li> <li> Minimum three (3) years of experience in computer programming</li>\n<strong> Preferred Qualifications:</strong>\n<li> Possess a Ph.D. degree or post-doctoral fellowship in Computer Science, Electrical Engineering, Data Science, Software Engineering, Applied Physics, Mechanical Engineering or related discipline from an accredited institution</li> <li> Minimum of five (5) years of experience in deep learning, machine learning, data science, computer vision, and/or artificial intelligence through thesis work, internships, or industry or national lab employment</li> <li> Fluent in one or more programming languages (e.g. Python, MATLAB, C, C++, Java, and/or R)</li> <li> Experienced with Azure and AWS cloud services and data analytics tools</li> <li> Strong scientific and technical acumen, with demonstrated interest and ability to make connections between science/technology and real-world concerns</li> <li> Ability to deal with the ambiguity of early-stage scouting and evaluation of new opportunities and the flexibility to change direction as additional information becomes available</li> <li> Demonstrated scientific excellence as evidenced by publications and presentations</li> <li> Self-motivated and self-directed</li> <li> Strong problem-solving skills</li> <li> Excellent communication skills (oral, written, and presentation)</li>\n<strong> Travel:</strong>  <strong> May include up to 10%</strong>  <strong> domestic/international</strong>\n<br><br>\n<strong> Relocation: Is authorized</strong>\n<br><br>\n<strong> Must be legally authorized to work in country of employment without sponsorship for employment visa status (e.g., H1B status).</strong>"}