{"job title": "UR - Data Scientist", "company": "3m", "city state": "– Maplewood, New Jersey", "rating": "3.9", "job description": "<strong> Job Description:</strong>\n<br><br>\n<strong> 3M is seeking Data Scientists with specialization in Machine Learning, Deep Learning, Computer Vision, and/or Algorithm Engineering for our Research and Development (R&amp;D) laboratories located in Maplewood, Minnesota. At 3M, you can apply your talent in bold ways that matter. Here, you go.</strong>\n<br><br>\n<strong> Job Summary:</strong>\n<br><br>\nAt 3M, Science Applied to Life isnt just a slogan its what our data scientists do every day. Our data scientists help improve lives of people with respiratory issues, enable autonomous transportation, keep workers and soldiers safe, and advance health information systems. Our broad market presence and global reach enables your work to have significant impact. 3M is headquartered in the beautiful Twin Cities of Minnesota, known nationwide for their outdoor recreation opportunities, thriving arts, professional sports, and high quality of life.\n<br><br>\nThe person hired for the position of <strong> Data Scientist</strong> will develop technologies in the areas of machine learning, data science, deep learning, artificial intelligence, or computer vision that create new opportunities for 3M and will develop digital products and solutions, capitalizing on 3Ms unique materials, advanced technologies, and global reach. At 3M, our data scientists and engineers analyze data, create algorithms, and develop real-world solutions for many businesses and markets, including health information, worker safety, digital oral care, power grid, transportation, novel inspection and measurement processes for manufacturing, and many more.\n<br><br>\n<strong> Primary Responsibilities</strong> include but are not limited to the following:\n<li> Leverage expertise to develop and lead new data analytics technologies for product development or for manufacturing systems, providing new growth opportunities in addition to supporting existing 3M products and businesses</li> <li> Work with global teams to implement impactful solutions in 3Ms diverse markets</li> <li> File patent applications, publish, and present at appropriate conferences</li> <li> Collaborate with research teams in corporate research and in business labs to build capabilities and applications to solve emerging challenges</li> <li> Analyze data, develop algorithms, and deploy solutions based on real-world data</li>\n<strong> Basic Qualifications:</strong>\n<li> Possess or in the final year of pursuing a M.S. or Ph.D. degree, or a Post-Doctoral fellow, in a science or engineering discipline from an accredited university</li>\n<strong> Preferred Qualifications:</strong>\n<li> Possess or in the final year of pursuing a M.S. or Ph.D. degree or post-doctoral fellowship in Computer Science, Electrical Engineering, Data Science, Cognitive Science, Software Engineering, Applied Physics, Applied Mathematics, or related discipline from an accredited university</li> <li> Training and/or experience in deep learning, machine learning, data science, computer vision, artificial intelligence, statistics, and/or applied mathematics through thesis work, internships, or industry or national lab employment</li> <li> Expertise in computer vision sub-disciplines such as: image analysis, 3D computer vision, embedded and real-time computer vision, video, analysis and reduction of high-dimensional data, and 3D sensor data (ToF, Stereo, Structured Light, Lidars).</li>  <li> Fluent in one or more programming languages (e.g. Python, MATLAB, C, C++, Java, and/or R)</li> <li> Experienced with Azure and AWS cloud services and data analytics tools</li> <li> Strong scientific and technical acumen, with demonstrated interest and ability to make connections between science/technology and real-world concerns</li> <li> Ability to deal with the ambiguity of early-stage scouting and evaluation of new opportunities and the flexibility to change direction as additional information becomes available</li> <li> Demonstrated scientific excellence as evidenced by publications and presentations</li> <li> Self-motivated and self-directed</li> <li> Strong problem-solving skills</li> <li> Excellent communication skills (oral, written, and presentation)</li>\n<strong> Location:</strong>  Maplewood, MN\n<br><br>\n<strong> Travel:</strong>  May include up to 10% domestic travel\n<br><br>\n<strong> Relocation:</strong> Is authorized\n<br><br>\nResponsibilities of this position may include direct and/or indirect physical or logical access to information, systems, technologies subjected to the regulations/compliance with U.S. Export Control Laws.\n<br><br>\nU.S. Export Control laws and U.S. Government Department of Defense contracts and sub-contracts impose certain restrictions on companies and their ability to share export-controlled and other technology and services with certain \"non-U.S. persons\" (persons who are not U.S. citizens or nationals, lawful permanent residents of the U.S., refugees, \"Temporary Residents\" (granted Amnesty or Special Agricultural Worker provisions), or persons granted asylum (but excluding persons in nonimmigrant status such as H-1B, L-1, F-1, etc.) or non-U.S. citizens.\n<br><br>\nTo comply with these laws, and in conjunction with the review of candidates for those positions within 3M that may present access to export controlled technical data, 3M must assess employees' U.S. person status, as well as citizenship(s).\n<br><br>\nThe questions asked in this application are intended to assess this and will be used for evaluation purposes only. Failure to provide the necessary information in this regard will result in our inability to consider you further for this particular position. The decision whether or not to file or pursue an export license application is at 3M Company's sole election."}