{"job title": "Senior Data Engineer ?", "company": "3M Companies", "city state": "– Maplewood, MN", "rating": "3.9", "job description": "At 3M, we apply science in collaborative ways to improve lives. With $32 billion in sales, our 91,000 employees connect with customers all around the world.\n<br><br>\n3M has a long-standing reputation as a company committed to innovation. We provide the freedom to explore and encourage curiosity and creativity. We gain new insight from diverse thinking, and take risks on new ideas.\n<br><br>\nHere, you can apply your talent in bold ways that matter.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\n3M is seeking a Senior Data Engineer for the IT Division located in Maplewood, MN. At 3M, you can apply your talent in bold ways that matter. Here, you go.\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nThe person hired for the position of Senior Data Engineer will be responsible for building, operating and maintaining Advanced Analytics Applications on C3 Platform.\n<br><br>\nThis position provides an opportunity to transition from other private, public, government or military environments to a 3M career.\n<br><br>\nPrimary Responsibilities include but are not limited to the following:\n\n\n<ul>\n<li>Collaborate with M&amp;SCS Digitization &amp; Advanced Analytics team to:</li>\n<li>Understand the requirements, design, and build canonicals and data pipelines on C3 Platform</li>\n<li>Build Advanced Analytics Applications on C3 platform to support M&amp;SCS strategies</li>\n<li>Maintain and support of the applications built on C3 platform</li>\n<li>Build Automation tools to improve cycle time</li>\n<li>Accountable for owning software deliverables and proven ability to meet the deadlines</li>\n<li>Partner with IT Security, Compliance &amp; Cloud COE teams to design and implement secure applications</li>\n<li>Leverage Agile, CI/CD and DevOps methodologies to deliver high quality product on-time</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>Possess a Bachelor's degree or higher (completed and verified prior to start) from an accredited institution</li>\n<li>Minimum seven (7) years of Software Development Lifecycle experience in a private, public, government or military environment</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Experience developing commercial software using Object Oriented Technologies</li>\n<li>Minimum three (3) years of Database/Data Warehouse experience</li>\n<li>Minimum five (5) years of experience with Java, JavaScript, C or C++ experience</li>\n<li>Minimum two (2) years of experience with the C3 platform</li>\n<li>Experience in DevOps</li>\n<li>Experience working in Scrum teams</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Excellent interpersonal and team collaboration skills</li>\n<li>Experience working in large, multi-faceted teams</li>\n</ul>\n\nLocation: Maplewood, MN\n<br><br>\nTravel: May include up to 20% domestic/international\n<br><br>\nRelocation: Is not authorized\n<br><br>\nMust be legally authorized to work in country of employment without sponsorship for employment visa status (e.g., H1B status).\n<br><br>\nLearn more about 3M's creative solutions to the world's problems at www.3M.com or on Twitter @3M.\n<br><br>\n3M is an equal opportunity employer. 3M will not discriminate against any applicant for employment on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status.\n<br><br>\nPlease note: your application may not be considered if you do not provide your education and work history, either by: 1) uploading a resume, or 2) entering the information into the application fields directly.\n<br><br>\n3M Global Terms of Use and Privacy Statement\n<br><br>\nCarefully read these Terms of Use before using this website. Your access to and use of this website and application for a job at 3M are conditioned on your acceptance and compliance with these terms.\n<br><br>\nPlease access the linked document by clicking here, select the country where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms."}