{"job title": "Data Scientist", "company": "605", "city state": "– New York, NY", "rating": "NA", "job description": "At 605 we are engineers, analysts, data scientists, media experts, marketing strategists and political operatives. Our team of data scientists pioneered the field of TV data analytics. We offer unique, independent audience measurement and analytics to build better marketing and programming initiatives within the media and entertainment industries.\n<br><br>\nThe Data Scientist role is a mid-level position in 605’s data science group, the more technical/backend-focused subgroup of 605’s Analytics team. All of the Analytics team shares a baseline knowledge of statistics and machine learning, R and/or python, and familiarity with relational databases and the scale/variety of 605’s data assets. In contrast to the client-facing side of Analytics, the data science side brings to the table some deeper technical skills, including:\n<ul>\n <li>Hands-on experience with industry-standard predictive modeling solutions such as scikit-learn, xgboost, Spark ML, and H2O.ai in a production setting</li> <li>Familiarity with diverse methods for supervised learning, unsupervised learning, ETL pipelines in general</li> <li>A more nuanced understanding of cloud-based (Amazon Web Services) computing resources/infrastructure, especially the need for and methods of parallelization for analytics tasks</li> <li>Experience in designing and implementing wrapper/tool/utility functions for automated tasks, to be used by less-technical Analytics team members, and organizing them into distributable, regularly maintained and tested R/python packages</li> <li>Proficiency with source code management (git) and related code development/review workflows, as well as continuous integration tools like Travis or Jenkins</li>\n</ul>\nA data scientist will generally be involved in at least two different projects at any given time, managed by either the Sr. Director of Data Science or by the Sr. Director of Analytics, and the data scientist will work alongside other data scientists or analysts. Analytics projects produce both client-facing deliverables as well as internal tools/datasets consumed by various teams at 605 (Analytics itself, Engineering, and Client Solutions).\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n<strong>Basic Requirements:</strong>\n<ul>\n <li>Masters degree in a quantitative, scientific, or engineering field, or &gt; 2 years experience in a data-related work environment</li> <li>Intermediate-to-advanced level proficiency in either R or Python</li> <li>Knowledge of modeling algorithms for supervised learning</li> <li>Familiarity with Linux/Unix operating system, shell environments and using remote machines</li> <li>Beginner-to-intermediate level proficiency of postgres SQL</li> <li>Familiarity with git and/or github.com, or any other version control framework</li>\n</ul>\n<strong>Preferred Skills:</strong>\n<ul>\n <li>Doctoral degree in a quantitative, scientific, or engineering field, or &gt; 4 years experience in a data-heavy work environment</li> <li>Experience with AWS services (Redshift / S3 / EC2)</li> <li>Familiarity with Docker containers</li> <li>Proficiency with Apache Spark (via Scala, Python or Java)</li> <li>Past work with survey data, demographic and consumer data, and/or TV viewing data</li> <li>Knowledge of information security best practices</li> <li>Advanced knowledge of postgres SQL</li>\n</ul>\n<strong>Benefits</strong>\n<ul>\n <li>Comprehensive health and dental insurance for employees and their families</li> <li>Life insurance</li> <li>401k with match, eligible for match after one year</li> <li>Pre-tax flexible compensation plan for medical, transit, parking or dependent care expenses</li> <li>15 paid vacation days</li> <li>Sick days—if you’re sick, you stay home</li> <li>Work-from-home Fridays</li> <li>A kitchen stocked with sodas, snacks, yogurt and other goodies</li> <li>A tight-knit startup community who likes to eat! We celebrate everyone’s birthdays, have frequent team lunches, and do events in and out of the office</li> <li>605 is an active participant in conferences</li>\n</ul>\n<strong>EEO STATEMENT</strong>\n<br><br>\nAt 605, we’re just as passionate about diversity as we are about pioneering the field of TV data analytics. We are committed to cultivating an environment of mutual respect and equal opportunity. All hiring and advancement decisions are made on the basis of qualification, merit, and business need."}