{"job title": "Data Scientist", "company": "6sense", "city state": "– San Francisco, CA", "rating": "4.6", "job description": "Role: Data Scientist\n<br>\nRole Description<br><br>6sense is a Predictive Intelligence Engine that is reimagining how B2B companies do sales and marketing. We work with big data at scale, advanced machine learning and predictive modeling to find buyers and predict what they will purchase, when and how much.\n<br><br>\nThe data science team is the core of 6sense engineering. The drive of our visionary CEO and the quality of our work has lead to unprecedented partnerships with companies like Salesforce, Cisco, Dell and Lenovo. Salesforce was so happy with our results that they invested in us.\n<br><br>\nOur data scientists are not optimizing software; they are building models, big data manipulation techniques and APIs that are the core of the 6sense product. Our models inform smart-email campaigns, website personalization, ad optimization, inside sales call lists and go-to-market messaging. In all we influence how businesses spend millions in marketing and sales budgets.\n<br><br>\nWe're growing quickly and want to expand our data science family. We are looking for outstanding minds and bright personalities. The bar is high, but <strong>our hiring process is simple</strong>:\n\n<ul>\n<li>Do well on a short take-home test</li>\n<li>Work with us in our SoMa office to solve a real problem and communicate the results</li>\n<li>Hang out and have fun with our team</li>\n</ul>\n<strong>As a data scientist at 6sense you'll have the opportunity to:</strong>\n<br><br>\n- Work with some of the largest data sets in enterprise business.\n<br><br>\n- Lead the way in leveraging unstructured data for predictive modeling and decision-making.\n<br><br>\n- Help build a predictive product and inform features at the ground level.\n<br><br>\nWe are looking for someone with minimum of 2 years of work experience. Advanced degree is preferred.\n<br><br>\n<strong>If you join our small team you'll:</strong>\n<br><br>\n- Have the opportunity to advance quickly and build your career trajectory as one of the first 20 tech hires at a fast growing startup.\n<br><br>\n- Enjoy equity and influence in a fast-growing and dynamic pre-IPO company\n<br><br>\n- Work in a beautiful New York loft-style house in the heart of the SoMa (Hurry before we outgrow it!)"}