{"job title": "Product Manager - Data Services and Tools", "company": "7Park Data", "city state": "– New York, NY, United States", "rating": "3.8", "job description": "7Park Data, a venture-backed startup, is the leading data intelligence provider to businesses around the world. You will be joining a passionate team focused on developing data services to enable/power financial platforms and corporate giants.\n<br><br>\nIdeal candidates have a bias toward action and can break down complex problems into steps that drive product development.\n<br><br>\nCompensation package: includes highly competitive salary, bonus and equity.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Identify opportunities to apply various data transformation services within our clients workflow and solutioning with them to execute</li> <li>Develop, prioritize, and own the roadmap of data services that could be leveraged internally as well as extended out to meet broader market needs</li><li>Partnering with client facing teams to fully understand our clients business processes front to back, and working together to discover data and system gaps that inhibit the achievement of business strategy</li><li>Formulating and executing plans to close those gaps and converting business processes and apps towards using those solutions. Holistically roadmapping the tools to fit business needs, as well as coordinating with client facing and other engineering teams to develop these solutions</li><li>Educate and inform customers and internal teams on product capabilities and timelines.</li><li>Lias between sales, marketing, customer success and engineering teams to move the product forward and ensure customer success throughout the customer lifecycle.</li><li>Break down complex problems into steps that drive product development.</li><li>Produce requirements documentation to guide the engineering team in creation of products and features.</li><li>Produce internal and external product documentation.</li><li>Be an active project management and QA participant.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Bachelor's degree</li><li>Depth of knowledge on data service providers in the financial industry.</li><li>Excellent communicator - verbal, written, and listening.</li><li>Ability to break down complex problems into manageable topics.</li><li>Minimum of 5 years of product management experience creating data services.</li><li>Minimum of 3 years of experience in a customer facing role.</li><li>Knowledge of data science algorithms and their applications.</li><li>Experience visualizing data in Excel or a comparable graphing tool.</li><li>Experience tracking product development with JIRA or a comparable project management tool.</li><li>Strong SQL query skills and in depth knowledge of REST APIs.</li><li>Meticulous attention to detail and commitment to producing quality products</li><li>Flexible and can adapt to changing demands of a startup environment.</li>\n</ul>\n<strong>About Our Company</strong><br>\n<div><div><div><div>7Park Data transforms data to revolutionize business decisions.\n<br><br>\nLeveraging machine learning, entity extraction and linking, and predictive models, we transform unstructured information into contextualized Leading Performance Indicators for thousands of public and private companies.Our clients are the most sophisticated investment firms and Fortune 500 corporations who depend on 7Park Data to guide benchmarking, forecasting and product development.\n<br><br>\n7Park Data offers the Avenue Suite, a collection of dashboards providing clients and partners with on- demand access to our report library, commentary from domain experts, and custom queries and visualizations\n<br><br>\nAvenue I/O, our developer site, is a suite of APIs, SDKs and tools for data scientists, quantitative analysts, and data owners who want access to cleansed, mapped, normalized data and user-level panels to build their own models. Avenue I/O provides open source tools to quickly and easily build analytical products powered by our APIs.\n<br><br>\n7Park Data was founded in 2012 and is headquartered in New York City.</div></div></div></div>\n<br>For more information, please visit www.7parkdata.com."}