{"job title": "Lead Data Scientist, Machine Learning", "company": "84.51°", "city state": "– Chicago", "rating": "4.2", "job description": "<strong>Who We Are</strong>\n<br><br>\nIn a digital economy data is the 21st century gold rush. Imagine working for a big data company with 10 petabytes of data at your fingertips. A company where analysts and scientists derive insights from 35+ terabytes of new data every week. 84.51° is a wholly owned subsidiary of The Kroger Company. Our data is sourced from consumer transactions and behavior across 24 banners, 38 states and 62 million households. We are the research, development and innovation arm of the nation’s third largest retailer. We develop advanced data science solutions putting the customer at the center of all of our decisions.\n<br><br>\n<strong>General Description</strong>\n<br><br>\nAn exciting technical analytics role exists within a specialized function, whose objective is to enable innovation and accelerate the use of best methods and technologies in our evolving big data environment. This specialized team has been tasked with: developing strategy, innovation, evolving best practices, and accelerating the Analysis community into future science and technology environment.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Effectively own the relationship with stakeholders, ensuring high levels of engagement and the successful delivery of solutions and capabilities, where solution complexity appropriately fit the business application.</li>\n<li>Staying up to date with progress made with academic and industry best practices, while proactively teaching, leading, and advising the rest of the function on new techniques or solutions.</li>\n<li>Collaborate with 84.51° data and software engineers to enable deployment of sciences and technologies that will scale across the Kroger ecosystem.</li>\n<li>Develop high-level expertise in an open source language (e.g., R, Python, Julia, etc.) to the level necessary to provide support to inexperienced analysts.</li>\n<li>Identify and evaluate emerging / cutting edge, open source, data science / machine learning libraries / big data platforms (e.g. XGBoost, H2Oai, Spark, Hadoop etc.).</li>\n<li>Adhere to stringent quality assurance, documentation standards, using version control and code repositories (e.g., Git, GitHub, Markdown).</li>\n<li>Consulting on projects to enable data science solutions using best practices and technology.</li>\n</ul>\n<strong>Qualifications, Skills, and Experience</strong>\n\n<ul>\n<li><strong><u>4 to 5 years of experience using advanced algorithms, programming languages, or technologies in the development of technical analytics solutions or capabilities.</u></strong></li>\n<li>Experience developing analytical solutions using statistical methods and machine learning algorithms.</li>\n<li>Experience with data wrangling, data cleaning and prep, dimensionality reduction.</li>\n<li>Experience querying data from relational databases using SQL.</li>\n<li>Experience with Big Data concepts, tools, and architecture (e.g. Hadoop, Pig, Hive, Spark, Sparkling Water).</li>\n<li>Experience using R, Python, or other similar open source statistical software.</li>\n<li>Ability to create computationally efficient solutions.</li>\n<li>Data visualization skills and ability to present technical solutions to non-technical audience.</li>\n<li>Strong interpersonal and communication skills.</li>\n<li>Strong analytical, creative problem-solving and decision-making skills.</li>\n<li>Strong business acumen; grocery and/or retail experience is a plus.</li>\n<li>Passionate about data, analysis and insights.</li>\n<li>Welcomes and embraces change.</li>\n<li>Ability to work fast yet accurately.</li>\n<li>An openness and willingness to try new things and to fail.</li>\n<li>Ability to work in a highly collaborative environment.</li>\n</ul>\n<strong>Education</strong>\n<br><br>\nBachelor’s degree or equivalent in mathematics, statistics, computer science or related field"}