{"job title": "Lead Data Scientist, Insights", "company": "84.51°", "city state": "– Chicago", "rating": "4.2", "job description": "<strong><u>Who We Are</u></strong>\n<br><br>\nIn a digital economy data is the 21st century gold rush. Imagine working for a Big Data company with 10 Petabytes of data at your fingertips. A company where Analysts and Scientists derive insights from 35+ Terabytes of new data every week.\n<br><br>\n84.51° is a wholly owned subsidiary of The Kroger Company. Our data is sourced from consumer transactions and behavior across 24 banners, 38 states and 62 Million households. We are the research, development and innovation arm of the Nation’s second largest retailer.\n<br><br>\n<strong><u>Analysis</u></strong>\n<br><br>\nWe are a community of analysts – we are researchers in search of the customer story. We are the voice of the customer. Customers share their story with us each and every day, and it is our job to tell their story. Our Analysis team is known for solving client and customer problems, employing the most appropriate <strong>statistical</strong> and <strong>mathematical analytic</strong> approaches.\n<br><br>\nWe expect all analysts to be hands on with respects to the analysis of a retailer database, using the full suite of 84.51° technical tools – <strong>Python,</strong> <strong>SAS, SQL, R, Excel,</strong> and other specific internal tools – to create timely, relevant, and actionable insights.\n<br><br>\n<strong>Position Details:</strong>\n<br><br>\nAs <strong>Lead Data Scientist - Insights</strong> you will be responsible for:\n\n<ul>\n<li>Owning the relationship with the client, ensuring high levels of client engagement and the successful delivery of client projects.</li>\n<li>Lead shaping and delivering against the client work plan, ensuring that best practice and innovative ideas are adopted.</li>\n<li>Scoping and management of projects from beginning to end, including all commercial elements to ensure that projects are delivered on time, within budget and to brief specification.</li>\n<li>Working closely with stakeholders to ensure sound knowledge of client objectives and customer insight, to subsequently design best-in-class solutions.</li>\n<li>Proactively manage the development of best practice and knowledge management, and champion the capture and sharing of knowledge across the analytical community.</li>\n<li>Guiding and directing analysts in realizing efficiencies and creating standard processes, such as automation of code lines, removing manual tasks, or re-engineering existing processes to make them more efficient.</li>\n<li>Role modeling best practices with respects to analytical behaviors, specifically project management, Quality Assurance, and disk space management to ensure brilliant client work is delivered on time.</li>\n</ul>\n<strong>Required Experience:</strong>\n\n<ul>\n<li>3-5 years of experience in consulting or professional services working directly with CPG clients or partners</li>\n<li>3-5 years of experience in extracting insights from large databases, translating market research into actionable solutions and presenting findings and recommendations to clients</li>\n<li><strong><u>3 to 5 years of experience using analytical software packages such as SAS, SQL and R for analytical applications</u></strong></li>\n<li>Strong interpersonal and communication skills</li>\n<li>Strong analytical, problem-solving and decision-making skills</li>\n<li>Excellent verbal, written, presentation and consultation skills are required</li>\n<li>Strong business acumen to link analysis to business impact</li>\n<li>Excellent attention to detail and organization skills</li>\n<li>Ability to work in a collaborative environment</li>\n<li>Self-motivated</li>\n</ul>\n<strong><u>Education</u></strong>\n<br><br>\nBachelor’s degree or equivalent in statistics, analytics, economics or business"}