{"job title": "Lead Data Engineer", "company": "84.51°", "city state": "– Cincinnati", "rating": "4.2", "job description": "<p></p><p></p><p></p><p>About Us<br>We are a full stack data science company and a wholly owned subsidiary of The Kroger Company. We own 10 Petabytes of data, and collect 35+ Terabytes of new data each week sourced from 62 Million households. As a member of our engineering team you will use various cutting edge technologies to develop applications that turn our data into actionable insights used to personalize the customer experience for shoppers at Kroger. We use agile development methodology, starting with Big Room Planning bringing everyone into the planning process to build scalable enterprise applications. <br>What you’ll do<br>As a data developer, we develop strategies and solutions to ingest, store and distribute our big data. Our developers use Scala, Hadoop, Spark, Hive, JSON, and SQL in 10 week long scrum teams to developer the products, tools and features.</p><p>We are seeking Data Developers at multiple levels of experience. Outlined below, you will find the details of our Data Developer position and Senior Data Developer position. </p><p>Data Developer <br>Responsibilities<br>Take ownership of features and drive them to completion through all phases of the entire 84.51° SDLC. This includes external facing and internal applications as well as process improvement activities such as:<br>• Participate in design of Hadoop and SQL based solutions<br>• Perform development of Hadoop and SQL based solutions<br>• Perform unit and integration testing<br>• Partner with senior resources, gaining insights<br>• Provide mentoring to junior resources<br>• Participate in retrospective reviews<br>• Participate in the estimation process for new work and releases<br>• Bring new perspectives to problems<br>• Be driven to improve yourself and the way things are done</p><p>Requirements<br>• Bachelor’s degree typically in Computer Science, Management Information Systems, Mathematics, Business Analytics or another technically strong program.<br>• 2+ years of proven professional data development experience<br>• Understanding of Agile Principles (Scrum)<br>• Proficient with relational data modeling <br>• 2+ years developing with SQL (Oracle, SQLServer)<br>• 2+ years developing with Hadoop/HDFS<br>• Full understanding of ETL concepts <br>• Exposure to data warehousing concepts <br>• Exposure to VCS (Git, SVN)<br>• 1+ year developing experience with either Java, Scala or Python<br>• Experience with Spark</p><p>Preferred Skills – Experience in the following is a plus<br>• Exposure to NoSQL (Mongo, Cassandra)<br>• SOA<br>• Junit<br>• CI/CD</p><p><br>Senior Data Developer<br>Responsibilities<br>Take ownership of features and drive them to completion through all phases of the entire 84.51° SDLC. This includes external facing and internal applications as well as process improvement activities such as:<br>• Lead design of Hadoop and SQL based solutions<br>• Perform development of Hadoop and SQL based solutions<br>• Perform unit and integration testing<br>• Collaborate with senior resources to ensure consistent development practices<br>• Provide mentoring to junior resources<br>• Participate in retrospective reviews<br>• Participate in the estimation process for new work and releases<br>• Bring new perspectives to problems<br>• Be driven to improve yourself and the way things are done</p><p>Requirements<br>• Bachelor’s degree typically in Computer Science, Management Information Systems, Mathematics, Business Analytics or another technically strong program.<br>• 5+ years proven ability of professional data development experience<br>• Strong understanding of Agile Principles (Scrum)<br>• Proficient with relational data modeling <br>• 5+ years proven ability of developing with SQL (Oracle, SQLServer)<br>• 5+ years proven ability of developing with Hadoop/HDFS<br>• Full understanding of ETL concepts <br>• Full understanding of data warehousing concepts <br>• Exposure to VCS (Git, SVN)<br>• 3+ year developing experience with either Java, Scala or Python<br>• Experience with Spark</p><p>Preferred Skills – Experience in the following<br>• Exposure to NoSQL (Mongo, Cassandra)<br>• SOA<br>• Junit<br>• CI/CD</p><p></p><p></p><p></p><p></p><p>84.51° is an Equal Opportunity Employer.</p>"}