{"job title": "Data Scientist", "company": "Abbott", "city state": "– USA-California-San Diego", "rating": "2.9", "job description": "<strong>Data Scientist</strong>\n<br><br>\nAlere\n<br>\nis now part of Abbott’s Diagnostics family of businesses, bringing together\n<br>\nexceptional teams of experts and industry leading technologies. As we embark on\n<br>\nthis exciting journey, the <strong>Abbott Rapid Diagnostic Division (ARDx)</strong> is\n<br>\nsearching for a new member to join our <strong>Research &amp;\n<br>\nDevelopment</strong> team. The <strong>Data Scientist</strong> will be an integral contributor to the team’s success in launching\n<br>\nnew diagnostic technologies. Current and future projects are classified as high\n<br>\nprofile to the business and in later development phases, with several early\n<br>\nstage projects about to take off. This is an ideal time to join!\n<br><br>\nThis\n<br>\nis a great opportunity to leverage your strong technical expertise while\n<br>\ngrowing your career with a premier industry leader. If you seek a dynamic role\n<br>\nwhere your contributions will pave the way in developing exciting new products\n<br>\nthen come and work with us!\n<br><br>\n<strong> Core Job\n<br>\nResponsibilities</strong>\n\n<ul>\n\n <li>Support\n<br>\n R&amp;D to capture, interpret, understand, and operationalize advanced\n<br>\n analytics</li> \n\n<li>Provide\n<br>\n data modeling, mining, pattern analysis, data visualization and machine\n<br>\n learning solutions</li>\n<li>Apply\n<br>\n design of experiment methodology to understand technology variation and\n<br>\n improve product performance</li>\n<li>Apply\n<br>\n advanced statistical procedures, models and graphics on a wide array of\n<br>\n data sets</li>\n<li>Provide\n<br>\n root cause analysis including troubleshooting of pre- and post-market\n<br>\n products</li>\n<li>Define\n<br>\n experimental plans, pilot exploratory and analytical phases on\n<br>\n experimental data</li>\n<li>Create\n<br>\n and maintain documentation for data analyses used to develop\n<br>\n specifications for various platforms</li>\n<li>Provide\n<br>\n continuous improvement of data analysis tools and methods used to evaluate\n<br>\n data sets and set specifications</li>\n<li>Work\n<br>\n on all stages of projects from understanding data to implementing solutions\n<br>\n into products, including determining testing stages, applying appropriate\n<br>\n statistical tools, defining sampling size, and setting specifications</li>\n<li>Prepare\n<br>\n reports summarizing the results of data analysis</li>\n<li>Collaborate\n<br>\n with project teams in the design and development of protocols, statistical\n<br>\n analysis plans, data management plans, compliance of data analyses and the\n<br>\n reporting of results</li>\n<li>The\n<br>\n individual may travel occasionally per needs of the assigned project</li>\n</ul>\n<strong>Position Accountability / Scope</strong>\n\n<ul>\n\n <li>The\n<br>\n individual is responsible for the development and/or implementation of\n<br>\n statistical methods and tools, data modeling and data analytics designed\n<br>\n to evaluate and analyze data sets generated across various platforms\n<br>\n within R&amp;D</li>\n<li>The\n<br>\n individual will work as part of a cross-functional team ecompassing\n<br>\n R&amp;D, Product Development, Operations, Quality, Regulatory and Project\n<br>\n Management to deliver statistical and analytics solutions</li>\n<li>Previous experience in the\n<br>\n area of molecular diagnostics is a plus</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\nAn advanced degree (minimum Master\n<br>\nof Science) in computer science, statistics, or mathematics, or in biochemistry\n<br>\nor biology with a strong background in computer science, statistics or\n<br>\nmathematics with at least 3 years of experience at a startup or mid- to\n<br>\nlarge-sized corporation is required. The candidate must have experience in statistical\n<br>\nanalysis, data modeling and/or advanced analytics in healthcare or another\n<br>\nregulated industry.\n<br><br>\nThe candidate must have expert\n<br>\nknowledge in at least 2 of the following:\n\n<ul>\n\n <li>Data\n<br>\n analytics</li>\n<li>Data\n<br>\n modeling</li>\n<li>Inferential\n<br>\n statistics</li>\n<li>Predictive\n<br>\n analytics</li>\n<li>Design\n<br>\n of experiment</li>\n</ul>\nThe candidate must have working\n<br>\nknowledge in JMP, Prism, Minitab, or SAS.\n<br><br>\nPrior experience with any of the\n<br>\nfollowing is a plus: R, Python, Streaming analytics, Machine Learning"}