{"job title": "Associate Scientist I, Cancer Biology", "company": "AbbVie", "city state": "– South San Francisco, CA", "rating": "3.7", "job description": "Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products Imbruvica, Venclexta, and Empliciti and a pipeline containing multiple promising new molecules that are being studied in nearly 200 clinical trials in 19 different types of cancer.\n<br><br>\nAbbVie is expanding its oncology hub on the West Coast, with three sites in the San Francisco Bay Area (Redwood City, South San Francisco, and Sunnyvale) focused on the discovery and development of noveloncology therapies. More than 1,000 AbbVie scientists, statisticians, clinicians, and product developers with strong entrepreneurial roots work across these three sites. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. This position will be based at Stemcentrx, AbbVies South San Francisco oncology site.\n<br><br>\nAbbVie Stemcentrx in South San Francisco is comprised of a multi-disciplinary team of world-class scientists is developing novel targeted therapeutics in oncology, with a specific focus on antibody-drug conjugates and other antibody-based approaches. We are looking for an Associate Scientist / Scientist with experience in cell culture, tissue processing, flow cytometry, as well as standard molecular biology and biochemical techniques. Above all, we are looking for a highly motivated and collaborative individual with a passion for oncology research, who enjoys working in a fast-paced and highly dynamic working environment.\n<br><br>\nKey Responsibilities Include:\n<ul>\n<li>Manage and expand PDX bank and cell line collection</li>\n<li>Test novel drugs with a combination of in vitro and in vivo assays</li>\n<li>Perform daily FACS-based analysis of PDX tumors</li>\n<li>Perform cell-based or biochemical assays on a tight schedule</li>\n<li>Maintain flow cytometers</li>\n<li>Analyze and report data regularly at group meetings</li>\n</ul>\n\n<br><br>Basic:\n<ul>\n<li>BS degree and relevant experience in a research setting.</li>\n<li>Technical expertise in cell and molecular biology and/or cancer biology</li>\n<li>Experience with mouse models of cancer, including PDX (Patient Derived Xenograft) models preferred</li>\n<li>Excellent laboratory, record keeping, data analysis, and critical thinking skills.</li>\n<li>Ability to plan, execute, and troubleshoot experiments.</li>\n<li>Ability to manage more than one project at any given time and to work successfully in across-functional and highly collaborative team environment</li>\n<li>Exceptional communication, both speech and writing, to a variety of audience types</li>\n<li>Excellent working knowledge of Microsoft Word, Excel, PowerPoint, FlowJo and GraphPad Prism</li>\n</ul>\n\n<br><br>Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}