{"job title": "Scientist I, Research Pharmacology", "company": "AbbVie", "city state": "– South San Francisco, CA", "rating": "3.7", "job description": "Oncology is a key therapeutic area for AbbVie, with a portfolio\n<br>\n consisting of three marketed products Imbruvica, Venclexta, and Empliciti \n<br>\n and a pipeline containing multiple promising new molecules that are being\n<br>\n studied in nearly 200 clinical trials in 19 different types of cancer.\n<br><br>\nAbbVie is expanding its oncology hub on the West Coast, with three\n<br>\n sites in the San Francisco Bay Area (Redwood City, South San Francisco, and\n<br>\n Sunnyvale) focused on the discovery and development of novel oncology\n<br>\n therapies. More than 1,000 AbbVie scientists, clinicians, and product\n<br>\n developers with strong entrepreneurial roots work across these three sites.\n<br>\n They combine their expertise in immuno-oncology, stem cells, and cell-signaling\n<br>\n with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs),\n<br>\n and covalent-inhibitor technologies to discover and develop novel cancer\n<br>\n treatments. This position will be based at Stemcentrx, AbbVie's South San\n<br>\n Francisco, CA location.\n<br><br>\nThe Research Pharmacology Department is searching for a Scientist I who will\n<br>\n participate in evaluating novel anti-cancer therapies for pharmacokinetics (PK),\n<br>\n and biomarker analyses in vivo. The candidate will measure drug\n<br>\n concentrations and/or biomarkers to be used for PK study analyses; optimize\n<br>\n ligand binding assay protocols as needed; perform non-compartmental\n<br>\n pharmacokinetics analyses and interpret data; and, communicate data via\n<br>\n presentations and reports. The candidate will spend a mixture of their time in\n<br>\n the lab environment and performing computer work and analysis. Opportunities for additional projects related\n<br>\n to pharmacokinetics and/or pharmacodynamics could be granted based on\n<br>\n candidates interests. The ability to work independently and efficiently on multiple\n<br>\n responsibilities, and effectively participate and communicate as part of team,\n<br>\n is a prerequisite.\n<br><br>\n<strong>Key Responsibilities</strong>\n<ul>\n<li>Therapeutic or biomarker\n<br>\n concentration assessment (ELISA/MSD) in rodent blood samples and ligand\n<br>\n binding assay development</li><li>Analysis of ELISA/MSD assay\n<br>\n data</li><li>Non-compartmental\n<br>\n pharmacokinetics analysis with Phoenix WinNonlin software</li><li>Data\n<br>\n presentation and reports</li></ul>\n\n<ul>\n<li>BS/MS in Molecular &amp; Cell\n<br>\n Biology, Biochemistry, Engineering, or a related discipline, with 5+ (BS)\n<br>\n or 2+ (MS) years of relevant research experience</li><li>Hands-on experience with\n<br>\n ELISA/MSD and other Bioassays required</li><li>Hands-on experience with\n<br>\n pharmacokinetics analyses desired</li><li>Strong written and verbal\n<br>\n communication skills</li> <li>Organized, detailed and\n<br>\n disciplined record keeping is required</li>\n</ul>\n<u><strong>Character\n<br>\n Requirements:</strong></u>\n<ul>\n<li>Flexibility and motivation to\n<br>\n learn techniques and accomplish goals outside those stated above</li><li>Ability to manage multiple\n<br>\n responsibilities and meet deadlines in a fast-paced environment</li><li>Entrepreneurial personality,\n<br>\n with problem solving skills, critical thinking ability, and excellent\n<br>\n communication skills</li><li>Highly motivated and\n<br>\n independent with an ability to adapt to changing priorities in a\n<br>\n fast-paced environment</li><li>Raises the bar and is never satisfied with the status quo</li><li>Excited to participate in and contribute to company culture</li>\n</ul>\n\n<strong>Posting Grade: 15</strong>\n<br><br>\n<strong>Equal Opportunity Employer Minorities/Women/Veterans/Disabled</strong>\n<br>"}