{"job title": "Clinical Research Scientist", "company": "AbleTo", "city state": "– New York, NY", "rating": "3.7", "job description": "AbleTo, Inc. is a market leader in providing technology-enabled behavioral health care. AbleTo has been treating patients for over six years, and improves patient outcomes and lowers costs by providing treatment that integrates behavioral and medical health care. AbleTo's structured therapy programs strengthen medical recovery and self-care among members with chronic or complex clinical needs. AbleTo analytics, coupled with our multi-channel engagement platform, identify and engage members with unmet, often undiagnosed, behavioral health needs. A proprietary platform connects individuals and their care teams with AbleTo licensed providers who deliver weekly sessions by phone or video supported by an integrated digital experience.AbleTo programs are clinically proven to improve both behavioral health and medical outcomes while lowering overall spending for higher-cost, higher-risk members.\n<br><br>\nThe Clinical Research Team plays an integral and valued role at AbleTo by conducting thoughtfully planned program evaluation and development activities with a focus on quality outcomes. We are seeking a talented and dedicated clinical research professional to advance AbleTo’s clinical research initiatives, transforming our vast clinical data into knowledge that can advance innovation and improve health. As a Clinical Research Scientist on the team, you will meaningfully contribute to the planning and execution of research projects, and to the dissemination of research results internally and externally.\n<br><br>\nAs a Clinical Research Scientist at AbleTo, you will work in a uniquely collaborative capacity with the Clinical Research Team as well as with teams across the organization. You will:\n<ul>\n<li>Contribute to the design of new research projects and analytic plans.</li><li>Perform basic descriptive and multivariable statistical analyses, using standard statistical software.</li><li>Conduct systematic reviews and summaries of biomedical and business literature.</li><li>Support the design and execution of quality assurance and program evaluation research including: qualitative chart review, data management, and reporting</li><li>Collaborate with AbleTo’s Data and Analytics, Engineering, and Network Operations teams to ensure data availability and integrity.</li><li>Collaborate with AbleTo’s Clinical, Product, and Engagement teams to develop research projects and to apply results of research and translate research findings into new and improved treatment protocols, programs, or operational practices.</li><li>Collaborate with AbleTo’s Sales and Marketing teams to ensure research findings are being successfully communicated to clients and collaborators.</li><li>Support the dissemination of AbleTo research findings to the scientific community and other audiences via published manuscripts, abstracts, oral presentations, and white papers.</li></ul>\n\n<ul>\n<li>Develop and implement research quality assurance procedures.</li><li>Oversee Institutional Review Board (IRB) protocol submissions, modifications, and renewals.</li>\n</ul>\n*Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n<br><br>\n<strong>Technical skills</strong>\n<ul>\n<li>Clinical research design and program evaluation</li><li>Proficiency in SAS, R, or equivalent statistical programming language (SAS preferred)</li><li>Strong writing skills with a demonstrated track record of contributions to publications</li><li>Experience with Institutional Review Board protocol submission and management</li>\n</ul>\n\n<strong>Education/Experience:\n<br>\n</strong>\n\n<ul>\n<li>Master of Public Health or Master of Science degree in clinical research, epidemiology, health policy, or the equivalent;</li> <li>1-3 years relevant work experience in clinical research in technology-enabled health care, psychology, public health, health services, social sciences, or a related field strongly preferred.</li>\n</ul>\n\n<strong>Competencies:\n<br>\n</strong>\n\n<ul>\n<li>In addition to the technical requirements for this specific position, AbleTo seeks candidates who will demonstrate:</li><li>Personal ownership of assignments and responsibilities</li><li>Ability to take initiative to plan, execute, and improve on a continuing basis</li><li>Meticulous attention to detail</li><li>Highly organized</li><li>Excellent analytical skills</li><li>Resilience and grit to ensure project completion even in the face of adversity</li><li>Discipline and organization to handle multiple tasks simultaneously</li><li>Great interpersonal skills and ability to work in a team</li><li>High levels of energy and positive ambition</li><li>A healthy balance of curiosity, humility and assertiveness</li><li>Excellent written and verbal communication skills</li><li>Professional attitude and demeanor</li>\n</ul>\n<em>AbleTo is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.</em> <em>AbleTo is an E-Verify company.</em>\n<br><br>\n<em>Upon the acceptance of an offer to enter into this agreement, AbleTo requires the satisfactory completion of reference and background checks and successful completion of drug testing in accordance with local, state and federal laws.</em>"}