{"job title": "Senior Data Scientist", "company": "About", "city state": "– New York, New York", "rating": "3.5", "job description": "<strong>About the Role:</strong>\n<br><br>\nDotdash has been a top 20 site on the internet, since the internet was born. We have data stretching back before the existence of Google. We are looking to add a motivated and experienced member to the Dotdash data science team. In order to grow revenue through affiliate partnerships, we are working to understand the needs of millions of visitors a day, and to match each visitor to the best product or article for them. As a Senior Data Scientist in the Revenue and Conversion group, it will be your responsibility to develop and deploy user models to drive these initiatives forward.\n<br><br>\n<strong>About Your Contributions</strong>:\n<ul>\n<li>Drive high-visibility and high-impact projects that drive revenue and help match users to products. Possible projects include attribution modeling, user conversion modeling, and ad revenue optimization.</li> <li>Innovate rapidly to build proofs of concept that can take an idea and prove that it will work across a huge content company.</li><li>Work closely with stakeholders across the company to move initiatives forward and support data-driven decision-making.</li> <li>Attend and present at conferences to keep the team up to date with innovations in data science and relevant technology</li>\n</ul>\n<strong>About You:</strong>\n<ul>\n<li>Masters/PhD Degree in a quantitative field, and 2+ years of experience as a data scientist. Industry experience with e-commerce, ad tech, and/or conversion modeling strongly preferred.</li> <li>Proven history of leading projects from start to finish and shipping quality code (Be prepared to show us something you’ve built.).</li><li>Able to independently and fluently translate business needs to data problems</li><li>Excellent capacity to communicate results and progress to non-technical and technical audiences.</li><li>Strong research, analytical and problem-solving skills.</li><li>Solid grasp of statistics and predictive modeling techniques.</li><li>Strong programming skills in Python and familiarity with SQL, noSQL, and/or ElasticSearch</li>\n</ul>\n<strong>About Us:</strong>\n<br><br>\nDotdash's vibrant brands help over 100 million users each month find answers, solve problems, and get inspired. Dotdash is among the fastest-growing publishers online, and its brands are the fastest-growing in their respective categories. Dotdash brands include Verywell, The Spruce, The Balance, Investopedia, Lifewire, TripSavvy and ThoughtCo.\n<br><br>\nDotdash embraces inclusivity and values our diverse community. We are committed to building a team based on qualifications, merit and business need. We are proud to be an equal opportunity employer and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}