{"job title": "Data Scientist", "company": "Academia.edu", "city state": "– San Francisco, CA", "rating": "4.7", "job description": "<div><div><div>Data Scientist<div><div>San Francisco, CA</div><div>Data Science</div><div>Full-time</div></div></div><div>Apply for this job</div></div></div><div><div><div>Academia is looking for an experienced Data Scientist skilled at building and deploying predictive models and performing deep statistical analyses to support and accelerate our growth initiatives.</div><br>\n<div>In this role you will partner with our revenue conversion, growth and engineering teams to build and deploy models and conduct analyses that enable Academia to grow users and revenue faster and more efficiently. You will be a core contributor to building our data science practice!</div><br>\n<div>The Data Science team leverages Academia’s data to deliver insights for our customers and inform product direction and decision-making. We operate full-stack, conducting analyses, prototyping and deploying predictive models and statistical tools both for internal use and for our customers.</div><br>\n<strong><div>Here’s what you’ll do day-to-day:</div>\n<br>\n</strong>\n<br>\n<div><strong>• Build and deploy models that can be used for forecasting and optimization, in areas such as:</strong></div>\n\n<li>Predicting lead and customer value (conversion, churn, growth, etc.)</li>\n<li>Targeting upsell of additional products and product tiers both in-app and through marketing efforts</li>\n<li>Develop reusable statistical tools for tracking and analyzing growth experiments</li>\n<li>Conduct ad hoc statistical analyses and deep dives into our data to support Academia’s growth and revenue conversion</li>\n<li>Enhance and contribute to the team’s core analysis and modeling systems and libraries</li>\n<li>Present and communicate results across the company</li>\n<li>Identify new opportunities to leverage data to improve Academia’s products and help our business</li>\n\n<br>\n<div><strong>Here’s what we’re looking for:</strong> </div>\n\n<li>At least 5 years’ experience conducting statistical analyses on large datasets, ideally in an internet consumer business context (can supplement with academic experience where appropriate)</li>\n<li>Experience applying a variety of statistical and modeling techniques using Python, R or another statistical modeling language, as indicated by familiarity with many of the following techniques - generalized linear modeling, regularization, ensemble models (e.g., random forest, gradient boosting), Bayesian analysis methods, time series analysis, hierarchical modeling, and Monte Carlo methods.</li>\n<li>Strong programming skills - comfortable with all phases of the data science development process, from data collection all the way through to deployment</li>\n<li>Excellent communication skills - able to effectively deliver findings and recommendations to non-technical stakeholders in a clear and compelling fashion</li>\n<li>PhD or Masters plus equivalent experience in a quantitative field• Experience designing valid controlled experiments and conducting robust analyses on the resulting data.</li>\n\n<br>\n<div><strong>The Academia Story</strong></div><div>Founded in 2008, Academia.edu is the leading online platform for academics worldwide. Our site accelerates research and supports critical breakthroughs in medicine, science, transportation and communications by allowing researchers to publish and share their own work. Not only do these scholars and researchers share their own research, they can use our complex platform to monitor deep analytics around the impact of their research, and track the research of academics they follow. We have more than 35 employees at our San Francisco Office, with 26 in engineering.</div><br>\n<div>Over 60 million academics are Academia.edu members, adding 20 million papers. Academia.edu attracts over 30 million unique visitors a month and has an investment of more than $34 million from leading VC firms including Khosla Ventures, True Ventures, Spark Capital and Tencent. Our work has garnered favorable attention from trade and mainstream media including Fortune, Wired, EdTech, Venture Beat, San Francisco Business Times, The Economist, The Washington Post, TechCrunch, Scientific American and Forbes.</div><br>\n<div>Academia is turning cash flow positive; our revenue run rate is growing rapidly.</div><br>\n<div>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div></div><div>Apply for this job</div></div>"}