{"job title": "Scientist", "company": "Acara Solutions", "city state": "– Walpole, MA, United States", "rating": "3.1", "job description": "Employer is looking for Scientist for our client located Walpole, MA -The position will involve several projects. -The first project is installation and performance validations (test method validations) of two Waters' 1525 analytical HPLCs used for analysis of FDA-regulated production materials destined for in-vitro diagnostic products. -Validation activities include sample preparation and analysis of test materials of small organic molecules and peptides, data analysis, writing of process descriptions and data into formalized pre-set document templates such as technical studies and reports, along with validation protocols and reports. -The second project is installation and operation qualification of a new LC/MS to be purchased. -The candidate will generate installation and operation protocols, carry out validation experiments and write reports. -The candidate will also write instrument operating procedures and train employees. -Further, the candidate will develop and validate the LC/MS methods for exiting products that are currently analyzed by HPLC.\n<br><br>\n<strong>Required Skills / Qualifications:</strong>\n<br>\nBachelors degree in chemistry\n<br>\nMinimum of 5 years experience as Scientist.\n<br><br>\n<strong>Preferred Skills / Qualifications:</strong>\n<br>\nMasters/PhD degree in analytical chemistry with 2 years experience in HPLC and LC/MS analysis and validation.\n<br>\nIndustrial experience\n<br>\nFamiliarity with Waters 1525 HPLC, ACQUITY UPLC, SQD 2 Mass Detector and Empower 3 software or similar models and software is needed.\n<br>\nProficiency in technical writing is also needed, as is experience working with change control and validation of analytical equipment/methods in a GLP and GMP laboratory.\n<br>\nAlthough not necessary for this position knowledge of organic synthetic routes and purification schemes would be advantageous.\n<br>\nSimilarly, experience with other analytical methods such as mass spectrometry, NMR, and UV-visible would also be useful.\n<br>\nThe work environment will involve collaboration with organic chemists within the group, and interaction with quality assurance and validation personnel in separate departments.\n<br>\nAt all times the candidate must be able to work safely and independently in a team environment, and manage several projects simultaneously and efficiently.\n<br><br>\n<strong>Additional Information:</strong>\n<br>\nUpon offer of employment, the individual will be subject to a background check and a drug screen.\n<br>\nGo Beyond. www.superiorjobs.com.\n<br>\nEEO Employer - Minorities / Females / Disabled / Veterans / Sexual Orientation / Gender Identity."}