{"job title": "Data Scientist Associate Principal", "company": "Accenture", "city state": "– CA - San Diego", "rating": "3.9", "job description": "<div>\n \n - Job description\n \n\n <div>\n <div>Role: Data Scientist Associate Principal</div>\n\n<div>Location: San Diego, CA</div>\n\n<div> </div>\n\n<p>Accenture is a leading global professional services company, providing a\nbroad range of services and solutions in strategy, consulting, digital,\ntechnology and operations. Combining unmatched experience and specialized\nskills across more than 40 industries and all business functions – underpinned\nby the world’s largest delivery network – Accenture works at the intersection\nof business and technology to help clients improve their performance and create\nsustainable value for their stakeholders. With approximately 425,000 people\nserving clients in more than 120 countries, Accenture drives innovation to\nimprove the way the world works and lives. Visit us at www.accenture.com.</p><p><br></p>\n\n<p>People in the Innovation &amp; Thought Leadership career\ntrack drive asset innovation and marketplace reputation within a specific area\nof expertise. They grow into thought leadership roles, by increasing the depth\nof their expertise and reputation as an expert or innovator, and can progress\neither in role, laterally, or upward.</p><p><br></p>\n\n<p>Analytics professionals create new insights from\npredictive statistical modeling activities that target and deliver value to our\nclients.</p><p><br></p>\n\n<div><b><u>Job Description</u></b></div>\n\n<div> </div>\n\n<p>The Lead Data\nScientist will be part of Accenture Analytics as a Service Core Data Scientist\nteam. They will be managing and coordinating with the team that identifies and\ndevelops advanced analytics statistical models, machine learning methods and\nsolutions for Accenture operations clients to improve various business outcome\nindicators. </p>\n\n<div> </div>\n\n<div><b>Key Responsibilities:</b></div>\n\n<ul><li>Successfully develop,\n conceptualize and test various statistical and machine learning models</li><li>Integrate the outcomes as real\n time analytics to elevate Accenture’s ability to create value for clients\n in areas and through means not immediately apparent to clients</li></ul>\n\n<p>Data Scientists in\nOperations follow multiple approaches for project execution from adapting\nexisting assets to Operations use cases, exploring third-party and open source\nsolutions for speed to execution and for specific use cases, and engaging in\nfundamental research to develop novel solutions. They also leverage the vast\nglobal network of Accenture to collaborate with Accenture Tech Labs, Accenture\nOpen Innovation and Accenture Analytics for creating solutions. Data Scientists\nare expected to collaborate with other data scientists, subject matter experts,\nsales, and delivery teams from Accenture locations around the globe to deliver\nstrategic advanced analytics projects from design to execution.</p>\n<div><br></div>\n </div>\n </div>\n <div>\n \n + Basic qualifications\n \n\n <div>\n <div><b>Basic Qualifications:</b></div>\n\n<ul><li>Masters or Ph.D. (Computer Science,\n Statistics, Engineering, Physics, Mathematics, Economics)</li><li>Minimum 3 years' of Data Science\n experience for Ph.D. candidates and 5 years for Masters candidates</li><li>Minimum 3 years' of work experience in\n relevant domains (F&amp;A, Procurement, Fraud, Infrastructure Analytics,\n eCommerce, Security, Retail, Supply Chain Health Care, Pharma, Retail) –\n with hands on experience handling data driven decisions</li><li>Minimum 3 years' of experience in\n at least one of the following – Supervised and Unsupervised\n Learning, Classification Models, Cluster Analysis, Neural Networks,\n Non-parametric Methods, Multivariate Statistics, Reliability Models,\n Markov Models, Stochastic models, Bayesian Models</li><li>Minimum 3 years' of various\n statistical and machine learning models, data mining, unstructured data\n analytics in corporate or academic research environments</li><li>Minimum 2 years' of experience in\n statistical and other tools/languages (SAS, C, C++, Java, Python)</li><li>Minimum 2 years' of programming\n experience (C, C++, Java, SAS, Python)</li></ul>\n\n<p><b>Preferred\nQualifications:</b></p>\n\n<ul><li>Experience leading or collaborating\n with a team of data scientists in developing and delivering machine\n learning models that work in a production setting</li><li>Knowledge of UNIX or Linux\n environments</li><li>Experience working with large data\n sets and tools like MapReduce, Hadoop, Hive, etc.</li><li>Experience working with large data\n streaming technologies like Spark, Flink, etc.</li><li>Familiarity with relational databases\n and intermediate level knowledge of SQL </li><li>Ability to think creatively to solve\n real world business problems</li><li>Ability to work in a global\n collaborative team environment</li><li>Proficient verbal and written\n communication skills in English</li></ul>\n\n<div> </div>\n\n<div> </div>\n\n<p>Applicants for employment in the US must have work\nauthorization that does not now or in the future require sponsorship of a visa\nfor employment authorization in the United States and with Accenture.<br>\n<br>\nCandidates who are currently employed by a client of\nAccenture or an affiliated Accenture business may not be eligible for\nconsideration.<br>\n<br>\nAccenture is a federal contractor and an EEO and Affirmative\nAction Employer of Females/Minorities/Veterans/Individuals with Disabilities.<br>\n<br>\nEqual Employment Opportunity<br>\nAll employment decisions shall be made without regard to age,\nrace, creed, color, religion, sex, national origin, ancestry, disability\nstatus, veteran status, sexual orientation, gender identity or expression,\ngenetic information, marital status, citizenship status or any other basis as\nprotected by federal, state, or local law.<br>\n<br>\nJob candidates will not be obligated to disclose sealed or\nexpunged records of conviction or arrest as part of the hiring process.<br>\n<br>\nAccenture is committed to providing veteran employment\nopportunities to our service men and women.</p>\n<br>\n </div>\n </div>\n\n <div>\n APPLY\n\n\n SAVE THIS JOB\n\n \n\n\n\n\n\n<div><div>\n\n <div></div>\n <div><strong></strong></div>\n <div></div>\n <div><strong></strong></div>\n <div></div>\n\n</div><div>Share</div></div>\n </div>"}