{"job title": "Federal - Data Scientist", "company": "Accenture", "city state": "– MD - Suitland, USA", "rating": "3.9", "job description": "<strong>Basic Qualifications:</strong>\n\n<ul>\n<li>Bachelor's degree</li>\n<li>3 years experience in quantitative analysis and statistical modeling (regression, correlation, clustering, etc.)</li>\n<li>1 year of experience consulting or experience in a similar field requiring client collaboration, presentation, and delivery</li>\n<li>3 years experience using analytics tools and languages - R, Python, SAS, etc.</li>\n<li>3 years experience combining data sets, extracting key variables, and creating new variables to enhance modeling</li>\n<li>3 years experience performing basic ETL functions and understanding of data quality steps/measures</li>\n<li>US Citizenship required</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li>Advanced degree in data science, business analytics or similar analytics concentration that is business-oriented</li>\n<li>3 years experience with supervised and unsupervised analytic techniques.</li>\n<li>3 years experience with visualization applications - Tableau, Qlik, Shiny</li>\n<li>Experience working with federal agencies and clients</li>\n<li>Process enablement and execution experience</li>\n<li>Knowledge of industry leading analytics and big data technologies, approaches, and tools</li>\n<li>Experience working in fast-paced collaborative environments</li>\n<li>Strong written and oral presentation skills</li>\n</ul>\nAn active security clearance or the ability to obtain one may be required for this role.\n<br><br>\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n<br><br>\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).\n<br><br>\nAccenture is a Federal Contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.\n<br><br>\nEqual Employment Opportunity\n<br><br>\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n<br><br>\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n<br><br>\nAccenture is committed to providing veteran employment opportunities to our service men and women."}