{"job title": "Advanced Data Scientist Consultant", "company": "Accent Technologies, Inc.", "city state": "– Melbourne, FL", "rating": "4.0", "job description": "<strong>About Accent</strong>\n<p>We are a Software as a Service (SaaS) company that helps national and global fortune companies align their sales and marketing teams to increase sales revenue. Our sales enablement solutions drive sales execution by giving sales reps quick access to all the resources they need along with intelligent recommendations, coaching and guidance based on sales data analytics.</p>\n<p>We are headquartered in Melbourne, Florida and are looking to increase our team to help support our growing company.<br><br></p>\n<strong>Position Summary</strong>\n<p>We are looking for an experienced Data Scientist to provide consulting services to expand our analytics capabilities. This role will be critical to driving our company's further success by helping establish a repeatable process to extract relevant information and insight from large amounts of data. Our analysis tools help sales teams prioritize opportunities, predict which deals are most likely to close, provide next step guidance and expose risks.<br><br></p>\n<strong>Job Functions</strong>\n<ul>\n<li>Provide insights and establish processes to support business solution development based on key drivers that will allow us to provide our clients with predictive analytics based on large volumes of data we collect</li>\n<li>Perform SAS data manipulation and analysis programming</li>\n<li>Develop predictive models using multiple statistical techniques</li>\n<li>Provide technical and actuarial design assistance</li>\n<li>Provide support and assistance for the implementation of predictive models</li>\n<li>Present and communicate established process to internal team members</li>\n<li>Ensure data visualization tools allow our end-users to transform data to its most appropriate, concise and readable visual representation, while keeping the theme and style of our product branding</li>\n</ul>\n<br><strong>Qualifications</strong>\n<ul>\n<li>Working with large volumes of data; storing, optimizing and cleansing it in order to make it predictable on a reoccurring basis</li>\n<li>Experience with NoSQL databases like Reddis and MongoDB</li>\n<li>Knowledge and experience using various Data Mining Software</li>\n<li>Experience with data analysis tools available in the Microsoft Azure platform</li>\n<li>Database architecture/warehousing experience in order to understand sources of data</li>\n<li>Experienced in collecting, cleansing and converting data, data mining, data mapping, data integrity</li>\n<li>Experience with Dimensional Modeling</li>\n<li>Experience assessing “as-is” and “to-be” environments – review of current analytics, trends and reports</li>\n<li>Knowledge of business requirements for gathering and writing data mapping for reporting and analytics solutions</li>\n<li>Ability to profile, develop, test and validate data-related changes</li>\n<li>Relational and non-relational databases</li>\n<li>Modeling expertise using statistical techniques such as logistic and linear regression, decision trees, neural network or clustering techniques</li>\n<li>Provides a comprehensive list of services including ad hoc development, BI platform integration strategies, performance tuning and analysis, best practices and training</li>\n<li>Collaborate with our internal entities to provide services leadership, scoping solutions and providing estimates on infrastructure, development and support costs for client implementations</li>\n</ul>\n<br><strong>Core Requirements:</strong>\n<p>Education and Experience: Master’s degree or higher</p>\n<p>At least 7 years’ experience pulling data from databases, running assessments on the data (i.e. regressions &amp; correlations), cleansing data and turning results into valuable business predictors</p>\n<p> </p>\n<p>If you feel you are a good fit for this role, we look forward to hearing from you! For more information about Accent Technologies, please visit our website: www.accent-technologies.com</p>\n<p> </p>"}