{"job title": "Data Scientist Specialist", "company": "Accenture", "city state": "– OH - Cleveland, USA", "rating": "3.9", "job description": "<strong><u>Basic Qualifications</u></strong>\n\n<ul>\n<li>Masters degree (quantitative field such as Computer Science, Statistics, or Mathematics preferred)</li><li>Minimum of 4 years statistical modeling</li><li>Minimum of 2 years of experience with the statistical language of R</li> \n</ul>\n\n<strong><u>Preferred Qualifications</u></strong>\n\n<ul>\n<li>Coding experience with R/ SAS/ open source programing platforms</li> <li>Experience handling data driven decisions in technology / online marketing channels/ email campaigns / internet domain</li><li>Ability to communicate concisely and persuasively with engineers and product managers</li><li>Experience in various statistical and machine learning models, data mining, unstructured data analytics in corporate or academic research environments</li><li>Experience with at least one of the following - Reliability models, Markov Models, Stochastic models, Bayesian Modelling, Classification Models, Cluster Analysis, Neural Network, Non-parametric Methods, Multivariate Statistics</li><li>Passion to answer Product/Engineering questions with data</li> <li>Ability to think creatively to solve real world business problems</li><li>Familiarity with relational databases and intermediate level knowledge of SQL</li> <li>Ability to work in a global collaborative team environment</li> <li>Proficient verbal and written communication skills in English</li>\n</ul>\n\n<strong><u>Professional Skill Requirements</u></strong>\n<br>\nProven success in contributing to a team-oriented environment\n<br>\nProven ability to work creatively and analytically in a problem-solving environment\n<br>\nDesire to work in an information systems environment\n<br>\nExcellent leadership, communication (written and oral) and interpersonal skills\n<br><br>\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture.\n<br><br>\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n<br><br>\nAccenture is a federal contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.\n<br><br>\nEqual Employment Opportunity\n<br>\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n<br><br>\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n<br><br>\nAccenture is committed to providing veteran employment opportunities to our service men and women."}