{"job title": "Quality Assurance Scientist", "company": "Accelerate Diagnostics, Inc.", "city state": "– Tucson, AZ", "rating": "4.7", "job description": "Position Title: Quality Assurance Scientist\n<br><br>\n<strong>Position Overview:</strong>\n<br><br>\nThis is a highly technical quality position responsible for decision-making on product issues, design and development requiring critical analytical thinking. The desired candidate has a strong scientific background, knowledge of quality processes, attention to detail and strong organizational and communication skills.\n<br><br>\n<strong>Roles and Responsibilities:</strong>\n\n\n<ul>\n<li>Responsible for Technical Decision-Making for Product Issues</li>\n<li>Performs detailed data review.</li>\n<li>Participates and reviews in risk assessment for products and processes.</li>\n<li>Supports risk analysis process for technical accuracy for various QMS, e.g., non-conformances, investigations, CAPAs, etc.</li>\n<li>Represents Quality in Design and Development including process changes.</li>\n<li>Provides key technical guidance and oversight to Design and Development process including design change control.</li>\n<li>Evaluates changes orders</li>\n<li>Provides technical guidance and quality assurance support in the transfer of new products and process to maintain quality standards.</li>\n<li>Evaluates and edits Technical Protocols and Reports</li>\n<li>Performs critical review of documentation for qualification, verification, and validation activities.</li>\n<li>Provides guidance on gaps identified from the review and actively participates to determine potential remediation activities.</li>\n<li>Assures design and development, and manufacturing operations are performed in compliance with QMS as well as domestic and international regulations.</li>\n<li>Provides scientific approach and Quality Assurance direction to the approval of the QMS documents such as batch records, protocols, procedures, qualification, and validation reports.</li>\n<li>Enforces critical analytical thinking in the investigation management process specifically during root cause analysis, risk assessment evaluation and corrective and preventive actions determination to guarantee that gaps are properly addressed.</li>\n<li>Provides scientific input into investigations using a systematic approach for the opportunities identified to ensure root cause and CAPAs are aligned.</li>\n<li>Assists management during internal and regulatory agencies inspections.</li>\n<li>Performs trend analysis to provide recommendations to improve the process and/or product quality.</li>\n<li>Supports the Annual Product Review elements for Quality events of manufacturing.</li>\n<li>Participates as quality representative or liaison in site projects.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Master Degree in Science (Chemical, Biology or Microbiology) with five (5) years of experience in Quality Assurance responsibilities in a medical device or equivalent regulated industry</li>\n<li>Strong knowledge of relevant GMP, FDA, EU regulations and the ability to interpret and apply them for intended use.</li>\n<li>Self-motivated and team work oriented.</li>\n<li>Technical and scientific capability to make firm decisions and recommendations.</li>\n<li>Excellent interpersonal skills and the ability to interact with people at all levels.</li>\n<li>Effective communication Skills.</li>\n<li>Sense of urgency and analytical thinking.</li>\n<li>Proficient knowledge of computer systems (Microsoft Office etc.) and applications like PLM, QMS and ERP.</li>\n<li>Solid ability for analyzing data and detecting deviations, trends, and inconsistencies.</li>\n<li>Proficient knowledge of problem solving and root cause analysis methodologies (e.g. Kepner Tregoe).</li>\n<li>Technical Writing experience, a plus.<br><br>SDL2017</li>\n\n</ul>"}