{"job title": "Principal Data Scientist Consultant", "company": "Access Talent Today, LLC", "city state": "– Oakland, CA", "rating": "NA", "job description": "<strong>Brief Team and Position Summary:</strong>\n<br><br>\nA newly formed Digital Solutions Business Area of an established 150 yr-old Company is combining their legacy software, cyber security and platform as a service with other digital capabilities.\n<br><br>\nThis <strong>global company</strong> is in the midst of a digital transformation, as are the industries in which they operate. As part of an initiative to accelerate this process, they are building and scaling analytic competence and further develop their Big Data-enabled analytic platform.\n<br><br>\nBy joining the global team of data scientists and software developers, you will help leverage Big Data Analytic capabilities to transform their global services across all of the verticals they serve. This role may be filled to augment their small energetic team in either Oakland, CA.\n<br><br>\nThe successful candidates will work in a strong multidisciplinary team of data scientists, software developers and domain experts. This team will run complex projects transforming existing and developing new digital services and tools across all the Company’s industries to:\n<ul>\n<li>Design experiments, test hypotheses, and build models.</li> <li>Conduct advanced data analysis and highly complex designs algorithm.</li> <li>Apply advanced statistical and predictive modeling techniques to build, maintain, and improve on multiple real-time decision systems. Typically Establish and implement end to end proof of concepts and analytic applications</li>\n</ul>\nThis is a US-based opportunity; applicants must be fully-authorized to work in the US, flexibility to travel within the region and overseas for various periods of time.Candidate subject to background check to persona Risk Assessment and/or Background check.\n<br><br>\n<strong>Requirements:</strong> <em><strong>(Mandatory qualifications for this position)</strong></em>\n<ul>\n<li>Business responsibilities\n\n<ul>\n<li>Support head of department in creating business plans and strategy</li><li>Preparing and conducting external and internal customer meetings and presentations</li><li>Writing business proposals and Statement of Work (SOW) for large and small projects, estimate project delivery tasks.</li> <li>Taking ownership of small to mid-sized projects, including project management and delivery of all project needs such as written and oral feedback to the client, presentation materials, evaluations, data summaries and reports</li><li>Following up business opportunities, leading on negotiation and closing business contracts</li><li>Provides business metrics for the overall project to show improvements</li> <li>Knowledge of one or more of Company’s primary business areas:Maritime, Oil and Gas, Energy, Business Assurance (Healthcare or Food and Beverage).</li><li>Experience in building and leading high-performing teams preferred</li></ul></li>\n<li>Technical competencies</li><li>Master’s Or PhD in computer science, statistics, physics, mathematics or a related field required, with focus on data analysis preferred</li><li>3 years minimum hands on experience in analyzing scientific data, data analytics, machine learning, statistics or experiment design required</li><li>The ability to come up with solutions to loosely defined business problems by leveraging pattern detection over potentially large datasets</li><li>Strong programming skills (such as Hadoop MapReduce or other big data frameworks, Java), and statistical modeling (like SAS or R)</li><li>Experience with languages like Python, R, Java and Scala preferred</li><li>Experience with scalable noSQL databases, time series databases and search engines (like MongoDB, OpenTSDB, Elasticsearch, etc.) preferred</li><li>Experience using Unix/Linux and the corresponding standard command line tools preferred</li><li>Knowledge of and experience with micro service architecture style preferred</li><li>Experience developing and consuming RESTful API services preferred</li><li>Experience using code versioning systems (like Git) preferred</li><li>Experience in building and leading high-performing teams preferred</li><li>Behavioral competencies</li><li>Professional Experience and Industry Contacts (technically and commercially) from Energy sector, Oil and Gas business, Maritime business and/or Technical Consulting industry.</li><li>Delivery Experience –experience preferred as a consultant or other “knowledge workers”.</li> <li>Result orientation – Is highly resilient, works with pace, focus and determination to overcome obstacles and deliver business results.</li><li>Integrated/Team Working – Communicates and works well with business and subject matter experts, ability to work independently and in a team environment</li><li>Communication - Excellent overall communication skills including the ability to write clearly and concisely, translating the rational of their findings to internal and external stakeholders.</li><li>Customer-facing skills – ability to develop and maintain strong working relationships with their clients.</li><li>Analytical - Excellent analytical skills; ability to see commonalities among very different problems</li><li>Creative – Demonstrates a high level of technical expertise and the ability to apply this knowledge to practical problems.</li><li>Time Management - Good organizational skills with the ability to deal with multiple issues under pressure.</li>\n\n<ul>\n<li>Adaptable – Openness to continual learning about emerging technologies, regulatory drivers and industry developments.Ability and willingness to learn and adapt quickly, and follow procedures</li></ul></ul>\n\n<ul>\n<li>Other qualifications</li>\n\n<ul>\n<li>Travel requirement (20-30% of the year) Flexibility to travel within the Americas and overseas for various periods of time.</li><li>Physical ability to work with computers for extended periods of time on a daily basis required, including extended periods of sitting and/ or standing</li><li>They conduct pre-employment drug and background screening</li></ul>\n</ul>\n<strong>Preferred Skills (Not Required):</strong>\n<ul>\n<li>Good understanding on emerging digital technologies (big data, machine learning, IIOT, artificial intelligence …)</li>\n</ul>"}