{"job title": "Research Scientist Organic Chemistry Medicinal Chemistry", "company": "ActivX Biosciences, Inc.", "city state": "– San Diego, CA", "rating": "NA", "job description": "<p><strong><u>Research Scientist - Organic/Medicinal Chemistry</u></strong></p>\n<p>ActivX Biosciences is a biopharmaceutical company that develops small molecules for unmet medical needs. ActivX uses its chemoproteomics probe-based profiling technology to discover disease mechanisms and optimize drugs for these diseases. ActivX is looking for a highly motivated Research Scientist with a desire to work in a fast-paced medicinal chemistry research group.</p>\n<p>The researcher will participate in hit identification and hit-to-lead and lead optimization processes in an interdisciplinary team. The ideal candidate will be expected to develop viable synthetic strategies on their own and to efficiently conduct multi-step syntheses of small-molecules from milligram- to multi-gram scale to support pre-clinical R&amp;D. The selected candidate will analyze and develop structure-activity relationships to provide input to the design of new molecules with suitable potency, selectivity, pharmacokinetics, <em>in vivo</em> efficacy and safety profile. S/he may synthesize, purify and characterize active site probes to support ActivX’s technology platforms. S/he participates in multi-disciplinary group meetings, makes intellectual contributions to ensure success in ActivX’s drug discovery programs, and contributes to patent authorship. S/he stays current of scientific literature related to the state-of-the-art in organic synthesis and drug discovery. Must be a strong team player and possess excellent communication skills.</p>\n<p><strong> </strong><strong>Qualifications/Requirements: </strong></p>\n<ul>\n<li>Requires a Ph.D. in Organic Chemistry with at least 2 years industrial or postdoctoral experience in synthetic organic chemistry or drug discovery.</li>\n<li>Extensive experience in the synthesis of a wide range of chemical compounds (ie: synthesis of heterocycles, chiral synthesis, metal catalyzed reactions).</li>\n<li>Ability to analyze structure-activity relationships and <em>in vitro</em>/<em>in vivo</em> ADMET to provide input on project strategies.</li>\n<li>Proficiency in analytical techniques including LC-MS, NMR, UV, IR spectroscopy.</li>\n<li>Excellent multitasking skills with the ability to plan and execute multiple reactions simultaneously.</li>\n<li>Attention to detail, scientific curiosity, and critical thinking abilities.</li>\n<li>Excellent oral and written communication skills.</li>\n<li>Strong interpersonal skills and the ability to productively work in a multidisciplinary team.</li>\n<li>Track record of contributing to patent applications and journal publications is highly desirable.</li>\n</ul>"}