{"job title": "Data Scientist", "company": "Acuity INC", "city state": "– US-VA-Reston", "rating": "3.8", "job description": "<div><div>\n<div>Acuity, Inc. seeks dynamic, self-motivated individuals with experience as a Data Scientist who can clean, organize and visualize streamlined processes with customer data. We are looking for experienced Data Scientists that can work closely with customers and be a liaison with the team. This Data Scientist will have a background with experience with Apache Spark, Kafka, Hadoop, etc., with big data analytics.\n<br><br>\nAcuity, Inc. is a leading management and technology consulting firm that specializes in serving the federal government. Our innovative, collaborative and rewarding work environment has earned repeat honors from the Washington Business Journal’s Best Places to Work and SmartCEO Corporate Culture awards.</div></div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div><strong>What you’ll be doing:</strong>\n<ul>\n<li>Work within a team of like-minded professionals to design, build and deploy critical business and mission applications in a production environment</li> <li>Assess the data architecture of a “legacy” application and re-design it for a highly scalable cloud application built in conformance with a microservices architecture</li><li>Develop data design elements (model, schema, dictionary, taxonomies, and related artifacts) for the to-be cloud application that will provide services to a global base of customers</li><li>Assist in the creation of guidance and recommendations supporting the development, implementation, and management of data analytic capabilities to include data discovery, data access, and visualization</li> <li>Create executive level reports and briefings on data architecture, data management/policies, and data analytics</li><li>Assist in the development of enterprise data governance policies and procedures, ensure the appropriate use of datasets across the enterprise</li><li>Work in support of an advanced technical team to serve as the technical lead for matters relating to data</li><li>Design and implement appropriate data environments for those applications, engineer suitable data management and governance procedures and provide production support</li> <li>Develop data solutions in development and staging environments to exercise the design and ensure it will meet the requirements for availability and ongoing sustainment</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>\n<div>\n\n<ul>\n<li>BS in Computer Science, Statistics, Math, or other engineering-related discipline</li><li>At least 5 years of experience working in big data environments performing analytics, machine learning, and visualization dashboards</li><li>Strong understanding of Spark APIs, best practices, optimizations, deployments, and tuning</li><li>Hands-on experience and understanding of data structures and algorithms</li><li>Experience with Databricks platform is a plus</li><li>Programming experience with Scala, Python and/or R for purposes of big data analysis</li><li>Present and Share Data Science methods and approaches to external clients and partners. Help mature organizational Data Science capabilities.</li><li>Participate in internal and external knowledge exchanges (conferences, workshops, webinars).</li><li>Experience with Agile Delivery methodologies</li></ul></div>\n<br><strong>Desired Technical Skills and Competencies:</strong>\n<ul>\n<li>Amazon AWS or Microsoft Azure Cloud Certification or equivalent</li>\n</ul>\n<strong>Clearance Requirements:</strong>\n<ul>\n<li>Must be US Citizen and be able to obtain and maintain DHS Suitability</li></ul></div>\n</div>\n</div>\n<br>"}