{"job title": "Data Scientist - Remote", "company": "Adaxa Technologies", "city state": "– Fort Lauderdale, Florida", "rating": "NA", "job description": "<div>This is a Data Scientist role in the healthcare industry, requiring skills in Python, SQL, and Spark/Scala. Two or more years or professional experience applying these skills is required. Academic experience beyond coursework, such as a doctoral dissertation applying these skills, may substitute for professional experience. The job is based in Fort Lauderdale, Florida, but could be mostly remote.</div><br>\n\n<div><strong>Responsibilities:</strong></div><ul><li>Data acquisition and integration, including querying relational databases and developing ETL processes (including automated ETL processes), for medical or dental claims data and other data types, primarily using Python, Spark/Scala, Hive, Sqoop, SQL, and SQL Alchemy.</li><li>Developing and validating statistical and machine learning models, including predictive analytics and anomaly detection models, to identify potential fraud, waste, or abuse in medical or dental claims data, primarily using Python and Spark/Scala.</li><li>Making decisions or recommendations regarding the types of statistical or machine learning models best suited to business problems.</li><li>File management using S3 and HDFS.</li><li>Creating data visualizations with Python and Scala.</li><li>Contributing data science expertise to the development of software products.</li><li>Explaining the results and implications of classical statistical analyses and machine learning methods to non-technical business audiences, orally and in writing.</li><li>Providing technical guidance on data science tasks to other team members.</li><li>Other related tasks as assigned.</li>\n</ul><br>\n\n<div><strong>Requirements/Qualifications:</strong></div><ul><li>Strong professional communication and collaboration skills, including fluency in English (written and spoken) and the ability to collaborate remotely, communicating by phone, email, and video conference, with minimal in-person contact.</li><li>Two or more years of relevant professional experience (or academic experience beyond coursework, such as a doctoral dissertation or authorship of academic papers published in peer-reviewed journals) to include significant experience:</li><li>Using Python, Spark/Scala, and Hive to integrate, analyze, and visualize large data sets.</li><li>Leading data science projects or teams (as the most technically advanced team member) or working independently on data science projects.</li><li>Intermediate to advanced proficiency in querying relational databases using SQL or SQL-based tools such as SQL Alchemy, or Hive.</li><li>Familiarity with Sqoop preferred.</li><li>Intermediate to advanced proficiency in Python and Spark/Scala for classical statistical analysis and data modeling (e.g. regression analysis), machine learning (e.g. decision trees and neural networks), and ETL processes. This includes the ability to write production-ready code including documentation and unit tests.</li><li>Intermediate to advanced knowledge of inferential statistics (for example, linear modeling, hypothesis testing, nonparametric statistics) and machine learning techniques (for example, decision trees and neural networks).</li><li>Basic to intermediate ability to create data visualizations using Python.</li><li>Basic to intermediate knowledge of HDFS file management.</li><li>Demonstrated creativity in data science projects.</li><li>Ability to explain the results and implications of classical statistical analyses and machine learning methods to non-technical business audiences, orally and in writing.</li><li>Requires minimal or no technical guidance in data science tasks; usually able to resolve technical problems independently; often able to provide technical guidance to other team members.</li><li>Bachelors or masters degree in a quantitative discipline such as statistics, mathematics, economics, computer science, engineering, or operations research. (Two additional years of relevant professional experience may substitute for this educational requirement).</li>\n</ul>\n\n<br>\n<div>This position is based in Fort Lauderdale, Florida but maybe mostly remote. Candidates who wish to work remotely must be willing to travel as needed (up to 15% travel), including regular visits to Fort Lauderdale.</div>"}