{"job title": "Data Scientist", "company": "AdColony", "city state": "– Bellevue, WA, US", "rating": "2.2", "job description": "<strong>Data Scientist</strong><div>\nAdColony is on a mission to make mobile advertising experiences more meaningful and rewarding for users, app publishers, and advertisers. Were building a company that cares deeply about the way users encounter and interact with ads to help them find new apps that theyll enjoy and to connect with brands they value. That is reflected in our company values of transparency, empowerment, one team, and doing the right thing, and were looking for more like-minded people to help us iterate, solve problems, and invent.</div><br>\n\n<div>\nStatistical test, parameter estimation, probability distributions, supervised and unsupervised learning, ensemble learning, regression, clustering, regularization, Artificial neural network, If these terms are music to your ears, read on!</div><br>\n\n<div>\nYour mission is to analyze data, model the data and design algorithms to help improve efficiency and relevancy on mobile advertising for our hundreds of millions of users worldwide.</div><br>\n\n<div>\nIf you have good understanding of statistics and machine learning algorithms, and you love to use your knowledge to solve real world problems, we want to talk to you.\n<br><br>\n<strong>Responsibilities</strong></div>\n\n<ul>\n\n<li>\nDesign algorithms for predictive modeling and clustering.</li>\n<li>\nData-analytic responsibilities include pattern discovery, outlier detection, sample design, identification of appropriate analytic and statistical methodology, model development and documentation of process and results.</li>\n<li>\nDevelop working prototypes of algorithms.</li>\n<li>\nEvaluate the performance of various algorithms/models/strategies based on the real world data sets.</li>\n<li>\nOversee the process of implementing algorithms and models in production.</li>\n<li>\nLearn and apply new algorithms and models in this exciting field.</li>\n</ul>\n\n<br>\n<div>\n<strong>Qualifications</strong></div>\n\n<ul>\n\n<li>\nMasters degree in applied math, statistics, machine learning or computer science. Ph.D. is preferred.</li>\n<li>\nPassion for solving challenging analytical problems.</li> \n<li>\nSolid understanding of probability and statistics theories and machine learning algorithms.</li> \n<li>\nHands on experience in applying machine learning techniques to solve real-world problems.</li>\n<li>\nAbility to quickly assess a problem both qualitatively and quantitatively.</li>\n<li>\nAbility to work productively with team members, identify and resolve tough issues in a collaborative and respectful manner.</li>\n<li>\nFluency in at least one scripting language such as Python, R or Matlab.</li>\n<li>\n2-3 years of professional experience is preferred.</li> \n<li>\nExperience with large data set processing is preferred.</li>\n</ul>"}