{"job title": "Data Scientist", "company": "Adobe", "city state": "– San Jose", "rating": "4.2", "job description": "<strong>The challenge</strong>\n<br><br>\nMachine Learning is critical part of Adobe’s Cloud offering. Adobe Clouds enable customers to create &amp; manage Digital content, such as assets, composites, 3D, documents etc., and Digital experience &amp; transformations. In Creative Cloud, Creative professionals and novice users alike need to manage lifecycle of their digital assets, libraries, the variety of creative content, and documents they work with every day, from brushes to colors, images, videos, 3D and beyond. In Experience Cloud, it is all about optimizing the Digital Experience and Digital Transformations for Enterprises where digital content rules with mobile playing pivotal role, whereas in Document Cloud it is all about paperless world where offerings provide way for authoring and seamless transfer of content across users &amp; entities. Adobe Cloud also provides the stock image marketplace, Adobe Stock, and the community, Behance, which entails deep machine learning embedding to enable content quality, search, discover, organize, contributor moderation, and more to allow for faster content velocity.\n<br><br>\nWe are building new machine learning platform, called Adobe Sensei, that powers machine learning and AI across Adobe Cloud product lines by enabling the world’s best creative tools, leading cloud services for managing digital assets and digital experiences and the leading marketplace such as Adobe Stock and Adobe Behance. This platform will enable thousands of applied researchers, millions of users, and billions of content pieces. Become part of this growing team at Adobe and a phenomenal impact in the area of computer vision, user understanding, language understanding, and digital experience optimization. The objective is to make machine learning offerings a world class, leading edge, differentiating product in Adobe Cloud ecosystem. We match the pace, innovation and excitement of a startup, backed by the resources and infrastructure of Adobe!\n<br><br>\nHow can you participate? We’re looking for Data scientist, from entry level to senior roles, in the area of data mining, big data processing, user sessions, Search and machine learning. This is an opportunity to make a huge impact in a fast-paced, startup-like environment in great company. Join us!\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Build state of art machine learning models for Adobe assets using Natural Language Processing, big data, content understanding and computer vision.</li><li>Analyze user behavior data and derive insights to improve retention, salability and subscription rate.</li><li>Work with Adobe products team to share user behavior insights and create actionable plan for improvements.</li><li>Build, Maintain and optimize data science platform using technologies such as Hadoop, Hive, machine learning frameworks, Caffe, Tensorflow, R-CNN, Spark, Elastic, AWS, EMR, Deep Learning, and more.</li><li>Identify new ideas to evolve data science platform into reusable and extensible platform.</li>\n</ul>\n<strong>What you need to succeed</strong>\n<br><br>\nMS in Computer Science\n<br><br>\nMinimum 5-10 years of relevant experience in industry\n<br><br>\nExperience in data analysis of user behavioral data and query logs\n<br><br>\nExperience with some machine learning frameworks – Scikit, MLPack, TF, SparkMLib, Caffe, …\n<br><br>\nExperience in building, validating and evaluating of machine learning model\n<br><br>\nExperience in building feature selection for machine learning\n<br><br>\nExperience in building distributed systems\n<br><br>\nExperience in deploying machine learned models in production enviornment\n<br><br>\nExperience with Spark, big data processing, Hadoop, Hive.\n<br><br>\nHands on experience with Java, Python, and/or C++.\n<br><br>\nKnowledge of Matlab, R and other tools.\n<br><br>\nExposure to Docker, Containerization, AWS.\n<br><br>\nExposure to Web services, micro-services, and REST.\n<br><br>\nExperience in RDBMS &amp; NOSQL database.\n<br><br>\nAt Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on <u>Best Companies lists</u>. You will also be surrounded by colleagues who are committed to helping each other grow through our unique <u>Check-In</u> approach where ongoing feedback flows freely.\n<br><br>\nIf you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.\n<br><br>\nAdobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}