{"job title": "Machine Learning Engineer, Creative Cloud", "company": "Adobe", "city state": "– San Francisco", "rating": "4.2", "job description": "The Challenge:<br><br>Machine Learning is a critical part of Adobe’s Product offering. In Creative Cloud, creative professionals and novice users alike need to handle the lifecycle of their digital assets, libraries, the variety of content and documents they work with every day, from brushes to colors, images, photos, videos, 3D and beyond. In Creative Cloud products, we are using Machine Learning to help users navigate through their experience and be productive and efficient in accomplishing their goals.\n<br><br>\nWe are building new machine learning capabilities in the context of Creative Cloud and Creative Cloud products. The objective is to make machine learning offerings an extraordinary, leading edge, differentiating feature in Adobe Creative Cloud offerings and to improve user experience.\n<br><br>\nHow can you participate? We’re looking for a machine learning engineer, with experience in one or more areas of content analysis, computer vision, deep learning, user intent recognition, natural language processing, and information retrieval. This is an opportunity to make a huge impact in user engagement and delight, directly impacting the bottom line. Join us!<br><br>Responsibilities\n\n<ul>\n<li>Work on machine learning client and workflow infrastructure, algorithms, deep learning, recommendations, and more.</li><li>Apply analytics and machine learning to improve content analysis, computer vision, deep learning, natural language processing and content ranking &amp; recommendations.</li><li>Build workflows to enhance the lifecycle of billions of images, vector creations and other Creative Cloud assets.</li><li>Identify new ideas to build and evolve Machine Learning solutions, develop new features and benchmark possible solutions.</li><li>Use technologies such as React for client side code, REST web services, micro-services, Caffe, Tensorflow, Spark, AWS, Deep Learning, Matlab, R, and more.</li>\n</ul>\n\nWhat you will need to be successful\n\n<ul>\n<li>MS or PhD in Computer Science</li><li>Minimum 5-10 years of relevant experience in industry</li><li>Experience in machine learning technologies, especially in computer vision and graphics</li><li>Hands on experience with Java, javascript, C++, python, Java</li><li>Exposure to machine learning frameworks: Tensorflow, Keras, Pytorch, Caffe</li><li>Experience in tech-transfer of research technologies and fast prototyping</li><li>Experience in Web development and UI design</li>\n</ul>\nAt Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on <u>Best Companies lists</u>. You will also be surrounded by colleagues who are committed to helping each other grow through our unique <u>Check-In</u> approach where ongoing feedback flows freely.\n<br><br>\nIf you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.\n<br><br>\nAdobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}