{"job title": "Principal Data Scientist", "company": "Advance Auto Parts", "city state": "– Raleigh, NC", "rating": "3.0", "job description": "Career Description\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class:Advance Auto Parts, a leader in the automotive aftermarket, currently has an opening for a PrincipalData Scientist.?As a PrincipalData Scientist at Advance Auto Parts, you will have an opportunity to disrupt a $100B auto parts industry to bring better and faster solutions to customers. You will be responsible for analyzing billions of transactions to find patterns that will help improve our company and build data products to extract valuable business insights. You will be part of an elite data science function to help the organization live its mission of Advancing a World in Motion.\n<br><br>\nEssential Duties and Responsibilities include the following. Other duties may be assigned.\n<br><br>\nIdentify and implement strategies to leverage valuable data sources across display, search, social, and other digital channels.\n<br><br>\nCollect, analyze, and interpret information from multiple data sources identifying actionable insights that create efficiencies and generate revenue.\n<br><br>\nBuild predictive models and machine-learning algorithms for second-level analytics.\n<br><br>\nDevelop reports and/or presentations leveraging data visualization tools that clearly and concisely communicate analytical findings and recommendations to key stakeholders.\n<br><br>\nAnalyze customer and transaction data to identify trends and patterns in customer behavior.\n<br><br>\nConduct digital channel analysis to understand traffic and revenue drivers, both in-store and on-line.\n<br><br>\nLeverage analytical tools (SQL, SAS, Tableau) and data mining techniques to perform advanced data manipulation and extract insights from large databases.\n<br><br>\nMaintain knowledge and stays abreast of developments in?the field of data science.\n<br><br>\nSupport ad hoc analytic needs as requested.\n<br><br>\nMentor more junior data scientists and grow the overall technical abilities of the team.\n<br><br>\nCareer Requirements\n<br><br>\nRequired Qualifications\n<br><br>\n8+ years' experience as a Data Scientist or Business Analyst\n<br><br>\n8+ years' experience with a data science programming language (e.g. R, SAS, SPSS, and/or Python)\n<br><br>\n8+ years' experience using data visualization tools (e.g. Tableau, d3.js)\n<br><br>\nDeep understanding of relational databases and experience with data mining\n<br><br>\nExtensive experience with data frameworks (e.g. Hadoop)\n<br><br>\nExtensive experience with machine learning\n<br><br>\nBachelor's Degree in Computer Science, Mathematics, Engineering or other relevant discipline\n<br><br>\nPreferred Qualifications\n<br><br>\nMaster's Degree or PhD in Data Science or another quantitative field\n<br><br>\n10+ years' experience as a Data Scientist or Business Analyst"}