{"job title": "Senior Data Scientist Position", "company": "Advance Auto Parts", "city state": "– Raleigh, NC", "rating": "3.0", "job description": "Career Description\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class:\n<br><br>\nThere are ~270 million cars on the road in the US. An average car has 30,000 parts and will eventually upload 25 GB of data every hour. Data is our business! At Advance Auto Parts, we are reinventing ourselves to build technology and data science as a core skillset. This fuels our passion to say Yes to our customers to realize our vision of \"Advancing a World in Motion\". We are a values driven company with a collaborative environment that values teamwork and problem solving. As a Data Scientist at AAP you will have an opportunity to disrupt a $165B auto parts industry to bring better and faster solutions to customers. You will buildout the data science function at a Fortune 500 and work with some of the best practitioners of Data Science. You don't need to know how to change your own oil, but you do need to know how to wrangle a pandas data frame. Here you are only limited by the power of your imagination.\n<br><br>\nEssential Duties and Responsibilities include the following. Other duties may be assigned.\n\n\n<ul>\n<li>Identify and implement strategies to leverage valuable data sources across display, search, social, and other digital channels.</li>\n<li>Collect, analyze, and interpret information from multiple data sources identifying actionable insights that create efficiencies and generate revenue.</li>\n<li>Build predictive models and machine-learning algorithms for second-level analytics.</li>\n<li>Develop reports and/or presentations leveraging data visualization tools that clearly and concisely communicate analytical findings and recommendations to key stakeholders.</li>\n<li>Analyze customer, transaction, and campaign data to identify trends and patterns in marketing campaign performance and/or customer behavior.</li>\n<li>Conduct digital channel analysis to understand traffic and revenue drivers, both in-store and on-line.</li>\n<li>Leverage analytical tools (SQL, SAS, Tableau) and data mining techniques to perform advanced data manipulation and extract insights from large databases.</li>\n<li>Maintain knowledge and stays abreast of developments in the field of data science.</li>\n<li>Support ad hoc analytic need as requested.</li>\n</ul>\n\nRequired\n<br><br>\nCareer Requirements\n\n\n<ul>\n<li>2+ years' experience as a Data Scientist or Business Analyst</li>\n<li>2+ years' experience with a data science programming language (e.g. R, SAS, SPSS, and/or Python)</li>\n<li>2+ years' experience using data visualization tools (e.g. Tableau, d3.js)</li>\n<li>Deep understanding of relational databases and experience with data mining</li>\n<li>Experience with data frameworks (e.g. Hadoop)</li>\n</ul>\n\nEDUCATION and/or EXPERIENCE\n\n\n<ul>\n<li>Bachelor's Degree in Computer Science, Mathematics, Engineering or other relevant discipline</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>Master's Degree or PhD in Data Science or another quantitative field</li>\n<li>5+ years' experience as a Data Scientist or Business Analyst</li>\n<li>Experience with machine learning</li>\n</ul>\n\n<strong>Qualifications</strong>"}