{"job title": "Marketing Data Analyst", "company": "Advia Credit Union", "city state": "– Southgate, MI", "rating": "4.1", "job description": "<strong>What you should know about the role</strong>\n<br><br>\nThe Marketing Data Analyst drives progress for the organization by performing regression analysis, statistical modeling, and predictive modeling to improve share of wallet within the target market, and increase utilization of products and services. Build and strengthen relationships to increase understanding of various departments in order to provide relevant recommendations that will increase sales and identify efficiencies to help improve sales and marketing efforts. Identify areas of opportunity based on data analysis of the organizations paid and non-paid advertising and marketing programs involving all internal and external communications.\n<br><br>\n<strong>What you should know about Advia</strong>\n<br><br>\nAdvia is a fast-growing Credit Union that is positioned in the top 3% of credit unions across the United States with nearly 2 billion in assets. We offer very similar product and services as the big banks with a focus on saving our members money while providing financial advantages. We are rooted in our communities and believe we have a responsibility to give back outside of our four branch walls through volunteering and charitable donations. The work environment at Advia is fast-paced, performance based and fun infused. We certainly live by the saying “work hard, play hard.” As an employee of Advia, you can expect regular and constructive feedback, development opportunities, great benefits, excellent co-workers and engaged managers\n<br><br>\n<strong>As a Marketing Data Analyst , you will have opportunities to:</strong>\n<ul>\n<li>Have a variety of responsibilities and projects to keep the job interesting</li><li>Be an important part of a fun, friendly and fast-paced team</li><li>Be a part of a collaborative team</li></ul>\n\n<ul>\n<li>Plans and executes data for marketing campaigns, including list acquisition, test design, audience selections, model score applications, and measures campaign effectiveness.</li><li>Utilizing programming languages for data manipulation such as Python, and R, to develop regression analysis, statistical modeling, and predictive modeling.</li><li>Leverage data mining techniques and procedures to extract data from various data sources.</li><li>Develop algorithms to identify, analyze and interpret trends and patterns in order to make recommendations that will: increase sales and identify efficiencies for the sales team, increase utilization of credit union products and services, and promote the organization and improve positioning, image, and support within target markets.</li><li>Must comply with applicable laws and regulations, including but not limited to, the Bank Secrecy Act, the Patriot Act, and the Office of Foreign Assets Control.</li>\n</ul>\n<strong>Physical Requirements</strong>\n<br>\nIs able to bend, sit, and stand in order to perform primarily sedentary work for long periods of time with limited physical exertion and occasional lifting of up to 20 lbs. Must be capable of climbing / descending stairs in an emergency situation. Must be able to operate routine office equipment including computer terminals and keyboards, telephones, copiers, facsimiles, and calculators. Must be able to routinely sustain repetitive motion while using computer keyboard for an average of 6-8 hours per day, when necessary. Must be able to work extended hours or travel off site whenever required or requested by management. Must be capable of regular, reliable and timely attendance.\n<br><br>\n<strong>Working Conditions</strong>\n<br>\nMust be able to routinely perform work indoors in climate-controlled shared work area with moderate noise.\n<br><br>\n<strong>Mental and/or Emotional Requirements</strong>\n<br>\nMust be able to perform job functions independently or with limited supervision and work effectively either on own or as part of a team. Must be able to read and carry out various written instructions and follow oral instructions. Must be able to speak clearly and deliver information in a logical and understandable sequence. Must be capable of dealing calmly and professionally with numerous different personalities from diverse cultures at various levels within and outside of the organization and demonstrate highest levels of customer service and discretion when dealing with the public. Must be able to perform responsibilities with composure under the stress of deadlines / requirements for extreme accuracy and quality and/or fast pace. Must be able to effectively handle multiple, simultaneous, and changing priorities. Must be capable of exercising highest level of discretion on both internal and external confidential matters.\n<br><br>\n<strong>Acknowledgement</strong>\n<br><br>\nNothing in this position description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job description is not a contract and should not be construed as a guarantee of employment for any specific period of time. Advia Credit Union is an Equal Opportunity Employer and does not discriminate against employees or applicants based on race, color, religion, sex/gender, national origin, disability, age, or any other category protected by law.\n<br><br>\n<strong>Experience</strong>\n<br><br>\n2+ years of relevant analytics experience. Financial Institutions experience is a plus. Experience in algorithm writing, data mining techniques and procedures, as well as extensive experience working with databases is required. Proficiency in Excel and programming language is required.\n<br><br>\n<strong>Education/Certifications/Licenses</strong>\n<br>\nBA/BS in Statistics, Computer Science, Marketing, Engineering, Economics, Finance related field.\n<br><br>\n<strong>Interpersonal Skills</strong>\n<br>\nMust be able to develop a significant level of trust. Strong ability to collaborate with a problem-solving mindset. Professional level of written and verbal communication skills is a must for this position. Have the ability to present complex information in an understandable and compelling manner is necessary.\n<br><br>\n<strong>Other Skills</strong>\n<br><br>\nExperience using Python and/or R.\n<br>\nProficient in Excel.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}