{"job title": "Data Scientist", "company": "Adwerx", "city state": "– Durham, NC", "rating": "3.8", "job description": "We're looking for someone to join the analytics team at Adwerx. Ideal candidates will have a passion for numbers and data discovery, deep analytical capabilities, a collaborative work-style and strong strategic judgment. Youll get to help drive data-based decision making at Adwerx. If you like to discover the \"truth\" through data, this role's for you.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Generate reports on key product metrics.</li> \n\n<li>Conduct analysis for major projects.</li> \n\n<li>Be an expert on Adwerxs reporting systems and data flows (currently MixPanel, MySQL, Redshift, and Tableau), including troubleshooting of data issues and implementation of new data streams.</li>\n<li>Help other users find and understand the data they need.</li>\n<li>Help Adwerx find new ways of measuring and understanding the behavior of our users.</li> \n\n<li>Advise and train product, business development, marketing, etc. on metric definition/ implementation requirements for projects and testing methodology (what to measure, how to structure a test, etc.)</li> \n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>2-4 years of related experience in online reporting/analytics.</li>\n<li>Proven analytics ability/ experience dealing with complex analytical projects and large data sets.</li> \n\n<li>Ability to pull data directly from large databases and write complex queries in SQL.</li> \n\n<li>Demonstrated ability managing data and analytical projects cross- functionally to achieve results.</li> \n\n<li>Experience with database systems such as MySQL, SQL Server, Amazon Redshift, Google BigQuery or similar tools.</li> \n\n<li>Strong business sense with the ability to do detailed work while remembering the big picture.</li>\n<li>Demonstrated ability to learn new technologies.</li>\n<li>Strong written and verbal communication skills to communicate findings.</li> \n\n<li>Experience with Microsoft Office, especially Excel - Pivot Tables, Vlookup, etc.</li> \n\n<li>A team player who enjoys working in a fast-paced environment.</li> \n\n<li>College degree mandatory. Prefer candidates with an advanced degree in a quantitative field such as CS, Engineering, Statistics, Mathematics, Economics, or Physics.</li>\n</ul>\n<strong>Nice to have:</strong>\n\n<ul>\n<li>Experience with one or more web reporting packages (MixPanel, Google Analytics, Facebook Insights, Coremetrics, Adobe Omniture, etc.)</li>\n<li>Experience with R</li>\n<li>Familiarity with Business Intelligence and Data Warehousing concepts.</li>\n<li>Experience with Data Visualization tools such as Tableau, Qlik, Tibco, Periscope.io, or similar.</li>\n<li>Knowledge of at least one scripting language (Perl, Python, Ruby, etc.)</li> \n\n<li>Knowledge of statistical techniques such as clustering, and logistic regression.</li>\n</ul>\nNote: Candidates will be screened on their ability to write SQL queries and use advanced functionality in Excel"}