{"job title": "Data Scientist", "company": "Aegon", "city state": "– Denver, CO", "rating": "3.4", "job description": "<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Design experiments and formulate machine learning problems to address major business challenges and innovation opportunities.</li>\n<li>Work with product managers and data engineers to discover, collect, cleanse, and refine the data needed for analysis and modeling.</li>\n<li>Analyze large datasets to extract actionable insights and inform experimental design and model development.</li>\n<li>Write lucid, compelling summaries to communicate results of your analysis, model development, and testing which inform how the business should act.</li>\n<li>Collaborate with peers, challenging assumptions and providing constructive criticism and ideas for improvement.</li>\n<li>Build models using a variety of statistical and machine learning techniques, assessing the best type of model for the problem. context and using advanced techniques and customizations to optimize model performance.</li>\n<li>Harden models for production deployment and monitor model performance over time.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Masters degree or PhD in computer science, machine learning, data science, mathematics, statistics, or related quantiative field.</li>\n<li>Three years of experience in a data science or machine learning role.</li>\n<li>Excellent knowledge of major machine learning algorithms.</li>\n<li>Fluent in Python and R.</li>\n<li>Experience with machine learning libraries and platforms, like Scikit-learn and Tensorflow.</li>\n<li>Solid statistical analysis skills and a good understanding of experimental design.</li>\n<li>Experience working with data at scale in the Hadoop ecosystem.</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>Experience leveraging NLP tools and techniques for text mining and natural language understanding.</li>\n<li>In-depth experience with computer vision applications of machine learning.</li>\n</ul>\n\nBehavioral &amp; Leadership Competencies\n\n\n<ul>\n<li>Ability to analyze data to identify deliverables, gaps and inconsistencies.</li>\n<li>Communication skills including the ability to identify and communicate data driven insights.</li>\n<li>Excellent analytical and problem solving skills.</li>\n<li>Excellent communication skills and the ability to use data to tell a story.</li>\n<li>Willing to learn and keep pace with the latest advances in data science and machine learning.</li>\n<li>Attention to detail and results oriented, with a strong customer focus.</li>\n<li>The ability to work within a team environment.</li>\n</ul>\n\nOur Culture\n<br><br>\nAt Transamerica we promote a Future Fit mindset. What is a Future Fit mindset?\n\n\n<ul>\n<li>Acting as One fosters an environment of positive collaboration.</li>\n<li>Accountability allows us to own the problem as well as the solution.</li>\n<li>Agility inspires new ideas, innovation and challenges the status quo.</li>\n<li>Customer Centricity encourages an above and beyond approach to our customer.</li>\n</ul>\n\nWorking Conditions\n\n\n<ul>\n<li>Office environment.</li>\n</ul>\n\nCompany information\n<br><br>\nWhy Work for Us\n<br><br>\nTotal Rewards at Transamerica: It's more than a paycheck. Our comprehensive Total Rewards package is designed to help support you in many ways throughout all stages of your life and career. We provide a competitive, market-driven program that encompasses base compensation, bonus potential, retirement, health and wellness benefits, learning and development opportunities, plus great employee perks. All designed with you in mind to help you live your best life, grow personally and professionally - and feel valued for the work you do.\n<br><br>\nLearn more about our Total Rewards Package.\n<br><br>\n<strong>Equal Opportunity Employer:</strong>\n<br><br>\nTransamerica Life Insurance Company is an Equal Employment Opportunity employer and does not discriminate against any applicant or employee because of age, religion, sex, gender identity, genetic information, race, color, national origin, pregnancy, sexual orientation, marital status, participation in the uniformed services (e.g. U.S. Armed Forces, National Guard), physical or mental disability, or any other status protected by federal, state, or local equal employment opportunities laws.\n<br><br>\nAEGON USA Realty Advisors, LLC, is an Equal Employment Opportunity/ Affirmative Action Employer and does not discriminate against any applicant or employee because of age, religion, sex, gender identity, genetic information, race, color, national origin, pregnancy, sexual orientation, marital status, participation in the uniformed services (e.g. U.S. Armed Forces, National Guard), physical or mental disability, or any other status protected by federal, state, or local equal employment opportunities laws.\n<br><br>\nApplicants with physical or mental disabilities may be entitled to a form of reasonable accommodation under the Americans with Disabilities Act and certain state and local laws. A reasonable accommodation is a change in the way things are normally done which will insure equal employment opportunity without imposing undue hardship on the Transamerica Companies. If you are a job seeker with a disability, or are assisting someone with a disability, and require assistance to apply for one of our jobs, please contact: applicantsupport@transamerica.com.\n<br><br>\n<strong>Technical Assistance:</strong>\n<br><br>\nIf you experience technical problems during the application process, please email applicantsupport@transamerica.com.\n<br><br>\nApply\n<br><br>\nTransamerica Transamerica careers\n<br><br>\nVisit the dedicated careers website for more information about working for Transamerica.\n<br><br>\nLearn more\n<br><br>\nRoles Roles at Aegon\n<br><br>\nFind out more about different roles available at Aegon and Transamerica Globally.\n<br><br>\nLearn more<br><br>SDL2017"}