{"job title": "ALM Quantitative Analyst", "company": "Aegon", "city state": "– Baltimore, MD", "rating": "3.4", "job description": "What You Will Do: As a member of the Asset Liability Management (ALM) &amp; Hedging team, you will work with senior staff to solve business problems using quantitative analytics, software engineering, statistics, economic analysis, finance, and accounting disciplines.\n<br><br>\nWhat You Will Learn: You will work on derivative asset modeling to support the trading desk and hedging team. You will get to work closely with the traders and be heavily involved in trading development and decisions.\n<br><br>\n<strong>What Success Looks Like:</strong>\n\n\n<ul>\n<li>Work closely with trading desk and hedge strategy team; Provide quantitative tools, analysis and general day-to-day quantitative support in terms of model building, implementation, and application building as well as pricing and risk management advice to traders.</li>\n<li>Develop, deliver and maintain quantitative models to analyze risks in derivatives portfolio and provide system support for derivatives trading activity.</li>\n<li>Model and quantify risks on different market factor sensitivities and P&amp;L attributions of derivatives portfolio.</li>\n<li>Produce, maintain or extend existing model implementations built in C++/Python.</li>\n<li>Implement risk reports and processes automation for risk management and operation.</li>\n<li>Create application and user interface with Python / Excel VBA for front desk.</li>\n</ul>\n\n<strong>What You Need:</strong>\n\n\n<ul>\n<li>Masters in mathematics, actuarial science, finance, economics, physics, computer science or engineering with at least 7 years relevant work experience</li>\n<li>OR Bachelor's degree and FSA/CFA/Equivalent Designation plus 7 years relevant work experience</li>\n<li>OR Bachelor's degree plus 10 years relevant work experience.</li>\n<li>Communication skills to convey complex information to business both verbally and in writing at an appropriate level of detail for each audience.</li>\n<li>Expertise on object oriented programming in C++, Ruby and Python on Linux.</li>\n<li>Expertise on developing on Linux.</li>\n<li>Experience with open source.</li>\n<li>Working knowledge of SQL.</li>\n</ul>\n\nPreferably, the successful candidate will also possess the following:\n<br><br>\nQuantitative skills\n\n\n<ul>\n<li>Strong skills in mathematical / statistical analysis and modeling</li>\n<li>Strong knowledge of capital market instruments and hedging strategies</li>\n<li>Comprehensive understanding of financial mathematics, portfolio theory, and asset allocation techniques</li>\n<li>Knowledge and professional experience with complex quantitative modeling, stochastics processes, PDE, numerical analysis, and probability theory</li>\n<li>Proficient with models and algorithms for derivatives on all asset classes</li>\n</ul>\n\nProgramming skills\n\n\n<ul>\n<li>Proficient programming skills in a major programming language (e.g. C++ C#, Python)</li>\n<li>Strong knowledge of enterprise software and architecture</li>\n<li>Solid software development background or understanding of software development principles</li>\n<li>Experience involving software development and financial modeling in a trading environment</li>\n</ul>\n\n<strong>What You Receive:</strong>\n<br><br>\nA Comprehensive Wealth + Health package. It's our passion to empower people, and especially our employees, to add years to their lives and more life to their years. That means a healthy account balance and a healthy body to match. As you'll come to discover, Wealth + Health is a central part of everything we do!\n<br><br>\nWealth Benefits; Competitive Pay, Bonus, and Benefits Package; Pension Plan, 401k Match, Employee Stock Purchase Plan, Tuition Reimbursement, Disability Insurance, Stock Purchase Plan, Employee Discounts, Career Training &amp; Development Opportunities, Certification Sponsorship\n<br><br>\nHealth and Work/Life Balance Benefits; Be Well Company sponsored holistic wellness program which includes Wellness Coaching and reward dollars, Parental Leave, Adoption Assistance, Employee Assistance Program, College Coach Program, Back-up Care Program, Paid Time Off to Volunteer, Employee Matching Gifts Program, Employee Resource Groups, Inclusion and Diversity Programs, Employee Recognition Program.\n<br><br>\nCompany information\n<br><br>\nWhy Work for Us\n<br><br>\nTotal Rewards at Transamerica: It's more than a paycheck. Our comprehensive Total Rewards package is designed to help support you in many ways throughout all stages of your life and career. We provide a competitive, market-driven program that encompasses base compensation, bonus potential, retirement, health and wellness benefits, learning and development opportunities, plus great employee perks. All designed with you in mind to help you live your best life, grow personally and professionally - and feel valued for the work you do.\n<br><br>\nLearn more about our Total Rewards Package.\n<br><br>\n<strong>Equal Opportunity Employer:</strong>\n<br><br>\nTransamerica Life Insurance Company is an Equal Employment Opportunity employer and does not discriminate against any applicant or employee because of age, religion, sex, gender identity, genetic information, race, color, national origin, pregnancy, sexual orientation, marital status, participation in the uniformed services (e.g. U.S. Armed Forces, National Guard), physical or mental disability, or any other status protected by federal, state, or local equal employment opportunities laws.\n<br><br>\nAEGON USA Realty Advisors, LLC, is an Equal Employment Opportunity/ Affirmative Action Employer and does not discriminate against any applicant or employee because of age, religion, sex, gender identity, genetic information, race, color, national origin, pregnancy, sexual orientation, marital status, participation in the uniformed services (e.g. U.S. Armed Forces, National Guard), physical or mental disability, or any other status protected by federal, state, or local equal employment opportunities laws.\n<br><br>\nApplicants with physical or mental disabilities may be entitled to a form of reasonable accommodation under the Americans with Disabilities Act and certain state and local laws. A reasonable accommodation is a change in the way things are normally done which will insure equal employment opportunity without imposing undue hardship on the Transamerica Companies. If you are a job seeker with a disability, or are assisting someone with a disability, and require assistance to apply for one of our jobs, please contact: applicantsupport@transamerica.com.\n<br><br>\n<strong>Technical Assistance:</strong>\n<br><br>\nIf you experience technical problems during the application process, please email applicantsupport@transamerica.com.\n<br><br>\nApply\n<br><br>\nRelated vacancies\n\n\n<ul>\n<li>Technical Lead - Financial Data Management Baltimore</li>\n<li>Corporate Bond Analyst Baltimore</li>\n<li>Manager; Hedge Projection Development Baltimore</li>\n<li>Risk Manager - Model Validation Baltimore</li>\n</ul>\n\nSee all vacancies\n<br><br>\nTransamerica Transamerica careers\n<br><br>\nVisit the dedicated careers website for more information about working for Transamerica.\n<br><br>\nLearn more\n<br><br>\nRoles Roles at Aegon\n<br><br>\nFind out more about different roles available at Aegon and Transamerica Globally.\n<br><br>\nLearn more"}