{"job title": "Marketing Analytics Manager", "company": "Aetna", "city state": "– Chicago, IL", "rating": "3.4", "job description": "Req ID: 54456BR\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nMedicare is a top growth area for Aetna as an enterprise and for the Government business. In 2018, the Group Retiree business will be responsible for over $10 billion in revenue. This role will directly support the Group Retiree marketing and sales organization to meet business development, retention and growth goals by leveraging internal and external data assets to support both direct to consumer and business to business outreach. The ideal candidate should: (1) Possess the ability to engage directly with business leaders, sales and accounts and creative marketing resources to enable high impact marketing and customer engagement/retention efforts and measure the impact of those efforts. (2) Operate in agile way that unlocks the potential of our data assets to more effectively engage our existing customers and prospects.\n<br><br>\n<strong>Fundamental Components:</strong>\n<br><br>\nThis marketing analytics role is responsible for:\n<br><br>\nAcquiring, preparing and maintaining data assets to support high impact marketing campaigns and customer engagement efforts. Data sources may include structured and unstructured data from various sources including: customer demographic, claims and interaction data, geospatial data, salesforce data, and other syndicated data sources.\n<br><br>\nPreparing datasets to support highly personalized communications.\n<br><br>\nPreparing insightful ad hoc summaries and data visualizations to communicate the effectiveness of marketing and engagement efforts.\n<br><br>\nAnalyzing the effectiveness of direct to consumer and business to business marketing campaigns to inform best practices.\n<br><br>\nCreating models to predict campaign response.\n<br><br>\nAssisting in segmenting and profiling customers, to target prospects with the most potential.\n<br><br>\nUnderstanding business objectives and drawing on data assets to support those objectives.\n<br><br>\nProvides information based, data driven, decision making process in support of planning, designing, implementing, and monitoring marketing campaigns and other demand generation efforts, including preparing complex audience mail files for marketing campaigns.\n<br><br>\nUtilizes range of business analyses to help marketing teams determine optimal allocation of marketing budget across different media channels and consumer segments aimed at enabling marketing organization to maximize marketing ROI via acquisition and retention programs.\n<br><br>\n<strong>BACKGROUND/EXPERIENCE desired:</strong>\n<br><br>\n7+ years of directly relevant experience in quantitative business analysis role(s).\n<br><br>\nExperience in manipulating large datasets and samples.\n<br><br>\nExcellent understanding of test and learn initiatives and other statistical techniques used to provide analytical support.\n<br><br>\n2 or more years of experience in analytical role supporting marketing analytics in the healthcare insurance, management consulting (large group implementations) or consumer finance industry.\n<br><br>\nIntermediate to advanced: skills: Excel, Alteryx, Tableau, Powerpoint.\n<br><br>\nStrong analytical skills used to identify and resolve problems.\n<br><br>\nExcellent written and verbal communication and presentation skills.\n<br><br>\nAbility to utilize statistical and/or technical tools to analyze and solve business problems.\n<br><br>\nAbility to conceptualize business problems, execute solutions, and present findings in a simple manner.\n<br><br>\n<strong>EDUCATION</strong>\n<br><br>\nThe highest level of education desired for candidates in this position is a Bachelor's degree or equivalent experience.\n<br><br>\n<strong>FUNCTIONAL EXPERIENCES</strong>\n<br><br>\nFunctional - Marketing/Dbase marketing/1-3 Years\n<br><br>\nFunctional - Information Management/Business information analysis/7-10 Years\n<br><br>\nFunctional - Planning/Business/1-3 Years\n<br><br>\n<strong>ADDITIONAL JOB INFORMATION</strong>\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.\n<br><br>\nJob Function: Product &amp; Marketing\n<br><br>\nAetna is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected Veterans status."}