{"job title": "Principal Data Scientist - Data Hub", "company": "Aetna Inc.", "city state": "– Hartford, Connecticut", "rating": "3.4", "job description": "POSITION SUMMARY\n<br><br>\nAetna's Consumer Health Services Customer Insights and Analytics Team creates cutting edge analytic tools to drive better and faster decision making within the organization. We are currently looking for an exceptional Sr Data Scientist - Healthcare to play a pivotal role in the creation and deployment of information products. The position is office based in either our Harford or Wellesley office locations.\n<br><br>\nThis is a unique opportunity for someone passionate about innovation in data science, machine learning, and predictive modeling techniques. The team currently uses an industry leading scalable data platform and techniques in creating solutions to challenging business problems. This role will require frequent interaction with project stakeholders and business partners at all levels of the organization. This is a fast-paced, collaborative and iterative environment requiring quick learning, agility and flexibility.\n<br><br>\nFundamental Components:\n<br><br>\nLeads development and execution of new and/or highly complex algorithms and statistical predictive models and determines analytical approaches and modeling techniques to evaluate scenarios and potential future outcomesEstablishes analytical rigor and statistical methods to analyze large amounts of data, using advanced statistical techniques and mathematical analysesManages highly complex analytical projects from data exploration, model building, performance evaluation and testingApplies in-depth knowledge of systems and products to consult and advise on additional efforts across organization/enterpriseMotivates team members and probes into technical details, and mentors others to do the sameProvides thought leadership and direction for analytic solutions, tools and studiesAnticipates and solves strategic and high risk business problems with broad impact on the business area by applying leading-edge theories and techniques to investigate problems, detect patterns and recommend solutionsProvides guidance to develop enterprise-wide analytics strategy and roadmapInteracts with internal and external peers and management to share highly complex information/solutions related to areas of expertise and/or to gain acceptance of new or enhanced technology/ business solutions\n<br><br>\nBACKGROUND/EXPERIENCE desired:\n<br><br>\n10 or more years of progressively complex related experienceDemonstrates advanced in-depth specialization in mathematical analysis methods, machine learning, statistical analyses, and predictive modelingComprehensive knowledge on health care industry, products, systems, business strategies and productsExpertise in innovating and implementing novel machine learning techniqueExpertise in advanced analytics tools and languages to analyze large data sets from multiple data sourcesSuperior skills to effectively communicate and negotiate across the business and in the external health care environmentSuperior ability to communicate technical ideas and results to non-technical clients in written and verbal formStrong organizational, management and leadership skills.xcellent analytical and problem solving skills\n<br><br>\nEDUCATION\n<br><br>\nMaster's degree desired, PhD a plus\n<br><br>\nADDITIONAL JOB INFORMATION\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.\n<br><br>\nJob Function: Data &amp; Analytics\n<br><br>\nAetna is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected Veterans status."}