{"job title": "Sr Data Scientist", "company": "Aetna", "city state": "– New York, NY", "rating": "3.4", "job description": "Req ID: 55256BR\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nLooking for opportunities to use cutting edge technologies analyzing petabytes of data in a world class Hadoop cluster, generating insights to guide consumers in their journey to wellness and help them achieve their health ambitions, whether its playing tackle football with their grandkids or running the Inca Trail Marathon? Aetna's Data Science organization is focused on delivering strategically-impactful products to our internal customers, by building analytically-based solutions that integrate a wide range of internal and external large datasets within a cutting-edge Hadoop parallel-processing environment.\n<br><br>\nAetnas Consumer Health Services Clinical Analytic Team creates innovative analytic tools to drive better and faster decision making within the organization. We are currently looking for an exceptional Sr Data Scientist, reporting to the Executive Director of Clinical Analytics, to use advanced analytics to optimize care management programs to improve health outcomes and reduce health care costs for Aetna consumers.\n<br><br>\nLeads and participates in the development, validation and delivery of algorithms, statistical models and reporting tools. Solves complex analytical problems.\n<br><br>\n<strong>Fundamental Components:</strong>\n<br><br>\nDevelops and/or uses algorithms and statistical predictive models and determines analytical approaches and modeling techniques to evaluate scenarios and potential future outcomes.Performs analyses of structured and unstructured data to solve multiple and/or complex business problems utilizing advanced statistical techniques and mathematical analyses and broad knowledge of the organization and/or industry.Collaborates with business partners to understand their problems and goals, develop predictive modeling, statistical analysis, data reports and performance metrics.Develops and participates in presentations and consultations to existing and prospective constituents on analytics results and solutions.Interacts with internal and external peers and managers to exchange complex information related to areas of specialization.Use strong knowledge in algorithms and predictive models to investigate problems, detect patterns and recommend solutions.Use strong programming skills to explore, examine and interpret large volumes of data in various forms.\n<br><br>\n<strong>BACKGROUND/EXPERIENCE desired:</strong>\n<br><br>\n5 or more years of progressively complex related experience.Demonstrates proficiency in most areas of mathematical analysis Strong knowledge of advanced analytics tools and languages to analyze large data sets from multiple data sources.Anticipates and prevents problems and roadblocks before they occur.Demonstrates strong ability to communicate technical concepts and implications to business partners.\n<br><br>\n<strong>EDUCATION</strong>\n<br><br>\nMasters degree desired, PHD a plus.\n<br><br>\n<strong>ADDITIONAL JOB INFORMATION</strong>\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.\n<br><br>\nJob Function: Data &amp; Analytics\n<br><br>\nAetna is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected Veterans status."}