{"job title": "Data Scientist", "company": "Aetna Inc.", "city state": "– Hartford, CT", "rating": "3.3", "job description": "<strong>Job Description</strong>\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nJoin our fast-paced, innovative and collaborative environment. Work closely with subject matter experts and colleagues to develop models using Machine Learning, Deep Learning and other similar technologies to predict and analyze data on hardware and software systems within a large server infrastructure to prevent outages and pinpoint errors. Developers will work on innovative and complex solutions with the use of machine learning and statistical analysis.\n\n\n<ul>\n<li>Note: Interested candidates must be legally eligible to work for any US employer &amp; not require visa transfer or sponsorship now or in the future.</li>\n</ul>\n\n<strong>Fundamental Components:</strong>\n<br><br>\nYou will work with team members to analyze large amounts of data from our infrastructure systems. Build models with the use of machine learning, deep learning and similar technologies. Prototype these models by using software languages such as Python or relevant modeling languages. Interact with customers to develop an understanding of their business requirements and operational processes. Independently support processes related to the implementation of systems into production, including integration of purchased solutions. Design, code, test, debug, and document those models.\n<br><br>\n<strong>BACKGROUND/EXPERIENCE desired:</strong>\n<br><br>\nExperience in software development, or an equivalent combination of education and work experience\n<br><br>\nKnowledge of Machine Learning, Data Mining, Statistics, Applied Mathematics, or a related field\n<br><br>\nExposure to machine learning with domain knowledge and experience in the following areas: data-driven statistical modeling, discriminative methods, feature extraction and analysis, supervised learning\n<br><br>\nFluency or strong ability to learn a software programming language such as Python, Java, C++, etc.\n<br><br>\nExperience with data extraction and analysis.\n<br><br>\n<strong>EDUCATION</strong>\n<br><br>\nThe highest level of education desired for candidates in this position is a Bachelor's degree or equivalent experience.\n<br><br>\n<strong>ADDITIONAL JOB INFORMATION</strong>\n<br><br>\nBachelor's degree in Computer Science, Mathematics or an equivalent combination of education and experience\n<br><br>\nAgile experience is a plus\n<br><br>\nTeam Player: Willing to teach, share knowledge, and work with others to make the team successful.\n<br><br>\nCommunication: Exceptional verbal, written, organizational, presentation, and communication skills.\n<br><br>\nCreativity: Ability to take written and verbal requirements and come up with other innovative ideas.\n<br><br>\nAttention to detail: Systematically and accurately research future solutions and current problems.\n<br><br>\nStrong work ethic: The innate drive to do work extremely well\n<br><br>\nPassion: A drive to deliver better products and services than expected to customers.\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.<br><br>SDL2017"}