{"job title": "Senior Marketing Analytics Consultant", "company": "Aetna", "city state": "– Franklin, TN", "rating": "3.4", "job description": "Req ID: 55625BR\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nThe Senior Marketing Analytics Consultant will assist in building Aetna Senior Supplemental Insurance's marketing analytics capabilities through data mining, connecting our marketing programs together, and linking customer data across multiple systems. Through these efforts, this consultant will make recommendations to improve technology systems, optimize marketing programs, and build customer loyalty across our multiple customer experience functions.\n<br><br>\n<strong>Fundamental Components:</strong>\n<br><br>\nBuilds marketing analytics and reporting capabilities for our business unit.\n<br><br>\nCrosses B2B as well as B2C worlds, focusing on engagement and retention.\n<br><br>\nOptimizes marketing and customer service programs via data analysis and tests.\n<br><br>\nImplements campaign management framework and other standardized processes (e.g., reporting), including data quality, in order to ensure successful execution and continuous improvement of marketing campaigns and initiatives.\n<br><br>\nContinuously develops new ways of applying advanced analytics to solve business problems, maximizes marketing ROI, and improves our abilities to generate demand, engage/retain customers, and measure all of the activities taking place.\n<br><br>\nCollaborates with team members and consults with other departments to build a bigger and better machine.\n<br><br>\nDesigns with a customer service mindset, considering impacts on all parties to create the best solutions to issues.\n<br><br>\n<strong>BACKGROUND/EXPERIENCE desired:</strong>\n<br><br>\n5+ years of directly relevant experience in quantitative marketing and performance analysis role(s) (preferably in the insurance, healthcare, or financial industries.)\n<br><br>\n3+ years of experience using both SQL and Tableau.\n<br><br>\n2+ years of experience in marketing research and/or email analytics.\n<br><br>\nExperience with Qualtrics a plus.\n<br><br>\nExperience with Adobe Analytics and/or Alteryx is a plus.\n<br><br>\nExperience in manipulating large datasets and samples as well as linking data across multiple systems to obtain deeper insights.\n<br><br>\nExcellent understanding of test and learn initiatives and other statistical techniques used to provide analytical support.\n<br><br>\nStrong analytical skills used to identify and resolve problems.\n<br><br>\nAbility to conceptualize business problems, execute solutions, and present findings in a simple manner.\n<br><br>\n<strong>EDUCATION</strong>\n<br><br>\nThe highest level of education desired for candidates in this position is a Bachelor's degree or equivalent experience.\n<br><br>\n<strong>FUNCTIONAL EXPERIENCES</strong>\n<br><br>\nFunctional - Marketing/Market Research/1-3 Years\n<br><br>\nFunctional - Information Management/Survey Experience/1-3 Years\n<br><br>\nFunctional - Information Management/Business information analysis/4-6 Years\n<br><br>\nFunctional - Marketing/Strategy development/1-3 Years\n<br><br>\nFunctional - General Management/Data tools: building &amp; utilization/1-3 Years\n<br><br>\n<strong>TECHNOLOGY EXPERIENCES</strong>\n<br><br>\nTechnical - Database/Microsoft SQL Server/1-3 Years/\n<br><br>\nTechnical - Development Languages/SQL/1-3 Years/\n<br><br>\n<strong>Telework Specifications:</strong>\n<br><br>\nThis position may have some telework flexibility but will need to be based in Franklin, TN. It will be required to be in-office at least part-time during the week.\n<br><br>\n<strong>ADDITIONAL JOB INFORMATION</strong>\n<br><br>\nExcellent compensation and employee benefits.\n<br><br>\nGreat 401(k) program.\n<br><br>\nFamily-friendly atmosphere with employee engagement activities.\n<br><br>\nOffice on the outskirts of Nashville, TN to avoid a lot of the rush hour traffic!\n<br><br>\nBring your creatively analytical mind and rolled-up sleeves and prepare to help build something great!\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.\n<br><br>\nJob Function: Product &amp; Marketing\n<br><br>\nAetna is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected Veterans status."}