{"job title": "Data Scientist -", "company": "Aetna Inc.", "city state": "– New York, New York", "rating": "3.4", "job description": "POSITION SUMMARY\n<br><br>\nLooking for opportunities to use cutting edge technologies analyzing petabytes of data in a world class Hadoop cluster, generating insights to guide consumers in their journey to wellness and help them achieve their health ambitions, whether its running the Inca Trail Marathon or playing tackle football with their grandkids? Aetnas Member Analytics team is focused on delivering strategically-impactful programs and tools to help members across all life stages feel the joy of achieving their best health, in their own way.\n<br><br>\nThis position will work within a cross-functional team, delivering predictive analytics solutions to drive customer engagement and next-best-action, and improve customer experience across critical journeys, e.g., onboarding, breast cancer, maternity. The candidate will be responsible for extracting and manipulating data from multiple, large data sources and using the data to deliver predictive model and solutions to drive member behavior change and experience across channels (mobile app, web, email, social, call center, Apple)\n<br><br>\nFundamental Components:\n<br><br>\nSupports deployment of insights across multiple channels, i.e., web, mobile app, email, social, call center, Apple watchDemonstrates strong ability to communicate technical concepts and implications to peers, managers, and business partnersDevelops and/or uses advanced algorithms and statistical predictive models and determines analytical approaches and modeling techniques to evaluate scenarios and potential future outcomes Uses strong programming skills to explore, analyze and interpret large volumes of data in various forms, and solve complex business problems\n<br><br>\nBACKGROUND/EXPERIENCE desired:5 or more years of progressively complex related experienceDemonstrates proficiency in most areas of mathematical analysis methods, machine learning, statistical analyses, and predictive modeling and in-depth specialization in some areasExpertise in using R or Python to manipulate large data sets and develop statistical modelsExpertise in data management in an Hadoop environment, including use of HiveExcellent problem solving skills, critical thinking and conceptual thinking abilitiesStrong ability to communicate technical concepts and implications to business partnersSome knowledge of health care industry preferred\n<br><br>\nEDUCATION\n<br><br>\nBachelor's degree required, Master's a plus\n<br><br>\nADDITIONAL JOB INFORMATION\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.\n<br><br>\nJob Function: Data &amp; Analytics\n<br><br>\nAetna is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected Veterans status."}