{"job title": "Data Scientist - Commercial Sales", "company": "Aetna", "city state": "– New York, NY", "rating": "3.3", "job description": "Req ID: 53414BR\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nAetnas Commercial Sales Analytics team is seeking a Analytics Consultant to support Local Market and Sales leadership with Business Intelligence and strategic solutions to drive growth for our commercial lines of business. The position will work with a cross-functional team on two primary categories of work: first, to develop and deliver analytics-based recommendations to local market heads of sales to improve sales effectiveness, and second, to help a team of data scientists develop those local market recommendations into web-based analytic opportunities. This role emphasizes the ability to blend technical and business acumen, moving back and forth between executive presentations and analytic execution.\n<br><br>\nA typical work flow for this role would entail interviewing leaders and stakeholders to identify perceived barriers to growth, developing testable hypotheses to overcome these barriers, extracting and analyzing data to test these hypotheses, distilling key findings down to business friendly terms, and finally making actionable recommendations to business leaders in order to overcome those barriers.\n<br><br>\n<strong>Fundamental Components:</strong>\n<br><br>\nDevelops hypotheses based on identified pain points and challenges\n<br><br>\nUses various types of analytical techniques to test hypotheses\n<br><br>\nWorking with structured and unstructured data\n<br><br>\nAbility to write advanced SQL codes (by using any tools/languages like Aginity, SAS, R, Python) to extract and organize data from various data sources (e.g, Hadoop, Netezza, DB2)\n<br><br>\nDeploying quantitative techniques ranging from descriptive statistics to predictive modeling\n<br><br>\nExtracts the so what for business counterparts and distills findings down into simple messages\n<br><br>\nPresents findings and makes recommendations to business leaders\n<br><br>\nInterfaces with developer team to help transform engagement-level findings into scaled analytic applications\n<br><br>\n<strong>BACKGROUND/EXPERIENCE desired:</strong>\n<br><br>\n3+ years of experience blending business and analytics\n<br><br>\nAbility to work with large data sets from multiple data sources.\n<br><br>\nStrong SQL programming skills and experience with SAS programming\n<br><br>\nDemonstrated proficiency in multiple levels of analytic sophistication from descriptive statistics to predictive modeling and data visualization\n<br><br>\nComfort in developing and testing hypotheses, experience with statistical experiments\n<br><br>\nDemonstrates excellent communication skills. Able to present information to various audiences.\n<br><br>\nBachelor's degree or equivalent work experience in Mathematics, Statistics, Computer Science, Business Analytics, Economics, Engineering, or related discipline\n<br><br>\nMasters preferred\n<br><br>\n<strong>EDUCATION</strong>\n<br><br>\nThe highest level of education desired for candidates in this position is a Bachelor's degree or equivalent experience.\n<br><br>\n<strong>ADDITIONAL JOB INFORMATION</strong>\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidate's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately."}