{"job title": "Lead Data Scientist", "company": "Aetna Inc.", "city state": "– New York, New York", "rating": "3.4", "job description": "POSITION SUMMARYLooking for opportunities to use cutting edge technologies analyzing petabytes of data in a world class Hadoop cluster, generating insights to guide consumers in their journey to wellness and help them achieve their health ambitions, whether its running the Inca Trail Marathon or playing tackle football with their grandkids? Aetnas Member Analytics team is focused on delivering strategically-impactful programs and tools to help members across all life stages feel the joy of achieving their best health, in their own way.\n<br><br>\nSUMMARY: This position will play a lead role within a cross-functional team, delivering predictive analytics solutions to drive customer engagement and next-best-action, and improve customer experience across critical journeys, e.g., onboarding, breast cancer, maternity. The candidate will lead a project team responsible for extracting and manipulating data from multiple, large data sources, using the data to deliver predictive models and solutions, partnering with internal stakeholders to target members across channels (mobile app, web, email, social, call center, Apple), and managing day-to-day interactions with business stakeholders\n<br><br>\nFundamental Components: ·Lead team of 2-3 Data Scientists on the development and delivery of predictive analytics solutions to drive behavior change or customer experience across channels· Consults with business partners to understand problems and goals, understand business value, and translate into business opportunities to be captured through predictive analytics solutions· Develops and/or uses advanced algorithms and statistical predictive models and determines analytical approaches and modeling techniques to evaluate scenarios and potential future outcomes · Demonstrates superior communication skills, and ability to develop and participate in presentations and consultations to business stakeholders on analytics results and solutions\n<br><br>\nSupports deployment of insights across multiple channels, i.e., web, mobile app, email, social, call center, Apple watch· Motivates team members and probes into technical detail· Contributes Subject Matter Expertise (SME) through interactions with team members, peers and managers to exchange complex information related to areas of specialization · Mentors others, and champions 360-feedback across team\n<br><br>\nBACKGROUND/EXPERIENCE desired: · Healthcare background - payer, pharmacy, PBM· 7-10 or more years of progressively complex related experience · Advanced in-depth specialization in mathematical analysis methods, machine learning, statistical analyses, and predictive modeling · Expertise in using R or Python to manipulate large data sets and develop statistical models· Expertise in data management in a Hadoop environment, including use of Hive · Excellent problem solving skills, critical thinking and conceptual thinking abilities· Superior skills to effectively communicate technical ideas and results to non-technical clients in written and verbal form·Ability to negotiate and manage interactions across the business and project stakeholders\n<br><br>\nEDUCATION\n<br><br>\nMaster's degree desired, PHD a plus.\n<br><br>\nADDITIONAL JOB INFORMATION\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click hereto review the benefits associated with this position.\n<br><br>\nAetna takes our candidate's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.\n<br><br>\nJob Function: Data &amp; Analytics\n<br><br>\nAetna is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected Veterans status."}