{"job title": "Sr Data Engineer", "company": "Aetna", "city state": "– Hartford, CT", "rating": "3.4", "job description": "Req ID: 55548BR\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nLeads and participates in the design, built and management of large scale data structures and pipelines and efficient Extract/Load/Transform (ETL) workflows.\n<br><br>\n<strong>Fundamental Components:</strong>\n<br><br>\nDevelops large scale data structures and pipelines to organize, collect and standardize data that helps generate insights and addresses reporting needs.\n<br><br>\nWrites ETL (Extract / Transform / Load) processes, designs database systems and develops tools for real-time and offline analytic processing.\n<br><br>\nCollaborates with data science team to transform data and integrate algorithms and models into automated processes.\n<br><br>\nUses knowledge in Hadoop architecture, HDFS commands and experience designing &amp; optimizing queries to build data pipelines.\n<br><br>\nUses strong programming skills in Python, Java or any of the major languages to build robust data pipelines and dynamic systems.\n<br><br>\nBuilds data marts and data models to support Data Science and other internal customers.\n<br><br>\nIntegrates data from a variety of sources, assuring that they adhere to data quality and accessibility standards.\n<br><br>\nAnalyzes current information technology environments to identify and assess critical capabilities and recommend solutions.\n<br><br>\nExperiments with available tools and advises on new tools in order to determine optimal solution given the requirements dictated by the model/use case.\n<br><br>\n<strong>BACKGROUND/EXPERIENCE desired:</strong>\n<br><br>\n5 or more years of progressively complex related experience.\n<br><br>\nHas strong knowledge of large scale search applications and building high volume data pipelines.\n<br><br>\nExperience building data transformation and processing solutions.\n<br><br>\nKnowledge in Hadoop architecture, HDFS commands and experience designing &amp; optimizing queries against data in the HDFS environment.\n<br><br>\nKnowledge in Java, Python, Hive, Cassandra, Pig, MySQL or NoSQL or similar.\n<br><br>\nExperience with bash shell scripts, UNIX utilities &amp; UNIX Commands.\n<br><br>\nAbility to understand complex systems and solve challenging analytical problems.\n<br><br>\nAbility to leverage multiple tools and programming languages to analyze and manipulate data sets from disparate data sources.\n<br><br>\nStrong collaboration and communication skills within and across teams.\n<br><br>\nStrong problem solving skills and critical thinking ability.\n<br><br>\n<strong>EDUCATION</strong>\n<br><br>\nThe highest level of education desired for candidates in this position is a Bachelor's degree or equivalent experience.\n<br><br>\n<strong>ADDITIONAL JOB INFORMATION</strong>\n<br><br>\nAetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.\n<br><br>\nWe care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.\n<br><br>\nTogether we will empower people to live healthier lives.\n<br><br>\nAetna is an equal opportunity &amp; affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.\n<br><br>\nWe are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.\n<br><br>\nBenefit eligibility may vary by position. Click here to review the benefits associated with this position.\n<br><br>\nAetna takes our candidates's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately.\n<br><br>\nJob Function: Data &amp; Analytics\n<br><br>\nAetna is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected Veterans status."}