{"job title": "Data Analyst", "company": "Agentra", "city state": "– Addison, TX", "rating": "4.5", "job description": "<p>Agentra Healthcare Solutions creates lasting and affordable healthcare solutions to the uninsured, underinsured and small business owners. Established in 2005 and based in Dallas, TX (75244), we are a dynamic and rapidly growing insurance provider of affordable proprietary \"boutique\" products for life, health and dental. Agentra has been able to meet the needs of our rapidly expanding client base through strategic partnerships with top rated insurance carriers and benefit providers that have created exclusive products and benefit plans designed to meet the needs of our clients.</p>\n<p>Agentra Healthcare Solutions excels as an organization and as individuals by being consumer focused and helping others achieve their goals. We believe there's no substitute for a strong honest work ethic and we think having some fun is part of our success!</p>\n<p>Our company is experiencing accelerated growth creating opportunity for current and new employees. Come be a part of our success!</p>\n<p><strong> DATA ANALYST</strong></p>\n<p><strong>Job Summary: </strong></p>\n<p><strong> </strong>Agentra is seeking a Data Analyst to assist the organization in creating and modifying business analytics that will provide world class services to our membership and provider partners, as well as creating operational efficiencies and a competitive advantage for Agentra. By performing these duties, Agentra will be able to better communicate with its providers and members, exchange and receive information between providers and members, and provide an overall higher level of service to its members and affiliate entities.</p>\n<p><strong>Essential Job Functions: </strong></p>\n<ul>\n<li>Assists in the design, coding, and testing of technical analytical solutions.</li>\n<li>Applies knowledge of standard system development lifecycle process and utilizes our methodology effectively on all projects.</li>\n<li>Applies knowledge of industry trends and developments to improve service to our clients.</li>\n<li>Clearly articulate roles, project goals, and timelines as they relate to project and development plans, as needed.</li>\n<li>Adheres to coding standards defined by technical management.</li>\n<li>Accurately prepares written business correspondence that is coherent, grammatically correct, effective and professional.</li>\n<li>Accurately employs our development tools.</li>\n<li>Establishes responsible deadlines and personal work plans.</li>\n<li>Listens to others and accepts input from team members.</li>\n<li>Understands BCP, quality, security and compliance requirements for supported areas and analyzes changes for risk to the environment.</li>\n<li>Responsible for plan performance reporting and trend analyses.</li>\n<li>Conducts research and produces actionable insights on healthcare economics issues and trends.</li>\n<li>Analyzes cost and utilization data in order to illustrate financial and operational impact and assists in driving business prioritization and acceptance.</li>\n<li>Clearly articulate ideas and thoughts verbally.</li>\n<li>Accurately prepares written business correspondence that is coherent, grammatically correct, effective and professional.</li>\n<li>Confidently writes the four basic SQL statements.</li>\n<li>Values internal and external clients and responds to their needs as they arise.</li>\n<li>Establishes effective working relationship with other members of the IT team.</li>\n<li>Follows established communication guidelines.</li>\n<li>Uses good judgment in what and how to communicate with clients.</li>\n<li>Accurately completes and submits time in a timely manner.</li>\n<li>Accurately completes and submits status reports in a timely manner.</li>\n<li>Contributes to team effort by accomplishing related results as needed.</li>\n</ul>\n<p><strong>Qualifications: </strong></p>\n<ul>\n<li>Bachelor of Science in Computer Information Systems or equivalent work experience.</li>\n<li>2 plus years of professional experience.</li>\n<li>SQL development experience.</li>\n<li>Experience of Transactional SQL, Stored Procedures, Views, Indexes, DTS, SQL Reporting Service (SSRS) and SSIS package development.</li>\n<li>Experience in data analysis and providing technical solutions to business questions and problems.</li>\n<li>Healthcare experience preferred.</li>\n<li>Latest version of Windows and Windows server.</li>\n<li>Possesses knowledge of various database access methods.</li>\n<li>Possesses basic knowledge of ETL processes.</li>\n<li>Demonstrates basic knowledge of object and component methodology and technology.</li>\n<li>Understands basic relational database concepts and star schemas.</li>\n<li>Basic understanding of version control.</li>\n</ul>\n<p><strong>To Apply:</strong></p>\n<p>Please reply to this posting with a “Word” or “PDF” copy of your most updated resume and include a current phone number. Please include salary expectations.</p>\n<p><strong><u>Other Information:</u></strong></p>\n<ul>\n<li>Vibrant company culture</li>\n<li>On-site exercise facility</li>\n<li>Company Paid Health &amp; Life 100%</li>\n<li>Paid PTO &amp; Holidays</li>\n<li>Optional: Dental, Vision, 401K and more</li>\n<li>Location: North Dallas: Spring Valley Rd. and Midway (75244)</li>\n</ul>\n<p><strong><u>We do not provide sponsorships.</u></strong></p>\n<p><strong>www.agentra.com</strong></p>\n<p> </p>"}