{"job title": "Financial Reporting &amp; Data Analyst - USA", "company": "Agility", "city state": "– Irvine, CA", "rating": "3.5", "job description": "<strong>Job Description</strong>\n<br><br>\nPosition: Financial Reporting &amp; Data Analyst - USA\n<br><br>\nLocation: Irvine, CA (SNA)\n<br><br>\nReporting to: Manager, Financial Planning &amp; Analysis\n<br><br>\nFLSA Classification: Exempt\n<br><br>\n<strong>SUMMARY</strong>\n<br><br>\nThe Financial Reporting and Data Analyst develops financial reports and provides analysis to the US management team. This individual will be required to become proficient with Agility's freight management system, Insight data warehouse and BI reporting tools.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES to include:</strong>\n\n\n<ul>\n<li>Design and distribute reports from Insight data warehouse and BI reporting tool</li>\n<li>Working with Insight team, implement and maintain business rules for customer recognition</li>\n<li>Design and distribute standard customer and volume reports from BI tool.</li>\n<li>Responsible for issuance of daily/weekly/monthly job profitability reports.</li>\n<li>Designs and/or customizes reports to meet business needs as defined by executive team and others</li>\n<li>Performs financial analysis principally associated with customer and product profitability</li>\n<li>Write Control queries to assist in report writing</li>\n<li>Design ad-hoc reports as requested.</li>\n</ul>\n\nJob Requirements\n<br><br>\n<strong>QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Bachelors Degree in Business, Accounting or Finance preferred.</li>\n<li>3+ years of applicable experience, particularly with operational/cost accounting and exposure to related software applications.</li>\n<li>Solid MS Office skills (particularly Excel and Access) and report design experience.</li>\n<li>Interest in and exposure to Business Intelligence software a plus.</li>\n<li>Global logistics industry background a big plus.</li>\n<li>Qualified applicants (internal and external) must currently possess legal authorization to work in the United States</li>\n</ul>\n\n<strong>DESIRED ATTRIBUTES</strong>\n\n\n<ul>\n<li>Team player with flexible approach</li>\n<li>Excellent analytical abilities</li>\n<li>Desire in driving improvements in quality and productivity</li>\n<li>Ability to work under time pressures</li>\n<li>Strong communication skills</li>\n<li>Accustomed to working in a fast-paced, dynamic environment</li>\n</ul>\n\n<strong>LANGUAGE SKILLS</strong>\n<br><br>\nEnglish is the principal language for this position. This position requires good written and verbal communication skills and the ability to communicate effectively in a diverse multicultural environment.\n<br><br>\n<strong>COMPUTER SKILLS</strong>\n<br><br>\nProficiency in the use of Microsoft Office (particularly Excel and Access) and job accounting software application(s).\n<br><br>\n<strong>PHYSICAL DEMANDS</strong>\n<br><br>\nThis position requires the ability to sit or stand for long periods, and use a computer, with a mouse, keyboard and monitor, with or without reasonable accommodations. The ability to operate a motor vehicle and/or occasional travel under economy restrictions may be required for the role.\n<br><br>\n<strong>WORK HOURS AND ENVIRONMENT</strong>\n<br><br>\nTypical working hours for this position are Monday-Friday from 8 AM to 5 PM at the company's Irvine Regional HQ however working beyond these hours may often be required as per project needs.\n<br><br>\nThis position may require occasional domestic and international travel outside the typical working hours. A current passport is required. This position is based out of a corporate office environment, dress code is business casual.\n<br><br>\n<strong>STATEMENT OF NON-INCLUSIVITY:</strong>\n<br><br>\nThis job description is not to be construed as a complete listing of the duties and responsibilities that may be given to any employee. The duties and responsibilities outlined in this position may be added to or changed when deemed appropriate and necessary by the person who is managerially responsible for this position.<br><br>SDL2017"}