{"job title": "Senior Scientist, Process Chemistry", "company": "Agios Pharmaceuticals", "city state": "– Cambridge, MA", "rating": "3.9", "job description": "<div><div><strong>\n<br>\nSenior Scientist, Process Chemistry</strong><br>\n\n<div>\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nAgios Pharmaceuticals HQ</strong>\n</div><br>\n\n<div>\nJob Code\n<br><br>\n<strong>846</strong>\n</div><br>\n\n<div>\n# of openings\n<br><br>\n<strong>1</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div><strong>Senior Scientist, Process Chemistry</strong>\n<br><br>\nAgios (agios.com) is a biopharmaceutical company committed to applying our scientific leadership in cellular metabolism to transform the lives of patients with cancer and rare genetic diseases. We are growing rapidly with an active research and discovery pipeline across both therapeutic areas. Agios has one approved oncology precision medicine and multiple first-in-class investigational therapies in clinical and/or preclinical development.\n<br><br>\nAgios Pharmaceuticals is searching for a dynamic individual to join our growing process chemistry team in building a new generation of pharmaceutical development capabilities, which can deliver transformative precision medicine with quality and speed. The suitable candidate will be able to follow programs as they proceed through development as supporting the overall drug substance development and manufacturing activities. The successful candidate needs to demonstrate a proven track record of solving technical challenges while supporting GMP manufacturing.\n<br><br>\n<strong>Key Responsibilities</strong>\n\n<ul>\n<li>Solve technical challenges relating to external drug substance manufacturing by providing technical leadership within the chemical development group</li> \n\n<li>Responsible for drug substance process design, optimization, scale-up, and technology transfer</li>\n\n<li>Author internal technical reports based on in-house laboratory research and provide critical review of similar reports generated at external CMO/CROs</li>\n\n<li>Identify key knowledge gaps and execute plans to ensure our process understanding is commensurate with a given program’s stage of clinical development</li>\n</ul>\n<strong>Minimum Requirements</strong>\n\n<ul>\n<li>MS or PhD in organic chemistry or chemical engineering with 5-10+ years (MS) or 3-8+ years (PhD) of industry experience</li> \n\n<li>Must have knowledge and understanding of current ICH guidelines, GMP guidelines, and related industry practices</li>\n\n<li>Ability to navigate and be successful in a fast-paced, highly-matrixed work environment</li>\n\n<li>Effective verbal and written communication skills</li> \n</ul>\n<strong>Preferred Qualifications</strong>\n\n<ul>\n<li>Experience managing CROs and CMOs</li>\n\n<li>Experience authoring regulatory documentation in support of clinical trials (IND, QOS, IMPD, Briefing Booklets, etc)</li> \n\n<li>Experience with DOE implementation and data interpretation</li> \n</ul>\n\n</div>\n<br>"}