{"job title": "Data Science Manager - Bangkok", "company": "Agoda", "city state": "– San Francisco, CA", "rating": "3.5", "job description": "If you don't already know us, Agoda is the largest and fastest growing online hotel booking platform in Asia. And as a Booking Holding company, we are part of the largest online travel company in the world. We have the dynamism and short chain of command of a startup and the capital to make things happen. What's stopping you from getting in touch?\n<br><br>\nBangkok: While it's 30°+ outside, our engineers don't sweat, knowing they have the coolest jobs out there. Working in one of the largest international Internet employers headquartered in Asia, your work has an impact on what we do around the globe.\n<br><br>\nWe move fast why wait ages to see your ideas go live? Work on tough challenges, safe in the knowledge that you are surrounded by people as smart as you are (if not smarter!) to help solve them. And while we're on the subject, Agoda people come from over 65 countries: It's an incredible technical creative melting pot.\n<br><br>\nTechnology is not just what we do it's at the heart of who we are. We put cutting-edge technology in your hands so you can help us change the way people run their lives. We want you to come here so they can get there and get your career going places, too.\n<br><br>\nMaintaining this growth requires an incredible amount of data, a superior IT infrastructure, and world class talent to bring it all together.\n<br><br>\nYour role is to:\n\n<ul>\n<li>Manage a team that helps crack our business problems and come up with deployable machine learning models</li>\n<li>Interface with business to make sure they are asking the right questions</li>\n<li>Sift through our data and find us some gems</li> \n\n<li>Be a world-class hands-on deploy master</li>\n</ul>\nCharm us with:\n\n<ul>\n<li>Previous experience managing a team of Data Scientist's</li> \n\n<li>An earned stripes in coding, in data handling, in statistics and in machine learning (5 years of experience is a must.</li>\n<li>A good balance between theory and practice and a strong desire to learn and keep up with the latest technologies (a master degree in a quantitative field is a must; PhD is even better)</li>\n<li>Battle-tested team leading skills</li>\n<li>A good knowledge of what's \"Under the hood\" of statistical methods</li>\n<li>Coding, coding, coding (R, Python, C#, Java, C++, Scala, )</li>\n<li>Some extra points on: SQL, NLP, business acumen, blog writing, good sense of humor</li>\n</ul>\n<strong>We welcome both local and international applications for this role. Full visa sponsorship and relocation assistance available for eligible candidates.</strong>\n<br><br>\n<strong>Agoda is a Booking Holdings (BKNG) company, the world's leading provider of brands that help people book great experiences through technology.</strong><br><br>Apply!"}