{"job title": "Research Scientist", "company": "AiCure", "city state": "– Ny, NY", "rating": "5.0", "job description": "Are you interested in working on challenging computer vision problems and having a real impact on people's health? Read on as this opportunity might be for you..\n<br><br>\nAiCure is a VC-funded startup that leverages mobile technology by combining it with artificial intelligence (computer vision, machine learning, big data) to bring better health, better drugs, and better treatment to everyone on the planet. We’re rapidly expanding and if you’re passionate about making a positive impact, we’d like to hear from you!\n<br><br>\nYou will play a leading role in creating algorithms to solve challenging problems in computer vision on mobile devices. Your work will make a significant impact on our products, and on healthcare for everyone on the planet.\n<br><br>\nWhen participants in clinical trials, or patients in population health use the AiCure apps, information on their medication intake is reported in various dashboard products, which allow stakeholders to gain insights and to take actions (patient alerts, etc.). For example, our apps use computer vision to identify the patient (face recognition), verify that patients are taking the right medication (pill recognition), and that they are actually taking their medication (action recognition).\n<br><br>\nYour mission will be to invent new algorithms and methods to perform the computer vision tasks above (and several more as we continue to expand our product line), ensuring that they outperform the state of the art and work effectively and efficiently in challenging real world scenarios.\n<br><br>\nKey responsibilities\n<ul>\n <li>Research, design, and implement novel algorithms to solve real-world mobile computer vision problems to improve healthcare (more specifically, medication adherence).</li> <li>Implement and create prototypes demonstrating the viability of using the algorithms in practice.</li> <li>Collect relevant training data and run experiments comparing with state of the art methods, with a strong focus on performance in challenging real-world conditions (motion, low-light, etc).</li> <li>Work closely with engineers to ensure that research is appropriately transferred to impact products.</li> <li>Add to our existing extensive patent portfolio.</li> <li>Continuously stay up to date on advances in the research community (e.g., by experimenting with different deep learning models, data sets, algorithms, etc).</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>Ph.D. or M.Sc. degree in CS, EE or a related field from a top-tier university.</li> <li>Strong publication record in top-tier conferences / journals (CVPR, ICCV, NIPS, ICLR, ICML, PAMI, IJCV, etc.)</li> <li>Solid skills in developing prototypes, software engineering (C++, Python, Java, etc.), and running experiments at-scale.</li> <li>Outstanding analytical skills and the ability to take a practical approach to solving problems in real-world settings.</li> <li>Ability to work well with engineers to improve the state of the art and impact our products.</li> <li>Extremely detail-, design-, and user-focused.</li> <li>Excellent communication skills at every level (product, tech team).</li> <li>Excellent time and project management skills.</li> <li>Highly creative, with an outstanding ability to build innovative solutions.</li> <li>Passionate about revolutionizing healthcare and having a positive impact on individuals and everyone on the planet.</li> <li>Experience in healthcare is NOT required.</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\n<strong>Philosophy</strong>\n<br><br>\nOur selection process is highly competitive because we only hire the best, most enthusiastic candidates. Openness, flexibility, creativity, ownership, and accountability are our main pillars. We love solving challenging problems and creating solutions that have real impact on people- at scale.\n<br><br>\n<strong>Impact</strong>\n<br><br>\nWe're on a mission to revolutionize healthcare and when you join us, you'll have the opportunity of having real, tangible impact not only on individuals directly using our technology, but also on how drugs are tested and brought to market across the world. That means everyone on the planet will benefit from what you do. You'll be inspired every day because you'll be making a real difference and you'll see it happen. In real time and at scale.\n<br><br>\n<strong>People</strong>\n<br><br>\nYou'll work with brilliant, positive people who thrive in an interdisciplinary, multi-cultural environment, and are curious, creative, and focused on executing our mission. You'll be up to speed in the the most recent advances in Artificial Intelligence (machine learning, computer vision, big data) while solving challenging problems that must take into account many fascinating aspects of human psychology and behavior. You'll work with scientists, engineers, designers, and medical doctors, to create innovative products that scale in an environment that encourages learning, collaboration, and growth.\n<br><br>\n<strong>Compensation</strong>\n<br><br>\nWe offer great compensation packages that are not only highly competitive, but will allow you to benefit and grow as we expand and scale.\n<br><br>\n<strong>Health Coverage</strong>\n<br><br>\nFull (100%) coverage on medical, dental, and vision insurance plans with one of the biggest health insurance companies in the U.S. You'll have plenty of choices for all of your healthcare needs.\n<br><br>\n<strong>401K</strong>\n<br><br>\nWe offer 401K so you when you retire, you can benefit from all of the great things you do with us.\n<br><br>\n<strong>Fantastic Location</strong>\n<br><br>\nWe're in one of the best and coolest neighborhoods in NYC: in the heart of the trendy Flatiron District, which is extremely well connected, and bustling with culture, food, shopping, cafes, and parks to inspire you.\n<br><br>\n<strong>Office</strong>\n<br><br>\nWe have a fantastic open loft-space with brand new, state of the art equipment including standing desks, snacks, kitchen, areas for mingling and having a break, and plenty of sunshine. Full views of the Empire State Building included."}