{"job title": "Underwriting Data Scientist - Requisition #: JR1813369", "company": "AIG", "city state": "– New York, New York", "rating": "3.1", "job description": "<strong>Functional Area:</strong>\n<br>\nFA - Finance\n<br><br>\nEstimated Travel Percentage (%): No Travel\n<br><br>\nRelocation Provided: No\n<br><br>\nAmerican General Life Insurance Company\n<br><br>\n<strong>Job ID: JR1813369 Underwriting Data Scientist</strong> \n<br><br>\n<strong>Your Future Team</strong>\n<br><br>\nFortitude Re: In 2016, AIG created a third reporting segment, Legacy, to manage non-core assets and liabilities, and businesses in run-off, with the objective of balancing the benefits of return of capital or capital redeployment, with potential near-term reductions in book value. The launch of the Fortitude Re entity in 2017 (formally DSA Re) was an important early step in achieving that objective. AIG continued the Fortitude Re strategy by announcing a strategic partnership with The Carlyle Group to achieve the long-term vision for Fortitude Re. Fortitude Re currently reinsures $36 billion of AIG's Legacy Life and Annuity and General Insurance liabilities. Fortitude Re's diversified risk portfolio, strong claims operation, and efficient administration capabilities provide the foundation for a platform that can be scaled over time to offer unique solutions to external parties. AIG and Carlyle plan to build Fortitude Re into a standalone platform with financial strength that complements its strategically differentiated capabilities. For more information, please visit http://www.aig.com/investor-relations\n<br><br>\nThis position will work directly with the senior underwriting staff to develop and maintain underwriting tools and study Fortitude Re, counter-party, and industry portfolio characteristics.\n<br><br>\n<strong>Your Contribution</strong> \n<br><br>\nThis individual will need to have excellent data handling and systems capabilities and a strong understanding of data cleansing and statistical modeling. This role will be responsible for evaluating the adequacy of data and data quality for the conclusions we draw. This includes pricing and risk structure decisions on transactions between 100MM and 1BN in liabilities. This person will also be expected to understand data generating processes and model frameworks to be able to provide management with feedback regarding appropriate model structure.​\n<br><br>\n<strong>This position's responsibilities include:</strong>\n\n<ul>\n<li>Identify potential data sources, internal and external</li><li>Provide solutions to data problems, erroneous or missing data</li><li>Develop metrics or visualizations for rapidly evaluating the reasonability of results and identifying changes and unusual events</li><li>Creative solutions to information limitations, including harvesting data from public data sources and leveraging research from diverse, non-insurance sources</li><li>Present pros and cons of data sources and modeling methods with understanding and consideration of the ultimate goal of their analysis. Data Scientist should be comfortable making decisions and defending them</li><li>Analyze potential solutions to gaps in data or understanding leveraging the latest research outside the insurance and financial services industry</li><li>Contribute to the broader quiver of models and research with constructive suggestions</li>\n</ul>\n\n<strong>What we are looking for</strong>\n\n<ul>\n<li>Deep programming and data cleansing experience across an array of data sources and programming languages. Experience should demonstrate versatility</li><li>Proactive and independent problem solver</li><li>Experience building and mathematical and statistical models in excel and [R]. Bayesian and Machine Learning experience is a plus</li><li>Extensive experience with various data-sets and have comfort in multiple platforms (e.g., Oracle, Netezza, DB2, Hadoop) as well as multiple programming languages (e.g., [R], Python, C++)</li><li>Strong understanding of classic data cleansing techniques</li><li>Background with insurance data</li><li>Deep understanding of mathematical modeling first-principles and economics is a strong plus.</li><li>A strong candidate with the necessary skills and relevant background but without a graduate degree will be considered.</li>\n</ul>\n\nIt has been and will continue to be the policy of American International Group, Inc., its subsidiaries and affiliates to be an Equal Opportunity Employer. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories.\n<br><br>\nAt AIG, we believe that diversity and inclusion are critical to our future and our mission - creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectives.\n<br><br>\nRequisition #: JR1813369"}