{"job title": "Data Scientist", "company": "AIM Consulting Group, LLC", "city state": "– Minneapolis, MN", "rating": "4.2", "job description": "<p><strong>Note: AIM Consulting employs a local delivery model and does not provide visa sponsorship.<br><br>Overview</strong></p>\n<p>We are seeking experienced Data Scientists to join our Data and Analytics team. This is a great opportunity for results-oriented, entrepreneurial individuals who have a great record of accomplishment for delivering business results. As a data scientist on our team, you will help to build models that will inform the way our clients run their businesses. You will help them go from big data to production with state of the art prediction models. You will help the business visualize data and draw out insights and interact with engineering and product management teams to implement your models. Join us today, and become a leader of this highly motivated, cooperative, and fun-loving team!</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manipulating data and helping develop methodologies to model and predict business outcomes</li>\n<li>Prototyping, developing, and refining data-driven product metrics and features</li>\n<li>Helping to govern and manage the enormous and complex pipeline of data that the client uses in their product and decision-making.</li>\n<li>Helping to develop the skills of the broader data and analytics team as data-savvy leaders who ask great questions and make informed decisions</li>\n</ul>\n<p><strong>Required:</strong></p>\n<ul>\n<li>Knowledge of relational databases (SQL)</li>\n<li>Ability to work with large semi-structured datasets (Hadoop, Spark)</li>\n<li>Fluency in a modeling language such as R, Python scientific computing libraries, or Matlab.</li>\n<li>Experience in NoSQL database (e.g. MongoDB) and Relational database (e.g., Oracle, SQLServer or PostgreSQL)</li>\n<li>MS in Computer Science, Machine Learning, Operations Research, Applied Mathematics, Applied Economics or in another highly quantitative field</li>\n<li>3+ years of hands-on experience in data mining, machine learning, and/or quantitative analysis</li>\n<li>Ability to distill problem definitions, models and constraints from informal business requirements, and to deal with ambiguity and competing objectives</li>\n<li>A natural curiosity and desire to learn</li>\n</ul>\n<p><strong>Desired:</strong></p>\n<ul>\n<li>PhD in Computer Science, Machine Learning, Operations Research, Applied Mathematics, Applied Economics or in another highly quantitative field</li>\n<li>3+ years of hands-on experience in predictive modeling and analysis</li>\n<li>Expertise at working with very large, disparate data sets, including charting and visualizations</li>\n<li>Strong communication and data presentation skills</li>\n</ul>\n<p><strong>Why AIM Consulting?</strong></p>\n<p>AIM Consulting, an Addison Group company, is a rapidly growing leader in technology consulting services and solutions delivery that helps companies compete effectively in the digital world. AIM’s differentiation is its ability to build long term relationships with the best technology consulting talent in the region and to deliver end-to-end on business-critical initiatives with modern technologies and processes. Founded in 2006, AIM Consulting provides strategic guidance and scalable project teams in the areas of <em>Application Development</em>, <em>Data &amp; Analytics</em>, <em>Delivery Leadership</em>, <em>Digital Experience &amp; Mobile</em>, and <em>Infrastructure, Cloud and Enterprise Service Management.</em> Headquartered in Seattle with offices in Denver and Minneapolis and the capability to deliver solutions across the US, AIM Consulting has been repeatedly recognized as one of the nation’s fastest growing private companies and best places to work. Learn more at aimconsulting.com.</p>\n<p>Our approach is straightforward and focused on you and your long-term career growth. We want to understand who you are, what your strengths are and what you are looking to do. Because of the strength of the relationships we have with local companies and leaders, we can present you with career-changing projects. If we don’t have a project that is right for you at first, we continue to keep in touch, even if it’s just to check in and see how things are going. Our objective is to help you build a career that is going to excite your passion for technology, compensate you appropriately, and seriously enrich your life.</p>\n<p><strong>Reasons to join the AIM Consulting team</strong></p>\n<ul>\n<li>Work on the most interesting projects</li>\n<li>Accelerate your career growth and experience</li>\n<li>Build insight into company cultures</li>\n<li>Get ongoing career support and commitment</li>\n<li>Enjoy competitive compensation and benefits packages</li>\n</ul>"}