{"job title": "Data Scientist - Analytics, China", "company": "Airbnb, Inc.", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "We are looking for talented Data Scientists to join our China Data Science team. Working alongside other team members to dig deep into Airbnb's marketplace data, you will help translate complex findings and results into a compelling narrative about this highly strategic, fast-growing market. In this role, you will have tremendous upwards exposure as the Data Science team's mouthpiece to senior business partners. If you're passionate about leveraging data to drive business and product decisions, we want to hear from you.\n<br><br>\nIn China, international travel spend is already greater than the US and growing much more quickly. Airbnb views China as a highly strategic market, and believes that the travel network we have built globally in years has best positioned us to provide Chinese guests with unique travel experiences and help them belong anywhere. The hugely different cultural expectations and internet environment (e.g., no facebook/google sign up), combined with the strategic importance, have led to the investment of a dedicated China team.\n<br><br>\nThe team builds products that deeply integrate with local norms (e.g., allow WeChat sign in / sharing, payment with Alipay, etc.) and culturally make sense to Chinese users (e.g., redesign China specific product flows to better serve Chinese users) in order to accelerate our growth rate in China and get the compounding growth effect as large as possible, as soon as possible. The ideal candidate has an eye for detail, great communication, a keenness for problem solving, and a passion for China markets.\n<br><br>\ntechrecruitingcn@airbnb.com\n<br><br>\nThe work for DS analytics in China:\n\n\n<ul>\n<li>Lead the effort to communicate state of the business to stakeholders regularly - enable China team to understand the reasons behind the trends - and provide insights to drive strategic decisions</li>\n<li>Build key data sets/pipelines to empower operational and exploratory analysis.</li>\n<li>Evaluate and define product and business metrics.</li>\n<li>Democratize data by building and socializing decision tools (dashboards, reports).</li>\n<li>Partner with other data scientists to \"tell the story\" behind the data.</li>\n</ul>\n\n<strong>Minimum qualifications:</strong>\n\n\n<ul>\n<li>This position bases in Airbnb Beijing Office</li>\n<li>3+ years of industry experience with proven business impact; degree in quantitiave field preferred</li>\n<li>Experience working with cross-functional teams to gather requirements and define the right metrics to describe the state of the business - both on a macro-level and a micro-level</li>\n<li>Passion for creating highly usable and thorough dashboards/visualizations</li>\n<li>Excitement about working on China</li>\n<li>Speaks fluent Chinese and proficient English</li>\n<li>Strong analytical thinking and communication skills..</li>\n<li>Proactiveness and ability to learn quickly.</li>\n<li>Expert at SQL or other querying language.</li>\n<li>Experience building large dashboard end-to-end (including visualization and data pipeline) that serves a big team</li>\n<li>Experience with common analysis tools such as SQL, R, and Python</li>\n<li>Experience guiding product decisions based on data and A/B testing a plus but not required</li>\n</ul>\n\nApply Now<br><br>SDL2017"}