{"job title": "Data Scientist", "company": "Albemarle Corp", "city state": "– Charlotte, NC", "rating": "3.5", "job description": "Are you inspired by \"what's next\"? So are we.\n<br><br>\nWhen you join the Albemarle team, you contribute to a better tomorrow. You will play a role in powering many of the world's largest and most critical industries, from energy and communications to transportation and electronics. We are putting innovation to work to improve people's lives and we want YOU to be a part of it.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nThe Data Scientist role is a key position in the Data Science team. Primary focus is on data mining&amp;database development, data analysis&amp;correlation development, scenario design&amp;test, statistical trends, regressions, and forecasting.\n<br><br>\nThe role includes, but is not limited to the following duties:\n\n\n<ul>\n<li>Perform special market research and other projects as assigned with focus on mathematical modeling and data analysis</li>\n<li>Find, track, analyze, and communicate global economic data and trends impacting Albemarle business areas/products, both current and future</li>\n<li>Use data to create models that depict trends in the customer base and market dynamics</li>\n<li>Work with GBU/Divisional leadership to outline the specific data needs for each business and determine core analytics to be provided to manage business effectively</li>\n<li>Facilitate and champion a data-driven decision culture</li>\n</ul>\n\n<strong>Education:</strong>\n<br><br>\nBS in Business, Mathematics, Engineering or Science related discipline.\n<br><br>\nMS/PhD preferred.\n<br><br>\n<strong>Experience:</strong>\n\n\n<ul>\n<li>10 years data analytics experience</li>\n<li>Chemical industry experience preferred</li>\n<li>Experience in Lithium/Energy Storage portfolio preferred</li>\n</ul>\n\n<strong>#LI-VS1</strong>\n<br><br>\nChoose to unlock your full POTENTIAL. Apply today.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n<strong>Experience:</strong>\n<br><br>\n<strong>Education:</strong>\n<br><br>\n<strong>Language:</strong>"}