{"job title": "Data Scientist AH Finance Zaandam", "company": "Albert Heijn", "city state": "– ", "rating": "3.7", "job description": "Albert Heijn is de grootste retailer van Nederland, en ook de grootste online foodretailer van Nederland, met ruim 1000 winkels, (bijna) real time transactie en voorraadsystemen, geanonimiseerde bonuskaartdata en de grootste foodwebwinkel van Nederland.\n<br><br>\nHet Albert Heijn Finance team is verankerd in het hart van Albert Heijn. Met een echte business partner rol is Finance één van de drijvende krachten achter de continue verbetering van de performance en zitten dus heel dicht op cruciale beslissingstrajecten. Vanuit een integrale benadering van de business identificeren wij voortdurend nieuwe mogelijkheden om waarde en groei te creëren.\n<br><br>\nWij beschikken over grote hoeveelheden data en halen hier waarde uit via data science technieken. Hiervoor gebruiken wij machine learning technieken als tijdserie analyse, gradient boosting en random forests. Running times zijn laag door de state-of-the-art infrastructuur van Microsoft Azure.\n<br><br>\nAls data scientist ligt je passie in data vertalen naar relevante inzichten. Het Finance team waarvoor je werkt zit dicht bij alle beslisprocessen. De inzichten die je vindt en de modellen die je ontwikkelt, zullen Albert Heijn blijvend verbeteren. Je werkzaamheden vallen uiteen in drie onderdelen: Afstemmen van vraagstukken met stakeholders, brainstormen met het team over oplossingen en het uitvoeren van analyses/bouwen van modellen. Het team is jong, nieuw en opereert autonoom, je zal een grote impact hebben op de visie en werkzaamheden.\n<br><br>\nOm dit mogelijk te maken ben je van nature nieuwsgierig naar beschikbare en potentiële nieuwe databronnen en hun onderliggende dynamiek en context. Je bent een onderzoeker die zoekt naar verbanden tussen databronnen en –stromen, en zoekt naar mogelijkheden om data te koppelen, analyseren, modelleren en visualiseren. Hiermee kom je tot diepe inzichten die in samenwerking met andere afdelingen vertaald worden naar waarde voor Albert Heijn.\n<br><br>\nDe vraagstukken waar je je mee bezig houdt zijn divers. Denk aan korte termijn vraagstukken zoals de effectiviteit van een promotie of de impact van assortimentswijzigingen, maar ook lange termijn vraagstukken zoals de strategie rondom investeringsbeslissingen bij winkels en het voorspellen van de omzet voor de komende jaren.<br><br>De Baan\n\n\n<ul>\n<li>Een uitdagende baan met veel ruimte voor pionieren en innovatie op een dynamische spin in het web plek in het hart van de organisatie</li>\n<li>Grote impact op de resultaten en strategie van Prijs, Promo, Presentatie en Productdata bij de beste supermarkt van Nederland</li>\n<li>Uitstekende arbeidsvoorwaarden</li>\n<li>Een gouden Bonuskaart</li>\n</ul>\n\nWij vragen\n\n\n<ul>\n<li>Afgeronde WO-master in de richting van Computer Science, Toegepaste Wiskunde, AI, Econometrie of vergelijkbaar</li>\n<li>Minimaal 3 jaar aantoonbare ervaring als Data Scientist</li>\n<li>Aantoonbare ervaring met tijdserie en regressie analyse is een must</li>\n<li>Ervaring met schrijven van queries bij grote datasets</li>\n<li>Je bent in staat zelfstandig samen te werken met andere afdelingen om toepassingen te ontwikkelen</li>\n<li>Gevorderde ervaring in Python en/of R</li> \n\n<li>Enige ervaring met Machine Learning en bijbehorende packages (scikit-learn, Tensorflow, Mocha.jl, Golearn) is een pre</li>\n<li>Ervaring met Visualisatie tools zoals Tableau of PowerBI is een pre</li>\n<li>Je opereert goed in teamverband, en hebt een professionele uitstraling</li>\n<li>Uitstekende beheersing van de Nederlandse en Engelse taal in woord en geschrift</li>\n</ul>"}