{"job title": "Research Scientist I, Preclinical Pharmacology", "company": "Alexion Pharmaceuticals", "city state": "– New Haven, CT", "rating": "2.5", "job description": "<div><strong>Position Summary</strong>\n<br><br>\nThe Research Scientist I will work within the Preclinical Pharmacology Department to contribute to projects from the Alexion portfolio for development of new in vivo models, plan and execute experiments, and present results.\n<br><br>\n<strong>Principal Responsibilities</strong>\n\n<ul>\n\n\t<li>Play a key role in the development of new synthetic and/or biologic drugs for rare diseases.</li>\n<li>Perform in vitro and in vivo experiments to address key mechanistic and pharmacological scientific questions in cellular and physiological metabolism, cell signaling, and inflammation.</li>\n<li>Develop, execute, and trouble-shoot immunoassays, including plate-based assays and microscopy Quantify and translate of experimental results to advance the understanding of how metabolic pathways and complex physiological systems are altered by diseases and how they respond to therapeutic interventions.</li>\n<li>Share and contribute scientific and technical know-how and experience with team members while promoting cross-functional teamwork</li>\n<li>Interface with an interdisciplinary team of scientists and engage in both target exploration and to advance portfolio programs.</li>\n<li>Manage work flow to assure timely reporting of data to the project team or supervisor</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n\n\t<li>The Research Scientist I should have 0 - 2 years of relevant industrial/postdoctoral experience</li>\n<li>Familiar and experienced on metabolic and/or autoimmnume disorders</li>\n<li>Experience with in vivo modeling and manipulations</li>\n<li>Demonstrated track record of independent critical thinking and scientific achievement in research, exemplified by a strong publication in leading journals or awards</li>\n<li>Highly motivated and interactive, demonstrating innovative and interdisciplinary thinking towards target validation with the ability to succeed in a team environment to achieve changing project goals and meet timelines</li>\n<li>Excellent skills in written and oral communication, organization and multitasking, and working in a highly collaborative and cross-functional research environment</li>\n</ul>\n<strong>Education</strong>\n<br><br>\nPh.D. or equivalent degree in Biology, Pharmacology, Pathology, or related discipline, with 0 - 2 years of relevant postdoctoral or industrial experience\n<br><br>\n*LI-DD1\n<br><br>\nNew Haven, CT, United States\n<br><br>\nSome opportunities happen only once in a lifetime – like a job where you have the extraordinary opportunity to change lives. At Alexion, such opportunities arise through our unwavering mission to serve patients and families affected by rare diseases. These patients are our guiding star, and we act with integrity, urgency, and discipline because we know their lives are at stake.\n<br><br>\nAlexion is a multinational biopharmaceutical company with approximately 2,500 dedicated employees serving patients in more than 50 countries through the innovation, development, and commercialization of life-changing therapies. As the global leader in complement biology, Alexion developed and commercializes the first and only approved complement inhibitor to treat patients with paroxysmal nocturnal hemoglobinuria (PNH), atypical hemolytic uremic syndrome (aHUS), and anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG). In addition, Alexion has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). Our research efforts focus on novel molecules and targets in the complement cascade, and our development efforts focus on our core therapeutic areas of hematology, nephrology, neurology, and metabolic disorders.\n<br><br>\nAlexion’s aspiration is to be the most rewarding place to work, where people are empowered to make a difference and where diversity of backgrounds and ideas is encouraged. We are looking for talented individuals who share our passion and commitment to change the lives of patients with rare diseases. We hope you will consider joining our team.\n<br><br>\nAs a leading employer in our industry, Alexion is proud to offer a highly competitive package of base and incentive compensation as well as a comprehensive benefits program designed to support the health, wellness and financial security of our employees and their families. Benefits include group medical, vision and dental coverage, group and supplemental life insurance, 401(k) with company match, tuition reimbursement, relocation assistance and much more. To learn more about Alexion, please visit www.alexion.com.\n<br><br>\nAlexion is an Equal Opportunity /Affirmative action employer</div>\n<br>"}