{"job title": "Development Scientist I, Upstream Process Development", "company": "Alexion Pharmaceuticals", "city state": "– New Haven, CT", "rating": "2.5", "job description": "<div><strong>Position Summary</strong>\n<br><br>\nThe Development Scientist I is responsible for leading and executing efforts for upstream process development to support pre-clinical, early, late phase and commercial programs. This position is expected to require &gt; 75% of the time supporting in laboratory activities. The ideal candidate will have in-depth of knowledge of microbial and mammalian cell culture. Experience with upstream process development is desired. The candidate is expected to lead project teams, perform detailed scientific research, execute experiments, analyze experimental data, provide recommendations to improve efficiency of process workflows, and improve robustness while ensuring regulatory compliance. The Development Scientist I will support teams in a cross-functional environment, collaborating with other members of Global Product Development.\n<br><br>\n<strong>Principal Responsibilities</strong>\n\n<ul>\n\n\t<li>Lead efforts to design and conduct experiments and apply methods for the generation and cloning of mammalian cell lines (30%)</li>\n<li>Support development and optimization of robust and scalable upstream processes for GMP manufacturing of biologics for clinical and commercial supply (20%)</li>\n<li>Act as a technical expert in mammalian transfection, routine cell culture, single cell cloning, and bank preparation in collaboration with cross-functional teams (20%)</li> \n\n<li>Lead team efforts to seek out and evaluate novel technologies to enhance microbial and mammalian cell culture process development (15%)</li>\n<li>Author technical protocols, reports and peer-reviewed external journal articles (10%)</li>\n<li>Communicate scientific findings to colleagues in cross-functional teams through informal and formal presentations (5%)</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n\n\t<li>Expertise in microbial fermentation and mammalian cell culture is preferred</li>\n<li>Technical proficiency with laboratory automation and high throughput technologies is preferred</li>\n<li>Proven ability to prioritize between projects and allocating effort accordingly and assisting others in similar assessments is preferred</li>\n<li>Technical proficiency, scientific creativity, strong leadership, advanced problem solving skills, and strong capability to collaborate with others is preferred</li>\n<li>Strong statistical analysis background and skills in DOE is preferred</li>\n<li>Good oral and written communication skills are essential with experience in writing and reviewing technical reports supporting regulatory filings</li>\n<li>Excellent collaboration skills and experience working in cross functional teams</li>\n<li>Ability to conduct critical evaluation of scientific documentation and testing data</li>\n<li>Experience in Lean Six Sigma or equivalent methodologies is desired</li>\n</ul>\n<strong>Education</strong>\n<br><br>\nA successful candidate will typically hold a Ph.D. in Biochemistry / Chemical Engineering / Biochemical Engineering or related fields with 0 – 2 years of experience, a M.S. in related fields with 6+ years of experience, or B.S in related fields with 8+ years of experience in biotechnology or the pharmaceutical industry.\n<br><br>\n*LI-DD1\n<br><br>\nNew Haven, CT, United States\n<br><br>\nSome opportunities happen only once in a lifetime – like a job where you have the extraordinary opportunity to change lives. At Alexion, such opportunities arise through our unwavering mission to serve patients and families affected by rare diseases. These patients are our guiding star, and we act with integrity, urgency, and discipline because we know their lives are at stake.\n<br><br>\nAlexion is a multinational biopharmaceutical company with approximately 2,500 dedicated employees serving patients in more than 50 countries through the innovation, development, and commercialization of life-changing therapies. As the global leader in complement biology, Alexion developed and commercializes the first and only approved complement inhibitor to treat patients with paroxysmal nocturnal hemoglobinuria (PNH), atypical hemolytic uremic syndrome (aHUS), and anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG). In addition, Alexion has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). Our research efforts focus on novel molecules and targets in the complement cascade, and our development efforts focus on our core therapeutic areas of hematology, nephrology, neurology, and metabolic disorders.\n<br><br>\nAlexion’s aspiration is to be the most rewarding place to work, where people are empowered to make a difference and where diversity of backgrounds and ideas is encouraged. We are looking for talented individuals who share our passion and commitment to change the lives of patients with rare diseases. We hope you will consider joining our team.\n<br><br>\nAs a leading employer in our industry, Alexion is proud to offer a highly competitive package of base and incentive compensation as well as a comprehensive benefits program designed to support the health, wellness and financial security of our employees and their families. Benefits include group medical, vision and dental coverage, group and supplemental life insurance, 401(k) with company match, tuition reimbursement, relocation assistance and much more. To learn more about Alexion, please visit www.alexion.com.\n<br><br>\nAlexion is an Equal Opportunity /Affirmative action employer</div>\n<br>"}