{"job title": "Associate Director, Safety Surveillance Scientist", "company": "Alexion Pharmaceuticals", "city state": "– Boston, MA", "rating": "2.5", "job description": "Position Summary\n<br><br>\nThe Associate Director, Safety Scientist plays a pivotal role within Global Pharmacovigilance to ensure safety assessment for all Alexion products, in close collaboration with the product assigned Global Medical Safety Leads/Medical Safety Director. The Scientist is responsible for aggregate review and reporting of safety data from various sources in support of regulatory aggregate reporting requirements, as well as safety surveillance and risk management activities pertaining to Alexion products.\n<br><br>\nThis includes:\n\n<ul>\n<li>Creation, coordination, preparation, and completion of aggregate safety reports for Alexion products (e.g.PSUR, PBRER, PADER) for submission to regulatory agencies around the world, as well as internal safety surveillance documents/’white papers’</li>\n<li>Handling internal ad hoc queries/reports, analyzing/summarizing safety data from various sources, and management of signal detection activities</li>\n<li>Development and management Risk Management and Pharmacovigilance Plans and risk management activities for Alexion products, including the management of the operations of benefit risk committee and resulting action plans</li>\n</ul>\nJob Duties &amp; Responsibilities\n<br><br>\nResponsibilities for this role include, but are not limited to:\n\n<ul>\n<li>Participate in ongoing safety data review and analysis for products in designated therapeutic areas</li>\n<li>Assists Global Safety Physicians in developing a strategy for safety-related regulatory activities</li>\n<li>Responsible for project managing and authoring of safety documents including PSUR, PBER, PADER, RMP, REMS, CSRs, and ad hoc requests in collaboration safety physicians .</li>\n<li>Authors high quality aggregate safety reports to meet regulatory and internal deadlines; ensures all safety regulatory documents are processed and submitted according to regulatory requirements</li>\n<li>Responsible for authoring safety section in collaboration with team members on regulatory responses, IBs/CCDS, Data Monitoring Committees reports and requests, and other documents, and provide the necessary quality control</li>\n<li>Performs routine signal detection &amp; discusses the results with safety physician for assigned products and ensures adequate documentation and tracking of the analysis results.</li>\n<li>Participates in GSC for topics of their expertise</li>\n<li>Prepares presentation of the Global Safety Team’s recommendations on safety issues to the cross-functional decision-making bodies</li>\n<li>Manage portfolio of products/projects related to risk management; assists Safety Physicians in the development of risk management strategy and activities for assigned products\n\n\n<ul>\n<li>Write and prepare risk management documents, including Risk Management Plans, Pharmacovigilance Plans and Risk Minimization Plans or REMS for submission to regulatory agencies</li>\n<li>Ensure all risk management documents are prepared according to regulatory requirements and facilitate review and sign-off</li> \n\n<li>Develops or updates strategy and content for regional risk management plans, in collaboration with local safety officer</li>\n<li>Assists Safety Physicians to oversee risk minimization activities including tracking of activities as needed</li>\n<li>Assists in the evaluation of risk minimization activity</li>\n<li>Assist with responses to regulatory inquiries related to risk management plans under the guidance of global safety physicians</li>\n</ul>\n\n</li>\n<li>Supports activities related to new drug applications and other regulatory filings</li>\n<li>Contribute to on-going process enhancement for safety analytics and reporting, such as developing standard procedures and templates</li>\n<li>Participate in other teams and committees as assigned</li>\n</ul>\nEssential Qualifications\n\n<ul>\n<li>Bachelor’s degree in a biologic/medical/clinical/nursing field</li>\n<li>At least 5+ year experience in pharmaceutical industry in drug safety/pharmacovigilance</li>\n<li>Experience with Risk Management and Minimization programs</li>\n<li>Experience preparing post marketing safety regulatory documents including PSURs, PBRERs and Risk Management Plans</li>\n<li>Experience with clinical development including risk/benefit analysis and safety assessment</li>\n<li>Knowledge of US and Ex-US pharmacovigilance risk management regulations</li>\n<li>Strong analytical and problem solving skills</li>\n<li>Excellent communication and interpersonal skills</li>\n<li>Strong scientific writing skills</li>\n<li>Demonstrated learning agility and ability to work independently, seeking advice as required</li>\n<li>Ability to interact effectively with people of multiple disciplines and cultures both within and outside the company on a global basis</li>\n<li>Expertise with Microsoft Word, PowerPoint, SharePoint and Excel</li>\n</ul>\nPreferred Qualifications\n\n<ul>\n<li>Advanced degree in a biologic/medical/clinical/nursing field</li>\n<li>Preferred: Pharmacist/PharmD or BS/Masters in Nursing with a few years of clinical experience</li>\n<li>Experience with various roles in drug safety, e.g. in case processing, operations</li>\n<li>Expertise with PV clinical and safety databases (e.g., structure and conventions)</li>\n<li>Experience in MedDRA coding and search strategies</li>\n<li>Specific medical writing experience</li>\n<li>Project leadership skills with strong organizational and prioritization skill</li>\n</ul>\n*LI-MW1\n<br><br>\nBoston, MA, United States\n<br><br>\nSome opportunities happen only once in a lifetime – like a job where you have the extraordinary opportunity to change lives. At Alexion, such opportunities arise through our unwavering mission to serve patients and families affected by rare diseases. These patients are our guiding star, and we act with integrity, urgency, and discipline because we know their lives are at stake.\n<br><br>\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the discovery, development and commercialization of life-changing therapies. As the global leader in complement biology and inhibition for more than 20 years, Alexion has developed and commercializes the first and only approved complement inhibitor to treat patients with paroxysmal nocturnal hemoglobinuria (PNH), atypical hemolytic uremic syndrome (aHUS), and anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). In addition, the company is developing two late-stage therapies, a second complement inhibitor and a copper-binding agent for Wilson disease. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, and metabolic disorders. Alexion has been named to the Forbes list of the World’s Most Innovative Companies seven years in a row and is headquartered in Boston, Massachusetts’ Innovation District. The company also has offices around the globe and serves patients in more than 50 countries.\n<br><br>\nAlexion’s aspiration is to be the most rewarding place to work, where people are empowered to make a difference and where diversity of backgrounds and ideas is encouraged. We are looking for talented individuals who share our passion and commitment to change the lives of patients with rare diseases. We hope you will consider joining our team. Further information about Alexion can be found at: www.alexion.com.\n<br><br>\nAs a leading employer in our industry, Alexion is proud to offer a highly competitive package of base and incentive compensation as well as a comprehensive benefits program designed to support the health, wellness and financial security of our employees and their families. Benefits include group medical, vision and dental coverage, group and supplemental life insurance, 401(k) with company match, tuition reimbursement, relocation assistance and much more."}