{"job title": "Data Scientist (Portland, OR or Orange, CA)", "company": "Alignment Healthcare", "city state": "– Portland, OR", "rating": "3.6", "job description": "Candidates will be accepted from Portland, OR or Orange, CA\n<br><br>\nAlignment Healthcare is a data and technology driven healthcare company focused partnering with health systems, health plans and provider groups to provide care delivery that is preventive, convenient, coordinated, and that results in improved clinical outcomes for seniors.\n<br><br>\nWe are experiencing rapid growth (backed by top private equity firms), our Data Science &amp; Advanced Analytics team is looking for the best and brightest leaders. Data drives the way we make decisions. We love our customers and understanding them better makes it possible to provide the best clinical outcome and care experience.\n<br><br>\nThis position will play a key role in uncovering deep insights from data using machine learning technologies and advanced statistical analysis, processing very large data sets using cloud-based data pipelines, variety of analytic tools, visualizations and delivering actionable healthcare insights &amp; solutions.\n<br><br>\n<strong>Problems you will work on every day will include:</strong>\n<ul>\n<li>How do we define customer segments to better understand our customers, and tailor the clinical outcome and healthcare care experience for them?</li><li>How do we define clinical outcomes for these customers and understand what variables are key to this success?</li><li>How do we improve our experimentation process and analysis?</li><li>Build statistical models, apply machine learning techniques, analyze very large data sets and construct metrics using these modeling techniques.</li><li>Ensuring data quality throughout all stages of acquisition and processing, including data collection, ground truth generation, normalization and transformation</li><li>Guiding critical business decisions by highlighting opportunities, identifying correlations, defining experiments and figuring out cause and effect relationships.</li><li>Deploying models in operational software to power insights and actions.</li><li>Develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Masters in Computer Science, Engineering, Mathematics, Statistics, or related field</li><li>2+ years relevant experience in predictive modeling and analysis.</li><li>Experience with machine learning algorithms, including deep neural networks, natural language processing, kernel methods, dimensionality reduction, ensemble methods, hidden Markov models and graph algorithms.</li> <li>Experience with machine learning, data mining, and analytics techniques</li><li>Experience in using Python, R, Java, Scala, Weka, Matlab and/or other statistical/machine learning software.</li><li>Experience with data visualization and presentation, turning complex analysis into insight.</li><li>Knowledge and experience of SQL.</li><li>Excellent communication, analytical and collaborative problem-solving skills</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>PhD in Computer Science, Electrical Engineering, Mathematics, Statistics, or related field</li><li>Healthcare domain and data experience</li><li>Experience or academic specialization in entity resolution or disambiguation, information retrieval, machine learning, or natural language processing</li><li>Previous experience with statistical, econometric, and/or machine learning modeling</li><li>Previous experience in a ML or data scientist role with a large technology company</li><li>Understanding of relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etc.</li><li>Knowledge of scripting for automation (e.g. Python, Perl etc.)</li><li>Experience with AWS, Azure or GCP is a plus</li> <li>Experience with NoSQL, Spark, Hadoop, Elasticsearch etc.</li><li>Demonstrable track record dealing well with ambiguity, prioritizing needs, and delivering results in an agile, dynamic startup environment</li>\n</ul>\n<strong>Position Location:</strong>\n<ul>\n<li>Portland, Oregon OR Orange, California</li>\n</ul>\n<strong>Essential Physical Functions:</strong>\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<ul>\n<li>While performing the duties of this job, the employee is regularly required to talk or hear. The employee regularly is required to stand, walk, sit, use hand to finger, handle or feel objects, tools, or controls; and reach with hands and arms.</li><li>The employee frequently lifts and/or moves up to 10 pounds. Specific vision abilities required by this job include close vision and the ability to adjust focus.</li>\n</ul>\nAlignment Healthcare, LLC is proud to practice Equal Employment Opportunity and Affirmative Action. We are looking for diversity in qualified candidates for employment: Minority/Female/Disable/Protected Veteran.\n<br><br>\nIf you require any reasonable accommodation under the Americans with Disabilities Act (ADA) in completing the online application, interviewing, completing any pre-employment testing or otherwise participating in the employee selection process, please contact careers@ahcusa.com.<br><br>Apply Now"}