{"job title": "Manager, Data Engineering", "company": "Alignment Healthcare", "city state": "– Orange, California US", "rating": "3.0", "job description": "Manager, Data Engineering\n<br><br>\nPosition Location:\n<ul>\n<li>Orange, California OR Portland, Oregon</li>\n</ul>\nAlignment Healthcare is a data and technology driven healthcare company focused partnering with health systems, health plans and provider groups to provide care delivery that is preventive, convenient, coordinated, and that results in improved clinical outcomes for seniors.\n<br><br>\nWe are experiencing rapid growth (backed by top private equity firms), our Data and Analytics(D&amp;A) team is looking for the best and brightest leaders. Data drives the way we make decisions. We love our customers and understanding them better makes it possible to provide the best clinical outcome and care experience.\n<br><br>\nWe are currently seeking a Manager of Data Engineering. This position will play a key role in managing data engineering functions to uncover deep insights from data using big data technologies and advanced statistical analysis, processing very large data sets using cloud-based data pipelines on Microsoft Azure, variety of analytic tools, visualizations and delivering actionable healthcare insights &amp; solutions.\n<br><br>\nResponsibilities:\n<ul>\n<li>Develops and implements Data Engineering strategy to support organizational initiatives.</li><li>Manages and leads the Data Engineering Team (Pipeline) team</li><li>Provides leadership, mentorship to internal data Engineering staff.</li><li>Lead the effort for building and migrating the complex ETL pipelines from on premise system to cloud and Hadoop/Spark to make the system grow elastically</li><li>Ensuring data quality throughout all stages of acquisition and processing, including data collection, ground truth generation, normalization and transformation</li><li>Extracting and combining data from various heterogeneous data sources</li><li>Designing, implementing and supporting a platform that can provide ad-hoc access to large datasets</li><li>Modelling data and metadata to support machine learning and AI</li><li>Build statistical models, apply machine learning techniques, analyze very large data sets and construct metrics using these modeling techniques.</li><li>Guiding critical business decisions by highlighting opportunities, identifying correlations, defining experiments and figuring out cause and effect relationships.</li><li>Deploying models in operational software to power insights and actions.</li><li>Develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations</li><li>Provide leadership to Data Engineering teams.</li><li>Communicate with business partners, software vendors, and internal departments.</li><li>Participate in project meetings, providing input to project plans and providing status updates.</li><li>Coach and develop team in best practices.</li><li>Responsible for managing Data Engineering functions to ensure that the project costs are achieved within budget</li><li>Responsible for the global standardization of Data Engineering processes and process improvement and efficiency</li><li>Interview and hire necessary personnel.</li>\n</ul>\nBasic Qualifications:\n<ul>\n<li>Masters in Computer Science, Engineering, Mathematics, Statistics, or related field</li><li>4+ years relevant experience in Data Engineering.</li><li>Experience with machine learning algorithms, including deep neural networks, natural language processing, kernel methods, dimensionality reduction, ensemble methods, hidden Markov models and graph algorithms.</li><li>Demonstrated ability in data modeling, ETL development, and data warehousing.</li><li>Data Warehousing Experience with SQL Server, Oracle, Redshift, Teradata, etc.</li><li>Experience with Big Data Technologies (NoSQL databases, Hadoop, Hive, Hbase, Pig, Spark, Elasticsearch etc.)</li><li>Experience in using Python, Java and/or other data engineering languages</li><li>Knowledge and experience of SQL and SSIS.</li><li>Excellent communication, analytical and collaborative problem-solving skills</li><li>Experience with data visualization and presentation, turning complex analysis into insight.</li><li>Excellent communication, analytical and collaborative problem-solving skills</li>\n</ul>\nPreferred Qualifications:\n<ul>\n<li>PhD in Computer Science, Electrical Engineering, Mathematics, Statistics, or related field</li><li>Healthcare domain and data experience</li><li>Industry experience as a Data Engineering Leader or related specialty (e.g., Software Engineer, Business Intelligence Engineer, Data Engineer) with a track record of manipulating, processing, and extracting value from large datasets.</li><li>Experience building/operating highly available, distributed systems of data extraction, ingestion, and processing of large data sets</li><li>Experience building data products incrementally and integrating and managing datasets from multiple sources</li><li>Experience leading large-scale data warehousing and analytics projects, including using Azure or AWS technologies – SQL Server, Redshift, S3, EC2, Data-pipeline, Data Lake, Data Factory and other big data technologies</li><li>Experience providing technical leadership and mentor other engineers for the best practices on the data engineering space</li><li>Linux/UNIX including to process large data sets.</li><li>Experience with Azure, AWS or GCP is a plus</li><li>Microsoft Azure Certification is a plus</li><li>Demonstrable track record dealing well with ambiguity, prioritizing needs, and delivering results in an agile, dynamic startup environment</li><li>Knowledge of scripting for automation (e.g. Python, Perl, Scala etc.)</li><li>Experience with NoSQL, Spark, Hadoop, Elasticsearch etc.</li><li>Demonstrable track record dealing well with ambiguity, prioritizing needs, and delivering results in an agile, dynamic startup environment</li>\n</ul>\nEssential Physical Functions:\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<ul>\n<li>While performing the duties of this job, the employee is regularly required to talk or hear. The employee regularly is required to stand, walk, sit, use hand to finger, handle or feel objects, tools, or controls; and reach with hands and arms.</li>\n</ul>\n• The employee frequently lifts and/or moves up to 10 pounds. Specific vision abilities required by this job include close vision and the ability to adjust focus.     \n<br><br>\nAlignment Healthcare, LLC is proud to practice Equal Employment Opportunity and Affirmative Action. We are looking for diversity in qualified candidates for employment: Minority/Female/Disable/Protected Veteran.\n<br><br>\nIf you require any reasonable accommodation under the Americans with Disabilities Act (ADA) in completing the online application, interviewing, completing any pre-employment testing or otherwise participating in the employee selection process, please contact careers@ahcusa.com.<br><br>Apply Now"}