{"job title": "Sr. Scientist", "company": "Allergan", "city state": "– Irvine, California, United States", "rating": "3.4", "job description": "<div><div><div><div><div>Allergan plc\n<br>\n(NYSE: AGN) is a bold, global pharmaceutical company and a leader in a new\n<br>\nindustry model - Growth Pharma. Allergan is focused on developing,\n<br>\nmanufacturing and commercializing branded pharmaceutical, device, biologic,\n<br>\nsurgical and regenerative medicine products for patients around the world.\n<br><br>\nAllergan markets a portfolio of leading brands and best-in-class products for\n<br>\nthe central nervous system, eye care, medical aesthetics and dermatology,\n<br>\ngastroenterology, women's health, urology and anti-infective therapeutic\n<br>\ncategories. With commercial operations in approximately 100 countries, Allergan\n<br>\nis committed to working with physicians, healthcare providers and patients to\n<br>\ndeliver innovative and meaningful treatments that help people around the world\n<br>\nlive longer, healthier lives every day.\n<br><br>\nAllergan\n<br>\nis a company that will inspire you to aim high with your ambition. Where you\n<br>\ncan build bridges all over the world. Where you can power ideas that drive\n<br>\nchange. And where you will act fast and drive results for customers and\n<br>\npatients. Power your future &amp; join our bold team.\n<br><br>\nPosition Overview\n<br><br>\nThe Sr. Scientist position will\n<br>\nbe based in Irvine, CA. Reporting to the Executive Director, Small Molecule\n<br>\nProduct Development, following are the main areas of responsibilities:<ul>\n<li><div>Plans, directs, and executes drug\n<br>\nproduct formulation &amp; manufacturing process development activities in\n<br>\nsupport of development of new products intended for clinical trials and\n<br>\ncommercialization. Applies the principles of Quality by Design and statistical\n<br>\nprocess design/analysis to formulation and process development. Conducts\n<br>\nresearch in the area of formulation sciences in support of innovative product\n<br>\ndevelopment both for new chemical entities and life-cycle management of\n<br>\nmarketed products.</div></li></ul>\n\n<ul>\n<li><div>Provides scientific and\n<br>\ntechnical leadership on one or more areas of formulation development and dosage\n<br>\nform design. Develops and maintains a current in-depth knowledge of global CMC\n<br>\nregulatory submission requirements and GLP/GMP requirements. Review internal\n<br>\nand external technical documents, writes technical memos/reports, patents,\n<br>\nscientific articles. Presents scientific/technical seminar annually at\n<br>\nPharmaceutical Development Seminar series.</div></li></ul>\n\n<ul>\n<li><div>Represents department at CMC/project\n<br>\nteam meetings and work closely with other Pharmaceutical Sciences departments,\n<br>\nProcess Chemistry, Toxicology, Regulatory Affairs, Quality, Clinical\n<br>\nDevelopment and Marketing to meet project timelines and objectives.</div></li></ul>\n\n<ul>\n<li><div>Performs supervisory duties\n<br>\nincluding reviewing progress of assignments against established project\n<br>\ntimelines, assistance on daily work direction, problem solving and advice to\n<br>\njunior staff to enhance their work effectiveness in generating data, ensuring\n<br>\ngood record keeping of all laboratory data, adherence to lab safety and general\n<br>\nstaff development.</div></li>\n</ul>\n#LI-PD1<br>\n<div><strong>Requirements</strong>\n<br><br>\nThe following listed\n<br>\nrequirements need to be met at a minimum level to be considered for the job:\n<br><br>\nMust be able to operate as a\n<br>\nfunctional area leader and utilize knowledge of pharmaceutical science,\n<br>\nchemical engineering, literature and experience to guide decisions in complex\n<br>\nsituations. Knowledge of fundamental applications of statistics is preferred.\n<br><br>\n<strong>Education</strong>\n<br><br>\nThis position requires a Ph.D.-level education preferably\n<br>\nin pharmaceutical sciences or chemical engineering with 4+ years of applicable\n<br>\nexperience or M.S with 10+ years of relevant experience.</div>\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}