{"job title": "Scientist I - Analysis of Neurophysiology &amp; Behavior", "company": "Allen Institute for Brain Science", "city state": "– Seattle, WA", "rating": "3.1", "job description": "Scientist 1 Analysis of Neurophysiology &amp; Behavior\n<br><br>\nWe seek a Scientist I to be an essential member of a team investigating cortical circuits mediating visual coding and behavior in the mouse brain. Using our standardized Allen Brain Observatory (http://observatory.brain-map.org/visualcoding), we are generating systematic datasets of neural activity (both 2-photon calcium imaging of genetic cell populations and electrophysiological datasets acquired with Neuropixels probes).\n<br><br>\nThe primary role of this scientist will be to perform computational analysis of large-scale neurophysiological datasets collected in the context of an active behavioral task. Areas of focus include cell type-specific processing, population coding, and functional interactions between areas and layers of the corticothalamic visual system.\n<br><br>\nOur mission at the Allen Institute for Brain Science is to accelerate the understanding of how the human brain works in health and disease. By implementing a team science approach on a large scale, we strive to generate useful public resources, drive technological innovations and discover fundamental brain properties through integration of experiments, modeling and theory.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Develop computational tools for analyzing and visualizing large-scale neurophysiological and behavioral datasets</li>\n<li>Perform basic and advanced analysis of large-scale neurophysiological datasets</li>\n<li>Collaborate with scientific and tehcnical teams</li>\n<li>Contribute to experimental design and creation of open data resources</li>\n<li>Publish results in peer reviewed journals and present findings at scientific conferences</li>\n<li>Present periodic summary of progress to research community at institute</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS</strong>\n\n\n<ul>\n<li>PhD in Neuroscience, Computational Neuroscience, Applied Math or related field</li>\n<li>Strong programming ability for the use in scientific analysis</li>\n<li>Strong written and verbal communication skills</li>\n<li>Experience meeting aggressive timelines and deliverables</li>\n</ul>\n\n<strong>DESIRED QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Strong scientific publication record</li>\n<li>Python programming experience</li>\n<li>Experience in systems neuroscience including extracellular electrophysiology, calcium imaging, and behavioral analysis</li>\n<li>Experience pursuing research projects in collaborative fashion</li>\n<li>Proven independent thinking and flexibility</li>\n<li>Strong written and verbal communication skills</li>\n<li>Dedicated team player</li>\n</ul>"}