{"job title": "Data Scientist - Decision Sciences Personal Valuation team", "company": "Alliance Data", "city state": "– Chicago, IL", "rating": "3.5", "job description": "As a Data Scientist in our Decision Sciences R&amp;Dorganization, you will be responsible for researching and building machinelearning and natural language processing applications to extend Conversant'spersonalization platform. Conversant'sbusiness is based on analyzing anonymized data at internet scale and evaluatingmore than 1 trillion advertising opportunities per month in real-time. You will work on real-world problems as partof our highly collaborative R&amp;D team, and your solutions will directly andrapidly impact our business. Thisincludes researching and developing models, algorithms, and applications;analyzing raw source data and derived data; presenting findings; and building toolsand analyses for new and existing products.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Develop an understanding of Conversant's personalizationplatform and proprietary datasets</li>\n<li>Use your machine learning expertise to research andrecommend the best approaches to solving our technology and business problems</li>\n<li>Design, implement, and validate your solutions in ApacheSpark, Apache Hive, using Scala or Python on a large state-of-the-art cluster</li>\n<li>Work with our Engineering teams to integrate yoursolutions into Conversant's platform</li>\n<li>Participate fully in our collaborative approach to researchand applications projects</li>\n</ul>\n\n<strong>REQUIREMENTS</strong>\n\n\n<ul>\n<li>A Ph.D., in Computer Science, Statistics, Linguistics, ElectricalEngineering, Mathematics, Economics, Physics, or a related scientificdiscipline</li>\n<li>Research experience and coursework in Machine Learning</li>\n<li>Fluency in programming</li>\n<li>Experience with large data sets</li>\n<li>Strong understanding of statistics and modeling techniques</li>\n<li>Desire to work in a highly collaborative environment</li>\n</ul>\n\n<strong>ADDITIONALUSEFUL BUT NOT REQUIRED SKILLS</strong>\n\n\n<ul>\n<li>Experience with distributed computing, such as Hadoop, Spark,or related technologies</li>\n<li>Familiarity with SQL, Scala, Python, or Java</li>\n<li>Experience with Natural Language Processing, InformationRetrieval, or Recommender Systems</li>\n<li>Experience with mathematical optimization, control theory,time-series analysis</li>\n</ul>\n\n<strong>#LI-RPM</strong>\n<br><br>\n#analytics<br><br>SDL2017"}