{"job title": "Senior Scientist, Protein Engineering", "company": "Allogene", "city state": "– South San Francisco, CA", "rating": "NA", "job description": "Allogene Therapeutics is a biotechnology company with a mission to catalyze the next revolution in cancer treatment through the development of allogeneic chimeric antigen receptor T-cell (CAR T) therapy directed at blood cancers and solid tumors. Founded and led by former Kite Pharma executives who bring unrivaled clinical development acumen in cell therapy, Allogene is well-positioned to further the potential of allogeneic cell therapy for patients.\n<br><br>\nAllogeneic CAR T therapies are engineered from cells of healthy donors and stored for off-the-shelf use in patients. This approach eliminates the need to create personalized therapy from a patient's own cells, simplifies manufacturing, and reduces the time patients must wait for CAR T treatment. The Allogene portfolio includes 17 pre-clinical T cell therapy assets and UCART19, an allogeneic CAR T therapy currently in Phase 1 development for the treatment of acute lymphoblastic leukemia (ALL). Through its notable partnerships, Allogene leverages pioneering technology platforms, including TALEN® gene editing technology, to progress its portfolio of immuno-oncology therapies. Allogene, with headquarters in South San Francisco, California, is a Two River portfolio company formed with one of the largest Series A financings in biotechnology from the investment consortium of TPG, Vida Ventures, BellCo Capital, the University of California Office of the Chief Investment Officer, Gilead and Pfizer. For more information, please visit www.allogene.com, follow @AllogeneTx on Twitter and LinkedIn.\n<br><br>\nAllogene Therapeutics is seeking a highly motivated Senior Scientist in Protein Engineering to improve the efficacy and safety of allogeneic CAR T cells through the use of protein engineering and synthetic biology approaches. The successful candidate will report directly to the Head of Protein Engineering and be responsible for developing these technologies in close collaboration with an exceptional and multidisciplinary team of scientists. The ideal candidate will have a practical understanding of immune cell signal transduction including the structures, dynamics and mechanisms of the associated proteins, and a demonstrated track record of applying this knowledge to solve biological problems. They are an individual who is interested in working in a fast-paced, dynamic and highly collaborative start-up environment with a willingness to take on new challenges.\n<br><br>\n<strong>Responsibilities include, but are not limited to:</strong>\n\n<ul>\n\n\t<li>Identify desirable CAR T cell attributes in close collaboration with a multidisciplinary team</li> \n\n<li>Design then validate novel protein constructs in the context of CAR T cells using in vitro assays then work closely with colleagues to test them using in vivo models</li> \n\n<li>Contribute to a collaborative group effort for advancing allogeneic CAR T cell therapies into solid tumors</li> \n\n<li>Stay abreast of latest scientific and technology advancements in the field</li> \n\n<li>Train and mentor other scientists and perform other duties as required</li> \n\n<li>Present at group meetings and project team meetings</li> \n\n<li>Other duties as assigned</li>\n</ul>\n<strong>Position Requirements and Experience:</strong>\n\n<ul>\n\n\t<li>PhD with a strong foundation in molecular biology, structural biology, cellular biology and immunology and at least 2 years of post-graduate experience acquired in either an academic or industry setting</li> \n\n<li>Expertise in protein engineering and/or synthetic biology</li> \n\n<li>Proficient in protein structure analysis and modeling</li> \n\n<li>Expertise in signal transduction especially as it pertains to immune cells is strongly desired</li> \n\n<li>Proficient with common immunological assays such flow cytometry based immunophenotyping, cytokine release and cellular proliferation is preferred</li> \n\n<li>Experience with retroviral/lentiviral transduction of human T cells is beneficial</li> \n\n<li>Meticulous and highly organized as it pertains to experimental design, bench-work, record keeping and data analysis</li> \n\n<li>Excellent organizational skills and an ability to prioritize effectively to deliver results within reasonably established timelines</li> \n\n<li>Strong interpersonal skills including relationship building, conflict resolution, and verbal and written communication are essential in this collaborative work environment</li> \n\n<li>Ability to effectively work in a fast-paced, start-up environment, while dealing with ambiguity</li> \n\n<li>Candidates must be authorized to work in the U.S</li>\n</ul>\nAs an equal opportunity employer, Allogene Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process contact the careers email at www.allogene.com for assistance.\n<br><br>\nFor more information about equal employment opportunity protections, please view the EEO is the Law' poster.\n<br><br>\n#LI-KN1"}