{"job title": "Senior Scientist, Analytical Development", "company": "Allogene", "city state": "– South San Francisco, CA", "rating": "NA", "job description": "Allogene Therapeutics is a biotechnology company with a mission to catalyze the next revolution in cancer treatment through the development of allogeneic chimeric antigen receptor T-cell (CAR T) therapy directed at blood cancers and solid tumors. Founded and led by former Kite Pharma executives who bring unrivaled clinical development acumen in cell therapy, Allogene is well-positioned to further the potential of allogeneic cell therapy for patients.\n<br><br>\nAllogeneic CAR T therapies are engineered from cells of healthy donors and stored for off-the-shelf use in patients. This approach eliminates the need to create personalized therapy from a patient's own cells, simplifies manufacturing, and reduces the time patients must wait for CAR T treatment. The Allogene portfolio includes 16 pre-clinical T cell therapy assets and UCART19, an allogeneic CAR T therapy currently in Phase 1 development for the treatment of acute lymphoblastic leukemia (ALL). Through its notable partnerships, Allogene leverages pioneering technology platforms, including TALEN® gene editing technology, to progress its portfolio of immuno-oncology therapies. Allogene, with headquarters in South San Francisco, California, is a Two River portfolio company formed with one of the largest Series A financings in biotechnology from an investment consortium which includes TPG, Vida Ventures, BellCo Capital, the University of California Office of the Chief Investment Officer, and Pfizer. For more information, please visit: <u>www.allogene.com</u>, follow @AllogeneTx on Twitter and LinkedIn.\n<br><br>\nAllogene is seeking a Senior Scientist to provide development and analytical characterization support for Allogene's CART programs. The ideal candidate for this role is an individual who has a proven track record of innovation and publication and is excited to take on new challenges in a fast-paced and dynamic start-up environment. This individual will be responsible for analytical characterization, planning and executing laboratory studies, analyzing experimental data, carefully documenting resultant information, and presenting their findings to the team.\n<br><br>\n<u>Responsibilities include, but are not limited to:</u>\n\n<ul>\n\n\t<li>Work with a cross-functional team to develop, adapt, remediate, execute, and document analytical methods to study and characterize processes supporting Allogene's CART programs.</li>\n\n<li>Design and execute method development and qualification in support of lead candidate selection, process development, product release and stability, product characterization, investigation, and process performance qualification.</li>\n\n<li>Support tech transfer of methods for external QC testing for manufacturing.</li>\n\n<li>Contribute to development of novel technologies for CART.</li>\n\n<li>Successfully execute and document laboratory procedures and experiments with great attention to detail.</li>\n\n<li>Assist in the development of standard operating procedures, analytical test methods, analytical sampling plans involving immunoassays, and molecular biology techniques.</li> \n\n<li>Write, review, and edit accurate technical documents.</li>\n\n<li>Maintain, calibrate, and operate analytical equipment and instruments.</li>\n\n<li>Work with a cross-functional team to advance the development of Allogene programs.</li>\n\n<li>Other duties as assigned.</li>\n</ul>\n<u>Position Requirements &amp; Experience:</u>\n\n<ul>\n\n\t<li>Ph.D. or masters in immunology, molecular and cellular biology or a related discipline, and at least 2 years of industry experience in multi-scale characterization studies is required.</li>\n\n<li>Demonstrated knowledge of pharmaceutical manufacturing of biotechnology products, analytical method development, technology transfer, method qualification/validation, and process development.</li>\n\n<li>Analytical method development and qualification experience in molecular biological techniques such as quantitative PCR (qPCR), immunoassay, and flow cytometry.</li>\n\n<li>Experience with cell therapy products, including T cells, is a plus.</li>\n\n<li>Demonstrate a strong skill set and knowledge in analytical assay development and assay optimization.</li>\n\n<li>Ability to follow laboratory procedures with attention to detail and successfully execute experiments at the bench.</li>\n\n<li>Ability to work in a fast-paced, start-up environment.</li>\n\n<li>Strong attention to detail with the ability to multi-task and handle multiple responsibilities simultaneously.</li>\n\n<li>Excellent organizational skills and an ability to prioritize effectively to deliver results within reasonably established timelines.</li>\n\n<li>Ability to work independently and as part of a team.</li>\n\n<li>Strong interpersonal skills including verbal and written communication are essential in this collaborative work environment.</li>\n\n<li>Candidates must be authorized to work in the U.S.</li>\n</ul>\nAs an equal opportunity employer, Allogene Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact the careers email at <u>www.allogene.com</u> for assistance.\n<br><br>\nFor more information about equal employment opportunity protections, please view the EEO is the Law' poster.<br><br>#LI-EL1"}