{"job title": "Data Science Intern", "company": "Allstate Insurance Company", "city state": "– Chicago, Illinois", "rating": "3.5", "job description": "Where good people build rewarding careers.\n<br><br>\nThink that working in the insurance field can't be exciting, rewarding and challenging? Think again. You'll help us reinvent protection and retirement to improve customers' lives. We'll help you make an impact with our training and mentoring offerings. Here, you'll have the opportunity to expand and apply your skills in ways you never thought possible. And you'll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nDo you enjoy problem solving, quantitative reasoning, and technology? Are you interested in working in a collaborative, friendly environment? If so, we invite you to consider a Summer 2019 internship at Allstate with the Data, Discovery &amp; Decision Science (D3) team! D3 is responsible for supporting other internal business units with a broad range of data, research and analytical projects. With a fast growing team of highly skilled personnel, D3 provides a unique learning environment through formal training curriculum, mentoring, informal everyday coaching and hands-on training.\n<br><br>\nIn D3, we use mathematical, statistical, and machine-learning techniques to assist in the research and development of pricing and economic models, data-visualization apps, and decision-making tools. We build products and knowledge to help business leaders, agents, and customers make better, data-driven decisions. The Data Scientist Family requires Analytic Agility, the ability to quickly learn new modeling/machine learning techniques, programming languages, and see how these ideas can integrate to optimize the business.\n<br><br>\nThis role is responsible for leading the use of data to make decisions. This includes: The coding/development of tools that use machine learning/predictive modeling to make business decisions, searching for and integrating new data (both internal and external) that improves our modeling and machine learning results (and ultimately our decisions), and discovery of solutions to business problems that can be solved through the use of machine learning/predictive modeling.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<br><br>\nThe following are the areas of responsibility the Data Science Intern will be exposed in some capacity:\n\n\n<ul>\n<li>Uses best practices, with limited coaching, to develop statistical, machine learning techniques to build models that address business needs</li>\n<li>Utilizes effective project planning techniques to break down basic and occasionally moderately complex projects into tasks and ensure deadlines are kept</li>\n<li>Uses and learns a wide variety of tools and languages to achieve results (e.g., R, SAS, Python, Hadoop)</li>\n<li>Collaborates with the team in order to improve the effectiveness of business decisions through the use of data and machine learning/predictive modeling</li>\n<li>Innovates on projects by using new modeling techniques or tools</li>\n<li>Contributes on a wide variety of projects</li>\n<li>Executes on modeling/machine learning projects effectively</li>\n<li>Communicates findings to team and leadership ensure models are well understood and incorporated into business processes</li>\n<li>Works with leaders to ensure the project will meet their needs</li>\n<li>Maximizes personal professional development to ensure continuation of a personal contribution to the team and Allstate</li>\n<li>Reviews and evaluates on appropriateness of techniques, given current modeling practices, to senior leadership</li>\n</ul>\n\n<strong>Allstate Internship Program:</strong>\n\n\n<ul>\n<li>Target start date: May/June 2019</li>\n<li>12 week summer internship program</li>\n<li>An attractive compensation package</li>\n<li>Housing stipend offered to qualified students</li>\n<li>Collaborative team environment</li>\n<li>Planned intern activities; including lunches with Allstate officers as keynote speakers</li>\n<li>Volunteer/community service opportunities</li>\n<li>Potential to receive possible full-time employment after graduation</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education:</strong>\n\n\n<ul>\n<li>Currently pursuing a degree in a quantitative field (e.g. mathematics, statistics, computer or physical science).</li>\n<li>Pursuit of a graduate degree strongly preferred.</li>\n</ul>\n\n<strong>Skills and Experience:</strong>\n\n\n<ul>\n<li>Ability to solve problems, think critically, and communicate clearly.</li>\n<li>Knowledge of statistical modeling, machine learning, mathematical optimization, and/or data mining</li>\n<li>Experience with programming.</li>\n<li>An understanding of algorithmic scaling and complexity a plus.</li>\n<li>Experience with big-data tools (e.g. hadoop) a plus.</li>\n</ul>\n\nThis position is posted in multiple office locations. Please ONLY apply for the location you are most interested in.\n<br><br>\nThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.\n<br><br>\nGood Work. Good Life. Good Hands.\n<br><br>\nAs a Fortune 100 company and industry leader, we provide a competitive salary - but that's just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you'll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.\n<br><br>\nLearn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.\n<br><br>\nAllstate generally does not sponsor individuals for employment-based visas for this position.\n<br><br>\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\n<br><br>\nFor jobs in San Francisco, please click 'here' for information regarding the San Francisco Fair Chance Ordinance.\n<br><br>\nFor jobs in Los Angeles, please click 'here' for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n<br><br>\nIt is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era.\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: US*1743_******\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nAllstate Insurance Company\n<br><br>\nThe Allstate Corporation is the largest publicly held personal lines property and casualty insurer in America, serving more than 16 million households nationwide. Founded in 1931, Allstate has been dedicated to protecting our customers from life's uncertainties and preparing them for the future for more than 85 years. Allstate became a publicly traded company in 1993, and is listed on the New York Stock Exchange under the trading symbol ALL. As of year-end 2015, Allstate had nearly $104.7 billion in total assets. Contact Info\n\n\n<ul>\n<li>Chicago, IL 60601</li>\n</ul>"}