{"job title": "Senior Data Consultant - Drivewise/Milewise", "company": "Allstate Insurance", "city state": "– Northbrook, IL", "rating": "3.5", "job description": "<strong>Where good people build rewarding careers.</strong>\n<br>\nThink that working in the insurance field can?t be exciting, rewarding and challenging? Think again. You?ll help us reinvent protection and retirement to improve customers? lives. We?ll help you make an impact with our training and mentoring offerings. Here, you?ll have the opportunity to expand and apply your skills in ways you never thought possible. And you?ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.\n<br>\n<div>\nJob Description<br>\n\n<div>\n<strong>Job Family Summary</strong> </div> \n<br>\nThe UBI APL Data Team is responsible for collaborating with clients to enable them to make objective customer-focused decisions by providing analytical insight and ensuring trusted actionable data. The team is responsible for analytics, as well as serving in a consultant role to teams across Product Operations providing ad hoc requests, implementation metrics, performance scorecards and other analytic visualization reporting.\n<br>\n<div>\n<strong>Job Summary</strong></div> \n<br>\nA Product Intelligence Sr Consultant II will be responsible for collaborating with clients to enable them with trusted actionable data to break down business problems into solvable components by assessing the requirements and/or business implications to arrive at recommended solutions. They will serve in a consultant role to teams across Product Operations providing leadership to produce actionable results in the form of ad hoc requests, implementation metrics, performance scorecards and other analytic visualization reporting along with insights about the business or data.\n<br>\n<div>\n<strong>Key Responsibilities</strong></div>\n\n<ul>\n<li>Lead projects requested by Senior Leadership to provide support for speed to market, vital, company decisions</li><li>Gather requirements/understand purpose of request</li><li>Lead and provide complex data extraction and analytical support for a variety of internal customers and external recipients</li><li>Analytical support includes inspecting and cleaning data to provide useful information and to suggest conclusions to the client for decision making.</li> <li>Support the needs of modeling and analytics by delivering data based on client requirements. Utilize an array of data sources, all in different forms and with different tools or methods to create a solution</li><li>Design and create reporting with limited assistance so that business users may visually understand and explore a new product feature or functionality before implementation to expose design assumptions and drive ideation</li><li>Design and create reporting so that key measurements are in place with implementation of products</li><li>Lead User Acceptance Testing and develop test plans and scripts, prepare test data, reconcile data sources and execute functional tests</li><li>Works with data stewards in the testing/profiling of data and validation of newly captured data to ensure proper operation and accuracy</li><li>Troubleshoots data quality issues - identifying root cause/system &amp; documentation/communication of resolution</li><li>Serve as a mentor to team members</li>\n</ul>\nJob Qualifications<br>\n\n<div>\n<strong>Knowledge/Skills/Abilities/Experience</strong></div>\n\n<ul>\n<li>Bachelors or Masters/MBA majoring in a quantitative field such as Math, Business or Computer Science</li><li>3-5 years of related experience</li><li>Strong analytical skills</li><li>Strong experience in time and task management</li><li>Strong attention to details</li><li>Intermediate Microsoft Office skills</li><li>Advanced technology fluency in tools and software/programming languages with key analytic applications (SAS, MySQL, PL/SQL, Oracle, UNIX, OLAP, Tableau)</li><li>Strong written and verbal communication skills including the ability to effectively collaborate with multi-disciplinary groups and all organizational levels.</li><li>Intermediate presentation skills</li></ul></div>\n\n<br>The candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.\n<br>\n<strong>Good Work. Good Life. Good Hands?.</strong> \n<br>\nAs a Fortune 100 company and industry leader, we provide a competitive salary ? but that?s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you?ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.\n<br>\nLearn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.\n<br><br>\n<strong>Allstate generally does not sponsor individuals for employment-based visas for this</strong> <strong>position.</strong>\n<br>\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\n<br><br>\nFor jobs in San Francisco, please click \"here\" for information regarding the San Francisco Fair Chance Ordinance.\n<br>\nFor jobs in Los Angeles, please click \"here\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n<br><br>\nIt is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era.\n\n\n<ul>\n<li>provided by Dice</li>\n</ul>"}