{"job title": "New Grad Junior Business Analytics Consultant (Charlotte)", "company": "Allstate Insurance Company", "city state": "– Charlotte, North Carolina", "rating": "3.5", "job description": "Where good people build rewarding careers.\n<br><br>\nThink that working in the insurance field can't be exciting, rewarding and challenging? Think again. You'll help us reinvent protection and retirement to improve customers' lives. We'll help you make an impact with our training and mentoring offerings. Here, you'll have the opportunity to expand and apply your skills in ways you never thought possible. And you'll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nThe Data, Discovery and Decision Science (D3) department leverages data &amp; analytics to help the enterprise understand the best course of action to deliver on our corporate priorities, improve our business processes to gain operational efficiency and better equip our agencies and employees with the tools and insights necessary to better serve our customers and live into our customer value proposition.\n<br><br>\nD3 is responsible for supporting other internal business units with a broad range of data, research and analytical projects. With fast growing team of highly skilled personnel, D3 provides a unique learning environment through formal training curriculum, mentoring, informal everyday coaching and hands-on training. The Business Analytics Consulting (BAC) family uses business and technical acumen to find applications of analytics to solve business problems across the enterprise. The main responsibility of the BAC is to deliver value by providing our business partners with tools, processes, insights and communications that improve the overall analytical capability of our business partners.\n<br><br>\nThe Junior Business Analytics Consultant position is an entry-level analyst position with a target start date in Summer 2019. This position will use business and technical acumen to assist in the development of analytical processes and solutions for the business vertical in which they are aligned to. The Analyst is responsible for clear communication among stakeholders and ensure the project/product is fulfilling all agreed upon criteria when delivered. Additionally, the Junior Business Analytics Consultant will be exposed to the ins and out of developing data strategies for predictive analytic applications, fundamental skills of big data, data science and statistical learning methods, and agile delivery methodologies.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Identify and prioritize new opportunities for analytics through the following business consulting responsibilities:</li>\n<li>Relationship Management: Assists in efforts to build new relationships and maintain current relationships with business stakeholders both internal and external of D3</li>\n<li>Strategy &amp; Business Consulting: Develops a basic understanding of core business problems and looks for opportunities to use advanced analytics. May assist in activities to develop strategies and identify high priory initiatives</li>\n<li>Business Process Mapping: Assists in identifying where data and analytics could be leveraged in order to make key business decisions. Assists in developing an understating of how the business works, what their operational processes look like, and where data and analytics could be leveraged in order to make more effective data-driven decisions</li>\n<li>Experimentation, Research &amp; Innovation: Keeps abreast of industry and technology developments and to identify new tools, methods and techniques to meet the needs of the business</li>\n<li>Implement and operationalize analytical insights, products and solutions through the following responsibilities:</li>\n<li>Data Visualization &amp; Storytelling: Understands the fundamentals of data visualization and develops solutions using tools such as Tableau in order to effectively communicate and assist in the translation of data and analytics insights in business terms to key stakeholders</li>\n<li>Technical Support of Analytics Development Life Cycle: Assists in providing the Data Scientists with high-level model design by providing business requirements, creating data visualizations, and providing an understanding of data domains and their impact to the business</li>\n<li>Program Coordination/Product Owner: Assists with moderately complex projects/products and be responsible for tasks in smaller lower impact projects/products from ideation to delivery in an Agile framework, with an emphasis on measurable, value add deliverables</li>\n<li>Communication &amp; Change Management: Assists in clear product/project communication throughout the project/product to all stakeholders involved regarding scope, timeline, issues, and any revisions to them. Additionally, assists in efforts to ensure partnerships through the development process for the successful transition of low complexity research to an operational state within the business unit</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Target start date: Summer 2019</li>\n<li>Currently pursuing and will be completing a bachelor's degree.</li>\n<li>Studies related to statistics/mathematics, engineering, predictive analytics or data science is a plus.</li>\n<li>Possess quantitative and analytical thinking skills</li>\n<li>Demonstrate business acumen to assist in consulting efforts with business clients</li>\n<li>Experience with analytical tools, such as SQL, R, Python and Tableau</li>\n<li>Ability to make sound decisions utilizing problem solving approaches and decision frameworks</li>\n<li>Ability to synthesize data into meaningful conclusions and recommendations to business clients</li>\n<li>Ability to support routine analysis</li>\n<li>Effectively communicate concepts, tools and techniques</li>\n<li>Has strong aptitude to understand Allstate systems and data in order to provide guidance to business clients</li>\n<li>Ability to perform in a fast paced, dynamic and ambiguous business environment</li>\n<li>Ability to assist data and technical projects</li>\n<li>Ability to revise tactics to support changing strategies and direction</li>\n<li>Ability to inspire trust among peers and business clients to build strong relationships</li>\n<li>Strong presentation skills</li>\n</ul>\n\nThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.\n<br><br>\nGood Work. Good Life. Good Hands.\n<br><br>\nAs a Fortune 100 company and industry leader, we provide a competitive salary - but that's just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you'll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.\n<br><br>\nLearn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.\n<br><br>\nAllstate generally does not sponsor individuals for employment-based visas for this position.\n<br><br>\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\n<br><br>\nFor jobs in San Francisco, please click 'here' for information regarding the San Francisco Fair Chance Ordinance.\n<br><br>\nFor jobs in Los Angeles, please click 'here' for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n<br><br>\nIt is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era.\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: US*1743_******\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nAllstate Insurance Company\n<br><br>\nThe Allstate Corporation is the largest publicly held personal lines property and casualty insurer in America, serving more than 16 million households nationwide. Founded in 1931, Allstate has been dedicated to protecting our customers from life's uncertainties and preparing them for the future for more than 85 years. Allstate became a publicly traded company in 1993, and is listed on the New York Stock Exchange under the trading symbol ALL. As of year-end 2015, Allstate had nearly $104.7 billion in total assets. Contact Info\n\n\n<ul>\n<li>Charlotte, NC 28202</li>\n</ul>"}