{"job title": "Senior Data Engineer", "company": "Allstate Insurance Company", "city state": "– Chicago, Illinois", "rating": "3.5", "job description": "Where good people build rewarding careers.\n<br><br>\nThink that working in the insurance field can't be exciting, rewarding and challenging? Think again. You'll help us reinvent protection and retirement to improve customers' lives. We'll help you make an impact with our training and mentoring offerings. Here, you'll have the opportunity to expand and apply your skills in ways you never thought possible. And you'll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nAllstate is looking to hire Data Enigneers to join our Innovation team at our downtown Chicago and Menlo Park(SF Bay area) locations.\n<br><br>\nOur team works on a diverse set of data and systems including accident data, biometrics, location data, computer vision, mobility data, demographics, and deep learning tools to create Life solutions, safety solutions, and cutting-edge risk assessing platforms. This is a great opportunity to work with a talented team of some of the world's leading experts to build groundbreaking solutions.\n<br><br>\nThe Senior Data Engineer will develop novel techniques for on-boarding and analyzing both structured and semi-structured data to create solution for advanced risk prediction, new products, and services development. He/she will also assist in efforts to evaluate, extract, scrub/prep, analyze and visualize a host of internal and external datasets using machine learning and statistical analysis and communicate to various stakeholders across and outside the company. The team is responsible for defining the strategy, building solutions, managing the product portfolio and building end user applications in new and emerging domains.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nIn this role we are seeking for a Senior Data Engineer with data analytics background that can lead the creation of a complex data lake. The role will support the identification, selection and standardization of the data based products and services. Additional responsibilities include:\n\n\n<ul>\n<li>Become the internal data owner for this data-driven initiative, execute project aspects in partnership with internal and external constituencies.</li>\n<li>Partner with internal teams to drive technical decisions using data, and support integration into Allstate systems.</li>\n<li>Identification, evaluation, and prioritization of data sources. Provide feedback on data quality, integrity, and value for the project</li>\n<li>Story ownership in an agile process. Deliver data ingestion, cleansing, normalization, provenance, and data processing results for analysis and product needs.</li>\n<li>Execute the product vision, value proposition, and positioning for the data platforms</li>\n<li>Process input from Customers and internal sources to provide clear product and project prioritization.</li>\n<li>Develop and define data content for data products and services.</li>\n<li>Work with Development, Operations, and Project Management to ensure development and delivery of products on time and manage expectations.</li>\n<li>Exhibit strong sense of ownership and ability to work in global team environment.</li>\n<li>Work closely with Allstate's Data and Analytics team to deliver data sets that meet project analytical needs.</li>\n<li>Support ongoing relationships and strategic alignment with product stakeholders for key customer accounts.</li>\n</ul>\n\nJob Qualifications\n\n\n<ul>\n<li>Bachelor's degree required, preferable in Computer Science/Business Information Systems/GIS/Data Science.</li>\n<li>Advanced Analytic Data Sourcing and Content Management skills</li>\n<li>Computer Proficiency in RDBMS, UNIX, Linux, Advanced SQL</li>\n<li>Advanced skills in either Python, Scala, or Java is required</li>\n<li>Experience with Hadoop technology stack including Spark, Hive, MapReduce, etc.</li>\n<li>Experience with Dimensional Modeling, Tableau, Cloudera or other Hadoop distributions</li>\n<li>5 to 10 years of experience in highly data driven projects.</li>\n<li>Strong technical skills or experience in a technically complex product development environment (e.g. database or software applications).</li>\n<li>Background in information systems, big data and analytics experience a must with close familiarity with contemporary tools and agile methodologies</li>\n<li>Experience driving business decisions - as key technical lead gathering and managing business requirements</li>\n<li>Ability to execute in a cross-functional team environment spread across many departments, while driving for desired outcomes.</li>\n<li>Ability to operate in a dynamic, fast moving environment, and communicate complex ideas in a clear, concise manner both verbally and in writing.</li>\n<li>Results oriented as demonstrated by proven ability to meet short deadlines and execute against multiple competing priorities with little direct supervision.</li>\n</ul>\n\nThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.\n<br><br>\nGood Work. Good Life. Good Hands.\n<br><br>\nAs a Fortune 100 company and industry leader, we provide a competitive salary - but that's just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you'll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.\n<br><br>\nLearn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.\n<br><br>\nAllstate generally does not sponsor individuals for employment-based visas for this position.\n<br><br>\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\n<br><br>\nFor jobs in San Francisco, please click 'here' for information regarding the San Francisco Fair Chance Ordinance.\n<br><br>\nFor jobs in Los Angeles, please click 'here' for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n<br><br>\nIt is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era.\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: US*1743_******\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nAllstate Insurance Company\n<br><br>\nThe Allstate Corporation is the largest publicly held personal lines property and casualty insurer in America, serving more than 16 million households nationwide. Founded in 1931, Allstate has been dedicated to protecting our customers from life's uncertainties and preparing them for the future for more than 85 years. Allstate became a publicly traded company in 1993, and is listed on the New York Stock Exchange under the trading symbol ALL. As of year-end 2015, Allstate had nearly $104.7 billion in total assets. Contact Info\n\n\n<ul>\n<li>Chicago, IL 60601</li>\n</ul>"}