{"job title": "D3 - Junior Data Scientist 1", "company": "Allstate", "city state": "– Charlotte, NC", "rating": "3.5", "job description": "<strong>Where good people build rewarding careers.</strong>\n<br><br>\nThink that working in the insurance field can’t be exciting, rewarding and challenging? Think again. You’ll help us reinvent protection and retirement to improve customers’ lives. We’ll help you make an impact with our training and mentoring offerings. Here, you’ll have the opportunity to expand and apply your skills in ways you never thought possible. And you’ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.<br>\n<div><strong>Job Description:</strong>\n<br><br>\n<strong>Job Family Summary</strong>\n<br>\nData Science incorporates techniques across many disciplines – including mathematics/statistics, computer programming, data engineering and ETL, software development, and high performance computing – with traditional business expertise with the goal of extracting meaning from data to optimize future business decisions. Individuals in this field should be an expert/fluent in several of these disciplines and sufficiently proficient in others to effectively design, build, and deliver end to end predictive analytics products to optimize future decisions. Individual should demonstrate sufficient analytic agility to quickly develop new skills across these disciplines as those disciplines evolve.\n<br><br>\nThis position resides within the D3: Data, Discovery &amp; Decision Science department. D3 leverages data &amp; analytics to help the enterprise understand the best course of action to deliver on our corporate priorities, improve our business processes to gain operational efficiency and better equip our agencies and employees with the tools and insights necessary to better serve our customers and live into our customer value proposition. The Data Scientist family is accountable for using data to make decisions, which includes building predictive models and developing new machine learning techniques that enable Allstate to make better decisions to achieve its goals. The Data Scientist Family requires Analytic Agility, the ability to quickly learn new modeling/machine learning techniques, programming languages, and see how these ideas can integrate to optimize the business.\n<br><br>\n<strong>Job Summary</strong>\n<br>\n<strong><em><u>This Junior Data Scientist position is a full-time entry-level role that we would start within a few weeks of hire. This is not a campus role for new graduates starting in Spring or Summer of 2019.</u></em></strong>\n<br><br>\nThis role is responsible for leading the use of data to make decisions. This includes: The development and execution of new machine learning predictive modeling algorithms, the coding\\development of tools that use machine learning/predictive modeling to make business decisions, searching for and integrating new data (both internal and external) that improves our modeling and machine learning results (and ultimately our decisions), and discovery of solutions to business problems that can be solved through the use of machine learning/predictive modeling. This role will also begin to manage projects of small to medium complexity.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n\n\t<li>Uses best practices, with limited coaching, to develop statistical, machine learning techniques to build models that address business needs</li>\n<li>Utilizes effective project planning techniques to break down basic and occasionally moderately complex projects into tasks and ensure deadlines are kept</li>\n<li>Uses and learns a wide variety of tools and languages to achieve results (e.g., R, SAS, Python, Hadoop)</li>\n<li>Collaborates with the team in order to improve the effectiveness of business decisions through the use of data and machine learning/predictive modeling</li>\n<li>Innovates on projects by using new modeling techniques or tools</li>\n<li>Contributes on a wide variety of projects</li>\n<li>Executes on modeling/machine learning projects effectively</li>\n<li>Communicates findings to team and leadership ensure models are well understood and incorporated into business processes</li>\n<li>Works with leaders to ensure the project will meet their needs</li>\n<li>Maximizes personal professional development to ensure continuation of a personal contribution to the team and Allstate</li>\n<li>Reviews and evaluates on appropriateness of techniques, given current modeling practices, to senior leadership</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n\n\t<li><strong><em><u>Target Start Date: ASAP</u></em></strong></li>\n<li>Have completed at least a Bachelor’s degree in a quantitative field such as statistics, mathematics, computer science, physics, finance or economics.</li>\n<li>Master’s or PhD is preferred.</li>\n<li>Experience in using statistical modeling and/or machine learning techniques to build models that have driven company decision making preferred</li>\n<li> Experience in managing and manipulating large, complex datasets</li>\n<li> Experience in working with statistical software such as SAS, SPSS, MatLab, R, CART, etc. preferred</li>\n<li> Ability to code and develop prototypes in languages such as Python, Perl, Java, C preferred</li>\n<li>Knowledge of advanced modeling technique preferred</li>\n<li>Demonstrated analytic agility</li>\n<li>Ability to analyze and interpret moderate to complex concepts</li> \n\n<li>Ability to provide written and oral interpretation of highly specialized terms and data, and ability to present this data to others with different levels of expertise</li>\n</ul>\n\n</div>\n<br>The candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.\n<br><br>\n<strong>Good Work. Good Life. Good Hands®.</strong>\n<br><br>\nAs a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.\n<br><br>\nLearn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.\n<br><br>\n<strong>Allstate generally does not sponsor individuals for employment-based visas for this</strong> <strong>position.</strong>\n<br><br>\nEffective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.\n<br><br>\nFor jobs in San Francisco, please click \"here\" for information regarding the San Francisco Fair Chance Ordinance.\n<br><br>\nFor jobs in Los Angeles, please click \"here\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.\n<br><br>\nIt is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era."}