{"job title": "Neurobiology - Principal Associate Scientist", "company": "Alnylam Pharmaceuticals, Inc.", "city state": "– Cambridge, MA", "rating": "4.2", "job description": "Overview\n<br><br>\nAlnylam was founded in 2002 on arevolutionary vision and bold mission which remain firmly in place today. Weare leading the translation of RNA interference (RNAi) into a new class ofinnovative medicines with the potential to transform the lives of people withrare genetic, cardio-metabolic, hepatic infectious, and central nervous systemdiseases with unmet need. ONPATTRO (patisiran), for the treatment of thepolyneuropathy of hereditary transthyretin-mediated amyloidosis in adults, isAlnylam's first U.S. FDA-approved RNAi therapeutic. In addition, Alnylam hasthree investigational medicines in late-stage development. Alnylam isproud to have been recognized as one of The Boston Globe's Top Places to Workin 2015, 2016, and 2017.\n<br><br>\nWe are currently seeking anexperienced Associate Scientist to join an interdisciplinary team dedicated toidentifying, testing and optimizing RNAi therapeutics.\n<br><br>\nSummary of Key Responsibilities\n<br><br>\nThe successful candidate will engage inpre-clinical activities to evaluate RNAi compounds for a variety of diseaseindications and also be involved in the development of lead candidates for currenttherapeutic programs. Responsibilities include\n\n\n<ul>\n<li>Evaluation of siRNA activity in wild type animals and animaldisease models</li>\n<li>In vivo characterization of various disease phenotypes and invitro molecular based assays</li>\n<li>Develop cell culture models to study target biology/pathways</li>\n<li>Analyze and present data at internal team meetings and stayabreast of relevant scientific literature.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's or Master's degree in a biological discipline such assuch as Neuroscience, pharmacology, genetics or molecular/cellular biology with6-8 years of relevant laboratory experience in an academic or industrysetting. PhDs need not apply.</li>\n<li>Excellent lab technique and the ability to analyze, interpret, andpresent data at team meetings and work with minimal supervision are aprerequisite</li>\n<li>The candidate must thrive in a team environment and possessexcellent and open communication skills</li>\n<li>Applicant must be self-motivated and excited to join a teamworking on novel diseases, target discovery and validation using animal models</li>\n<li>The role requires strong interpersonal skills and the ability tofunction across teams. We particularly seek someone who can work in a fast-pacedenvironment with demonstrated capacity to handle multiple projectssimultaneously.</li>\n</ul>\n\nCandidates must have technical experiencein each of the following areas:\n\n\n<ul>\n<li>In vivo experience with rodents: extensive proficiency in animalhandling, blood collection, dissection techniques, necropsies, experience withanimal models of disease and multiple routes of dose administration; experiencewith intrathecal dosing in rodents and CNS tissue collection techniques are aplus</li>\n<li>Basic Molecular biology techniques: purification andquantification of nucleic acids and protein, including qRT-PCR, ELISA, Westernblotting</li>\n<li>Tissue culture experience (primary and cell lines); experiencewith CNS derived cells and/or pancreatic islet isolation a plus</li>\n</ul>\n\nAlnylam Pharmaceuticals is an EEOemployer committed to an exciting, diverse, and enriching work environment.\n<br><br>\n<strong>#LI-LM1</strong>"}