{"job title": "Data Scientist", "company": "Altamira Technologies", "city state": "– Tampa, FL", "rating": "4.0", "job description": "<div><div> <p> </p>\n\n<p><strong>About Us</strong></p>\n\n<p>Altamira Technologies has a long and successful history providing innovative solutions throughout the U.S. National Security community. Headquartered in McLean, Virginia, Altamira serves the defense, intelligence and homeland security communities by focusing on creating innovative solutions leveraging common standards in architecture, data and security. Altamira believes that our people and the culture of our company differentiate us from other companies. We focus on recruiting talented, self-motivated employees that strive to find a way to get things done. Join our team of experts as we engineer national security!</p>\n\n<p>This is a position for on-site work located in Tampa, FL at a U.S. government location and requires a Top Secret SCI level clearance. The Applied Data Scientist position is responsible for applying data science and data characterization technologies and will report to the on-site program manager.</p>\n\n<p>The successful candidate must work across diverse projects in a dynamic and collaborative environment. They will develop understanding of established enterprise tools/processes while pursuing novel advanced analytic approaches using both large and small datasets. They will overcome challenges and be a determined problem-solver; pursuing innovation opportunities while delivering real results to move projects forward in an enterprise R&amp;D environment.</p>\n\n<p>The Applied Data Scientist will conduct end to end analysis; and develop and apply novel solutions from the best of academia, open source, and the commercial sector against challenging problems. They will assess and discover technology developments, determine relevance to projects, and operationally prototype them against real world data and problems in actual code using agile development techniques. Results must be documented in writing and communicated both verbally and through multi-media and advanced visualization methods to senior management. They will interact cross-functionally with a wide variety of people and identify opportunities to incorporate advanced analytics into existing workflows.</p>\n\n<p>This position requires agility and the desire to learn new tools, techniques and procedures; the successful candidate will possess knowledge and expertise in one or both of the following:</p>\n\n<ul>\n<li>Applied Mathematical Capabilities with a focus on Statistics, Modeling, Algorithm Design, or Discrete Math</li>\n<li>Applied knowledge of Machine Learning and Deep Learning frameworks such as sklearn, scipy, tensorflow, caffe, torch, and theano including model training/development for Classification and Regression.</li>\n</ul>\n\n<p>And also meet the following criteria:</p>\n\n<ul>\n<li><strong>TS/SCI Clearance</strong></li>\n<li>5-10 years of direct experience or an advanced degree (MS) in a quantitative field</li>\n<li>Three years of experience doing hands-on statistical/computational data analysis</li>\n<li>Applied experience in programming and statistical languages. We primarily work with Python, Javascript, and R. Experience with additional languages such as Julia, Java, C, etc. will also be considered.</li>\n<li>Familiarity with Computer Science fundamentals including data structures &amp; algorithms, Big O &amp; parallel processing. </li>\n<li>Able to communicate ideas and approaches to both technical and non-technical audiences</li>\n<li>Working knowledge of Microsoft Office &amp; collaboration tools like Slack, SharePoint, &amp; Atlassian</li>\n</ul>\n\n<p>Experience in or knowledge of the following is preferred but not required:</p>\n\n<ul>\n<li>Real-world application of Big Data Frameworks such as Hadoop and Spark</li>\n<li>Natural Language Processing (NLP) (CoreNLP, spaCy, NLTK, for NER/entity extraction, information extraction, sentiment analysis, etc.)</li>\n<li>Graph Modelling/Graph Database experience such as Neo4J, OrientDB, ArangoDB, NetworkX, Giraph, SparkX with an emphasis on relation extraction and graph analytics &amp; visualization</li>\n<li>Data Wrangling/ETL skills including scraping, REST/SOAP APIs, XML, JSON, Imagery, Video, SQL, NoSQL, real Unicode experience, and more.</li>\n<li>Interactive Data Visualization using tools like Jupyter or Javascript with D3.js that communicate both the analysis and technical ‘story’ to all audience levels both verbally and visually.</li>\n<li>Practical Software Engineering skills including design patterns, client-server, MVC, source control, code hygiene, regression/unit testing</li>\n<li>Knowledge of the U.S. Intelligence Community stakeholders, the intelligence cycle, ISR PED, and familiarity with the various intelligence disciplines (SIGINT, GEOINT, MASINT, IMINT, etc.)</li>\n</ul>\n\n<p> </p>\n\n<p> </p>\n\n<p> </p>\n\n<p>Altamira is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status.</p>\n\n<div> </div> </div></div><div><div> <br></div></div>"}