{"job title": "Data Scientist", "company": "Altec Industries", "city state": "– Birmingham, AL", "rating": "3.8", "job description": "<strong>Job Description</strong><br>\n\n <div><strong>Why Join Altec?</strong>\n<br><br>\nIf you’re considering a career with Altec, Inc., there’s never been a better time to join us! Our Company was founded based upon values that place the customer first, and view people as our greatest strength. Altec has continued to grow, utilizing the same basic values, and over the years, those values have helped us to earn the trust and confidence of our customers worldwide. We remain committed to total customer satisfaction in everything we do. That’s why today, Altec is an innovative, financially sound company that is setting the standard of excellence in design, manufacturing and service; and that’s why you can rely on us to provide you with the stability of a well managed company.\n<br><br>\n<strong>Our Company:</strong>\n<br><br>\nAltec Inc., founded in 1929, is a privately held company headquartered in Birmingham, Alabama.\n<br><br>\nAltec specializes in the manufacture, sale and service of aerial devices, digger derricks, cranes and specialty equipment for the electric utility, telecommunications, tree care, construction, and light and sign maintenance industries in more than 120 countries.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nThe purpose of the <strong>Data Scientist</strong> is to develop advanced analytic solutions from big data, internal data sets, and other data sources. Major responsibilities include the following:\n<ul>\n <li>Design and development of advanced analytics projects.</li> <li>Development of interfaces from analytics platform to other systems.</li> <li>Close collaboration with project business manager and internal team.</li> <li>Communication with internal business stakeholder departments.</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n <li>Team player with an ability to work with across teams to achieve objectives</li> <li>Ability to develop and maintain strong working relationships across functional boundaries, and at all levels of the company.</li> <li>Ability to work on a solution despite the potential of insufficient and/or imperfect information</li> <li>Flexibility/adaptability to work within changing circumstances</li> <li>Experience with Agile methodology for application development</li> <li>Experience with advanced data analytics and data mining</li> <li>Strong verbal and written communications skill</li> <li>High School Diploma or GED required</li> <li>Bachelor’s Degree in related discipline strongly preferred, but consideration may be given to an exceptional candidate with 6 years relevant work experience.</li> <li>Minimum of two years programming experience with Python, R, Scala</li>\n</ul>\n**The job level may be modified upward based on the qualifications of the candidate**\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nAltec offers a competitive salary that rewards performance and dedication, along with a comprehensive benefits package that includes:\n\n\n<ul>\n<li>Medical, Dental and Prescription Drug Program</li>\n<li>Retirement 401(k) Program</li>\n<li>Vacation and Holidays</li>\n<li>Flexible Spending Accounts</li>\n<li>Tuition Assistance Program</li>\n<li>Employee Assistance and Mental Health/Substance Abuse Program</li>\n<li>Life Insurance, Accidental Death and Dismemberment Insurance\n<br><br>\n<strong>EEO Statement</strong>\n<br><br>\nAltec Industries, Inc. and its affiliates are equal opportunity employers and maintain affirmative action plans to recruit, retain, develop, and promote qualified individuals without unlawful consideration of race, gender, color, religion, sexual orientation, gender identity, national origin, age, disability, citizenship status, veteran status, or any other characteristic protected by federal, state or local law. Altec strives to maintain a work environment free from unlawful discrimination and harassment, where associates are treated with respect and dignity.</li></ul></div>\n\n<br>\n"}