{"job title": "Data Scientist - AWS Professional Services", "company": "Amazon", "city state": "– New York, NY", "rating": "3.8", "job description": "Excited by using massive amounts of data to develop Machine Learning (ML) and Deep Learning (DL) models? Want to help the largest global enterprises derive business value through the adoption of Artificial Intelligence (AI)? Eager to learn from many different enterprises use cases of AWS ML and DL? Thrilled to be key part of Amazon, who has been investing in Machine Learning for decades, pioneering and shaping the worlds AI technology?\n<br>\nAt Amazon Web Services (AWS), we are helping large enterprises build ML and DL models on the AWS Cloud. We are applying predictive technology to large volumes of data and against a wide spectrum of problems. Our Professional Services organization works together with our AWS customers to address their business needs using AI.\n<br><br>\nAWS Professional Services is a unique consulting team. We pride ourselves on being customer obsessed and highly focused on the AI enablement of our customers. If you have experience with AI, including building ML or DL models, wed like to have you join our team. You will get to work with an innovative company, with great teammates, and have a lot of fun helping our customers.\n<br><br>\nIf you do not live in a market where we have an open Data Scientist position, please feel free to apply. Our Data Scientists can live in any location where we have a Professional Service office.\n<br><br>\nA successful candidate will be a person who enjoys diving deep into data, doing analysis, discovering root causes, and designing long-term solutions. It will be a person who likes to have fun, loves to learn, and wants to innovate in the world of AI. Major responsibilities include:\n<br><br>\n· Understand the customers business need and guide them to a solution using our AWS AI Services, AWS AI Platforms, AWS AI Frameworks, and AWS AI EC2 Instances .\n<br>\n· Assist customers by being able to deliver a ML / DL project from beginning to end, including understanding the business need, aggregating data, exploring data, building &amp; validating predictive models, and deploying completed models to deliver business impact to the organization.\n<br>\n· Use Deep Learning frameworks like MXNet, Caffe 2, Tensorflow, Theano, CNTK, and Keras to help our customers build DL models.\n<br>\n· Use SparkML and Amazon Machine Learning (AML) to help our customers build ML models.\n<br>\n· Work with our Professional Services Big Data consultants to analyze, extract, normalize, and label relevant data.\n<br>\n· Work with our Professional Services DevOps consultants to help our customers operationalize models after they are built.\n<br>\n· Assist customers with identifying model drift and retraining models.\n<br>\n· Research and implement novel ML and DL approaches, including using FPGA.\n<br><br>"}