{"job title": "Principal Research Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nInterested in Amazon Echo? We’re building the speech and language solutions behind Amazon Echo and other Amazon products and services. Come join us!<br> <br> Amazon Alexa has an opportunity for a dynamic scientist to lead the technical evolution in our teams in the spoken language understanding field. We are continually adding new capabilities to Alexa across many languages and domains. The foundation for our progress is our ability to work with data, to measure impact and accuracy, to respond quickly while keeping the long-term vision in mind, and to develop the talent on our teams. We are looking for a leader with the ability to mentor talent across our modeling and data teams. We are looking for technical leadership for how we measure our impact on improving the customer experience. You will be asked to think both strategically and tactically.<br> <br> This role requires a thought leader able to see beyond what we are doing today and identify where we will need to be in the future, and get us there through concrete practical steps. You will ideally have a broad range of domain skills from statistical machine learning to data management to analytics and data science. You will be experienced in stakeholder management and able to represent the technical tradeoffs in a range of decision making settings -- speaking to the various challenges and trade-offs in producing models able to perform consistently well across messy real-world data. You will guide our teams through pivotal decisions, hold and raise the bar for metrics integrity and ease of interpretation, and will help our partners invent and scale with us. <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Graduate degree in engineering, computer science, computational linguists, mathematics, or equivalent</li><li>10+ years of related experience</li><li>Hands-on experiences in data science and machine learning</li><li>Experience delivering science solutions in data-driven settings</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>A track record of developing the skills and trajectories of talented and motivated people.</li><li>Project management experience desired for working on cross-functional projects</li><li>Ability to rapidly prototype and evaluate solutions and methodologies.</li><li>Excellent written and verbal technical communication. Able to explain complex solutions in easy-to-understand terms.</li><li>Track record of diving into data to discover hidden patterns and of conducting error/deviation analysis</li><li>Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations</li><li>Exceptional level of organization</li><li>Comfortable working in a fast paced, highly collaborative, dynamic work environment</li><li>Ability to think creatively and solve problems</li></ul><br> <br><br>Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation<br> <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}