{"job title": "Senior Applied Scientist - Alexa Data Services (ADS)", "company": "Amazon", "city state": "– Cambridge, MA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nInterested in Amazon Echo and the future of intelligent interfaces? Alexa Data Services (ADS) is looking for an Sr. Applied Scientist focused on Natural Language Processing (semantic annotation and automatic speech recognition) to join our Data and Annotation Science team in the area of speech and language data processing. ADS’s mission as a provider of high-quality labeled data at high-speed and low-cost for Machine Learning technologies that enable Alexa’s expansion across Devices, Countries, Languages, and Domains is: To help Alexa AI Invent foundational machine learning technologies for anyone to build intelligent conversational interfaces for any device, application, language, and environment. We’re building the speech and language solutions behind Amazon Echo and other Amazon products and services. We’re working hard, having fun, and making history; come join us! <br> <br> As an Senior Applied Scientist in ADS, you will be responsible for the research, design and development of new natural language, search, and machine learning technologies for various NLP applications, building active learning frameworks, developing training and evaluation frameworks, and generally owning model development for all aspects of data processes for ML production and experimentation. You will be working with top scientists and engineers, as well as with product teams and other research partners, both locally and abroad. Your work will combine data mining, systems and software development, exploration of new technologies, as well as can include publications and presentations at top scientific conferences.<br> The ideal candidates have deep expertise in one or several of the following fields: Information Retrieval, Web search, Web data mining, Machine Learning, Natural Language Processing, Artificial Intelligence. An ideal candidate shows a bias for action and has a strong understanding of empirical methods. The ability to write clearly and speak convincingly as evidenced through participation in academic conferences and service in the scientific community are a must. We expect scientists in this team to use ML techniques to create and deploy to production, models that deliver advanced Natural Language Understanding (NLU) capabilities for domain and intent classification and for named entity recognition.<br> If you have an entrepreneurial spirit, know how to deliver, are deeply technical, highly innovative and long for the opportunity to build pioneering solutions to challenging problems, we want to talk to you. <br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Masters or Ph.D in Computer Science or Language Science</li><li><br></li><li>10+ years of experience working in ML, speech recognition, natural language understanding, computer visions etc.</li><li><br></li><li>Experience applying theoretical models in an applied environment, solid fundamentals in problem solving, algorithm design and complexity analysis.</li><li><br></li><li>Experience conducting analyses, and developing different types of supervised and unsupervised models for complex projects</li><li><br></li><li>Experience with defining organizational research and development practices in an industry setting.</li><li><br></li><li>Peer-reviewed publications in information retrieval, natural language processing, machine learning or related topics</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>A track record of communicating well with software engineers and non-technical leaders in speech technology</li><li><br></li><li>Recognized as an industry leader in the fields of natural language processing or computational linguistics</li><li><br></li><li>Experience in organization of scientific and pedagogic events such as conferences and universities.</li><li><br></li><li>Proficient with mathematical programming libraries.</li><li><br></li><li>Expert in at least one more major programming language (C++, Java, or similar) and at least one scripting language (Perl, Python, or similar).</li><li><br></li><li>Excellent verbal/written communication skills, including an ability to effectively collaborate with research and technical teams, and earn the trust and influence senior stakeholders.</li><li><br></li><li>Experience in defining research vision and getting buy-in from senior research and business leader across the company.</li><li><br></li><li>Industrial experience with big data, map-reduce or Spark</li></ul><br><br> <br> Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}