{"job title": "Machine Learning Scientist, Alexa Speech", "company": "amazon.com", "city state": "– Seattle, Washington", "rating": "3.8", "job description": "SunIRef:it\n<br><br>\nMachine Learning Scientist, Alexa Speech - Seattle, WA - **********\n<br><br>\nFind Jobs\n<br>\nCompany Reviews\n<br>\nFind Salaries\n<br>\nFind Resumes\n<br>\nEmployers / Post Job\n<br>\nUpload your resume\n<br>\nSign in\n<br><br>\nHome\n<br><br>\nwhatjob title, keywords, or company\n<br><br>\nwherecity, state, or zip code\n<br><br>\nFind Jobs\n<br><br>\nAdvanced Job Search\n<br><br>\nMachine Learning Scientist, Alexa Speech\n\n\n<ul>\n<li>*********</li>\n</ul>\n\n28,625 reviews\n\n<li>Seattle, WA</li>\n\n\n<ul>\n<li>*********</li>\n</ul>\n\n28,625 reviews\n<br><br>\nRead what people are saying about working here.\n<br><br>\nDesired: JavaSoftware DevelopmentNatural Language ProcessingC/C++PythonPerlMachine Learning\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nAmazon is looking for a passionate, talented, and inventive Scientist with a strong machine learning background to help build industry-leading Speech and Language technology. Our mission is to push the envelope in Automatic Speech Recognition (ASR) and Natural Language Understanding (NLU), in order to provide the best-possible experience for our customers.\n<br>\nAs a Machine Learning Scientist, you will work with talented peers to develop novel algorithms and modeling techniques to advance the state of the art in spoken language understanding. Your work will directly impact our customers in the form of products and services that make use of speech and language technology. You will leverage Amazon's heterogeneous data sources and large-scale computing resources to accelerate advances in spoken language understanding.\n<br><br>\nBasic Qualifications\n<br><br>\nMaster's degree in Electrical Engineering, Computer Sciences, or Mathematics with specialization in speech recognition, natural language processing, or machine learning\n<br>\n1+ years experience with programming languages such as C/C++, Java, Perl or Python.\n<br>\n1+ years experience in building speech recognition and natural language processing systems\n<br><br>\nPreferred Qualifications\n<br><br>\nPhD in Electrical Engineering, Computer Sciences, or Mathematics with specialization in speech recognition, natural language processing, or machine learning.\n<br>\n3+ years experience in building speech recognition and natural language processing systems\n<br><br>\nSolid Machine Learning background and familiar with standard speech and machine learning techniques.\n<br>\nScientific thinking and the ability to invent, a track record of thought leadership and contributions that have advanced the field\n<br>\nSolid software development experience\n<br>\nGood written and spoken communication skills.\n<br><br>\nAmazon is an Equal Opportunity-Affirmative Action Employer - Women/Minority/Disability/Veteran/Gender Identity/Sexual Orientation\n<br><br>\nspeech-jobs\n\n\n<ul>\n<li>********* - 4 hours ago - report job - original job</li>\n</ul>\n\nOn Company Site\n<br><br>\nSave this job"}