{"job title": "Data Scientist, Market Intelligence", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nWe're a company of pioneers. It's our job to make bold bets, and we get our energy from inventing on behalf of customers. Success is measured against the possible, not the probable. For today’s pioneers, that’s exactly why there’s no place on Earth they’d rather build than Amazon.<br> <br> To support enterprise, global growth, Amazon created the Global Expansion, Mergers &amp; Acquisitions team (GEMA). This team is a project/program team supporting cross-Steam expansion efforts specific to geographic expansion, mergers and acquisition integration, mobile talent strategy and corporate site expansion. GEMA’s mission is to invent ways for Amazon to grow smarter. <br> <br> Within the GEMA organization, the Global Expansion Market Intelligence (GEMI) team is focused on finding the most optimal locations for long term, corporate growth and assessing global talent pools. As a Data Scientist on the GEMI team, you will be responsible for organizing, synthesizing and analyzing data used in both the global site expansion model and talent research. <br> <br> The ideal candidate will be able to solve complex problems using data science principles that are highly accurate, scalable and cost-effective. You will have hands-on experience leading and/or working on multiple simultaneous data science initiatives as well as be able to balance technical with business judgment to make the right decisions about technology, models and methodology choices. As a Data Scientist, you will be responsible for developing programs, reporting, visualizations, tests and research in order to drive business solutions using computational techniques. The ideal candidate will have significant experience performing data analysis and reporting and will be responsible for developing, improving and simplifying our models. <br> <br> This position requires a solution-oriented candidate with a combination of business acumen, broad knowledge of statistics and algorithm development and an analytical mindset. The candidate must have the ability to work with diverse stakeholder groups to solve business problems and provide data solutions that are organized and simple to understand.<br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Masters with two years of experience or a Bachelors with five years of experience.<br> · Two years of relevant work experience in matrixed organization <br> · Experience in SQL, R, Python, or another scripting language; command line usage<br> · Track record of diving into data to discover hidden patterns and of conducting error/deviation analysis<br> · Knowledge of various machine learning techniques and key parameters that affect their performance<br> · Experience developing experimental and analytic plans for data modeling processes, using strong baselines, and determining cause and effect relations<br> · Evidence of using of relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etc. in data analysis projects<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Experience in one or more natural language processing topics: tagging, syntactic parsing, word sense disambiguation, topic modeling; contextual text mining, and application of deep learning to NLP<br> · Previous experience in a ML or data scientist role with a large technology company<br> · Excellent written and verbal communication skills for both technical and non-technical audiences<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}