{"job title": "Machine Learning Scientist", "company": "Amazon", "city state": "– Sunnyvale, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon is looking for a passionate, talented, and inventive Senior Scientist to help build industry-leading Speech and Language technology. Our mission is to push the envelope in Automatic Speech Recognition (ASR), Natural Language Understanding (NLU), and Audio Signal Processing, in order to provide the best-possible experience for our customers.<br> <br> As a Speech and Language Scientist, you will work with talented peers to develop novel algorithms and modeling techniques to advance the state of the art in spoken language understanding. Your work will directly impact our customers in the form of novel products and services that make use of speech and language technology. You will leverage Amazon’s heterogeneous data sources and large-scale computing resources to accelerate advances in spoken language understanding. You will mentor junior scientists, create and drive new initiatives. <br> <br> We are hiring in all areas of spoken language understanding: ASR, NLU, text-to-speech (TTS), and Dialog Management. <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br> <ul><li>Graduate degree (MS or PhD) in Electrical Engineering, Computer Sciences, or Mathematics with specialization in speech recognition, natural language processing, or machine learning.</li><li>Familiar with programming languages such as C/C++, Java, Perl or Python.</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience in building speech recognition and natural language processing systems (e.g. commercial speech products or government speech projects)</li><li>Solid Machine Learning background and familiar with standard speech and machine learning techniques.</li><li>Scientific thinking and the ability to invent, a track record of thought leadership and contributions that have advanced the field</li><li>Solid software development experience</li><li>Good written and spoken communication skills.</li></ul><br><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br><br>speech-jobs<br> <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}