{"job title": "Big Data Engineer: ML Platform", "company": "amazon.com", "city state": "– Seattle, Washington", "rating": "3.8", "job description": "SunIRef:it\n<br><br>\nBig Data Engineer: ML Platform - Seattle, WA - **********\n<br><br>\nFind Jobs\n<br>\nCompany Reviews\n<br>\nFind Salaries\n<br>\nFind Resumes\n<br>\nEmployers / Post Job\n<br>\nUpload your resume\n<br>\nSign in\n<br><br>\nHome\n<br><br>\nwhatjob title, keywords, or company\n<br><br>\nwherecity, state, or zip code\n<br><br>\nFind Jobs\n<br><br>\nAdvanced Job Search\n<br><br>\nBig Data Engineer: ML Platform\n\n\n<ul>\n<li>*********</li>\n</ul>\n\n28,620 reviews\n\n<li>Seattle, WA</li>\n\n\n<ul>\n<li>*********</li>\n</ul>\n\n28,620 reviews\n<br><br>\nRead what people are saying about working here.\n<br><br>\nDesired: SQLHadoopHiveAWSPigSparkData WarehouseLinuxJavaRMATLABSystem DesignScalaBig DataS3PythonHBaseMachine Learning\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nAre you passionate about data? Does the prospect of dealing with massive volumes of data excite you? Do you want to be part of team building a new machine learning platform that processes billions of records a day in a scalable fashion using AWS technologies?\n<br><br>\nAmazon's Finance Technology team is seeking an outstanding Big Data Engineer to join the team that is shaping the future of the finance machine learning platform. The team is committed to building a large-scale machine learning platform solving complex and ambiguous problems in the finance space to service customers such as payments, treasury, and finance operations. Amazon has culture of data-driven decision-making, and demands data that is timely, accurate, and actionable.\n<br><br>\nOur ideal candidate thrives in a fast-paced environment, relishes working with large transactional volumes and big data, enjoys the challenge of highly complex business contexts (that are typically being defined in real-time), and, above all, is a passionate about data and machine learning.\n<br><br>\nBasic Qualifications\n<br><br>\nBachelor's degree or higher in an analytical area such as Computer Science, Physics, Mathematics, Statistics, Engineering or similar.\n<br>\nDemonstrated ability in data modeling, ETL development, and data warehousing.\n<br>\nCoding proficiency in at least one modern programming language (e.g. Python, Java, Scala)\n<br>\nExperience with Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.).\n<br><br>\nPreferred Qualifications\n<br><br>\nIndustry experience as a Data Engineer or related specialty (e.g., Software Engineer, Business Intelligence Engineer, Data Scientist) with a track record of manipulating, processing, and extracting value from large datasets.\n<br>\nExperience building/operating highly available, distributed systems of data extraction, ingestion, and processing of large data sets\n<br>\nExperience building data products incrementally and integrating and managing datasets from multiple sources\n<br>\nQuery performance tuning skills using Unix profiling tools and SQL\n<br>\nExperience leading large-scale data warehousing and analytics projects, including using AWS technologies - Redshift, S3, EC2, Data-pipeline and other big data technologies\n<br>\nExperience providing technical leadership and mentor other engineers for the best practices on the data engineering space\n<br>\nLinux/UNIX including to process large data sets.\n<br>\nExperience with AWS services\n<br>\nSome experience leveraging Python, R or Matlab to manipulate data and set up automated processes as per business requirements\n<br>\nStrong ability to interact, communicate, present and influence within multiple levels of the organization\n<br>\nMaster's degree\n<br>\nExcellent communication skills to be able to work with business owners to develop and define key business questions and to build data sets that answer those questions\n<br>\nPrevious experience with distributed or load balanced system design and development.\n<br>\nStrong verbal/written communication and data presentation skills, including an ability to effectively communicate with both business and technical teams.\n\n\n<ul>\n<li>********* is an Equal Opportunity-Affirmative Action Employer - Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.</li>\n<li>********* - 2 hours ago - report job - original job</li>\n</ul>\n\nOn Company Site\n<br><br>\nSave this job"}