{"job title": "Research Scientist, Alexa AI - Speech/Audio", "company": "Amazon", "city state": "– Sunnyvale, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nInterested in Amazon Echo? We’re building the speech and language solutions behind Amazon Echo and other Amazon products and services. Come join us! <br><br>As a Research Scientist on our Wake Word team, you will be responsible for data-driven improvements to our spoken language understanding models. Your work will directly impact our customers in the form of products and services that make use of speech and language technology. <br>You will: <br><br>· Ensure data quality throughout all stages of acquisition and processing, including such areas as data sourcing/collection, ground truth generation, normalization, transformation, cross-lingual alignment/mapping, etc. <br>· Clean, analyze and select data to gauge customer experience <br>· Build and release models that elevate the customer experience and track impact over time <br>· Collaborate with colleagues from multidisciplinary science, engineering and business backgrounds. <br>· Present proposals and results in a clear manner backed by data and coupled with actionable conclusions to drive business decisions <br>· Work with engineers to develop efficient data querying and modeling infrastructure for both offline and online use cases\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· MS/ Ph.D. in Computer Science, Engineering, Statistics or related field <br>· 3-5 years of experience with various data analysis and visualization tools <br>· Experience in Python, or another scripting language; command line usage, e.g., Bash <br>· Experience in algorithms and data structures <br>· Experience with various machine learning and modeling techniques and parameters that affect their performance<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\nProven track record of achievements in language research and development for Automatic Speech Recognition or Natural Language Processing. <br>· Track record of diving into data to discover hidden patterns and of conducting error/deviation analysis <br>· Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations <br>· Thorough understanding of relevant statistical measures such as confidence intervals, the significance of error measurements, development and evaluation data sets, etc. <br>· Experience with statistical modeling/machine learning <br>· The motivation to achieve results in a fast-paced environment. <br>· Strong attention to detail <br>· Exceptional level of organization <br>· Comfortable working in a fast-paced, highly collaborative, dynamic work environment <br>Ability to think creatively and solve problems <br>· Fluency in a foreign language <br><br>Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}