{"job title": "Data Engineer", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nThe Amazon Appstore is seeking a highly skilled and motivated Data Engineer to join our Data Science team. Our ideal candidate is someone who is continually learning and improving as the business grows and relevant technologies continue to evolve. If you enjoy innovating, thinking big and want to contribute directly to the success of an industry changing business, you may be a prime candidate for this position.<br><br>CORE RESPONSIBILITIES<br>· Lead architecture design and implementation of next generation data platform and model deployment solutions.<br>· Build robust and scalable data integration (ETL) pipelines using SQL, EMR, Python and Spark.<br>· Mentor and develop other DE's and BIE's.<br>· Build and deliver high quality data architecture to support business analysts, data scientists, and customer reporting needs.<br>· Interface with other technology teams to extract, transform, and load data from a wide variety of data sources.<br>· Continually improve ongoing reporting and analysis processes, automating or simplifying self-service support for customers<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Bachelor's degree or higher in a quantitative/technical field (e.g. Computer Science, Statistics, Engineering)<br>· 5+ years of relevant experience in one of the following areas: Data engineering, database engineering, business intelligence or business analytics<br>· 5+ years of hands-on experience in writing SQL queries across data sets<br>· 2+ years of experience in scripting languages like Python<br>· Experience with data modeling, ETL development, and Data warehousing. Data Warehousing<br>· Experience with Redshift, Oracle, etc.<br>· Experience with AWS services including S3, Redshift, EMR, and RDS<br>· Experience with Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.<br>· Experience in working and delivering end-to-end projects independently<br>· Knowledge of distributed systems as it pertains to data storage and computing<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Proven success in communicating with users, other technical teams, and senior management to collect requirements, describe data modeling decisions and data engineering strategy<br>· Experience providing technical leadership and mentoring other engineers for best practices on data engineering<br>· Knowledge of software engineering best practices across the development lifecycle, including agile methodologies, coding standards, code reviews, source management, build processes, testing, and operations<br>· Masters in computer science, mathematics, statistics, economics, or other quantitative field<br><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}