{"job title": "Data Engineer - Delivery Experience", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAs a Data Engineer in Delivery Experience (DEX), you will be joining a team of economists, data scientists, data engineers, and business analysts that help develop an analytic platform for supporting and optimizing one of the most integral aspects of Amazon's business - the delivery experience. You will work with our team and business partners to drive deep dives, and measure business impact of various product offerings. You will help support one of the larger and most visible Redshift clusters at Amazon and have the opportunity to implement new technologies to improve our offerings. This is a unique opportunity for a DE to work at the intersection of customer facing product development, support, and science. <br><br>You will transform data into actionable business information, and will make it readily accessible to stakeholders worldwide. You will interact with internal technical teams and product owners to gather requirements, structure scalable and performant data solutions, and gain a deep understanding of key datasets. You will design, implement and drive adoption of new data pipeline technologies and solutions and promote industry standard best practices. You will be responsible to tune query performance against large and complex data sets. You will help translate analytic insights into concrete, actionable recommendations for business or product improvement and improve our use of EMR.<br>About you:<br><br>You are skeptical. When someone gives you a data source, you pepper them with questions about sampling biases, accuracy, and coverage. When you’re told a model can make assumptions, you aggressively try to break those assumptions.<br><br>You have passion for excellence. The wrong choice of data could cost the business dearly. You maintain rigorous standards and take ownership of the outcome of your data pipelines.<br><br>You do whatever it takes to add value. You don’t care whether you’re working on integrating multiple disparate data-sets, blazing fast code, scraping data, or building EMR processes to pipe in terrabytes of data, you care passionately about shareholders and know that as a curator of data insight you can unlock massive cost savings.<br><br>You have a limitless curiosity. You constantly ask questions about the technologies and approaches we are taking and are constantly learning about industry best practices you can bring to our team.<br>You have excellent business and communication skills to be able to work with product owners to understand key business questions to build data pipelines that enable product owners to answer those questions quickly and accurately.<br>You are very comfortable juggling competing priorities and handling ambiguity. You thrive in an agile and fast-paced environment on highly visible projects and initiatives <br><br><br><br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor’s degree in Computer Science, MIS, related technical field, or equivalent work experience.</li><li>At least 2 years of relevant work experience in analytics, data engineering, business intelligence or related field</li><li>Demonstrable ability in data modeling, ETL development, and Data warehousing, or similar skills</li><li>Knowledge of Advanced SQL and scripting for automation (e.g. Python, Perl or Ruby)</li><li>Proven track record of successful communication of analytical outcomes through written communication, including an ability to effectively communicate with both business and technical team</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Graduate degree in computer science, business, mathematics, statistics, economics, or other quantitative field</li><li>3+ years prior experience in a Data Engineer or Software Development role</li><li>Both technically deep and business savvy enough to interface with all levels and disciplines within the organization</li><li>Experience with AWS technologies</li><li>Familiarity with statistical models and data mining algorithms<br></li><li>Experience with reporting tools like Tableau or other BI packages</li></ul><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br><br> <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}