{"job title": "Sr. Data Scientist - Machine Learning", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you interested in building, leading and driving a machine learning vision, strategy and execution plan for process improvement efforts centered on Operations? WW Ops ACES is hiring a Senior Machine Learning Scientist (MLS) to play a leadership role in applying machine learning and data science capabilities to process improvement projects. Our goal is apply innovative data solutions to process improvement efforts across Amazon in areas such as artificial intelligence, data science, machine learning, computer vision, and other capacities to advance Amazon’s performance. <br> <br> The ideal candidate will be an expert in the areas of data science, machine learning and statistics, having hands-on experience with multiple improvement initiatives as well as balancing technical and business judgment to make the right decisions about technology, models and methodologies. The candidate needs experience with data science / business intelligence, analytics, and reporting systems while striving for simplicity, and demonstrating significant creativity and high judgment backed by statistical proof. The candidate will be expected to balance detailed execution with speed and possess solid collaborative skills, having excellent communication skills and proven ability to work with business and technical owners to develop and define solutions. The successful candidate will be a recognized expert for their analytical and leadership abilities.<br> <br><ul><li>Apply Statistical, Data Science, Machine Learning or other innovative methods to specific business problems and data</li><li>Collaborate with colleagues from multidisciplinary science, engineering and business backgrounds.</li><li>Work with engineers to develop efficient data querying and modeling infrastructure</li><li>Communicate proposals and results in a clear manner backed by data and coupled with actionable conclusions to drive business decisions<br></li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>MS in Data Science, Machine Learning, Statistics, Computer Science, Applied Math or equivalent highly technical field.</li><li>5+ years of hands-on experience working in data science and/or machine learning, data analytics/engineering using models and methods such as neural networks with cross-functional teams.</li><li>Experienced in computer science fundamentals such as object-oriented design, data structures and algorithm design.</li><li>Proven ability to implement and operate at large scale</li><li>Proven results executing process improvements</li><li>Demonstrated success in an environment which offers ambiguously defined problems, big challenges, and quick changes.</li><li>Have a history of building systems that capture and utilize large data sets in order to quantify performance via metrics or KPIs.</li><li>Proficient using R, Python, or other equivalent statistics and machine learning tools.<br></li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>PhD in Data Science, Machine Learning, Statistics, Computer Science, Applied Math or equivalent highly technical field.</li><li>Experience in software development.</li><li>Black Belt Certification</li></ul>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.<br><br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}