{"job title": "Sr. Data Scientist - Data Visualization Specialist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon is looking for a Sr. Data Scientist for Amazon Devices. This person will design and develop data visualizations that help us extract key insights from our data, which might otherwise go unnoticed. This role is central to the continued growth of the Amazon Devices division as it continues its fast-paced growth and expansion from the first Kindle e-Reader to a broad portfolio of Fire Tablets, Fire TVs, and most recently, Echo. <br> <br> The mission of our Worldwide Planning organization is to deliver the most accurate forecasts, inventory targets, and allocation plans to ensure every customer is able to purchase the product they want, when and where they want it. In order to achieve this, our team develops and uses optimization tools, advanced statistical models, machine learning algorithms and big data solutions, to provide the Device organization with a forecast and operational plan.<br> <br> As our organization's Sr. Data Scientist you would be responsible for creating compelling, clear, and powerful visualizations of our data. We want our data to tell a clear story, highlight insights we hadn't previously seen, and do it all faster than we've been able to previously. We want someone to work on this full-time, lead our efforts, and improve everyone's work by example and by improving the tools we use to do so. You'll be required to figure out what's important to the business, to specific partners, and intuit core needs from people before they even realize they need it. With an understanding of the core business needs in hand, you’ll use your programming, SQL, and data visualization skills to develop solutions that will help move the business forward and enable better decisions to be made in less time.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· 7+ years of experience in SQL, can independently mine data to translate Business data needs into creative visualizations<br>· 5+ years of experience using Tableau<br>· 5+ years of experience working with D3.js<br>· 5+ years’ experience programming with other visualization libraries such as chart.js processing.js, raphael.js, highchart.js<br> · Experience interfacing with business customers, gathering requirements and gaining a deep-dive understanding of key data<br>· Bachelor's degree<br> <br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Masters degree<br> · Computer Science degree<br> · Tableau certification<br> · Excellent analytical, critical thinking, and problem-solving skills.<br> · Experience with MPP databases such as Redshift<br> · Strong expertise in the design, creation, management, and business use of large datasets<br> · Ability to meet tight deadlines and prioritize workloads in a fast paced environment<br><br>Amazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}