{"job title": "Sr. Data Engineer", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nWe're looking for a strong data engineer to help us build a new generation of data solutions. These solutions will be central to our charter of driving inventory management and optimization initiatives in Amazon’s FBA business. If you want to build a new system from the ground up, this job is for you! <br> We are part of Supply Chain Optimization Technologies (SCOT) and go by the name FIO (FBA Inventory Optimization. We are dedicated to driving free cash flow by automating and optimizing our third-party fulfillment supply chain. We will break down barriers to growth, accelerate through escape velocity, and generally monkey with the Laws of (Supply) Physics. We will be disruptive, and we will make a HUGE difference to our third party partners and Amazon customers. Our projects are based on weird and wonderful ideas driven by some pretty crazy math. This is ground-breaking stuff! <br> <br> We are looking for data engineers to join us on our crazy journey. You want this job if the following sounds familiar: <br> · You want to be exposed to something new. Automating third party supply management may be the last real frontier in our supply systems and we are breaking new ground to drive inventory across Amazon marketplaces!<br> · You have an entrepreneurial streak that is itching to challenge how Amazon manages its supply.<br> · You are looking for a team that will give you headroom to sharpen and grow your technical skills and business knowledge.<br> · You are passionate about using data to solve challenging problems.<br> <br> Successful candidates will have strong analytical skills who can prioritize well, communicate clearly, and have a consistent track record of delivery. This is a highly visible role that requires partnering with several internal teams to impact Amazon’s bottom line. You must have the experience and capability to create and present documentation, data and reports to program and development managers and directors. Excellent written and verbal communication skills are essential. You should be experienced in creating new metrics, working with data to analyze root causes, implementing long term solutions, and working with teams who have advanced analytical, mathematical, and quantitative capabilities.<br> <br> Your responsibilities include: <br> · Identify specific success metrics for our internal services as well as client programs<br> · Design and implement metrics, data storage, and reporting mechanisms<br> · Work with in-house scientists, global supply chain teams, FBA teams, and software teams to identify new solutions<br> · Design for scale, starting with localized experiments but planning for worldwide implementation<br> · Track success criteria, communicate results with senior leaders, support adhoc requests, bridge technical and business program metrics<br> <br><br> <br><br> <br> Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nBasic Qualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<b>Basic qualifications</b><br>· Bachelor’s degree in CS or related technical field<br>· 5+ years of relevant experience in using OLAP and BI Analytic technologies.<br>· Experience with ETL (Extract Transform Load) and Data Warehousing systems.<br>· 5+ years of hands-on experience in writing complex, highly-optimized SQL queries across large data sets (millions to billions of rows)<br>· Experience with AWS services including S3, Redshift and EMR<br>· Strong customer focus\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nPreferred Qualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<b>Preferred qualifications</b> <br>· Experience with big data technologies such as EMR, Spark.<br>· Knowledge of software engineering best practices across the development lifecycle, including agile methodologies, coding standards, code reviews, source management, build processes, testing, and operations\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}