{"job title": "Data Scientist II - AMZ", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nMULTIPLE POSITIONS AVAILABLE<br> Entity: Amazon.com Services, Inc.<br> Position: Data Scientist II<br> Location: Seattle, WA<br> Position Responsibilities:<br> Analyze business cases with unclear solutions. Apply a breadth of experience from practical application of data science techniques and tools to solve difficult business problems. Use a range of data science methodologies with a deep understanding of the business area the team focuses on, incorporating expertise from engineers and other subject matter experts to create pragmatic solutions. Design and implement scalable and reliable approaches to extract the best information possible from the data. Make trade-offs between methods and apply best practices to validate solutions. Work with business stakeholders, other scientists, and engineers to identify data requirements for a given problem. Evaluate existing and new technologies required for a solution. Write clear and accurate documents, including documents with substantial data and analytical components. Explain technical concepts and assumptions to non-technical audiences. Compare various approaches, describe techniques thoroughly, and use figures effectively. Develop metrics to quantify the benefits of a solution and influence project resources. Audit metric data and measure project progress and success. Participate in discussions, team planning, office hours, and metric reviews. Identify issues and propose solutions to business problems. Provide peer feedback on solutions and results. Mentor junior data scientists.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\nPosition Requirements: <br> Master’s degree or foreign equivalent in Computer Science, Machine Learning, Mathematics, Statistics, Operations Research, Industrial or Operations Engineering, or a related field and two year of experience in the job offered or a related occupation. Employer will also accept a Bachelor’s degree or foreign equivalent in Computer Science, Machine Learning, Mathematics, Statistics, Operations Research, Industrial or Operations Engineering, or a related field and five years of experience in the job offered or a related occupation as equivalent to the Master’s degree and two years of experience. Must have one year of experience in the following skill(s): using R, Python, Weka, SAS, Matlab or other statistical/machine learning software; applying machine learning techniques; developing experimental and analytics plans for data modeling processes; and using relevant statistical measures such as confidence intervals, significance of error measurements, or development and evaluation data sets.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\nApplicants must meet all of the above listed requirements for this position.\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}