{"job title": "Research Scientist II", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAt Amazon we strive to be the most innovative and customer centric company on the planet. Come work with us while we are developing our Middle Mile Transportation Technology to deliver the best solutions for our vendors, warehouses and carriers. Help us solve complex problems impacting billions of dollars per year while partnering with world class scientist. Our mission is to build the most efficient and optimal transportation solution on the planet. We aim to leverage cutting edge technologies in big data, machine learning, and optimization techniques, and operate high volume, low latency, and high availability services. <br> <br> You’ll design, model, develop and implement state of the art systems and solutions used by Amazon worldwide and will regularly interact with engineering and business leadership. You will participate in the planning and execution of technology projects and operational excellence initiatives. <br> <br> This critical role requires an aptitude for taking quick initiative, thinking big, and delivering results to drive innovation in transportation modeling and optimization across Amazon’s expanding global network. You will also have the opportunity to work with some of the leading scientists in the areas of meta-heuristics, routing optimization and machine learning.<br> <br> Tasks/ Responsibilities:<br> · Partnership with the engineering and operations to drive modeling and design for complex business problems. <br> · Design and prototype decision support tools (product) to automate standardized processes and optimize trade-offs across the full decision space.<br> · Contribute to the mid- and long-term strategic planning studies and analysis.<br> · Lead complex transportation modeling analyses to aid management in making key business decisions and set new policies.<br> · Communicate with senior management regarding the results of business analysis, strategies and tactics.<br> · Lead small to medium-sized analytics projects that supports Amazon global logistics operations and network expansion decision making.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· PhD in Operations Research, Applied Mathematics, Computer Science or related engineering fields, or equivalent experience.<br> · Experience designing optimization solutions for very-large scale applications.<br> · Detailed knowledge of optimization methods for solve large-scale linear and mixed-integer programming models.<br> · Experience designing and implementing optimization models for discrete/combinatorial optimization problems (e.g., vehicle routing, scheduling, and facility location) and experience with leveraging such models to provide guidance for (long-term) strategic and (Short-term) tactical decision making.<br> · Excellent written and verbal communication skills with both technical, business, and operations people.<br> · Strong problem-solving ability and the ability to work in ambiguous and constantly evolving environment.<br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Deep understanding of MIP strategies to customize and leverage commercial algorithms and adapt them as required.<br> · Deep understanding of decomposition methods and practical implementation experience.<br> · Experience developing metaheuristics algorithms for combinatorial optimization problems.<br> · Strong programming skills and experience prototyping and developing software using standard programming languages (Java/C++).<br> · Knowledge of tools for big data analytics (e.g. SQL, Python, Perl, or Ruby).<br> · Project management experience working with tech and other cross-functional teams.<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}