{"job title": "Sr. Research Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon's Supply Chain Optimization &amp; Technology team (SCOT) is looking for a Research Scientist to optimize one of the most complex logistics systems in the world. Academic and/or practical background in Operations Research, Systems Engineering and Optimization, or Process Control are particularly relevant for this position. Experience in model-based engineering and/or multidisciplinary analysis &amp; optimization is also a plus.<br><br>Amazon’s extensive logistics system comprises thousands of fixed infrastructure nodes with millions of possible connections between them. Billions of packages flow through this network on a yearly basis, making the impact of optimal improvements truly unparalleled. This magnificent challenge is a terrific opportunity to understand, model, simulate, optimize, and reshape one of the world's most complex systems.<br><br>Your main focus will be on developing model-based optimization tools, at various levels of fidelity, for improving our transportation network. You will make the real complexity of our logistics system visible, tangible, and manageable using cutting edge analytical methods. You will use modeling and simulation to validate assumptions on the intricate interactions among different elements of our system. You will identify and evaluate opportunities to improve customer experience, network speed, cost, and the efficiency of capital investment. You will develop system components using optimization, simulation, and machine learning techniques. You will quantify the improvements resulting from the application of these tools and you will evaluate trade-offs between competing outputs of the system.<br><br>This position requires drive and self-motivation, superior analytical thinking, data-driven disposition, application of technical knowledge to a business context, effective collaboration with fellow research scientists, software development engineers, and product managers, effective communication of technical designs to technical and non-technical audiences, and close partnership with many stakeholders from operations, finance, IT, and business leadership.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n▪ PhD degree in Systems Engineering, Applied Mathematics, Operations Research or a related field, or a Master's degree and at least 6 years of relevant work experience<br><br>▪ Experience in designing analytic and/or algorithmic solutions to business or operational problems<br><br>▪ Experience implementing algorithms, tailored to particular business needs and tested on large data sets<br><br>▪ Exposure to scripting languages (Python, Ruby, etc.), SQL and Statistical tools, major object-oriented programming languages (java, C++, etc.), optimization software and libraries (XPRESS, CPLEX, etc.), and simulation software<br><br>▪ Excellent communication skills with both technical and non-technical audiences<br><br>▪ Ability to work independently and as part of a diverse team.<br><br>Amazon is an Equal Opportunity Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n▪ PhD in Multidisciplinary Design Optimization, Systems Optimization, Operations Research or related Engineering or Applied Sciences fields<br>▪ Previous work experience or demonstrated practical experience through industrial internships<br>▪ A proven record of innovation and driving critical research in Applied Optimization in industry, government, or military<br><br>▪ Experience developing intricate systems, including establishing target system results and operation tolerances, developing a system design, analyzing this design use in relation to the function of the elements in the system, developing system prototypes, and testing and validating the developed design to quantify its value<br><br>▪ Excellent interpersonal skills and a can-do never-give-up attitude<br><br>▪ Experience with scripting languages (Python, Ruby, etc.), SQL, object-oriented programming languages (java, C++, etc.), optimization software and libraries (XPRESS, CPLEX, Gurobi, SAS, R, etc.), and simulation software<br><br>▪ Exposure to relational databases and Linux\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}