{"job title": "Sr. Vision Research Scientist", "company": "Amazon", "city state": "– Westborough, MA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon Go Advanced Projects Group in Boston’s Metro-West<br> <br>Amazon is building an Advanced Projects Group in the Boston Metro-West area. Come join an ambitious project developing new technologies that go well beyond the current state of the art to address an enormous market that will impact the daily lives of tens of millions of people.<br> <br>We are looking for world-class scientists and engineers to explore new ideas, invent new approaches, and develop new solutions. <br> <br>If you have expertise in in Computer Vision, with a Ph.D. and 5+ years of industry or postdoctorate experience, or an MS and 7+ years of industry experience and have:<br><ul><li>the ability to think big and conceive of new ideas and novel solutions;</li><li>the insight to correctly identify those worth exploring;</li><li>the hands-on skills to quickly develop proofs-of-concept;</li><li>the rigor to conduct careful experimental evaluations;</li><li>the discipline to fast-fail when data refutes theory;</li><li>and the fortitude to continue exploring until your solution is found</li></ul>come join us invent the future and change the world.<br><br> <br>This job is not easy, but it’s exciting and a lot of fun. If it sounds like what you’re looking for, we want to talk with you.<br> <br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br><br><ul><li>MS or PhD required in computer vision, machine learning, or related discipline, 5-7+ years of professional experience</li><li><br></li><li>Depth and breadth in state-of-the-art computer vision and machine learning technologies</li><li><br></li><li>Strong record of patents and innovation or publications in top-tier peer-reviewed conferences or journals</li><li><br></li><li>Proven track record of innovation in creating novel algorithms and advancing the state of the art</li><li><br></li><li>Ability to develop practical solutions to complex problems</li><li><br></li><li>Strong communication and collaboration skills</li><li><br></li><li>Proficiency in C/C++, python, and/or matlab</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience optimizing for short term execution while planning for long term technical capabilities. Ability and willingness to multi-task and learn new technologies quickly.</li><li><br></li><li>Experience with designing and building large-scale systems in a multi-tiered, distributed environment (Service Oriented Architecture).</li><li><br></li><li>Understanding of Software Development Life Cycle (SDLC) and project planning/execution skills including estimating and scheduling.</li></ul><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}