{"job title": "Senior Data Engineer", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nDo you want to build a cutting-edge highly scalable data platform using AWS technologies? <br>We are looking for an experienced, self-driven, analytical, and strategic Sr. Data Engineer. In this role, you will be working in a large and complex data warehouse environment. You should be passionate about working with disparate datasets and be someone who loves to bring data together to answer business questions. You should have deep expertise in the creation and management of datasets and the proven ability to translate the data into meaningful insights through collaboration with analysts and Data Scientists. In this role, you will have ownership of end-to-end development of data engineering solutions to complex questions and you’ll play an integral role in strategic decision-making. <br><br>The right candidate will possess excellent business and communication skills, be able to work with business owners to develop and define key business questions, be able to work with external data vendors to onboard new datasets and integrate with internal datasets, and be able to collaborate to analyze data that will answer those questions. You should have a solid understanding of how to build efficient and scalable data infrastructure and data models, and the desire to learn and implement Elastic MapReduce (EMR)-based and NoSQL-based solutions where appropriate. <br><br>In this role, you will have the opportunity to display and develop your skills in the following areas:<br><ul><li>Design, implement, and support an analytical data infrastructure providing ad hoc access to large datasets and computing power</li><li>Managing AWS resources</li><li>Interface with other technology teams to extract, transform, and load data from a wide variety of data sources using SQL and AWS big data technologies</li><li>Explore and learn the latest AWS technologies to provide new capabilities and increase efficiency</li><li>Work with external data vendors to onboard data into existing infrastructure</li><li>Collaborate with Data Scientists to implement advanced analytics algorithms that exploit our rich data sets for statistical analysis, prediction, clustering and machine learning</li><li>Help continually improve ongoing reporting and analysis processes, simplifying self-service support for customers</li></ul><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor’s degree in Computer Science, MIS, related technical field, or equivalent work experience.</li><li>More than 6 or more years' of overall work experience in a related field, including 3 or more years in analytics, data engineering or arelated field</li><li>Proven experience in data modeling, ETL development, and data warehousing, or similar skills</li><li>Demonstrable skills and experience using SQL with large data sets</li><li>Experience with AWS technologies</li><li>Proven track record of successful communication of data infrastructure, data models, and data engineering solutions through written communication, including an ability to effectively communicate with both business and technical teams</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Graduate degree in computer science, business, mathematics, statistics, economics, or other quantitative field</li><li>7 or more years' of prior experience in a Data Engineer role with a technology company or financial institution</li><li>Both technically deep and business savvy enough to interface with all levels and disciplines within the organization</li><li>Demonstrated ability to coordinate projects across functional teams, including engineering, IT, product management, finance, and operations</li><li>Knowledge of Advanced SQL and scripting for automation (e.g. Python, Perl or Ruby)</li><li>Experience with reporting tools like Tableau, Excel or other BI packages</li><li>Familiarity with statistical models and data mining algorithms</li><li>Familiarity with Linux</li><li>Experience with Hadoop or other map/reduce \"big data\" systems and services</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}