{"job title": "Data Scientist - Alexa Language Technologies", "company": "Amazon", "city state": "– Sunnyvale, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced groundbreaking devices like Fire tablets, Fire TV, and Amazon Echo. What will you help us create?<br> <br> The Role:<br><br> We’re looking for a passionate, talented, and inventive Data Scientist to help build industry-leading intelligent Alexa-enabled products that customers love. Our mission is to leverage Data Science, in order to reduce users’ cognitive load, reduce friction in their day-to-day activities and ultimately, inspire our customers by enabling serendipitous discovery of experience. You will be responsible for data-driven improvements to our spoken language understanding models. You will be working with a unique and gifted team of engineers and scientists engaged in a fast-paced mission to conceive and deliver new products.<br><br> <br> Key Responsibilities<br> - Apply Statistical and Machine Learning methods to specific business problems and data <br> - Ensure data quality throughout all stages of acquisition and processing, including such areas as data sourcing/collection, ground truth generation, normalization, transformation, cross-lingual alignment/mapping, etc.<br> - Design, develop, evaluate, and release highly innovative models elevate the customer experience and track impact over time <br> - Collaborate with colleagues from multidisciplinary science, engineering and business backgrounds.<br> - Work with engineers to develop efficient data querying and modeling infrastructure for both offline and online use cases <br> - Manage your own process: identify and execute on high impact projects, triage external requests, and make sure you bring projects to conclusion in time for the results to be useful <br> - Communicate proposals and results in a clear manner backed by data and coupled with actionable conclusions to drive business decisions<br> <br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- Bachelor's degree in Math, Finance, Statistics, Engineering or related discipline <br> - Experience with Python, R, or other statistics/machine learning packages <br> - 3+ years experience as a business analyst, data scientist or similar job function<br>- 1+ years of relevant experience building statistical models and machine learning. <br> - Experience developing experimental and analytic plans for data modeling processes<br>- Experience using baselines to accurately determine cause and effect relations<br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n- Advanced degree in Math, Statistics, Engineering, Computer Science or related discipline<br> - Demonstrated ability to frame complex analytical problems and extract insights that led to tangible business results <br> - High-level knowledge of various machine learning techniques and key parameters that affect their performance<br> - Fluency in a foreign language<br> - The motivation to achieve results in a fast-paced environment. <br> - Strong attention to detail <br> - Exceptional level of organization <br> - Ability to think creatively and solve problems<br> <br> Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}