{"job title": "Data Scientist, AWS Directed Work", "company": "Amazon", "city state": "– Bellevue, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nCome and be part of the AWS Directed Work team and build systems that enable AWS to rapidly grow and continue to be the pioneer and widely recognized leader in Cloud Computing, and have direct and immediate impact on the hundreds of thousands developers and businesses around the world who use AWS every day. <br><br> Directed Work systems are at heart of ensuring that we can provide our customers with the right computing services, in the right region, at the right time! The AWS Directed Work team is responsible for building the systems that automate and orchestrate the physical work processes that occur inside all of AWS’ global datacenters. Our talented team of datacenter engineers depend on our systems to perform their work safely, securely, efficiently, and free of defects, resultant in finished products being ready for AWS customer-facing utilization. Our team is responsible for billions of dollars in capital and the ultimate success of our core cloud infrastructure business. <br><br> As AWS launches new offerings to our datacenters, the AWS Directed Work team is looking for a Data Scientist with strong analytical and communication skills to join our team. We develop sophisticated algorithms that involve learning from large amounts of data, such as hardware configurations, technician qualifications, location or other environmental factos, in order to analyze (and predict) defect and repair patterns. These analyses will be key inputs into establishing labor plans for thousands of employees, defining work assignment as well as building the basis for reporting tools for Sr. Leadership across AWS Operations. The work is complex and important to Amazon. With better analyses we drive down supply chain costs, enabling the offer of lower prices and better service availability for our customers.<br><br> Major responsibilities include: <br> <br><ul><li>Translating operational data into specific analytical questions that can be answered with available data using statistical and machine learning methods; working with engineers to produce the required data when it is not available</li><li>Providing feedback to our science and engineering teams on the applicability of technical solutions from the business perspective</li><li>Presenting critical data in a format that is immediately useful to answer questions about the inputs and outputs of Demand Forecasting systems and improving their performance</li><li>Communicating verbally and in writing to business customers with various levels of technical knowledge, educating them about our systems, as well as sharing insights and recommendations</li><li>Improving upon existing reporting and forecasting statistical or machine learning methodologies by developing new data sources, testing model enhancements, running computational experiments, and fine-tuning model parameters for new forecasting models</li><li>Supporting decision making by providing requirements to develop analytic capabilities, platforms, pipelines and metrics then using them to analyze trends and find root causes of forecast inaccuracy</li><li>Formalizing assumptions about how forecasts are expected to behave, creating definitions of outliers, developing methods to systematically identify these outliers, and explaining why they are reasonable or identifying fixes for them</li><li>Utilizing code (Python, R, Scala, etc.) for analyzing data and building statistical and machine learning models and algorithms</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>5+ years of industry experience in data science or related areas</li><li>Experience with R, Python, Weka, SAS, MATLAB or other statistical/machine learning software.</li><li>Experience applying various machine learning techniques, and understanding the key parameters that affect their performance.</li><li>Experience developing experimental and analytic plans for data modeling processes, use of strong baselines, and the ability to accurately determine cause and effect relationships.</li><li>Understanding of relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etc.</li><li>Ability to access, manage, transfer, integrate and analyze complex datasets, especially using SQL.</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor or Master's degree in highly quantitative field (CS, mathematics, statistics) or equivalent experience.</li><li>Ph.D. degree (preferred) in computer science, statistics, or comparable statistically driven sciences field</li><li>Experience with advanced ML models and concepts: HMMs, CRFs, MRFs, deep learning, regularization etc.</li><li>Experience with working on large data sets, especially with Hadoop and Spark</li><li>Experience with cloud computing platforms such as AWS</li><li>Experience with data visualization tools such as Tableau, D3.js</li><li>Meets/exceeds Amazon’s leadership principles requirements for this role</li><li>Meets/exceeds Amazon’s functional/technical depth and complexity for this role</li></ul><br><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation. <br><ul><li><br></li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}