{"job title": "Software Development Engineer - Big Data Technologies", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon’s eCommerce Foundation (eCF) organization is responsible for the core components that drive the Amazon website and customer experience. Serving millions of customer page views and orders per day, eCF builds for scale. As an organization within eCF, the Big Data Technologies (BDT) group is no exception. We collect petabytes of data from thousands of data sources inside and outside Amazon including the Amazon catalog system, inventory system, customer order system, page views on the website and Alexa systems. We also support Amazon subsidiaries such as IMDB and Audible. We provide interfaces for our internal customers to access and query the data hundreds of thousands of times per day, using Amazon Web Service’s (AWS) Redshift, Hive, Spark and Oracle. We build scalable solutions that grow with the Amazon business. <br><br>BDT is growing, and the data processing landscape is shifting. Our data is consumed by thousands of teams across Amazon including Research Scientists, Machine Learning Specialists, Business Analysts and Data Engineers. BDT team is building an enterprise-wide Big Data Marketplace leveraging AWS technologies. We enable teams at Amazon to produce analytical data in any form of storage (S3, DynamoDB, Aurora, etc.) and process that data using any type of compute environment such as EMR/Spark, Redshift, Athena, and others via a common bus. We are developing innovative products including the next-generation of data catalog, data discovery engine, data transformation platform, and more with state-of-the-art user experience. We’re looking for top engineers to build them from the ground up. <br><br>This is a hands-on position where you will do everything from designing and building extremely scalable components and cutting-edge features to formulating strategy and direction for Big Data at Amazon. You will also mentor junior engineers and work with the most sophisticated customers in the business to help them get the best results. You need to not only be a top software developer with excellent programming skills, an understanding of big data and parallelization, and a stellar record of delivery, but also excel at leadership and customer obsession and have a real passion for massive-scale computing. <br><br>Your responsibilities will include:<br>- Keeping your finger on the pulse of the constantly evolving and growing Big Data field<br>- Translation of complex functional and technical requirements into detailed architecture and design<br>- Delivering systems and features with top-notch quality, on time <br>- Stay current on technical knowledge to keep pace with rapidly changing technology, and work with the team in bringing new technologies on board<br><br>Come help us build for the future of Big Data! <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>BS degree or higher in Computer Science (or related program) and the ability to code in any of the following:</li><li>Java or C++, C#,Python or experience in programming with an Object Oriented language</li><li>Computer Science fundamentals</li><li>Software/System Design experience</li><li>3+ years of relevant work experience</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience taking a lead role in architecture, designing, and building complex software systems</li><li>Experience with ETL (Extract Transform Load), Data Warehousing systems, and Big Data technologies</li><li>Linux, UNIX, UNIX tools</li><li>Master's in Computer Science, Electrical Engineering or related field</li><li>Experience in communicating with customers, technical, business teams and management to collect requirements, describe product features, and technical designs.</li><li>Experience with large scale systems</li><li>Ability to excel in a fast-paced, startup-like environment</li><li>Experience working with AWS technologies like Dynamo DB, Redshift, S3.</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}