{"job title": "Applied Scientist - Selection Monitoring Team", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nSelection Monitoring team sits at the core of Amazon’s retail business, and our systems help Amazon stay ahead of the curve by providing the broadest set of products to satisfy our customers’ shopping needs. <br> We build platforms, systems and tools for the retail business, create and take advantage of datasets that contains billions of records, use the latest data processing technologies land machine learning techniques All aiming to keep Amazon’s catalog comprehensive and competitively priced in order to maintain our position as the most customer-obsessed and innovative company in the world. <br> <br><br>As an experienced machine learning scientist you will lead investigations and set the direction for the team by applying techniques from machine learning, information retrieval and data mining to solve some challenging problems using the data from the Amazon catalog and other big data systems. We work on classifying problems and determining potential of new brands and products in the Amazon platform using the billions of items that are available in the Amazon catalog. The data we handle is sparse and there are large number of features to explore. You will get opportunity to determine the selection that is carried by Amazon and to impact the bottom line of the retail business.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br><ul><li>Advanced degree in Machine Learning, Computer Science, Statistics, Applied Mathematics, Physics or in another highly quantitative field</li><li>3+ years of relevant experience</li><li>Proficiency in object oriented programming in Java, Python or Scala programming in a Unix environment.</li><li>Familiarity with Spark, MapReduce.</li></ul><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br><ul><li>Experience in a highly scalable, distributed environment preferred.</li><li>Results oriented person with a delivery focus.</li><li>Ability to handle multiple competing priorities in a fast-paced environment.</li></ul><br>Domain expertise in ONE OR MORE of the following fields: <br><br><ul><li>Big data and Distributed processing (Spark, MapReduce)</li><li>Information Retrieval</li><li>Data Mining</li><li>Machine Learning</li><li>Ranking and Forecasting</li></ul><br> Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}