{"job title": "Applied Scientist - Speaker Recognition", "company": "amazon.com", "city state": "– Santa Clara, California", "rating": "3.8", "job description": "SunIRef:it\n<br><br>\nApplied Scientist - Speaker Recognition - Santa Clara, CA - **********\n<br><br>\nFind Jobs\n<br>\nCompany Reviews\n<br>\nFind Salaries\n<br>\nFind Resumes\n<br>\nEmployers / Post Job\n<br>\nUpload your resume\n<br>\nSign in\n<br><br>\nHome\n<br><br>\nwhatjob title, keywords, or company\n<br><br>\nwherecity, state, or zip code\n<br><br>\nFind Jobs\n<br><br>\nAdvanced Job Search\n<br><br>\nApplied Scientist - Speaker Recognition\n\n\n<ul>\n<li>*********</li>\n</ul>\n\n28,620 reviews\n\n<li>Santa Clara, CA</li>\n\n\n<ul>\n<li>*********</li>\n</ul>\n\n28,620 reviews\n<br><br>\nRead what people are saying about working here.\n<br><br>\nDesired: Software DevelopmentNatural Language ProcessingDesign ExperiencePerlSASJavaRMATLABSPSSC/C++PythonMachine Learning\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nInterested in making Amazon Echo more intuitive? Help us make Alexa personalized to each of our customers. We're building the speech and language solutions behind Amazon Echo and other Amazon products and services. Come join us!\n<br><br>\nAlexa is the groundbreaking cloud-based intelligent agent that powers Echo and other devices designed around your voice. Our team is creating the science and technology behind Alexa. We're working hard, having fun, and making history. Come join our team! You will have an enormous opportunity to impact the customer experience, design, architecture, and implementation of a cutting edge product used every day by people you know.\n<br><br>\nWe're looking for a passionate, talented, and inventive Senior Scientist to help build industry-leading intelligent offerings that customers love. Our mission is to apply Artificial Intelligence (AI) and Machine Learning (ML), in order to reduce users cognitive load, reduce friction in their day-to-day activities and finally, inspire our customers by enabling serendipitous discovery of experience.\n<br><br>\nYou will leverage Amazon's heterogeneous data sources and large-scale computing resources to accelerate advances in artificial intelligence. You will mentor junior scientists, and work in a fast paced team environment. Your work will directly impact our customers in the form of novel products and services that make use of speech and language technology.\n<br><br>\nBasic Qualifications\n<br><br>\nGraduate degree (PhD) in Electrical Engineering, Computer Sciences, or Mathematics or Masters Degree with 5 years of related work experience\n<br>\nExperience with standard speech and machine learning techniques, scientific thinking, and the ability to invent\n<br>\nProgramming experience in languages such as C/C++, Java, Perl or Python.\n<br><br>\nPreferred Qualifications\n<br><br>\nExperience with data modeling and analytics for industrial applications\n<br>\nWorking knowledge of a major programming language like Java, C/C++, Python and statistical modeling tools such as R, MATLAB, SAS or SPSS\n<br>\nProven ability and good intuition for finding meaningful and non-trivial patterns in large datasets\n<br>\nAbility to communicate complex technical concepts and solutions to all levels of the organization\n<br>\nDesire, ability and experience mentoring engineers and managers on data modeling concepts\n<br>\nPh.D. in Machine Learning, Operational Research, or Statistics\n<br>\nWrite very high quality code that is robust and easy to maintain\n<br>\nStrong knowledge of data structures, algorithms, OS and distributed systems\n<br>\nUnderstanding of system performance and scaling\n<br>\nStrong communication and data presentation skills\n<br>\nDistributed programming experience\n<br>\nPhD with specialization in speech recognition, natural language processing, or machine learning\n<br>\nStrong publication record\n<br>\nStrong software development skills Amazon is an Equal Opportunity Employer - Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation\n\n\n<ul>\n<li>********* - 2 hours ago - report job - original job</li>\n</ul>\n\nOn Company Site\n<br><br>\nSave this job"}