{"job title": "Applied Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon is forming a new science team within Selection Monitoring, the organization that ensures that Amazon is the Everything Store and always has the latest and greatest in product selection.<br><br>We’re passionate about building insights from the universe of products available across the world, and understanding what our customers desire. We delight in data, and enrich our datasets with the insights we capture to ensure our customers always find what they are looking for.<br><br>We’re seeking an experienced data scientist with a track record of building and implementing statistical or machine learning algorithms in production, to build tools and perform in-depth analyses to support strategic and tactical decision-making.<br><br>About You:<br>You develop strong working relationships with others and want to work in a collaborative team environment. You think deeply about the best way to solve a problem and root out important details that most people would ignore. You’re resourceful, and self-motivated, and have no problem working independently to dig up and crunch data to solve a problem. You’re a skilled communicator who can express complex concepts and ideas in a simple manner.<br><br>About Us Together:<br>We’ll be the go to team to build insights from global product selection and associated customer behavior to identify business opportunities and challenges. We’ll use data, build tools, and run experiments to understand what products our customers desire. We’ll advocate for making sound decisions inside and outside our organization, and develop a reputation for producing insights our organization can stand behind. We're going to argue about how to solve challenging problems, and we'll work together to find a solution that is superior to each of the proposals we came in with. We'll make tough decisions, but we'll all understand why.<br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nBasic Qualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<b>Basic Qualifications</b><br>- Here are some things that we'd prefer to see, though none is independently a requirement:<br>- A strong engineer with a passion for data analysis<br>- Sharp analytical abilities, proven design skills, excellent communication skills<br>- Strong sense of ownership, urgency, and drive, and a track record of delivery<br>- Proven ability to take a project from an idea to a launched product<br>- Solid coding practices including good design documentation, unit testing, peer code reviews, and a preference for agile methods<br>- Experience mentoring and training others on complex technical issues<br>- Passion for building new products in a fast paced, team-oriented environment<br>- Master’s Degree in Computer Science or related field<br>- Fluent in a modern programming language such as Java, C, C++, or Scala<br>- Experience with distributed data processing platforms such as Spark, MapReduce, and high-level query languages such as Hive, or Pig<br>- 5+ years of industry experience or academic research\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nPreferred Qualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<b>Preferred Qualifications</b><br>- Experience performing data analysis on large data sets<br>- Experience building tools that perform large scale data analysis<br>- Strong skills in a scripting language such as Python, Perl, or R<br>- Masters and/or PhD in Computer Science, Math, Machine Learning, Applied Machine Learning, Deep Learning, Statistics, Applied Statistics, Computational Statistics, Computational Physics, - Computational Biology, Scientific Computing, or related field\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}