{"job title": "Sr Data Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon S3 sets the standard for functionality, cost, and performance for storage in the cloud. With trillions of objects under management, we’re one of the most successful services anywhere. But, we’re not resting on our laurels… it’s still the early days for cloud computing, and there are boundless opportunities to continue to redefine the world of storage. We are currently looking for a Data Scientist with a passion for driving customer focused results. As the lead Data Scientist for the S3 Product Management team you think big while dealing with ambiguity to deliver innovative approaches on how to apply data science to business decisions and product development. This job requires the ability to think big, dive deep into data, listen carefully, create recommendations, and communicate clearly and persuasively. <br> How to tell if you’ll love this role: You are passionate about the space, believing that great storage changes the world. You are a data scientist, eager to drive business impact. You are inspired by cloud products and want to leverage your data scientist skills to drive new products and features. You thrive on the day-to-day collaboration with engineers and product managers, reaching across team boundaries to make the right things happen. And, finally, with your strong ownership bias, you have an infectious desire to continually improve how things are done.<br> <br> Specifically you will be responsible for:<br> · Validate hypotheses around storage pricing, customer usage trends, customer workload characteristics and product offerings<br> · Implement statistical methods to solve specific business problems around pricing, costing and usage trends<br> · Perform statistical/quantitative analyses on and ensure cleanliness of large complex data sets<br> · Build customer-facing reporting tools to provide insights and metrics which track customer behavior engagement<br> · Collaborate with software developers, product managers and business leaders to define product requirements, provide analytical support, and communicate feedback<br> · Develop models by using high-level modeling languages such as R or in software languages such as Python.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor Degree in Data Science, Analytics, Computer Science Eng., Systems Eng., Statistics, or related field</li><li>Experience applying various machine learning techniques, and understanding the key parameters that affect their performance</li><li>Experience working with large data sets</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Master Degree or PHD in Data Science, Analytics, Computer Science</li><li>Experience working with data visualization tools and creating data visualization concepts (e.g. QuickSight, Tableau)</li><li>Experience working with AWS RedShift or other distributed computing technologies</li><li>Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations</li><li>Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li><li>Excellent verbal and written communication skills with the ability to effectively advocate technical solutions to engineering teams and business audiences</li><li>5+ years of experience with statistical analysis techniques including linear regression/least squares, experimental design, hypothesis design, confidence intervals, t-test etc</li><li>5+ years of experience in working as a data scientist working with cross functional teams to solve complex problems</li><li>5+ years of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), statistical/mathematical software (e.g. R, Weka, SAS, Matlab), Excel, data visualization software such as Tableau</li></ul><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}