{"job title": "Data Scientist, Customer Interests &amp; Personalization", "company": "Amazon", "city state": "– Santa Clara, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nTo truly become the worlds most customer centric company, we must understand our customers better than anyone.<br> <br>Alexa HHO growth team is hiring a Data Scientist to help us grow existing and identify new programs dedicated to building more engaging experiences. We are looking for an analytical and technically skilled data scientist who can help evolve the way we look at these programs. <br> <br> As a Data Scientist, it will be your role to identify existing customer segments and analyze customer behavior to identify opportunities for improved personalization on the Amazon retail website. With over 200MM customers browsing, buying, and wishing for Amazon products--you will identify clusters of customer behavior and identify keystone segments (interests, life stages, hobbies, etc.) which can act as pivot points for personalization. <br> <br> Your job doesn't stop there--you will analyze and compare existing personalization to segmented personalization, scope opportunities, conduct experiments, confirm the viability of segments, and extract insights with real customer data. To do this, you will analyze large amounts of data, discover and solve real world problems, build metrics and business cases around key projects and, most of all, be an integral part of creating a better customer experience.<br> <br> The Alexa HHO growth team is looking for a talented Data Scientist to help manage our ever-growing information needs and lead the analysis of increasingly complex business questions. At Amazon you will be working in one of the world's largest and most complex data environments. The Data Scientist occupies a unique role at the intersection of technology, marketing, finance, statistics, data mining, and social science. <br> <br> As a Business Intelligence Engineer (BIE) with SSX, you will work with our new and dedicated team to define strategic analytical requirements and lead the design and implementation of technologies that result in simple and powerful customer experiences. This key player will be responsible for solving important business problems through deep data mining, statistical analyses, implementation of designed experiments, machine learning and creation of mathematical models.<br> <br> The successful candidate will be expert with advanced statistical techniques and have exemplary communication skills. The candidate will need to demonstrate a penchant for execution and completion; driving projects to a solution quickly and accurately. The candidate should have reasonable programming and design skills to manipulate unstructured and big data, build prototypes that work on massive datasets or even components that work within production systems. The candidate should be able to apply business knowledge to do broad data analysis as a precursor to modeling and to provide valuable business intelligence.<br> · Work with various stakeholders, including leaders across the Amazon’s retail business, to understand business drivers, goals and actionable outcomes of large scale customer behavior analysis.<br> · Gather data and perform sophisticated analytical exercises.<br> · Work with SSX leadership to present key findings from analyses to stakeholders.<br> · Drive business decision-making based on analytical findings.<br> · Employ data mining, clustering, machine learning, model building, segmentation, and other analytical techniques to capture important trends in the customer base.<br> · Participate in strategic and tactical planning discussions.<br> · Master the vast range of Amazon’s data resources and know how, when, and which to use.<br> · Deep dive into massive data sets to answer key business questions using Oracle SQL, Stata, R, MS Excel, and/or other data management tools.<br> <br><br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· 5+ years of professional experience in data science, business analytics, business intelligence (BI) or comparable analyst position handling large, complex human data sets.<br> · BA, BS or higher degree in Economics, Mathematics, Statistics, Computer Science, Finance, or related data centric field.<br> · Experience in SQL, SAS/R, Excel, and similar statistical packages to access and transform data into insights.<br> · Experience with Unix/Linux environment with experience in a scripting language for managing large data sets.<br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Ability to quickly adapt to changing priorities and generate innovative solutions in an extremely fast-paced environment.<br>· Experience with clustering and machine learning algorithms<br> · Demonstrated ability to frame complex analytical problems, pull data, and extract insights that led to tangible results (revenue, seller launches, new product features, etc.).<br> · Strong problem solving, programming skills and computer science fundamentals<br> · Outstanding speaking, writing, and presentation skills, as well as the ability to persuade, inspire, and motivate others. Summarize key insights for technical and non-technical audiences.<br> · Experience communicating with senior management (VP level decision-makers) as well as with colleagues from computer science, machine learning and business backgrounds.<br> · MBA or Masters degree in an analytic field is desired.<br> · Can separate the data signal from noise.<br> · Passion to get the right stuff done.<br><br><br>Amazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation<br><br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}