{"job title": "Data Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nThe Buying team is part of Amazon’s Supply Chain Optimization Technology / Inventory Planning and Control organization, and is responsible for deciding how much inventory to carry of every single item offered by Amazon Retail on all of Amazon’s websites worldwide. Consuming inputs including demand forecasts, placement options, and vendor capability data, our buying system automatically computes the optimal inventory levels and re-order quantities for every single item in our Retail catalog every single day. As a Data Scientist in Buying, you will operate at the apex of multiple advanced Amazon systems, getting global visibility of how Amazon functions and serves our customers. Your curious mind will enable the creation of products that drive ever-greater automation, scalability and optimization of every aspect of buying, removing cost and delivering speed of execution to thrill our customers. The impact of your work will be global, material and remarkable. <br><br> Data Scientist Responsibilities <br> As a successful Data Scientist in Buying, you need to be voraciously curious about Amazon’s supply chain operations and how data consumed and produced by our systems can be used to improve outcomes and lower costs. Your responsibility is to expose and measure the current performance of our Buying system, find and quantify opportunities for improvement, and dive deep into existing algorithms to explain unexpected performance or measure causal relationships. You will collaborate with engineering, research, and business teams for future innovation. You need to be a sophisticated user of data querying tools and advanced quantitative and modeling techniques, and an expert at synthesizing and communicating insights and recommendations to audiences of varying levels of technical sophistication. <br> Major responsibilities include:<br> · Translate / Interpret: <br> Translate business questions and concerns into specific quantitative questions that can be answered with available data using sound methodologies. In cases where questions cannot be answered with available data, work with engineers to produce the required data.<br> · Measure / Quantify / Expand<br><br> a. Retrieve, synthesize, and present critical data in a format that is immediately useful to answering specific questions or improving system performance.<br> b. Analyze historical data to identify trends and support decision making.<br> c. Apply statistical or machine learning knowledge to specific business problems and data.<br> d. Improve upon existing methodologies by developing new data sources, testing model enhancements, and fine-tuning model parameters.<br> e. Provide requirements to develop analytic capabilities, platforms, and pipelines.<br> · Explore / Enlighten<br> a. Formalize assumptions about how Buying systems are expected to work, create statistical definitions of outliers, and develop methods to systematically identify these outliers. Work out why such examples are outliers and define if any actions are needed.<br> b. Given anecdotes about anomalies, design strategies to quantify the overall impact of such anomalies, deep dive to explain why they happen, and identify fixes. <br> · Make Decisions or Recommendations <br> a. Build decision-making models and propose solutions for business problems.<br> b. Conduct written and verbal presentations to share insights and recommendations to audiences of varying levels of technical sophistication.<br><br> Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br> <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Master’s degree in Statistics, Applied Mathematics, Operations Research, Economics or a related quantitative field.<br><br> · At least 3 years of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, Weka, SAS, Matlab).<br><br> · At least 3 years of experience articulating business questions and using quantitative techniques to arrive at a solution using available data.<br> <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Depth and breadth in quantitative knowledge. Excellent quantitative modeling, statistical analysis skills and problem-solving skills. Sophisticated user of statistical methods and tools.<br><br> · Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment<br><br> · Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations<br><br> · Experience processing, filtering, and presenting large quantities (Millions to Billions of rows) of data<br><br> · Depth of knowledge in machine learning algorithms<br><br> · Excellent verbal and written communication skills with the ability to effectively advocate technical solutions to research scientists, engineering teams and business audiences<br><br> · Experience in supply chain is a plus<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}