{"job title": "Applied Scientist, Prime Air", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nWe’re working on the future. If you are seeking an iterative fast-paced environment where you can drive innovation, apply state-of-the-art technologies to solve extreme-scale real world challenges, and provide visible benefit to end-users, this is your opportunity. <br> Come work on the Amazon Prime Air team! <br> <br> We're looking for an outstanding applied scientist who combines superb technical, research and analytical capabilities with a demonstrated ability to get the right things done quickly and effectively. This person must be comfortable working with a team of top-notch applied scientists. We’re looking for people who innovate and love solving hard problems. You will work hard, have fun, and of course, make history!<br> <br> Export Control License: This position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Graduate degree in Computer Science, EE, signal processing or related field or equivalent 5+ years of experience</li><li>Expert knowledge of computer vision or sensor signal processing</li><li>Experience applying machine learning to practical problems</li><li>Experience working with data captured from sensors and associated signal processing</li><li>Experience with hardware/software integration and real-time systems.</li><li>Strong coding skills in, at least, one modern programming language such as C++ or Python</li><li>Strong verbal and written communication skills.</li><li>Excellent problem-solving ability</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience building complex software/hardware mission-critical systems that have been successfully delivered to customers at scale</li><li>Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing and livesite operations</li><li>Experience communicating with various teams to collect requirements, describe product features and technical designs</li></ul><br> Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}