{"job title": "Applied Scientist II", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\n<br>Latest data from Business Insider shows that almost 50% of online shoppers visit Amazon first. Our team is responsible for creating a vision for the next generation Amazon shopping experience and delivering it to millions of customers. We believe that shopping on Amazon should be simple, delightful, and full of WOW moments for EVERYONE, whether you are technically savvy or new to online shopping. We are seeking great thought leaders who think big and want to help define the future of online shopping.<br><br>As a Applied Scientist, you will be driving Search's reinforcement learning program to create an adaptive and engaging customer experience. You will be working closely with a team of applied scientists and engineers to develop accurate customer intent understanding using machine learning techniques and build systems that become more and more intelligent over tim* PhD in Computer Science or a related discipline<br>* 5+ years hands-on experience with using multi-armed bandits, multivariate testing, and other reinforcement learning techniques<br>* Strong publication track record <br>* Demonstrated track record of project delivery for large, cross-functional, cross-organizational projects that are customer facing<br>e. You shape the future of Amazon's shopping experience by automatically generating relevant content and building a whole page experience that is coherent, dynamic, and interesting. <br><br>A successful candidate will have a strong research background in reinforcement learning algorithms, customer obsession, a proven track record of working closely with engineering teams to build scalable and extensible optimization systems, a strong interest in mentoring and developing other scientists, great communication skills, and the motivation to achieve results in a fast-paced environment.<br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n* MS in Computer Science or a related discipline<br>* 2+ years hands-on experience with using machine learning techniques to solve real world problems<br>* Demonstrated track record of project delivery for large, cross-functional, cross-organizational projects that are customer facing<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br>* PhD in Computer Science or a related discipline<br>* 4+ years hands-on experience with using multi-armed bandits, multivariate testing, and other reinforcement learning techniques<br>* Experience influencing leadership decisions through presentation of complex technical information, verbally and in writing<br>* Strong engineering skills and familiarity with AWS ML technologies<br><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}