{"job title": "Senior Data Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nHow often have you had an opportunity to be a founding member of a team solving significant customer problems through innovative technology? Our emerging technologies team, within Amazon’s Device organization (Amazon Echo, Fire TV, Fire Tablets, and more), is looking for passionate, hard-working, and talented individuals to join our fast paced, start-up environment to help invent the future. We solve significant customer problems in the consumer electronics space through devices, mobile applications, cloud services (AWS), computer vision, and machine learning.<br>As a Senior Data Scientist, you will perform statistical analysis and draw insights from large sparse data sets in an interesting new space. You will be asked to build predictive data models to inform algorithm development, data collection activities, data coding, and product decisions. These insights can also be delivered through white papers and visualization tools that reinforce your analytical findings. <br>You are an individual with outstanding analytical abilities and comfortable working with cross-functional teams and systems. You must be a self-starter and be able to learn on the go. Excellent written and verbal communication skills are required as you will work very closely with diverse teams.<br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Masters Degree or PhD in an engineering or technical field.</li><li>10+ years of industry experience building statistical, predictive and optimization models.</li><li>Industry experience with at least one of the following high-level modeling languages: R, SAS, Matlab.</li><li>Industry experience with at least one of the following fields: machine learning, operations research, data science research.</li><li>Experience in modern scripting and database languages such as Python and SQL.</li><li>Experience developing experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations.</li><li>Experience with relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etc.</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Degree preferably in Machine Learning, Data Science, Applied Mathematics or related field.</li><li>Demonstrated ability to have worked across teams to drive data-driven recommendations.</li><li>Ability to distill problem definitions, models, and constraints from informal business requirements; and to deal with ambiguity and competing objectives.</li><li>Ability to convey rigorous mathematical concepts and considerations to non-experts.</li><li>Experience designing and supporting large-scale distributed systems in a production environment.</li><li>Natural curiosity and desire to learn.</li><li>People and project management experience.</li><li>Experience partnering with business owners directly to understand their requirements and provide data which can help them observe patterns and spot anomalies.</li></ul><br>Amazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}