{"job title": "Data Scientist Intern", "company": "amazon.com", "city state": "– Seattle, Washington", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\nWe are seeking a Data Scientist with machine learning, analytical, communication, and project management skills to join our team. As part of multi-skilled team engineering teams, and with product owners, you will help identify and solve complex prediction problems to improve inbound supply chain systems modelling supplier behavior so we can offer products to our customers with confidence we will deliver on time. Also, you will develop metrics and reports to measure our impact on Amazon's business. In a typical day, you will work closely with retail leads, product managers, engineers, and various business groups.\n<br><br>\nYou are an individual with outstanding analytical and machine learning modelling abilities, excellent communication skills, good business understanding, and technically savvy. The successful candidate will be an analytical problem solver who enjoys diving into data, is excited about investigations and algorithms, can multi-task, and can credibly interface between technical teams and business stakeholders.\n<br><br>\n<strong>Responsibilities Include:</strong>\n<br>\nCollaborating with colleagues from multidisciplinary science, engineering, and business backgrounds, to identify and reduce gaps in current inventory availability.\n<br>\nBuild statistical, predictive and machine learning models to drive sourcing accuracy.\n<br>\nEnsure data quality throughout all stages of acquisition and processing, including data sourcing/collection, ground truth generation, normalization, and transformation.\n<br>\nPromote data-driven decision making across the team, using tools such as Tableau, SQL, and Excel.\n<br>\nInfluence leaders to make thoughtful data decisions to provide the most consistent and usable data for all teams across the company.\n<br>\nCombine expert knowledge of statistical methodology and analysis with advanced programming skills to support complex analyzes.\n<br>\n/develop best practices with other Amazon teams on a global scale.\n<br>\nBuild metrics, reports and dashboard to analyze key inputs to internal systems\n<br>\nBasic Qualifications\n<br>\nIn process of receiving a graduate degree in an analytical area such as Machine learning, Computer Science, Physics, Mathematics, Statistics, Engineering or similar.\n<br>\nExperience in Analytics or other quantitative disciplines.\n<br>\nExperience with modeling and analysis including machine learning, statistical analysis, operations research and management science and data mining.\n<br>\nStrong interpersonal and communication skills. Must be able to explain technical concepts and analyses implications clearly to a wide audience, and be able to translate business objectives into actionable analyses.\n<br>\nExperience with SQL (any variations thereof), Python/PySpark and/or Scala preferred; though experience with other analytics software (SAS, STATA, MATLAB, Mathematica, R/SparklyR) is acceptable.\n<br>\nFamiliarity with AWS solutions such as Glue, S3, and Redshift.\n<br>\nProven analytical and quantitative skills to use hard data and metrics to back up assumptions, develop business cases, and complete root cause analyses.\n<br>\nCapable of taking responsibility for an initiative and working with minimal direction; self-starter even when assignments are vague or undefined.\n<br>\nCreative in finding new solutions/designing innovative methods, systems, and processes.\n<br>\nPreferred Qualifications\n<br>\nIn process of receiving a PhD in a quantitative field such as Mathematics, Statistics, Analytics or Economics.\n<br>\nKnowledge and experience with Agile development practices.\n<br>\nExperience in Demand Planning &amp; Forecasting, Supply Chain or Inventory Management is a plus.\n<br>\nDemonstrated ability to manage multiple competing priorities simultaneously and drive projects to completion.\n<br>\nExcellent written / oral communication and interpersonal skills."}