{"job title": "Analytics Data Engineer", "company": "Amazon", "city state": "– Detroit, MI", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nThe Marketplace Tech Platform team is looking for a talented Analytics Engineer to help build/enhance the platforms that manage Amazon's Global Marketplace business. You will play a key role in driving business insights about our businesses and how they interact. You will transform data into actionable information and make it readily accessible to worldwide stakeholders.<br><br>As an Amazon Data Engineer you will be working with one of the world's largest and most complex data processing environments. You will need expertise in the design, creation, management, and business use of extremely large (100TB+) datasets. You must have excellent business and communication skills to be able to work with business owners to develop and define key business questions, and to build data sets that answer those questions. You must be able to work with business customers in understanding the business requirements and implementing reporting solutions. Above all you should be passionate about working with huge data sets to answer challenging, business changing questions as a global scale.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor's degree in computer science, engineering, mathematics, or a related technical discipline</li><li>3+ years of industry experience in data engineering, business intelligence, data science, or related field with a track record of manipulating, processing, and extracting value from large datasets</li><li>3+ years in using OLAP technologies and BI Analytics.</li><li>Demonstrated strength in data modeling, ETL development, and data warehousing</li><li>Experience using business intelligence reporting tools (Tableau, Business Objects, Cognos etc.)</li><li>Knowledge of data management fundamentals and data storage principles</li><li>Knowledge of distributed systems as it pertains to data storage and computing</li><li>Proficient in one scripting languages (e.g., Python)</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience writing machine learning algorithms</li><li>Experience using big data technologies (Hadoop, Hive, Hbase, Spark etc.)</li><li>Experience working with AWS big data technologies (Redshift, S3, EMR)</li><li>Familiarity with statistical models and data mining algorithms</li><li>Proven success in communicating with users, other technical teams, and senior management to collect requirements, describe data modeling decisions and data engineering strategy</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}