{"job title": "Data Scientist AWS Cloud Compute", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\n<br>Amazon is looking for an outstanding Data Scientist to join the AWS Product BI team. This is your opportunity to be a core part of the team that has direct impact on the day-to-day decision making in the EC2 team. Today, Amazon EC2 enables customers of all sizes to run their applications on our industry leading cloud infrastructure. Amazon EC2 redefines the economics and physics of computing, reducing the time to build a datacenter to minutes. Customers around the world use Amazon EC2 to rapidly scale capacity up and down as their computing requirements change. But there are many additional services and offerings that will make Amazon EC2 an even better customer experience and platform for our customers. We are changing the way people use computers and the EC2 team is at the core of pushing the future of our technology platform - come help us make history!<br> <br> As a Data Scientist on this team, you will get the exciting opportunity to work on many and varied complex data problems. You will work closely with the business and technical teams in analysis on many non-standard and unique business problems and use creative-problem solving to deliver actionable output. A successful candidate will be a self-starter, comfortable with ambiguity, with strong attention to detail, an ability to work in a fast-paced and ever-changing environment, and an ability to work effectively with cross-functional teams. <br><br>An ideal candidate will be able to solve complex problems using data science principles that are highly accurate, stable, secure, scalable, and cost-effective. You will have hands-on experience leading and/or working on multiple simultaneous data science initiatives as well as be able to balance technical with business judgment to make the right decisions about technology, models and methodologies choices. You will strive for simplicity, and demonstrate significant creativity and high judgment backed by statistical proof. As a Data Scientist, you will be responsible for developing KPIs, programs, reporting, visualizations, tests and research in order to drive business solutions using computational techniques, and statistics to support strategic and tactical decision-making. The ideal candidate will have significant experience performing large-scale data analysis and reporting and will be responsible for developing, improving and simplifying our models. You will have the opportunity to leverage extensive datasets and provide meaningful insights to improve the customer experience as well as optimize business decisions for Amazon.<br><br>Key responsibilities include:<br>- Work with business customers in understanding the business requirements and implementing solutions to support analytical and reporting needs.<br>- Design and implement data science solutions enabling stakeholders to manage the business and make effective decisions.<br>- Use a range of data science methodologies to conduct analysis for cases when the solution approach is unclear. <br>- Use breadth of experience in the practical application of data science techniques and tools to solve difficult business problems. <br>- Conduct ad hoc data analysis and data quality investigations.<br><br><br><br><br><br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nBasic Qualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br><b>Basic Qualifications</b><br>- Statistics, Business Analytics, Applied Mathematics, Operation Research, Economics or a related quantitative Masters degree or a Bachelors degree with at least 3 years of work experience in these areas.<br>- At least one year of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, Weka, SAS, Matlab)<br>- Experience articulating business questions and using quantitative techniques to arrive at a solution using available data<br>- Knowledge of various machine learning techniques and key parameters that affect their performance<br>- Ability to understand the business problem, come up with a statistical or ML solution to the problem and communicate the result back to non-technical users<br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nPreferred Qualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<b>Preferred Qualifications</b><br>- PhD in Statistics, Business Analytics, Applied Mathematics, Operation Research, Economics, or related field<br>- Excellent quantitative modeling, statistical analysis skills and problem-solving skills. Sophisticated user of statistical tools.<br>- Experience processing, filtering, and presenting large quantities (Millions to Billions of rows) of data<br>- Combination of deep technical skills and business skills to interface with all levels and disciplines within our customer’s organization<br>- Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment<br>- Excellent verbal and written communication skills with the ability to effectively advocate technical solutions to research scientists, engineering teams and business audiences<br>- Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations<br>- Experience in machine learning techniques related to clustering, classification and forecasting is a plus<br>- Experience with Hadoop, Spark or EMR is a huge plus.<br>- Proven ability to meet tight deadlines, multi-task, and prioritize workload<br> - A work ethic based on a strong desire to exceed expectations.<br> - Strong analytical skills<br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}