{"job title": "Data Scientist II", "company": "Amazon", "city state": "– BOSTON, MA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nMachine learning (ML) has been strategic to Amazon from the early years. We are pioneers in areas such as recommendation engines, product search, eCommerce fraud detection, and large-scale optimization of fulfillment center operations. <br><br>The ML team within AWS provides opportunities to innovate in a fast-paced organization that contributes to game-changing projects and technologies that get deployed on devices and the cloud. As an ML solutions architect/data scientist in the AWS-ML team, you'll partner with technology and business teams to build new services that surprise and delight our customers. You will be working with terabytes of text, images, and other types of data to solve real-world problems. You'll design and run experiments, research new algorithms, and find new ways of optimizing risk, profitability, and customer experience. <br><br>We’re looking for top ML solutions architects/data scientists capable of using ML and other techniques to design, evangelize, and implement state-of-the-art solutions for never-before-solved problems. <br><br>The primary responsibilities of this role are to:<br><ul><li>Use deep learning, machine learning and analytical techniques to create scalable solutions for business problems</li><li>Design, development and evaluation of highly innovative models for predictive learning, content ranking, and anomaly detection</li><li>Interact with customer directly to understand the business problem, help and aid them in implementation of DL/ML algorithms to solve problems</li><li>Analyze and extract relevant information from large amounts of historical data to help automate and optimize key processes</li><li>Work closely with account team, research scientist teams and product engineering teams to drive model implementations and new algorithms</li></ul><br>This position requires travel of up to 50%, and can be located in Austin, Chicago, New York, Boston, Palo Alto/Bay Area, or Seattle. <br> <br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>BS and Masters degrees in computer science, or related technical, math, or scientific field</li><li>2+ years of professional experience in a business environment</li><li>1+ years of relevant experience in building large scale machine learning systems</li><li>1+ years of experience specifically with deep learning (e.g., CNN, RNN, LSTM)</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>PhD degree in computer science, or related technical, math, or scientific field</li><li>Strong working knowledge of deep learning, machine learning and statistics.</li><li>Hands on experience building models with deep learning frameworks like MXNet, Tensorflow, Caffe, Torch, Theano or similar.</li><li>Experience in using Python, R or Matlab or other statistical/machine learning software</li><li>Strong communication and data presentation skills</li><li>The motivation to achieve results in a fast-paced environment.</li><li>Experience with statistical modelling / machine learning</li><li>Strong attention to detail</li><li>Comfortable working in a fast paced, highly collaborative, dynamic work environment<br></li><li>Ability to think creatively and solve problems</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}