{"job title": "Sr. Manager, Data Science - Selling Partner Paid Services", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you interested in innovating to deliver a world-class level of service to Amazon’s selling partners? The Selling Partner Paid Services team includes Amazon Marketplace Professional Services (AMPS) and Amazon Vendor Services (AVS), programs which seek to improve the customer experience on Amazon.com by working directly with sellers and vendors to improve value, selection and convenience across their business. A new and growing team, our team invents and innovates across technology, processes and people to grow the program, grow our Selling partners’ businesses, improve Selling Partner acquisition, retention, engagement and satisfaction and enable scalable global solutions. <br> <br> The Paid Services team is looking for a self-driven, experienced and passionate data and analytics leader who will work closely with business and tech stakeholders to design and build reporting and analytics, including statistical and machine learning models, to answer complex business questions that provide insights to influence customer behavior. The ideal candidate is able to not just hold their team to a high standard of data quality and excellence in the work delivered but also to surprise and delight stakeholders and take the business to the next level by uncovering insights and proposed actions through analytics.<br> <br> The role’s key responsibilities will include:<br> · Strong leadership and vision for how to drive the team to create changes in business partnerships, analytics, and metrics/reporting<br> · End to end ownership of the data and analytics workstream, including gathering inputs from leadership and partner teams, roadmap planning and prioritization and promoting best practices<br> · Influence senior leadership and other data &amp; analytics teams.<br> · Lead and develop a team of BIEs, DEs, BAs and Data Scientists, showing the ability to hire, mentor and develop a high-performing team.<br> · Drive deep understanding of Selling Partner segmentation, behavior and satisfaction, Amazon operational performance and impact on Amazon customer experience by identifying, developing, and executing analyses, machine learning capabilities and models<br> · Navigate ambiguity; identify and tackle strategic opportunities and problems we don’t even know exist or have not fully defined through data.<br> · Develop a long term analytical strategy and self-service reporting capabilities and drive the implementation and adoption of that strategy<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· MS + 8 yrs experience or BS + 11 yrs experience<br> · 2+ years of experience leading and/or directing a data and analytics team.<br> · Experience with enterprise class data warehousing from disparate source systems using industry standard data warehouse solutions (e.g. Redshift, Oracle, SQL Server, Hadoop-based systems)<br> · Experience with relevant technologies/tools/processes such as ETL, BI Applications, Big Data, Web Analytics, CRM systems.<br> · Experience using SQL, ETL, and databases in a business environment with large-scale, complex datasets. <br> Proficient in code-based analysis/modeling using Python, R, or domain specific software.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Knowledge of cloud computing and AWS services<br> · Experience with data visualization software such as Tableau or Quicksight.<br> · Experience in machine learning (decision trees, multivariate and logistic regression, kNN, kMeans, etc.).<br> · Proven ability to translate business problems effectively into analytical specifications and requirements<br> · Demonstrated thought-leadership with a passion for translating data into action and business insights.<br> · Demonstrated ability to earn trust of senior leadership and business stakeholders through collaboration and attention to detail.<br> · Demonstrated ability and willingness to operate autonomously, roll up sleeves and execute to get the job done <br> · Ability to navigate ambiguity.<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}