{"job title": "Senior Research Scientist", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAt Amazon we continually look for opportunities to invent on behalf of our customers, helping them to find and discover virtually anything they want to buy online. To this end, we are building a range of advertising products that enhance the customer experience and are integrated with our core eCommerce platform. We have developed products that leverage Amazon’s strength as a world class eCommerce platform and have integrated advertising into the shopping experience from first discovery to purchase. <br> <br> The future of our business is compelling and we are focused on building a robust, innovative business, enabling advertisers of all sizes. Our products range from eCommerce ads that integrate the power of familiar shopping features to visually stunning Kindle screensavers. We can reach customers on Amazon properties, both web and mobile, and across our ad platform. A strategic part of our charter is to build a portfolio of self-service, cost-per-click advertising programs to enable both large and small advertisers to engage with customers in relevant ways. <br><br> As a successful data scientist on the Amazon Advertising team, you need to understand performance advertising domain knowledge and the meanings of data. You will expose and measure current Amazon Advertising performance. You will identify specific and actionable opportunities to solve existing business problems, and collaborate with engineering, research, and business teams for future innovation. You need to be a sophisticated user of advanced quantitative techniques for answering specific business questions, and an expert at synthesizing and communicating insights and recommendations to audiences of varying levels of technical sophistication. <br><br> Major responsibilities include:<br> Translate / Interpret <br><ul><li>Translate business questions and concerns into specific quantitative questions that can be answered with available data using sound methodologies. In cases where questions cannot be answered with available data, work with engineers to produce the required data.</li></ul>Measure/Quantify/Expand<br><ul><li>Retrieve, synthesize, and present critical data in a format that is immediately useful to answering specific questions or improving system performance.</li><li>Analyze historical data to identify trends and support decision making.</li><li>Improve upon existing methodologies by developing new data sources, testing model enhancements, and fine-tuning model parameters.</li><li>Provide requirements to develop analytic capabilities, platforms, and pipelines.</li><li>Apply statistical or machine learning knowledge to specific business problems and data.</li></ul>Explore/Enlighten<br><ul><li>Formalize assumptions, create statistical definition of the outlier, and develop methods to systematically identify these outliers. Work out why such examples are outliers and define if any actions needed.</li><li>Given anecdotes about anomalies or generate automatic scripts to define anomalies, deep dive to explain why they happen, and identify fixes.</li></ul>Make Decisions or Recommendations <br><ul><li>Build decision-making models and propose solution for the business problem you defined</li><li>Conduct written and verbal presentation to share insights and recommendations to audiences of varying levels of technical sophistication.</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br> <ul><li>Statistics, Applied Mathematics, Operation Research, Economics or a related quantitative bachelors' or masters' degree.</li><li>At least 3 years of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, Weka, SAS, Matlab)</li><li>Experience articulating business questions and using quantitative techniques to arrive at a solution using available data</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<br> <ul><li>Depth and breadth in quantitative knowledge. Excellent quantitative modeling, statistical analysis skills and problem-solving skills. Sophisticated user of statistical tools.</li><li>Experience processing, filtering, and presenting large quantities (Millions to Billions of rows) of data</li><li>Combination of deep technical skills and business savvy enough to interface with all levels and disciplines within our customer’s organization</li><li>Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li><li>Excellent verbal and written communication skills with the ability to effectively advocate technical solutions to research scientists, engineering teams and business audiences</li><li>Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations</li><li>Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li><li>Experience in digital advertising is a plus</li></ul><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation. <br><br><br><br><br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}