{"job title": "Software Development Engineer - Personalization, Recommendations, Machine Learning, Data Science", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nHow can we improve the customer experience by tailoring what we display on our pages based on available data? How do we build various data models that helps us innovate different ways to enhance customer experience? What is the relationship to what the customer actually does on the site vs., what they actually buy? How do we do all of this without asking the customer a single question? Sounds fun?<br> <br> Our team's stated missions is to \"grow each customer’s relationship with Amazon by leveraging our deep understanding of them to provide relevant and timely product, program, and content recommendations\". Recommendations at Amazon is a way to help customers discover products. Our team strives to better understand how customers shop on Amazon (and elsewhere) and build recommendations models to streamline customers' shopping experience by showing the right products at the right time. Understanding the complexities of customers' shopping needs and helping them explore the depth and breadth of Amazon's catalog is a challenge we take on every day. <br> <br> Using Amazon’s large-scale computing resources you will ask research questions about customer behavior, build models to generate recommendations, and run these models directly on the retail website. You will participate in the Amazon ML community and work with applied scientists as well as software development engineers with a strong interest in and knowledge of ML. Your work will directly benefit customers and the retail business and you will measure the impact using scientific tools. We are looking for passionate, hard-working, and talented software development engineer who have experience building mission critical, high volume applications that customers love. You will have an enormous opportunity to make a large impact on the design, architecture, and implementation of cutting edge products used every day, by people you know.<br><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor's degree in Computer Science or Engineering<br></li><li>Proficiency with data science, machine learning, statistical modeling or related fields</li><li>Proficiency in enterprise programming languages like Java, C++, Scala, etc.<br></li><li>Proficiency in scripting languages like Python, Perl, etc.<br></li><li>Strong personal interest in learning, researching, and creating new technologies with high commercial impact</li><li>Strong fundamentals in problem solving, algorithm design and complexity analysis</li><li>Experience in distributed systems</li><li>Proven track record of delivering solutions to complex problems<br></li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Masters or Ph.D specializing in Computer Science, Engineering, Mathematics, Statistics, Machine Learning, Physics, or a related quantitative fields</li><li>Proven track record of achievements in statistical modeling and personalization in production<br></li><li>Expertise on a broad set of ML approaches and techniques, ranging from Artificial Neural Networks to Bayesian Non-Parametrics methods.</li><li>Experience with defining organizational research and development practices in an industry setting.</li><li>Proven track in leading, mentoring and growing teams of engineers and scientists</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}