{"job title": "Data Scientist - Alexa Skill Store", "company": "Amazon", "city state": "– Irvine, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nThere’s a revolution brewing to bring convenience, simplicity, efficiency, and fun to our lives, and you can be a part of it! We are hiring a Data Scientist to be a part of the team that’s creating customer experiences to discover, personalize, and acquire Alexa Skills for devices such as Amazon Echo and Amazon Fire TV. If you’re not familiar with Alexa and Skills you can learn more here: https://amazon.com/alexaskills. <br><br>The Amazon Alexa Skills Store is aggressively seeking a Data Scientist to be a member of a cross-functional team focused on user engagement. By using massive amounts of real-time and historical user data you will help research, develop and automate models for optimizing user experiences. Working with a team of software development engineers, a successful candidate has a bias for action and is most comfortable when testing their hypotheses using heterogeneous datasets rich with insight. You will be expected to challenge current methods while enriching the world’s most advanced speech platform.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Statistics, Business Analytics, Applied Mathematics, Operation Research, Economics or a related quantitative master degree or a bachelor with at least 3 years of work experience in these areas.</li><li>At least one year of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, Weka, SAS, Matlab)</li><li>Experience articulating business questions and using quantitative techniques to arrive at a solution using available data</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>MS/PhD in Statistics, Business Analytics, Applied Mathematics, Operation Research, Economics, or related field</li><li>Excellent quantitative modeling, statistical analysis skills and problem-solving skills. Sophisticated user of statistical tools.</li><li>Experience processing, filtering, and presenting large quantities (Millions to Billions of rows) of data</li><li>Combination of deep technical skills and business savvy enough to interface with all levels and disciplines within our customer’s organization</li><li>Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li><li>Excellent verbal and written communication skills with the ability to effectively advocate technical solutions to research scientists, engineering teams and business audiences</li><li>Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations</li><li>Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li><li>Experience in machine learning techniques related to NLP, and clustering is a plus<br></li><li>Previous experience with statistical, econometric, and/or machine learning modeling is a huge plus.</li><li>Experience with Hadoop, Spark or EMR is a huge plus.</li><li>Experience using the linux command line</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}