{"job title": "Snr Data Scientist, Sampling", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAre you interested in joining a start-up team where you can help shape the product, business and customer experience? Do you value autonomy to and an ability to have a direct impact on a business? Then this is the team for you.<br> <br> The Team: Sampling is a program in Consumables which ensures the right customers are exposed to new products. Using ML we determine which new products will delight which set of customers ensuring a high conversion for our partner Brands. Sampling sends out free samples to customers which have higher likelihood of conversion than display ads. The Sampling program has an interesting mix of challenges around customer targeting, customer-to-product mapping, performance reporting and insights, and CX which will challenge you to develop innovative solutions.<br> <br> A Research Scientist on this team must be comfortable working with large volumes of data from disparate sources and be able to manipulate data using a variety of tools. Our customers range from the brands and agencies that use our sampling product, to product managers developing features, to customers who receive the samples we choose to send them, to the advertising teams that sell and report on the performance of sampling campaigns. The Research Scientist must be able to deal with ambiguity and shifting goals and importantly to prioritize the most important questions to answer to drive product performance. In addition, the Senior Research Scientist must possess excellent interpersonal skills and be able to provide thought leadership to product managers and leadership. <br> <br> Join us on our mission to delight customers and along the way you will learn a lot, have fun and make a positive impact on many millions of customers. <br> <br> The Org: The Consumables org comprises of various programs which work together to ensure maximum synergy. The org leadership has high focus on personal development and high throughput through efficiency and maintaining a healthy work-life balance (we have no meeting Mondays and WFH alternate Fridays!)\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Masters or PhD in Computer Science, Engineering, Machine Learning, Operations Research or similar discipline.</li><li>5+ years of relevant academic research or industry experience in developing algorithms.</li><li>Depth and breadth in state-of-the-art approaches in forecasting, planning or machine learning.</li><li>Ability to develop system prototypes in simulation.</li><li>Fluency in at least one statistical software package such as R, Matlab.</li><li>Scientific mindset and the ability to invent, a track record of thought leadership and contributions that have advanced the field.</li><li>Excellent creative problem solving skills.</li><li>Some experience with programming languages such as Java, C++, or Python.</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Superior communication and data presentation skills.</li><li>Demonstrated ability to lead research projects and identify fruitful research directions.</li><li>Demonstrated ability to work on cross-functional teams.</li><li>Experience writing production or library code.</li><li>Understanding of big data computing frameworks (Hadoop, Spark, etc.) and Amazon Web Services.</li></ul>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}