{"job title": "Sr. Machine Learning Scientist", "company": "Amazon", "city state": "– San Diego, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nThe opportunity<br>We're building a new Machine Learning/Data Science team in Amazon Kindle Content. This is a rare opportunity for a seat at the table, shaping Kindle Content science strategy, culture, standards, and processes for an entire Amazon business unit. This team is positioned for quick impact, visibility, and growth as embedding Machine Learning solutions across the business is a top priority for leadership. <br> <br>What you will do<br>As a Machine Learning Scientist, you will analyze and model customer reading, shopping, and purchase patterns using techniques like representation learning and embeddings, predictive modeling, reinforcement learning, sequence modeling, graph-based approaches, and uplift modeling. You will use an array of algorithms from classical statistics to modern deep-learning architectures like autoencoders, LSTMs, and GRUs. You will need to be creative and go far beyond text book solutions to deal with these challenges. Meeting business requirements will involve combining several different machine learning algorithms with domain knowledge into sophisticated ML workflows that automate what can be automated and efficiently utilize experts when needed to mitigate risk. At the same time, you will work with, and help build, mentor, and develop a diverse team of scientists.<br> <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>MS. in Computer Science, Machine Learning, Operational Research, Statistics or a related quantitative field</li><li>At least 3+ years of experience in machine learning, data science, analytics, or related</li><li>At least 2+ years with Java, C++, or other programming language, as well as with R, MATLAB, Python or similar scripting language</li></ul><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Ph.D. in Computer Science, Machine Learning, Operational Research, Statistics or a related quantitative field</li><li>Expertise in machine learning techniques such as neural nets, embeddings and representation learning, predictive modeling, clustering, recommendation systems, bandit methods, reinforcement learning, anomaly detection, tree-based methods</li><li>Expertise in statistical testing and experimental design</li><li>Experience in any of the following fields: Marketing, NLU/NLP, Fraud detection, Personalization/recommendations</li><li>Experience with Apache Spark, Pandas, scikit-learn</li><li>Experience with deep-learning systems like MXNet, Keras, TensorFlow, Theano, etc.</li><li>Familiarity with software engineering industry processes</li><li>Excellent analytical and problem-solving skills</li><li>Excellent written and verbal communication skills</li><li>Track record of innovation through ML and statistical approaches applied to business problems.</li></ul>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.<br> <br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}