{"job title": "Applied Scientist - Personalization Data Sciences", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon's Personalization team owns recommending items to millions of customers, personalizing the Amazon.com website based on each customer's unique interests. We revolutionized e-commerce with features such as \"Customers Who Bought This Also Bought\" and \"Recommended for You,\" and we continue to be at the forefront of innovation in this space. We rely heavily on experimentation for learning how best to serve our customers: when we launch something new, how do we know it's actually effective and makes the customer experience better, not worse? Developing evaluation techniques is just as important as the algorithmic development itself because otherwise we're flying blind.<br><br>The Personalization Analytics team is seeking a skilled and creative applied scientist to help us build the future of experimentation systems at Amazon. <br><br>About you:<br><br>You have an entrepreneurial spirit and want to make a big impact on Amazon and its customers. You enjoy enabling intelligent decisions in the face of real-world, noisy data, and have a bias for delivering simple solutions to complex problems. You're a scientist looking for a career where you'll be able to build, to deliver, and to impress. You're a thought leader and you demonstrate this by delivering solutions, not just by having ideas. You challenge yourself and others to come up with better solutions. You develop strong working relationships and thrive in a collaborative and friendly team environment. <br><br>About us together:<br><br>We're going to help Amazon innovate faster and smarter by designing and delivering the next generation of data analysis tools and visualizations. Along the way, we're going to face seemingly insurmountable challenges. We're going to argue about how to solve them, and we'll work together to find a solution that is better than each of the proposals we came in with. We'll make tough decisions, but we'll all understand why. We'll be the dream team.<br><br>We have decades of combined experience on the team in many areas of data science so it's a great environment in which to learn and grow. Many of us have university teaching experience and we're happy to teach. But, we're also like children playing at the edge of a vast unexplored territory; we have a lot to learn and we are all exploring together with a sense of awe and humility.<br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n• Advanced degree in a quantitative field such as Statistics, Mathematics, or Machine Learning.<br>• Computer Science fundamentals in algorithm design, problem solving, and complexity analysis.<br>• Proficiency in at least one modern programming language such as Python or C/C++.<br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n• Entrepreneurial spirit and passion for innovation and having a large impact. <br>• Experience building systems for large-scale data science.<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}