{"job title": "Data Scientist - Natural Language Processing", "company": "Amazon", "city state": "– Boston, MA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nInterested in Amazon Echo? We’re building the speech and language solutions behind Amazon Echo and other Amazon products and services. Come join us!<br> <br> As a Data Scientist in our Alexa Data Services team, you will be responsible for data-driven improvements to our spoken language understanding models. Your work will directly impact our customers in the form of products and services that make use of speech and language technology.<br> <br> You will:<br> <ul><li>Ensure data quality throughout all stages of acquisition and processing, including such areas as data sourcing/collection, ground truth generation, normalization, transformation, cross-lingual alignment/mapping, etc.</li><li>Clean, analyze and select data to achieve goals</li><li>Build and release models that elevate the customer experience and track impact over time</li><li>Collaborate with colleagues from science, engineering and business backgrounds</li><li>Present proposals and results in a clear manner backed by data and coupled with actionable conclusions</li><li>Work with engineers to develop efficient data querying infrastructure for both offline and online use cases</li></ul><br> <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelor’s or Master’s degree in Statistics, Applied Math, Operations Research, Economics, or related quantitative field.</li><li>MS + 2 yrs experience (or BS + 5 yrs) experience with various data analysis and visualization tools</li><li>Experience in Perl, Python, or another scripting language; command line usage</li><li>Track record of diving into data to discover hidden patterns and of conducting error/deviation analysis</li><li>Knowledge of various machine learning techniques and key parameters that affect their performance</li><li>Experience developing experimental and analytic plans for data modeling processes, using strong baselines, and determining cause and effect relations</li><li>Understanding of relevant statistical measures such as confidence intervals, significance of error measurements, development and evaluation data sets, etc</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Experience in Natural Language Processing modeling and applications<br>· The motivation to achieve results in a fast-paced environment. <br> · Experience with statistical modeling / machine learning <br> · Strong attention to detail <br> · Exceptional level of organization <br> · Comfortable working in a fast paced, highly collaborative, dynamic work environment <br> · Ability to think creatively and solve problems <br> · Fluency in a foreign language<br><br>Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation <br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}