{"job title": "Applied Scientist - Machine Learning Systems", "company": "Amazon", "city state": "– Palo Alto, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon's Sponsored Ads is one of the fastest growing business domains and we are looking senior level engineers with experience building complex machine learning models and writing elegant production code. We are still in Day 1 and there is an abundance of opportunities that are yet to be explored. We are a team of highly motivated and collaborative applied scientists and software development engineers with an entrepreneurial spirit and bias for action. With the team growing at an unprecedented rate, there is broad mandate to experiment and innovate!<br><br>Our systems and algorithms operate on one of the world's largest product catalogs, matching shoppers with products - with a high relevance bar and strict latency constraints. The ads sourcing works across the spectrum of ad serving including coverage expansion, increasing utilization of tail queries, ad relevance, ad quality, query understanding, and much more. Our technology enables thousands of brands, sellers and authors to drive discovery and sales of their products at Amazon by millions of customers. <br><br>We are looking for senior level Applied Scientists, with a background in Machine Learning or writing production code, to improve our understanding of billions of user queries and their context. The solutions you create/deploy ensure relevant ads are served to Amazon's customers. You will directly impact the shopping experience while helping our advertisers get the maximum ROI. You will be expected to demonstrate strong ownership and should be curious to learn and leverage the rich textual, image, and query level data to optimize for ad relevancy.<br><br>This role will challenge you to utilize cutting-edge machine learning techniques in the domain of natural language processing (NLP), deep learning, and image recognition to deliver significant impact for the business. Ideal candidates will be able to work cross functionally across multiple stakeholders, synthesize the science needs of our business partners, develop models to solve business needs, and implement solutions in production. <br><br><br><br><br><br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>BS/MS in Computer Science, Machine learning, or similar quantitative field.</li><li>At least 5 years of hands-on experience building ML (machine learning) and/or NLP (natural language processing) models.</li><li>At least 5 years of experience in data mining and data analytics techniques.</li><li>At least 5 years experience in writing code in Java or C++.</li><li>At least 5 years of experience using Perl or Python (or similar scripting language) for data processing and analytics.</li><li>At least 5 years of experience using R, Weka, Python, or other similar statistical software.</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>A PhD in Computer Science, Machine learning, or similar quantitative field.</li><li>Published research work in academic conferences or industry circles.</li><li>Comfortability with programming in SQL, Hive, Pig, R, Python, and familiarity/experience with AWS stack/tools.</li><li>Advertising technology experience (big plus).</li><li>Strong ability to solve ambiguous problems.</li><li>Able to clearly articulate complex models to technical and non-technical stakeholders, both written and verbal.</li></ul><br>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation<br><br>#sspajobs<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}