{"job title": "Data Scientist, Advertising Measurement and Optimization", "company": "Amazon", "city state": "– Seattle, WA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\n<br>The Amazon Advertising Measurement team is looking for a data scientist to join our team to lead the development of statistical methods for ad measurement. This person in this role will be responsible for building econometric models to measure the effectiveness of advertising and reporting advertising performance to various channel leaders. The incumbent will be responsible for improving and automating new measurement approaches that drive decisions for a global spend of a few billion dollars annually. <br>Responsibilities include: <br>• Ensuring that the measurement practice leverages state of the art statistical methods and machine learning technology to measure effectiveness of advertising <br>• Work closely with both business units and engineering teams to formulate measurement problems and associated technical solution strategies<br>• Build automation to ensure model customers have easy access. <br>• Calibrate models through carefully designed experiments <br>• Develop a library of measurement, decision making and machine learning algorithms<br> <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Graduate degree (MS) in statistics, mathematics, economics or engineering.<br> · Advanced proficiency with statistical modeling and reporting. <br> · Ability to research, identify, evaluate, and implement modeling solutions for complex business problems<br> · Experience using R, MATLAB, and/or Python is required.<br>· Hands-on experience using Big Data Technologies<br> · Expert in SQL and Excel<br>· 2+ years of experience presenting data-focused research to upper management.<br> <br>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n· Expert in Big Data Technologies and AWS<br><br>· Experience working for large advertising and publishing platforms. <br><br><br><br><br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}