{"job title": "Data Scientist (Goodreads)", "company": "Amazon", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nWith over 75 million users, 68 million reviews, and 2 billion books, Goodreads is the world’s largest site for readers and book recommendations. Founded in 2007, Goodreads is a Top 100 web destination where readers find and share books they love. Loved by avid and casual readers alike, Goodreads members can discover new books by seeing what their friends are reading or by using the Goodreads Book Recommendation Engine, share ratings and recommendations, track what they have read, and list what they want to read. Goodreads is also a place where more than 100,000 authors connect with readers. Goodreads is a subsidiary of Amazon, Inc.<br> <br> Goodreads is seeking a Data Scientist that will support a number of business leaders within Goodreads by becoming their go-to source for data modeling, reporting, insights, and guidance. He/she will guide decisions that impact the company’s future - based on carefully thought-out, well-executed, complex analyses and actionable insights. Do you naturally look for the story or the soul hidden in the numbers and have a knack for translating that story into one that non-analytical minds can grasp and rally behind? If so, read on.<br> <br> The role will require an end-to-end understanding of reporting and modeling; working with business owners to understand and define their analytics needs; working with data engineering to acquire necessary data; building reports, models and performing analyses to draw insights; and finally working with the appropriate parts of the organization to implement changes based on those insights.<br> <br> Responsibilities <br> <div><ul><li>Understand the Goodreads/Amazon data structures (MySQL/Data Lake/Redshift)</li><li>Investigate the feasibility of applying scientific principles and concepts to business problems</li><li>Partner with Engineering/Data Engineering to improve the quality of existing data and bring additional data sources in line</li><li>Write sophisticated SQL queries to extract data and build complex models (Excel/R/etc.)</li><li>Build/automate reports/dashboards (in Tableau) that allow the business leaders to get a clear snapshot of their operations</li><li>Design and analyze A/B tests to quantify impact of customer-facing changes</li></ul></div>· Develop innovative experimental design and measurement methodologies to understand our customer growth and business efficacy<br> Collaborate on compelling new analytical reporting, products and features for our business that enable data-driven decision making. <br> <div><ul><li>Communicate insights to the business partners, Goodreads leadership, and Amazon stakeholders - emphasizing clarity, completeness, and actionability</li></ul></div>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>BS/BA in quantitative field - Computer Sciences, Math, Statistics or related field.</li><li>5+ years of professional experience in data science / advanced analytics</li><li>Experience in a business environment with large-scale, complex datasets</li><li>Proficient in SQL and experience with efficient processing of large data sets. Ability to write sophisticated and optimized queries against large databases</li><li>Familiarity with columnar databases like Redshift; Understand database optimization</li><li>Experience with math/stats software – R, SAS, Python</li><li>Tableau – build clear and actionable dashboards</li><li>Experience conveying key insights from complex analysis in summarized business terms</li><li>Modeling – experience building complex models using statistical and forecasting components</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>A graduate degree (MS, MBA, PhD, etc.) in a quantitative field will be highly valued but is not required</li><li>Experience in predictive modeling/statistics/econometrics</li><li>Experience with Big Data solutions as well as other AWS solutions</li></ul><ul><li>Love for reading and connection to the Goodreads mission</li><li>Business Acumen – understand business drivers and have a framework-driven process of analyzing business problems and developing solutions</li><li>Communication – share insights in a way that is easy to grasp and actionable and build relationships to help drive adoption of data- and insights-driven decision making</li></ul><br> Amazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation.<br> <br> Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}