{"job title": "Senior Applied Scientist", "company": "Amazon", "city state": "– Cambridge, MA", "rating": "3.8", "job description": "<b>Job Description</b>\n\n\n\n<div>\n<div>\n<div>\nAmazon is looking for a passionate, talented, and inventive Scientist with a strong machine learning background to help build industry-leading Natural Language Understanding (NLU) solutions. Our mission is to push the envelope in NLU and Entity Resolution (ER) technologies to provide the best possible experience for our customers. Products such as Amazon Echo, Echo Show, Echo Look, Amazon Dash, and Fire TV are illustrative of the user-delighting spoken language solutions Amazon is building.<br><br>As a Scientist on our team, you will collaborate with other scientists and software engineers to research and develop novel algorithms and modeling techniques to advance the state of the art in NLU and ER. Your work will directly impact our customers in the form of products and services that make use of speech and language technology. You will leverage Amazon’s heterogeneous data sources and large-scale computing resources to accelerate advances in natural language understanding.<br><br>Position Responsibilities:<br>· Participate in the design, development, evaluation, deployment of data-driven machine-learned (ML) models targeting NLU and ER applications.<br>· Develop and apply statistical modeling techniques (e.g. Bayesian models and deep neural networks), optimization methods, and other ML techniques to different applications in business and engineering.<br>· Routinely build and deploy ML models on available data.<br>· Research and implement novel ML and statistical approaches to add value to the business. Mentor engineers and scientists.\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Basic Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Master’s or PhD in a relevant field</li><li>5+ years of industry experience in a relevant field</li><li>8+ years of experience with data analysis and visualization tools</li><li>8+ years of experience in Python, or another scripting language; command line usage, e.g., Bash</li><li>8+ years of experience in algorithms and data structures</li><li>8+ years of experience with various machine learning and modeling techniques and parameters that affect their performance</li><li>5+ publications in scientific journals on relevant machine learning topics</li></ul>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n<b>Preferred Qualifications</b>\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Experience in building NLU and/or ER systems (e.g. commercial speech products or government speech projects)</li><li>Knowledge in machine learning techniques in entity resolution or text search domain.</li></ul><br>Amazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation<br><br><br>\n\n</div>\n</div>\n</div><br><br>Apply Now at Amazon"}