{"job title": "Data Engineer", "company": "Amdocs, Inc.", "city state": "– New York", "rating": "3.7", "job description": "<strong>Job ID:</strong> 59809&nbsp;<br>\n<div>\n<strong>Who are we?</strong>\n<br><br>\nIf you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on SnapChat or send your images on Instagram, you get a great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&amp;T, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day.\n<br><br>\n<strong>In one sentence</strong>\n<br><br>\nThis is a hands-on position for a motivated and talented Data Engineer. The Data Engineer performs data management activities including data assessment, mapping, transformation, ingestion and operation.\n<br><br>\n<strong>What will your job look like?</strong>\n<ul>\n<li>Working with business units to identify data needs, challenges and their impact on business</li><li>Discovery and data profiling to ensure completeness and quality of data. Root cause analysis behind variances of data quality</li><li>Build / Develop end to end data flows from source to target using various data preparation tools on cloud, ETL, Data Quality, Data Catalog etc.</li><li>Design and develop data enhancement and enrichment procedures</li><li>Perform data wrangling activities</li><li>Guiding and Coordinating offshore data development team</li>\n</ul>\n<strong>All you need is...</strong>\n<ul>\n<li>Bachelor's degree in Science/IT/Computing or equivalent.</li><li>4-6+ years total experience in development mainly around data management and related technologies e.g. ETL, Databases, SQL, Streaming</li><li>Experience with AWS data and analytics platform and tools: Glue, S3, and Redshift. SageMaker is advantage.</li><li>Experience in working in Agile projects and Certification as a Scrum Master (CSM or PSM) is a plus</li><li>3+ year’s in-depth knowledge &amp; experience in Hadoop around all the Hadoop ecosystem tools like HDFS, Hive, and Kafka.</li><li>Hadoop/Spark/Java certifications is an advantage</li><li>Excellent written and verbal communication – to communicate with Development and Project Management Leadership</li><li>Excellent collaboration and team work skills, Ability to work as part of a team in collaboration with subject matter experts</li><li>Knowledge of telecommunications and of the subject area being investigated - advantage</li><li>Familiarity in the Media and Entertainment domain</li>\n</ul>\n<strong>Why you will love this job?</strong>\n<ul>\n<li>You will be able to use your influencer and leadership expertise to drive growth of business for all Amdocs and third party solutions.</li><li>You will be a key member of a global, dynamic and highly collaborative team with various possibilities for personal and professional development</li><li>You will have the opportunity to work in multinational environment for the global market leader in its field</li>\n</ul>\n</div>\n<br>\nApply now"}