{"job title": "Data Scientist", "company": "Amenity Analytics", "city state": "– New York, NY", "rating": "NA", "job description": "<div>We are hiring an expert Data Scientist/Machine Learning specialist to come and join a cognitive computing start up in New York, NY. You will be working on deep learning frameworks and as the successful Data Scientist you will have extensive experience with interpreting data and other deep learning tools &amp; frameworks. You will be using Using cutting-edge technologies to build scalable machine learning and AI technologies that solve some of the hardest problems faced in the financial services sector.</div>Responsibilities\n\n<ul>\n<li>Selecting features, building and optimizing classifiers using machine learning techniques</li><li>Data mining using state-of-the-art methods</li><li>5 years of python +</li><li>Extending companys data with third party sources of information when needed</li><li>Enhancing data collection procedures to include information that is relevant for building analytic systems</li><li>Processing, cleansing, and verifying the integrity of data used for analysis</li><li>Doing ad-hoc analysis and presenting results in a clear manner</li><li>Creating automated anomaly detection systems and constant tracking of its performance</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Strong problem solving skills with an emphasis on product development.</li><li>Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.</li><li>Experience working with and creating data architectures.</li><li>Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.</li><li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</li><li>Excellent written and verbal communication skills for coordinating across teams.</li><li>A drive to learn and master new technologies and techniques.</li><li>Were looking for someone with at least 3 years of experience manipulating data sets and building statistical models, has a Masters or PHD in Statistics, Mathematics, Computer Science or another quantitative field</li><li>Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.</li><li>Experience querying databases and using statistical computer languages: R, Python, SQL, etc.</li>\n</ul>"}