{"job title": "Lead Data Engineer", "company": "AmerisourceBergen", "city state": "– United States", "rating": "3.0", "job description": "<div>\n<div><br></div><div>Individuals \nin this role understand how information is turned into knowledge and how this \nknowledge supports and enables key business processes. They must have a solid \nunderstanding of logical data warehousing design principles and data access \nrequirements for business analytics and exploration. Also required are \nanalytical skills, the ability to establish and maintain effective working \nrelationships with team members, as well as an innate curiosity around wanting \nto understand business processes, business strategy and strategic business \ninitiatives to help drive incremental business value from enterprise data \nassets</div></div><div>\n<div>\n\n<p></p><ul><li>Leads major \nprojects/ programs, providing subject matter expertise and technical direction \nand oversight.</li><li>Works on projects that span a broad range of technologies.</li><li>Has expertise in multiple technical environments and possesses business \nknowledge that spans multiple business areas.</li><li>Leads project planning processes.</li><li>Develops work plans or reviews other work plan timelines and manages \nworkflows to meet project timeframes.</li><li>Responsible for identifying project tasks in support of project planning \nand estimation.</li><li>Contributes to strategic planning meetings and provides guidance and \nexpertise on system options, risk, cost vs. benefits, and impacts on business \nprocesses and goals.</li><li>Works closely with architects to assure all systems are in line with IT \nlong-term strategy.</li><li>Together with business stakeholders leads the development of business \nanalytics requirements.</li><li>Brings deep understanding of business data domain and underlying data \nsources.</li><li>Leads development of semantic data access requirements (functional and \nnon-functional).</li><li>Ensures adherence to standards, policies and procedures.</li><li>Reviews modules for quality assurance.</li><li>Develops convergence plans to meeting standards, as needed.</li><li>May assist in defining development guidelines and standards.</li><li>Leads development of technical design for data sourcing, transformation and \naggregation logic.</li><li>Leads data sourcing approach and is primary interface with the Information \nDelivery team in implementing sourcing mechanisms.</li><li>Leads development of data transformation and aggregation logic.</li><li>Ensures consistent and stable delta processing for data loads.</li><li>With input and direction from the Principal Information Architect, leads \nanalysis of analytics data consumption alternatives and recommends optimal \napproach based on analytics requirements.</li><li>Ensures proper knowledge transfer of data access/consumption mechanisms to \nbusiness stakeholders, data visualization specialists and/or data \nscientists.</li><li>Leads project teams building applications.</li><li>Designs and builds enterprise data platforms using a disciplined \ndevelopment process.</li><li>Integrates solutions with other applications and platforms outside the \nframework.</li><li>Reviews integration testing plans.</li><li>Supports and/or executes testing efforts across the life cycle.</li><li>Consults Delivery Management team on batch/bulk data load scheduling to \noptimize performance</li><li>Oversees and assists in production support.</li><li>Provides technical direction and oversees testing of business analytics \nsolutions.</li><li>Provides technical leadership for the definition and development of test \nplans and system documentation.</li><li>May troubleshoot existing information systems to identify errors or \ndeficiencies and develops solutions.</li><li>Ensures all applications are documented according to standards.</li><li>Promotes effective use of information technology by educating users on \nsystem functionality.</li><li>Assists in the development of user guides and training documentation for \nsystems.</li><li>Ensures data solution monitoring requirements are provided to the Delivery \nManagement team and is alerted when solutions are not performing as \nexpected.</li><li>Helps to establish SLAs on system performance and data processes with \nService owners, RM’s, Delivery Management team, and business owners.</li><li>Provides technical leadership, coaching and mentoring to team members.</li><li>Provides technical guidance or system process expertise.</li><li>Provides performance feedback to managers.</li><li>Develops reports and presentations for senior management, as needed.</li></ul><p></p>\n</div></div>\n<br>\n<div>\n<div><br></div><div><ul><li><div><div><p>Bachelor’s degree in Programming/Systems or Computer Science or other \nrelated field. Or equivalent work experience.</p></div></div></li></ul></div></div><div><div><ul><li><div><div><p>8 or more years of experience in technologies relevant to data/information \nmanagement, such as SQL, RDBMS, Data Lake/Hadoop, MDM, Metadata, Data Quality, \netc.</p></div></div></li><li><p>Has a broad level of understanding surrounding information systems and \napplication architecture standards.</p></li><li><div>Experience in leading projects and teams.</div></li><li><p>Demonstrated ability to analyze and interpret complex problems or processes \nthat span multiple business areas, identify and understand requirements and \ndevelop alternate solutions.</p></li><li><p>Experience designing, developing and testing applications using proven or \nemerging technologies, in a variety of technologies and environments.</p></li></ul></div></div>\n<br>"}