{"job title": "Scientist", "company": "AmerisourceBergen", "city state": "– Cleveland, MS", "rating": "3.0", "job description": "Do you have B.S. Degree in Applicable Science field with minimum of 3 years of preferred pharmaceutical laboratory experience?\n<br>\nIf so, at Employer, you will find an innovative culture that is patient focused and dedicated to making a difference. As an organization, we are united in our responsibility to create healthier futures.\n<br><br>\nWhat you will be doing\n<br><br>\n<strong>POSITION SUMMARY:</strong>\n<br>\nPharMEDium Services, LLC is a growing outsource compounding organization servicing hospitals nationwide. Our growth now has encouraged our business to seek Scientist to perform and analytical testing in our testing lab. This position will report to the Quality Organization of PharMEDium.\n<br><br>\nScientist at this facility will perform quantitative and qualitative analysis of our compounded admixed product for distribution to customers nationwide. Scientist will abide by all documentation procedures and maintain a level of professionalism throughout each working day. The scientist must be familiar with and knowledgeable of cGMP/GLP and 21 CFR Part 11 procedures. All applicants for this position must embody and demonstrate the PharMEDium Core Values: Patient Safety, Flawless Quality, Operational Excellence, Employee Well Being, Service Excellence, and Respectful and Collaborative Environment.\n<br><br>\n<strong>PRIMARY DUTIES AND RESPONSIBILITIES:</strong>\n<br>\nPerform testing using aseptic technique in a laminar Airflow clean bench\n<br>\nPer procedures maintain all documents for laboratory analysis\n<br>\nPerform rapid sterility testing per procedure and report result per cGMP/GLP Guildlines\n<br>\nReceiving, Storing and logging in samples for testing analysis\n<br>\nIdentify OOL results and follow the guidance of supervision through investigation process\n<br>\nTroubleshooting instrumentation\n<br>\nGenerating Quality Data Trend Reports\n<br>\nPeer Review of Data via other scientist and sterility technicians\n<br>\nKeeping the laboratory clean\n<br>\nOrdering supplies and other materials\n<br>\nFollow Standard Operating Procedures\n<br>\nReviews and Updates Standard Operating Procedures\n<br>\nMaintenance of Laboratory Notebooks\n<br>\n<strong>Support in all regulatory inspections:</strong> FDA, DEA, Board of Pharmacy, and Internal Audits\n<br><br>\nWhat your background should look like (minimum qualifications)\n<br><br>\n<strong>EXPERIENCE AND EDUCATIONAL REQUIREMENTS:</strong>\n<br>\nB.S. Degree in Applicable Science field with minimum of 3 years of preferred pharmaceutical laboratory experience\n<br>\nAseptic Technique knowledge preferred\n<br>\nPreferred experience with FDA regulated industry\n<br>\nStrong knowledge of sterility lab equipment and supporting laboratory equipment.\n<br>\nEfficient in troubleshooting laboratory equipment.\n<br>\nEffective organization and planning skills\n<br>\nExcellent technical and verbal skills\n<br>\nComputer knowledge of data collection and/or spreadsheet software, Microsoft Word and Excel\n<br>\nKnowledge of Chromatographic analysis, GLP documentation of experiments, and Qualitative testing\n<br><br>\nWhat Employer offers\n<br>\nWe offer competitive total rewards compensation. Our commitment to our associates includes benefit programs that are comprehensive, diverse and designed to meet the various needs across our associate population.\n<br><br>\nHealthcare for associates and eligible dependents, same-sex and domestic partners\n<br>\nPaid time off, including vacations and holidays\n<br>\nPaid volunteer time off\n<br>\nLife insurance and disability protection\n<br>\nPet insurance\n<br>\nEmployee Stock Purchase Program\n<br>\nRetirement benefits and more\n<br>\nThroughout our global footprint and various business units, we take a balanced approach to the benefits we offer. Many benefits are company-paid, while others are available through associate contributions. Specific benefit offerings may vary by location, position and/or business unit.\n<br><br>\nAbout Employer\n<br>\nEmployer is a publicly traded Fortune 12 global healthcare solutions company and is one of the world's largest pharmaceutical services companies. Powered by our associates around the world, we provide pharmaceutical products and business solutions that improve access to care. We operate the backbone of the healthcare supply chain. We drive the future of local care delivery. We guide medical innovations to market. We create healthier futures.\n<br><br>\nPrimary LocationUnited States-Mississippi-Cleveland\n<br><br>\nDavis 913 N. Davis Ave Cleveland 38732\n<br><br>\nOrganizationPharMEDium\n<br><br>\nJobPharmacy Jobs\n<br><br>\nScheduleFull-time\n<br><br>\nEqual Opportunity Employer/Minority/Female/Disability/Veteran"}