{"job title": "Quantitative Social Scientist [DATA-17], Data &amp; Analytics, NY", "company": "American Civil Liberties Union", "city state": "– New York", "rating": "3.0", "job description": "<div>\n\n<ul>\n<li>Facebook</li><li>Twitter</li><li>Reddit</li><li>Email</li><li>Print</li></ul></div>\n<br>\n <div> Quantitative Social Scientist [DATA-17], Data &amp; Analytics, NY</div>  <div> Office: <div> National Offices, New York, NY</div> </div>  <div> Location: <div> New York</div> </div>  <div> <div> October 1, 2018</div> </div>  <div> <div><strong>Quantitative Social Scientist [DATA-17]</strong>\n<br><br>\n<strong>American Civil Liberties Union</strong>\n<br><br>\n<strong>Data &amp; Analytics, NY</strong>\n<br><br>\nFor nearly 100 years, the ACLU has been our nation’s guardian of liberty, working in courts, legislatures, and communities to defend and preserve the individual rights and liberties guaranteed by the Constitution and laws of the United States. Whether it’s ending mass incarceration, achieving full equality for the LGBTQ community, advancing racial justice, establishing new privacy protections for our digital age, or preserving the right to vote or the right to have an abortion, the ACLU takes up the toughest civil liberties and civil rights cases and issues to defend all people from government abuse and overreach. With more than one million members, activists, and supporters, the ACLU is a nationwide organization that fights tirelessly in all 50 states, Puerto Rico, and Washington, D.C., for the principle that every individual’s rights must be protected equally under the law, regardless of race, religion, gender, sexual orientation, gender identity or expression, age, disability, national origin, record of arrest or conviction.\n<br><br>\n<strong>OVERVIEW</strong>\n<br><br>\nThe ACLU is seeking a full-time <strong>Quantitative Social Scientist</strong> to apply cutting-edge empirical methods from the social sciences to quantitative research questions that inform the ACLU’s litigation and advocacy work. The Quantitative Social Scientistwill be responsible for partnering with the ACLU’s attorneys across a wide range of civil liberties issues, to enhance their understanding of quantitative reports and expert testimony, shape research questions and perform analyses, dissect data from public and case-specific records requests; and work on quantitative reports to support advocacy efforts. The Quantitative Social Scientistwill also collaborate with the data and analytics team to build models and analyses to help the ACLU identify meaningful business insights, inform strategic decisions, and improve constituent engagement. The ideal candidate will possess the right balance of academic rigor, the ability to be agile in a fast-paced setting, and skill to translate academic methods and findings into practical solutions. The position will be based in New York, and report to the Chief Analytics Officer.\n<br><br>\n<strong>ROLES AND RESPONSIBILITIES</strong>\n<ul>\n <li>Develop quantitative research analyses and literature reviews that support prospective and active ACLU litigation</li> <li>Write advocacy-oriented quantitative research articles for general public consumption across a wide range of issue areas (e.g., policing, voting restrictions, immigration, reproductive rights)</li> <li>Drive the direction of expert reports and testimony for litigation</li> <li>Review, critique, and amend expert reports for litigation</li> <li>Manage public records requests for legal teams, and perform data analyses on the returns to inform legal direction</li> <li>Maintain current knowledge of cutting edge empirical methods in social science</li> <li>Maintain current knowledge of the empirical literature across a wide range of topics (e.g., policing, voting restrictions, immigration, reproductive rights)</li> <li>Advise the Data &amp; Analytics team on quantitative methodology</li> <li>Demonstrate a commitment to diversity within the office using a personal approach that values all individuals and respects differences in regards to race, ethnicity, age, gender identity and expression, sexual orientation, religion, ability, socio-economic circumstance, and record of arrest or conviction.</li> <li>Commitment to work collaboratively and respectfully toward resolving obstacles and/or conflicts</li>\n</ul>\n<strong>EXPERIENCE AND QUALIFICATIONS</strong>\n<ul>\n <li>Advanced degree (Ph.D. preferred) in a social science field (Economics or Political Science preferred)</li> <li>Fluency with a wide range of social science empirical methods</li> <li>Experience with empirical work involving large datasets and cluster computing</li> <li>Expertise in statistics, econometrics, program evaluation, and experimental design</li> <li>Fluency in a statistical programming language (R, Python, Stata) required</li> <li>Experience with database querying (SQL, NoSQL) preferred</li> <li>Excellent programming and problem-solving skills</li> <li>Excellent organizational and written communication skills</li> <li>Ability to clearly translate technical concepts for a non-technical audience</li> <li>Ability to balance multiple priorities, communicate goals and build consensus to work effectively within and across departments</li> <li>Passion for civil liberties and civil rights, especially regarding privacy and the fight against discrimination</li>\n</ul>\n<strong>COMPENSATION</strong>\n<br><br>\nThe ACLU offers a generous and comprehensive compensation and benefits package, commensurate with experience and within parameters of the ACLU compensation scale.\n<br><br>\n<strong>HOW TO APPLY</strong>\n<br><br>\nPlease send a cover letter, CV, quantitative research writing sample (e.g., job market paper, peer reviewed publication, or working paper) to: hrjobsdata@aclu.org. Reference [DATA-17] in the subject line.\n<br><br>\n<em>Please indicate in your cover letter where you learned of this career opportunity.</em>\n<br><br>\n<em>Applications will be accepted until the position is filled.</em>\n<br><br>\nThis job description provides a general but not comprehensive list of the essential responsibilities and qualifications required. It does not represent a contract of employment. The ACLU reserves the right to change the description and/or posting at any time without advance notice.\n<br><br>\n<strong>The Department of Education has determined that employment in this position at the ACLU does not qualify for the Public Service Loan Forgiveness Program.</strong>\n<br><br>\n<strong>The ACLU is an equal opportunity employer. We value a diverse workforce and an inclusive culture. The ACLU encourages applications from all qualified individuals without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, citizenship, disability, veteran status and record of arrest or conviction.</strong>\n<br><br>\nThe ACLU undertakes affirmative action strategies in its recruitment and employment efforts to assure that persons with disabilities have full opportunities for employment in all positions.\n<br><br>\nWe encourage applicants with disabilities who may need accommodations in the application process to contact: <strong>hrjobsincl@aclu.org</strong>. Correspondence sent to this address that is not related to requests for accommodations will not be reviewed. Applicants should follow the instructions above regarding how to apply.\n<br><br>\n<em>The ACLU comprises two separate corporate entities, the American Civil Liberties Union and the ACLU Foundation. Both the American Civil Liberties Union and the ACLU Foundation are national organizations with the same overall mission, and share office space and employees. The ACLU has two separate corporate entities in order to do a broad range of work to protect civil liberties. This job posting refers collectively to the two organizations under the name “ACLU.”</em></div> </div>"}