{"job title": "AmeriQual Foods - Food Scientist", "company": "AmeriQual Foods", "city state": "– Evansville, IN", "rating": "NA", "job description": "Job Description<div>This position performs various tasks related to day to day production support, new product development, existing product revisions and manufacturing processes.\n<br><br>\n<strong> Duties and Responsibilities</strong>\n<ul>\n<li>Process Development – work with product development to scale up production trials, and providing support for commercialization of initial production start-up. Report results to appropriate departments during the commercialization process.</li><li>Lead and drive redesign &amp; renovation of existing products and manufacturing process to increase quality, reduce costs &amp; or increase production efficiencies.</li><li>Work with engineering and operations to identify new equipment and manufacturing steps to increase quality, reduce costs &amp; increase production efficiencies.</li><li>Maintain formulation files by auditing production, reviewing batch procedures, and update as needed</li><li>Support production with troubleshooting out of spec product or concerns on established products</li><li>Work with the SPC program manager and Quality Systems to set change process control requirements for existing products and provide data or data analysis upon internal and customer request</li><li>Must maintain a flexible schedule to accommodate start production and/or adjustments required on second shift. Limited weekend work also required. Must be available evenings and weekends (off hours) to answer phone calls or emails pertaining to production issues</li><li>Must interact with customers and plant personnel in a professional and friendly manner</li><li>Adhere to Quality, R&amp;D Procedures, GMP, and Safety Standards</li><li>Complete other required tasks as necessary</li></ul></div>\n<br>\nCompany Description<div>AmeriQual Group is a food processing company that specializes in the development, processing, packaging and distributing of high quality shelf-stable foods. We provide innovative solutions to major branded food companies, food service providers, retailers and the United States Department of Defense.</div>"}