{"job title": "Lead Data Scientist", "company": "American Institutes for Research", "city state": "– District of Columbia", "rating": "3.1", "job description": "<strong>Job Description</strong>\n<br><br>\nLead Data Scientist\n<br><br>\nJob LocationUS-DC\n<br><br>\nJob ID10848\n<br><br>\nJob LocationUnited States\n<br><br>\nOverview\n<br><br>\nJoin our team of more than a hundred software engineers, designers, project managers and software specialists that are smart, creative and excited by what they do.\n<br><br>\n<strong>Some of our ground-breaking work includes:</strong>\n\n\n<ul>\n<li>advanced computer-adaptive algorithms (only one that's peer-approved in the country)</li>\n<li>mobile support for the user interfaces</li>\n<li>learning management systems with social media features</li>\n<li>user interfaces that are universally accessible to people with or without disabilities</li>\n<li>innovative, machine-scorable items</li>\n</ul>\n\nThe American Institutes for Research (AIR) is a leading professional services firm with a growing software engineering and product development team. We design and build things that are inspiring and make a real impact in the online testing industry. We are currently seeking a Lead Data Scientist to join our team in the Washington, DC office.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Work as a member of AIR's Assessment division on cutting edge problems involving the use of machine learning, data analytics and AI</li>\n<li>Develops software, algorithms and applications to apply mathematics to data and build data driven apps to translate data into computational intelligence around standardized tests for students</li>\n<li>Processes large amounts of data for statistical modeling, and graphic analysis (metrics)</li>\n<li>Applies mathematical theories and statistical methods to solve problems in computer science</li>\n<li>Develops mathematical or statistical models of phenomena to be used for analysis or computational simulation</li>\n<li>Designs complex metrics projects that apply valid scientific techniques and utilize information obtained from baselines or historical data in order to structure analyses</li>\n<li>Build prototypes that can be seamlessly transitioned to production</li>\n<li>Develops algorithms for data analysis</li>\n<li>Apply state of the art machine learning techniques</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>MS in Applied Mathematics, Statistics, Computer Science, Physics or Engineering and 8+ years of experience or a Bachelor's Degree in the above fields and 10+ years of experience</li>\n<li>Demonstrated ability and understanding of data mining and machine learning algorithms</li>\n<li>Experience with numerical methods</li>\n<li>Background in deep learning, machine learning &amp; big data</li>\n<li>Experience designing systems using Python, R, Java or .NET languages</li>\n<li>Hands-on experience with using machine learning frameworks such as Scikit-learn and a deep learning framework such as TensorFlow, Keras, Caffe, PyTorch or Theano</li>\n<li>Must possess an analytical mindset and strong programming skills</li>\n<li>Experience working on large data sets</li>\n<li>Experience working with relational databases such as SQL Server</li>\n<li>Strong written and oral communication skills, organizational skills, and attention to detail</li>\n<li>Self-motivated with minimal oversight</li>\n<li>Experience with deep learning models performing NLP tasks a plus</li>\n<li>LI-SS1</li>\n</ul>\n\n<strong>#CB</strong>\n<br><br>\nAIR is an equal employment opportunity/affirmative action employer committed to excellence through diversity. Minorities, women, individuals with disabilities and veterans are encouraged to apply"}