{"job title": "Data Analyst", "company": "American Medical Response", "city state": "– Washington, DC", "rating": "2.9", "job description": "More Information about this Job\n<br><br>\nAmerican Medical Response\n<br><br>\nWashington DC\n<br><br>\nData Analyst\n<br><br>\nJob Title: Analyst, Operations Planning &amp; Analytics\n<br><br>\nReports To: Communications Center Director\n<br><br>\nFLSA Status: Exempt\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nThis position is responsible for all phases of operational performance analysis, including but not limited to the creation of business rules, measure development, data collection, report design, summarization and validation.\n<br><br>\n<strong>Essential Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Analyze operational data reports for select business units to assure data integrity, adherence to proper dispatch process, operational performance metrics and accuracy.</li>\n<li>Work closely with both communications/dispatch leadership and operations leadership to address performance improvement opportunities identified by Comm. Center operator, down to the keystroke input level.</li>\n<li>Lead efforts to assure timely resolution of late call analysis by individual business units.</li>\n<li>Produce timely partner performance reports per contract terms.</li>\n<li>Perform complex, multilayered analysis of operational performance utilizing data from multiple sources.</li>\n<li>Assist leaders by assembling data to support internal performance presentations.</li>\n<li>Assist leadership in the development and evaluation of key metrics and benchmarks.</li>\n<li>Create operational performance reports and test for accuracy on a regular basis.</li>\n<li>Seek new and innovative ways for AMR to provide great service at a higher level of efficiency to its patients and customers.</li>\n<li>Document and share leading practices in deployment planning and educate operations management by disseminating knowledge of Central Planning tools and processes.</li>\n<li>Adhere to all company policies and procedures.</li>\n<li>Adherence to and compliance with information systems security is everyone's responsibility. It is the responsibility of every computer user to: Know and follow Information Systems security policies and procedures. Attend Information Systems security training, when offered. Report information systems security problems.</li>\n<li>Ability to use / operate standard office equipment and tools.</li>\n</ul>\n\n<strong>Non-Essential Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Perform other duties as assigned.</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n<br><br>\n<strong>Education/Licensing/Certification:</strong>\n\n\n<ul>\n<li>Bachelor's degree in business, mathematics, statistics, operations research, engineering, or computer science is preferred.</li>\n\n<strong><li>Experience:</li>\n\n</strong>\n\n<li>3 or more years of relevant experience in a role requiring independent analysis of performance metrics.</li>\n<li>Prefer experience in high volume call center, healthcare and/or EMS.</li>\n</ul>\n\n<strong>Knowledge and Skills:</strong>\n\n\n<ul>\n<li>Proven analytical, critical thinking and problem-solving abilities.</li>\n<li>Ability to interpret, analyze and track complicated contract requirements. Offering guidance to leadership on how best to improve performance.</li>\n<li>Proficient in spreadsheet, reporting and database tools (e.g., Excel, Access, other Microsoft Office applications).</li>\n<li>Excellent communication skills (written and oral) with various levels within the organization.</li>\n<li>Must be a self-starter with the ability to develop analysis of clinical performance data with limited supervision.</li>\n<li>Ability to work with others in a high volume fast paced environment as well as ability to work independently with little direct interaction with other employees.</li>\n</ul>\n\nEEO Statement\n<br><br>\nEOE including Veterans and Disabled<br><br>SDL2017"}