{"job title": "Senior Associate Scientist-Immumo- Oncology", "company": "Amgen", "city state": "– South San Francisco, California", "rating": "3.7", "job description": "Job Description\n<br>\nThe Department of Inflammation and Oncology at Amgen in South San Francisco is seeking a talented and motivated molecular biologist to join our discovery team. The Senior Associate Scientist will have the opportunity to think independently and make major contributions to Amgen's early stage pipeline and will be an integral part of our target discovery team applying knowledge in molecular biology to help develop tools and models for our research.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nAct as an integral member of a dynamic research team, collaborating with research scientists at multiple Amgen sites, and working closely with groups in other functional areas including Inflammation, Therapeutic Discovery, and Medical Sciences.\n<br><br>\nMake major scientific laboratory-based contributions to the research goals of the department.\n<br><br>\nPresent results in both internal and external forums, and participate in the writing of manuscripts for publication.\n<br><br>\nPlanning and performing laboratory experiments, analyzing data, and communicating results.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\nMaster's degree and 3 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 5 years of scientific experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nPost-graduate training in molecular biology, protein biochemistry, or immunology\n<br><br>\nProficiency in molecular cloning, cell line generation, genome editing, and relevant skills in molecular biology\n<br><br>\nDemonstrated track record of independent critical thinking and scientific achievement in research, exemplified by a strong publication record and/or significant contributions to a therapeutic development program\n<br><br>\nStrong verbal and written communication skills\n<br><br>\nKnowledgeable, highly motivated, creative, and collaborative\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nAmgen will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance."}