{"job title": "Scientist - Genome Analysis Unit (Computational Biology)", "company": "Amgen", "city state": "– South San Francisco, California", "rating": "3.7", "job description": "Job Description\n<br>\nThe Genome Analysis Unit (GAU) is seeking a talented computational biologist to join our team and further our mission of making biological discoveries that\n<br><br>\naccelerate development within Discovery Research and Preclinical Development at Amgen . The position focuses on the application of bioinformatics expertise to the analysis and interpretation of large datasets to support ongoing drug development projects in close collaboration with project teams. These datasets include in vitro and in vivo assay results, RNA expression, genetics, and high value public resources. Additionally, the role will involve the creation of novel algorithms and analytical approaches that can be used to both identify new drug targets as well as predict the safety profile of our molecules and thus increase clinical success rates.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\n<li>\nApply advanced techniques in bioinformatics, statistical analysis, and programming to biological problems across a wide range of human disease and drug safety areas at Amgen.</li>\n<li>\nWork with large internal and external biological data sets including Next Generation Sequencing (NGS) data (e.g. RNA-Seq, scRNA-Seq, WGS).</li>\n<li>\nInterface directly with project teams and key stakeholders within Amgen to ensure the appropriate and timely inclusion of relevant datasets.</li>\n<li>\nIntegrate work tightly with wet lab efforts within the GAU, Discovery Research and CBSS focused on predictive safety and target validation.</li>\n<li>\nRepresent group internally and externally through presentations, publications, networks, collaborations and conferences to promote approaches and raise the profile of work within the team.</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n<br><br>\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 4 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 6 years of scientific experience\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nAdvanced degree in Bioinformatics, Biostatistics, Computer Science, Genomics\n<br><br>\nHands-on experience in the fields of bioinformatics and genomics including working with\n<br><br>\nvarious public and proprietary data repositories (e.g., TCGA, GTEx, dbGaP, Ensembl, UCSC\n<br><br>\ngenome browser, Array Studio), bioinformatics tools (e.g., BLAST, GATK, Cell Ranger, samtools, VEP), and statistical environments (e.g., R, S+, Matlab)\n<br><br>\nExperience with manipulation, interpretation, and innovative analysis (e.g. novel algorithm development) of large biological datasets, including single-cell sequencing data\n<br><br>\nResearch experience in the field of neuroscience\n<br><br>\nProficient in programming (e.g., Python, Java, C/C++) and working in a Unix/Linux environment; ability to develop customized bioinformatics tools\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nAmgen will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance."}