{"job title": "Process Development Senior Scientist Pivotal Attribute Sciences", "company": "Amgen", "city state": "– Cambridge, Massachusetts", "rating": "3.7", "job description": "Job Description\n<br>\nAmgen is a leading biotechnology company with a mission to serve patients around the world. As a science-based, patient-focused organization, we discover and develop innovative therapies to treat serious illnesses.\n<br><br>\nAmgen's Attribute Sciences (AS) department within the Process Development (PD) organization defines the favorable quality characteristics of the therapies it produces and optimizes state-of-the-art analytical tools to guide that development. The Pivotal PD organizations focus is developing and commercializing robust manufacturing processes across a wide range of therapeutic modalities, including (but not limited to) synthetic medicines, monoclonal and bispecific antibodies, bispecific T-cell engagers (\"BiTEs\"), and live oncolytic viruses .\n<br><br>\nLocated in our Cambridge, MA office the PD Senior Scientist will work to provide strategic analytical leadership (as an Attribute Sciences team lead) to teams developing commercializable manufacturing processes and collaborate closely with Drug Substance and Drug Product colleagues.\n<br><br>\n<strong>Key responsibilities:</strong>\n\n<ul>\n<li>Supervise a team that provides analytical data to support Drug Substance and Drug Product development, including purity analysis, chiral purity, dissolution analysis, and structural elucidation using mass spectrometry, FTIR, and NMR</li><li>Act as an Attribute Sciences Team lead for a program in pivotal clinical process development, being responsible for all analytical work to support the program</li><li>Define the analytical target profile (ATP) for methods used to monitor product quality. Based on the ATP, oversee the development, qualification, remediation, and transfer of analytical methods to Quality Control</li> <li>Manage activities at contract manufacturing and testing sites</li><li>Author technical reports and analytical Chemistry, Manufacturing and Controls (CMC) sections in regulatory documents. Answer analytical and product quality questions from health authorities</li><li>Drive product characterization in support of process comparability studies, regulatory filings, regulatory questions, and reference standard qualification</li><li>Provide expertise and evaluation of Amgen's platform and analytical technologies, helping to drive innovation and efficiency within Process Development</li><li> Help to define strategies that improve the effectiveness and efficiency of the Attribute Sciences department</li>\n</ul>\n\n<strong> Basic Qualifications</strong> \n<br><br>\nDoctorate degree and 2 years of Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 5 years of Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 7 years of Scientific experience\n<br><br>\n<strong> Preferred Qualifications</strong> \n\n<ul>\n<li>Strong understanding of small molecule analysis, spectroscopic techniques with an emphasis toward Process Analytical Technologies (PAT) for process understanding and process control, separation science, structure elucidation and solid-state characterization guided and informed by knowledge of organic chemistry. Solid understanding of analytical method developments toward solid oral formulation support, including dissolution method development. Knowledge of large molecule analysis</li></ul>\n\n<ul>\n<li>Experience in a wide variety of analytical and physicochemical techniques including chromatography (High- Performance Liquid Chromatography: HPLC, Gas Chromatography: GC, Capillary Electrophoresis: CE) mass spectrometry, Ultraviolet: UV, Nuclear Magnetic Resonance: NMR, Fourier Transform Infrared: FTIR, Raman, particle size determination, crystal characterization, dissolution, etc.</li></ul>\n\n<ul>\n<li>Developing and implementing methods for in-process testing, release and stability testing</li></ul>\n\n<ul>\n<li>Experience in analytical testing requirements for immediate release and controlled release solid dosage forms, liquid formulation or lyophilized formulation</li></ul>\n\n<ul>\n<li>Familiarity with and understanding of United States Pharmacopeia (USP) monographs and chapters, and International Conference on Harmonization (ICH) / Food &amp; Drug Administration (FDA) guidance documents related to analytical method transfer and validation, impurities, genotoxic impurities, early phase development, etc.</li></ul>\n\n<ul>\n<li>Solid understanding of Good Laboratory Practices (GLP) and Good Manufacturing Practices (GMP) requirements and their application in a phase appropriate manner</li></ul>\n\n<ul>\n<li>Experience in technical transfer for non-GMP and GMP production and testing to external contract organizations, manage deliverables against timelines</li></ul>\n\n<ul>\n<li>Strong communication skills and ability to provide cross-functional leadership and guidance to Chemistry, Manufacturing, and Controls (CMC) and non-clinical teams, e.g. informing and defending the Quality Target Product Profile</li></ul>\n\n<ul>\n<li>Works well in cross-functional teams, and across various geographic locations in different time zones</li></ul>\n\n<ul>\n<li>Excellent technical writing skills and attention to details in authoring methods, specifications, technical reports and regulatory filing documents</li></ul>\n\n<ul>\n<li>Experience with protein-based and live modality therapies is beneficial (monoclonal antibodies, bi/tri-specific antibodies, fusion proteins, gene therapy, etc.)</li></ul>\n\n<ul>\n<li>A self-starter and team player with strong leadership and decision-making skills, who can provide mentorship to junior staff</li></ul>\n\n<ul>\n<li>Ability to multitask, effectively plan and follow through on complex projects</li></ul>\n\n<ul>\n<li>Someone who strongly values working on and leading teams</li>\n</ul>\n\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br><br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}