{"job title": "Data Scientist - Process Development Drug Substance Technology Engineering (PD)", "company": "Amgen", "city state": "– Cambridge, Massachusetts", "rating": "3.7", "job description": "Job Description\n<br>\nThis position is part of a team providing engineering support for drug substance manufacturing at Amgen's global manufacturing network through application of process monitoring, programming, analytics, and engineering principles.\n<br><br>\nThis role will contribute to the success of Drug Substance Technology and Engineering organization by making fundamental improvements in how information is managed, business processes are operated, physical processes are controlled, and work flow is directed to efficiently achieve the integration and orchestration of all activities required for product development.\n<br><br>\nAs a Data Scientist, you will evaluate and improve Amgen's products, collaborating as part of a multi-disciplinary team of engineers on a wide range of problems. The position will bring programmatic rigor, including application of machine learning algorithms, to the challenges of drug substance development, tech transfer, and manufacturing. The Scientist will lead implementation of analytical solutions that advance global operations\n<br><br>\nTravel will be mostly domestic (minimal international) 10% of the time.\n<br><br>\n<strong>Responsibilities :</strong>\n\n<ul>\n<li>Build and prototype tools (dashboards, apps) to provide analytic insights. Develop comprehensive understanding of Amgen data structures and metrics, advocating for changes where needed for process improvements</li><li>Implement machine learning applications through integration of multiple data sources</li><li>Leverage large datasets to conduct end-to end analytics projects that include data gathering and requirements specifications, processing, analytics, ongoing deliverables, and presentations</li><li>Interact cross-functionally with a wide variety of people and teams. Work closely with engineers to identify opportunities for process design improvements for Amgen products</li><li>Make business recommendations (cost-benefit, forecasting, scenario analysis) with effective presentation of findings to multiple level of stakeholders through visualizations</li><li>Partner to implement analysis plans and optimization methods to improve the quality of Amgen's processes</li><li>Contribute to establishing a robust data science strategy by providing recommendations related to data engineering, analytic platforms, analysis plans, and other relevant areas of data science</li>\n</ul>\n\n<strong>Basic Qualifications</strong> \n<br><br>\nDoctorate degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree and 3 years of Data Science or Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 5 years of Data Science or Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nAssociate's degree and 10 years of Data Science or Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nHigh School diploma or GED and 12 years of Data Science or Scientific experience\n<br><br>\n<strong>Preferred Qualifications</strong> \n\n<ul>\n<li>MS degree in an engineering or scientific field with demonstrated capability in application of data science.</li> <li>3+ years of work experience in biotechnology role (e.g. as a statistician, statistical programmer, data analyst, data scientist, computational biologist, bioinformatician)</li><li>Experience with programming (e.g. R, MATLAB, Python) and database languages (e.g. SQL), as well as data visualization tools (e.g. Tableau, Spotfire)</li><li>Experience with statistical data analysis such as linear/non-linear multivariate models and hypothesis testing</li><li>Applied experience with implementing machine learning solutions</li><li>Experience articulating business questions and using mathematical and programmatic solutions to arrive at an answer</li><li>Demonstrated skills in selecting the right tools given a data analysis question</li><li>Demonstrated effective written and verbal communication skills</li><li>Demonstrated leadership and self-direction. Demonstrated willingness to both teach others and learn new techniques</li>\n</ul>\n\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\n<br><br>\nAmgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\n<br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}