{"job title": "Senior Associate Scientist - Oncology", "company": "Amgen", "city state": "– Thousand Oaks, California", "rating": "3.7", "job description": "Job Description\n<br>\nThe Department of Oncology Research at Amgen, Thousand Oaks is seeking a highly motivated Senior Associate Scientist to contribute to the discovery and validation of novel oncology targets with the goal of supporting the development of Amgen's next generation of innovative oncology therapeutics.\n<br><br>\nThe successful candidate will be an integral member of a dynamic research team, with an opportunity to work collaboratively with multi-disciplinary teams within Amgen's Discovery Research organization\n<br><br>\nThe successful candidate is expected to make major scientific laboratory-based contributions to the group goals, present their results in both internal and external forums, and participate in the writing of manuscripts for publication. Specific responsibilities include independently planning and performing laboratory experiments, analyzing data, and communicating results in team meetings.\n<br><br>\nBasic Qualifications\n<br><br>\nMaster's degree and 3 years of scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree and 5 years of scientific experience\n<br><br>\nPreferred Qualifications\n<br><br>\nPhD and training in cancer biology or a related field with a background in cancer biology and pathways\n<br><br>\nA strong skillset with standard cell and molecular biology experimental design and techniques (e.g. cell culture, western blotting, qPCR, immunofluorescence, immunoprecipitation, etc.)\n<br><br>\nExperience with modern techniques for assaying gene function (CRISPR or shRNA) and lentiviral production and transduction preferred. In addition, experience in target identification and validation or supporting the early stages of drug discovery\n<br><br>\nTrack record of independent critical thinking and scientific achievement, supported by a strong publication record and/or significant contributions to a drug discovery program\n<br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}