{"job title": "Senior Scientist - Pharmacokinetics &amp; Drug Metabolism", "company": "Amgen", "city state": "– Cambridge, Massachusetts", "rating": "3.7", "job description": "Job Description\n<br>\nAmgen is seeking a Neuroscience focused Senior Scientist to join the Pharmacokinetics and Drug Metabolism (PKDM) department at our Kendall Square site in Cambridge, Massachusetts.\n<br><br>\nIn this role you will provide expertise in the pharmacokinetic and drug metabolism aspects of neuroscience drug discovery and development. With proven expertise in this area you will contribute to Amgen's diverse discovery and development portfolio of therapeutic modalities including small molecules, protein biotherapeutics and other innovative strategies. You will work directly with other PKDM stakeholders at multiple Amgen research sites (Cambridge, MA, San Francisco and Thousand Oaks, CA) to influence drug discovery direction including interpretation and communication of the impact of ADME/PK/PD data on drug efficacy, safety, chemistry, protein science strategy, and clinical pharmacology planning to advance the best therapeutic candidates. In addition, this position will make meaningful and innovative contributions to the fundamental understanding of the biological factors that affect the distribution, metabolism and clearance of multiple modalities with a focus on neuroscience program support.\n<br><br>\nIn this position the core responsibilities are to:\n\n\n<ul>\n<li>Guide strategy and provide subject matter expertise for the ADME sciences with a focus on neuroscience programs within the PKDM organization in Cambridge</li>\n<li>Plan, design, and conduct fit for purpose in vitro and in vivo studies; analyze, interpret, integrate and communicate study results</li>\n<li>Devise, articulate, and implement strategies for improvement of blood brain and blood nerve barrier distribution as well as the clearance and safety properties for candidate molecules</li>\n<li>Lead the implementation of new technologies, improved processes and evaluation of new chemical and biological entities aimed at improving therapeutic options towards neuroscience drug targets</li>\n</ul>\n\nIn addition to the core responsibilities, the position provides the opportunity to pursue scientific inquiries into the distribution and metabolism of small and large molecule biotherapeutics including mechanistic studies. The role requires skills consistent with effective PKDM project team representation. A collaborative and highly capable scientific cross-site community at Amgen is available to support these efforts.\n<br><br>\n<strong><strong>Basic Qualifications:</strong></strong>\n<br><br>\nDoctorate degree &amp; 2 years of Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree &amp; 5 years of Scientific experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's degree &amp; 7 years of Scientific experience\n<br><br>\n<strong><strong>Preferred Qualifications:</strong></strong>\n<br><br>\nPh.D. in a biology, pharmaceutical science, chemistry or equivalent field of study\n<br><br>\n3+ years of drug discovery and development experience including contribution to regulatory filings\n<br><br>\nExpertise with strategies and technologies to guide chemistry and/or protein sciences towards blood brain barrier penetrating molecules\n<br><br>\nExpertise in interpretation of PK/PD/ADME data and translation to impact on program direction (e.g. influencing molecule design cycle)\n<br><br>\nCritical thinking and demonstrated ability to communicate with team members across broad disciplines\n<br><br>\nEffective oral and written communication skills\n<br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}