{"job title": "Senior Engineer - Research Data Scientist", "company": "Amgen", "city state": "– Thousand Oaks, California", "rating": "3.7", "job description": "Job Description\n<br>\n<strong>Senior Engineer - Research Data Scientist, Discovery Technologies</strong>\n<br><br>\nWorking in Amgen's Discovery Technology organization, the incumbent will be responsible for the integration of early-stage drug discovery software, equipment &amp; instruments into existing data processing workflows. The incumbent will also play a significant role in the standardization and optimization of research data analysis techniques and processing workflows, including the application of machine learning and deep-learning techniques, to resolve data processing bottlenecks. To be effective in this role, the incumbent will need to interface with research scientists, the Research Informatics team and management to implement relevant solutions.\n<br><br>\nOther duties include the development, enhancement and maintenance of software that enables transfer of research data between existing enterprise database systems, as well as the development and maintenance of software platforms to support existing and novel screening platforms (e.g. HTS, affinity mass spectrometry, microscopy-based imaging, electrophysiology, automated data QC, DNA encoded library screening).\n<br><br>\nThe incumbent will also be responsible for bridging research scientists' needs with resources that are available in Amgen's larger information technology organization. In this role, they will liaise with interdisciplinary, multinational, research-related software development project teams consisting of information technology staff, project managers, software specialists and research scientists.\n<br><br>\n<strong>Basic Qualifications</strong> \n<br><br>\nDoctorate Degree\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's Degree and 3 years of Engineering experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nBachelor's Degree and 5 years of Engineering experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nAssociate's degree and 10 years of Engineering experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nHigh school diploma/GED and 12 years of Engineering experience\n<br><br>\n<strong>Preferred Qualifications</strong> \n<br><br>\nDegree in Computer Science with successful track record in developing bioinformatics or cheminformatics software applications\n<br><br>\nTechnical skills in one or more of the following: Python, Java, C#, R programming; Databases (e.g. Oracle, SQL Server, PL/SQL); Integration frameworks (e.g. Pipeline Pilot); Data Analysis and Quality Control (e.g. Genedata Screener); Data visualization tools (e.g. Tibco Spotfire, D3); LIMS software (e.g. Titian Mosaic, BIOVIA, Core LIMS); Web development (e.g. SharePoint); Cloud-based development (e.g. AWS); Deep learning tools (e.g. nVidia DIGITS, TensorFlow).\n\n\n<ul>\n<li>5+ years successful experience working in a drug discovery-based informatics or software development environment</li>\n</ul>\n\nBroad expertise in software platforms necessary for biotechnology, automation &amp; bioinformatics research environments\n<br><br>\nKnowledge of principles in data analysis, statistics and quality control of scientific data\n<br><br>\nAttention to detail, strong mathematical &amp; quantitative analysis skills\n<br><br>\nImage Analysis and image data curation expertise (e.g. PerkinElmer Columbus / Acapella / Harmony)\n<br><br>\nAbility to participate in cross functional project teams consisting of scientists, software development engineers. Effectively represent and advocate their organizational needs and escalate issues to senior management\n<br><br>\nExcellent peer-to-peer communication skills\n<br><br>\nTime management skills, including the ability to deliver results in a timely fashion\n<br>\n<strong> Join Us</strong> \n<br><br>\n<strong>If you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.</strong>\n<br><br>\n<strong>Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancer, kidney disease, rheumatoid arthritis and other serious illnesses.</strong>\n<br><br>\n<strong>As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.</strong>\n<br>\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong>.</strong>"}