{"job title": "Data Engineer", "company": "Amherst Holdings LLC", "city state": "– Austin, TX", "rating": "3.1", "job description": "Data Engineer Austin, TX\n<br><br>\n<strong>Let us introduce ourselves:</strong>\n<br><br>\nFounded in 1993, Amherst Holdings LLC is a privately owned financial services holdings company headquartered in Austin, TX. We provide a variety of products and services for institutional clients across the globe and pursue opportunities in the capital markets leveraging our deep expertise and proprietary market leading data analytics platform. We have developed cutting edge tools and methodologies that give us the competitive edge in our securities, loan origination, and asset management lines of business.\n<br><br>\nWhat we're looking for, in a nutshell:\n<br><br>\nAs our Data Engineer you will use your broad skill set and passion for data to architect, design and develop data analytics platforms for our Single Family Buy to Rent business which will provide property level data and analytics for each property within our nationwide portfolio. In addition to designing and building data systems you will also be responsible for ETL and BI reporting systems design and providing reports and tools that allow our executives to understand the data and make critical future business decisions. This is a full-time position. Days and hours of work are Monday through Friday, 9:00 a.m. to 6 p.m. Occasional evening and weekend work may be required as job duties demand. This position will report to the Director, Data Warehousing and Business Intelligence.\n<br><br>\n<strong>A little more about this role:</strong>\n\n\n<ul>\n<li>Work with business owners, data and BI teams to build data warehouse solutions</li>\n<li>Design, modify, and implement tooling to support the data warehouse and ETL team</li>\n<li>Ability to work on multiple ETL partner/vendor integration projects</li>\n<li>Design and build data structures and processes to populate data warehouse systems using knowledge of relational and dimensional data modeling techniques</li>\n<li>Recommend alterations to designs and implementations to improve stability and security of products and/or procedures</li>\n<li>Gather and document requirements from internal customers</li>\n<li>Design and implement from those requirements</li>\n<li>Create unit tests, validation procedures, and document technical specifications.</li>\n</ul>\n\n<strong>What you'll need to have:</strong>\n\n\n<ul>\n<li>At least one programming Language: C#, .Net, VB.NET, PowerShell, Python</li>\n<li>Full Stack Development - Visual Studio 2013-2017, Net Framework 4.5, ASP.NET MVC, Team Foundation Services</li>\n<li>Web Technologies such as React, Typescript, Angular</li>\n<li>Web services - RESTful, SOAP</li>\n<li>Familiarity with AWS or Azure</li>\n<li>TSQL skills a must SQL Server 2016 or greater</li>\n<li>Familiarity with CI/CD Practices</li>\n<li>Bachelor's or Master's degree in Computer Science, Mathematics, Engineering or related field</li>\n</ul>\n\nAdditional Skills and Experience (Preferred, but Not Required)\n\n\n<ul>\n<li>Experience in financial industry is a plus. Domain knowledge of financial industry concepts: Securities, Capital Markets, Real Estate Assets etc. is desirable.</li>\n<li>Messaging technologies such as Rabbit MQ, Solace, Tibco</li>\n<li>Financial Analytics Data Providers: Bloomberg BPipe, YieldBook, Intex, Corelogic</li>\n<li>Experience with Agile Methodology and JIRA</li>\n<li>Experience with Tableau as an enterprise reporting tool or willingness to learn the basics if required</li>\n</ul>\n\n<strong>What we offer:</strong>\n<br><br>\nAmherst is a privately held corporation located in West Austin with beautiful views of Lake Austin and the loop 360 bridge in a modern workspace with open floor plans.\n\n\n<ul>\n<li>A competitive compensation package, annual bonus, 401k match</li>\n<li>Flexible PTO, 11 paid holidays, accrued sick/personal time</li>\n<li>Employer paid benefits (medical, dental, vision, health savings account)</li>\n<li>Professional career development and reimbursement</li>\n<li>On-premise fitness center, locker rooms</li>\n<li>Daily catered lunches, fully stocked kitchen with snacks/drinks</li>\n<li>Relaxed casual environment and weekly/quarterly office events!</li>\n</ul>"}