{"job title": "Senior Data Scientist - Causal Inference", "company": "Amplitude", "city state": "– San Francisco", "rating": "4.7", "job description": "<div>At Amplitude, we are creating the next generation of analytics to help companies build better products. Were the platform of choice for top product teams around the world, empowering a scientific approach to decision-making and defining the future of how companies interact with data. To continue our exponential growth, we are seeking a skilled and passionate Senior Data Scientist to help us democratize access to deep insights about user experience and behavior. </div><div><br></div><div>As a member of our fast-moving Product and Engineering team, you will play a central role in building products for causal inference, experiment evaluation, user segmentation, and predictive analysis. Your expert guidance on data mining methods will directly shape our product and what we do to unearth patterns in customers data.</div>Responsibilities<ul><li>Partner with product managers, designers, and engineers to prototype and productionize data mining features that reveal interpretable and actionable information about product usage</li><li>Advise on best practices and statistical methods for evaluating and measuring experiments</li><li>Build and test predictive systems for calculating user propensity traits (e.g. likelihood to perform a given action, churn, lifetime value, etc.)</li><li>Communicate and teach the complications of causal inference without randomized experiments to the eager-to-learn product development team</li><li>Contribute thought leadership to the community by helping to create external-facing guides, blog posts, and explanatory materials on (1) advanced data-mining techniques such as clustering, correlation/ regression, and predictive analytics, and (2) designing, measuring, and judging product experiments</li></ul>Qualifications<ul><li>Graduate degree in Statistics, Mathematics, Biostatistics/informatics, Econometrics, Physics, or related field </li><li>5+ years in industry in a product data science role with proven track record of causal inference, experiment evaluation, and modeling projects</li><li>2+ years experience with machine learning for predictive applications</li><li>Advanced knowledge of experimentation and statistical methods </li><li>Strong programming skills in Python or R</li><li>Experience as a project lead on a data product</li><li>Exemplary communication skills</li><li>Experience with a distributed data processing technology (Spark, Hive, Pig, Presto, Impala, etc.) is a plus</li></ul><div><b>About Amplitude</b></div><div><br></div><div>At Amplitude, were on a mission to help product teams understand their users behavior so that they can build better products. Weve built a product analytics platform that enables anyone, regardless of analytics experience, to listen to what their users are telling them through user behavior.</div><div><br></div><div>Founded in 2012, Amplitude is located in San Franciscos SOMA neighborhood, and we are backed by IVP, Battery Ventures, Benchmark Capital, and Y Combinator. You can learn more about our team, culture, and environment athttps://amplitude.com/careers.</div><div><br></div><div>Amplitude provides equal employment opportunities (EEO). All applicants are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.</div><div><br></div><div>#LI-DJ1</div>"}