{"job title": "Data Scientist - Marketing", "company": "Amplify Professional Services", "city state": "– Irvine, CA", "rating": "NA", "job description": "Job Description<div><strong>DATA SCIENTIST for the Marketing team</strong>\n<br><br>\nOur client is a very well-known and super fast-growing retail organization in the beauty, fashion and spa industry. This is a fun, colorful, exciting and highly entrepreneurial work environment.\n<br><br>\nIf you have a passion for progressive analytics techniques, leading projects focused on optimizing marketing effectiveness and driving marketing innovation, while using analytics to drive brand results, then this company is the place for you!\n<br><br>\n<strong>FTE position - $85– 95K DOE + bonus</strong>\n<br><br>\nThe position requires work with:\n<ul>\n<li><strong>Data Mining</strong> </li><li><strong>Predictive Modeling</strong></li><li><strong>Test/Learn Analytics</strong></li><li><strong>Customer Glidepath and Audience Management</strong></li><li><strong>Mixed Media Modeling Emphasis</strong></li>\n</ul>\n<strong>QUALIFICATIONS</strong>\n<ul>\n<li><strong>2-5 years of directly related experience and strong proficiency of predictive modeling techniques, test/learn, customer segmentation and mixed media modeling</strong>.</li><li>Proficiency in SQL and at least one of the following: SAS, R, and/or Python.</li><li>Superior research, statistical, analytical, processing and mathematical skills with ability to structure and conduct analyses.</li><li>Knowledge of digital marketing principles such as funnel optimization, UX, SEO &amp; Landing Page optimization &amp; experience in running A/B tests for campaigns and deriving customer insights.</li><li>Successful track record of applying complex analytics techniques in a retail company, ecommerce or consumer brand.</li><li>Work with new analytics techniques and software tools to improve work quality.</li><li>Strong verbal and written communication skills; ability to present complex information in an easy-to-understand manner with clear recommendations based on data insight.</li><li>Adaptability and the capability of multi-tasking and strong time management skills</li>\n</ul>\n<strong>EDUCATION</strong>\n<ul>\n<li>Bachelor’s degree in mathematics, business, statistics, economics, computer science or equivalent combination of education and experience.</li>\n</ul>\n<strong>CLIENT IS READY TO HIRE</strong>\n<br><br>\n<strong>Must be local to Irvine California</strong>\n<br><br>\n<strong>References and background check required at time of offer</strong>\n<br><br>\nThank you for applying,\n<br><br>\nAmplify Professional Services</div>Company Description<div>Amplify Professional Services specializes in Information Technology and Accounting staff augmentation, consulting and search services.\n<br><br>\nAmplify handles all searches from the top Executive-level down, using retained, contract, and direct hire structures that fit any company's needs and budget.\n<br><br>\nFor some clients, we are the outsourced technical recruiting department handling all direct hire and contract staffing requirements.\n<br><br>\nOur successful recruiting experience allows us to quickly identify top IT talent including Directors, Project Managers, Applications Developers, Infrastructure, WEB, ERP and more for your team.</div>"}