{"job title": "Senior Research Scientist - Extractable, Leachable &amp; Impurities Department", "company": "AMRI", "city state": "– US-NY-Albany", "rating": "2.8", "job description": "<div>\n<h1>Senior Research Scientist in Albany, NY</h1>\n<div>AMRI provides global contract research and manufacturing services to the pharmaceutical and biotechnology industries. </div>\n<div> </div>\n<div>The Senior Research Scientist is an integral part of the AMRI team, contributing to our success by designing, developing, validating and implementing analytical or bioanalytical procedures utilizing various types of mass spectrometers. </div>\n<div> </div>\n<div> </div>\n<div>Join our talented workforce, where a commitment to excellence and a customer focused attitude is everything. We pursue excellence because our work has the power to improve patients’ lives with the pharmaceuticals we develop and manufacture. </div>\n<h1>In this role, you will: </h1>\n<ul>\n<li>\n<div>Perform complex laboratory analysis of pharmaceutical products and proficiently use various LC-MS(/MS) instrumentation, calculate and analyze data and record data in adherence with AMRI SOP's and the industry practice.</div></li>\n<li>\n<div>Act as the major individual contributor or analytical leader on multiple projects, including interacting with clients, reviewing and evaluating data, and writings analytical or bioanalytical reports and protocols.</div></li>\n<li>\n<div>Collaborate with peer scientists on impurity identification activities if needed.</div></li>\n<li>\n<div>Develop and validate LC-MS based analytical methods for trace organic compounds, for example extractables/leachables and genotoxic impurities, to support drug substance and drug product release.</div></li></ul></div>\n<p><b></b> </p>\n<div><b>Required</b></div>\n<div><b> </b></div>\n<ul>\n<li>\n<div>Ph.D. in Analytical or Bioanalytical Chemistry, or other applicable natural science field OR; Master’s degree and three years of relevant experience OR; Bachelor’s and five years of relevant experience.</div></li>\n<li>\n<div>Chemical Hygiene training</div></li></ul>\n<div><b> </b></div>\n<div><b> </b></div>\n<div><b>Preferred</b></div>\n<div><b> </b></div>\n<ul>\n<li>\n<div>High Resolution Accurate Mass experience</div></li>\n<li>\n<div>2 to 5 years’ experience in method development of LC-MS(/MS) assays for small molecule bioanalysis in biological samples or trace organic analysis in pharmaceutical products or environmental samples in a regulated environment (e.g., GMP, GLP and GCP.)</div></li>\n<li>\n<div>Experience in biological sample preparation, including LLE, SPE, protein precipitation, etc., is a plus.</div></li>\n<li>\n<div>Familiarity with Waters UPLC-MS system and related software (Empower, Masslynx), Thermo Orbitrap or triple quad systems (TraceFinder, Xcalibur and LCquan software) is a strong plus. </div></li>\n<li>\n<div>Strong Project Management skills are desirable.</div></li>\n<li>\n<div>Relevant expertise in data mining and database development to enhance analytical screening methods for trace compound detection and identification is a strong plus. </div></li></ul>\n<div><b> </b></div>\n<div><b><em> </em></b></div>\n<div><em>All interested applicants must apply online. AMRI is an Equal Opportunity Employer, we value diversity and inclusiveness. Minorities/females/veterans/individuals with disabilities/sexual orientation/gender identity are encouraged to apply.</em></div>"}