{"job title": "Associate Scientist 3, Fermentation", "company": "Amyris", "city state": "– Emeryville, CA", "rating": "4.0", "job description": "<strong>Associate Scientist 3, Fermentation\n<br>\nTuesday – Saturday 10:00AM-6:30PM</strong>\n<br><br>\nThe Associate Scientist 3 will design and execute fermentation experiments in support of our R&amp;D deliverables. The successful candidate will contribute toward strain and process improvement in a fast paced, team- oriented research operations setting.\n<br><br>\n<strong>Responsibilities</strong>:\n<br><br>\nTechnical Lead (30%)\n\n\n<ul>\n<li>Understand Operations’ deliverables and execution strategy</li>\n<li>Lead continuous improvement efforts aimed at increasing lab effectiveness</li>\n<li>Ensure current state of work flow is documented by drafting and revising SOPs and work protocols.</li>\n<li>Collaborate on experimental design and sample analysis.</li>\n<li>Represent Fermentation data in project team meetings, R&amp;D forums and collaboration reports.</li>\n</ul>\n\nOperations (70%)\n\n\n<ul>\n<li>Set up and operate bench-scale bioreactors and associated software.</li>\n<li>Carry out microbial fermentations using various strains, feedstocks, and protocols.</li>\n<li>Sample bioreactors and prepare samples for further analysis.</li>\n<li>Evaluate and maintain fermentation data in the databases.</li>\n<li>Troubleshoot laboratory failures and implement corrective actions.</li>\n<li>Apply organizational and creative skills to improve lab operations.</li>\n<li>Provide input for quality and efficiency improvement opportunities.</li>\n<li>Maintain safe practices and work environment.</li>\n<li>Other duties as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>:\n\n\n<ul>\n<li>BA/BS in biology, life sciences, chemistry, chemical engineering, biochemical engineering or related field.</li>\n<li>5 years of experience in a Biological laboratory, Fermentation experience preferred.</li>\n<li>Familiarity with concepts in statistics, tools to analyze data (JMP, Minitab, R, Spotfire) and quality principles such as 5S and Lean.</li>\n<li>Strong communication and teamwork skills.</li>\n<li>Capability to manage multiple independent processes and experiments within a single day including scheduling instrumentation and preparing reagents and material.</li>\n<li>Attention to detail and careful record keeping skills.</li>\n<li>Working in cross-disciplinary, collaborative teams</li>\n<li>Tenacity in pursuing objectives to completion correctly and on time.</li>\n<li>Weekend work is mandatory. Occasional overtime is required.</li>\n<li>Embrace Amyris Core Values.</li>\n</ul>\n\nAmyris, a leader in industrial synthetic biology, uses its innovative bioscience solutions to achieve renewable products by converting plant sugars into hydrocarbon molecules. Amyris’ molecules are used in wide range of specialty &amp; performance chemicals, flavors &amp; fragrances and in applications ranging from cosmetics to biofuels. Learn more at www.amyris.com.\n<br><br>\nAs a VEVRAA Federal Contractor, Amyris is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. Amyris complies with applicable state and local laws governing nondiscrimination in employment.\n<br><br>\nIf you are a recruiter or placement agency, please do not submit resumes to any person or email address at Amyris, Inc. prior to having a signed agreement. Amyris is not liable for and will not pay placement fees for candidates submitted by any agency other than its approved recruitment partners. Furthermore, any resumes sent to us without an agreement in place will be considered your company’s gift to Amyris and may be forwarded to our recruiters for their attention.\n<br><br>\nFor a full list of our current openings, please visit our website .\n<br><br>"}