{"job title": "Scientist 2, Enzyme Engineering", "company": "Amyris", "city state": "– Emeryville, CA", "rating": "4.0", "job description": "<strong>Scientist 2, Enzyme Engineering</strong>\n<br><br>\nWe are seeking a Scientist to join our enzyme engineering group. The Scientist will work on the identification and engineering of bottleneck enzymes in microbial metabolic pathways. She or he will provide technical expertise, particularly in the area of applying bioinformatics, structural biology, molecular modeling, directed evolution, and machine learning to protein engineering, to help accelerate engineering of key enzymes with improved properties. The Scientist is expected to be an integral part of a multi-disciplinary team focused on improving the performance of microbes to deliver sustainable solutions for a growing world. He or she will also contribute to the continued advancement of enzyme engineering technologies and to training more junior scientists and associates.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Apply protein engineering principles and techniques to solve metabolic bottlenecks in the engineering of highly efficient microbial strains (“cell factories”)</li>\n<li>Routinely design and execute complex experiments in enzymology and protein engineering, including design and construction of protein diversity libraries, directed evolution, and screening</li>\n<li>Provide bioinformatics and machine learning expertise for enzyme engineering</li>\n<li>Develop next generation of enzyme engineering technologies</li>\n<li>Maintain records, analyze, and report on experimental design and results within and between scientific teams</li>\n<li>Contribute to the company’s intellectual property portfolio, scientific presentations, and publications</li>\n<li>Maintain safe practices and work environment</li>\n</ul>\n\nMembers of the enzyme engineering group need to be knowledgeable in enzymology, protein biochemistry, molecular biology, and microbiology, and should be creative, organized, energetic, collaborative, and self-motivated.\n<br><br>\n<strong>Skills and Requirements:</strong>\n<br>\nWe favor candidates with formal technical training (Ph.D. or equivalent experience) in biology, molecular biology, biochemistry, or chemistry. We prefer candidates with a demonstrated track record of enzyme improvement.\n<br><br>\nStrong candidates will have skills or traits in some or all of the following areas:\n\n\n<ul>\n<li>Deep understanding of protein library design and statistical analysis of experimental data</li>\n<li>Extensive experience in applying novel bioinformatics methods and modern machine learning techniques for directed evolution of enzymes</li>\n<li>Knowledge of enzyme mechanisms and chemistry of metabolic pathways</li>\n<li>Experience in in vitro and in vivo enzyme assay development and characterization of enzyme kinetics</li>\n<li>Self-motivated, strong desire to succeed, and an innovative growth mindset</li>\n<li>Excel in a team environment with excellent interpersonal skills and communications skills, and effectively collaborate with others</li>\n<li>Excellent analytical and organizational skills</li>\n<li>Proficiency in writing and oral presentations</li>\n</ul>\n\nAmyris, a leader in industrial synthetic biology, uses its innovative bioscience solutions to achieve renewable products by converting plant sugars into hydrocarbon molecules. Amyris’ molecules are used in wide range of specialty &amp; performance chemicals, flavors &amp; fragrances and in applications ranging from cosmetics to biofuels. Learn more at www.amyris.com.\n<br><br>\nAs a VEVRAA Federal Contractor, Amyris is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. Amyris complies with applicable state and local laws governing nondiscrimination in employment.\n<br><br>\nFor a full list of our current openings, please visit our website .\n<br><br>"}