{"job title": "Scientist 1, Biology Strain Engineering", "company": "Amyris", "city state": "– Emeryville, CA", "rating": "4.0", "job description": "<strong>Scientist 1, Biology Strain Engineering</strong>\n<br><br>\nAmyris is seeking a Scientist to engineer and optimize microbes for industrial fermentations to deliver sustainable solutions for a growing world. The Scientist will join a team of researchers utilizing the world’s most advanced high-throughput automated strain engineering and testing platform. The successful candidate will formulate hypotheses, interpret data, and design, build, and test microbial strains and enzymes to improve strain performance (i.e., conversion of sugar into target molecules) in industrial fermentation conditions.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Delve though scientific literature and historical data to identify new hypotheses to improve strain performance</li>\n<li>Design strains, experiments, and screens to understand and remove barriers to high strain performance</li>\n<li>Work with the automated strain engineering, high-throughput screening, analytical chemistry, and fermentation groups to build and test engineered strains</li>\n<li>Analyze data from phenotype tests and use knowledge of metabolism to design additional sets of DNA designs (i.e., genotypes) for the next round of strain engineering; work with bioinformatics/AI group to deepen human and machine learning from large datasets</li>\n<li>Manage and coordinate complex experimental schedules within a broader team</li>\n<li>Maintain safe practices and work environment</li>\n<li>Mentor, train, and possibly manage more junior scientists</li>\n</ul>\n\n<strong>\n<br>\nQualifications</strong>\n<br>\nWe favor candidates with formal technical training (Ph.D. or equivalent experience) in metabolic engineering, microbiology, molecular biology, biochemistry, chemistry, chemical engineering or related field. We prefer candidates with a history of successfully engineering metabolism or signaling, and iteratively improving strain performance. Previous experience in the field of microbial genome engineering and/or synthetic biology is a plus. We prefer Scientists with experience in some or all of the following areas:\n\n\n<ul>\n<li>Familiarity with cellular physiology and metabolism in a variety of eukaryotic and prokaryotic microbes</li>\n<li>Familiarity with cellular processes involved in small molecule production, including redox balance, energetics, product transport, growth rate, fermentation conditions, overflow metabolism, etc.</li>\n<li>Familiarity with enzymology and protein engineering</li>\n<li>Familiarity with molecular biology techniques including PCR, restriction digest analysis, DNA assembly methods, plasmid construction, DNA sequence analysis, nuclease-triggered DNA recombination, and microbial transformation (in bacteria and/or yeast)</li>\n<li>Familiarity with concepts in statistics and tools to analyze data (Excel, Minitab, R, Spotfire)</li>\n<li>Experience working in cross-disciplinary, collaborative teams</li>\n</ul>\n\nAmyris, a leader in industrial synthetic biology, uses its innovative bioscience solutions to achieve renewable products by converting plant sugars into hydrocarbon molecules. Amyris’ molecules are used in wide range of specialty &amp; performance chemicals, flavors &amp; fragrances and in applications ranging from cosmetics to biofuels. Learn more at www.amyris.com.\n<br><br>\nAs a VEVRAA Federal Contractor, Amyris is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. Amyris complies with applicable state and local laws governing nondiscrimination in employment.\n<br><br>\nIf you are a recruiter or placement agency, please do not submit resumes to any person or email address at Amyris, Inc. prior to having a signed agreement. Amyris is not liable for and will not pay placement fees for candidates submitted by any agency other than its approved recruitment partners. Furthermore, any resumes sent to us without an agreement in place will be considered your company’s gift to Amyris and may be forwarded to our recruiters for their attention.\n<br><br>\nFor a full list of our current openings, please visit our website .\n<br><br>"}