{"job title": "Associate Scientist 2, Chromatography", "company": "Amyris", "city state": "– Emeryville, CA", "rating": "4.0", "job description": "<strong>Associate Scientist 2, Chromatography</strong>\n<br><br>\nAmyris is looking for a local, experienced, self-motivated individual to work in the Screening and Analytics department (SCAN), helping the Chromatography group, operationalizing, optimizing and running high-throughput assays. This will involve working with closely with our fermentation, biology, process development and scientific computing groups to develop and implement assays that answer questions as efficiently as possible.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Working hands-on using and troubleshooting GC, LC and IC systems, which includes replacement of consumables and mobile phase/eluent preparation as well as set-up or modification of equipment</li>\n<li>Transferring newly developed assays into an operational setting, which will include standard preparations and calibration assessments</li>\n<li>Running routine samples to acquire and process data with tight turnaround times</li>\n<li>Answering data related questions and explaining results to customers as needed</li>\n<li>Regular evaluation and documentation of the performance of active methods</li>\n<li>Sharing your finding by giving presentations to internal audiences as well as writing up findings, results and/or established procedures in form of research reports, technical notes or SOPs</li>\n</ul>\n\n<strong>Required Qualifications</strong>\n\n\n<ul>\n<li>Bachelor’s or Master’s degree in Chemistry/Biology/Statistics/Engineering or related discipline</li>\n<li>2+ years of experience working in a fast-paced laboratory setting</li>\n<li>Ability to swiftly adapt to new software as well as previous experience using chromatography software</li>\n<li>Exceptional organizational and interpersonal as well as time-management skills, high degree of flexibility</li>\n<li>Ability to take initiative and work efficiently and productively in a start-up company environment</li>\n<li>Analytical thinking skills, creativity, resourcefulness, good intuition for problem solving</li>\n<li>Ability to work overtime and weekend hours as needed</li>\n<li>Familiarity with GC, HPLC/UPLC, IC and other laboratory instruments</li>\n<li>Experience shepherding analytical methods from development to operations</li>\n<li>Familiarity using basic laboratory tools such as balances, volumetric glassware, pipettes, etc.</li>\n<li>Excellent written and verbal skills</li>\n<li>Embrace Amyris Core Values</li>\n<li>Adherence to Amyris Safety Policies and Procedures</li>\n</ul>\n\n<strong>Desired Qualifications</strong>\n\n\n<ul>\n<li>Ion chromatography experience</li>\n<li>Hands-on development experience in selection and evaluation of measurement techniques, experimental design, sample preparation/extraction, and optimization of chromatographic conditions for small molecule characterization/quantification</li>\n<li>High mechanical aptitude – demonstrated ability to understand, maintain, troubleshoot and repair instruments</li>\n<li>Scientific writing and presentation skills for the preparation of technical reports, SOPs and presentations</li>\n<li>Experience working with or implementing 5S or other organizational efficiency system</li>\n<li>Experience with statistical analysis of large data sets, particularly with JMP and Spotfire</li>\n</ul>\n\nAmyris, a leader in industrial synthetic biology, uses its innovative bioscience solutions to achieve renewable products by converting plant sugars into hydrocarbon molecules. Amyris’ molecules are used in wide range of specialty &amp; performance chemicals, flavors &amp; fragrances and in applications ranging from cosmetics to biofuels. Learn more at www.amyris.com.\n<br><br>\nAs a VEVRAA Federal Contractor, Amyris is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. Amyris complies with applicable state and local laws governing nondiscrimination in employment.\n<br><br>\nIf you are a recruiter or placement agency, please do not submit resumes to any person or email address at Amyris, Inc. prior to having a signed agreement. Amyris is not liable for and will not pay placement fees for candidates submitted by any agency other than its approved recruitment partners. Furthermore, any resumes sent to us without an agreement in place will be considered your company’s gift to Amyris and may be forwarded to our recruiters for their attention.\n<br><br>\nFor a full list of our current openings, please visit our website .\n<br><br>"}