{"job title": "Data Scientist - DB Analytics &amp; Data Science", "company": "Anadarko Petroleum", "city state": "– Midland, TX", "rating": "3.8", "job description": "<div><strong>Job Summary</strong>\n<br>\nAnadarko is searching for a statistically focused Data Scientist in the Midland, TX location. The Data Scientist will work closely with domain experts (including engineers and geologists) and data management team members, in applying Statistics and Data Science techniques towards solving key business problems. The Data Scientist will also work with the centralized Advanced Analytics &amp; Emerging Technology organization, including the Data Science &amp; Advanced Analytics team, in applying Advanced Analytic and Technology solutions towards solving key business problems.\n<br><br>\nWorks as a key part of cross-functional teams with various internal customer groups to model and deploy data analytics, data mining, algorithm development and technical solutions. Leverages business acumen to identify, address and resolve a variety of complex business issues and opportunities. Applies advanced analytics, machine learning, and statistical techniques to data to identify areas where the business can gain a competitive edge. Leverages big data to discover patterns and solve strategic and tactical analytic business problems using massive structured and unstructured data sets across several environments. Manages the design and development of data workflows and processes, technical solutions and statistical processes. Prepares and presents analysis and results to internal decision making audiences, often creating novel and innovative business metrics and solutions to inform and influence senior leadership<strong>.</strong>\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>2+ years of experience is required</li>\n\n<li>High level of enthusiasm and a love of data</li>\n\n<li>Knowledge of advanced Statistical and Data Science techniques, including Regression, ANOVA, Multivariate Analysis, Neural Networks, Machine Learning, Data Mining, and Design of Experiments</li>\n\n<li>Knowledge of statistical software packages such as R, Python, SPSS, SAS, MATLAB, and Stata</li>\n\n<li>Knowledge of BI visualization packages such as Spotfire, Tableau, Power BI, and MS BI</li>\n\n<li>Ability to formulate and develop advanced discipline concepts in carrying out assignments.</li>\n\n<li>Under minimal supervision, applies advanced aspects of professional discipline; makes recommendations on proposals, analyses and budgets; selects contractors/services, as applicable</li>\n\n<li>Demonstrated ability to produce results and meet economic goals</li>\n\n<li>Has strong active interest in latest technology and shares technical knowledge with others</li>\n\n<li>Demonstrates a strong logical approach to risk decision making</li>\n\n<li>Ability to quickly adapt and work within multiple teams</li>\n\n<li>Awareness of and demonstration of Anadarko’s Core Values</li>\n\n<li>Ability to prepare and present the results of research and analysis, verbally and in writing</li>\n\n<li>Detail oriented with excellent organizational skills</li>\n\n<li>Has detailed experience within own discipline and has working knowledge of other disciplines as a result of teamwork with other employees.</li>\n</ul>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Perform Statistical and Predictive Analysis of data to understand relationships and determine key drivers.</li>\n\n<li>Develop Statistical and Predictive Models to describe and explain performance, and to identify best practices.</li>\n\n<li>Leverage Data Mining and Analysis strategies to understand, describe, and QC data.</li>\n\n<li>Effectively communicate analysis and findings with team members, to generate discussion and increase understanding.</li>\n\n<li>Typically responsible for planning and completion of projects, including resource coordination.</li>\n\n<li>Takes multidisciplinary approach to projects that involve a high degree of interaction between departments, using own experience and outside sources.</li>\n\n<li>Develops, refines and implements value additions and quality in teams.</li>\n\n<li>Volunteers to assist others within own business asset on projects or issues.</li>\n\n<li>Takes a leadership role to ensure understanding and application of all company environmental, health and safety policies and principles.</li>\n\n<li>Consistently completes projects and recommendations in a timely and thorough manner.</li>\n\n<li>Works independently, making most decisions and referring major exceptions to management.</li>\n\n<li>Initiates objectives and strategies for review.</li>\n\n<li>Applies knowledge and experience to solve very complex problems using relevant information sources, including other departments.</li>\n\n<li>May recommend changes to procedures as situation dictates.</li>\n\n<li>Critically analyzes projects generated by others, integrates other disciplines, and is able to identify key elements of a project.</li>\n</ul>\n<strong>Education</strong>\n<br>\nBachelor’s Degree required (Master’s Degree preferred) in Data Science, Statistics, Applied Mathematics, Computer Science, Engineering, Geoscience, Physics, Information Technology or related field\n<br><br>\n<strong>Relocation</strong>\n<br>\nThis position may be eligible for domestic relocation\n<br><br>\n<strong>Travel Requirements</strong>\n<br>\nThe percentage of travel required for this position is 0 - 10%\n<br><br>\n<strong>Work Schedule</strong>\n<br>\nThis position is eligible for the 9/80 work schedule\n<br><br>\n#LI-AP1<br>\n<div>\n<div>\n<div>Equal Employment Opportunity\n<br><br>\nAnadarko Petroleum Corporation is an equal opportunity employer committed to diversity in recruiting, hiring, developing, compensating and promoting applicants and / or employees. All employment decisions are made without regard to sex, race, color, religion, national origin, citizenship, age, disability, marital or veteran status, sexual orientation, gender identity or expression, or any other legally protected categories. This includes providing reasonable accommodation for employee’s and applicant’s disabilities or religious beliefs and practices.\n<br><br>\nAnadarko Petroleum Corporation is an Equal Opportunity Employer that complies with the laws and regulations set forth in the following 'Equal Employment Opportunity Is The Law' Poster.</div>\n</div>\n</div>\n</div>"}