{"job title": "Data Scientist – Machine Learning Engineer", "company": "Anadarko Petroleum", "city state": "– The Woodlands, TX", "rating": "3.6", "job description": "<div><strong>Job Summary</strong>\n<br><br>\nAnadarko is searching for a technically strong Data Scientist specializing in Machine Learning Engineering, to be a part of Anadarko’s centralized Advanced Analytics &amp; Emerging Technology (AAET) organization located in The Woodlands, TX. The AAET serves as a centralized innovation and excellence organization responsible for identifying and developing Advanced Analytics and Emerging Technologies which provide differentiating capabilities across Anadarko’s business. As part of the Data Science &amp; Advanced Analytics team, the Data Scientist specializing in Machine Learning Engineering will bring their expertise in Data Science and Software Engineering to play, through the implementation and scaling of our Data Science prototypes in production.\n<br><br>\nThe business problems Anadarko’s looking to solve in the Artificial Intelligence and Machine Learning space are very diverse and challenging, and we’re looking for experts in this domain who can help drive our AAET efforts. The AAET is a cross-functional organization with many domain experts Petroleum Engineering and the Geosciences, along with a large organization of talented and diverse Data Scientists, Data Engineers, and Software Developers. The organization was created in 2016 as a direct result of Anadarko’s CEO and Board of Directors understanding the value that Advanced Analytics can have on the company’s business. We’re interested in individuals who enjoy a collaborative environment working on many high profile and challenging projects, and who are interested in learning a great deal from each other as we work these projects. We’re looking for innovative, energetic, eager, productive, and humble individuals who demonstrate Anadarko’s Core Values in the application of Data Science and Advanced Analytics on each project.\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>0 years of experience is required</li>\n\n<li>High level of enthusiasm and a love of data</li>\n\n<li>Strong interest and desire to work in the space between Data Science Research and Software Development</li>\n\n<li>Strong programming and scripting skills, with languages such as Python, R, C++, Java, and C#</li>\n\n<li>Strong experience with modern ML and Data Science libraries including Pandas, Numpy, Scikit-Learn, NLTK, Seaborn, Keras, Dplyr, GGPlot2, and Shiny</li>\n\n<li>Experience implementing AI &amp; ML prototypes into production</li>\n\n<li>Excellent understanding of machine learning techniques and algorithms, such as k-NN, Neural Networks, GBM, Decision Forests, etc.</li>\n</ul>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Serve as the bridge between Data Science (including AI Research) and DevOps/DataOps, to bridge the gap between Prototype development and Scalable Production applications</li>\n\n<li>Working with our Data Science team (including AI Research) in the medium to advanced stages of Prototype Development, to understand the algorithms and efforts, and begin working alongside of them and assisting/preparing for handoff</li>\n\n<li>Leveraging advanced technologies (including Google Cloud Platform) to scale Prototypes</li>\n\n<li>Refactoring the DS Prototypes as needed and ensuring proper coding standards and structures are implemented (coordinating with DevOps and DataOps)</li>\n\n<li>Developing proper Unit Test frameworks for AI &amp; ML, and provide high level documentation</li>\n\n<li>Communicating appropriate Software Dev / Technology best practices back to Data Science (including AI Research), to improve learning and future capabilities</li>\n</ul>\n<strong>Education</strong>\n<br><br>\nBachelor’s Degree required (Master’s Degree and/or PhD strongly preferred) in Computer Science, Computer Engineering, Industrial Engineering, or related field\n<br><br>\n<strong>Relocation</strong>\n<br><br>\nThis position is not eligible for domestic relocation.\n<br><br>\n<strong>Travel Requirements</strong>\n<br><br>\nThe percentage of travel required for this position is 0 - 10%\n<br><br>\n<strong>Work Schedule</strong>\n<br><br>\nThis position is eligible for the 9/80 work schedule.<br>\n<div>\n<div>\n<div>Equal Employment Opportunity\n<br><br>\nAnadarko Petroleum Corporation is an equal opportunity employer committed to diversity in recruiting, hiring, developing, compensating and promoting applicants and / or employees. All employment decisions are made without regard to sex, race, color, religion, national origin, citizenship, age, disability, marital or veteran status, sexual orientation, gender identity or expression, or any other legally protected categories. This includes providing reasonable accommodation for employee’s and applicant’s disabilities or religious beliefs and practices.\n<br><br>\nAnadarko Petroleum Corporation is an Equal Opportunity Employer that complies with the laws and regulations set forth in the following 'Equal Employment Opportunity Is The Law' Poster.</div>\n</div>\n</div>\n</div>"}