{"job title": "Bioinformatics Data Scientist Manager", "company": "Ancestry", "city state": "– San Francisco", "rating": "3.0", "job description": "Job Description<div>Ancestry is looking for an innovative Bioinformatics Manager of Genomic Technologies to join our DNA Science team. In this influential role, you will analyze DNA data, working closely with laboratory scientists, population geneticists, and data scientists to build scalable high throughput genomics laboratories for Ancestry’s products. You have extensive hands-on experience using distributed computing systems to analyzing large DNA datasets in a multi-disciplinary team environment. You are equal parts Bioinformatics Scientist and people manager: you are interested in combining your scientific knowledge and management skills to develop technologies for one of the highest volume genomics laboratories in the world.\n<br><br>\n<strong>What you will do</strong>\n<ul>\n<li>Lead team of Bioinformatics Scientists who analyze genomic data to develop and optimize high-throughput laboratory technologies for Ancestry’s direct-to-consumer genomic tests</li><li>Build and maintain genomic algorithms and databases to support analyses. Work with engineering teams to transition workflows to production</li><li>Continuously improve Ancestry’s products by contributing scientific, technical, and project planning expertise</li><li>Build a high performing team of Bioinformatic Scientists. Manage team development including technical mentorship, career development, and integration with project teams</li><li>Cultivate open communication and collaborative working environment with partner teams. Interact with external collaborators.</li><li>Participate in executing data lifecycle policies for data storage, usage, and analysis</li><li>This is a hands-on technical and people management role</li></ul></div>\n<br>\nQualifications<div>\n\n<ul>\n<li>Ph.D. in Bioinformatics, Biostatistics, Computer Science, Biomedical engineering or equivalent training</li><li>Experience managing high performing data science teams in a biotech, pharma, or genomics environment. Typically obtained with 1+ years leadership experience. Able to deliver results with an emphasis on quality and scientific rigor</li><li>Extensive hands-on experience analyzing data from genomic technologies such as genotyping arrays or next generation sequencing. Prior hands on laboratory experience desirable</li><li>Strong communication, data presentation, and documentation skills. Able to communicate scientific results to both technical and non-technical audiences</li><li>Experience working with large genomic datasets in a distributed Unix environment using Python, R, Python, C/C++, SQL, and source code control tools such as git. Comfortable working in cloud environments</li><li>Expertise using Bioinformatics tools, data qc, and statistical methods to analyze genomic data. Knowledge of publicly available genomic databases</li><li>Able to integrate and apply feedback in a professional manner</li></ul></div>\n<br>\nAdditional Information<div>Helping people discover their story is at the heart of ours. Ancestry is the largest provider of family history and personal DNA testing, harnessing a powerful combination of information, science and technology to help people discover their family history and stories that were never possible before. Ancestry’s suite of products includes: AncestryDNA, AncestryProGenealogists, Fold3, Newspapers.com, Find a Grave, Archives.com, and Rootsweb.\n<br><br>\nWe offer excellent benefits and a competitive compensation package. For additional information, regarding our benefits and career information, please visit our website at http://ancestry.com/careers<em>. (REF993M)</em>\n<br><br>\n<em>IND2</em>\n<br><br>\n<em>#LI-Post</em>\n<br><br>\n<em>#GDSponsored</em></div>"}