{"job title": "Data Analyst", "company": "AnchorFree Inc.", "city state": "– Redwood City, CA", "rating": "3.8", "job description": "<strong>Data Analyst</strong>\n<br>\nAt AnchorFree, our mission is to provide secure access to the world's information for every person on the planet. Founded in 2005 by David Gorodyansky and Eugene Malobrodsky, AnchorFree has grown into a service with millions of users in nearly 200 countries. Our flagship product, Hotspot Shield, is Top 100 in the App Store and enables freedom to access all of the Internet's information from anywhere in the world (without restrictions). AnchorFree has recently closed a $295 million investment led by WndrCo and Accel Partners, with further development plans for Hotspot Shield and other products in our suite.\n<br><br>\nThis role is a part of our Data Analytics team, building data infrastructure, processes, and tools to maximize customer happiness, team happiness, revenue and operational efficiency.\n<br><br>\nWe are looking for talented data analysts to join our team. The ideal candidate is data curious, detail oriented, great at communication, and loves solving problems.\n<br><br>\n<strong>You will:</strong>\n\n<ul>\n<li>Create and maintain health metrics and dashboards</li> \n\n<li>Develop compelling dashboards to measure the impact of new product features or business initiatives</li>\n<li>Perform ad-hoc analysis and work closely with Product Owners helping them to understand the data and make decisions</li>\n<li>Work closely with Data Engineering team on ETL</li>\n<li>Format data for use within different systems, performing necessary data extractions and transformations</li>\n<li>Interact with multiple teams to better understand structure and source of data</li>\n<li>Communicate results and influence key product and business leaders</li>\n<li>Help keeping our data clean by investigating data issues and escalating them to the relevant group when needed</li>\n<li>Support internal groups with their requests for information. Teach and train internal groups on how to self-serve.</li>\n</ul>\n<strong>Skills you'll need:</strong>\n\n<ul>\n<li>BA/BS degree</li>\n<li>3+ years of experience as a data analyst</li>\n<li>Expert level SQL skills, involving very large datasets and multiple data sources</li>\n<li>Strong analytical and problem solving skills.</li>\n<li>Be a team player and self-starter with great interpersonal skills and a solution-oriented attitude</li>\n<li>Be great at distilling data into actionable recommendations.</li>\n<li>Manipulate, transform, and analyze complex, high-volume, high-dimensionality data</li>\n<li>Experience and passion for developing the right metrics and dashboards/visualizations</li>\n<li>Ability to work cross-functionally with stakeholders from across the business</li>\n</ul>\n<strong>Would be a plus:</strong>\n\n<ul>\n<li>Experience with Tableau, Looker, etc</li>\n<li>Experience with revenue analysis</li>\n<li>Experience with big data tools: Hive, Impala, Spark</li>\n<li>Experience in SaaS (Software-as-a-Service) products, Freemium or trial-to-pay model, pricing and checkout funnel optimization</li>\n<li>Strong sense of urgency and ownership</li>\n</ul>\n<strong>AnchorFree Compensation and Benefits:</strong>\n\n<ul>\n<li>Competitive salary</li>\n<li>Excellent employee stock option plan</li>\n<li>Relocation assistance available</li>\n<li>$125 per month electric car incentives</li>\n<li>Free food and drinks</li>\n<li>Foosball, Gym and showers, Pool table, Table Tennis</li>\n<li>FREE Medical, Dental and Vision</li>\n<li>401k</li>\n<li>Commuter Benefits</li>\n<li>Free Shuttle from San Francisco,CA</li>\n<li>Dog friendly office</li>\n</ul>\n<strong>About the Product</strong>\n<br>\nAnchorFree are the creators of a powerful technology platform that has been transformational for millions of people around the world, enabling connectivity, privacy, and freedom. The crown jewel of our family of products, Hotspot Shield is available for users on iOS, Android, PC and Mac. 200,000 new users download Hotspot Shield every day, making it one of the top 100 most popular iOS apps in App Store and the #1 top grossing app in the Productivity category. Powered by a proprietary VPN technology, Hotspot Shield is the world's most popular Wi-Fi security application. Hotspot Shield is the #1 enabler for users to get Snapchat, Facebook, Twitter, YouTube in places where access to these apps or sites is restricted or censored. AnchorFree is also powering partners with its proprietary VPN technology available as an SDK, enabling app developers to integrate security, privacy and Internet freedom into their apps.\n<br><br>\n<strong>About the Culture</strong>\n<br>\nAnchorFree lives, sleeps, and breathes their core mission of enabling secure access to the world's information for every person on the planet. AnchorFree is one of the few companies that is actually changing the world by providing users with basic human rights (Internet Freedom and Privacy), while driving solid year over year growth and shareholder value.\n<br><br>\n<strong>Learn more about us here:</strong>\n<br>\nAnchorFree website: http://www.AnchorFree.com\n<br>\nHotspot Shield website: http://www.HotspotShield.com\n<br>\nFacebook: https://www.facebook.com/HotspotShield\n<br>\nTwitter: https://twitter.com/HotspotShield\n<br>\nBlog: http://blog.hotspotshield.com"}