{"job title": "Senior Java / Big Data Engineer - Enterprise Content &amp; Delivery", "company": "Andiamo", "city state": "– New York, NY", "rating": "3.6", "job description": "This Enterprise Content &amp; Delivery development team is responsible for building highly-performant distributed systems that manage large volumes of client data. We work with multiple groups within the organization to gather millions of data points per day and develop tools to transform and store the data in an efficient manner for trend analysis, billing and business intelligence.\n<br><br>\nWe are looking to enhance our software suite to develop a new automated data ingestion and analytics pipeline. We want every application that we on-board to define new schemas and leverage them for data ingestion. Secondly, we want to leverage or develop a framework that can provide for analysis against this data store and do this all in a manner that provides for operational independence. The right candidate will be expected to have extensive hands-on experience in Big Data Technologies such as Hadoop and HBase as well as frameworks like Apache Spark and/or Apache Kafka.\n<br><br>\n<strong>We'll trust you to:</strong>\n\n\n<ul>\n<li>Understand the capabilities of our current system and enhance it to support the capabilities of this new pipeline</li>\n<li>Work with other groups within the organization to set up and configure big data clusters and assist with data volumetrics as well as hardware and software needs</li>\n<li>Research, design and assist in building tools that can be utilized to analyze the data by internal users and support staff</li>\n<li>Maintain systems to ensure they are highly available</li>\n</ul>\n\n<strong>You'll need to have:</strong>\n\n\n<ul>\n<li>3+ years of current Java development experience</li>\n<li>Proven experience with a range of big data architectures, including Hadoop, HBase or other big data frameworks</li>\n<li>Experience building large scale distributed data processing systems</li>\n<li>Solid understanding of data structures, algorithms &amp; object-oriented design concepts</li>\n<li>A passion for big data technologies and a flexible, creative approach to problem solving</li>\n<li>Excellent communication skills</li>\n</ul>\n\n<strong>We'd love to see:</strong>\n\n\n<ul>\n<li>Experience with languages such as Python/Perl</li>\n<li>Experience developing software using agile methodologies</li>\n<li>Working knowledge of development tools such as debuggers, memory profilers, and performance analysis</li>\n</ul>\n\nAndiamo is an Equal Opportunity Employer\n<br><br>\nAndiamo provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Andiamo complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n<br><br>\nAll qualified candidates are encouraged to apply by submitting their resume as an MS word document including a cover letter with a summary of relevant qualifications, highlighting clearly any special or relevant experience."}