{"job title": "AI Senior Data Scientist", "company": "Anthem", "city state": "– Chicago, Illinois, United States", "rating": "3.7", "job description": "<div><div><div><div><div><p>Your Talent. Our Vision.<b> At Anthem, Inc., </b>it’s a powerful combination, and the foundation upon which we’re creating greater access to care for our members, greater value for our customers, and greater health for our communities. Join us and together we will <b>drive the future of health care</b>.</p><p> </p><p></p><p>This is an exceptional opportunity to do innovative work that means more to you and those we serve at one of America's leading health benefits companies and a Fortune Top 50 Company.</p><p><br></p><p><br></p><p>Responsible for the development and implementation of machine learning algorithms and techniques to solve business problems and optimize member experiences. Primary duties may include are but not limited to: Design machine learning projects to address specific business problems determined by consultation with business partners. Work with data-sets of varying degrees of size and complexity including both structured and unstructured data. Piping and processing massive data-streams in distributed computing environments such as Hadoop to facilitate analysis. Implements batch and real-time model scoring to drive actions. Develops proprietary machine learning algorithms to build customized solutions that go beyond standard industry tools and lead to innovative solutions. Develop sophisticated visualization of analysis output for business users. </p><p><br></p><p>Publish results and address constraints/limitations with business partners. Provides high-level controllership/evaluation of all output produced to ensure established targets are met. Determines the continuous improvement opportunities of current predictive modeling algorithms. Proactively collaborates with business partners to determine identified population segments and develop actionable plans to enable the identification of patterns related to quality, use, cost and other variables.</p>\n \n \n\n \n \n \n \n \n <div>\n <p>Requires MA/MS in Statistics, Computer Science, Mathematics, Machine Learning, Econometrics, Physics, Biostatistics or related Quantitative disciplines. 3 years experience in predictive analytics and advanced expertise with software such as Python, R, SAS, SAS Enterprise Miner or equivalent, or any combination of education and experience which would provide an equivalent background. PhD and experience in the healthcare sector preferred.</p><p><br></p><p>Must Have’s:</p><p>1. GitHub, Kaggle (or equivalent) public repository with portfolio of projects developed for school or sample code for experimentation</p><p>2. Experience working with data – manipulating data (with Python, R, MatLab, SAS, or similar) and also building analytical models with data (predictive, exploratory, etc.)</p><p>3. Passion to experiment and try out different things, desire to be hands on and experimental with work. Good communication skills – ability to explain complex topics with understandable words</p><p></p><p>5. Willingness to be a team player and collaborate across groups and functions. Willingness to be creative, self-starter and problem solver – don’t wait to be always told what to do, but be curious and willing to explore what can be done and how to solve hard problems</p><p><br></p><p> </p><p></p><p></p><p><b>Anthem, Inc. is ranked as one of America’s Most Admired Companies among health insurers by Fortune magazine and is a 2018 Diversity Inc magazine Top 50 Company for Diversity. To learn more about our company and apply, please visit us at careers.antheminc.com. </b><b>An Equal Opportunity Employer/Disability/Veteran.</b></p>\n </div>\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}