{"job title": "Computer Scientist Consultant", "company": "Aon", "city state": "– US-MA-Boston", "rating": "3.4", "job description": "Posting Description\n<p><strong>Why Stroz Friedberg, an Aon company?</strong></p>\n<p>Aon plc (NYSE:AON) is the leading global provider of risk management, insurance and reinsurance brokerage, and human resources solutions and outsourcing services. Our more than 50,000 colleagues worldwide empower results for clients in over 120 countries with innovative and effective risk and people solutions and through industry-leading global resources and technical expertise.</p>\n<p>Stroz Friedberg, an Aon company, is a specialized risk management firm built to help clients solve the complex challenges prevalent in today’s digital, connected, and regulated business world. Our focus is on cybersecurity, with leading experts in digital forensics, intellectual property, incident response, and security science; investigations; eDiscovery; and due diligence.</p>\n<p>Our aim is to guide businesses through the maze of complexities found at the intersection of law, technology, investigations, compliance, and security. We seek truth—uncovering facts and evidence ethically—to help organizations address their most significant risk issues. Sometimes we are called in after an incident to perform an investigation, while other times we help clients assess how prepared and protected they are from threats. Our clients call us, and we are at our best, when the stakes are high and the potential for damage is great. At Stroz Friedberg, we are united by a common goal—to maximize the health of an organization, ensuring its longevity, protection, and resilience.</p>\n<p><strong>Position Overview</strong></p>\n<p>The Senior Consultant opportunity works within and in support of the Intellectual Property department. The Senior Consultant will be responsible for analyzing technology, determining how it works at the source code level, and explaining findings to top-tier litigators. they will create custom tools to analyze large datasets and identify patterns of malicious behavior. The ideal candidate will demonstrate a balance between subject matter expertise, initiative, accuracy, self-motivation, organization, and articulate &amp; precise communications. Honesty, professionalism, and creativity are important traits for success in this role.</p>\n<p>Senior Consultants will be expected to perform the following tasks:</p>\n<ul>\n <li>Investigate current or historical software or hardware to determine capabilities and functions, based on reviewing documentation, source code, schematics, and articles, and/or performing testing and analysis.</li>\n <li>Search public databases of academic and technical literature to identify relevant historical disclosures of techniques.</li>\n <li>Review and critique specifications and claims of issued patents and patent applications.</li>\n <li>Read and analyze computer source code, systems, prior art and data to identify particular features or characteristics.</li>\n <li>Create or modify scripts to process structured and unstructured data.</li>\n <li>Configure and maintain hardware and software systems (Linux, Macintosh, and Windows).</li>\n <li>Identify and solve technical issues and understand complex systems.</li>\n <li>Concisely and correctly communicate results to colleagues both orally and in writing.</li>\n <li>Take ownership of assigned analysis, working within budget and timelines.</li>\n</ul>\n<p><strong>Technical Requirements</strong></p>\n<p>The ideal candidate will have basic programming experience (in C/C++; Shell scripting, Java, Assembly languages, Python, or other languages), as well as multiple of the skills listed below:</p>\n<ul>\n <li>Experience with Linux/Unix, Web languages, SQL/Database, Django</li>\n <li>Knowledge of Microsoft languages and frameworks</li>\n <li>Server, Database, and/or network file system administration</li>\n <li>Install and debug hardware, ability to rack &amp; stack servers</li>\n <li>Virtualization, automated OS installation, networking and network security</li>\n <li>Knowledge of Computer Science theory</li>\n</ul>\n<p><strong>Work/Education Preferred</strong> </p>\n<ul>\n <li>2-4 years of relevant experience.</li>\n <li>Bachelor’s degree is required in Computer Science, Electrical Engineering, Mathematics or similar disciplines.</li>\n</ul>\n<p><em>Note:</em> This job description is intended to describe the general nature and level of work being performed by employees in this position. It is not intended to be an exhaustive list of all responsibilities, duties, and skills required for this position; other duties outside of normal responsibilities may be performed as necessary to meet the needs of the organization. </p>\n<p><em>Background Investigation Notice</em>: Offers of employment are contingent upon our receipt of references consistent with our expectations, the results of pre-employment background checks, and execution upon an employee’s arrival of our confidentiality and non-compete agreement. </p>\n<p> </p>\n<p><strong>We offer you</strong></p>\n<p> </p>\n<p>A competitive total rewards package, continuing education &amp; training, and tremendous potential with a growing worldwide organization.</p>\n<p><strong> </strong></p>\n<p><strong> </strong></p>\n<p><strong>Our Colleague Experience:</strong></p>\n<p><strong> </strong></p>\n<p>From helping clients gain access to capital after natural disasters, to creating access to health care and retirement for millions, Aon colleagues empower results for our clients, communities, and each other every day. They make a difference, work with the best, own their potential, and value one another. This is the Aon Colleague Experience, defining what it means to work at Aon and realizing our vision of empowering human and economic possibility. To learn more visit Aon Colleague Experience.</p>\n<p><strong> </strong></p>\n<p><strong> </strong></p>\n<p><strong> </strong></p>\n<p><strong> </strong></p>\n<p><strong>About Aon:</strong></p>\n<p><strong> </strong></p>\n<p>Aon plc (NYSE:AON) is a leading global professional services firm providing a broad range of risk, retirement and health solutions. Our 50,000 colleagues in 120 countries empower results for clients by using proprietary data and analytics to deliver insights that reduce volatility and improve performance.</p>\n<p>By applying for a position with Aon, you understand that, should you be made an offer, it will be contingent on your undergoing and successfully completing a background check consistent with Aon's employment policies. Background checks may include some or all of the following based on the nature of the position: SSN/SIN validation, education verification, employment verification, and criminal check, search against global sanctions and government watch lists, fingerprint verification, credit check, and/or drug test. You will be notified during the hiring process which checks are required by the position.</p>\n<p>Aon provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, age, disability, veteran, marital, or domestic partner status. Aon is committed to a diverse workforce and is an affirmative action employer.</p>\n<p>DISCLAIMER: Nothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time.</p>\n<p> </p>\n<p> </p>\n<p> </p>"}