{"job title": "Quantitative Analyst - Client Support", "company": "AON", "city state": "– Chicago, United States", "rating": "3.4", "job description": "<strong>Job Description</strong>\n<br>\n<strong> Aon is looking for a Quantitative Analyst - Client Support</strong>\n<br><br>\n<strong>Summary</strong>  :\n<br>\nIn this role you will be working with customers using Impact Forecasting's proprietary catastrophe modeling software, ELEMENTS, and completing custom catastrophe modeling projects. Successful Analysts become proficient in ELEMENTS catastrophe modeling practices and features.\n<br><br>\n<strong> Education and experience:</strong> \n\n<ul>\n<li> Bachelor degree with major in Quantitative analytics or related field</li> <li> Minimum 2 years of experience with Risk management products and analytics</li> <li> Experience with Catastrophe Modeling is a plus</li> \n</ul>\n\n<strong>Skills and Responsibilities</strong>  :\n\n<ul>\n<li> Develop a working knowledge of ELEMENTS, both in software usage and basic model methodology</li> <li> Act as the single point of contact for our clients in order to provide ELEMENTS implementation and product support</li> <li> Investigate client questions and collaborate with other team members to resolve the issue and communicate status to client</li> <li> Would involve some travel for client meetings and product demonstrations</li> <li> Assist in the testing of the ELEMENTS software and its various components</li> <li> Become an advanced user of SQL and Excel for data mining and analytics\n\n<ul>\n<li> Develop the ability to investigate client's issue with exposure data and results and provide resolution and/or explanation to the client's satisfaction.</li> <li> Develop an ability to inventory client exposure data and determine accuracy and completeness of data and report back to client</li> </ul></li>\n<li> Develop an understanding of insurance and reinsurance terminology\n\n<ul>\n<li> Types of reinsurance products, business applications of reinsurance, and why clients utilize reinsurance</li> <li> Types of insurance and reinsurance, terms and conditions, and how they impact the modeling output</li> <li> Types of construction, occupancy, secondary modifiers, and other location details that impact modeled results</li> </ul></li>\n<li> Develop an ability to explain standard analyses with professional written and oral communication</li> <li> Demonstrate a commitment to providing excellent client service</li> <li> Develop the ability to double check own work and catch errors before passing on to others for review</li> <li> Complete tasks on time or ahead of schedule, being aware of timelines and expectations of clients and colleagues as well as providing regular updates to managers on project status</li> <li> Follow up with questions and comments to leader to keep project moving on schedule</li> <li> Design work products with an eye towards someone else seeing it or needing to audit it</li> <li> Take ownership and responsibility for tasks, be driven independently and proactively</li> <li> Being respectful and patient when dealing with clients and colleagues</li> <li> Balance multiple standard projects at one time</li> <li> Observe, listen, and learn during client or internal meetings and calls, anticipate the questions that will be asked, and be prepared to answer if called upon</li> <li> Read and become familiar with publications from Impact Forecasting and Aon Benfield Analytics</li> \n</ul>\n\n<strong> We offer you</strong> \n<br><br>\nA competitive total rewards package, continuing education &amp; training, and tremendous potential with a growing worldwide organization.\n<br><br>\n<strong> Our Colleague Experience:</strong> \n<br>\n<br>\nFrom helping clients gain access to capital after natural disasters, to creating access to health care and retirement for millions, Aon colleagues empower results for our clients, communities, and each other every day. They make a difference, work with the best, own their potential, and value one another. This is the Aon Colleague Experience, defining what it means to work at Aon and realizing our vision of empowering human and economic possibility. To learn more visit Aon Colleague Experience .\n<br><br>\n<strong> About Aon:</strong> \n<br>\n<br>\nAon plc (NYSE:AON) is a leading global professional services firm providing a broad range of risk, retirement and health solutions. Our 50,000 colleagues in 120 countries empower results for clients by using proprietary data and analytics to deliver insights that reduce volatility and improve performance.\n<br>\nBy applying for a position with Aon, you understand that, should you be made an offer, it will be contingent on your undergoing and successfully completing a background check consistent with Aon's employment policies. Background checks may include some or all of the following based on the nature of the position: SSN/SIN validation, education verification, employment verification, and criminal check, search against global sanctions and government watch lists, fingerprint verification, credit check, and/or drug test. You will be notified during the hiring process which checks are required by the position.\n<br>\nAon provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, age, disability, veteran, marital, or domestic partner status. Aon is committed to a diverse workforce and is an affirmative action employer.\n<br>\n<strong>DISCLAIMER:</strong>\n<br>\nNothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time.\n<br><br>\n<strong>Job number:</strong> 2442549\n<br>\n<strong>Category:</strong> Actuarial\n<br>\n<strong>Location:</strong> United States, IL, Chicago\n<br>\n<strong>11/16/2018 11:12:37</strong>\n<br><br>\nRequisition #: 2442549"}