{"job title": "Data Scientist", "company": "Apeel Sciences", "city state": "– Santa Barbara, CA", "rating": "4.4", "job description": "<strong>Company Background</strong>\n<br><br>\nIn the United States, over a third of all the food we grow is lost to spoilage and wasted before we can eat it. In the developing world, more than half of all produce is lost to spoilage before it can be consumed. Apeel Sciences creates agricultural solutions inspired by and derived from nature for growers to protect their crops and increase the shelf life of harvested fresh produce. We are committed to being a technological and environmental trailblazer at the interface between the agricultural, materials science, chemistry, biotechnology, and engineering industries to eliminate food waste and reduce reliance on pesticides. Our mission is to enable widespread, positive impacts through the development of high-performance pre- and post-harvest products and processes that conserve our precious natural resources and safeguard the Earth's delicate ecological balance.\n<br><br>\n<strong>Company Culture</strong>\n<br><br>\nApeel is comprised of highly talented, deeply passionate, and strongly tight-knit team members who are <em>excited</em> by the opportunity to challenge the status quo, are <em>obsessed</em> with solving problems, and truly seek to positively change how we feed the world.\n<br><br>\nOur people are core and absolutely fundamental to our company's success and continued growth. Look around and what do you see? Team members who are working tirelessly and selflesslynot to serve themselvesbut to help the team as a whole strategically, aggressively, and collectively realize a shared mission and vision. If you are ready for an opportunity to jump in, tackle challenges (and opportunities!) head-on, take ownership, and drive meaningful outcomes in a highly collaborative, communicative, and dynamic environment, we would love to connect with you!\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nApeel Sciences seeks a highly motivated and creative data scientist to drive projects related to data collection, organization, and analysis. Using our large volume of data regarding the biological, chemical, and physical properties of fruits and vegetables, the data scientist would create new insights, suggest new projects and priorities, and make data accessible to our researchers and investors. An ideal candidate has demonstrable experience in statistical analysis to include multivariate and principal component analysis, preferably with experience wherein their empirical analysis influenced business decision making in the private sector. The need encompasses all aspects of data pipeline engineering, from data restructuring/cleaning to \"black box\" algorithm design and implementation.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Develop new insights derived from our existing data that will provide cost-effective solutions to biological questions</li>\n<li>Propose data collection projects that will pioneer the company's deep analysis of biological systems</li>\n<li>Build data analysis pipelines (structure, cleaning, processing, output, visualization) that will effectively resolve problems inherent to large, non-standardized data sets.</li>\n<li>Provide structure or reorganization to unstructured data</li>\n<li>Present frequently to the company (~once per 3 weeks) regarding deliverables, findings, and scope of future work and the impact to business value</li> \n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>M.S. or Ph.D. degree in statistics or a biological science with a strong focus on quantitative analysis</li>\n<li>Minimum 4 years' experience in data science or computational biology, to include experience with tools in R or Python and database query optimization including SQL and/or NoSQL databases</li>\n<li>Proven effectiveness in supporting the efforts of an existing data science team and/or initiative in driving business recommendations through data science efforts</li>\n<li>Examples of projects or other work related to statistical modelling, data mining, or data analysis</li>\n<li>Experience with manipulating large data sets and complex regression analysis</li>\n</ul>\nApeel believes that the scale of our impact is determined by the teams that work with us. As such, we seek to build high-performing teams of people from various experiences and backgrounds who can collectively push our company into new realms. We seek a diverse pool of applicants and consider all qualified candidates regardless of race, ancestry, color, gender identity or expression, sexual orientation, religion, national origin, citizenship, disability, Veteran status, marital status, or any other protected status. If you have a special need or disability that requires accommodation, please let us know.<br><br><em>Please note that Apeel Sciences does not accept unsolicited resumes from recruiters or employment agencies. In the event of a recruiter or agency submitting a resume or candidate without a signed agreement being in place, we explicitly reserve the right to pursue and hire such candidates without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted directly to hiring managers, are deemed to be the property of Apeel Sciences.</em> "}