{"job title": "Scientist", "company": "Apex Life Sciences", "city state": "– Saint Charles, Missouri", "rating": "2.6", "job description": "<strong>Job Description</strong>\n<br>\nApex Life Sciences is looking for a Scientist!\n<br><br>\nThis candidate will be supporting the contract research services. This role requires applied knowledge in cell-based methods, pharmacology principles, and direct experience in a cell-based lab.\n<br><br>\n<strong>Essential Duties and Responsibilities:</strong>\n<br><br>\nPerforms work in a laboratory setting, meeting the physical job requirements of a lab role.\n<br>\nConducts production assays in ADMET, BioMAP®, Immunosignaling, Ion Channel, and/or OncoPanel Services; manufacturing, lot release assays and inventory management for Cell Products.\n<br>\nPerforms optimization experiments for the culture of human primary cell types, primarily adherent cell types.\n<br>\nDevelops procedures for culture of new cell types and new assay development.\n<br>\nContributes to the maintenance of various human primary cell types, primarily adherent cell types.\n<br>\nContributes to running of complex primary human cell-based assays using automated liquid handlers.\n<br>\nPrepares and manages inventory of buffers, reagents, media, semi-finished and finished goods.\n<br>\nMaintains cell culture in a BSL2 laboratory, and adheres to cleanroom guidelines and aseptic technique, according to protocol.\n<br>\nProvides solutions to more complex problems, identifies and initiates process improvements\n<br>\nMaintains high data quality and reproducibility.\n<br>\nPerforms data and report QC review within the department.\n<br>\nTakes ownership of mid-size laboratory or research and development projects with minimal supervision\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nDirect experience with mammalian cell-based assays\n<br>\nDemonstrated proficiency in contributing independently on a project team with time and quality metrics\n<br>\nGood communication and interpersonal skills\n<br>\nB.A. or B.S. with 5 years relevant experience\n<br>\nM.A. or M.S. with 3 years relevant experience\n<br>\nPh.D. with 1 year relevant experience\n<br>\nOr an equivalent of education and experience\n<br><br>\n<strong>Additional preferences:</strong>\n<br><br>\nScientific expertise with primary human cell types, including a record of publications is desired\n<br>\nExperience in a contract research organization\n<br>\nExperience with method development and optimization\n<br>\nExperience with automation, HTS applications, and large- scale screening\n<br>\nExperience in small team leadership and project management\n<br>\nExperience in leading and delivering results in R&amp;D\n<br><br>\nEEO Employer\n<br><br>\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178.\n<br><br>\n909010This candidate will be supporting the contract research services. This role requires applied knowledge in cell-based methods, pharmacology principles, and direct experience in a cell-based lab., * Direct experience with mammalian cell-based assays * Demonstrated proficiency in contributing independently on a project team with time and quality metrics * Good communication and interpersonal skills * B.A. or B.S. with 5 years relevant experience * M.A. or M.S. with 3 years relevant experience * Ph.D. with 1 year relevant experience * Or an equivalent of education and experience Additional preferences: * Scientific expertise with primary human cell types, including a record of publications is desired * Experience in a contract research organization * Experience with method development and optimization * Experience with automation, HTS applications, and large- scale screening * Experience in small team leadership and project management * Experience in leading and delivering results in R&amp;D"}