{"job title": "Data Analyst", "company": "Apex Systems", "city state": "– San Bruno, CA", "rating": "3.2", "job description": "Job DescriptionJob DescriptionJob #: 914590 Our client is looking for Data Analysts to join their Ad Operations Team! This a 12 month contract in San Bruno, CA. We are looking for candidates with 1 or more years experience with Search Campaign Optimization (Google AdWords, Amazon Advertising) and 3 or more years experience an advertising and keyword searches. Responsibilities • Analyze A/B and Multivariate test data and provide actionable recommendations for business stakeholders • Provide recommendations on key metrics and segments to determine if an experiment is successful • Run exploratory analysis of site performance and customer data to identify key areas of the site that can be optimized • Ensure experiment data quality by maintaining and improving data integrations between internal and external tools • Work closely with product management to create new feature test plans and decision trees in order to drive a \"test and learn\" culture within the organization About You • Master's degree Statistics, Applied Math, Economics or related fields preferred • Ability to use quantitative methods to answer tough questions • Understanding of experimental design and testing methodologies • Able to manipulate and draw insight from large, complex, multi-dimensional data sets (SQL, R, Python, etc.) • Excellent communication and relationship-building skills, with a high attention to detail EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}