{"job title": "Sr. Scientist (Cell-Based Assay Development)", "company": "Apex Life Sciences", "city state": "– Palo Alto, California", "rating": "2.6", "job description": "<strong>Duties include:</strong>\n\n\n<ul>\n<li>The scientist will direct and oversee the creation of methods for the development of innovative biochemical or cell based assays related to quality control (QC) appropriate for a clinical phase III product . Develop, perform, document and report tests related to assays/analytical methods; including investigation and providing corrective action plan for out-of-specification and/or non-conforming test results.</li>\n<li>Write, review and edit accurate cGMP documents, including SOP, Test Procedures, Sampling Plan, Certificate of Analysis and Qualification/Validation Protocols</li>\n<li>Key subject matter expert for protocol based assay qualification, validation and technology transfer. Planning and implementing critical analytical assessment of quality attributes to support the CMC development.</li>\n<li>Oversee product specific QC operation is performed in consistent to sampling plan and manufacturing schedules - including the operational assignments to individual QC associates for a variety of in process, drug substance, and drug product testings, sample shipments, data management and reporting data to stakeholders in a comprehensive manner.</li>\n<li>Work with SME to ensure the cGMP compliance of facility and environment for clinical production of products at different phases.</li>\n<li>Direct selection criteria and justification for QC raw materials;</li>\n<li>Direct staff on projects and investigations, prepare deviation reports for SOPs and test methods, and implement prevention or corrective actions</li>\n<li>Work with a cross-functional team to advance the development of projects.</li>\n<li>- Other duties may also be assigned</li>\n</ul>\n\n<strong>DESIRED QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Master's degree or higher in relevant scientific disciplines with post-graduate work experience preferred</li>\n<li>Strong knowledge and experience in cell based analytical development, qualification and technology transfer</li>\n<li>Experience with cell and gene therapy analytical or process development</li>\n<li>Ability to effectively work in fast pace environment with cross functional groups</li>\n</ul>\n\n<strong>EDUCATION &amp; EXPERIENCE (REQUIRED):</strong>\n<br><br>\nBachelor's degree and eight years' experience or advanced degree and five years' experience in relevant scientific relevant scientific discipline or other appropriate specialty (such as Chemistry, Life Sciences, and Engineering).\n<br><br>\n<strong>KNOWLEDGE, SKILLS AND ABILITIES (REQUIRED):</strong>\n\n\n<ul>\n<li>Advanced experience applying multidisciplinary scientific principles and practices to provide technical leadership and influence experimental design and coordinate laboratory activity</li>\n<li>Extensive technical QC experience in clinical laboratory, hematology, blood banking, immunology or QC laboratory preferably in cGMP environment.</li>\n<li>Expert knowledge and understanding of cGMP requirements.</li>\n<li>Extensive experience in QC innovation and analytical methods and validation tests development.</li>\n<li>Experience with technology transfer methods.</li>\n<li>Ability to communicate effectively, both verbally and in writing. Ability to influence and advocate course of action of research project.</li>\n<li>Experience leading and/or managing technical professionals.</li>\n<li>Demonstrated resolution of complex issues in creative and effective ways</li>\n<li>Excellent organizational skills and attention to detail.</li>\n</ul>\n\nPlease send your resume to [Click Here to Email Your Resum] for immediate consideration!\n<br><br>\n<strong>#LI-AO1</strong>\n<br><br>\nEEO Employer\n<br><br>\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at ************.\n<br><br>\nJob ID: ******\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nApex Life Sciences\n<br><br>\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at ************************************* or ************. Contact Info\n\n\n<ul>\n<li>Palo Alto, CA</li>\n</ul>"}