{"job title": "Associate Scientist II", "company": "Apex Life Sciences", "city state": "– St. Petersburg, Florida", "rating": "2.6", "job description": "Apex Life Sciences is seeking qualified candidates for an Associate Scientist position with a Contract Research Organization (CRO) in St. Petersburg, FL!\n<br><br>\nDescription: The Analytical Research and Development (AR &amp; D) laboratory supports evaluation and testing of raw materials, excipients, APIs, in-process and finished product samples. AR &amp; D also performs development and validation of methods used to support release and stability testing of non-commercial products and materials. The department provides analytical services to manufacturing, process development, validation and new material qualifications. AR &amp; D interacts with clients to provide not only research and testing of products, but also support CMC development activities in support of client regulatory filings. Activities are performed in accordance with specifications, standard operating procedures, approved test methods and/or protocols, regulatory requirements, and St. Petersburgs Quality departmental policies.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Independently test Raw Materials by both compendial and non-compendial methods with support of additional activities related to the testing of pre-capsulation, Stability and Finished Products as required.</li>\n<li>Analyze data, document results, maintain laboratory notebook according to cGMP and Internal guidelines.</li>\n<li>Communicate results in written and oral presentations.</li>\n<li>Help in writing Procedures, Specifications and Test Methods.</li>\n<li>Keep abreast of literature in field; help train colleagues; contribute to continuous improvement within the group.</li>\n<li>Comply with FDA, EPA and OSHA regulations, performing all work in a safe manner. Maintain proper records in accordance with all SOP's and policies.</li>\n<li>* Analysis of finished products, in-process materials, fill moisture, raw materials, and cleaning verification and validation samples according to the assigned specifications, methods and protocols.</li>\n<li>Preparation of reagents/standards/medias needed for analysis according to established methods.</li>\n<li>Safe handling of potent and teratogenic compounds. Disposal of hazardous waste according to environmental regulations and company/departmental procedures.</li>\n<li>Tabulation and interpretation of results of analysis as recorded in notebooks, reports and logbooks.</li>\n<li>* Capable of self-scheduling of work assignments</li>\n<li>* Assures right-first-time execution of departmental methods and SOPs.</li>\n<li>* Facilitates and supports activities and services necessary to the routine operations of the department, as assigned.</li>\n<li>* Audits and verifies results, including but not limited to, calculations in notebooks/logbooks and results in reports to check for accuracy and integrity of data.</li>\n<li>* Writes and reviews analytical methods, deviations, protocols, SOPs and any other technical documents as required. *</li>\n<li>Supports Material Evaluation Process for new materials if required.</li>\n<li>* Provides project support for new product development which requires a close working relationship directly with Customers as well as suppliers.</li>\n<li>* Participates in inter-departmental task teams.</li>\n<li>* Interfaces with peers in other departments, senior management, customers and regulatory agencies.</li>\n<li>* Provides support for ordering and maintaining inventory of laboratory materials and equipments.</li>\n<li>* Provides training for new or existing personnel.</li>\n<li>* Identifies and implements process improvements that will reduce cycle time to test and release products.</li>\n<li>* Performs other miscellaneous duties as required.</li>\n<li>* Works flexible hours including weekends and evenings to accommodate the production / validation schedule. Individuals primary workstation is located in the lab, where the noise level is low.</li>\n</ul>\n\nJob Requirements\n\n\n<ul>\n<li>Requires BS with college course work in related sciences. 0 - 3 years' experience in an analytical laboratory (recent grads will be considered.) MS degree also considered, but PhD candidates will not be a good match.</li>\n</ul>\n\nMust possess good interpersonal skills. Ability to effectively communicate with co-workers. Good organizational skills required\n<br><br>\nExperience with common pharmaceutical laboratory equipment including, but not limited to,\n\n\n<ul>\n<li>Experience with U.V. spectroscopy</li>\n<li>Experience with IR and AA instrumentation</li>\n<li>H.P.L.C. and G.C. instrumentation experience</li>\n<li>Autoclave</li>\n<li>Vitek</li>\n<li>Experience in dissolution testing</li>\n<li>Expertise in wet chemistry techniques such as titrations, extractions, digestions and preparations of test solutions.</li>\n<li>Knowledge of safety and hazardous waste requirements</li>\n<li>Knowledge of data acquisition applications and databases</li>\n<li>Experience in conducting and writing laboratory investigations</li>\n</ul>\n\nFor consideration please send a copy of your resume to [Click Here to Email Your Resum]\n<br><br>\nEEO Employer\n<br><br>\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resum] or ************.\n<br><br>\nJob ID: ******\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nApex Life Sciences\n<br><br>\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at ************************************* or ************. Contact Info\n\n\n<ul>\n<li>St Petersburg, FL</li>\n</ul>"}