{"job title": "Group Lead, Sr. Scientist - Cell Culture", "company": "Apex Life Sciences", "city state": "– Princeton, New Jersey", "rating": "2.6", "job description": "Supervising Senior Scientist (Cell Culture)\n<br><br>\nSummary\n<br><br>\nDirectly supervises a small team of scientists. Acts as lead on multiple programs.\n<br><br>\nInvestigates, creates, and validates new scientific methodologies on multiple projects that meet client expectations.\n<br><br>\nDetermines methods and procedures on new assignments and may coordinate activities of other employees.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nProvides leadership to assigned staff and leads design of experimental plans\n<br><br>\nWorks with Process Development and Manufacture groups to trouble-shoot process challenges.\n<br><br>\nPrepares protocols, reports, and test methods and writes SOPs.\n<br><br>\nWriting and revising of process development reports and technology transfer protocols as needed.\n<br><br>\nProject Management.\n<br><br>\nActs as functional group technical lead on multiple programs, with responsibility for running those programs within own functional group.\n<br><br>\nWork cross functionally with Program management\n<br><br>\nServes as primary contact with clients and provides regular communication of data and status. Leads relevant program team meetings.\n<br><br>\nSupervises Scientists at multiple levels.\n<br><br>\n<strong>Minimum Requirements/Qualifications:</strong>\n<br><br>\nBachelor's degree required (biology, chemistry, biochemistry, chemical engineering, or a related field.\n<br><br>\nMaster's degree or PhD is highly desirable\n<br><br>\nMinimum of 8 years of experience related to pharmaceutical manufacturing, process, development or academic laboratory and that includes relevant industry and discipline experience.\n<br><br>\nWith Master's degree, 6 years of experience related to pharmaceutical manufacturing, process, development or academic laboratory and that includes at least 2 years of relevant industry discipline experience.\n<br><br>\nWith PhD, significant practical scientific application directly related to job responsibilities; related industry and discipline experience preferred.\n<br><br>\nEEO Employer\n<br><br>\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at ************.\n<br><br>\nJob ID: ******\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nApex Life Sciences\n<br><br>\nApex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at ************************************* or ************. Contact Info\n\n\n<ul>\n<li>Princeton, NJ</li>\n</ul>"}