{"job title": "Data Scientist", "company": "APN Software Services Inc.", "city state": "– Memphis, TN, US", "rating": "3.9", "job description": "<div>\n<strong>Client:</strong> Sedgwick Claims Management Services, Inc.</div><div>\n<strong>Title</strong>: Data Scientist</div><div>\n<strong>Req #:</strong> 8250598</div><div>\n<strong>Location</strong>: 1100 Ridgeway Loop Road, Suite 200, Memphis, TN 38120</div><div>\n<strong>Duration</strong>: 6 months (until 12/31)</div>\n<br>\n<div><strong>Please be sure to review these details below:</strong></div><div>\n· Will be responsible for working with internal partners to determine modeling needs</div><div>\n· Will be responsible for using SAS infrastructure to determine best methods to use to achieve target goals</div><div>\n· Will need to perform analysis of models to provide estimates of impact and plans for forward maintenance.</div>\n<br>\n<div><strong>PRIMARY PURPOSE:</strong></div><div>\nTo develop and manage predictive modeling assignments through completion; to communicate results; to make recommendations to management; and to ensure model ownership, implementation, and monitoring; to spot trends and to gain maximum insight that can give the company a competitive advantage.</div>\n<br>\n<div><strong>ESSENTIAL FUNCTIONS and RESPONSIBILITIES:</strong></div><div>\n· Develops, prepares, and manages predictive models through completion.</div><div>\n· Identifies required resources; researches data, procedures, and history for a thorough understanding of project direction.</div><div>\n· Collects new data and statistics from multiple sources and generates statistical analysis.</div><div>\n· Collaborates with data management team to develop, refine, and scale data management and analytics procedures, systems, workflows, best practices, and other issues.</div><div>\n· Partners with both business and IT leaders to influence how the organization approaches and meets business challenges of an evolving customer base and changing marketplace, using strong business acumen.</div><div>\n· Prepares reports using various system programs and coordinating with other departments.</div><div>\n· Develops and trains the data management team on new or updated procedures as needed.</div>\n<br>\n<strong><div>QUALIFICATIONS:</div>\n<br>\n</strong>\n<br>\n<div><strong>Education &amp; Licensing:</strong></div><div>\n· Bachelor's degree from an accredited college or university preferred with major in Business Analytics, Statistics, Mathematics, or Computer Science; SAS certifications preferred.</div>\n<br>\n<div><strong>Experience:</strong></div><div>\n· Eight (8) years of related experience or equivalent combination of education and experience to include five (5) years of statistical modeling experience with solid background in the fundamentals of machine learning and statistics.</div>\n<br>\n<div><strong>Skills &amp; Knowledge:</strong></div><div>\n· Experience in managing and manipulating large datasets</div><div>\n· Knowledge of advanced analytics tool such as SAS or R</div><div>\n· Thorough knowledge of insurance industry business practices and processes</div><div>\n· Excellent oral and written communication, including presentation skills</div><div>\n· PC literate, including Microsoft Office products</div><div>\n· Analytical and interpretive skills</div><div>\n· Strong organizational skills</div><div>\n· Good interpersonal skills</div><div>\n· Ability to analyze and interpret complex concepts</div><div>\n· Ability to work in a team environment</div><div>\n· Ability to meet or exceed Performance Competencies</div><div>\nBest,</div><div>\nKushal Shah</div><div>\nAPN Software Service INC</div><div>\nkushal@apninc.com</div>"}