{"job title": "Data Scientist", "company": "Applied Systems", "city state": "– US-TX-Austin", "rating": "3.9", "job description": "Job Description<br><br><strong>Make a Difference Every Day with Team Applied</strong>The people of Applied are making a difference every day through innovation and a commitment to help safeguard and protect what matters most. With first-to-market software, mobile and data analytics solutions, Applied is revolutionizing companies to strengthen their position as trusted advisors to clients across the world. Our core values challenge employees to make a difference every day with excellence for customers and support for the communities around us. We believe that success comes from a dynamic working environment that offers professionals an opportunity to grow and succeed alongside extraordinary people.\n<br><br>\nLearn how you can make a difference on Team Applied.\n<br><br>\n<strong>Job Summary</strong> Applied Systems, Inc., a worldwide leader in insurance technology, is currently searching for a <strong>Data Scientist</strong> to join our IVANS Insurance Solutions Division. In this role, you will be part of a small, fast-paced team comprised of individuals from world class technology and insurance industry firms tasked with the creation of highly innovative products to lead the industry in the digital world. You will be relied upon to find innovative and creative ways to leverage some of the industry’s largest data resources to speed decision-making and growth for hundreds of thousands of insurance professionals and their clients. Responsibilities include:\n\n<ul>\n\n <li>Design and implement data analysis, data mining, research, analysis, modeling strategies and best practices</li>\n<li>Use analytical expertise to spot key business insights, trends, and opportunities in our vast database</li>\n<li>Help interpret and communicate your findings in a way that is easily understood by those less familiar with data</li>\n<li>Collaborate with a dynamic Product and Development team in delivering data products and insights to clients</li>\n<li>Establish and maintain relationships with distributed cross-functional teams to leverage domain and industry expertise</li>\n<li>Identify missing and inaccurate data in our platforms; seek out supplements and replacements to improve our data sets to the greatest extent possible</li>\n<li>Advise teams and clients as a subject matter expert in data science</li>\n</ul>\n<br><br>\n<strong>Requirements:</strong>\n\n<ul>\n\n <li>Bachelor’s degree in a quantitative field such as Statistics, Computer Science, Economics, or Mathematics; or equivalent work experience</li>\n<li>Relevant, successful professional industry experience</li>\n<li>Proficiency with database and analysis tools like R, SQL, Python, and others</li>\n<li>Expertise in statistical modeling, data collection, aggregation, analysis, machine learning, and productization</li>\n<li>Self-driven passion for finding and collaboratively solving problems</li>\n<li>Strong understanding of the benefits and flaws in the application of various methods</li>\n</ul>\n<br><br>\n<strong>Corporate Profile</strong> Applied Systems is a leading provider of software that powers the business of insurance. Recognized as a pioneer in agency management systems, insurance organizations rely on the company’s software to manage their clients and policies in a consistent manner to minimize risk, reduce operating expenses, and drive sustainable growth and profitability. Leading the industry in technology innovation, Applied Systems has been at the forefront of data exchange between agencies, brokers, carriers and their clients. Today, the company has more than 1,500 employees with customers throughout the United States, Canada, the United Kingdom, and Ireland. By automating the insurance lifecycle, Applied Systems remains committed to help safeguard what matters most to millions of people around the world. To learn more, please visit www.AppliedSystems.com.\n<br><br>\nEmployees feel appreciated at Applied Systems. In addition to a competitive benefits package that starts on the first day of employment, we offer paid time off, a flexible ”Dress for your Day” casual dress code, and an open communication policy. The resulting atmosphere is professional and conducive to productivity, yet comfortable and fun.\n<br><br>\n<em>Applied Systems welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.</em>\n<br><br>\n#CB"}