{"job title": "Data Scientist", "company": "Apple", "city state": "– Austin, Texas", "rating": "4.0", "job description": "<strong>Summary</strong>\n<br>\nImagine what you could do here. At Apple, new ideas have a way of becoming outstanding products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n<br><br>\nApple's Strategic Data Solutions (SDS) team is looking for a talented individual who is passionate about crafting, implementing, and operating analytical solutions that have direct and measurable impact to Apple and its customers.\n<br><br>\nAs an SDS data scientist, you will employ predictive modeling and statistical analysis techniques to build end-to-end solutions for improving security, fraud prevention, and operational efficiency across the company, from manufacturing to fulfillment to apps and services.\n<br><br>\nApple's dedication to customer privacy, the adversarial nature of fraud, and the enormous scale of the business present exciting challenges to traditional machine learning and data science techniques. On this team, you will push the limits of existing data science methods while delivering tangible business value.\n<br>\nPractical experience with and theoretical understanding of algorithms for classification, regression, clustering, and anomaly detection\n<br><br>\nWorking knowledge of relational databases, including SQL, and large-scale distributed systems such as Hadoop and Spark\n<br><br>\nAbility to implement data science pipelines and applications in a general programming language such as Python, Scala, or Java\n<br><br>\nAbility to comprehend and debug complex systems integrations spanning toolchains and teams\n<br><br>\nAbility to extract meaningful business insights from data and identify the stories behind the patterns\n<br><br>\nExcellent presentation skills, distilling complex analysis and concepts into concise business-focused takeaways\n<br><br>\nCreativity to engineer novel features and signals, and to push beyond current tools and approaches\n\n\n<ul>\n<li>Engage with business teams to find opportunities, understand requirements, and translate those requirements into technical solutions</li>\n<li>Design data science approach, applying tried-and-true techniques or developing custom algorithms as needed by the business problem</li>\n<li>Collaborate with data engineers and platform architects to implement robust production real-time and batch decisioning solutions</li>\n<li>Ensure operational and business metric health by monitoring production decision points</li>\n<li>Investigate adversarial trends, identify behavior patterns, and respond with agile logic changes</li>\n<li>Communicate results of analyses to business partners and executives</li>\n<li>Research new technologies and methods across data science, data engineering, and data visualization to improve the technical capabilities of the team</li>\n</ul>\n\n<strong>Education &amp; Experience</strong>\n\n\n<ul>\n<li>Ph.D. in Computer Science, Machine Learning, Statistics, Operations Research or related field; or</li>\n<li>Ph.D. in Math, Engineering, Economics, or hard science with data science fellowship; or</li>\n<li>M.S. in related field with 3+ years experience applying data science to real business problems</li>\n</ul>"}