{"job title": "Machine Learning Engineer (Optimizer)", "company": "AppLovin", "city state": "– Palo Alto, CA", "rating": "4.8", "job description": "AppLovin offers a comprehensive platform where mobile game developers of all sizes can connect with their ideal consumers and get discovered. Founded in 2012, the company is focused on helping both indie and established developers grow with the expertise and insights they need to finance, market, and expand their businesses all in one place. App developers view AppLovin as a trusted partner, the rare company that understands what it takes to succeed in the mobile app ecosystem and has the ability to help them reach their goals. Learn more at www.applovin.com.\n<br><br>\nThe Palo Alto team comprises of smart, passionate engineers and data scientists who tackle challenging problems to scale mobile advertising to billions of users daily. We use Java, C++, Redis, Scala, Spark, Aerospike, Vertica, PHP, Chef, Jenkins, Github. We're looking for a Machine Learning Engineer to join our Optimizer team!\n<br><br>\n<strong>What You'll Do:</strong><br>\n<div>\n\n\n<ul>\n<li>Be responsible for architecting the ML models and how they're used in a production environment</li>\n<li>Given the opportunity to take your own ideas from hypothesis to A/B testing the solution in a live production environment</li>\n<li>Deal with real world challenges like sparsity of test data and real time updates for model.</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>You love to program, solve problems and build stuff</li>\n<li>Have knowledge of C++, Java, Scala</li>\n<li>2+ years of industry experience applying Machine Learning to large scale problems.</li>\n<li>Have a minimum of a BS and/or MS in Computer Science</li>\n</ul>\n\n</div>\n<br><strong>Perks:</strong>\n\n<ul>\n<li>Free medical, dental, and vision insurance</li>\n<li>Daily lunches and fully stocked kitchen</li>\n<li>Free public transit</li>\n<li>Free laundry service (wash/dry clean)</li>\n<li>Free gym membership</li>\n<li>401k matching</li>\n<li>Fun company parties and events</li>\n<li>Autonomy to make decisions in a rapidly growing company</li>\n<li>Flexible Time Off - work hard and take time when you need it</li>\n</ul>\nInterested? Send us your resume and let's talk!"}