{"job title": "Data Scientist", "company": "AppNexus", "city state": "– Portland, OR", "rating": "4.3", "job description": "<div><strong>Data Scientist</strong></div><div></div><div>Data Scientists are the creative thought leaders responsible for leveraging data to create automated systems for the efficient buying and selling of online advertisements. Our work drives algorithmic product innovation across the company. Data science projects underlie major features for both buyers and sellers on our platform, as well as the marketplace design for our ad exchange itself. It also plays a starring role in finding and eliminating fraudulent ad traffic from our platform. We work closely with engineers, product managers, operations, and sometimes directly with clients to create novel features and systems. We love that our contributions further AppNexus’ position as a pioneer and thought-leader in digital advertising. We are committed to creating real value for publishers and marketers and believe that better advertising creates value for marketers, addresses the societal problem of helping publishers monetize content, and will create a better internet experience for all.</div>\n<br>\n<div><strong>About the team:</strong></div><div>As a team, we have diverse set of backgrounds (math, physics, engineering, computer science, statistics, operations research, statistics, economics, political science) and a spectrum of credentials (about half have PhDs). Our culture centers on collaborating, continuously learning and teaching, and producing effective solutions, whether they rely on elegant theory, industry knowledge, or pragmatic use of available data. We value both mathematical rigor and empirical evidence, and employ hypothesis-testing (the scientific method!) whenever possible. We’re also friendly, laid back, and a little eccentric.</div><div><strong>About the</strong> <strong>job:</strong></div><div></div>\n\n<ul>\n<li>Use machine learning techniques, visualizations, statistical analysis, etc. to gain insight into various data sets – some of which are readily available, and some of which you create and curate yourself (using technology such as Hadoop, Hive, Spark, Python, Scala)</li><li>Research, design, simulate and/or prototype new algorithmic product features based on business needs</li><li>Analyze and evaluate the impact of changes to algorithms using a combination of traditional A/B test and observational test designs</li> <li>Spend a significant amount of time collaborating with team members</li><li>Communicate findings and solutions clearly to a variety of audiences, such as writing clear, comprehensive specs for engineers or explaining algorithmic concepts and results to product managers</li><li>Actively seek out a broad understanding of the AppNexus platform, product, and value proposition while aligning design efforts with that context</li><li>Work independently with minimal supervision but high accountability</li>\n</ul>\n\n<div></div><div><strong>About</strong> <strong>your skills</strong><strong> and experience</strong><strong>:</strong> </div>\n\n<ul>\n<li>Advanced degree in a highly quantitative field such as computer science (machine learning, data science), statistics, operations research, social science, applied math or physical science</li><li>Quantitative dissertation or 2+ years’ work experience doing machine learning or statistical modeling</li> <li>Coding proficiency in at least one common scripting or compiled programming language (Python, Java, and/or Scala a plus)</li><li>Proven excellence at formulating, understanding, and solving complex, non-routine problems</li><li>Hands-on attitude toward problem-solving, including a willingness to dig into data and quickly draw inferences or construct models / simulations</li><li>Aptitude for diving into learning new theory and new technology</li><li>Strong written and verbal communication skills</li><li>Ability to work in a highly interactive, collaborative, fluid environment</li><li>Experience working with large data sets is preferred but not required</li><li>Experience with any of the following is a plus: yield optimization, generalized linear models, support vector machines, ensemble methods, tree based learning, deep learning, reinforcement learning, contextual bandits, Bayesian inference, clustering, convex optimization, causal inference, experimental design, control theory, generalized additive models</li>\n</ul>\n\n<div></div>\n<br>\n<div><strong>More about you:</strong></div><div></div>\n\n<ul>\n<li>You are passionate about a culture of learning and teaching. You love challenging yourself to constantly improve, and sharing your knowledge to empower others</li><li>You like to take risks when looking for novel solutions to complex problems. If faced with roadblocks, you continue to reach higher to make greatness happen</li><li>You care about solving big, systemic problems. You look beyond the surface to understand root causes so that you can build long-term solutions for the whole ecosystem</li><li>You believe in not only serving customers, but also empowering them by providing knowledge and tools</li>\n</ul>\n\n<div></div><div></div>\n<br>\n<div><strong>AppNexus is proud to offer equal opportunity in all aspects of employment. We strive to foster a diverse, inclusive and engaging work environment. We welcome applications from all candidates and look forward to receiving yours! Our diversity in action:</strong></div><ul><li>Partnering with Path Forward to offer returnships to help caregivers reenter the workforce</li><li>Sharing feedback openly through roundtable discussions on how to make progress on our Diversity &amp; Inclusion goals</li><li>Galvanizing diversity and inclusion through our affinity groups (including OutNexus, AppNexus Women’s Network, AppNexus Latino Alliance and BlackNexus to name just a few!)</li><li>Partnering with Fairygodboss to support our commitment to women’s advancement in tech</li> \n</ul>\n\n<br>"}