{"job title": "Business Data Analyst, Appriss Health", "company": "Appriss", "city state": "– Jeffersontown, KY", "rating": "3.3", "job description": "Summary\n<br><br>\nGenerates ad hoc reports and regular datasets or report information for end-users using system tools and database or data warehouse queries and scripts. Integrates data from multiple sources to produce requested or required data elements. Programs and maintains report forms and formats, information dashboards, data generators, canned reports and other end-user information portals or resources. May create specifications for reports based on business requests. Manage web service integrations with point of sale vendors and field questions accordingly.\n<br><br>\nMinimum Requirements\n<br><br>\n<strong>Education</strong>\n\n\n<ul>\n<li>Bachelor's degree in a computer related field or equivalent experience.</li>\n</ul>\n\nKnowledge, Skills, Abilities, Experience, or Characteristics\n\n\n<ul>\n<li>2 years of experience collecting, processing and analyzing data feeds including error analysis and resolution involving internal and/or external customers.</li>\n<li>SQL knowledge with ability to write complex queries required.</li>\n<li>Experience writing Java, Perl or another commonly known programming language.</li>\n<li>Understands and possesses the ability to apply project lifecycle methodology.</li>\n<li>Experience defining software requirements, writing use cases, functional specifications and enhancement requests, and creating prototypes.</li>\n<li>Strong analytical background.</li>\n<li>Experience with multiple platforms; including mainframe, client/server, and web.</li>\n<li>Experience with web service integrations and ability to troubleshoot client issues.</li>\n<li>Excellent verbal and written communication skill, including strong questioning and listening skills; ability to look beyond obvious answers, and understand the impact on other areas is required.</li>\n</ul>\n\nHelpful / Preferred\n\n\n<ul>\n<li>Professional Registration and/or Master's degree.</li>\n<li>Experienced with MS Office, Visio, Visual Basic, SQL, and Linux environment preferred.</li>\n<li>Experience collecting and reporting data statistics.</li>\n</ul>\n\nPhysical and Mental Requirements\n<br><br>\nJob is physically comfortable; individual has discretion about walking, standing, etc.\n<br><br>\nJob requires a very high level of judgment, exceptional analytical ability and creativity in investigating major problems that require original and highly innovative solutions. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.\n<br><br>\nOther\n<br><br>\nSome travel may be involved for both training and customer facing issues.\n<br><br>\nDisclaimer\n<br><br>\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n<br><br>\nEqual Opportunity Employer - M/F/V/H"}