{"job title": "Data Scientist- Machine Translation", "company": "AppZen, Inc.", "city state": "– San Jose, California", "rating": "5.0", "job description": "<div>AppZen has developed the worlds first artificial intelligence (AI) solution for business process automation. AppZens AI for business solutions uses patent-pending natural language processing, computer vision and machine learning algorithms to analyze data and automate functions. Our technology is used to automate business processes for both small and large enterprises, including Fortune 50 organizations. The machine learning based technology automatically detects accidental and intentional fraud, providing real-time compliance to IRS rules, FCPA regulations, and general company policies.</div> <br>\n<div>We are looking for a Data Scientist to come and work on our growing AI stack. You will be working with a team of highly skilled and motivated data scientists and machine learning engineers. If you are excited about natural language understanding and machine translation, AppZen is the right place for you to apply and grow your skills.</div> Requirements:\n\n<ul>\n<li>Expertise in machine translation/transliteration: translation/transliteration from multiple languages such as Chinese, German, Spanish and/or French to English and vice versa a big plus</li><li>Proven background in machine learning and deep learning including neural machine translation, sequence-to-sequence models, etc.</li> <li>Hands-on experience with deep learning toolkits including Tensorflow, PyTorch, CNTK, Dynet, etc.</li><li>Ability to formulate a research problem, design, experiment and implement solutions in Python</li><li>Experience working with standard MT/NLP toolkits preferred, e.g. Moses, SRILM, Marian, T2T, Sockeye, etc.</li><li>Design and deployment of real-world, large-scale, user-facing MT systems preferred</li><li>Excellent spoken and written communication skills</li><li>Experience in building machine translation and natural language processing systems (e.g., commercial speech products or government speech projects)</li><li>Solid understanding of machine learning fundamentals, and familiar with standard algorithms and techniques.</li><li>Scientific thinking and the ability to invent</li><li>Solid software development experience.</li><li>You are a team player</li>\n</ul>\n\n<strong>Nice-to-haves:</strong>\n\n<ul>\n<li>Track-record of having developed novel algorithms, e.g. publications in one or more of the following: KDD, WWW, NIPS, ISWC, NAACL, ACL, SIGIR, EMNLP, ICML etc.</li><li>Fluent (verbal and written) in more than 1 language</li>\n</ul>"}