{"job title": "Scientist", "company": "Aptima", "city state": "– Arlington, VA", "rating": "3.8", "job description": "Aptima, Inc. is the market leader in optimizing human performance within complex, mission-critical systems. The company currently has an opening in our Learning and Training Systems (LTS) Division. Aptima is looking for individuals interested in working on and managing a variety of projects related to instructional strategy development, training needs analysis, lifelong learning, individual and team performance assessment, and training system development and evaluation.\n<br><br>\n<strong>Minimum Requirements:</strong>\n<ul>\n<li><strong><u>US Citizenship</u> </strong></li><li>Minimum of a Masters in Human Factors Psychology, Educational Psychology, Industrial/Organizational Psychology, Applied Psychology, Cognitive Science, or related field </li><li>Minimum of 3 years of relevant work experience</li><li>Experience managing projects, to include customer interfacing, planning and tracking tasking</li><li>Experience leading knowledge elicitation sessions with subject matter experts</li><li>Excellent written and verbal communication skills </li><li>Willingness to travel up to 25%</li>\n</ul>\n<strong>The ideal candidate also will have knowledge and experience in at least three of the following:</strong>\n<ul>\n<li>Defining measures for assessment for learning and performance</li><li>Domain analysis techniques such as task analysis, training needs analysis, training evaluation, system requirements analysis, etc.</li><li>Experimental design and statistical data analysis, and associated statistical software packages</li><li>Team and/or leader development</li> <li>Learning and development theory</li> \n</ul>\n<strong>Desired but not required:</strong>\n<ul>\n<li>History of leading winning proposals</li><li>Experience developing/delivering military training</li><li>Experience conducting research and collecting data within the military domain</li><li>Experience working in situations that are outside applicant's immediate area of expertise</li><li>Experience working with individuals from other disciplines to create and deliver innovative solutions and technology</li>\n</ul>\nAll applicants selected will be subject to a background investigation and must meet eligibility requirements for access to classified information.\n<br><br>\nAptima, Inc. participates in the US Government E-Verify Program. For more information, click on http://www.uscis.gov/e-verify.\n<br><br>\nEOE MINORITIES/FEMALES/PROTECTED VETERANS/DISABLED<br><br><strong>Job Posted by ApplicantPro</strong>\n<br>"}