{"job title": "Data Scientist Engineer", "company": "Aptiv", "city state": "– Troy, MI", "rating": "3.9", "job description": "Join our innovative team\n<br><br>\nWant to do more than just imagine the ways our world will move tomorrow? Here's your opportunity. Join the technology company that's transforming the future of mobility today.\n<br><br>\nAbout this position\n<br><br>\nWe currently have an exciting opportunity for a Data Scientist Engineer to develop strategy and methodology for data mining, analysis, and usage in our Active Safety department in our Troy, MI location.\n<br><br>\nResponsibilities and Duties\n\n\n<ul>\n<li>Responsibility for data handling/management</li>\n<li>Develop strategies and methodology for data analysis and mining</li>\n<li>Data mining for outliers to create world class autonomous driving systems</li>\n<li>Creating a solid and robust toolchain to organize, maintain and use data from various projects</li>\n<li>Define and use metrics to quantify the performance of next generation automated driving algorithms</li>\n<li>Provide estimates and insights about required and missing data</li>\n</ul>\n\nNeed to Haves (Basic Qualifications)\n\n\n<ul>\n<li>Ph.D. in Computer Science, Computer Engineering, Electrical Engineering, Physics, or Mathematics</li>\n<li>2+ years' experience in statistical analysis, data mining, data management, and deep learning and / or other modern machine learning methods</li>\n</ul>\n\nNice to Haves (Preferred Qualifications)\n\n\n<ul>\n<li>Practical experience in data science, statistics and analysis of large data sets</li>\n<li>Experience using data modeling tools to visualize data</li>\n<li>Experience in vision processing algorithms</li>\n<li>Experience in autonomous driving field</li>\n</ul>\n\nTraits we seek\n\n\n<ul>\n<li>Curiously investigate everything ability to solving problems analytically, creatively and collaboratively</li>\n<li>Lead with confidence thought leaders who empower those around them</li>\n<li>Learn by doing an entrepreneurial mindset that's driven by hands-on experimentation</li>\n<li>Embrace resilience seeing every challenge as a learning opportunity and invitation to grow</li>\n</ul>\n\nAptiv rewards and advantages\n\n\n<ul>\n<li>Competitive compensation with bonus potential</li>\n<li>Competitive health benefits</li>\n<li>401K with matching contribution</li>\n<li>Learning and development opportunities</li>\n<li>Discount programs with various manufacturers and retailers</li>\n<li>Recognition for innovation and excellence</li>\n<li>Opportunities to give back to the community</li>\n<li>Meaningful work that makes a difference in the world</li>\n<li>Relocation assistance (if applicable)</li>\n</ul>\n\nAbout Aptiv\n<br><br>\nAptiv is a global technology company that develops safer, greener and more connected solutions enabling the future of mobility. Headquartered in Dublin, Aptiv has approximately 150,000 employees and operates 14 technical centers, as well as manufacturing sites and customer support centers in 45 countries. Visit aptiv.com.\n<br><br>\nAbout Advanced Safety and User Experience\n<br><br>\nAdvanced Safety and User Experience encompasses our deep expertise in software, centralized computing platforms, advanced safety systems and automated driving focusing on five areas that are transforming mobility: Safety Electronics, Infotainment, User Experience, Autonomous Driving and Connectivity &amp; Security.\n<br><br>\nVisa sponsorship may be available for this position.\n<br><br>\n<strong>RSR</strong>\n<br><br>\nApply Online Ready to take the first step?\n<br><br>\nApply Now<br><br>SDL2017"}