{"job title": "Data Scientist", "company": "Aquilent", "city state": "– Columbia, Maryland", "rating": "3.1", "job description": "<strong>Employee Type:</strong>\n<br><br>\nFull-Time\n<br><br>\n<strong>Location:</strong>\n<br><br>\nColumbia, MD\n<br><br>\n<strong>Job Type:</strong>\n<br><br>\nScience\n<br><br>\n<strong>Experience:</strong>\n<br><br>\nNot Specified\n<br><br>\n<strong>Date Posted:</strong>\n<br><br>\n<strong>8/2/2018</strong>\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nJob Number: R*******\n<br><br>\nData Scientist, Mid\n<br>\n<strong>The Challenge:</strong>\n<br>\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors - from fraud detection, to cancer research, to national intelligence - you know the answers are in the data.\n<br><br>\nWe have an opportunity for you to use your analytical skills to improve national security infrastructure. You'll work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. You'll perform data analysis, develop algorithms, write scripts, build predictive analytics, and apply machine learning, and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help client leadership make informed decisions. You'll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in improving national security infrastructure.\n<br><br>\nEmpower change with us.\n<br><br>\n<strong>Build Your Career:</strong>\n<br>\nAt Booz Allen, we know the power of analytics and we're dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:\n<br>\naccess to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk\n<br>\na chance to change the world with the Data Science Bowl - the world's premier data science for social good competition\n<br>\nparticipation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government\n<br>\nYou'll have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We'll help you develop the career you want, as you chart your own course for success.\n<br><br>\n<strong>You Have:</strong>\n\n\n<ul>\n<li>2+ years of experience with quantitative analysis or modeling</li>\n<li>Experience with developing requirements for and building statistical or machine learning models</li>\n<li>Experience with scripting or scientific languages, including Python, R, Java, C++, or MATLAB</li>\n<li>TS/SCI clearance with a polygraph</li>\n<li>BA or BS degree in a quantitative field, including Statistics, Applied Mathematics, CS, Operations Research, Engineering, Business Administration, or Economics</li>\n</ul>\n\n<strong>Nice If You Have:</strong>\n\n\n<ul>\n<li>Experience with FOSS and COTS products in statistics, Monte Carlo or discrete event simulation, ETL processes, and quantitative workflow automation</li>\n<li>Experience with Microsoft Office, including Excel and Access</li>\n<li>Ability to consult with non-technical audiences on technical problems, work in a highly collaborative, team-oriented environment, and balance long and short-term tasking</li>\n<li>Ability to take poorly defined problems and convert them into questions for which practical solutions can be defined</li>\n<li>Ability to exhibit flexibility, initiative, and innovation to succeed in an ambiguous and fast-paced environment to compose client deliverable quality documentation, analysis, and reports</li>\n<li>Ability to be detail-oriented and organized</li>\n<li>MA or MS degree preferred; PhD degree a plus</li>\n</ul>\n\n<strong>Clearance:</strong>\n<br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance with polygraph is required.\n<br><br>\nWe're an EOE that empowers our people - no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran status - to fearlessly drive change.\n<br><br>\n<strong>CMD</strong>"}