{"job title": "Data Scientist", "company": "Arbela Technologies", "city state": "– North America (Remote)", "rating": "4.3", "job description": "<div><strong>Practice Area:</strong> BI\n<br>\n<strong>Location:</strong> North America (Remote)\n<br>\n<strong>Job Type:</strong> Full-time\n<br>\n<strong>Reports To:</strong> Director of BI\n<br>\n<strong>Years of Experience:</strong> 5+ years\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\na. Travel 25% or less for client kick offs, training customers and project go-lives (majority of work remote).\n<br><br>\nb. Work on 1-3 projects at a given time depending on project scope and size.\n\n<ul>\n\n\t<li>Project Type: Customer / Embed with D365 projects.</li>\n<li>Project Type: Customer / Not related to D365 projects.</li>\n<li>Project Type: BI-as-a-Service. Dedicated hours to BIaaS / Analytics-as-a-Service customer base.</li>\n</ul>\nc. Project approach: Agile = iterative and collaborative. Focused on Roles and Questions first before technology. This drives then all technical work to deliver fast and often. Win trust and user adoption and repeat as a template to roll out across org.\n<br><br>\nd. Project Tasks:\n\n<ul>\n\n\t<li>Working with Azure ML / Microsoft R Server for creating new predictive / prescriptive models.</li>\n<li>Working and expert level understanding of R / R-Studio.</li>\n<li>Experience deploying, optimizing and fine tuning production level models.</li>\n<li>Ability to assist in pre-sales for critical questions to best deliver a correct quote and set expectations with customers.</li>\n<li>Working with most common models for forecasting.</li>\n<li>Ability to perform data wrangling and data discovery for data inclusion / exclusion for developing effective predictive / prescriptive models.</li>\n<li>Work with Bi Architects, Developers and Power BI designers for effective end-to-end data story that the predictive / prescriptive models enable.</li>\n<li>Working with Microsoft AI / Cortona Cognitive Services.</li>\n<li>Documentation using Word / Visio / Excel / PowerPoint for project artifacts that complete total delivery to customer.</li>\n</ul>\ne. Work with team members to have a successful resourceful team (it is not about having all the answers, it is about being able to find the correct one).\n<br><br>\n<strong>About Arbela:</strong>\n<br><br>\nThis is a great opportunity for the right individual to join the market leader in the innovation and delivery of enterprise scale Microsoft solutions, help Arbela’s customers drive value through innovation, and be part of the Arbela success story.\n<br><br>\nArbela was recently named as one of the Best Places to Work in Orange County. Arbela offers its people superb working conditions such as career development and training programs, a very collaborative culture and a focus on customers and clients.\n<br><br>\n<strong>Full-Time Benefits:</strong>\n\n<ul>\n\n\t<li>A market leading salary</li>\n<li>Private healthcare</li>\n<li>Extended benefits, allowance and performance related bonus</li>\n<li>You’ll have ample opportunities for career growth and personal development</li>\n</ul>\nTo apply, email your cover letter and resume to careers@arbelatech.com.</div>\n<br>"}