{"job title": "Scientist 1", "company": "ARCADIS US", "city state": "– SC, Greenville", "rating": "3.7", "job description": "<strong>HR Job Title</strong>\n<br>\nScientist 1\n<br><br>\n12-Nov-2018\n<br><br>\n<strong>Business Line</strong>\n<br>\nEN Environment\n<br><br>\n<strong>Job Description</strong><br><br>Arcadis is seeking a detail-oriented, well-organized and dependable Geologist, Scientist or Engineer to serve in our Greenville, South Carolina office. The successful candidate will work as part of a project team completing a range of tasks from field sampling to data analysis and reporting. This full-time position requires strict adherence to health and safety procedures, attention to detail, strong work ethic, and excellent communication skills. ARCADIS’ annual performance-based evaluations provide an opportunity for candidates to advance their career within the company.\n<br><br>\nThe successful candidate may participate in or oversee in a combination of field and office related tasks:\n<br>\nField activities may include the following:\n<ul>\n<li>Oversight of drilling operations (installing monitoring wells and soil or rock descriptions)</li><li>Soil, groundwater, and air sampling in compliance with State and Federal standards</li><li>Implementation of injection or other in-situ based remedial technologies</li><li>Oversight of system remedial system installations</li><li>Subcontractor oversight</li><li>Aquifer testing</li>\n</ul>\n\n<strong>Office responsibilities may include the following:</strong>\n\n<ul>\n<li>Data management (compilation, manipulation, and evaluation of data)</li><li>Assisting with writing and preparing technical reports, work plans, letters, and memoranda</li><li>Preparing cost estimates and proposals</li><li>Coordinating work schedules with subcontractors</li><li>Figure/map/boring log production</li> \n</ul>\n\n<strong>Requisition ID</strong>\n<br>\n<strong>9464BR</strong>\n<br><br>\n<strong>Time Type</strong>\n<br>\nFull-Time\n<br><br>\n<strong>Required Qualifications</strong>\n\n<ul>\n<li>Minimum years of experience: 0-2 Years</li><li>Education required: Bachelors Degree</li> <li>Strong collaboration skills with the ability to work well within a team</li><li>Excellent computer, verbal and written communication skills, including the ability to communicate with project teams, clients, and regulators</li><li>Must be agile and capable of efficiently completing assignments by working independently and in teams to maintain schedules and budgets</li><li>The capability of performing field and office; field work may require overnight travel</li> \n</ul>\n\n<strong>Posting Location</strong>\n<br>\nSC, Greenville\n<br><br>\n<strong>Job Category</strong>\n<br>\nEngineering - Environmental\n<br><br>\n<strong>Business Title</strong>\n<br>\nJunior Environmental Scientist or Engineer\n<br><br>\n<strong>Preferred Qualifications</strong>\n\n<ul>\n<li>Education preferred: Masters Degree</li><li>EIT/GIT certification with ability to obtain PE/PG</li><li>Ability to develop relationships and network</li><li>Current OSHA HAZWOPER 40 hr / 8 hr training</li><li>Local candidates preferred</li>\n</ul>\n\n<strong>Employment Type</strong>\n<br>\nRegular\n<br><br>\n<strong>Required Driving Statement</strong>\n<br>\nThis position requires a current valid driver’s license and clean driving record.\n<br><br>\n<strong>Employer Statement</strong>\n<br>\nWe are an equal opportunity and affirmative action employer. Women, minorities, people with disabilities and veterans are strongly encouraged to apply. We are dedicated to a policy of non-discrimination in employment on any basis including race, creed, color, religion, national origin, sex, age, disability, marital status, sexual orientation, gender identity, citizenship status, disability, veteran status, or any other basis prohibited by law.\n<br><br>\n<strong>What country will this position be in?</strong>\n<br>\n<strong>USA</strong>\n<br><br>\n<strong>Why Choose Arcadis</strong>\n<br>\nArcadis is the leading global design and consulting firm for natural and built assets, and we invite you to join us in partnering with our clients to deliver truly exceptional and sustainable outcomes. Contribute to the world’s most high-profile and transformative projects, from shopping centers in Shanghai and improved traffic flow in Atlanta to state-of-the-art rail systems in Doha, coastal defenses for Manhattan and cleaner air in Los Angeles.\n<br><br>\nWork alongside the industry’s foremost thought leaders and accomplished professionals, generating effective, real-world results. We are Arcadis: 27,000 people in more than 70 countries, creating value by applying our collective wisdom to every challenge. Our culture is collaborative, we believe in diversity and the power of global teamwork, and we own the responsibility to sustain the Earth and its people in a safe and balanced way.\n<br><br>\nArcadis. Improving quality of life.\n<br><br>\n<strong>About This Business Line</strong>\n<br>\nNow more than ever, businesses and governments recognize the need to incorporate environmental concerns into their decision making. As the leader in global environmental services, Arcadis has provided innovative and sustainable solutions to some of the world’s most complex projects. We literally wrote the book on environmental remediation, and our experts continue to pioneer the development and application of cutting-edge approaches in environmental planning, site evaluation, environmental construction and strategic environmental consulting as well. Join us in making a cleaner, safer world a reality.\n<br><br>\n<strong>Visa Sponsorship</strong>\n<br>\nNo\n<br>"}