{"job title": "Data Scientist", "company": "Arimo", "city state": "– Mountain View, CA", "rating": "4.6", "job description": "<div>Independently named by FastCompany as one of the worlds most innovative companies in data science, Arimos Behavioral AI software is aimed at delivering predictive insights in commercial IoT applications.\n<br><br>\nArimo's capabilities harness the behaviors of machines, devices, customers, and other entities to provide the most accurate predictions utilizing Deep Learning. With Arimo Behavioral AI, leading companies are creating competitive advantage through new predictive insights, and delivering new services to their customers.\n<br><br>\nOur strong team includes executives with deep product and engineering experience. They have held senior positions at Google, Yahoo, Amazon, SAP, Microsoft, and VMware. Team members hold advanced degrees in computer science and business from leading universities. Arimo was previously funded by Andreessen Horowitz, Lightspeed Ventures, and Bloomberg Beta. To learn more, visit us at https://arimo.com.\n<br><br>\nArimo is growing rapidly and now offering a position for <strong>Data Scientist</strong>. Passionate about digging into massive data sets and extracting data-driven insights to address complex business problems through analysis and visualization? Join us and be a part of this exciting journey!\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Extract, analyze, and apply data-mining and machine learning techniques to large structured and unstructured datasets</li><li>Design and analyze experiments to test new features &amp; products</li><li>Develop new algorithms and models for product improvement</li><li>Work with product managers, designers, and engineers to build new features and products</li>\n</ul>\n<strong>Required Skills and Qualifications</strong>\n<ul>\n<li>2+ years of experience working with large amounts of real data</li><li>Expertise in at least one statistical software package, preferably R</li><li>Experience with visualization tools such as d3, matplotlib, ggplot</li><li>Experience with ETL &amp; ML tools in R, Python, and Java such as scikit-learn, pandas, matplotlib, statsmodel, iPython, Weka</li><li>Proficiency in SQL</li><li>Advanced skills in a scripting language such as Python</li><li>Experience in Hadoop/Spark and/or other MapReduce paradigms is a plus</li><li>Experience in Deep Learning is a plus</li><li>Ability to translate business objectives into actionable analyses</li><li>Ability to communicate findings clearly to both technical and non-technical audiences</li><li>Top-down thinker, excellent communicator, and excellent problem solver. Must be an active team player</li><li>Open-minded and excited to learn new things. Have strong opinions but willing to change with new data</li><li>Ms/Ph.D. in a CS or related discipline with domain expertise in Machine Learning, Statistics, Information Retrieval, or Graph Analysis</li>\n</ul>\nArimo offers competitive compensation packages commensurate with your experience. Offer includes full benefits, company stock options, continual career &amp; compensation growth, and many other perks.</div>\n<br>SDL2017"}