{"job title": "Finance &amp; Data Analyst, Senior", "company": "Aristocrat Technologies", "city state": "– Tulsa", "rating": "3.3", "job description": "<strong>Job Posting Title</strong>Finance &amp; Data Analyst, Senior<strong>Summary</strong>The Senior Finance &amp; Data Analyst is responsible for preparing and distributing accurate EGM and Operational statistical summary reports based on the predefined report schedule. The Senior Finance &amp; Data Analyst will pro-actively, and as requested, prepare analysis and recommendations to maximize revenue of existing or expanding product base. The Senior Finance &amp; Data Analyst will provide guidance to other Finance &amp; Data Analysts and performs other duties as assigned.<strong>What you'll do</strong><br><br>The Senior Finance &amp; Data Analyst is responsible for preparing and distributing accurate EGM and Operational statistical summary reports based on the predefined report schedule. The Senior Finance &amp; Data Analyst will pro-actively, and as requested, prepare analysis and recommendations to maximize revenue of existing or expanding product base. The Senior Finance &amp; Data Analyst will provide guidance to other Finance &amp; Data Analysts and performs other duties as assigned.<br><br><strong>What we're looking for</strong><br><br><u><strong>Essential Duties and Responsibilities</strong></u>\n<ul>\n<li>Prepare and distribute EGM reports based on predefined schedule.</li></ul>\n\n<ul>\n<li>Communicate with sales staff and other departments.</li><li>Conduct statistical analysis on accumulated game performance data.</li><li>Analyze and offer recommendations to sales staff on denomination mix, model types, and game types to insure maximum revenue.</li><li>Accompany Sales Account Manager as requested to customer locations, including but not limited to routine visits and annual account reviews.</li><li>Maintain relationships with other departments necessary in achieving company goals.</li><li>Follow State and Tribal Gaming Regulations and company policies and procedures.</li><li>Provide guidance to Finance &amp; Data Analysts.</li>\n</ul>\n<u><strong>Knowledge and Skill Requirements</strong> </u>\n<ul>\n<li>Microsoft Office\n<br>\n<strong></strong><ul><strong></strong><li><strong>Advanced Excel Skills to include:</strong>\n\n<ul>\n<li>Macros</li><li>Pivot Tables</li></ul></li>\n</ul>\n</li>\n<li>Knowledge of Tableau</li><li>Customer Focused</li><li>Communications (oral and written)</li><li>Teamwork</li><li>Adaptability/Flexibility</li><li>Quality Control</li><li>Planning and Organizing</li><li>Statistical Analysis/Statistical Modeling</li><li>Analyzing Information/Problem Solving</li><li>Initiative</li>\n</ul>\n<u><strong>Education, Work Experience and other Qualifications</strong></u>\n<br><br>\nBachelor’s degree in Finance, Sales, Marketing, or Business with minimum five years of job related experience or equivalent combination of education and experience.\n<br><br>\nMinimum two years’ work experience with casinos or gaming manufacturers preferred, in one or more of the following areas:\n<ul>\n<li>Slot analysis</li><li>Slot management</li><li>General casino operations</li><li>Casino accounting or auditing</li></ul>\n\n<ul>\n<li>Must be able to travel primarily within Oklahoma with occasional travel outside of Oklahoma</li><li>Must be eligible to obtain gaming licenses, if required, to work with various casino locations and tribes</li><li>Must have satisfactory motor vehicle report</li>\n</ul>\n<u><strong>Physical Demands</strong></u>\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<ul>\n<li>Must be able to maneuver around an office setting, work at a desk/work station and respond to written and oral cues.</li> <li>Must have the manual dexterity to operate a computer and other necessary office equipment.</li>\n</ul>\n<u><strong>Work Environment</strong></u>\n<br><br>\nWork and office area is primarily a climate-controlled environment. While performing duties outside the normal responsibilities of the position, the employee may be exposed to a smoking environment with noise levels ranging from quiet to loud. The employee may also occasionally be exposed to adverse weather conditions. Working conditions may also occasionally consist of moving and working around customers of casinos.<br><br><strong>Why Aristocrat?</strong>\n\n<ul>\n\n<li>World Leader in Gaming Entertainment</li>\n<li>Robust benefits package</li>\n<li>Global career opportunities</li>\n<li>Our core values: Respect, Courage, Integrity and Passion</li>\n</ul>\n<br>\n<strong>Our Winning Ways</strong>\n\n<ul>\n<li>Unite - Come together as one team, with one vision</li><li>Develop - Empower, inspire and grow our people</li><li>Deliver - Execute with excellence, be accountable for results</li><li>Play - Be creative, celebrate success</li>\n</ul>\nThe US based roles may require registration with the Nevada Gaming Control Board (NGCB) and/or other gaming jurisdictions in which we operate.<br><br><strong>Location</strong>Tulsa, OK, US<strong>Job family</strong>FP&amp;A<strong>Contract Type</strong>Regular<strong>Time Type</strong>Full time"}