{"job title": "Scientist - BioPhysics (Biotech)", "company": "Array BioPharma", "city state": "– Boulder, CO", "rating": "3.3", "job description": "<strong>Company:</strong>\n<br><br>\nArray BioPharma is a biopharmaceutical company headquartered in Boulder Colorado, with additional sites in North Carolina and Massachusetts that focus on the discovery, development and commercialization of targeted small molecule drugs to treat patients afflicted with cancer. We are a fully integrated, commercial biopharmaceutical company and received our first approval in late June.\n<br><br>\n<strong>Summary:</strong>\n<br><br>\nArray is open to varying levels of experience for this opening. It will reside in our Boulder, CO location, and will join Array's structural biology team and play a key role in developing and running biophysical assays to support multiple small molecule drug discovery projects. Accordingly, the candidate must be experienced in various biophysics techniques required for supporting hits-finding, lead generation, and lead optimization efforts, with an emphasis on surface plasmon resonance (SPR) and mass spectrometry (MS). The candidate should also have significant experience with protein expression, purification and characterization.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Develop biophysical assays that will be used in the screening and characterization of small molecule inhibitors</li>\n<li>Validate hits from screening efforts and determine the mechanism of action and selectivity of inhibitors</li>\n<li>Collaborate with scientists from chemistry and enzymology to advance compounds through hits-to-lead and lead optimization stages</li>\n<li>Serve as an integral member of the structural biology group and the biophysics expert of small molecule drug discovery project teams</li>\n<li>Process and document experimental data contribute to written and oral presentations related to work being conducted</li>\n</ul>\n\nSkills and Requirements\n<br><br>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>PhD in relevant discipline with 3+ years of postgraduate research experience with an emphasis on investigation of protein-ligand interactions using SPR and/or LC-MS techniques (Level determined by experience)</li>\n<li>Pharma/biotech experience preferred</li>\n<li>Hands-on experience in SPR and/or mass spectrometry, including equipment maintenance</li>\n<li>Proven expertise in assay development using standard biophysical techniques (SPR, ITC, DSF, etc.)</li>\n<li>Experience in protein expression, purification and characterization</li>\n<li>Able to work as a member of multidisciplinary team to effectively support and contribute to the overall success of the project</li>\n<li>Possesses a passion in and ability to learn new biology, approaches and techniques and readily apply those learnings to immediate challenges</li>\n</ul>"}