{"job title": "Data Scientist", "company": "Aruba Networks", "city state": "– Santa Clara, California", "rating": "3.5", "job description": "Aruba, a Hewlett Packard Enterprise Company, is a leading provider of next-generation networking solutions for the mobile enterprise: http://www.arubanetworks.com/company/about-us.\n<br><br>\nAruba designs and delivers Mobility-Defined Networks that empower IT departments and #GenMobile, a new generation of tech-savvy users who rely on their mobile devices for every aspect of work and personal communication. To create a mobility experience that #GenMobile and IT can rely upon, Aruba Mobility-Defined Networks automate infrastructure-wide performance optimization and trigger security actions that used to require manual IT intervention. The results are dramatically improved productivity and lower operational costs.\n<br><br>\nAruba NetInsight is a cloud-based service that delivers actionable guidance for improving network performance and the quality of users mobile experience via continuous monitoring, analysis, and benchmarking. Using powerful machine learning algorithms and Arubas extensive wireless expertise, NetInsight provides IT organizations with the intelligence needed to proactively optimize how data, voice, and video applications perform across the entire network.\n<br><br>\nWe have an exciting opportunity for a Data Scientist to join our team.\n<br><br>\n<strong>What You'll Do</strong>\n<ul>\n<li>Work with domain experts to identify and formalize machine learning problems for wireless and wired network diagnostics, root causing, problem remediation, and optimization</li><li>Discover new problem signatures in customer networks</li><li>Design, implement, and validate machine learning algorithms on big data</li><li>Guide and oversee deployment of implemented machine learning solutions and monitor their operation</li>\n</ul>\n<strong>Our Minimum Requirements for this role are</strong>\n<ul>\n<li>M.S. or Ph.D. in Statistics, Computer Science, or another quantitative field</li><li>Strong background in statistical and machine learning techniques such as deep learning, anomaly detection, clustering and ranking of events, time series analysis, event stream mining, hypothesis testing</li><li>Great at communicating concepts and results; strong data visualization skills</li><li>Expert Python coder (PySpark, Scikit-learn); experience with software engineering best practice</li>\n</ul>\n<strong>Additional preferred skills</strong>\n<ul>\n<li>2+ years of relevant industry experience in data science, machine learning</li><li>Experience with online learning algorithms, reinforcement learning, semi-supervised learning, or mixed time-series/event streams</li><li>Familiarity with wireless and wired networking protocols</li><li>Proficiency in big data computing infrastructure (Hadoop ecosystem)</li>\n</ul>\n1035812"}