{"job title": "Senior Data Scientist", "company": "Arvato Finance Services Ltd", "city state": "– Seattle, Washington", "rating": "3.1", "job description": "Back to search results\n<br><br>\nSearch by Job Title or Keyword\n<br>\nSearch by Location / Postal Code\n<br><br>\nSend me alerts every days alert frequency on certain days\n<br>\nCreate Alert\n<br><br>\nSend me alerts every days alert frequency on certain days\n<br><br>\nSenior Data Scientist\n<br><br>\nDate: 15-Nov-2018\n<br>\nLocation: Seattle, WA, US, 98101\n<br>\nYear: 2018\n<br><br>\nCompany: Arvato Digital Services LLC - Arvato FS USA\n<br>\nRequisition ID: 14981\n<br><br>\n<strong>Overall Job Purpose:</strong>\n<br>\nThis role will be located in Seattle, WA. Reporting to the Director Analytics &amp; Consulting Services and working closely with the Global Client Lead, Project Manager and Sales Manager, the (Senior) Data Scientist develops and runs analytical models deploying various Machine Learning algorithms and Advanced Analytics tools. This also includes pre-sales support (consultative selling) in close collaboration with our sales team.\n<br><br>\nThe (Senior) Data Scientist acts as the key point of contact for all data driven questions of our clients in order to deliver Financial Advanced Analytics projects along the Order-2-Cash process. Key areas:\n\n\n<ul>\n<li>Create a data-driven culture</li>\n<li>Ensure the client data is relevant, connected, accurate and consumable</li>\n<li>Utilize machine Learning &amp; Advanced Analytics capabilities to predict what will/could happen, and identify risks</li>\n<li>Improve Operational Excellence of our clients: Continuously improve the speed, efficiency and accuracy of capabilities, processes, and solutions</li>\n</ul>\n\nThe (Senior) Data Scientist is part of the Arvato Analytics &amp; Consulting Services team that supports through Data Intelligence Services, Advanced Applications &amp; Analytics services, Reporting Services and Program Management Services in an onshore/offshore mix with our partner.\n<br><br>\nJob Duties\n\n\n<ul>\n<li>Provide data-driven business insights and analytics support along the customer life cycle/order-2-cash process</li>\n<li>Work closely with the Analytics &amp; Consulting Services team to spearhead and implement business analytics models and to deliver end-to-end client requests that are of high quality and in a timely fashion</li>\n<li>Develop innovative and effective approaches to solve client's analytics problems and communicate results and methodologies</li>\n<li>Apply advanced statistical and predictive modeling techniques to build, maintain, and improve on multiple real-time decision systems</li>\n<li>Identify what data is available and relevant, including internal and external data sources, leveraging new data collection processes such as smart meters and geo-location information or social media</li>\n<li>Perform extensive data pulls and create datasets for business users to enable clients to build self-serving reports and dashboards</li>\n<li>Develop and maintain reports and dashboards as per client requests and meet client expectations</li>\n<li>Proactively mine and analyze data in order to find meaningful patterns and derive process improvements in order to discuss results with the Business Consultant and/or client</li>\n<li>Develop and maintain structured process documents, methodology documents and data dictionaries</li>\n<li>Provide necessary documentation to enable business users to build self-serving reports and dashboards wherever necessary</li>\n<li>Acclimatize to new technologies and situations with ease, completing multiple assignments simultaneously while maintaining high standards</li>\n</ul>\n\nKey Result Areas\n\n\n<ul>\n<li>Lead data discovery processes with client stakeholders to identify the business requirements and the expected outcome to be able to build impactful analytical models</li>\n<li>Acquire data from primary or secondary data sources and maintain databases/data systems</li>\n<li>Identify, analyze, and interpret trends or patterns in complex data sets</li>\n<li>Create dashboards for visualizing the data</li>\n<li>Provide and support with meaningful presentations about data insights and related business impact</li>\n<li>Transfer data insights into business related statements and respective impact</li>\n<li>Formulate and document based on use case specifications, business rules and requirements</li>\n<li>Effective planning skills to successfully manage multiple priorities and assignments</li>\n</ul>\n\nPerson Spec and Competencies (Please read in conjunction with the Key Result Areas)\n<br><br>\n<strong>Essential Qualifications, Training and Experience:</strong>\n\n\n<ul>\n<li>Bachelor's/Master's/PhD degree in Math, Computer Science, Information Systems, Machine Learning, Statistics, Econometrics, Applied Mathematics, Operations Research or related technical degrees</li>\n<li>Strong footprint (5+ five) in analytical modeling and developing statistical models as well as applying machine learning algorithms</li>\n<li>Highly proficient and experience in working on data modeling projects using e.g. SAS, R, Python, Azure ML, KNIME, SQL</li>\n<li>Experience working in projects following Agile software development life-cycle methodologies</li>\n</ul>\n\n<strong>Desirable Qualifications, Training and Experience:</strong>\n\n\n<ul>\n<li>Strong experience in SQL, R, Python, SAS, Tableau, Power BI or equivalent tools</li>\n<li>Background in Statistics/Operations research</li>\n</ul>\n\n<strong>Personal Attributes required:</strong>\n\n\n<ul>\n<li>Highly customer focused with excellent analytical and problem-solving skills</li>\n<li>Highly motivated self-starter who is innovative and quick to learn</li>\n</ul>\n\nExcellent communication and interpersonal skills\n<br><br>\n'Arvato Financial Solutions is an Equal Opportunities Employer, Embracing Diversity in the workplace'\n<br>\nDisclaimer\n<br>\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.\n<br><br>\n<strong>About our company:</strong>\n<br>\nArvato - the spirit of solutions!\n<br><br>\nWe at Arvato provide a comprehensive range of services and solutions to our business partners in the consumer electronics, high-tech, telecommunication, networking and industrial sectors. With more than five decades of experience and our global footprint we create value for our customers and ensure that they are well equipped for the challenges of their markets.\n<br><br>\nArvato is a part of Arvato AG/ Bertelsmann, an internationally networked outsourcing provider. More than 65,000 employees design and implement solutions for all kinds of business processes across integrated service chains, for business customers from around the world. Its portfolio includes all services related to the creation and distribution of printed materials and digital storage media, as well as data management, customer care, CRM services, supply-chain management, digital distribution, financial services, professional and custom IT services, and the direct-to-customer distribution of educational media. Arvato is a wholly-owned subsidiary of Bertelsmann SE &amp; Co. KGaA.\n<br><br>\nNearest Major Market: Seattle\n<br>\nJob Segment: Scientific, Database, Telecom, Telecommunications, Scientist, Engineering, Technology, Science\n<br><br>\n<strong>Find Global Jobs:</strong>\n<br>\nCYOC, arvato United States, Arvato FS US Job Opportunites, Arvato FS Job Opportunities, Arvato Financial Solutions Job Opportunities\n<br><br>\nLog on\n<br><br>\nWe noticed that you are already a candidate of our Talent Community. Please enter your password to continue.\n<br><br>\nEmail*\n<br>\nNot you?\n<br>\nPassword*\n<br>\nForgot Password?\n<br>\nSubmit Cancel\n\n\n<ul>\n<li>required field</li>\n</ul>\n\nLog on\n<br><br>\nWe noticed that you are already a candidate of our Talent Community. Please enter your password to continue.\n<br><br>\nEmail*\n<br>\nNot you?\n<br>\nPassword*\n<br>\nForgot Password?\n<br>\nSubmit Cancel\n\n\n<ul>\n<li>required field</li>\n</ul>\n\nAccount Verification\n<br><br>\nWe noticed you have accounts in our 'Talent Community' and 'Application' systems. We take security seriously and need to verify your identity to synchronise your accounts.\n<br>\n<strong>Account Email:</strong>\n<br><br>\nPlease follow these steps to synchronise your accounts.\n<br>\n<strong>\n<ul>\n<li>Reset your password:</li>\n</ul>\n\n</strong>\n<br>\nThe 'reset password' link will open in a new browser window. Return to this page to enter your new password.Click here to reset your Password\n<br>\n<strong>\n<ul>\n<li>Enter your new password here:</li>\n</ul>\n\n</strong>\n<br>\nSubmit Cancel\n<br><br>\nAccount Verification\n<br><br>\nWe noticed you have accounts in our 'Talent Community' and 'Application' systems. We take security seriously and need to verify your identity to synchronise your accounts.\n<br>\n<strong>Account Email:</strong>\n<br><br>\nPlease follow these steps to synchronise your accounts.\n<br>\n<strong>\n<ul>\n<li>Reset your password:</li>\n</ul>\n\n</strong>\n<br>\nThe 'reset password' link will open in a new browser window. Return to this page to enter your new password.Click here to reset your Password\n<br>\n<strong>\n<ul>\n<li>Enter your new password here:</li>\n</ul>\n\n</strong>\n<br>\nSubmit Cancel\n<br><br>\nAccount Verification\n<br><br>\nYour accounts have been successfully synchronised. Use your new password when accessing our systems.\n<br><br>\nConfirm\n<br><br>\nAccount Verification\n<br><br>\nYour accounts have been successfully synchronised. Use your new password when accessing our systems.\n<br><br>\nConfirm\n<br><br>\nAlready a Candidate\n<br><br>\nYou are already a user of this site. Please log on.\n<br><br>\nEmail*\n<br>\nNot you?\n<br><br>\nPassword*\n<br><br>\nForgot Password?\n<br>\nLog on Cancel\n\n\n<ul>\n<li>required field</li>\n</ul>\n\nAlready a Candidate\n<br><br>\nYou are already a user of this site. Please log on.\n<br><br>\nEmail*\n<br>\nNot you?\n<br><br>\nPassword*\n<br><br>\nForgot Password?\n<br>\nLog on Cancel\n\n\n<ul>\n<li>required field</li>\n</ul>\n\nStart Your Application\n<br><br>\nExisting Users\n<br><br>\nEmail*\n<br>\nPassword*\n<br><br>\nForgot Password?\n<br>\nLog on\n\n\n<ul>\n<li>required field</li>\n</ul>\n\nNew Users\n<br>\nCreate a new account now!\n\n\n<ul>\n<li>Start Your Application</li>\n<li>Receive Email Updates</li>\n<li>Join our Talent Community</li>\n</ul>\n\nCreate\n<br><br>\nCreate Profile\n<br><br>\nWorking...Next\n<br><br>\nCreate Profile\n<br><br>\nWorking...Next"}