{"job title": "Data Scientist", "company": "Asana", "city state": "– New York, NY", "rating": "4.7", "job description": "The Data team works closely with our product, customer success, and sales teams; we help ask questions the right way… and then find those answers. Our data informs us of the impact we are having on the world, and our team is crucial to architecting and building our data infrastructure. We also design and use data analysis tools that increase our data’s scalability, accuracy, and accessibility. We understand our company’s goals and proactively inform their direction with data so that our product can help more teams do great things. We are looking for the first New York-based Data Scientist, who will collaborate closely with both New York product teams and the rest of the Data team, based in San Francisco.\n<br>\n<br>\n<strong>Typical responsibilities:</strong>\n\n<li>Designing and analyzing experiments to measure the impact of new product features</li>\n<li>Investigating high-level questions like “What are the collaborative patterns of the most successful teams using Asana?”</li>\n<li>Adding new metrics and aggregations to our data warehouse to make new classes of questions answerable</li>\n<li>Building models to predict the growth trajectory of different customer segments</li>\n\n<strong>Requirements:</strong>\n\n<li>3+ years of experience in applying data science techniques to drive technical product development and decision-making</li>\n<li>Strong technical background in computer science, statistics, math, information science, or another quantitative field</li>\n<li>Fluency in at least one modern language useful for data processing (e.g. Python, Scala)</li>\n<li>Proficiency with relational data modeling and SQL</li>\n<li>Expertise in statistical methods and experimental design and analysis</li>\n\n<strong>Desirable:</strong>\n\n<li>Familiarity with distributed data processing systems (e.g. Spark, Redshift)</li>\n<li>Background in advanced statistical modeling (e.g. GLM, mixed effects) and/or machine learning</li>\n<li>Experience collaborating with teammates in other locations</li>\n\nDoes the above sound like it might be you? Then we’d love to hear from you. Our goal is to provide a hiring and working experience in which all people know they are equally respected and valued. So whatever it is that makes you unique—your gender identity or expression, sexual orientation, religion, ethnicity, age, citizenship, educational background, socioeconomic status—we value it, and we’d love to see what you might add to our team."}