{"job title": "Director, Data Engineering", "company": "ASCAP", "city state": "– New York, NY", "rating": "2.8", "job description": "ASCAP is home to more than 625,000 music creator members across all genres - the greatest names in music, and thousands more in the early stages of their careers. We are the world leader in performance royalties, advocacy and service for music creators, and are the only PRO in the US run by its members including songwriters, composers and music publishers.\n<br><br>\nASCAP technologists live our mission and we are passionate about what we do for our customers and we practice what we preach. Our technologists serve with humility and a deep respect for their responsibility in helping our business partners and members achieve their goals and realize their dreams. We have an infectious and lively culture and we recognize our successes monthly at our Thursday on-site social hour celebrations. We stand behind our mission and are committed to delivering the impossible.\n<br><br>\nBottom line? We outthink ordinary. Discover what you can do with technology at ASCAP!\n<br><br>\nWe are looking for someone passionate about data to help define our data strategies, grow our capabilities, and build our platform team. The person in this role will be focused on developing the foundations for critical data products, including real time business metrics and analytics capabilities. The role requires managing a team vital in supporting and collaborating with groups including Data Analytics/BI/Product, as well as our core backend API team. We are highly focused on giving ownership and responsibility to autonomous teams, using the right tools for the job, and building flexible architectures.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\n\t<li>Provide day-to-day work management, technical guidance, strategic direction, problem resolution, and career path development for Data Engineering team.</li>\n\n<li>Architect, design and implement scalable ETL and data processing systems to handle the big data ecosystem including data collection, processing, ETL and DWH.</li>\n\n<li>Build real time capabilities and insight into product metrics to help product managers and BI/Analytics understand and optimize product features and guide product decisions.</li>\n\n<li>Build internal Reporting and Analytics platform on top of our Big Data Lake.</li>\n\n<li>Represent and communicate team capabilities and engineering priorities across the organization.</li>\n\n<li>Contribute to the codebase, architect and design new systems, and participate in code review.</li>\n\n<li>Manage data infrastructure, and strategic decisions, to grow and support the team as well as the organization as it relates to Data Platform.</li>\n</ul>\n<strong>Required Skills:</strong>\n\n<ul>\n\n\t<li>Experience managing or leading small to medium sized engineering teams in a dynamic environment</li>\n\n<li>Passion for building world-class data platforms that support a global customer base</li>\n\n<li>Assertive, take-charge, proven manager, team player with a strong results orientation, positive can do attitude, and a sense of urgency to get things done</li>\n\n<li>Solid engineering background and understanding of programming languages such as Python, Java, Scala or equivalent</li>\n\n<li>10 years of progressive experience in data infrastructure development, with a track record of successful high quality deliveries</li>\n\n<li>Experience leading and managing technical teams in data and agile engineering best practices</li>\n\n<li>Proven execution skills and ability to successfully execute against strategy in cooperation with other functions</li>\n\n<li>Ability to apply both technical competence and interpersonal skills to achieve business outcomes</li>\n\n<li>High emotional intelligence, sound temperament and professional attitude</li>\n\n<li>Provide clear, consistent leadership, management and mentoring for direct reports and the broader technology organization</li>\n\n<li>Strong understanding of SQL, experience with key databases such as Oracle, Vertica, Redshift, etc.</li>\n\n<li>Deep knowledge of the Hadoop and the surrounding ecosystem.</li>\n\n<li>Solid understanding of real time and batch data processing framework such as Hadoop, Spark, Flink, etc.</li>\n\n<li>Proven track record facilitating and realizing product goals through effective communication across an organization.</li>\n\n<li>Experience in continuous deployment and testing.</li>\n\n<li>Experience with key Data technologies, such as Hadoop, Storm, Kafka, SQL, NoSQL, Cassandra, Redshift, MapReduce, MongoDB, Cassandra, Postgres</li>\n\n<li>Bachelor's degree in Computer Science or equivalent</li>\n</ul>\n<strong>What We Love About You:</strong>\n\n<ul>\n\n\t<li>You love our users. You deeply understand our users and put them at the center of everything you do. You aim to serve and delight them every day.</li>\n\n<li>You do the right thing. You are respectful and act with the highest integrity. If you see something that isn't right, you say something.</li>\n\n<li>You debate it. You ask questions to understand a perspective and are comfortable respectfully challenging assumptions. You are not turned off by constructive conflict to get to the right answer.</li>\n\n<li>You own your outcomes. You set clear ambitious goals. You anticipate obstacles, persevere, and are accountable for your commitments.</li>\n\n<li>You make fast decisions. You are an effective and timely communicator. You understand how to collaborate, compromise, and escalate when needed.</li>\n\n<li>You get better every day. You welcome the gift of feedback. You never settle in your quest to grow and develop. By being here, you make our company stronger.</li>\n</ul>\nBesides providing a unique and dynamic work environment, there are a few other reasons you should consider ASCAP in your career planning. We also offer generous benefit options that are comprehensive and provide the flexibility that most employees want and need. These health care and financial plan options include the following:\n\n<ul>\n\n\t<li>A choice of either HMO or Point-of-Service (POS) medical and dental plans</li>\n\n<li>Immediate eligibility for 401(k) participation with match</li>\n\n<li>Generous time-off policy</li>\n\n<li>Health care and dependent care flexible spending accounts</li>\n\n<li>Long term disability insurance</li>\n\n<li>Basic life insurance, supplemental and dependent life insurance options</li>\n\n<li>Employer paid retirement savings program</li>\n</ul>\n#LI-AC1"}