{"job title": "Scientist", "company": "Ascent", "city state": "– Saint Paul, MN", "rating": "3.0", "job description": "<strong>Alt Titles: Data Scientist or Health Data Analyst.\n<br><br>\nIdeally this person has experience with claims and electronic health record (EHR) data, and has experience writing scripts in R and SQL.</strong>\n<br><br>\nThe Cardiac and Vascular Group brings all of our cardiac and vascular businesses together into one cross-functional, collaborative operating unit to employ the full breadth of our talent, technologies, products, services, and solutions to address the needs of customers and patients across the globe.\n<br><br>\nCARDIAC RHYTHM AND HEART FAILURE offers devices and therapies to treat abnormal heart rhythms, as well as cardiac diagnostic and monitoring solutions.\n<br><br>\n<strong>A Day in the Life</strong>\n<br><br>\nOur strategy is to become the industry leader and company resource in the development of Clinical Evidence from Real World Data, focused on compelling insights into the care of patients with cardiovascular diseases. We want to transform healthcare toward value-based models by driving both analytic and clinical innovation\n<br><br>\nThe Clinical Data Scientist will be responsible for delivering insights from procured and internal datasets, which may include electronic health records, insurance claims, device data or other sources as identified by the Evidence Innovation team. The Clinical Data Scientist will be expected to research ontologies, published evidence, and other sources of information to support the development of algorithms using predictive / analytical modeling, systematic data mining methodology, and research methodology on large and complex data sets, through statistical, machine learning, graph modeling, text mining and other techniques. This individual will play a key role in delivering clinical evidence and analysis to support the Cardiovascular Group business unit?s objectives.\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n? Identify Client ways to apply machine learning and help drive our data science roadmap.\n<br><br>\n? Apply machine learning and advanced statistical methods to derive Client insights from large medical device datasets.\n<br><br>\n? Keep up-to-date with the latest techniques and approaches in machine learning and statistical analysis.\n<br><br>\n? Responsibilities may include the following and other duties may be assigned.\n<br><br>\n? Develops, inspects, mines, transforms, and models data to meet business needs, improve decision making, and gain competitive advantage.\n<br><br>\n? Conducts data exploration and characterization to drive design of analysis to ensure correct and clinically useful descriptive and predictive models\n<br><br>\n? Manages all aspects of end-to-end data processing, including documentation of work products, scientific reports and publications\n<br><br>\n? Maintains analytical systems, verifies the accuracy of the data, and acts as a liaison to the business.\n<br><br>\n? Share best practices/approaches for statistics, machine learning techniques, data modeling, simulation and advanced mathematics.\n<br><br>\n<strong>Must Have: Minimum Qualifications</strong>\n<br><br>\n? Bachelor?s Degree in Statistics, Math, or Computer Science with a minimum of 2 years of experience, or; Master?s Degree with 0 years of experience.\n<br><br>\n<strong>SPECIALIZED KNOWLEDGE REQUIRED:</strong>\n<br><br>\n? Experience developing reproducible analyses using Python, R or similar programming languages\n<br><br>\n? Experience using SQL for data exploration and ETL\n<br><br>\n? Experience with clinical or basic science research methods, and documentation\n<br><br>\n? Experience developing software applications in a team setting\n<br><br>\n<strong>Nice to Have</strong>\n<br><br>\n? experience with enterprise Hadoop implementations (Cloudera, Horton Works, etc)\n<br><br>\n? Experience developing software in a regulated industry\n<br><br>\n? Strong track record in building machine learning models using real-world large datasets\n<br><br>\n? Proficient in relational database management systems with knowledge of non-relational database systems\n<br><br>\n? Experience with statistical modeling\n<br><br>\n? Background in healthcare practice patterns, electronic medical records, and healthcare economics\n<br><br>\n? Background in cardiovascular physiology, pharmacy/biotech and/or medical devices\n<br><br>\n<strong>?</strong>\n<br><br>\nCompany Description:<br><br>About Ascent:\n<br><br>\nAscent is a leading national technology consulting and professional services firm that focuses on tactical and strategic consulting. Ascent’s fundamental business is providing staffing services to Large Enterprise clients in our core market verticals: Financial Services, Healthcare, and Life Sciences. We focus the majority of our efforts in Staff Augmentation support of Large Enterprise Clients who utilize a Vendor Management System. Ascent works as both a reliable supplier in support of programs, as well as a Strategic Advisor in support of enterprise efforts to establish best in class preferred vendor programs. Ascent was ranked in the 2007 and 2008 Inc. 500 and recognized specifically for its innovative work in staff augmentation support of Large Enterprise preferred vendor accounts.\n<br><br>\nIf you are ready to propel your career to new heights… read on. We are looking for talented and dedicated colleagues to join our phenomenal team. At Ascent, we have created an environment where culture, commitment and opportunity converge to yield a truly unique place to work. We know that every employee has something important to say and that every employee is integral to our success. Where else can you walk over to a founder and talk about your ideas to help build our business and have that idea implemented in 48 hours? More importantly, we do everything we can to make sure our employees not only have great jobs, but great lives."}