{"job title": "Clinical Laboratory Scientist Chemistry - Per Diem", "company": "Ascend Clinical", "city state": "– Redwood City, CA", "rating": "2.8", "job description": "Clinical Lab Scientist Chemistry Per Diem<br> <br> Why Ascend Clinical?<br> <br> Ascend Clinical, LLC is the nations leading ESRD laboratory for independent dialysis providers, delivering testing and electronic ordering and reporting services that are second-to-none.<br> <br> For over three decades, Ascend Clinical has been a leader in niche testing markets with cutting edge molecular diagnostic testing, unique IT applications and personalized service offerings. As one of the countrys highest volume laboratories Ascends tenure and years of experience provide a stable base upon which to build and grow.<br> <br> From diagnostic samples to acutely accurate results, in turn providing life-sustaining and life-saving treatments for patients is all in a days work. As a Clinical Lab Scientist (CLS) you will play a vital role in the process. You will perform all routine laboratory testing as well as basic instrumentation maintenance and troubleshooting and accurately perform routine laboratory testing in accordance with protocols established.<br> <br> The CLS will correlate and integrate other patient data when interpreting test results and report results, which are substantiated by the proper use of appropriate quality control systems. The CLS will also use professional judgment and have an in-depth knowledge of laboratory techniques, scientific principles, quality control and instrument maintenance. In this position you must recognize problems, identify causes, and determine alternative methods and solutions as well as actively contribute to quality assurance activities and participate in proficiency testing.<br> <br> Your Role:<br> <br> The successful applicant will be able to perform these essential duties satisfactorily. The following are representative of these duties. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br> <br> * Follow all company policies and procedures: general policies, Exposure Control, Chemical Hazard, Illness and Injury Prevention Program and Quality Assurance Program Understands the hazards associated with failing to follow those procedures<br> <br> * Perform Quality Control (QC) procedures and interpretation of clinical values, including critical values and delta checks. Knows when test results are reportable and what to do in case of Quality Control failure<br> <br> * Perform and log routine daily, weekly and monthly maintenance and calibration of laboratory instrumentation according to protocols<br> <br> * Set up and run lab tests<br> <br> * Perform, evaluate and report all routine laboratory tests in chemistry and/or immunology under the supervision of a licensed Clinical Laboratory Scientist and according to established AC protocols. Strictly adheres to written procedures<br> <br> * Know protocol for handling critical values including rerunning tests, review of past results and phoning unit with results. Interact with Client Services, when necessary and appropriate, when results need to be phoned. Handle and investigate complaint, problem and discrepancy, as needed<br> <br> * Apply current scientific principles to clinical situations<br> <br> * Demonstrate thorough knowledge of instrument operation<br> <br> * Performs analysis with professional knowledge and interpretive judgment<br> <br> * Appropriately addresses analytical and system performance<br> <br> * Participate in the Quality Assurance program and in in-service education programs such as but not limited to:<br> <br> * Identify and record nonconformance's on Corrective Action Requests<br> <br> * Identify and record potential nonconformance's on Preventive Action Requests<br> <br> * Correct nonconformance's and potential nonconformance's<br> <br> * Improve laboratory and/or quality activities on a continuous basis<br> <br> * Oversee, review and verify work of Medical Laboratory Assistants (MLA)<br> <br> * Maintain detailed account of results with great attention to accuracy<br> <br> * Maintain safe and clean working environment by complying with procedures, rules, and regulations<br> <br> * Adhere to infection-control and hazardous waste policies and protocols; following identification procedures<br> <br> * Perform and release test results classified by CLIA as waived, moderate or highly complex<br> <br> * Perform equipment maintenance activities<br> <br> * Other duties as assigned<br> <br> Your Qualifications:<br> <br> * Knowledge of accepted clinical laboratory practice and procedures including handling of potentially infectious material and familiarity with California law relating to the practice of medical technology<br> <br> * Knowledge of computer skills, quality control and instrument maintenance Strong communication skills, both written and verbal<br> <br> * Analytical problem-solving skills, proficiency in performing detailed tasks thoroughly and completely, and the ability to follow complicated instructions with accuracy<br> <br> * Good organizational skills<br> <br> * The ability to read, write, speak, understand, and communicate satisfactorily in English, in person and on the telephone<br> <br> * Strong knowledge of multiple specialties<br> <br> * Strong knowledge of quality control and calibration<br> <br> * Strong knowledge of lab equipment and procedures<br> <br> Advantages:<br> <br> * Bachelor's degree from four-year College or University and one to two years related experience<br> <br> * High proficiency in Microsoft Office Suite<br> <br> * Clinical Lab Scientist license from the State of California<br> <br> * Smaller company atmosphere, where you make an impact as a person, not a number<p>SDL2017</p>"}