{"job title": "Sr. PV Scientist", "company": "Ascent", "city state": "– Cambridge, MA", "rating": "3.0", "job description": "<strong>Req #: 18-10520</strong>\n<br><br>\n<strong>Title: Data Scientist III</strong>\n<br><br>\n<strong>Location: Cambridge, MA</strong>\n<br><br>\n<strong>Position Type: Contract</strong>\n<br><br>\n<strong>?</strong>\n<br><br>\n<strong>Description:</strong>\n<br><br>\nDesign and build new data set processes for modeling, data mining, and production purposes. Determine new ways to improve data and search quality, and predictive capabilities. Perform and interpret data studies and product experiments concerning new data sources or new uses for existing data sources. Develop prototypes, proof of concepts, algorithms, predictive models, and custom analysis.\n<br><br>\n<strong>?</strong>\n<br><br>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Minimum 7 years Pharmacovigilance experience, including experience in aggregate safety reports and safety signal management.</li>\n<li>Strong background in clinical trial drug safety is required</li>\n<li>Understands, interprets, analyzes, and clearly presents scientific and medical data in verbal and written format (including intermediate understanding and application of medical concepts and terminology).</li>\n<li>Bachelor?s Degree in biologic or natural science; or health case discipline Advanced degree (PhD, MPH, NP, PharmD, etc.) preferred</li>\n</ul>\n\nCompany Description:<br><br>About Ascent:\n<br><br>\nAscent is a leading national technology consulting and professional services firm that focuses on tactical and strategic consulting. Ascent’s fundamental business is providing staffing services to Large Enterprise clients in our core market verticals: Financial Services, Healthcare, and Life Sciences. We focus the majority of our efforts in Staff Augmentation support of Large Enterprise Clients who utilize a Vendor Management System. Ascent works as both a reliable supplier in support of programs, as well as a Strategic Advisor in support of enterprise efforts to establish best in class preferred vendor programs. Ascent was ranked in the 2007 and 2008 Inc. 500 and recognized specifically for its innovative work in staff augmentation support of Large Enterprise preferred vendor accounts.\n<br><br>\nIf you are ready to propel your career to new heights… read on. We are looking for talented and dedicated colleagues to join our phenomenal team. At Ascent, we have created an environment where culture, commitment and opportunity converge to yield a truly unique place to work. We know that every employee has something important to say and that every employee is integral to our success. Where else can you walk over to a founder and talk about your ideas to help build our business and have that idea implemented in 48 hours? More importantly, we do everything we can to make sure our employees not only have great jobs, but great lives."}