{"job title": "Data Analyst I", "company": "Ascent", "city state": "– South San Francisco, CA", "rating": "3.0", "job description": "<strong>Scientific Data Visualization Engineer</strong>\n<br><br>\n<strong><strong>South San Francisco, CA</strong></strong>\n<br><br>\n<strong>Overview:</strong>\n<br><br>\nThe DevSci Informatics group is looking for a Scientific Data Visualization Engineer to create intuitive and interactive visualizations and dashboards for our scientists so they can quickly gain insights and project/work status from diverse and complex data. Our data come from many sources with complex assays and test results and the data visualization needs also vary greatly per scientist's role. The ideal candidate will bring a strong programming and database background as well as a combination of creativity and requirements analysis to meet our scientist's data visualization needs.\n<br><br>\n<strong>Essential Functions:</strong>\n<br><br>\nWork with informatics colleagues to understand our data sources and data processing/transformations\n<br><br>\nWork with internal scientists to collect data visualization requirements, assess and clarify requirements\n<br><br>\nTranslate requirements into solution options and action plans\n<br><br>\nDevelop data visualization prototypes and demo to scientists for feedback\n<br><br>\nDeploy data visualizations to production use\n<br><br>\nCreate and maintain documentation on the assignments (Requirements, solutions including the codes, and presentations)\n<br><br>\n<strong>Required skills/experiences:</strong>\n<br><br>\nMust have B.S. in biology related fields with 3 year of experience in biotech/pharma or M.S. in biology related fields with 1 year of experience in biotech/pharma\n<br><br>\nExcellent analytical and communication skills\n<br><br>\nMinimum of 2 years of visualization development experiences using Tableau, Tibco Spotfire, or other visualization tools\n<br><br>\nProficiency in SQL\n<br><br>\n<strong>?</strong>\n<br><br>\n<strong>Programming Skills Desired:</strong>\n<br><br>\nR/Python\n<br><br>\nMongoDB\n<br><br>\nAWS frameworks, such as Glue and Athena\n<br><br>\nCompany Description:<br><br>About Ascent:\n<br><br>\nAscent is a leading national technology consulting and professional services firm that focuses on tactical and strategic consulting. Ascent’s fundamental business is providing staffing services to Large Enterprise clients in our core market verticals: Financial Services, Healthcare, and Life Sciences. We focus the majority of our efforts in Staff Augmentation support of Large Enterprise Clients who utilize a Vendor Management System. Ascent works as both a reliable supplier in support of programs, as well as a Strategic Advisor in support of enterprise efforts to establish best in class preferred vendor programs. Ascent was ranked in the 2007 and 2008 Inc. 500 and recognized specifically for its innovative work in staff augmentation support of Large Enterprise preferred vendor accounts.\n<br><br>\nIf you are ready to propel your career to new heights… read on. We are looking for talented and dedicated colleagues to join our phenomenal team. At Ascent, we have created an environment where culture, commitment and opportunity converge to yield a truly unique place to work. We know that every employee has something important to say and that every employee is integral to our success. Where else can you walk over to a founder and talk about your ideas to help build our business and have that idea implemented in 48 hours? More importantly, we do everything we can to make sure our employees not only have great jobs, but great lives."}