{"job title": "Associate Research Scientist", "company": "Ascent", "city state": "– Seattle, WA", "rating": "3.0", "job description": "<strong>Associate Research Scientist<br><br>Seattle, WA<br><br>CORE JOB FUNCTIONS:</strong><br><ul><br> <li>An experienced professional with a strong understanding of immunology and/or cancer biology.</li><br> <li>Highly proficient in a wide-range of technical abilities.</li><br> <li>Demonstrates independence in solving problems of diverse scope and complexity.</li><br> <li>Will contribute to Client paradigm-shifting approaches to improve the clinical efficacy of T cell-based therapies.</li><br> <li>Strong personal initiative, flexibility, and an innovative approach to problem-solving are required.</li><br></ul><br><strong>REQUIRED</strong><br><br><ul><br> <li>Ability to culture primary and immortalized cell lines for a variety of immunologic assays (functional and phenotypic assessments, complex co-cultures, cytolytic activity).</li><br> <li>Minimum 2 years of experience with cellular immunology and T cell functional assays including proliferation assays, ELISA, and multi-parameter (6+ color) flow cytometry.?</li><br> <li>Familiarity with key principles of cellular and molecular immunology.</li><br> <li>Demonstrated ability to work in a high paced team environment, meet deadlines, and prioritize work on multiple projects.</li><br></ul><br><br><br><strong>ADDITIONAL QUALIFICATIONS:</strong><br><br><ul><br> <li>Experience with small molecule or biologic efficacy assays is a plus.</li><br> <li>Excellent record keeping and electronic notebook maintenance.</li><br> <li>Independence in data analysis and interpretation.</li><br> <li>Outstanding written, visual, and oral communication skills.</li><br></ul><br><strong>EDUCATION/EXPERIENCE REQUIREMENTS:</strong><br><br><ul><br> <li>Minimum 5 years of experience;</li><br> <li>B.S. with 3-5+ or M.S. with 1-2+ years of hands on experience in a relevant research setting.</li><br></ul><br><br><br>Company Description:<br><br><p>About Ascent:</p><br><br><p>Ascent is a leading national technology consulting and professional services firm that focuses on tactical and strategic consulting. Ascent’s fundamental business is providing staffing services to Large Enterprise clients in our core market verticals: Financial Services, Healthcare, and Life Sciences. We focus the majority of our efforts in Staff Augmentation support of Large Enterprise Clients who utilize a Vendor Management System. Ascent works as both a reliable supplier in support of programs, as well as a Strategic Advisor in support of enterprise efforts to establish best in class preferred vendor programs. Ascent was ranked in the 2007 and 2008 Inc. 500 and recognized specifically for its innovative work in staff augmentation support of Large Enterprise preferred vendor accounts.</p><br><br><p>If you are ready to propel your career to new heights… read on. We are looking for talented and dedicated colleagues to join our phenomenal team. At Ascent, we have created an environment where culture, commitment and opportunity converge to yield a truly unique place to work. We know that every employee has something important to say and that every employee is integral to our success. Where else can you walk over to a founder and talk about your ideas to help build our business and have that idea implemented in 48 hours? More importantly, we do everything we can to make sure our employees not only have great jobs, but great lives.</p><br>"}