{"job title": "Senior Data Scientist Analytics", "company": "Ascension", "city state": "– Nashville, TN", "rating": "3.1", "job description": "<strong>Additional Job Information</strong>\n<br><br>\n<strong>Title:</strong> Senior Data Scientist Analytics\n<br><br>\n<strong>City, State:</strong> Nashville, TN\n<br><br>\n<strong>Location:</strong> TNNAS HDQTR 523 Mainstream Dr\n<br><br>\n<strong>Department:</strong> Decision Support 001\n<br><br>\n<strong>Additional Job Details:</strong> FT, Days\n<br><br>\n<strong>About Us</strong><br>\n<div>Ascension is a faith-based healthcare organization dedicated to transformation through innovation across the continuum of care. As the largest non-profit health system in the U.S. and the world’s largest Catholic health system, Ascension is committed to delivering compassionate, personalized care to all, with special attention to persons living in poverty and those most vulnerable. In FY2017, Ascension provided more than $1.8 billion in care of persons living in poverty and other community benefit programs. Ascension includes approximately 165,000 associates and 34,000 aligned providers. Ascension’s Healthcare Division operates more than 2,600 sites of care – including 153 hospitals and more than 50 senior living facilities – in 22 states and the District of Columbia, while its Solutions Division provides a variety of services and solutions including physician practice management, venture capital investing, investment management, biomedical engineering, facilities management, clinical care management, information services, risk management, and contracting through Ascension’s own group purchasing organization.</div>\n<br><strong>Job Description</strong>\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nThe Senior Data Scientist Analytics performs and supports the collection, organization and statistical analysis of specific data.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Develops, implements and evaluates documentation formats, validation tests, data collection methods, databases and other data recording measures.</li><li>Applies standard, descriptive and inferential analysis methods as appropriate to interpret and report on collected data.</li><li>Implements data management procedures compliant with regulatory requirements.</li><li>Ensures the consistent implementation of data collection procedures by staff.</li><li>Collaborates on the purchase, testing and implementation of data management/analysis applications and systems.</li><li>May develop customized data management tools. Trains staff on implemented tools and applications.</li><li>Obtains Data – Utilizes SQL to mine appropriate data elements from the various clinical database systems.</li><li>Cleans, transforms, and transmits data – Parses, validates, and scrubs data of widely-differing formats.</li> <li>Assures integrity of clinical data as it is transmitted from system to system and/or system to database, ensuring transnational accuracy, completeness, and timeliness.</li><li>Analyzes data – Integrates data from multiple sources and performs complex statistical data analysis in support of ad hoc and scheduled requests.</li><li>Provides actionable insights.</li><li>Visualizes data – Creates publication-quality graphical representations of data that are pleasing to the eye and easily interpreted.</li><li>Presents data to drive business decisions – Delivers data products in a timely manner using effective report and/or presentation formats intended to convey clinical performance in System and Ministryinitiatives.</li><li>Automates – Utilizes scripting languages to automate resource-consuming and repetitive tasks within the analysis workflow.</li><li>Writes reusable code for speeding up the delivery of commonly-made requests related to fetching, summarizing, transforming, and visualizing data.</li><li>Builds software solutions – Utilizes object-oriented or functional programming languages to create dependable, easy-to-use tools to help team members work with data more efficiently and increase teamproductivity.</li>\n</ul>\n\n<strong>Qualifications</strong><br><br><strong>Education:</strong>\n<ul>\n<li>Bachelor's Degree in either Computer Science, Engineering, Statistics, or Math required</li><li>Advanced degree is preferred</li>\n</ul>\n<strong>Work Experience:</strong>\n<ul>\n<li>Three years experience in database ETL operations, statistical computer programming, and functional/object-oriented computer programming.</li>\n</ul>\n<strong>Equal Employment Opportunity</strong><br>\n\n<div><strong>Ascension Health is an EEO/AA employer: M/F/Disabled/Vet. For further information regarding your EEO rights, click on the following link to the “EEO is the Law” poster:</strong></div><div>http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf”</div> <div>Please note that Ascension will make an offer of employment only to individuals who have applied for a position using our official application. Be on alert for possible fraudulent offers of employment. Ascension will not solicit money or banking information from applicants.</div>\n<br><strong>E-Verify Statement</strong>\n<br><br>\nAscension Health participates in the Electronic Employment Verification Program. Please click the E-Verify link below for more information.\n<br><br>\nE-Verify (link to E-verify site)"}