{"job title": "Medical Lab Scientist (MLS) - PRN", "company": "Ascension", "city state": "– Jacksonville, FL", "rating": "3.1", "job description": "<p><b>We Are Hiring</b> </p> <p>Medical Lab Scientist (MLS) - Lab Microbiology Anc 001 - PRN, Rotating - As needed - SVM-St Vincent's Riverside - Jacksonville,FL</p><p><b>Why Join Employer?</b> </p> <div><p>St. Vincent’s HealthCare, part of Employer, is a faith-based, not-for-profit health system that has served the people of Jacksonville, Florida and the surrounding communities since 1873. From its humble beginning to its current status as a regional healthcare system, St. Vincent’s HealthCare is widely recognized for delivering personalized, compassionate care that balances high touch with high tech.</p></div><p><b>What You Will Do</b> </p> <p>As an Associate with St. Vincent's HealthCare-FL, you will have the opportunity to perform routine diagnostic/analytic testing of laboratory specimens, and interprets, documents and reports test results in compliance with department procedures and applicable regulations.</p><p><strong>You will:</strong></p><ul><li>Implements, validates, and reports laboratory test results.</li><li>Performs instrument maintenance and troubleshooting.</li><li>Conducts quality control and quality assurance testings.</li><li>Maintains supplies needed for performance of tests.</li><li>Assists with data collection or special projects as assigned.</li><li>Assists in documentation and submission of all required laboratory, departmental and staff statistics/reports.</li></ul><p><b>What You Will Need</b> </p> <p><strong>Licenses/Certifications/Registration:</strong></p><ul><li><strong>Required Credential(s):</strong><ul><li>One or more of the following:<ul><li>Medical Technologist (ASCP) credentialed from the American Society for Clinical Pathology Board of Certification (ASCP-BOC) \nobtained prior to hire date or job transfer date. Any specialty is applicable.</li><li>Medical Lab Scientist (ASCP) credentialed from the American Society for Clinical Pathology Board of Certification (ASCP-BOC) \nobtained prior to hire date or job transfer date. </li><li>Medical Tech credentialed from the American Medical Technologists (AMT) \nobtained prior to hire date or job transfer date. </li><li>Certification in Medical Laboratory Science,</li><li>Florida license in Microbiology</li></ul></li></ul></li></ul><p><strong>Education:</strong></p><ul><li>Diploma <ul><li>High school diploma/GED with 2 years of experience, or Associate's degree, or Technical degree required</li></ul></li></ul><p><strong>Work Experience:</strong></p><ul><li>None required.</li></ul><p><b>Equal Employment Opportunity</b> </p> <div>St. Vincent's Healthcare (SVHC) will provide equal employment opportunities (EEO) to all associates and applicants for employment regardless of race, color, religion, national origin, gender, sexual orientation, gender identification or expression, age, disability, marital status, amnesty, genetic information, carrier status or any other legally protected status or status as a covered veteran in accordance with applicable federal, state and local laws.</div><div> </div><div>Please note that Employer will make an offer of employment only to individuals who have applied for a position using our official application. Be on alert for possible fraudulent offers of employment. Employer will not solicit money or banking information from applicants.</div><p><b>E-Verify Statement</b> </p> <div><div>To comply with federal regulations of the Immigration Reform and Control Act (IRCA), all employees are required to complete an Employment Eligibility Verification form (I-9). This law applies to individuals hired, including PRN, part-time and temporary employees and students. </div><div> </div><div>Additionally, St Vincent's Healthcare is an E-Verify employer. E-Verify is a web based program administered by the U.S. Department of Homeland Security, USCIS Verification Division, and the Social Security Administration that supplements the current I-9 eligibility verification process. The program determines whether the information provided by the new hire matches government records and whether the new hire is authorized to work in the United States.</div></div>"}