{"job title": "Lead Data Engineer", "company": "ASICS Digital", "city state": "– Greater Boston Area", "rating": "4.6", "job description": "<div>Are you looking for the opportunity to shape the future of data engineering at a fast-growing company? If youre a seasoned Lead Data Engineer, looking for the next challenge to sharpen your design skills, build critical partnerships and take a global business to the next level then the Platforms team at ASICS Digital has the role for you.</div><div><br></div><div>ASICS Digital creates and brings to market cutting-edge digital apps and products for the ASICS brand. With over 50 million users, we possess an incredible wealth of data rooted in fitness training, goal-setting, and how technology can contribute to a healthy lifestyle. Managing and making sense of all that data is an extraordinary challenge and opportunity.</div><div><br></div><div>The Lead Data Engineer will work with other teams and stakeholders to understand requirements and transform those requirements into engineering tasks to deliver a data platform. Youll be working cross-functionally with several teams including Analytics, Product, Marketing and eCommerce. Your key focuses will be building up our data warehousing infrastructure and providing best practices for data engineering.</div>What youll do<ul><li>Provide leadership in data engineering oriented in both technical expertise and process through managing technical scope and delivery of data engineering projects</li><li>Architect data flows to support business goals; building data engineering into a product that enables the ASICS global consumer business to grow</li><li>Implement data engineering practices using Infrastructure as Code patterns</li><li>Enable scalability and growth through documentation of sound data engineering/operational practices</li><li>Tune and implement improvementsin terms of quality, reliability, scalability, or data accessfor our production data stores</li></ul>What youll have<ul><li>15+ years of experience in the field with at least 5 years experience in data warehousing principles and practices and 5 years experience in managing/tuning large sets of data (i.e. hundreds of millions of rows of data)</li><li>Sound business leadership skills such as demonstrated technical and project leadership and effective communication skills</li><li>Experience with Java and/or PythonInterest in AWS and other cloud infrastructure services</li></ul>Nice to have<ul><li>Experience with AWS services (e.g. lambda, S3)</li><li>Exposure to NoSQL data stores (e.g. Couchdb, DynamoDB, etc)</li><li>Bonus: Experience with Snowflake Cloud Data Warehouse</li></ul><div> ASICS Digital is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or fitness level.</div>"}