{"job title": "Data Scientist", "company": "ASML", "city state": "– San Jose, California", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br><br>\nLocationSan Jose - CA, US\n<br><br>\nLevelPhD\n<br><br>\nExperience2-5 Professional\n<br><br>\nAvailable since3/7/2018\n<br><br>\nFunctional areaResearch &amp; Development, Information Technology, Electrical Engineering\n<br><br>\nBackgroundPhysics, Physics / Mathematics, Software Engineering\n<br><br>\nReferencereq953\n<br><br>\nIntroduction\n<br><br>\nASML US, LP brings together the most creative minds in science and technology to develop lithography machines that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world's leading chipmakers - to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, the Netherlands, and we have 18 office locations around the United States including main offices in Wilton, CT, Chandler, AZ and San Jose, CA.\n<br><br>\nWe are proud of bringing together the brightest minds all over the world to tackle the most challenging problems in making faster and smaller chips. As part of our team, you will have the opportunity to go beyond yourself in developing more advanced techniques and push the technology boundaries.\n<br><br>\nASML San Jose, CA is an industry leader in computational lithography for integrated circuits. Our Tachyon platform enables capabilities that address chip design, photomask making and wafer printing for semiconductor manufacturing and the LithoTuner platform enables lithography optimization for ASML's leading photo lithography tools, known as 'scanners'.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nAdvanced Technology Development (ATD) Organization at ASML is looking for an experienced data scientist who has a passion to build data products and data systems.\n<br><br>\nThe ATD technology exploration team began to make the most use of a vast data acquired from our hardware and software products from 2014. As our vision expands, the opportunity to make\n<br>\nimportant contributions to the company and to our customers through data analytics is also expanding. We seek a principal data scientist with practical experience in exploring big data opportunity at ASML.\n<br><br>\nThe Principal Data Scientist will be responsible for utilizing disparate data sources in novel ways, with the aim of generating actionable insights. The insights can create new product offerings or improve the capabilities, performance and efficiency of existing products and services throughout the company.\n\n\n<ul>\n<li>You will collaborate with a cross-functional team of scanner domain experts, data scientists, and software engineers. You will work through the lifecycle of turning the data-driven insights into the final product.</li>\n<li>You will learn state-of-the-art photolithograhpy knowledge from ASML domain experts and identify areas of opportunity and improvement.</li>\n<li>You will work within a team of data scientists, explore large and complex data sets from various sensors monitoring the photolithography process, and experiment relevant Data Mining techniques and/or Machine Learning algorithms to improve the product intelligence.</li>\n<li>You will work closely with the production software engineering team to deploy the machine learning pipeline into software product.</li>\n</ul>\n\n<strong>Education</strong>\n<br><br>\nPh.D in Computer Science/Engineering/Mathematics/Statistics is preferred. But master applicants with specialization in data science / machine learning track and/or extensive relevant industry experiences are strongly encouraged to apply or equivalent experience.\n<br><br>\nExperience\n<br><br>\nSolid understanding and hands-on experience (3+ years) with applied statistics and machine learning.\n<br><br>\nPersonal skills\n\n\n<ul>\n<li>Proficiency in at least one of the three scripting languages: Python, R, or Matlab.</li>\n<li>Good understanding and hands-on experience with relational database such as MySQL or equivalent.</li>\n<li>Practical experience with data wrangling to prepare data for quantitative analytics and predictive modeling.</li>\n<li>Strong presentation and communication skills.</li>\n<li>Enthusiastic about enabling smart manufacturing and improving product quality control with the power of data science / machine learning.</li>\n<li>Knowledge and experiences with manufacturing SPC/APC (Statistical/Advanced Process Control) system are highly desirable.</li>\n<li>Experience with deploying predictive modeling pipeline in production is a big plus.</li>\n<li>Good understanding and hands-on experience with numerical optimization.</li>\n<li>Working knowledge about 'big data' ecosystem: Hadoop, Hive, and Spark.</li>\n<li>Familiar with at least one programming language such as C/C++ or Java.</li>\n</ul>\n\nContext of the position\n<br><br>\n<strong>PHYSICAL DEMANDS AND WORK ENVIRONMENT</strong>\n<br>\nThis position primarily works in an office environment. It requires frequent sitting, standing and walking. Daily use of a computer is required. May stand for extended periods when facilitating meetings.\n<br>\nThe physical demands of the position described herein are essential functions of the job and employees must be able to successfully perform these tasks for extended periods. Reasonable accommodations may be made for those individuals with real or perceived disabilities to perform the essential functions of the job described.\n<br><br>\nOther information\n<br><br>\nEEO/AA (W/M/Vets/Disability) Employer\n<br><br>\nEEO/AA/M/F/Vet/Disabled"}