{"job title": "Sr Data Analyst", "company": "ASRC Federal Holding Company", "city state": "– Maryland, United States", "rating": "3.5", "job description": "\"<div><div>Artic Slope Technical Services (ASTS ) is pursuing a contract as part of the SFLCs Engineering Services Division (ESD). Technical Information Management Branchs role is to support the missions of the USCG SFLC and C4IT Service Center communities through the acquisition, development, maintenance, publication and distribution of current and accurate technical information.</div></div> <div><div>• Work directly with TIMB staff to provide support with the continuing development and sustainment of the training program for CG-LIMS-STIP.\n\n\n<ul>\n<li>Expert level understanding of Oracles User Productivity Kit (UPK) application to develop all training and associated documentation.</li>\n<li>Develop training documentation, process guides, job aids and other curriculum necessary to train USCG personnel.</li>\n<li>Provide classroom or LiveMeeting training on the use of CG-LIMS-STIP to a geographically distributed user community.</li>\n<li>Utilize appropriate computer software applications found on the CG Standard Workstation for document text production.</li>\n<li>Establishes and maintains electronic and/or hardcopy data library of training documents.</li>\n<li>The contractor will work directly with TIMB staff to provide technical subject matter expertise for CG-LIMS-STIP to the ALC.</li>\n<li>Review and analyze any CG-LIMS-STIP related documentation provided by the ALC to include: requirements, use cases, test plans or any other sustainment artifacts.</li>\n<li>Answer questions and provide SME expertise on current CG-LIMS-STIP business processes as required.</li>\n<li>Travel outside the local commuting areas will be required to support effort to the USCG.</li></ul></div></div><div>ASRC Federal and its Subsidiaries are Equal Opportunity / Affirmative Action employers. All qualified applicants will receive consideration for employment without regard to race, gender, color, age, sexual orientation, gender identification, national origin, religion, marital status, ancestry, citizenship, disability, protected veteran status, or any other factor prohibited by applicable law.</div>\"\n"}