{"job title": "Sr Data Analyst-IETM", "company": "ASRC Federal Holding Company", "city state": "– Maryland, United States", "rating": "3.5", "job description": "\"<div>Artic Slope Technical Services (ASTS) is pursuing a contract as pat of the SFLCs Engineering Services Division (ESD). Technical Information Management Branchs role is to support the missions of the USCG SFLC AND C4IT service Center communities through the acquisition, development, maintenance, ,publication and distribution of current and accurate technical information\n\n\n<ul>\n<li>Shall possess a Bachelors degree and a minimum of eight (8) years technical and/or operational experience.</li>\n<li>Have a working-level understanding of ASD - S1000D, the International Specification for Technical Publications utilizing a Common Source Database (CSDB) and/or Darwin Information Typing Architecture (DITA).</li>\n<li>The ability to analyze Surface and C4IT technical data requirements and provide detailed solutions and processes for inducting content into IETM format within CG approved IT applications.</li>\n<li>Must be able to gain a working level understating of CG-LIMS STIP.</li>\n<li>Have experience developing, revising and analyzing XML content using Notepad++, WinMerge or equivalent as supported by the USCG as it pertains to Interactive Electronic Tech Manuals (IETMs).</li>\n<li>Excellent communication and analytical skills and working knowledge of computer systems and integrated software application programs are required.</li>\n<li>Must have an understanding of technical requirements called out in major acquisition contracts, and able to gain an understanding of USCG requirements.</li>\n<li>Interface with engineers and technical professionals in the writing, editing, and publication of various types of documents such as Process Guides, Desk Guides, and technical standards.</li></ul></div><div>Education: Bachelors degree</div><div>ASRC Federal and its subsidiaries are Equal Opportunity/Affirmative Action employers. All qualified applicants will receive consideration for employment without regard to race, gender, color, age, sexual orientation gender identification, national origin religion, marital status, ancestry, citizenship, disability, protected veteran status, or any other factor prohibited by applicable law.</div>\"\n"}