{"job title": "Data Analyst/Driver Messenger", "company": "ASRC Federal Holding Company", "city state": "– Maryland, United States", "rating": "3.5", "job description": "\"<br><br>ASRC Federal DOJ AFPS a subsidiary of ASRC Federal Holding Company, is seeking a Data Analyst/Driver Messenger in anticipation of a favorable award of the upcoming\n<br><br>\n<strong>Role/Responsibilities:</strong>\n<br><br>\nData Analyst/Driver Messenger\n<br>\nSome offices require a Data Analyst to occasionally perform driver and messenger\n<br>\nactivities specifically related to the Asset Forfeiture Program. These activities consist of Data\n<br>\n<strong>Analyst tasks and the following:</strong>\n\n\n<ul>\n<li>Operation of Government vehicles, Contractor vehicles in performance of</li>\n</ul>\n\ncontract requirements, and seized conveyances in the custody of the Government\n\n\n<ul>\n<li>Delivery of messages, documents, packages and mail to business concerns or</li>\n</ul>\n\nGovernment offices\n\n\n<ul>\n<li>Delivery of seized assets (including high value and confidential) in accordance</li>\n</ul>\n\nwith approved Government requirements\n\n\n<ul>\n<li>Maintain a log of items received and delivered</li>\n</ul>\n\nA Data Analyst/Driver Messenger must meet the qualifications for a Data have a safe driving record.\n<br><br>\n<strong>Education</strong>\n\n\n<ul>\n<li>High School diploma or equivalent, and/or 1 year work experience in a related field required.</li>\n<li>1 year work experience in related field required.</li>\n</ul>\n\nASRC Federal and its subsidiaries offers a stimulating and challenging work environment, competitive compensation packages, career advancement opportunities, and educational benefits to enhance professional skills.\n<br><br>\nASRC Federal and its Subsidiaries are Equal Opportunity / Affirmative Action employers. All qualified applicants will receive consideration for employment without regard to race, gender, color, age, sexual orientation, gender identification, national origin, religion, marital status, ancestry, citizenship, disability, protected veteran status, or any other factor prohibited by applicable law.<br><br>\""}