{"job title": "HR and Financial Data Analyst", "company": "ASRC Federal Holding Company", "city state": "– Maryland, United States", "rating": "3.6", "job description": "ASRC Federal Analytical Services, Inc. (ASI), a subsidiary of ASRC Federal Holding Company, is seeking a HR and Financial Data Analyst in Silver Spring, MD.\n<br><br>\nASI and its sister companies bring a history of delivering high-performance space systems engineering, integration and satellite operations services to civil and defense agencies. We provide these services throughout all phases of the program life cycle and across the entire space systems architecture, including space and ground assets. People are our strength and quality solutions and services are our brand.\n<br><br>\nThe candidate will join an existing government and contractor team and provide HR data and financial management support to the National Oceanic and Atmospheric Administration (NOAA), National Environmental Satellite, Data and Information Service (NESDIS) organization. NOAA/NESDIS provides scientific and technical leadership for development of environmental satellite services and products.\n<br><br>\nThe NESDIS Office of the Chief Financial Officer (CFO) and Chief Administrative Officer (CAO) teams provide administrative, financial management, and budget execution and formulation coordination and support for the NESDIS financial management centers, line offices, data centers, and missions, which include major satellite programs like the Geostationary Operational Environmental Satellite -- Series R (GOES-R), the Deep Space Climate Observatory (DSCOVR), and the Joint Polar Satellite System (JPSS) program, the Office of Satellite and Product Operations (OSPO), the Office of Projects, Planning and Analysis (OPPA), and the Office of Satellite Ground Services (OSGS), among others.\n<br><br>\nThe candidate will be responsible for working with the offices and Financial Management Centers to ensure that the federal workforce is tracked and planned for properly, with regard to available resources and billets. This may include review of office, division, and branch organizational structures to ensure compliance with NOAA policies, as well as tracking personnel transfers throughout a fiscal year. The candidate will ensure new workforce and financial planning processes are understood and implemented correctly.\n<br><br>\nAs NESDIS moves forward with financial management processes, various forms, templates and documentation will be created to support monthly and quarterly execution reviews. Integral to the success of these reviews will be the tools and instructions the offices require to prepare and present their monetary and personnel resources on a recurring basis. Assistance is needed to create the personnel and financial tools, corresponding guidance, and instructions to support the various monthly and quarterly meetings.\n<br><br>\nWorking in support of NESDIS management, the candidate will provide a wide range of financial data analysis, administrative data analysis, budget execution, budget process, and financial management support services. They will provide analyses, assessments, and recommendations relating to financial and personnel management activities, among other duties as assigned.\n<br><br>\nRoles/Responsibilities could include:\n\n<ul>\n<li>Provide personnel and financial data analysis and data analytics support for NESDIS\n\n</li><li>Develop data analysis tools and processes to transform personnel and financial data into valuable inputs to leadership decision making\n\n</li><li>Execute, maintain, and develop database queries\n\n</li><li>Correspond with FMCs on data calls to support reviews\n\n</li><li>Produce, maintain, and update templates, forms, process documents for NESDIS reviews\n\n</li><li>Create and present training materials on NESDIS processes and templates\n\n</li><li>Provide support to various financial management deep dive initiatives\n\n</li><li>Summarize quantitative data and analysis for monthly reports\n\n</li><li>Create, maintain, and present personnel data and financial data exhibits and materials for internal and external government audiences\n\n</li><li>Action item and data call support for NESDIS leadership\n\n</li><li>Support for requests from government agencies\n\n</li><li>Support for responses to internal Department of Commerce and NESDIS requests\n</li></ul>\n<em>ASRC Federal and its Subsidiaries are Equal Opportunity / Affirmative Action employers. All qualified applicants will receive consideration for employment without regard to race, gender, color, age, sexual orientation, gender identification, national origin, religion, marital status, ancestry, citizenship, disability, protected veteran status, or any other factor prohibited by applicable law.</em>"}