{"job title": "Data Scientist", "company": "Assante Wealth Management", "city state": "– Emeryville, California", "rating": "3.7", "job description": "ABOUT USCI Investments Inc. is one of the countrys largest investment fund companies, managing over $80.5 billion on behalf of two million Canadian investors. CI is known for its innovation and ability to adapt quickly to the changing needs of Canadian investors. It provides employees with a fast-paced and challenging work environment with opportunities for advancement. CI is part of CI Financial, a diverse group of financial services firms.\n<br>\nPOSITION: Data Scientist LOCATION: Toronto, ON (M5J 0A3) STATUS: Full-time\n<br>\n<strong>JOB OVERVIEW</strong>\n<br>\nWe are currently seeking an Data Scientist to join our IT Client Reporting &amp; Data team. In this role, the successful candidate will apply their passion for data and computational knowledge of tools and techniques such as data preparation, machine learning, natural language processing, predictive modelling and artificial intelligence to enable business areas throughout our organization to maximize business value while gaining operational efficiency. The Data Scientist will work closely with business, data analysts, data stewards and other IT teams to implement and support machine learning capabilities within the Data Management and Analytics blueprint.\n<br>\nThe incumbent will leverage vast amounts of data to create analytical models that aim to solve specific business problems and provide insights across multiple functions within CI Financial and will exercise knowledge of descriptive and multivariate statistical techniques and applications, and database analysis tools and techniques to develop strategic insights to drive business goals.\n<br>\nWHAT YOU WILL DO Strategy &amp; Planning\n\n\n<ul>\n<li>Develop, inventory and enhance algorithmic data models across the organization</li>\n<li>Create and maintain metrics, guidelines and strategies for effective use of algorithms and data, data mining and analytics architectures, coding standards, statistical reporting, and data analysis methodologies</li>\n<li>Coordinate data resource requirements between Analytics and IT teams</li>\n<li>Working with the Chief Data and Analytics Officer to assist in developing data management strategies, policies and procedures, and best practices for analytics instrumentation and experimentation</li>\n</ul>\n\nAcquisition &amp; Deployment\n\n\n<ul>\n<li>Conduct research and make recommendations on big data infrastructure, database technologies, analytics tools, services, protocols, and standards in support of procurement and development efforts</li>\n<li>Drive the collection of new data and the refinement of existing data sources</li>\n</ul>\n\nOperational Management\n\n\n<ul>\n<li>Develop algorithms and predictive models to solve critical business problems</li>\n<li>Develop tools and libraries that will help business and analytics team members more efficiently interface with huge amounts of data</li>\n<li>Analyze large, noisy datasets and identify meaningful patterns that provide actionable results</li>\n<li>Develop and automate new enhanced imputation algorithms</li>\n<li>Create informative visualizations that intuitively display large amounts of data and/or complex relationships</li>\n<li>Provide and apply quality assurance best practices for data science services across the organization</li>\n<li>Develop, implement, and maintain change control and testing processes for modifications to algorithms and data analytics</li>\n<li>Collaborate with database and disaster recovery administrators to ensure effective protection and integrity of data assets</li>\n</ul>\n\n<strong>WHAT YOU WILL BRING</strong>\n\n\n<ul>\n<li>Graduate or post-graduate university degree in the field of computer science, mathematics, or statistics, and/or 3 years equivalent research and field experience</li>\n<li>Extensive experience solving analytical problems using quantitative approaches, with strong technical documentation skills</li>\n<li>Comfort manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources</li>\n<li>Project management experience</li>\n<li>Fluency with at least one scripting language such as Python</li>\n<li>Familiarity with relational, SQL and NoSQL databases</li>\n<li>Knowledge of map/reduce framework (hive/pig other tools for accessing data in Hadoop/HBase cluster systems) an asset</li>\n<li>Knowledge of applicable data privacy practices and laws</li>\n<li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner</li>\n<li>Good written and verbal communication skills</li>\n<li>Highly self-motivated and directed</li>\n<li>Ability to effectively prioritize and execute tasks in a high-pressure environment with a keen attention to detail</li>\n<li>Strong customer service skills and team-orientation</li>\n</ul>\n\n<strong>WHAT YOU CAN EXPECT FROM US</strong>\n\n\n<ul>\n<li>Collaborative and friendly team environment</li>\n<li>Opportunities to develop and grow within the company</li>\n<li>Health and Wellness programs including discounted corporate fitness membership and nutritional seminars</li>\n<li>Modern, conveniently-located facilities</li>\n<li>Community involvement including OneWalk to Conquer Cancer, Bay Street Hoops and more.</li>\n</ul>\n\nIf you are a passionate, committed and dynamic individual, please submit your resume in confidence by clicking Apply.\n<br>\nOnly qualified candidates selected for an interview will be contacted.\n<br>\nCI Financial Corp. and all of our affiliates (CI) are committed to fair and accessible employment practices and we are committed to providing accommodations for persons with disabilities. If you require accommodations in order to apply for any job opportunities, or require this posting in an additional format, please contact us at *****************************, or call ************. If you are contacted by CI regarding a job opportunity or testing and require accommodation in any stage of the recruitment process, please use the above contact information. We will work with all applicants to determine appropriate accommodation for individual accessibility needs."}