{"job title": "Associate Scientist/Sr. Associate Scientist, Molecular Biology", "company": "Association of State and Territorial Health Officials", "city state": "– Tyler, TX, United States", "rating": "3.5", "job description": "<div>\nDescription<br><br><strong>Job Scope &amp; Purpose:</strong>\n<br><br>\nOur client is leading the way in next generation-oncolytic vaccine drug discovery and needs your molecular biology expertise. You will find a very lively culture and collaborative team in this growing Biotech, which is also backed by amazing funding. If you have industry experience in molecular biology, read more!\n<br><br>\n<strong>Primary Job Responsibilities:</strong>\n<ul>\n <li>Responsible for execution of and delivery of newly designed viruses</li> <li>Expression and characterization of proteins in mammalian systems (western blotting, ELISA)</li> <li>Work with viral constructs and quantify virus growth/infectivity</li> <li>Conduct laboratory work, generate, analyze and present data</li>\n</ul>\n<strong>Primary Job Requirements:</strong>\n<ul>\n <li>BS/MS in life sciences, and 4+ years' experience in biotech/pharma</li> <li>Gibson Assembly, restriction enzyme cloning, PCR/primer dosing, qPCR, RT-PCR, cloning/generating DNA constructs</li> <li>DNA analysis software experience</li> <li>CRISPR/Cas9 experience is highly desirable</li> <li>Motivated self-starter comfortable working in a small team environment</li>\n</ul>\nAbout Stratacuity:\n<br><br>\nWhether you are seeking a career change or simply interested in becoming part of our network, you will appreciate the ethics guiding each Stratacuity team member. We build lasting relationships with exceptional biopharmaceutical talent and take great care to protect your personal information. Upon receiving your inquiry, you may be directly contacted by a Stratacuity team member to discuss your career goals. We will not share your information with anyone without your direct prior consent.\n<br><br>\nPROVEN SCIENTIFIC PLACEMENT™\n<br><br>\nStratacuity is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Stratacuity will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact us at info@stratacuity.com or 877-787-2821.</div>\n\n<br>"}