{"job title": "Data Scientist", "company": "Asurion", "city state": "– Nashville, Tennessee", "rating": "3.9", "job description": "Data Scientist | Asurion Careers\n\n\n<ul>\n<li>Why Asurion?</li>\n<li>Departments</li>\n<li>Corporate</li>\n<li>Customer Solutions</li>\n<li>Device Repair</li>\n<li>Supply Chain</li>\n<li>Technology &amp; Product Development</li>\n<li>Work At Home</li>\n<li>Job Listings</li>\n<li>Why Asurion?</li>\n<li>Departments</li>\n<li>Corporate</li>\n<li>Customer Solutions</li>\n<li>Device Repair</li>\n<li>Supply Chain</li>\n<li>Technology &amp; Product Development</li>\n<li>Work At Home</li>\n<li>Job Listings</li>\n</ul>\n\nBack To Listings\n<br><br>\nData Scientist\n<br><br>\nProduct | Nashville, TN US | posted 1 week ago\n<br><br>\nWe exist to help people with their tech. We are building on our core product of mobile insurance, currently serving 150 million customers globally, to transform how we interact with our customer and do more. We are growing our AI-based chatbot and other technologies to improve the quality and timeliness of how we care for our customers. Our Chief Analytics Officer has charted a course of data transformation, implementation of the most modern tools and processes, and investment in talent to realize the benefits of AI at Asurion. We hope you will take a closer look!\n<br><br>\n<strong>Role and Responsibilities:</strong>\n<br><br>\nAsurion is seeking for a result-driven Senior Data Scientist to join our Data Science Center for Machine Learning. An individual in this role will identify and create solutions to a variety of complex business problems. We expect every area of the business to host the creation of new data products and analytical capabilities.\n\n<li>Work on a team of product managers, developers, designers, and other data scientists to identify and answer important questions that help improve outcomes</li>\n<li>Strong interest in complex problem solving, ability to challenge assumptions and consider alternative perspectives, think quickly and perform in high-stress situations, and operate well in a strong team environment.</li>\n<li>Develop prototypes for new data product concepts.</li>\n<li>Design and deploy complex, optimized and large-scale machine learning algorithms and recommender systems to improve Asurion's wireless and retail customers' experiences</li>\n<li>Analyze and interpret the results of product experiments</li>\n<li>Communicate findings to product managers and development groups</li>\n<li>For work on the Asurion chatbot, utilize Natural Language Processing to analyze speech and social data</li>\n<li>Drive the collection of new data and the refinement of existing data</li>\n<li>Drive the enhancement of tools, processes and procedures for building machine learning models at scale</li>\n<li>Regularly invents new and novel approaches to problems; takes initiative and breaks down barriers to solve problems; recognized within team as the source of solutions.</li>\n<li>Result-driven and focused self-starter</li>\n\n<strong>Qualifications:</strong>\n\n<li>Master's or PhD preferably in an engineering, statistics, technology or science.</li>\n<li>At least 2 years work experience developing and deploying enterprise-scale AI solutions.</li>\n<li>Experience manipulating and analyzing complex, high-volume, high dimensionality data from multiple sources</li>\n<li>Experience using advanced statistical data modeling techniques and tools</li>\n<li>Knowledge of data processing on Hadoop programming environments (e.g. Spark/Hive)</li>\n<li>Familiar with optimization techniques and underlying machine learning algorithms concepts</li>\n<li>Solid statistical knowledge; familiarity with hypothesis testing, experimental design and time series analysis</li>\n<li>Self-driven and able to ask and tackle the most important analytical questions with a view on driving product impact</li>\n<li>A strong passion for empirical research and for answering hard questions with data</li>\n<li>Result-driven and focused self-starters, great communicators that follows through on every initiative</li>\n<li>Love the responsibility of being individually empowered</li>\n<li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner</li>\n<li>Prior experience in applying machine learning for customer experience &amp; fraud detection use cases and Familiarity with anti-fraud industry leading tools is a plus</li>\n\n<strong>About Asurion:</strong>\n<br><br>\nFor the past 20 years, Asurion has helped people across the globe balance the interdependency between life and technology. Today, as the industry-defining leader of technology solutions, we ensure 300 million consumers' devices and appliances stay online and on the job in this fast-moving, tech-driven world. We help you retrieve the seventeenth (and perfect) picture of your dog in that sweater, and make sure the undeliverable email is delivered. We replace that lost phone, and make your TV shake hands with the Internet. We're the silent partner in your video editing career, and the reason you can do that thing with the thing that makes beautiful music on your tablet. We're the people who know what the one button does. And why sometimes it does not. We have always worked as though life depends on us. And, increasingly, it does. Technology is virtually everywhere. It drives performance at work, powers a growing number of tasks at home, and guides us as we move between the two. At Asurion, we not only understand technology, we appreciate the value of it. Life without the laptops, devices, and apps we become accustomed to can become very challenging, very quickly. And as your home's devices become interconnected, the stakes become even higher. We're a technology company. But we're also an amazing group of people. When you call us, you'll talk to people with the patience and experience to genuinely help. We understand what it's like to have a cell phone fall in the swimming pool or a hard drive crash on a term paper. We replace. We fix. We find. We solve. We keep you in the game. Asurion ensures technology and people are harmonious. And your life is in balance. We do so across the digitally connected globe, by speaking six languages, and by working across any device, platform or provider. There's only one system like ours on earth, and it took two decades of innovating, and empathizing, to build.\n<br><br>\nPRO00970 | Nashville | Tennessee | US | 2018/08/16\n<br><br>\nThis Job\n<br><br>\n<strong>0</strong>\n<br>\n<strong>SHARES</strong>\n<br><br>\nTweet\n<br><br>\nAt Asurion, every one of us is a leader, from individual contributors to the senior team. We utilize our 5 Leadership Principles to help align and guide us in our everyday interactions.\n\n\n<ul>\n<li>Put Customers First</li>\n<li>Play A Team Sport</li>\n<li>Take Ownership</li>\n<li>Collaborate and Then Commit</li>\n<li>Reach Full Potential</li>\n</ul>\n\nAsurion helps more than 300 million people around the world unlock their technology's untapped potential. We create innovative technology solutions that help keep consumers connected, from comprehensive protection to smart tech help that redefines expertise. Partnering with leading wireless carriers, retailers and pay-tv providers, Asurion's 16,000 employees deliver a seamless, award-winning customer experience, anticipating their needs and providing tailored services reachable within one touch.\n\n\n<ul>\n<li>Why Asurion?</li>\n<li>Job Listings</li>\n</ul>\n\nDepartments\n\n\n<ul>\n<li>Corporate</li>\n<li>Customer Solutions</li>\n<li>Device Repair</li>\n<li>Corporate</li>\n<li>Customer Solutions</li>\n<li>Device Repair</li>\n<li>Supply Chain</li>\n<li>Technology &amp; Product Development</li>\n<li>Work At Home</li>\n<li>Supply Chain</li>\n<li>Technology &amp; Product Development</li>\n<li>Work At Home</li>\n</ul>\n\nConnect With Us\n<br><br>\nAsurion is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n<br><br>\nAsurion 1992-2017. All Rights Reserved.\n<br><br>\nVisit *********** | Terms of Use | Privacy Policy | Site Map | Government Information\n<br><br>\nStart typing and press Enter to search\n<br><br>\nPart-Time Cellphone Repair Technician | SUP05643\n<br><br>\nCellphone Repair Technician | SUP05636"}