{"job title": "Data Scientist", "company": "ATCSearch", "city state": "– San, Francisco 94107", "rating": "NA", "job description": "<div>\n<div>\nJob Description</div><br>\n\n<div>\n<div>\n<strong>Data Scientist (San Francisco)</strong>\n<br><br>\nAs a creative, versatile, and motivated data scientist you will be part of a fast growing team building a SaaS-Web based BigData platform. You will <strong>lead data science projects to</strong> <strong>develop exciting new algorithms for the product, help productize algorithms into the scalable analytics platform.</strong>\n<br><br>\n<strong>Key Drivers and Responsibilities Are:</strong>\n<br><br>\n<strong>Design algorithms</strong> to infer key transportation patterns from various data sources.\n<br><br>\nResearch and implement suitable <strong>strategies such as regression models, neural networks, for solving data science problems.</strong>\n<br><br>\nResearch and build <strong>real-world data sets for training various models and doing quality checks.</strong>\n<br><br>\n<strong>Productize data science algorithms within the Data platform, in collaboration with the Application Engineering team.</strong>\n<br><br>\n<strong>Create and present visualizations and analytics dashboards to help tell stories with data.</strong>\n<br><br>\n· <strong>Define and implement customized cutting-edge solutions for customers.</strong></div>\n</div>\n </div><br>\n\n<div>\n<div>\nJob Requirements</div><br>\n\n<div>\n<div>\n<strong>To Succeed You Must Have:</strong>\n<br><br>\n5-8 years of experience in data science or statistics, using tools such as <strong>R or Python</strong>.\n<br><br>\n<strong>2+ years of experience in SQL and relational databases (PostgreSQL preferred), and good understanding of relational concepts.</strong>\n<br><br>\nStrong understanding of <strong>techniques in data science such as machine learning algorithms, regression analysis.</strong>\n<br><br>\nStrong data analysis skills, ability to know what techniques can be possible, and the ability to visualize data in a compelling form.\n<br><br>\nGood communication skills - written, visual (presentations), and verbal.\n<br><br>\n<strong>Ability to deliver adequate results on deadline, and make compromises to enable scalability and productization of algorithms.</strong>\n<br><br>\nGeo-spatial skills are a big plus.\n<br><br>\nKnowledge of transportation data / industry is a plus.\n<br><br>\nExperience in Hadoop, Qlik\n<br><br>\nQuick learner, and a strong team player.\n<br><br>\nBS / MS in Mathematics, Computer Science or an Engineering discipline from a top university.</div>\n</div>\n </div>\n<br>"}