{"job title": "Scientist I/II, Translational Biology", "company": "Atreca", "city state": "– Redwood City, CA", "rating": "4.7", "job description": "<strong>Description</strong>\n<br><br>\nAtreca is a biotechnology company focused on applying its Immune Repertoire Capture technology to discover and develop novel cancer immunotherapeutics. Located in Redwood City, California, Atreca is looking for talented, entrepreneurial people who are dedicated to making a positive impact on human health. We have a unique opportunity for a highly motivated individual to become a key member of a growing biotechnology company.\n<br><br>\nIn this position, the successful candidate will apply her/his skills and expertise regarding histological tissue collection, preparation and assessment using immunohistochemistry and image analyses to contribute to Atrecas antibody-target characterization research. In particular, the successful candidate will apply her/his knowledge of histology and tumor biology to optimize and evaluate antibody binding to normal and disease tissue. The position reports to the Director of Biology. The candidates expertise with immunohistochemistry, other histological methods including image analysis and oncology will help us to discover and characterize novel tumor antigens and develop anti-tumor drugs.\n<br><br>\n<strong>PRIMARY DUTIES &amp; RESPONSIBILITIES</strong>\n\n<ul>\n<li> Utilize expertise in immunology, tumor biology or related field to develop histological assays to discern mechanisms and biomarkers of antibody activities</li> \n\n<li> Responsible for tissue processing and slide preparation</li> \n\n<li> Proper maintenance/tracking of collected samples and slides</li> \n\n<li> Evaluate antibody binding using a variety of methods including amplification and antigen retrieval techniques and multiplex IF</li>\n\n<li> Design staining strategies for tumor tissues and Atreca antibodies</li>\n\n<li> Perform staining, tissue distribution, and subcellular analyses of immunoreactive tumor and normal tissues</li>\n\n<li> Generate, collect, and analyze experimental results using microscopy; manage data</li>\n\n<li> Coordinate activities with functional and Project team members</li> \n\n<li> Report data to project teams and management</li>\n\n<li> General lab duties such as preparation of reagents and stocking of supplies</li> \n\n<li> Follow laboratory safety guidelines and practices</li>\n</ul>\n<strong>REQUIREMENTS</strong>\n\n<ul>\n<li> <strong>Absolutely Required:</strong> PhD, preferably in oncology, immunology, tumor biology, or related field</li>\n\n<li> <strong>Absolutely Required:</strong> extensive experience in tissue processing, histological slide preparation, immunohistochemistry, microscopy and image analysis</li> \n\n<li>Experience with digital pathology analysis systems, a plus</li>\n\n<li> Experience working on project teams in a pharmacology/in vivo laboratory preferred</li> \n\n<li> Experience performing small scale primary antibody modification/labelling, such as biotinylation, a plus</li> \n\n<li> Must have excellent trouble shooting, organization, and planning skills, and the ability to work under timeline in a fast-paced environment</li>\n\n<li> Excellent written and oral communication skills</li>\n</ul>\n\n<div>Atreca is an equal opportunity employer.</div>\n<br>"}