{"job title": "Data Scientist", "company": "Attivio Inc.", "city state": "– Newton, Massachusetts", "rating": "4.4", "job description": "Company Description<br><br><strong>Attivio</strong> is the leading cognitive search &amp; insight company, a recognized leader by both Gartner and Forrester and voted one of the best Big Data and Machine Learning companies to work for in 2018. Our mission is to put search at the core of every enterprise. Fortune 500 companies rely on us to drive innovation, operational efficiencies, and improved business outcomes. Our solutions provide industry-leading machine learning, natural language processing, and text analytics capabilities to solve business problems such as improving satisfaction in customer support, reducing risk in Financial Services, and increasing employee productivity.\n<br><br>\n<strong>Our benefits include</strong>: Premium health, dental and vision insurance, unlimited paid time off, 401K match, parental leave, tuition reimbursement &amp; more. We are located in Newton, Ma on the Green Line and offer free parking.<br><br>Job Description<br><br>We are seeking an experienced data scientist who is passionate about data science and machine learning to join a growing team. As a Data Scientist, you will process massive amounts of data and build advanced machine learning models to solve a variety of complex business problems, such as recommender systems, classification and natural language generation (NLG).\n<br><br>\nAs a Data Scientist you will be responsible for:\n<ul>\n<li>Defining AI research problems and criteria for evaluating success</li><li>Processing massive amounts of structured and unstructured data</li><li>Building deployable machine learning models and scalable NLP platforms that can support real time solutions for recommendation, Q&amp;A, sentiment analysis, NLG, etc.</li><li>Researching new machine learning solutions for complex business problems</li><li>Communicating findings</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Master or PhD degree in Computer Science or relate field with a focus on machine learning</li><li>3+ years experience in developing and training machine learning models or deep neural networks.</li><li>2+ years experience in general NLP tasks and techniques, such as parsing, sequence labeling, entity linking, relation extraction, etc.</li><li>Experience in dealing with large-scale unstructured text data</li><li>Experience in machine learning packages</li><li>Expertise in NLP methods</li><li>ML experience with different supervised and unsupervised learning algorithms</li>\n</ul>\n<strong>Desired Skills</strong>\n<ul>\n<li>Fast learner</li><li>Proven ability to make solid, independent technical decisions</li><li>Desire to work in a fast-paced, results oriented team</li><li>Strong interpersonal and communication skills</li><li>Self-motivated, self-disciplined and self-managed with a strong work ethic and a positive attitude</li><li>Publications on NLP/ML a big plus</li><li>Understanding of Agile software methodology</li>\n</ul>\n\nAdditional Information<br><br>Attivio is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status."}