{"job title": "Data Scientist", "company": "Audible", "city state": "– Seattle, WA", "rating": "3.3", "job description": "Hey theres a revolution going on! A revolution in digital entertainment. Every day millions of people around the world choose to be more thoughtfully entertained, informed and educated by listening to fascinating stories and all forms of fictional and non-fictional content on their smartphones and other mobile devices.\n<br><br>\nAudible is looking for a Data Scientist who will help our International product and marketing teams to figure out how to best target customers and prospects, understand and personalize the content, format, value proposition and context needed to optimize their book-listening experience. The role will be based in Newark (NJ) and report to a senior director Data Science in Berlin (Germany).\n<br><br>\nShe/he will make the best of her/his skillset in predictive modeling, recommendation modeling, (un)supervised learning, simulation to explain, quantify, predict and prescribe. She/he will know how to translate business goals into agile, insightful analytics. She/he will seek to create value for both stakeholders and customers, and will convey findings in a clear, actionable way to managers and senior leaders.\n<br><br>\n<strong>KEY RESPONSIBILITIES</strong>\n<br>\n· Will ideate, frame, drive and manage use-cases applying to different market segments from a data science perspective, and help marketing and product stakeholders to improve customer acquisition, retention, experience and value. Doing so will have a measurable, valuable impact on business roadmap and actions.\n<br>\n· Will build the data sciences pipelines to optimize the Who, When, Where and How of all our conversations with customers. Will skillfully balance short term benefits and long term foundations when managing his time.\n<br>\n· Will thrive in complex business environments defined by uncertain, incomplete or limited information. Is comfortable dealing with ambiguities and evolving targets, and finding (or building) common ground to drive his agenda.\n<br>\n· Will sometimes imagine and invent before the business asks, and create groundbreaking applications using cutting-edge approaches.\n<br>\n· Will be a full part of the Audible Data Science team (a part is in Newark NJ and another part in Berlin Germany) and contribute to the growth of the team, share her/his ideas, intellectual property, and learn from others. In particular will bring Audible to the next stage of Data Science capabilities in at least one methodological area.\n<br><br>"}