{"job title": "Big Data Application Developer", "company": "Audley Travel", "city state": "– Boston, Massachusetts", "rating": "4.4", "job description": "<strong>About the role:</strong>\n<br><br>\nAudley Travel is now seeking a Big Data Application Developer to play a pivotal role in our Digital Analytics team. In this role you will be responsible for the creation and management of Client &amp; Marketing data sets across the Audley journey, further enabling advanced data science and analytics. You will collaborate closely with our Digital Marketing Analysts, Data Scientist and Marketing channel owners to scope, build and visualize extensible data sets to better our client communication strategies.\n<br><br>\n<em>If this sounds interesting, you must also have:</em>\n\n<ul>\n\n\t<li>Exceptional problem solving skills</li>\n<li>Strong attention to detail and managing deadlines</li>\n<li>Deep understanding in cloud and distributed systems principles</li>\n<li>Experience with large-scale big data methods such as: Map Reduce, Hadoop, Spark, Hive, Impala or Storm</li>\n<li>Web Interface Skillsets:\n\n\n<ul>\n\n <li>Language: HTML, CSS, JavaScript, jQuery, .NET MVC, .NET WEB API</li>\n<li>Product: Visual Studio</li>\n</ul>\n\n\t</li>\n<li>Database Skillsets:\n\n\n<ul>\n\n <li>Language: T-SQL</li>\n<li>Product: AWS Redshift (PostgreSQL)</li>\n</ul>\n\n\t</li>\n</ul>\n<strong>What’s in it for you:</strong>\n<br><br>\nAs a Big Data Application Developer you will be a crucial piece of a brand new client acquisition strategy.You will have the ability to work with key stakeholders and the freedom to think independently and be creative in your efforts.In addition, we offer a comprehensive benefits package where we cover 100% of the cost of Medical, dental and vision and match your 401k contribution! We find though that the real benefit to a career at Audley turns out to be the people.\n<br><br>\n<strong>About Audley Travel US Inc.:</strong>\n<br><br>\nAudley connects discerning travelers to a more rewarding travel experience in nearly 80 destinations around the world. Each of our Country Specialists has first-hand knowledge of the best guides, food, lodging, and local secrets in a specific region of the world, having lived or traveled there extensively. This allows them to tailor each journey to a client’s individual travel style and interests. The local knowledge and personalized service creates a streamlined and stress free planning experience.\n<br><br>\nOur carefully curated experiences, candid advice and level of service including personalized travel packs go above and beyond client expectations\n<br><br>\n<em>Audley Travel Group is an Equal Employment Opportunity/Affirmative Action employer. We are committed to the policy of providing equal employment opportunities without regard to race, color, religion, sex, sexual orientation, gender identity, veteran status, disability or national origin.</em>\n<br><br>\n<em>This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization.</em>"}