{"job title": "Data Scientist", "company": "AutoGrid", "city state": "– Redwood City, CA", "rating": "3.5", "job description": "<strong>About AutoGrid Systems</strong>\n<br><br>\nAt AutoGrid, you will join a team helping to accelerate the world’s transition to a clean, affordable and reliable energy system. We’re a growing and award-winning clean-technology company driving the fundamental transformation of the electrical grid into a distributed, decarbonized and digitized network of connected assets. You will collaborate with a team of world-class software, data and energy experts working at the forefront of advanced data science, artificial intelligence, machine learning and high-performance computing. With more than 3,000 megawatts of flexible capacity under contract with energy companies around the globe, our solutions give you an opportunity to make a real-world impact. If you are passionate about using technology to improve society and love a fun, fast-paced work culture with opportunities for continuous learning and advancement, you will love AutoGrid.\n<br><br>\n<strong>Position Overview</strong>\n<br><br>\nAs a member of the data science team you will develop AutoGrid’s predictive controls platform. This high-performance forecasting, optimization and real-time control engine is the core component responsible for intelligently and continuously managing complex energy networks.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Develop and maintain forecasting and optimization algorithms for AutoGrid's machine learning and predictive control systems</li>\n<li>Implement and deploy your algorithms on big-data platforms, in production</li>\n<li>Benchmark and debug critical issues with the algorithms and software as they arise</li>\n<li>Prototype new methods and analyses on customer data sets</li>\n<li>Work closely with product management, engineering and QA teams to manage the full product lifecycle including requirements, architecture, algorithmics and QA</li>\n</ul>\n<strong>About you</strong>\n\n<ul>\n<li>MS. or Ph.D. in computer science, operations research, statistics or related field</li>\n<li>Exposure to very large forecasting and optimization problems and techniques, including large-scale time series forecasting and stochastic linear programming</li>\n<li>Good understanding of algorithms, data structures and performance optimization techniques</li>\n<li>Excellent programming skills in Python, Java or C++</li>\n</ul>\n<strong>Nice to have</strong>\n\n<ul>\n<li>Experience building production python applications. Specifically, knowledge of the Celery and Django frameworks is a plus</li>\n<li>Hands-on experience with the energy industry</li>\n<li>Understanding of and experience with Big Data / NoSQL frameworks, Spark, HBase, Hadoop / MapReduce, HDFS, etc.</li>\n<li>Knowledge of relational databases (SQL)</li>\n</ul>"}