{"job title": "Data Scientist", "company": "Autolist", "city state": "– San Francisco, CA, US", "rating": "5.0", "job description": "<div>\n<strong>Role Overview</strong></div>\n\n<ul>\n\n<li>\nDrive data science projects to completion, with a tenacious focus on the business impact of those projects. Pragmatically prioritize tasks to deliver on goals with a sense of urgency.</li>\n<li>\nSolve tough analytical problems at any level in the organization, and be persistent in getting to the solution, whether it involves a deep learning data product or business analytics.</li>\n<li>\nWork collaboratively with cross-functional teams to plan and execute on data science projects.</li>\n<li>\nStudy hard; we deeply value learning as a continuous investment to better achieve our goals.</li>\n</ul>\n\n<div>\n<strong>Responsibilities</strong></div>\n\n<ul>\n\n<li>\nDiscover, explore, and create data science products to meet product and business objectives.</li>\n<li>\nConceive of and answer questions about our product ecosystem using observational data</li> \n<li>\nDesign, implement and launch experiments to test your hypotheses</li> \n<li>\nIdentify and implement metrics that align with company goals</li> \n<li>\nContribute to our Python codebase and perform analyses in R or another statistics tool of your choice</li> \n<li>\nAdvise coworkers on the(mis)use of statistics to understand data</li> \n<li>\nHelp define and then hire roles to build out a complete data science teamConceive of and answer questions about our product ecosystem using observational data.</li>\n</ul>\n\n<div>\n<strong>Qualifications</strong> </div>\n\n<ul>\n\n<li>\nB.S. in Math or Statistics</li> \n<li>\nExperience using Python for Data Science</li>\n<li>\nSkills: Machine Learning, Statistics, git</li> \n</ul>\n\n<div>\n<strong>Bonus</strong></div>\n\n<ul>\n\n<li>\nM.S. or PhD in Math or related field</li> \n<li>\nAuto Industry Experience</li>\n<li>\nConsumer Facing App Experience</li> \n<li>\nDeep learning(CNN, RNN)</li> \n<li>\nR(the language)</li> \n<li>\nNatural Language Processing</li>\n</ul>"}