{"job title": "Data Engineer", "company": "Automattic", "city state": "– San Francisco, CA", "rating": "4.9", "job description": "Automattic is the company behind WordPress.com, Jetpack, WooCommerce, and more. We are looking for a full-stack data engineer.\n<br><br>\nYou’ll work with business leads, analysts, data scientists and fellow engineers to build data-powered products that empower better decision making. You’re relentless about data quality. You’ll understand how to manage a cluster to deliver performance and reliability. You’ll evaluate and help to shape technology choices, and you’ll implement systems that solve business use cases.\n<br><br>\nWhat we’re looking for:\n\n<ul>\n<li>Hands-on, production experience with the Hadoop family of big data technologies (Hive, Impala, HBase, etc.).</li>\n<li>You’ve worked with business stakeholders to create and iterate on solutions that extract value from data.</li>\n<li>Experience with Spark, Python, and Java.</li>\n<li>Strong analytical skills and a fervor for data quality.</li>\n<li>The curiosity and determination to understand and improve data flows.</li>\n</ul>\n\nHow to Apply<br><br>Does this sound interesting? If yes, please send a short email to<strong> jobs @ this domain</strong> telling us about yourself and <strong>attach a résumé</strong>. Let us know what you can contribute to the team. <strong>Include the title</strong> of the position you’re applying for and your name in the subject.\n<br><br>\nProofread! Make sure you spell and capitalize WordPress and Automattic correctly. We are lucky to receive hundreds of applications for every position, so try to make your application stand out. If you apply for multiple positions or send multiple emails there will be one reply.\n<br><br>\nIf you’re reading this on a site other than automattic.com please make sure you visit automattic.com/work-with-us for the latest details on applying.\n<br><br>\nPlease answer the following questions in your cover letter. Applications without these questions answered will not be considered:\n\n<ul>\n<li>Tell us some details about an interesting data problem you’ve worked on. What made it interesting?</li>\n<li>Include a link to a recent favorite blog post or paper about working with lots of data.</li>\n<li>What questions do you have for us?</li>\n</ul>\n← Work With Us"}