{"job title": "Data Scientist", "company": "Avalonbay Communities", "city state": "– Arlington, VA", "rating": "4.2", "job description": "<div><strong>Job Type:</strong> Exempt\n<br>\n<strong>State:</strong>:VA <strong>City:</strong>Arlington\n<br>\n<strong>Brand:</strong>Corporate\n<br><br>\nOverview <div><div><div>AvalonBay is proud to be named one of Glassdoor's Best Places to Work in 2018.\n<br><br>\nAvalonBay Communities, Inc. is one of the nation's leading Real Estate Investment Trusts (REIT's), in the business of developing, redeveloping, acquiring and managing quality apartment communities in high barrier-to-entry markets of the United States. These markets are located in the Northeast, Mid-Atlantic, Southeast, Pacific Northwest and Northern and Southern California regions of the country. We currently own and operate approximately 80,000 apartment homes in the US and employ approximately 3,000 associates. We are looking for aData Scientist to join our Data Analytics team in Arlington, VA.</div></div></div> The Role <div><div><div>At AvalonBay we are building the industrys most advanced data science capability. Join a green-field opportunity to apply machine learning and statistical analysis to challenges in Revenue Management, Marketing, Operations, Customer Service and Investment for one of the largest REITs in the country. The Data Analytics role involves:\n<ul>\n<li>Applying machine learning and statistical modeling to large datasets to develop business insight</li><li>Lead implementation of business solutions based on modeling and machine learning results</li><li>Work with senior management and business analysts to identify strategic opportunities for data analytics impact</li><li>Work with data engineering and IT to productionize machine learning solutions</li><li>Create compelling data visualizations to support conclusions and provide recommendations</li><li>Communicate recommendations effectively to senior management</li></ul></div>\n</div></div> You Have... <div><div><div>This is a great opportunity for someone at the start of their Data Analytics career interested in expanding their skills and learning from the best in the industry.\n<br><br>\nRequirements:\n<ul>\n<li>A masters degree or Ph.D. from a statistics, mathematics, computer science, computational social science or operations research program.</li><li>Solid background in the fundamentals of machine learning and statistical modeling</li><li>Experience conducting analysis and writing analytic code in R or Python or similar analysis and modeling tools. Experience merging and analyzing large, diverse data sources. AWS/Hadoop/Hive/Pig and Spark a plus.</li><li>Proficient with SQL and comfortable in a Unix/Linux environment.</li><li>Experience in building production-level machine learning and predictive analytics models along with data pipelines.</li><li>Experience creating data visualizations in Power BI, Tableau, D3 or similar.</li><li>The ability to explain complex technical material to nontechnical audiences</li></ul></div>\n</div></div> How AvalonBay Supports You <div><div><div>We know that our teams are the beating heart of our success and were committed to showing our appreciation. We offer:\n<ul>\n<li>Comprehensive benefits health, dental &amp; vision, 401(k) with company match, paid vacation and holidays, tuition reimbursement, an employee stock purchase plan and more!</li><li>Growth based on achievement and promotion from within.</li><li>Associate recognition (a company-wide recognition program that celebrates associate efforts and successes in contributing to the overall success of the organization including destination awards, AvalonBays Very Best recognition program and others!).</li><li>A 20% discount on our incredible apartment homes.</li><li>A culture built on purpose and our core values -<em>A Commitment to Integrity</em>,<em>A Spirit of Caring</em>, and<em>A Focus on Continuous Improvement</em>.</li></ul></div>\n</div></div> Additional Info <div><div><div>AvalonBay will consider for employment qualified applicants with criminal histories in a manner consistent with requirements under the law.\n<br><br>\n<em>AvalonBay is an Equal Opportunity Employer.</em></div></div></div></div>"}