{"job title": "Data Scientist", "company": "AvidXchange", "city state": "– 111 Sego Lily Dr, Sandy, UT 84070, USA, 1210 AvidXChange Lane, Charlotte, NC 28206", "rating": "2.7", "job description": "<div>\n\n <div>\n \n Apply Now\n \n\n\n Data Scientist\n\n <div>\n 111 Sego Lily Dr, Sandy, UT 84070, USA, 1210 AvidXChange Lane, Charlotte, NC 28206, USA\n Req #434\n </div>\n\n <div>\n Friday, November 16, 2018\n </div>\n\n <div>\n By trade we are a technology company, but if you ask anyone that works here, they’ll tell you we are a people company. As the industry leader in Accounts Payable (AP) Automation, <b>AvidXchange </b>strives to provide an innovative and collaborative work environment. We do that through focusing on our people, our culture, and ensuring we run our business in a way that enables every employee to achieve their fullest potential and help us create a world class company. Our employees live by our core values, including “Innovate to Change the Game,” “Passion About Customer Success,” “Win as a Team,” and “Have a Blast.” Whether you live in Charlotte and can enjoy our corporate campus at the <b>AvidXchange </b>Music Factory, or you live across the country, <b>AvidXchange </b>has locations waiting for you. We are on a mission to create something different at <b>AvidXchange</b>. Love where you work. Live Avidly.\n\n </div>\n\n <div>\n <div><p>As a Data Scientist II at AvidXchange, you will have the opportunity to work with cross-functional and interdisciplinary teams to solve challenging and engaging business problems that have a direct and measurable impact on the business. We are seeking intelligent and innovative thinkers, creative problem-solvers, and those with an aptitude for learning both quickly and continuously to help us establish and build out a data science practice at our firm. You will be challenged to excel and lead alongside the brightest talent in the Financial Technology industry, to build and validate models, and to create meaningful data products and insightful analytics that positively transform the organizations capabilities.</p>Job Responsibilities:<ol><li>Design, construct, train, and deploy machine learning / artificial intelligence models aimed at both automating business processes and approximating business functions</li><li>Create probabilistic and deterministic models to drive business decision making</li><li>Generate insight and socialize results across organization</li><li>Review code, and provide feedback, created by Data Scientist I team members</li><li>Build mutually beneficial relationships across organization and help empower business units to translate business problems into data science problems and solutions</li><li>Participate in data science solutioning sessions to help come up with ways to leverage machine learning/AI solutions to solve problems, even if not the lead for that work effort</li><li>Ability to rapidly prototype solutions and knowledge on architecture and applications integration</li><li>Knowledgeable in Linux/Unix operating systems and shell scripting languages</li><li>Experience with web app; API (SOAP, REST, RPC); JavaScript and Node.js development and frameworks.</li><li>Experience developing scalable applications in a cloud environment (Azure, AWS, Google Cloud, Bluemix, OpenShift, etc.)</li><li>Experience building Extract, Transform, Load (ETL) pipelines for production ready information applications.</li><li>Experience with database design, development and optimization</li><li>Experience with micro services development and real-time streaming (e.g., container management, task queues &amp; message brokers)</li><li>Experience with data quality assessment and management</li><li>Experience with model validation, verification and testing</li><li>Experience developing in lean-agile-kaban frameworks</li><li>Compile and deliver documentation such as white papers and technical notebooks for presentations</li><li>Collaborate with engineering teams to develop prototypes and products that can be deployed across varied environments</li><li>Work directly with C-level executives to develop a portfolio of projects and products that will drive competitive advantage</li><li>Create &amp; deliver executive-level presentations</li></ol>Experience and Qualifications:<b>Requirements:</b><ul><li>Bachelor’s degree or equivalent in statistics, mathematics, computer science, operations research, economics, or a related quantitative field</li><li>2+ years of experience with data querying languages (e.g. SQL)</li><li>2+ years of experience with scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, Weka, SAS, Matlab) in professional or educational setting, OR a Master’s Degree in related quantitative field</li><li>Must have detailed knowledge of deep learning architectures (e.g. Convolutional Neural Networks, Feedforward Neural Networks, Recurrent Neural Networks, etc.)</li><li>Must have a clear understanding of how to operationalize models across data science and software engineering teammates, with experience building these solutions into cloud analytics environments</li><li>Ability to identify new, value-add, opportunities to leverage machine learning/AI techniques to help transform components of organizations</li><li>Ability to present effectively to senior executives</li><li>Ability to apply relevant machine learning and data modelling techniques used in supervised problems (e.g. support vector machines, random forests, gradient boosted machines, linear/logistic regression, deep learning, etc.) and unsupervised problems (e.g. clustering, dimensionality reduction, etc.) in at least one statistical tool/language (e.g. R, Python)</li><li>Experience using version control platforms like GIT, and knowledge of version control strategies such as Gitflow, feature branching, &amp; developer branching</li><li>Experience with articulating technology capabilities required to support machine learning solutions to technical architecture teams</li><li>Experience with end-to-end machine learning process based on CRISP-DM framework</li><li>Experience articulating business questions and using quantitative techniques to arrive at a solution using available data</li><li>Excellent verbal and written communication skills with the ability to effectively advocate technical solutions to both engineering teams and business audiences</li><li>Proven track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li></ul><b>Preferred Qualifications:</b><ul><li>Master’s Degree in related quantitative field</li><li>Experience with big data analytics technology such as Azure, Hadoop, Spark and related modules</li><li>Experience with natural language processing and text mining</li></ul></div>\n </div>\n\n <div>\n AvidXchange is an equal opportunity employer. AvidXchange is committed to equal employment opportunity in accordance with applicable federal, state and local laws. AvidXchange will not discriminate against<br>applicants for employment on any legally recognized basis. This includes, but is not limited to: veteran status, race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age<br>and physical or mental disability. \n\n&nbsp;\n\n </div></div></div>"}