{"job title": "Experienced Data Scientist", "company": "BAE Systems", "city state": "– San Diego, California", "rating": "3.5", "job description": "<br><b>Job Description </b><br><p>Leverage technical and analytical expertise to explore and examine data from multiple disparate sources with the goal of discovering patterns and previously hidden insights, which in turn can provide a competitive advantage or address a pressing business problem. Leverage knowledge of advanced mathematical and statistical concepts and computer science expertise to bridge the gap between technologists and mathematicians and ensure that software solutions meet analytic requirements. Contribute as part of the software product development team with responsibility across the entire life cycle, including requirements gathering and analysis, process and systems definition, data analysis, presentation of analysis to peers, leadership, and customers in a format that is understandable and supports decision making.</p><br><br><b>Typical Education &amp; Experience </b><br>Typically a Bachelor's Degree and 8 years work experience or equivalent experience<br><br><b>Required Skills and Education </b><br>- Strong statistical data analysis background and a good understanding of a variety of algorithms and techniques<br>- Experience in designing and implementing optimized strategies for data acquisition, ingest (batch and streaming), storage, and processing of structured and unstructured data<br>-Experience with designing and implementing machine learning, data mining, statistics, or graph algorithms<br>- Experience with at least one statistical programming language such as Matlab, R and Python<br>-Experience with Big Data, Cloud computing technologies, NoSQL systems, or Lambda architectures<br>-Experience with general purpose objectoriented programming, including Java, Python, Scala, or JavaScript and ability to build working prototype solutions<br>- Excellent verbal and written communication skills<br>-Experience with source control and dependency management software, including Git or Maven<br>-Experience in developing solutions with and integrating and extending free and opensource software (FOSS) or COTS products<br>-Ability to obtain a security clearance<br>-BS degree required<br> <br><br><b>Preferred Skills and Education </b><br>-Experience with Department of Defense (Army/Navy/Air force/etc.) and Intelligence Agencies<br>-Experience with Amazon Web Services (AWS) or Microsoft Azure Cloud services<br>-Experience with the Big Data ecosystem, including HDFS, Hive, HBase, Accumulo, or Spark<br>-Experience with Storm, Kafka, NiFi, or similar ETL frameworks<br>-Experience with writing analytics using MapReduce, Pig, SQL, or SparkSQL<br>-MS degree in CS or Software Engineering<br> <br><br><b>About BAE Systems Electronic Systems </b><br>BAE Systems is a premier global defense and security company with approximately 90,000 employees delivering a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support and services.<br> The Electronic Systems (ES) sector spans the commercial and defense electronics markets with a broad portfolio of mission-critical electronic systems, including flight and engine controls; electronic warfare and night vision systems; surveillance and reconnaissance sensors; secure networked communications equipment; geospatial imagery intelligence products and systems; mission management; and power-and energy-management systems. Headquartered in Nashua, New Hampshire, ES employs approximately 13,000 people globally, with engineering and manufacturing functions primarily in the United States, United Kingdom, and Israel. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression"}