{"job title": "Senior Principal Scientist, Data Science", "company": "BAE Systems", "city state": "– Arlington, Virginia", "rating": "3.5", "job description": "<strong>Job Description</strong>\n<br>\n<strong>Who we are:</strong>\n<br>\nThe BAE Systems' Cyber Technologies Research (CT) Group is a leading multidisciplinary cyber R &amp; D organization dedicated to meeting critical U.S. Cyber Security and Cyber Warfare needs. CT is the cyber R &amp; D engine for all of BAE Systems North America, yet it runs like a boutique firm. It's the best of both worlds--combining a small-company feel, in its own facility, with access to a large company's technology transition paths, customer base, and other resources. CT executes a variety of scientific and engineering R &amp; D efforts for the Department of Defense ( DoD ) and the Intelligence Community (IC). Join us for amazing R &amp; D challenges and work on revolutionary cyber technology that makes a direct real-world impact.\n<br><br>\n<strong>What we offer:</strong>\n\n\n<ul>\n<li>Exciting cyber research Exceptional teammates Opportunities to learn and grow A fun workplace, excellent benefits, and every other Friday off.</li>\n\n<strong><li>Focus on the following::</li>\n\n</strong>\n\n<li>Cyber Operation &amp; Systems Program Analysis</li>\n<li>Vulnerability and discovery</li>\n<li>Automated cyber attack prediction</li>\n<li>Generation of mathematical models of program behavior</li>\n<li>Automated cyber defense tools</li>\n<li>Support uniformed operators in DoD cyber exercises</li>\n<li>Non -traditional cyber environments including SCADA, cyber-physical systems, embedded systems, vehicles, CAN bus.</li>\n<li>Cyber Defense &amp; Networking Secure high performance communications</li>\n<li>Wireless and MANET protocols Distributed system analysis</li>\n<li>Lifecycle attack identification</li>\n<li>Automated detection and containment of 0-day cyber attacks</li>\n<li>Anonymous and Covert Networks</li>\n</ul>\n\n<strong>Who You Are :</strong>\n<br>\nWe are looking for an experienced Scientist to work and lead all phases - design, development, and experimental analysis - of cutting edge cyber R &amp; D efforts. Primary emphasis on the prototyping, and experimental analysis of components and end-to-end systems for Cyber Security and Cyber Warfare at the embedded system, host, network, and enterprise levels .\n<br><br>\n<strong>Additionally you will:</strong>\n\n\n<ul>\n<li>Develop and investigate advanced, complex algorithms and scientific solutions to complex technical problems</li>\n<li>Plan and execute research of complex scope regularly involving multiple disciplines</li>\n<li>Co-author / author external publications (conference papers / presentations, journal articles, books)</li>\n<li>Provide project management reporting and documentation</li>\n<li>Provide updates to internal project management for large, complex projects</li>\n<li>Actively support external project interactions with other companies</li>\n<li>Be a technical leader or project manager on medium sized projects (5-10 people) providing solutions that are highly innovative</li>\n<li>Participate in external project interactions with other companies</li>\n<li>Be heavily involved in business development efforts</li>\n<li>Serve as organization spokesperson on advanced projects and/or programs</li>\n<li>Brief customers regularly on various issues/concepts</li>\n<li>Lead smaller proposals Establish relationships with current and potential customers</li>\n</ul>\n\nTypical Education &amp; Experience Typically a Bachelor's Degree and 8 years work experience or equivalent experienceRequired Skills and Education Strong research background in at least one of the following:\n\n\n<ul>\n<li>Cyber security</li>\n<li>Machine learning</li>\n<li>Sensor fusion &amp; correlation</li>\n<li>Modeling and simulation</li>\n<li>Big data and analytics</li>\n<li>Reverse Engineering, vulnerability analysis, and exploit development</li>\n</ul>\n\nStrong skills in at least one of the following areas:\n\n\n<ul>\n<li>Software engineering and development</li>\n<li>Algorithm development</li>\n<li>Experimentation design and execution</li>\n<li>Proposal and presentation development</li>\n<li>Networking</li>\n<li>Embedded Systems, SCADA, Cyber-physical systems, CAN bus</li>\n</ul>\n\nActive SECRET clearance required. Must be eligible for TOP SECRETPreferred Skills and Education Capability in the following areas is desirable:\n\n\n<ul>\n<li>Cyber security experience and interest</li>\n<li>Strong communication skills</li>\n<li>Research background and interest</li>\n<li>Vulnerability analysis, exploit development, and related disciplines</li>\n<li>Mobile computing/Android developmentAbout BAE Systems Electronic Systems BAE Systems is a premier global defense and security company with approximately 90,000 employees delivering a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support and services.</li>\n</ul>\n\nThe Electronic Systems (ES) sector spans the commercial and defense electronics markets with a broad portfolio of mission-critical electronic systems, including flight and engine controls; electronic warfare and night vision systems; surveillance and reconnaissance sensors; secure networked communications equipment; geospatial imagery intelligence products and systems; mission management; and power-and energy-management systems. Headquartered in Nashua, New Hampshire, ES employs approximately 13,000 people globally, with engineering and manufacturing functions primarily in the United States, United Kingdom, and Israel. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: 37687BR\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nBAE Systems\n<br><br>\nBAE Systems is a global defence, aerospace and security company employing around 83,400 people worldwide. Our wide-ranging products and services cover air, land and naval forces, as well as advanced electronics, security, information technology, and support services. We provide some of the world's most advanced, technology-led defence, aerospace and security solutions and employ a skilled workforce of some 83,400 people in over 40 countries. Working with customers and local partners, we develop, engineer, manufacture and support products and systems to deliver military capability, protect national security and people and keep critical information and infrastructure secure. Contact Info\n\n\n<ul>\n<li>Arlington, VA 22203</li>\n</ul>\n\nView Company Profile\n<br><br>\nDon't miss out on new jobs like this\n<br><br>\nGet the latest jobs delivered to your inbox. Unsubscribe at any time.\n<br><br>\nCreate Job Alert\n<br><br>\nSaving Your Job Alert\n<br><br>\nJob Alert Created\n<br><br>\nWell, this is embarrassing. We are having trouble saving your search. You can try again or come back at a later time.\n<br><br>\nMaximum Email Alerts\n<br><br>\nThis email address has reached the maximum of 5 email alerts. To create a new alert, you will need to log into your email and unsubscribe from at least one."}