{"job title": "Senior Data Scientist, Product Owner", "company": "BAE Systems Applied Intelligence", "city state": "– McLean", "rating": "2.6", "job description": "<strong>The Applied Intelligence division of BAE Systems delivers solutions which protect and enhance the connected world. Everything we do creates a safer future.</strong>\n<br><br>\n<strong>We want to solve problems for our customers and by bringing together great minds, we can work together to make the world a safer place.</strong>\n<br><br>\n<strong>About BAE Systems Applied Intelligence:</strong>\n<br><br>\nAs the market-leading provider of innovative financial crime and compliance solutions, BAE Systems Applied Intelligence helps global financial institutions to take intelligent action, control defences and evolve strategies against fraud, money laundering and other types of financial crime. With clients in over 100 countries, spanning four continents, BAE Systems Applied Intelligence counts seven of the world’s top ten banks among its growing family of clients.\n<br><br>\nToday, we have over 3,000 staff in 26 offices serving clients across the UK and Europe, the Americas, Asia Pacific and the Middle East. Our people apply intelligence to protect and enhance national and organisational assets so that they can grow and prosper – from improving the health and efficiency of leading corporations to protecting critical infrastructures, safeguarding vulnerable people and catching criminals.\n<br><br>\nNew opportunities and risks are emerging and converging... every day. Come and be part of our team and make a real difference…\n<br><br>\n<strong><u>About The Team</u></strong>\n<br>\nBAE Systems Applied Intelligence is looking for an experienced Senior Data Scientist, with a strong Software Engineering background, to join its expanding team as Product Owner. Located in Washington, the successful candidate will be a key asset to the Financial Services Product Engineering team that is developing a state of the art machine learning analytics platform called 'Model Builder', which is used by Citizen Data Scientists to build robust predictive models in the Banking Fraud and Compliance domains.\n<br><br>\n<strong><u>What You Will Be Doing</u></strong>\n\n<ul>\n\n\t<li>As Product Owner, guidie efforts to maintain the product roadmap for BAE's Model Builder analytics platform.</li>\n<li>Lead efforts to define, prioritize and provide justification for items on the Model Builder roadmap.</li>\n<li>Lead efforts to define detailed requirements for various Analytics workflows within Model Builder.</li>\n<li>Remain up to date with industry standards in Analytics, especially as it relates to its use in fighting Financial Crime, specifically Fraud and Compliance.</li>\n<li>Remain up to date with commercial and open source products relating to Data Science and ensures that the Model Builder roadmap is consistent with changes across the industry.</li>\n<li>Responsible for identifying emerging 3rd party machine learning libraries that should be integrated into Model Builder and exposed as new capabilities within Model Builder.</li>\n<li>Drive the requirements and strategy for the use of machine learning predictive models within BAE detection engines.</li>\n<li>Drive the definition of best practices in the use Model Builder's Analytics and Machine Learning capabilities in the Banking Fraud and Compliance domains.</li>\n<li>Provide guidance and oversight to Citizen Data Scientists engaged in active Banking customer projects using Model Builder.</li>\n<li>Provide subject matter expertise across BAE AI in the area of Analytics and Machine Learning in the Banking Fraud and Compliance domains.</li>\n<li>Give customer and industry facing presentations of Model Builder and its use in fighting Financial Crime.</li>\n<li>Guide and mentor junior staff and interns in order to grow the data science capabilities within the team.</li>\n</ul>\n<strong><u>Skills and Experience</u></strong>\n<br><br>\n<u>Essential:</u>\n\n<ul>\n\n\t<li>Bachelor's degree or higher in Computer Science or Data Science related field</li>\n<li>Extensive experience with machine learning platforms such as R, Python, or Matlab</li>\n<li>5 – 7 years commercial development experience</li>\n<li>3 – 5 years of experience in data modeling and machine learning, preferably within the Financial Crime domain</li>\n<li>Experience coding machine learning algorithms and techniques using platforms such as R, Java, Matlab, Octave or Python</li>\n<li>Strong database and SQL development experience</li>\n<li>Experience with Agile software development techniques, especially in a Product Owner role</li>\n<li>Proven track record of technical design and development ability as part of a team</li>\n</ul>\n<u>Other Attributes:</u>\n\n<ul>\n\n\t<li>Demonstrate excellent communication skills and the ability to work well with others on several levels within the company, including executives.</li>\n<li>Demonstrate excellent attention to detail.</li>\n<li>Demonstrate the ability to learn on the job, acquire new skills as required and put these to effective use.</li>\n<li>Professional / flexible individual that can adapt quickly to changing requirements or priorities and where necessary divert to assist other teams/projects.</li>\n<li>Able to exploit analytical technology including knowledge of coding languages (e.g. R, Python, etc.)</li>\n<li>Able to tell stories with data – both verbally and visually, helping key decision-makers move from ad-hoc analysis into continual data conversations</li>\n</ul>\nSecurity Clearance is required for this vacancy. If you are not currently Security Cleared, you will need to be eligible for this and willing to go through the process. For more guidance on National Security Vetting please click here.\n<br><br>\n<strong>About BAE Systems Applied Intelligence:</strong>\n<br><br>\nWe help nations, governments and businesses around the world defend themselves against cyber crime, reduce their risk in the connected world, comply with regulation, and transform their operations. We do this using our unique set of solutions, systems, experience and processes.\n<br><br>\nOur success is down to our people. The changing nature of our business means that we’re constantly looking for the brightest talent to help us fulfil our ambitions. As an experienced professional, we’ll entrust you with responsibility; this means that you’ll have client contact, variety and support from day one.\n<br><br>\nWe'll encourage and support you to develop your skills and reward you as you grow. Whatever your area of expertise, you'll be much more than just a job title; you'll be an integral part of the business where your individual contribution makes a difference every day. Great minds deserve great rewards, so we also offer a very competitive salary and benefits package.\n<br><br>\nDiversity and inclusion are integral to the success of BAE Systems Applied Intelligence. Staying competitive in today’s global marketplace requires an organisational culture where employees with varying perspectives, skills, life experiences and backgrounds – the best and brightest minds – can work together to achieve excellence and realise individual and organisational potential. We also welcome discussions about flexible working.\n<br><br>\n<strong>Division Overview:</strong> <strong>Commercial Solutions</strong>\n<br><br>\nBAE Systems has been in the business of protecting some of the world’s most important assets and networks for over 100 years. We apply the same techniques, intelligence and strategy used in defending nations and governments to businesses as well. That’s us – Commercial Solutions - a division of BAE Systems that specializes in providing businesses around the globe with the products and services they need to stay protected in today’s connected world.\n<br><br>\nWe offer a broad portfolio of on premise, managed and cloud-based products and services that are proven to protect our clients against financial crime and persistent cyber attackers.\n<br><br>\nWe aim to be a global industry-leading, cyber and financial crime products business and will do this by leveraging the BAE Systems brand and by delivering higher grade security solutions for our clients.\n<br><br>\n<strong><em>Help us secure a connected world by being an unseen hero. Apply now and be inspired.</em></strong>"}