{"job title": "Data Scientist Sr", "company": "BAE Systems", "city state": "– Springfield, Virginia", "rating": "3.5", "job description": "<br><b>Job Title</b><br>Data Scientist Sr<br><br><b></b><br>19-Oct-2018<br><br><b>Recruiter</b><br>Nanci Long<br><br><b>Job Description</b><br><p>BAE Systems is looking for talented Data Scientist excited to develop, transform, and present data models to improve decision making in support of NGA’s GPS Monitoring efforts. The select candidates will be responsible for data extraction and manipulation of data sets. Create workflows and predictive models for end-users using system tools. Conduct statistical analysis on data to ensure correct predictive forecasting. Manage the analytics request process by capturing requirements. Additional responsibilities will involve the creation and maintenance of surveys and deciphering survey analytics.<br><br><br> </p><br><br><b>Auto req ID</b><br>43900BR<br><br><b>State/Province</b><br>Virginia <br><br><b>Clearance Level – Must be able to obtain for position</b><br>Top Secret/SCI<br><br><b>Shift</b><br>1st Shift <br><br><b>City</b><br>Springfield<br><br><b>Advertising Title</b><br>Data Scientist<br><br><b>Required Skills and Education</b><br>10+ years of related Data Science experience <br><br>- Ability to write scripts including Python and JAVA scripts. <br>- Superior knowledge of feature data services and data modelling. <br>- Superior knowledge of ESRI ArcGIS and ArcServer. <br>- Superior knowledge of geospatial database content management. <br>- Superior knowledge of data format conversion. <br>- Knowledge of coordinate systems (latitude and longitude, UTM) and their conversions. <br>- Knowledge of projections and their properties and conversions. <br>- Knowledge of symbolization rules (how symbols are used to portray features) <br>- Knowledge of generalization rules. <br>- Minimum 2 years of experience working with data quality control tools including ArcGIS Data ReViewer. <br>- Proficient with ESRI Workflow Manager WMX and TAM. <br>- Experience working with geospatial data in a multi-user enterprise environment. <br>- Demonstrated ability in writing SQL <br><br><b>Company</b><br>TST_BAE Systems Tech Sols&amp;Svcs Inc <br><br><b>Postal Code</b><br>22150<br><br><b>Regular or Temporary</b><br>Regular <br><br><b>Posting Requirements</b><br>Internal/External <br><br><b>Department</b><br>0FB000_Space Intelligence <br><br><b>Country</b><br>United States <br><br><b>Email Address</b><br>travis.sherman@baesystems.com<br><br><b>About BAE Systems Intelligence &amp; Security</b><br>BAE Systems Intelligence &amp; Security, based in McLean, Virginia, designs and delivers advanced defense, intelligence, and security solutions that support the important missions of our customers. Our pride and dedication shows in everything we do—from intelligence analysis, cyber operations and IT expertise to systems development, systems integration, and operations and maintenance services. Knowing that our work enables the U.S. military and government to recognize, manage and defeat threats inspires us to push ourselves and our technologies to new levels. That’s BAE Systems. That’s Inspired Work. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression. To see Inspired Work in action, visit www.baesystems.com and follow us on Facebook: www.facebook.com/baesystemsintel.<br><br><b>Job Family</b><br>Data Scientist <br><br><b>Preferred Skills and Education</b><br><p>- Experience with combining digital cartography, computer technology, GIS, cartographic and geospatial production techniques, remote sensing, photogrammetry, and digital data formats. <br>- Demonstrated knowledge of Microsoft Access databases <br>- Understanding of cloud architecture </p><br><br><b>Travel Percentage</b><br><br><b>EEO Career Site</b><br>Equal Opportunity Employer. Minorities . females . veterans . individuals with disabilities . sexual orientation . gender identity . gender expression <br><br><b>ITAR: U.S. Citizen or Green Card Required</b><br>Yes<br><br><b>Typical Education and Experience</b><br>Typically a Bachelor's Degree and 4 years work experience or equivalent experience<br><br><b>Job Category</b><br>Intelligence <br><br>Apply!"}