{"job title": "Data Scientist", "company": "BAE Systems", "city state": "– Saint Louis, Missouri", "rating": "3.5", "job description": "<strong>Job Description</strong><br><br>BAE Systems is looking for talented Data Scientists excited to develop, transform, and present data models to improve decision making in support of NGAs GPS Monitoring efforts. The select candidates will be responsible for data extraction and manipulation of data sets. Create workflows and predictive models for end-users using system tools. Conduct statistical analysis on data to ensure correct predictive forecasting. Manage the analytics request process by capturing requirements. Additional responsibilities will involve the creation and maintenance of surveys and deciphering survey analytics.<br><br><strong>Typical Education &amp; Experience</strong> \n<br>\nTypically a Bachelor's Degree and 2 years work experience or equivalent experience\n<br><br>\n<strong>Required Skills and Education</strong> \n<br>\n3-10 years of relevant Data Science experience\n\n\n<ul>\n<li>Ability to write scripts including Python and JAVA scripts.</li>\n<li>Proficient with feature data services and data modelling.</li>\n<li>Proficient with ESRI ArcGIS and ArcServer.</li>\n<li>Proficient with geospatial database content management.</li>\n<li>Proficient with data format conversion.</li>\n<li>Knowledge of coordinate systems (latitude and longitude, UTM) and their conversions.</li>\n<li>Knowledge of projections and their properties and conversions.</li>\n<li>Knowledge of symbolization rules (how symbols are used to portray features)</li>\n<li>Knowledge of generalization rules.</li>\n<li>Minimum 2 years of experience working with data quality control tools including ArcGIS Data ReViewer.</li>\n<li>Proficient with ESRI Workflow Manager WMX and TAM.</li>\n<li>Experience working with geospatial data in a multi-user enterprise environment.</li>\n<li>Demonstrated ability in writing SQL</li>\n</ul>\n\n<strong>Preferred Skills and Education</strong><br><br>- Experience with combining digital cartography, computer technology, GIS, cartographic and geospatial production techniques, remote sensing, photogrammetry, and digital data formats.\n\n\n<ul>\n<li>Demonstrated knowledge of Microsoft Access databases</li>\n<li>Understanding of cloud architecture<br><br><strong>About BAE Systems Intelligence &amp; Security</strong> </li>\n</ul>\n\nBAE Systems Intelligence &amp; Security, based in McLean, Virginia, designs and delivers advanced defense, intelligence, and security solutions that support the important missions of our customers. Our pride and dedication shows in everything we dofrom intelligence analysis, cyber operations and IT expertise to systems development, systems integration, and operations and maintenance services. Knowing that our work enables the U.S. military and government to recognize, manage and defeat threats inspires us to push ourselves and our technologies to new levels. Thats BAE Systems. Thats Inspired Work. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression. To see Inspired Work in action, visit www.baesystems.com and follow us on Facebook: www.facebook.com/baesystemsintel."}