{"job title": "Scientist Sr", "company": "BAE Systems", "city state": "– Burlington, MA", "rating": "3.7", "job description": "<ul>\n<li>Multi-Hypothesis Tracking (MHT) has been the standard for multi-target, multi-sensor fusion for decades. Recently, graph-based approaches have become popular. Can Random Finite Sets (RFS) improve the computational and functional performance over both?</li>\n<li>Traditionally, data association has focused on hard-hard or soft-soft association. Hard-soft data fusion has come about much more recently - how can we associate video tracks of tanks to chat logs of intelligence analysts talking about tanks?</li>\n<li>Social media by itself represents a massive amount of information. Can we combine it with traditional data sources like SIGINT and MASINT to do even more?</li>\n</ul>\n\nThese are actual problems that the scientists and researchers in I2A are working to solve every day.\n<br><br>\nAs a scientist in I2A, you will work in small to medium groups of researchers and engineers on projects that typically last 1-3 years. Working on different projects keeps things new and interesting, but the projects don't just stop when our research stops. I2A is part of FAST Labs, which acts as the research and development core of Electronic Systems' five other business areas. Once we finish the research, we work to transition our programs to those business areas. Our tracking, fusion, and analytic algorithms go to the Command, Control, Communications, and Computers Intelligence, Surveillance, and Recognizance Systems (C4ISR) business area to improve their products that are used by military and intelligence analysts every day. Or they may go to the Electronic Combat Solutions (ECS) business area to add capability to their electronic warfare systems installed on aircraft like the F-35 or B-2. By sitting at the heart of BAE Systems' R&amp;D organization, our research has a direct path through the greater company to enhance the capabilities of American soldiers.\n<br><br>\nA data association scientist at the senior level is expected to design, develop, execute, and implement research projects at the sub-system level, and might be responsible for leading a small team. Technical writing is important, as you will frequently contribute to or co-author conference papers, journal articles, and/or invention disclosures, and support business development through idea generation, contributing to proposals, and/or authoring white papers. The senior scientist typically briefs technical results directly to project management or the customer."}