{"job title": "Computer Vision Scientist/Engineer", "company": "Baidu USA", "city state": "– Sunnyvale, CA", "rating": "4.2", "job description": "Baidu USA, located in Silicon Valley, is looking for world-class engineers to join its IDG team a.k.a Intelligent Driving Group. The IDG team is aiming to develop advanced autonomous driving technologies which will let us transform mobility and improve the lives of billions of people. We are looking for a scientist/engineer with the strong computer vision and machine learning background to build one of the advanced autonomous driving systems in the world. He or she will be pushing the autonomous driving system from prototype towards volume production.\n<br><br>\n<strong>Here's what you will do:</strong>\n\n<ul>\n<li>Work with world-class talented group of software engineers and scientists to design and implement cutting edge autonomous driving technologies.</li>\n<li>Train machine learning and deep learning models on a computing cluster to perform visual recognition tasks, such as segmentation and detection.</li>\n<li>Enjoy access to large scale autonomous driving proprietary data, run experiments, learn, iterate, and ship</li>\n</ul>\n<strong>Here's what we'd like to see in you:</strong>\n\n<ul>\n<li>Strong ability to write to write high quality code in C++ or Python.</li>\n<li>Strong understanding of machine learning: you should be familiar with the process (data collection, training, evaluation, and making iterative improvements) of building effective learning systems.</li>\n<li>Experience with at least one main stream deep learning frameworks, including TensorFlow, Caffe(2), MXNet, PyTorch.</li>\n<li>Experience with data science tools including Python scripting, numpy, scipy, matplotlib, scikit-learn and cloud computing architecture e.g hadoop/spark.</li>\n<li>Strong engineering practices, debugging/profiling skills, familiarity with multi-threaded programming.</li>\n<li>Experience in autonomous driving is a strong plus.</li>\n<li>MS degree in Computer Science, similar technical field of study or equivalent practical experience.</li>\n</ul>\n<strong>Culture fit:</strong>\n\n<ul>\n<li>Mission alignment: If you want to be part of Baidu IDG to accomplish our audacious mission, we will provide you with the best possible platform to do that.</li>\n<li>Self­-directed: We work best with people that are driven, motivated, and aspire to greatness. Are you the sort of person that, if you had time on your hands, will independently find interesting ways to push the envelope?</li>\n<li>Hungry to learn: We are eager to see you learn new skills and grow. But learning is hard work and this is something we hope you want to do.</li>\n<li>Team orientation: We work in small, fast­-moving teams. We don't believe in lone wolves. We watch out for each other and go after big goals together as a team.</li>\n</ul>"}