{"job title": "Data Scientist", "company": "Bain &amp; Company", "city state": "– US-CA-Palo Alto", "rating": "4.7", "job description": "<div><div>\n<div>Our Advanced Analytics Group is a team of experts in data science, engineering, marketing science, operations research and primary research. You will work alongside Bain’s consulting teams to provide high quality results for our clients, some of the most successful and pioneering businesses in the world.\n<br><br>\nYou will also work to advance AAG’s and Bain’s analytic capabilities and provide training to the consulting staff as needed.</div>\n</div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Provide data science services to Bain case teams and clients worldwide. You will work with case teams to assess client demands and suggest data science methods that provide practical, value-added answers to the client and case teams.</li><li>Develop solutions that bring critical insights to wide scale of different problems such as targeting customers and segmenting markets, product design, marketing optimization, demand forecasting and brand valuation, profit and price analyses, and fraud detection.</li><li>Develop, prototype and test machine learning algorithms on data sets that can range from a few data points to billions.</li><li>Apply machine learning and statistical techniques including regression models, decision trees, random forests, gradient boosting, support vector machines, clustering and topic models.</li><li>Prepare various sources of data using data wrangling methods in Python and SQL, leveraging infrastructure including Cloud computing solutions and relational database enviroments</li><li>Keep abreast of new and current statistical methodologies, machine learning and data wrangling techniques.</li><li>Where appropriate, train other team members to support the use of data analytics tools and to expand the use of machine learning within Bain</li><li>Combine domain expertise to perform feature engineering</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>5+ years of experience with data science and statistical analysis in a business, marketing science or social science environment</li><li>A Masters’ Degree or Ph.D. in Computer Science, Artificial Intelligence, Applied Mathematics, Econometrics, Statistics, Physics or related field is desired</li><li>Strong background in Statistics and Mathematics</li><li>Proficiency in SQL is required, and familiarity with NoSQL data stores is a plus</li><li>Proficiency with data wrangling, visualization, and machine learning in Python is required</li><li>Experience with other analytical software such as R, SAS or SPSS is a plus</li><li>Experience with explaining and applying a variety of data science and machine learning techniques</li><li>Examples of domain expertise in which we are interested is: predictive modeling, churn analysis, time series forecasting, computer vision, text mining/natural language processing, recommender systems, market basket analysis, segmentation, and graph analytics</li><li>Experience with dashboarding and visualization tools such as Tableau, Qlik, Plotly, etc.</li><li>Experience with deep learning tools such as Keras, PyTorch, TensorFlow or Theano is a plus.</li><li>Experience with distributed computing frameworks such as Hadoop and Spark is a plus</li><li>Experience with Git and modern software development workflow is a plus</li><li>Experience with building data science solutions in cloud computing environments is a plus</li><li>Strong interpersonal and communication skills are a must.</li><li>Ability to explain and discuss mathematical and machine learning technicalities to a business audience.</li><li>Must thrive in a fast paced environment and be able to work independently</li><li>Travel required</li>\n</ul>\nInd123</div>\n</div>\n</div>\n<br>"}