{"job title": "Clinical Lab Scientist", "company": "Bakersfield Memorial Hospital", "city state": "– Bakersfield, CA", "rating": "4.0", "job description": "<strong> Overview</strong> \n<br>\nBakersfield Memorial Hospital is a 426 bed acute care medical center offering a full range of services including the Sarvanand Heart and Brain Center, Grossman Burn Center at Memorial Hospital, expanded maternity and family care, the Lauren Small Children's Center, orthopedic services, wound care center, 24-hour emergency care and general/outpatient surgery. Memorial Hospital is a Children's Miracle Network Hospital and is home to the Bakersfield Ronald McDonald House. Memorial Hospital is a member of Dignity Health and is a trusted community partner, serving residents of Bakersfield and Kern County with quality, compassionate care since 1956. Learn more by visiting Bakersfield Memorial Hospital .\n<br><br>\n<strong> Responsibilities</strong> \n<br>\n<strong>Position Summary:</strong>\n<br>\nUnder the direction of the Laboratory Supervisor, CLS, performs moderate and high complexity testing in areas of Blood Bank, Chemistry, Coagulation, Hematology, Microbiology, Serology and Urinalysis following established laboratory procedures for specimen handling, processing, analysis and result reporting for patient specimens. The Clinical Laboratory Scientist may be required to rotate in other departments, work weekends and Holidays and cover other shifts as supervisor determines need.\n<br><br>\n<strong> Qualifications</strong> \n<br>\n<strong>Minimum Requirements:</strong>\n\n<ul>\n<li> CA CLS</li> <li> Education level necessary to obtain required licensure and certifications</li> \n</ul>\n\n<strong>Preferred Skills:</strong>\n\n<ul>\n<li> One year acute care hospital experience preferred.</li> \n</ul>\n\n<strong>Special Skills:</strong>\n\n<ul>\n<li> Above average communication and organizational skills.</li> <li> Ability to adapt to workload demands and function efficiently during difficult or emergency situations.</li> <li> Ability to maintain and operate laboratory equipment.</li> <li> Must have medical terminology, basic computer terminology and data entry skills.</li> \n</ul>\n\nThis position is represented by SEIU United Healthcare Workers.\n<br><br>"}