{"job title": "Data Scientist", "company": "Bank of America", "city state": "– Charlotte, NC", "rating": "3.6", "job description": "<strong>Job Description:</strong>\n<br><br>\nResponsible for enabling analysis, modeling, and optimization through producing information products. Involved in the research and development efforts. Primary requirement is not related to traditional programming or systems analysis skills, but to the ability to support the creation of sophisticated, value-added analytic systems that support revenue generation, risk management, operational efficiency, regulatory compliance, portfolio management, and research. These systems must overcome issues of complex data (e.g., VLDB, multi-structured, \"big data\", etc.) as well as deployment of advanced techniques (e.g., machine learning, text mining, statistical analysis, etc.) to deliver insights. This role often possesses a degree in hard science or another heavy quantitative business or social discipline. Able to work independently or in a team on complex projects.\n<br><br>\nBank of Americas Financial Crimes AI team is looking for a data scientist with machine learning experience. Viable candidates should have experience with the processing, manipulation and analysis of large datasets. Candidates should be familiar with various supervised and unsupervised machine learning techniques, as well as peer grouping, clustering and classification.\n<br><br>\n<strong>Required Skills:</strong>\n<br><br>\n• Experience with relational databases/SQL 5 years\n<br><br>\n• Experience with analytic language (python, R, etc.) - 2 years\n<br><br>\n• Experience with implementing machine learning techniques 2 years\n<br><br>\n• Teradata experience\n<br><br>\n• Natural language processing experience\n<br><br>\n• Experience with bank/financial data\n<br><br>\n<strong>Desired Skills:</strong>\n<br><br>\n• Experience with associative data stores (for example, graph database, RDF, etc.) 1 year\n<br><br>\n• Knowledge of anti-money laundering detection\n<br><br>\n<strong>Shift:</strong><br><br>1st shift (United States of America)<br><br><strong>Hours Per Week:</strong><br><br>40"}