{"job title": "Sr Business Intelligence Analyst", "company": "Bank of the West", "city state": "– San Francisco, CA", "rating": "2.9", "job description": "What sets Bank of the West apart from other banks is our team membersthey embody the optimistic spirit of the West. There is a spirit here that drives us to do more. Our team of more than 10,000 employees is vital to the success of our Bank. They reflect our modern western valuesstraightforward, entrepreneurial and optimistic. We seek to create a corporate culture that fosters and rewards excellence, encourages creative thinking and respects diversity an environment where team members are engaged, supportive of one another and enthusiastic about serving our customers. Bank of the West offers the stability of a company that has a 135 year history and is part of BNP Paribas, a European leader in global banking and financial services and one of the 6 strongest banks in the world. We offer opportunities across our diverse business lines Retail Banking, Commercial Banking, National Finance, and Wealth Management.\n<br><br>\nJob Description Summary\n<br><br>\nResponsible for conducting complex analytical projects and providing project oversight; perform financial and website analyses, assist with internal strategy and ad-hoc projects, and create competitor and industry benchmarking analyses for the Digital Banking group.\n<br><br>\nEssential Job Functions\n\n\n<ul>\n<li>Manage data gathering efforts with internal and external business partners.</li>\n<li>Analyze data and digital reports to derive business insights to improve digital experience.</li>\n<li>Partner with product and business managers to establish, capture and monitor metrics to track business results.</li>\n<li>Interpret complex analysis and develop presentations for senior management.</li>\n</ul>\n\nOther Job Duties\n\n\n<ul>\n<li>Performs other duties as assigned.</li>\n</ul>\n\n<strong>Required Experience</strong>\n\n\n<ul>\n<li>Requires deep knowledge of job area typically obtained through advanced education combined with experience.</li>\n<li>Typically viewed as an analytics and business insights expert.</li>\n<li>Mid-to-high level SQL skills (preferably Oracle).</li>\n<li>Requires 7 years minimum prior relevant experience</li>\n<li>At least 3 years of experience interpreting the data from a business perspective and communicating those insights to nontechnical business partners and management.</li>\n</ul>\n\n<strong>Nice-to-Have experience:</strong>\n\n\n<ul>\n<li>Statistical data analysis background</li>\n<li>Tableau reporting experience</li>\n<li>Experience using Adobe Analytics (preferred) or Google Analytics to create and interpret reports.</li>\n<li>Team lead experience</li>\n</ul>\n\n<strong>Education</strong>\n\n\n<ul>\n<li>Bachelor's Degree in Economics, Math, Accounting, or applicable field</li>\n</ul>\n\n<strong>Skills</strong>\n\n\n<ul>\n<li>Strong data collection, research and quantitative skills</li>\n<li>(Preferred) Knowledge of the banking and financial services industries</li>\n<li>Ability to summarize complex data into simple to understand information</li>\n<li>Ability to develop relationships with multiple stakeholders throughout an organization</li>\n<li>Ability to self-motivate and work independently in a relatively unstructured environment.</li>\n<li>Strong written and verbal communication skills. Will be responsible for discerning client's explicit and implicit needs. Will be responsible for writing standard systems development lifecycle business deliverables.</li>\n<li>Problem solving skills. Must be able to understand a business problem from the client's perspective and propose potential solutions. The ability to visualize how existing technology solutions could be changed / leveraged to meet future needs would be a plus.</li>\n<li>Able to see details and the \"big picture\"</li>\n<li>Organized</li>\n<li>Flexible/ Adaptable</li>\n</ul>\n\nEqual Employment Opportunity Policy\n<br><br>\nBank of the West is an Equal Opportunity employer and proud to provide equal employment opportunity to all job seekers without regard to any status protected by applicable law. Bank of the West is also an Affirmative Action employer - Minority / Female / Disabled / Veteran.\n<br><br>\nBank of the West will consider for employment qualified applicants with criminal histories pursuant to the San Francisco Fair Chance Ordinance subject to the requirements of all state and federal laws and regulations."}