{"job title": "VP, Data Scientist- Atlanta, GA; Charlotte, NC", "company": "Bank of America Merchant Services", "city state": "– Atlanta, GA, US, 21742", "rating": "3.1", "job description": "Bank of America Merchant Services connects businesses and consumers by doing payments better. In an increasingly complex marketplace, we empower businesses to give consumers the right commerce experience. We consult with businesses to customize solutions that integrate selling channels, open new markets, solve problems using data, stay secure and, ultimately, accomplish more.\n<br><br>\nBanc of America Merchant Services, LLC is the result of a strategic alliance between Bank of America and First Data Corp. As an industry leader with a powerful commitment to the merchant business, Bank of America Merchant Services delivers a comprehensive suite of innovative payment solutions to merchants of all sizes. We are the number one U.S. payments processor today with over 13.5 billion credit card transactions processed annually, representing approximately 300,000 merchant based relationships. We have industry-leading products, world-class technology solutions, an expansive geographic footprint, and 2,100 full-time associates. We offer outstanding career opportunities and advancement and we promote a healthy work/life balance through special benefits and programs. Bank of America Merchant Services is an Equal Opportunity and Affirmative Action Employer of Females, Minorities, Veterans and Disabled.\n<br><br>\nThe Data Science Analytics Manager is a senior contributor and member of the Insights team within the Enterprise Analytics Group. This position will be reporting to the Head of Insights for Bank of America Merchant Services. This role is responsible for working across functional areas (product, marketing, pricing, etc.) to provide market and competitive intelligence, deep analytical modeling, and synthesis of stories to drive adoption of recommendations. The person will provide up-to-date movements in the merchant services market area as well as understand trends in the industry.\n<br><br>\n<strong>Essential Functions</strong>\n\n<ul>\n\n\t<li>Partner across Enterprise to integrate competitive intelligence</li>\n<li>Identify, evaluate and obtain 3rd party information, data, and market news</li>\n<li>Synthesize and distribute competitive insights to Executive Team members</li>\n<li>Identify and size key risks and opportunities based on Competitive Insights</li>\n<li>Develop communication plan that is effective to migrate competitive insights into revenue driving actions</li>\n</ul>\n<strong>Experience</strong>\n\n<ul>\n\n\t<li>7+ years in financial services required</li>\n<li>3+ years in card services preferred</li>\n<li>3+ in market insights / competitive intelligence preferred</li>\n<li>Bachelor’s Degree in quantitative field (e.g. Statistics, Engineering, Computer Science, or a related field) required</li>\n<li>Advanced Degree (e.g. MS, MBA, PhD) or course work in quantitative field strongly preferred</li>\n</ul>\n<strong>Skills</strong>\n\n<ul>\n\n\t<li>Strong Proficiency in SQL, Excel, PowerPoint, and Tableau</li>\n<li>Excellent data visualization capabilities</li>\n<li>Strong written and verbal communication skills</li>\n<li>Familiarity with statistical modeling and big data environments</li>\n<li>Advanced data intuition</li>\n<li>Ability to handle/manage multiple high priority projects</li>\n</ul>\n<strong>Tools</strong>\n\n<ul>\n\n\t<li>Microsoft Office Suite products</li>\n<li>Data Query software tools (SQL/SAS, Tableau)</li>\n<li>Salesforce.com and other data portal querying</li>\n<li>Statistical Software (SAS, R, or related software)</li>\n<li>Big Data platform skills a plus</li>\n</ul>\n<strong>Physical Requirements</strong>\n\n<ul>\n\n\t<li>Standard office environment: Work typically involves close visual acuity on a computer to access, view, read, prepare and analyze data and other written communications.</li>\n</ul>\n<strong>Travel</strong>\n\n<ul>\n\n\t<li>Approximately {10%} travel may be required to conference and/or training and/or client meetings</li>\n</ul>\nThis is not necessarily an exhaustive list of all responsibilities, performance standards, measurements, skills or requirements associated with this job. While this is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require other or different tasks to be performed when circumstances change.\n<br><br>\n5330\n<br>\n#LI-BD1\n<br><br>\nBank of America Merchant Services ensures equal employment opportunity without discrimination or harassment on the basis of race, color, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, protected veteran status, genetic information, or any other basis protected by law.\n<br><br>\nThe employer will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the employer’s legal duty to furnish information.\n<br><br>\n<strong>Nearest Major Market:</strong> Hagerstown\n<br>\n<strong>Job Segment:</strong> \n<br>\n Database, Bank, Banking, Developer, Computer Science, Technology, Finance"}