{"job title": "Data Scientist I", "company": "Bank of America", "city state": "– Charlotte, NC", "rating": "3.6", "job description": "<strong>Job Description:</strong>\n<br><br>\nResponsible for enabling analysis, modeling, and optimization through producing information products. Involved in the research and development efforts. Primary requirement is not related to traditional programming or systems analysis skills, but to the ability to support the creation of sophisticated, value-added analytic systems that support revenue generation, risk management, operational efficiency, regulatory compliance, portfolio management, and research. These systems must overcome issues of complex data (e.g., VLDB, multi-structured, \"big data\", etc.) as well as deployment of advanced techniques (e.g., machine learning, text mining, statistical analysis, etc.) to deliver insights. This role often possesses a degree in hard science or another heavy quantitative business or social discipline. Able to work independently or in a team on complex projects.\n<br><br>\n<strong><strong>Responsibilities:</strong></strong>\n<ul>\n<li>The Data Scientist will be responsible in assessing AI (Artificial Intelligence) solutions implemented across the bank (built internally or externally) to identify any risks which may have unintended consequences. Thereby, assisting Bank of America to follow principles of Responsible AI (Fairness/Equality/Justice, Privacy, and Transparency).</li><li>Review, critical assessment and challenge of models on conceptual soundness, assumptions and limitations, data, developmental evidence in support of modeling choices, performance and implementation.</li><li>Understand the core methodology in AI solutions and the context in which it will be deployed so as to find risks/gaps</li><li>Develop efficient methodologies to detect and to quantify risks/gaps in AI solutions</li><li>Suggest alternative approaches or controls to mitigate risks/gaps identified</li><li>Develop and implement testing plans and testing code in order to challenge models through empirical analyses and to verify model implementation</li><li>Create metrics to quantify risks/gaps specific to each AI solution and define thresholds after consulting with all stakeholders</li><li>Monitor metrics for breach of thresholds</li><li>Look for unexpected risks / unintended consequences of an AI solution over its life cycle</li><li>Write technical reports for distribution and presentation to model developers, senior management, and audit</li>\n</ul>\n<strong><strong>Required Skills:</strong></strong>\n<ul>\n<li>2- 3 years of professional experience as a Data Scientist or related roles</li><li>Experience with Machine Learning/Deep Learning techniques like Linear Regression, ARIMA, Decision Trees, Gradient Boosted Trees, PCA Factor Analysis, Clustering, SVM, CNN, RNN-LSTM, NLP- GloVe/Word2Vec etc.</li><li>Programming experience using SAS / R/ Python required</li><li>Knowledge of model performance measures required</li>\n</ul>\nDesired Skills:\n<ul>\n<li>PhD or Masters in a quantitative field such as Mathematics, Physics, Finance, Engineering or Statistics or Equivalent work experience.</li><li>Knowledge of financial instruments and financial risk management principles is beneficial</li><li>Ability to understand and implement techniques discussed in AI research papers (academic and technical)</li><li>Background in Audit/ Model Risk Management/ Legal/Compliance areas are preferred</li><li>Candidates with certifications like CFA, FRM are preferred</li>\n</ul>\n<strong>Shift:</strong><br><br>1st shift (United States of America)<br><br><strong>Hours Per Week:</strong><br><br>40"}