{"job title": "Data Scientist", "company": "Banner Health", "city state": "– US-AZ-Phoenix", "rating": "3.4", "job description": "Careers Center | Data Scientist\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<div>\n<div>Please Enable Cookies to Continue</div>\nPlease enable cookies in your browser to experience all the personalized features of this site, including the ability to apply for a job.</div>\n\n\n\n\n<div>\n\n\n\n\n<div>\n<div>\n<div>\n\n\n<div>\n\nWelcome page\n\n</div>\n\n</div>\n</div>\n<div>\n<div>\n<div>\n<div>Returning Candidate?</div>\n<div>\nLog back in!\n</div>\n</div>\n<div></div>\n</div>\n</div>\n</div>\n\n\n\n\n<div>\n<div>\n\n\n<div>\n<li>\n<div>\n<div>\n\nData Scientist\n</div>\n</div>\n<div>\n<div>\n\nJob Number\n\n227128\n\n\nFacility\n\nBH Corporate Office\n\n\nDepartment\n\nClinical Performance Analytics\n\n\n\nAddress : Location\n\n\nUS-AZ-Phoenix\n\n\nWork Schedule\n\nDay\n\n\nPosition Type\n\nFT: Full-Time\n\n\nPosting Category\n\nInformation Technology - Non-Clinical\n\n</div>\n</div>\n</li>\n</div>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n---\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p>Good health care is key to a good life. At Banner Health, we understand that, and that’s why we work hard every day to make a difference in people’s lives. We’ve united under a common goal: Make health care easier, so life can be better. It’s a lofty goal, but it’s one we’re committed to seeing through. Do you like the idea of making a positive change in people’s lives – and your own? If so, this could be the perfect opportunity for you. Apply now.</p><p> </p><p>In <strong>Business Performance</strong>, it's all about the data. On this team, you'd be using your critical thinking skills to work through processes, reporting, and analysis to make Banner a better place.</p><p> </p><p>As the <strong>Business Peformance Data Scientist</strong>, you'll be supporting and enhancing our data analytics needs using various data systems analytical techniques as well as fulfilling reporting requirements.</p><p> </p><p>Your pay and benefits (Total Rewards) are important components of your Journey at Banner Health. Banner Health offers a variety of benefit plans to help you and your family. We provide health and financial security options so you can focus on being the best at what you do and enjoying your life.</p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n---\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p><strong>About Banner Health Corporate</strong><br>Within Banner Health Corporate, you will have the opportunity to apply your unique experience and expertise in support of a nationally-recognized healthcare leader. We offer stimulating and rewarding careers in a wide array of disciplines. Whether your background is in Human Resources, Finance, Information Technology, Legal, Managed Care Programs or Public Relations, you'll find many options for contributing to our award-winning patient care.</p><p> </p><br> <div> <br> <br> </div><div> <br> </div><br> <p><strong>About Banner Health</strong><br>Banner Health is one of the largest, nonprofit health care systems in the country and the leading nonprofit provider of hospital services in all the communities we serve. Throughout our network of hospitals, primary care health centers, research centers, labs, physician practices and more, our skilled and compassionate professionals use the latest technology to make health care easier, so life can be better. The many locations, career opportunities, and benefits offered at Banner Health help to make the Banner Journey unique and fulfilling for every employee. </p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\n---\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p><strong>Job Summary</strong><br><br>Provides expertise on highly complex system applications and advanced quantitative methodologies while working with large databases and other advanced analytical tools. This position proactively identifies new opportunities for the organization to improve on, using advanced scientific approaches and methods. Provides internal reporting and analysis for business data to perform substantive, comprehensive quantitative analyses to facilitate data-driven decision making and position the company competitively relative to outcomes, operations and profitability. Maybe responsible for leading cross functional teams using project management skills to achieve desired results.</p><br><p><strong>Essential Functions</strong></p><li><div>Analyzes and reports on highly complex customer needs. Manages and supports the identification and research of new developments and uses of current systems and applications, as well as upgraded systems and applications such as Teradata, SAS and Tableau.</div></li><br> <li><div>Facilitates cross-functional teams and/or leads projects with regional or company-wide scope to implement system or policy changes, determine policies and manage process improvement and redesign. This may also include providing oversight, general work direction or leadership to individuals on the team. Creates presentations and/or reports for management involving significant detailed analysis of multiple or highly complex data sources.</div></li><br> <li><div>Conducts complex analysis with advanced knowledge of statistics, predictive modeling, and data mining, to drive organizational results.</div></li><br> <li><div>Establishes and defines processes, documentation and standards for data quality, and provides expert advice to end users on data access to ensure adherence to critical operating standards of care.</div></li><br> <li><div>Partners across organization and related functional areas to understand internal customer needs related to service excellence, including but not limited to analytical, technology and automated reporting needs and determine the appropriate course of action, and make recommendations in an actionable format including to senior management, to achieve desired business results.</div></li><br> <li><div>Maintains optimal operation of departmental applications in partnership with IT or external software vendor, as appropriate. This may include leading the implementation, maintenance, testing and/or functional design. Coordinate activities of any third party data or research vendors to manage quality and consistent reports, always looking for enhancements.</div></li><br> <li><div>Keeps current on industry, standard and regulatory/compliance issues within assigned areas. Provides system and analytic consultation on these issues to customers. </div></li><br> <li><div>Develops strong relationships with technology partners and collaborate in appropriate areas, including application design, system optimization, programming complex models, transferring large data feeds, and staying current on emerging technology related to all systems.</div></li><br><p></p><p><strong>Minimum Qualifications</strong><br><br>Must possess a Bachelors Degree in Statistics, Epidemiology, Computer Sciences, Process Engineering, Business or related field. <br><br>Requires minimum 7 years of analytic experience in one or multiple areas in clinical, financial, utilization, patient satisfaction, supply chain or related field. Must have experience in working with cross functional departments in order to serve as a liaison and provide relevant guidance or leadership. Must demonstrate ability to lead complex projects and cross-functional teams, including strong project management skills, to resolve, implement or reach consensus on issues. Excellent communication, interpersonal and critical thinking skills are required.Strong technical skills (SQL/Ansi SQL, SAS, Excel, Tableau, R, Python etc.).<br><br><strong>Preferred Qualifications</strong><br><br>Masters degree or higher in relevant field Advanced knowledge of statistics, predictive modeling, and data mining is preferredAdvanced SQL/Ansi SQL programing skill <br><br>Additional related education and/or experience preferred.<br><br>\n\n</p></div>\n</div>\n</div>\n\n\n<div>\n\n<div>\n\n\n\n\n<div>Apply For This JobApply</div>\n\n\n\n\n\n\n</div>\n<div>\n\n</div>\n</div>\n\n\n\n\n\n\n\n\nConnect With Us!\n\n<div>\n<div>\n<div>\nJoin one of our Talent Communities to learn more about a career at Banner Health.\n\n</div>\n</div>\n</div>\n\n\n\n\n<div>\n\n</div>\n\n<div><p></p></div>\n\n</div>\n<div></div>\n</div>\n\n</div>"}