{"job title": "Data Scientist", "company": "BARK", "city state": "– New York, NY", "rating": "3.5", "job description": "<strong>ABOUT BARK:</strong>\n<br><br>\nBARK is a company building products, experiences, and entertainment for dogs and the people who love them. The lasting brand that Disney has built for kids and families, BARK is building for the fast-growing market of dog people.\n<br><br>\nOur ambition-level is high, the opportunity is huge, and our love for dogs is through the roof! We launched in 2011 with BarkBox, a monthly themed subscription of all-natural treats and clever toys. Since then, we've shipped more than 50 million toys and treats to the dogs across the world and use all of that direct customer feedback to inform new initiatives and ways to make dogs happier.\n<br><br>\nBut what kind of company is BARK? It's a company that has gone to the dogs. We are committed to a culture that is open, inclusive, generous, and enthusiastic just like our pups. United by this dog-obsession, we embrace diversity of all stripes and spots. If your camera roll is 90% pictures of your dog, you belong here.\n<br><br>\nAt BARK, we know that dogs aren't pets; they're family. Our people crazy dog people believe that their dogs deserve the best. The best treats, the best toys, the best seat on the couch. Together, we're driven to be the people our dogs think we are.\n<br><br>\n<strong>WHO WE'RE SNIFFIN' FOR:</strong>\n<br><br>\nCan you give a pup belly scratches until you get carpal tunnel? Listen to squeaky toys until your ears bleed? BARK is a fast-growing business for people who love, (*ruv) dogs.\n<br><br>\nAs the first Data Scientist at BARK, you will be the point person supporting BARK's growth, marketing, finance, and operations/planning/logistics teams by applying advanced analytical techniques to our rich and varied datasets, including but not limited to: subscriptions, orders, surveys, payments, email, shipments, web traffic, and external sources. In this hands-on strategic role, you will work with leadership across the organization to understand and develop methodologies for optimizing key performance metrics such as retention, campaign and funnel conversion, new subscribers, customer lifetime value, and more.\n<br><br>\n<strong>DOODIES:</strong>\n\n<ul>\n<li>Analyze, massage, and manipulate raw data to extract insights and meaning and drive decision making</li>\n<li>Design and prototype working data pipelines, visualizations, and models to used to conduct efficient downstream analysis, leveraging statistics and machine learning techniques where appropriate</li>\n<li>Scope and communicate upstream data infrastructure requirements and problems to data engineering team to drive development of better production systems</li>\n<li>Develops and maintains advanced algorithms for data processing</li>\n<li>Support onboarding and success of data / business analysts in ongoing reporting / BI needs</li>\n</ul>\n<strong>EXPERIENCE:</strong>\n\n<ul>\n<li>3+ years' experience writing readable code to handle varied and complex data</li> \n\n<li>Breadth of knowledge in statistical concepts and techniques, particularly inference / hypothesis testing</li>\n<li>Excellent proficiency in SQL and a high level open-source language such as Python, R, or Scala</li>\n<li>Moderate grasp of bash / Linux</li> \n\n<li>Demonstrated aptitude and appetite for picking up new technologies</li> \n\n<li>Sharp analytical mind with attention to detail and nuance</li>\n<li>Excellent written and verbal communication and interpersonal skills</li>\n<li>Passion for growing and strengthening a business using data driven approaches</li>\n</ul>\n<strong>BONUS POINTS</strong>\n<br><br>\nThe Data Scientist need not possess these skills on Day 1, but would be encouraged to grow into many of these areas over time, and recognized as an especially strong applicant if any of these points were met:\n\n<ul>\n<li>Experience with cloud computing platforms (especially AWS)</li>\n<li>A penchant for applying DevOps tools</li>\n<li>Understanding of data infrastructure technologies and best practices</li>\n<li>Big Data experience, e.g. Hadoop, Spark, Redshift</li>\n<li>Experience in the e-commerce industry</li> \n\n<li>Experience visualizing data for business consumers</li>\n<li>Ability to implement algorithms defined in research papers into working systems</li>\n</ul>\n<em>This position is a full-time, salaried position. It is located on-site at our office in New York, NY. We offer health insurance for both you and your pup, 401k, wonderful team lunches, unlimited PTO and a dog to pet anytime you wish.</em>"}