{"job title": "Data Scientist", "company": "Barrick Gold", "city state": "– Elko, NV", "rating": "3.4", "job description": "<div><div><div><div><div><p><b></b> </p>\n<div><b>Position Description:</b></div>\n<div> </div>\n<div>Barrick’s Goldstrike Process Division is seeking a self-motivated <b>Data Scientist</b> to join their team. Reporting to the Metallurgical Services Chief Metallurgist, the successful candidate will be responsible for optimizing process operations to ensure the safe and environmentally sound production of gold. They will coordinate with Process Division technical, operating and maintenance staff to combine data sources, create visualizations and build reporting tools to enhance the quality of decisions and the integration across all functional groups within the division. They will integrate real-time plant data, maintenance data, inventory levels, and financial data to create a picture of the plant that can be used to both control the plant and report on its production to plan. They will coordinate activities that support Barrick’s best business practices. When necessary they will modify existing or create new operating procedures and other tools that will ensure maximum value is achieved while staying true to Barrick’s Vision and Core Values.</div>\n<div> </div>\n<div><b>Responsibilities:</b></div>\n<ul>\n<li>\n<div>Combine data sources and build databases that can be readily opened for end users according to the required need</div></li>\n<li>\n<div>Develop systems to improve the flow of information through the various departments within the process division</div></li>\n<li>\n<div>Develop issue reporting systems that tie into existing operations, maintenance and technical services data streams</div></li>\n<li>\n<div>Perform technical support and process improvement functions which require the application of standard engineering techniques and procedures</div></li>\n<li>\n<div>Prepare technical reports and presentations to include summaries, conclusions, recommendations and cost estimates for consideration</div></li>\n<li>\n<div>Build visualization tools that support operations, maintenance and technical services in the day-to-day operations of the plant</div></li>\n<li>\n<div>Communicate with technicians, engineers and managers and provide technical assistance and analysis as required</div></li>\n<li>\n<div>Work closely with laboratory, process plants, outside departments to ensure environmental and permit compliance</div></li>\n<li>\n<div>Demonstrate strong commitment to safety and environment</div></li></ul>\n<div> </div>\n<div><b>Qualifications:</b></div>\n<ul>\n<li>\n<div>Bachelor of Science degree in Chemical or Mechanical Engineering required</div></li>\n<li>\n<div>Master’s degree or other advanced degree preferred</div></li>\n<li>\n<div>Three (3) to eight (8) years of post-graduate experience in the chemical, energy, petroleum refining or mining industries required</div></li>\n<li>\n<div>Two (2) to four (4) years of front-end web development experience required</div></li>\n<li>\n<div>Two (2) to four (4) years of database administration experience required</div></li>\n<li>\n<div>Previous supervisory experience preferred</div></li>\n<li>\n<div>Mining industry experience within a production environment preferred</div></li>\n<li>\n<div>PE, PMP or other similar qualifications preferred</div></li>\n<li>\n<div>Proficiency in Microsoft Office Suite (Excel, Word, Project, Outlook, etc.) required</div></li>\n<li>\n<div>Experience with Oracle R11.5.10 or R12 or similar ERP preferred</div></li>\n<li>\n<div>Experience with Xeras (Runge) or similar zero-based budgeting tool preferred</div></li>\n<li>\n<div>Understanding of advanced applied mathematics in machine learning, artificial intelligence and array operations required</div></li>\n<li>\n<div>Sequel Server, PostgreSQL/MySQL, Oracle Server experience required</div></li>\n<li>\n<div>Experience with Opensource Visualization Tools (NVD3) required</div></li>\n<li>\n<div>Knowledge of programming languages (PHP, Python) required</div></li>\n<li>\n<div>Knowledge of PI OSIsoft Web API and Datalink required</div></li>\n<li>\n<div>Matlab/GNU-Octave experience preferred</div></li>\n<li>\n<div>Ability to read and write instructions and communicate information in one-on-one and group situations required</div></li>\n<li>\n<div>Demonstrated ability to perform essential functions of position required</div></li></ul>\n<div> </div>\n<div><b> </b></div>\n<div><b>What we can Offer You </b></div>\n<ul>\n<li>\n<div>A comprehensive compensation package including bonuses benefits, and stock purchase plans where applicable</div></li>\n<li>\n<div>Ability to make a difference and lasting impact</div></li>\n<li>\n<div>Work in a dynamic, collaborative, progressive, and high-performing team</div></li>\n<li>\n<div>An Opportunity to transform Traditional Mining into the future of Digital Mining</div></li>\n<li>\n<div>Opportunities to grow and learn with the industry colleagues are endless</div></li>\n<li>\n<div>Access to a variety of career opportunities across Barrick locations</div></li>\n<li>\n<div>Barrick is committed to creating a diverse environment and is proud to be an equal opportunity employer.</div></li></ul>\n<div><b> </b></div>\n<div><b>About Barrick </b></div>\n<div> </div>\n<div>Barrick is the gold industry leader with a vision of wealth generation through responsible mining; wealth for our owners, our people, and the countries and communities with which we partner. Our objective is to maintain and grow industry-leading margins, driven by innovation and our digital transformation; managing our portfolio and allocating capital with discipline and rigor; and leveraging our distinctive partnership culture as a competitive advantage. We aim to cultivate a high-performance culture defined by the following principles: a deep commitment to partnership, consistent execution, operational excellence, disciplined capital allocation, and continual self-improvement. We are obsessed with talent, and seek out fresh perspectives and challenging ourselves to think differently as we transform Barrick into a leading 21st century company.</div>\n<div> </div>\n<div>Barrick Nevada is an integrated gold mining operation that combines the Cortez and Goldstrike properties in Nevada, employing a total of 3,000 employees and 800 contractors. The operation utilizes both open pit and underground mining methods with Autoclave and Roaster processing facilities at Goldstrike and Milling/Heap Leaching facilities at Cortez.</div>\n<div> </div>\n<div> </div>\n<div>Other factors that will be considered are employee performance, length of service, and work history.</div>\n<div>Barrick is committed to creating a diverse environment and is proud to be an equal opportunity employer.</div>\n<div>Thank you for your application, however, only those selected for an interview will be contacted</div>\n<p> </p>\n<p></p>\n \n \n \n\n \n \n\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}