{"job title": "QC Scientist I", "company": "BASF", "city state": "– San Diego, CA", "rating": "3.9", "job description": "BASF?s Bioscience division prides itself as a unique and innovative piece of the global BASF enterprise. With over 150 years of history, BASF has proven to be a thought-leader and visionary moving forward to create chemistry for a sustainable future.\n<br><br>\nThe Enzymes team, located predominately in San Diego, has an environment and culture that puts employees first, allowing for personal flexibility and offers a benefits program that is robust and rewarding. Couple that with the organizations reputation of continued global growth, and the full total rewards as a BASF employee are hard to be matched.\n<br><br>\nOur research focus is simply stated: We create chemistry for a sustainable future. As a global organization, our employees have a world of opportunity at their fingertips- literally. The pillars of success for BASF Bioscience are as follows:\n<br><br>\n+ Connecting people and their passion for bioscience with a structured, engaged, and empowered team while allowing for them to find the work life balance needed to connect with loved ones at home and outside of work priorities/activities. Find yourself in the career you?ve dreamed of with the balance you require.\n<br><br>\n+ Engaging employees to build a high-performance culture that will drive long-term success for themselves and the company, with an open door to many business units and locations around the world. We offer global development opportunities, as well as, encourage relationship building across the organization.\n<br><br>\n+ Caring about one another, our customers and stakeholders, and our communities and environment. As part of the BASF Bioscience team, it is our duty to ensure we are driving thoughtful and meaningful innovations for the future. In fact, it stretches beyond our duty?it?s our passion.\n<br><br>\n+ Putting lifelong learning first by offering a wide range of career development opportunities. This will not be like working at your typical R&amp;D or biotech company. We offer numerous training and development courses, tuition reimbursement, and endorsements for our employees to heighten their career aspirations.\n<br><br>\nQC Scientist I (1804349) - San Diego, CA\n<br><br>\n_Where the Chemistry Happens_\n<br><br>\nUnder minimal supervision, you will conduct laboratory experiments, including organizing data, analyzing results in a Good Laboratory Practices (GLP) setting, and reviewing results for compliance to specifications and reporting deviations. In coordinating technical activities and independently prioritizing workload, it is imperative that you exercise judgment within defined practices and procedures (guided decision-making) and apply knowledge and implement GLP daily. Additionally, you will design and conduct complex laboratory experiments generating reproducible and reliable results.\n<br><br>\n_Formula for Success_\n<br><br>\n+ Leveraging your education and professional experience in Life Sciences or a related field, you will perform enzymatic assays.\n<br><br>\n+ Your technical and problem-solving skills will be a valued asset as you conduct necessary maintenance, calibration, and troubleshooting of laboratory instruments, as required.\n<br><br>\n+ Successfully collaborating outside the organization, you will work closely with analysts at outside toll manufacturing sites in accordance with safety guidelines.\n<br><br>\n+ Your strong written communication skills will be essential as you prepare and revise SOPs and test methods and assist with/write basic technical documents with minimal revisions, as required.\n<br><br>\n+ Demonstrating your solid organizational skills, you will compile records and maintain data on results of analysis and communicate results to investigator and/or supervisor.\n<br><br>\n_Create Your Own Chemistry: What We Offer You_\n<br><br>\nAdding value to our customers begins with adding value to you. You@BASF is the suite of benefits, perks, programs and unique opportunities we offer to support you?the whole you?in all stages of your life and career. With you@BASF, you create your own chemistry.\n<br><br>\nThe total rewards that you receive as a BASF employee go way beyond a paycheck. From competitive health and insurance plans, to robust retirement benefits that include company-matching contributions, to making sure you never stop learning, we believe investing in you is investing in our success. Working for a large, global organization, you?ll have a chance to grow professionally and personally, expand your network and build a rewarding and dynamic career.\n<br><br>\nBASF provides interesting and challenging learning and development opportunities to help you make the most of your talents and your job.\n\n\n<ul>\n<li>*Job:** _REDE - Research &amp; Development_</li>\n<li>*Organization:** _G-ENB/OQ-Quality Management Enzymes-63010592_</li>\n<li>*Title:** _QC Scientist I, San Diego, CA_</li>\n<li>*Location:** _CA-San Diego_</li>\n<li>*Requisition ID:** _1804349_</li>\n</ul>"}