{"job title": "Senior Principal Scientist (Team Leader)", "company": "Bausch &amp; Lomb", "city state": "– CA, Petaluma", "rating": "3.6", "job description": "Overview\n<br>\n\n<br>\nDow Pharmaceutical Sciences, Inc. is focused on development of topical drug products. A division of Valeant Pharmaceuticals North America, LLC, we are located in Petaluma, California, approximately one hour north of San Francisco.\n<br><br>\n<strong>Job Overview:</strong>\n<br><br>\nServes as a primary technical advisor in Analytical Sciences for analysis of pharmaceutical active ingredients, excipients, and topical drug products. Enhances the company’s capability in analytical method development/validation and trains others. Has broad and in-depth understanding of analytical techniques to support testing of a range of small molecules and macromolecules. Has method development/validation experience to accurately assay active ingredients in complex formulation matrices and corresponding expertise to predict and quantitate degradation products Understanding of biomolecules and bioanalytical techniques is desirable. Develops and designs complex analytical experiments, investigative analytical lab plans, and performs insightful reviews of obtained data. Experience in applying ICH guidelines to ANDA and NDA submissions for dermal drug products is a plus. Has good communication skills, is well organized, efficient and adept in identifying key analytical project requirements and deliverables. Monitors the scientific progress, prepares protocols and technical reports. Ensures that laboratory work under the job candidate’s direction is scientifically sound and meets project objectives.\n<br><br>\n<strong>.</strong>\n<br>\n\n<br>\n<strong>Responsibilities</strong>\n<br>\n\n<br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Serves as primary technical consultant / advisor for other chemists, scientists and management• Directs (and performs, as needed) laboratory work and ensures deliverables• Prepares technical proposals and project budgets• Provides project leadership including technical progress and financial review• Serves as consultant / advisor to other scientists and management• Prepares technical reports• Trains individuals and develops training programs• Supervises laboratory staff• Conducts laboratory investigations for anomalous results in a compliant and thorough manner</li>\n</ul>\n\n<strong>Primary Functions:</strong>\n\n\n<ul>\n<li>Serves as a technical expert for pharmaceutical analysis • Directs physical, wet chemical and instrumental analysis, including HPLC and GC• Develops technical proposals and estimates project costs• Keeps current in new analytical capabilities and advises management on industry trends and business opportunities• Provides expert interpretation of laboratory results and designs experiments• Prepares analytical reports and documentation for regulatory filings• Effectively communicates with managers on project status and solutions for problems encountered• Provides training, supervision and scheduling assistance for Technicians and Chemists• Develops training programs• May lead laboratory safety programs• Contributes to patents and the scientific literature</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\n\n<br>\n<strong>Job Requirements:</strong>\n\n\n<ul>\n<li>Pharmaceutical analysis expert with advanced training• Good working knowledge of the pharmaceutical industry and regulatory requirements• Ability to exercise independent judgment based on the individual’s specialized skills in pharmaceutical analysis• Demonstrated program management skills• Good laboratory technique and able to train others• Advanced troubleshooting and method development skills• Technical project leadership abilities• Safety minded in performance of duties• Quality minded with ability to perform work with accuracy and in accordance with established procedures• Effectively communicates with Manager, team members, and Senior Management• Organized and able to perform duties in a timely manner• Analytical • Innovative</li>\n</ul>\n\n<strong>Required Education/Experience/Training:</strong>\n<br><br>\nMinimum: Bachelor’s or Master’s degree in chemistry or related scientific field with approximately fifteen years of experience in pharmaceutical analysis\n<br><br>\nPreferred: PhD degree in chemistry or related scientific field with at least ten years of experience in pharmaceutical analysis\n\n\n<ul>\n<li>*Senior title will be based on level of experience, candidate can be brought in at the scientist level**Recent PhD Graduates with biomolecules/bioanalytical/analytical expertise welcome to apply</li>\n</ul>"}