{"job title": "Lead Performance Improvement Data Analyst", "company": "Bayhealth", "city state": "– Dover, DE", "rating": "1.0", "job description": "Job Details\n<br><br>\nThe Lead Performance Improvement Data Analyst carries out the functions of organizing, analyzing and maintaining the PI data collection projects and activities from diverse data systems, Quality applications, and quality related regulatory sources in collaboration with Performance Improvement Department Leadership. This individual is experienced in the healthcare delivery process and related systems and is responsible for the collection, aggregation, validation and communication of the quality data required for clinical process improvement and regulatory required data to support CMS payment initiatives required and reported by the Performance Improvement department.\n<br><br>\n<strong>Minimum Education and Experience:</strong>\n<br><br>\nMinimum\n<br><br>\nPreferred\n<br><br>\n<strong>Education:</strong>\n<br><br>\nBachelor's degree\n<br><br>\nMaster's degree in healthcare related field\n<br><br>\n<strong>Experience:</strong>\n<br><br>\n3 years of relevant experience in a healthcare delivery setting. Appropriate advanced degree in the healthcare field may be considered as a substitute for experience.\n<br><br>\n<strong>Computer/Software Knowledge:</strong>\n<br><br>\nIntermediate capability with MS Office (Word, Excel, PowerPoint, and Access) or similar software, presentation software, database or similar experience.\n<br><br>\nExpert with MS Office (Word, Excel, PowerPoint, and Access), EPIC, MIDAS+, STATIT, Performance Logic\n<br><br>\nLicensure/Certification\n<br><br>\nApplicable Midas Administrator certification, appointment as lead Performance Logic Administrator and RL Solutions RCA Module Administrator within 6 months of hire.\n<br><br>\nCertified Midas Quality Report Writer\n<br><br>\n<strong>Special Knowledge, Skills, and/or Abilities:</strong>\n\n\n<ul>\n<li>Basic Knowledge of medical terminology</li>\n<li>Working knowledge of the documentation of clinical care in patient medical records</li>\n<li>Familiarity with healthcare delivery processes</li>\n<li>Basic knowledge of statistical principles and application of statistical analyses</li>\n<li>Must be proficient in reading, writing, and speaking English</li>\n</ul>"}