{"job title": "Data Scientist", "company": "Beacon Hill Staffing", "city state": "– South Gate, California", "rating": "4.5", "job description": "<div> \n<div><strong>Description:</strong></div><div><strong> Position/Title:</strong> Data Scientist\n<br><br>\n<strong> Location/Hours:</strong>  Carlsbad, CA FT 40 hours/week (normal business hours)\n<br><br>\n<strong> Duration:</strong>  3-6 months (possible extension) No chance for hire.\n<br><br>\n<strong> Start Date:</strong> 1-2 weeks after final interview\n<br><br>\n<strong> Tech MUST HAVES</strong>\n<br><br>\n1). Minimum 5 years of experience as Data Scientist or Data Science field\n<br><br>\n2). Python and R experience\n<br><br>\n3). Practical experience working with Microsoft or amazon cloud and machine learning (ML) algorithms. Should have experience with multiple ML platforms, such Amazon and Google.\n<br><br>\n4). Building predictive models and problem solving experience with advanced analytics\n<br><br>\n5). Experience with big data computing infrastructure with AWS S3\n<br><br>\n<strong> What does the ideal candidate/resume look like/desired skills</strong>\n<br><br>\n1). 4+ years of data management\n<br><br>\n2). Capable of leading business toward best practices and educating them\n<br><br>\n3). 1-2 years of experience in Life Sciences/Medical Device industry and working on a marketing/sales team\n<br><br>\n<strong> Company Culture/soft skills:</strong> must be a team player, high energy, accepts challenges well, fast paced environment\n<br><br>\n<strong> Interview Process:</strong> 1). Phone Screen 2). Onsite\n<br><br>\n<strong> Official Job Description:</strong>\n<br><br>\n<strong> Responsibilities:</strong>\n\n<ul>\n<li> Apply advanced data mining techniques to build models to optimize, maintain, and repair equipment (life science sequencing machines, molecular and cell biology data on computers.)</li>\n<li> Support monetization efforts through predictive modeling, iterative pilot, and analysis</li>\n<li> Manage outside modeling vendors and monitor project progress to ensure high-quality delivery of predictive models.</li>\n<li> Use big data technologies to scale predictive models to larger dataset</li>\n</ul>\n<strong> Minimum Qualifications:</strong>\n\n<ul>\n<li> Experience with big data computing infrastructure such AWS S3</li>\n<li> 8+ years of experience solving complex business problems with advanced analytics/data.</li>\n<li> Demonstrated success in leading and developing highly technical teams.</li>\n<li> Strong experience working with large data sets and advanced analytical tools and programming languages (R, Python, Scala).</li>\n<li> Practical experience/working knowledge of various machine learning algorithms and statistical methods and how to apply to business applications.</li>\n<li> A strong background in customer profiling and segmentation, predictive statistical modeling, and collaborative filtering.</li>\n<li> Ability to communicate insights using PowerPoint, Word, and Excel to technical and non-technical audiences.</li>\n</ul>\n<strong> Preferred Qualifications:</strong>\n\n<ul>\n<li> MBA or Masters in Applied Statistics, Operations Research, Computer Science or another related field.</li>\n<li> Proficiency in Java, Scala, Python, R, Spark.</li>\n</ul>\n</div> </div>"}