{"job title": "Health Research Scientist", "company": "Beacon Health Options", "city state": "– Rocky Hill, Connecticut", "rating": "2.8", "job description": "Location\n<br>\n<strong>CT: Rocky Hill (500 Enterprise Drive, Suite 4D)</strong>\n<br><br>\nJob Family\n<br>\n<strong>Executive / Administrative Level</strong>\n<br><br>\n<strong>Job Brief</strong>\n<br><br>\nWe are currently seeking a dynamic Health Research Scientist to join our team at our office in Rocky Hill, CT!\n<br><br>\nExempt\n<br><br>\n<strong><u>ABOUT THE POSITION</u></strong>\n<br><br>\nWe are currently seeking a dynamic <strong>Health Research Scientist</strong> to join our team at our office in <strong>Rocky Hill, CT!</strong> Under the direction of the Vice President, Analytic Innovation &amp; Strategy, the <strong>Health Research Scientist</strong> provides leadership in the design, implementation and evaluation of quality and performance improvement projects and other quality-related initiatives from inception through conclusion. Duties associated with these projects include data analysis, review and incorporation of relevant literature, collaborative project design, associated data collection activities including extracting and manipulating data, use statistical methods to analyze data and generate useful reports depicting trends in performance measures, conducting basic statistical analysis, report writing, and presenting results at committee meetings. The Analyst is responsible for understanding and assisting with updating performance measure methodology, including reporting and data requirements, and using quality improvement techniques to improve organizational and/or provider performance. Additional duties include coordinating and/or attending quality management, clinical, State and partnership meetings, and ensuring clear and timely communication of changes, timelines and decisions related to improvement projects. Within this role, the Analyst will also provide support/assistance for development and implementation of improvement projects for partner and provider organizations.\n<br><br>\nResponsible for managing and analyzing data in support of behavioral health and wellness program development, evaluation and outcomes initiatives. Develops risk stratification and adjustment methods, conducts studies of clinical outcomes, interprets trends, evaluates program cost effectiveness and reports results to stakeholders.\n<br><br>\n<strong><u>Position Responsibilities:</u></strong>\n\n<ul>\n <li>Organizes, analyzes and trends performance-related clinical and quality data for the Beacon Health Options Engagement Center. Works with department manager to outline specific data needs for each project.</li> <li>Takes the lead in developing and implementing contract-required performance improvement projects and initiatives. This includes literature searches, development and implementation of PIP/study methodology and documentation, data extraction, statistical analysis, developing, coordinating and/or implementing interventions with providers to achieve and maintain improvement. Maintain written PIP documentation according to state requirements, including submission according to prescribed timelines.</li> <li>Maintains data for assigned projects and performance measures, conducts analyses of performance data, develops reports that identify, summarize and interpret both positive and negative data/performance trends, and makes recommendations for improvement or change as needed.</li> <li>Responsible for updates to and maintenance of State-required performance measure methodology, participating in State performance measure work groups, and coordinating with Beacon Data Analytics and Reporting Departments in the production of the measures.</li> <li>Provides oversight to conduct clinical outcomes research, serving as a lead investigator and/or primary author for a variety of projects from inception and needs assessment through presentation of results.</li>  <li>Contributes to the design, implementation, and evaluation of new standardized tools, software applications, and operational processes that support the collection and analysis of clinical outcomes data.</li>  <li>Consults with staff and state partners as a subject matter expert regarding study design and the use of clinical outcomes information.</li>  <li>Promotes outcomes research through internal presentations, training activities, participation in key committees, and monitoring activities.</li> <li>Contributes to the external promotion of clinical outcomes research activities through publications and preparation of other materials/reports that are presented to clients and other stakeholders.</li>  <li>Assists with the continued development and implementation of integrated care programs with a specific emphasis on clinical outcomes monitoring and program evaluation.</li>\n</ul>\n\n<strong><u>Position Requirements:</u></strong>\n<br>\n<u>Education</u>: Master's Degree in psychology, public health, economics, statistics, biostatistics, epidemiology, psychology or management with a quantitative emphasis is required. Equivalent experience in a healthcare-related field that requires completion of independent research. PhD degree preferred\n<br>\n<u>Licensure</u>: Not required. Licensure as Psychologist, LCSW, or LMFT preferred.\n<br>\n<strong><u>Relevant Work Experience:</u>\n<br><br>\n</strong>\n\n<ul>\n <li>Three or more years of analytical experience, including background with SAS EG and SAS Enterprise Miner, preferably as a healthcare data analyst or researcher. Experience in developing studies, conducting statistical analyses; knowledge of healthcare claims data and behavioral health preferred.</li>  <li>Excellent analytic, as well as written and verbal communication skills required. Prior experience conducting professional presentations and producing written publications based on clinical outcomes research. Tableau visualization experience a strong plus, as is experience in a research, insurance, behavioral health or healthcare setting.</li> \n</ul>\n\n<u>Knowledge, Skills &amp; Abilities</u>:Detail Oriented\n\n<ul>\n <li>Excellent Time Management Skills</li> <li>Excellent Verbal and Written Communication skills</li> <li>Excellent Interpersonal Skills</li> <li>Project Management Skills</li> <li>Team Oriented</li> <li>Microsoft Applications</li> <li>SAS preferred</li> <li>Tableau familiarity desired</li> <li>Understanding of BH practice and systems</li> <li>Analytics and Statistics</li>\n</ul>\n\n<strong><u>TO APPLY</u></strong>\n<br><br>\nClick below on <strong>\"Apply for this Position\"</strong> to create a profile and apply for the position\n<br><br>\nBeacon Health Strategies, LLC. a Beacon Health Options company, is proud to be an Equal Opportunity Employer as well as a Drug Free Work Environment. EOE/M/F/Veterans/Disabled\n<br><br>\n<strong>#CB</strong>\n<br>\n<strong>#GD</strong>\n<br>\n<strong>PM16</strong>\n<br><br>\n<strong>AAP Reporting Location:</strong>\n<br><br>\n<strong>CT - Rocky Hill</strong>\n<br><br>\n<strong>ID (Req #):</strong>\n<br><br>\n<strong>55562</strong>\n<br><br>\n<strong>FTE Status:</strong>\n<br><br>\n<strong>Full Time</strong>\n<br><br>\n<strong>Schedule:</strong>\n<br><br>\n<strong>M-F 830-5pm</strong><br><br>PI105691774"}