{"job title": "Data Scientist", "company": "Beautycon Media", "city state": "– Los Angeles, CA", "rating": "2.2", "job description": "Beautycon is seeking a Data Scientist to join our team. Data scientists solve problems. Beautycon is looking for a technically savvy Data Scientist to unravel complex queries and the creativity to know how to get there. Often seen as part mathematician, part computer scientist and all trailblazer you will work to gain insights to support Beautycon strategies.\n<br><br>\nThis position will possess a deep understanding of all things data and know which questions to ask; questions that involve looking into the invisible relationship between disparate data sets. If you an individual that is wild about data and enjoys providing insight to internal stakeholders, we want to hear from you!\n<br><br>\nResponsibilities\n\n<ul>\n<li>Champion data-driven culture by empowering others to proactively use data to make responsible decisions and ask smart questions</li> \n\n<li>Define, model, analyze, and measure key performance indicators and socialize facts (and corresponding caveats) to business stakeholders</li>\n<li>Work closely with business partners to design and evolve dashboards for key business performance indicators and metrics</li>\n<li>Communicate complicated topics across the organization in a way that is friendly and accessible to a diverse audience</li>\n<li>Proactively identify key strategic questions and problems; offer productive solutions focused on long-term and scalable benefits</li>\n</ul>\nMinimum Qualifications\n\n<ul>\n<li>Bachelors Degree in a technical discipline with strong experience in data &amp; business analysis</li>\n<li>2+ years as a Data Scientist / Senior Analyst or related position with significant quantitative and analytical experience</li>\n<li>Ability to manipulate and transform data to set up data pipelines for reporting and analysis</li>\n\n<strong><li>Expert level knowledge::</li>\n\n</strong>\n\n<li>Scripting language: R (preferred), Python, or similar</li>\n<li>Relational data: SQL (MySQL and/or Redshift preferred,)</li> \n\n<li>Business Intelligence: Domo (preferred), Tableau, Looker or similar</li>\n<li>Strong data visualization skills Strong project management skills, the ability to manage multiple projects simultaneously and the desire to bring structure to undefined processesReal world experience analyzing messy data and communicating findings to non-technical audience.</li>\n</ul>\nPreferred Qualifications\n\n<ul>\n<li>Familiarity with site analytics and experiment design (e.g. A/B testing)</li>\n<li>Ability to generate complex analyses thats scalable, reproducible, and to present subsequent insights across teams and to management</li>\n<li>Experience with event and/or e-commerce data</li>\n<li>Experience translating business analysis into consumer products strategy</li>\n<li>Strong communication and interpersonal skills; must be personable yet persistent</li>\n<li>Enthusiastic, creative, entrepreneurial, self-starter attitude</li>\n<li>High level of intellectual curiosity and comfort with ambiguity</li>\n</ul>"}