{"job title": "Junior IT Data Scientist", "company": "Beckman Coulter - Diagnostics", "city state": "– Brea, California", "rating": "NA", "job description": "About UsAt Beckman Coulter, we are dedicated to advancing and optimizing the laboratory. For more than 80 years, we have been a trusted partner for laboratory professionals, helping to advance scientific research and patient care. We do challenging work on a global scale, and are invested in growing our associates careers. We embrace continuous improvement, and are passionate about moving science and healthcare forward.We have a vital role at Beckman Coulter: our focus on innovation, reliability and efficiency has led us to become the partner of choice for clinical, research and industrial customers all over the world.Beckman Coulter is a Danaher company, operating in two industries: Diagnostics and Life Sciences.\n<br><br>\n<strong><br><br>Description</strong><br><br>Senior IT for Data Science PositionDescription:The Senior IT Data Scientist will join the Business Intelligence and Analytics team to build and support predictive analytics frameworks for the company. The ideal candidate will have extensive experience in analytical, data mining and predictive tools and will identify and propose innovative solutions for various business functions such as Sales, Logistics and Finance.What youll do:•Translate business questions and apply statistical models and analyses to answer business questions in an actionable and reproducible manner.•Create statistical models, machine learning and other techniques to predict customer churn, delays in order delivery, invoices that will be disputed etc.•Leverage SQL and other programming languages to acquire the data to analyze in ad hoc analyses.•Perform data profiling to identify and understand anomalies in data.•Automate data analysis and streamline analytical processes •Provide recommendations based on data trends uncovered when possible •Describe the logic and implications of a complex model to all types of business partners, and work directly with them refining models and deliverablesRequirements:•A degree in Data Science, Statistics, Economics, Math, Computer Science or other relevant fields. Bachelors Degree with 5+ years of experience in predictive data analytics/statistics, or Masters Degree with 3+ years, or PhD 0-2 years.•Expertise in data science tools/techniques: R, Python, SPSS, data mining, etc or similar software.•Significant experience with modern ML frameworks like Theano, TensorFlow, etc.•Experience with relational databases and SQL•Experience with modeling structured and/or unstructured data, leveraging such techniques as penalized regression, multilevel modeling, ensemble models, or time series models•Experience with a variety of supervised and unsupervised machine learning methods•Excellent communication and collaboration skills, with both technical and non-technical counterparts•An entrepreneurial mindset with a willingness to go the extra mile to find solution and overcome roadblocks•Experience in AWS toolset preferred.•Experience with Big Data technologies like Hadoop, Spark, Pig, MapReduce preferred•Experience with ERP, data warehousing concepts, cloud systems like Salesforce, ServiceMax preferred\n<br><br>\n<strong><br><br>Qualifications</strong><br><br>Senior IT for Data Science PositionDescription:The Senior IT Data Scientist will join the Business Intelligence and Analytics team to build and support predictive analytics frameworks for the company. The ideal candidate will have extensive experience in analytical, data mining and predictive tools and will identify and propose innovative solutions for various business functions such as Sales, Logistics and Finance.What youll do:•Translate business questions and apply statistical models and analyses to answer business questions in an actionable and reproducible manner.•Create statistical models, machine learning and other techniques to predict customer churn, delays in order delivery, invoices that will be disputed etc.•Leverage SQL and other programming languages to acquire the data to analyze in ad hoc analyses.•Perform data profiling to identify and understand anomalies in data.•Automate data analysis and streamline analytical processes •Provide recommendations based on data trends uncovered when possible •Describe the logic and implications of a complex model to all types of business partners, and work directly with them refining models and deliverablesRequirements:•A degree in Data Science, Statistics, Economics, Math, Computer Science or other relevant fields. Bachelors Degree with 5+ years of experience in predictive data analytics/statistics, or Masters Degree with 3+ years, or PhD 0-2 years.•Expertise in data science tools/techniques: R, Python, SPSS, data mining, etc or similar software.•Significant experience with modern ML frameworks like Theano, TensorFlow, etc.•Experience with relational databases and SQL•Experience with modeling structured and/or unstructured data, leveraging such techniques as penalized regression, multilevel modeling, ensemble models, or time series models•Experience with a variety of supervised and unsupervised machine learning methods•Excellent communication and collaboration skills, with both technical and non-technical counterparts•An entrepreneurial mindset with a willingness to go the extra mile to find solution and overcome roadblocks•Experience in AWS toolset preferred.•Experience with Big Data technologies like Hadoop, Spark, Pig, MapReduce preferred•Experience with ERP, data warehousing concepts, cloud systems like Salesforce, ServiceMax preferredBECKRSRDanaher Corporation OverviewDanaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. Were innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here youll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.\n<br><br>\n<strong> Organization</strong>\n<br><br>\n:Beckman Coulter - Diagnostics"}