{"job title": "Data Scientist", "company": "Beeswax", "city state": "– New York, NY", "rating": "4.9", "job description": "Beeswax, named one of Business Insider's \"hottest pre-IPO startups\" is hiring top engineering talent for it's growing New York office. Beeswax is a high scale, high availability advertising platform built by executives from Google and funded by leading VCs including RRE and Foundry Group.\n<br><br>\nThe Beeswax engineering team is a top-notch group with backgrounds from Google, Amazon, Oracle and other premier technical teams. Because advertising is extremely high scale (millions of transactions per second) and low latency, the opportunity to learn about web-scale distributed systems and hard scaling problems is a great advantage of our engineering culture and work.\n<br><br>\nWe are looking for a<strong> data scientist</strong> to lead our machine learning efforts. We aim to offer the most extensible and transparent advertising system, servicing technology enabled clients and executing and processing billions of events every day. You can also read about our flexible APIs at www.beeswax.com/docs.\n<br><br>\nOur products are built on a variety of technologies including C++, Java, Python and LEMP stack (PHP, MySQL, nginx), and while our engineers typically specialize in one area, they need to coordinate and integrate with a wide variety of systems, including homegrown and AWS-native services.\n<br><br>\nThe ideal candidate will have experience working on a range of optimization problems in a production environment, such as click-through rate prediction, click-fraud detection, payment fraud, search ranking, text/sentiment classification, viewability prediction, or spam detection. The position will involve taking these skills and applying them to some of the most exciting tech at the massive scale of the real time advertising space. It will also involve leading and growing a machine learning team.\n<br><br>\nThis position reports to the CTO, a long-time senior engineer from Google, who was instrumental in the expansion and scaling of Gmail, among other milestones.<br><br>Responsibilities\n\n\n<ul>\n<li>Work with customers and the product team to design optimization systems for both off-the-shelf use and customization through APIs</li>\n<li>Develop highly scalable machine learning systems to automatically score and optimize real-time bidding advertising campaigns</li>\n<li>Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore and SMP)</li>\n<li>Ad tech experience a plus</li>\n</ul>\n\n<strong>Requirements:\n<br><br>\n</strong>\n\n\n<ul>\n<li>A minimum of 5 years experience in Machine learning, large-scale data mining, or applied data science</li>\n<li>Experience with big data technologies such as Spark/Snowflake is a plus</li>\n<li>Experience with scripting languages such as Python and shell scripts</li>\n</ul>"}