{"job title": "Data Analyst", "company": "Berkadia", "city state": "– Ambler, PA, US", "rating": "3.7", "job description": "<p>Berkadia,\na joint venture of Berkshire Hathaway and Jefferies Financial Group, is a leader in the\ncommercial real estate industry, offering a robust suite of services to our\nmultifamily and commercial property clients. Powered by deep relationships and\nindustry-changing technology, our people sell, finance, and service commercial\nreal estate, providing support for the entire life cycle of our clients’\nassets. Our unique ownership structure allows us to put the client’s interests\nfirst and creates a marketplace that delivers a superior experience.</p>\n\n<p>Our\npeople are our greatest strength and make Berkadia a great place to work,\ncreating an environment of trust, mutual respect, innovation and collaboration.\nWe invest in our people through our commitment to training, product development\nand enhancements in technology making Berkadia a truly innovative and\nsupportive organization.</p>\n\n<p><b>The Opportunity</b></p>\n\n<p>The\ncandidate will join the Data Science team as a data wrangler/engineer, analyzing,\ncleansing, and transforming data as needed to produce normalized and enriched\ndata sets.</p>\n\n<ul><li>Research,\nanalyze, and interpret data</li><li>Leverage\na variety of tools (SQL, R, Python, Excel, etc.) to prepare data sets for\nusage, pulling from multiple data sources with varying level of quality and\ncomplexity. Extensive data manipulation often required</li><li>Run\nad hoc analyses and answer specific day to day questions or support larger\ninitiatives</li><li>Develop\nand maintain high quality, recurring dashboards and reports for internal and\nexternal stakeholders</li><li>Understand\nand evaluate existing SQL scripts and data models</li><li>Work\nclosely with product owners and business stakeholders to become a source data\nexpert</li><li>Develop\nstandards and best practices for data analysis and normalization</li></ul>\n\n<p><b>What is required for\nthis role </b></p>\n\n<ul><li>Bachelor’s\ndegree in mathematics or computer science, or equivalent professional work\nexperience</li><li>Minimum\n3 years of experience working in a Data Analysis role</li><li>Advanced\nSQL development skills</li><li>Strong\ndata wrangling skills (data cleansing, transformation, and aggregation) </li><li>Strong\ndata visualization and report development skills</li><li>Proficiency\nwith Microsoft products including Excel, Access and Word</li><li>Experience\nwith BI tools (Tableau, Cognos, SSRS, etc.) a plus </li><li>Strong\nunderstanding of database design and structure</li></ul>\n\n<p><b>What\nthe Analyst will need to be successful in this role</b></p>\n\n<ul><li>Robust\nproblem solving and analytical skills </li><li>Excellent\ncommunication and time management skills</li><li>Highly\norganized with a strong attention to detail</li><li>Ability\nto work closely with a team in a collaborative and agile development process</li><li>Desire\nto learn new technologies and business concepts</li><li>Basic\nunderstanding of data science and ability to support multiple data scientists.</li></ul>\n\n<p><b>Berkadia Commercial\nMortgage</b>\nis an equal opportunity employer and affords equal opportunity to all\napplicants and employees for all positions without regard to race, color,\nreligion, gender, national origin, age, disability, veteran status or any other\nstatus <b>protected</b> under local, state\nor federal laws.</p>"}