{"job title": "Data Scientist - Generalist", "company": "Beyond Limits", "city state": "– Glendale, CA, United States", "rating": "4.7", "job description": "<strong>Job Title:</strong> Data Scientist - Generalist\n<br>\n<strong>\n<br>\nPosition Overview</strong>\n<br><br>\nWe are looking for entry level Data Scientists to join our growing team! The successful candidates will work with the data science and engineering teams to collect, process, and analyze data from projects relating to energy, healthcare, finance, and logistics. <strong>\n<br><br>\nResponsibilities and Job Duties</strong>\n<ul>\n<li>Ingest and organize data from various sources (e.g. CSV, relational database)</li><li>Process data using typical data science techniques (e.g. deduping, imputation)</li><li>Conduct analyses using common DS techniques, such as:\n\n<ul>\n<li>Linear / logistic regression</li><li>Decision tree algorithms (e.g. random forest)</li><li>Clustering algorithms (e.g. K-means)</li><li>Support vector machine (SVM)</li></ul></li>\n<li>Analyze and visualize data using common data science packages, such as:\n\n<ul>\n<li>Numpy</li><li>Pandas</li><li>Matplotlib</li><li>Plotly</li></ul></li>\n<li>Work in a highly collaborative environment to brainstorm, design, implement and deliver solutions to some of the most challenging industrial IOT problems</li>\n</ul>\n<strong>Qualifications and Skills</strong>\n<ul>\n<li>Minimum 1-2 years of experience solving data science problems</li><li>Programming experience in Python, Java, and/or Matlab</li>\n</ul>\n<strong>Preferred Requirements</strong>\n<ul>\n<li>Masters or PhD</li><li>Application of data science solutions in industrial projects</li> <li>Domain expertise in energy, healthcare, finance, and/or logistics</li><li>Research experience with high impact publications</li>\n</ul>\n\n<strong>About Beyond Limits</strong>\n<br>\nBeyond Limits is a pioneering Artificial Intelligence company with a technology legacy in Space Exploration. A spinoff of NASA's Jet Propulsion Lab and Caltech, Beyond Limits provides advanced intelligence solutions that go far beyond conventional AI. Our cognitive computing technology mimics human thought processes and provides autonomous reasoning to aid human-like decision-making.\n<br><br>\nBeyond Limits provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Beyond Limits complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n<br><br>\nBeyond Limits expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of Beyond Limit’s employees to perform their job duties may result in discipline up to and including discharge.<br><br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}