{"job title": "Data Scientist - CA", "company": "Bind Benefits", "city state": "– San Francisco, California", "rating": "3.0", "job description": "<strong>Position Summary</strong>\n<br><br>\nThe Data Scientist will perform analyses of structured &amp; unstructured data to solve multiple &amp; complex business problems utilizing advanced statistical techniques &amp; mathematical analyses &amp; specialized expertise in organization and/or industry. A Bind Data Scientist directs and participates as an active, hands-on member a team of Data Scientists to design, develop, and implement end-to-end cloud based machine learning production pipelines (data exploration, sampling, training data generation, feature engineering, model building, and performance evaluation).\n<br><br>\n<strong><strong>Location:</strong></strong> San Francisco<strong>\n<br>\n<strong>Department:</strong></strong> Data Science<strong>\n<br>\n<strong>Reports To:</strong></strong> Data Science Lead<strong>\n<br>\n<strong>Employee Status:</strong></strong> Full-Time, Regular, Exempt\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Ensures that data pipelines are scalable, repeatable, and secure, and can serve multiple users within the company</li><li>Collects, parses, manages and analyzes and visualizes large sets of data using multiple platforms</li><li>Codes, tests, and documents new or modified data systems to create robust and scalable applications for data analytics</li><li>Works with developers to make sure that all data solutions are consistent and ensures all automated processes to preserve data by managing the alignment of data availability and integration processes</li>\n</ul>\n<strong>Essential Role Requirements</strong>\n<br>\n<em><strong>Education:</strong></em>\n<ul>\n<li>Bachelor's degree in Information Technology, Mathematics, Computer Science, or a related quantitative discipline required.</li><li>Masters in Statistics preferred.</li>\n</ul>\n<em><strong>Required Experience:</strong></em>\n<ul>\n<li>Experience working with a team of Data Scientists</li><li>Experience working with both Structured AND Unstructured data</li><li>Demonstrated experience with agile or other rapid application development methods</li><li>Health Care Data Experience required</li><li>Experience with Medical Claims Data</li><li>Ability and Experience to write Python code against Health Care Data</li><li>Experience with developing predictive models using machine learning methods; performing data quality assessment, data integration &amp; transformation in preparation for analytics modeling</li><li>Extensive knowledge in different programming or scripting languages along with writing / running mark-up data</li><li>Expert knowledge of data modeling and understanding of different data structures</li>\n</ul>\n<em><strong>Preferred Skills:</strong></em>\n<ul>\n<li>Experience with any of the following technologies: R, SQL Server, Java, Hadoop, Hive, SPSS Modeler, SPSS Statistics, Jupyter Workbook, HTML</li>\n</ul>\n<strong>What is Bind?</strong>\n<br>\nBind rewired health benefits to be on-demand. This means people are covered for what they need and have the flexibility to add more coverage if or when they need it. The Bind plan puts the power in people's hands, where it belongs, and allows them to design their health benefits coverage on-the-go, based on their life and needs.\n<br><br>\nThe Bind app and website lets people see the total cost of care, and what their copays will be, well in advance of getting treated. No more confusing coinsurance and deductible formulas; Bind keeps things clear and simple.\n<br><br>\n<strong>Why Bind?</strong>\n<br>\nWe believe a career at Bind should provide competitive pay and benefits, a collaborative and supportive work environment, plus\n<br>\ncutting-edge technology and services that focus on innovation and scale - more reasons to love it here.<br><br>Keywords:bind, insurance, benefits, health, technology, odhi"}