{"job title": "Data Scientist", "company": "Bioclinica", "city state": "– Durham, NC", "rating": "2.7", "job description": "<strong><u><strong>Primary Responsibilities</strong></u></strong>\n<br><br>\nAt Bioclinica, the role of Data Scientist is to focus on digital data asset transformation. Data Scientists utilize their analytical, statistical, and programming skills to collect, analyze, and interpret large data sets. They then use this information to develop data-driven solutions to difficult business challenges. To discover the information hidden in vast amounts of data leading to more accurate decisions, to design and deliver better products, more effectively conduct clinical trials, provide deeper insights to our customers, and optimize our services operations utilizing the power of our integrated data assets. To derive “deep science” insights, findings, and outcomes within our enterprise data assets across Bioclinica’s Imaging and eHealth product lines ensuring efficient and effective data and BI reporting integration across multiple source systems and products. Your primary focus will be in applying data mining techniques, conducting statistical analysis, building high quality prediction systems integrated within our product lines, develop models/algorithms to test the effectiveness of different courses of action, working with our colleagues to gather requirements and specifications, executing data transformation logic, developing data algorithms, prototyping information insights methods, and coordinating approval and implementation of innovative information solutions with product / project managers and other key stakeholders.\n<ul>\n<li>Work with Stakeholders throughout the organization to identify opportunities for leveraging company and third-part reference data to drive business solutions.</li><li>Mine, analyze, and implement data driven solutions focused on deep insights, improving efficiency and creating value.</li><li>Performs deep data analysis and data processing in support of reporting/analytic solutions and Artificial Intelligence/Machine Learning.</li><li>Utilizes predictive modeling and machine learning approaches to derive actionable insights using state-of-the-art statistical methods.</li><li>Enhances data collection procedures to include information that is relevant for building analytic solutions. Processing, cleansing, and verifying the integrity of data used for analysis.</li><li>Leads and supports the internal set-up, configuration, data integration, and quality control of data platforms including data warehouses, operational data stores, data lakes and more.</li><li>Leverages master data management solutions to continuously improve data quality.</li><li>Works closely with business leaders to develop and automate KPIs that lead and monitor our business.</li><li>Conducts ad-hoc analysis, builds interactive dashboards that provide business insights, creates business value and presents results in a clear manner.</li><li>Extends Bioclinica’s data with third-party sources of information when needed.</li><li>Collaborates with stakeholders to ensure data collection supports future business goals.</li><li>Develops processes and tools to monitor and analyze model performance and data outcomes.</li><li>Ensures data completeness and accuracy through developing and implementing data quality checks. Assesses the effectiveness, quality and accuracy of data sources and data platforms.</li><li>Creates and maintains data integration documentation across projects being supported including ongoing changes or amendments to data integration specifications.</li><li>Supports and provides solutions or new ideas for tool development that can enhance the operational efficiency of the data department and initiates, creates and drives awareness around new processes that are implemented.</li><li>Communicates effectively with team, stakeholders, and other operations personnel on the successful execution of data integration deliverables.</li><li>Attends external Client meetings to provide data integration support, as required.</li><li>Coordinates multiple sources of data for file transformation, processing, and proper documentation and quality control across assigned projects.</li><li>Supports operational issues and troubleshooting directly impacted by data related aspects of the system.</li><li>Communicates effectively within the project team and escalates issues to ensure timely delivery.</li>\n</ul>\n<strong><u><strong>Secondary Responsibilities</strong></u></strong>\n<ul>\n<li>Maintain expertise with Bioclinica applications and integration solutions and associated data.</li></ul>\n\n<ul>\n<li>Assist internal and external users with troubleshooting and implementing new integrations.</li>\n</ul>\nMaintains Quality Service and Departmental Standards by\n<ul>\n<li>Reading, understanding and adhering to organizational Standard Operating Procedures (“SOP”).</li></ul>\n\n<ul>\n<li>Assisting in establishing and enforcing departmental standards.</li>\n</ul>\nContributes to team effort by\n<ul>\n<li>Working with internal staff to resolve issues.</li><li>Exploring new opportunities to add value to organization and departmental processes.</li><li>Helping others to achieve results.</li><li>Performing other duties as assigned.</li>\n</ul>\nMaintains Technical and Industry Knowledge by\n<ul>\n<li>Attending and participating in applicable company-sponsored and industry training.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br>\n<strong>Education:</strong>\n<br>\nBachelor’s degree in an Engineering, Science, Information Technology or business discipline required\n<br>\nMaster’s degree in an Analytics, Science, Information Technology or closely related field required\n<br><br>\n<strong>​Experience:</strong>\n<br>\nExperienced and proficient using statistical computer languages (R, Python) to manipulate data and draw insights from large data sets.\n<br>\n8+ years of Data aggregation, analysis, and processing experience preferred\n<br>\nUnderstanding of ETL principles such as meta-driven ETL highly desirable\n<br>\nExperience with writing SQL queries and monitoring problems preferred\n<br>\nCRO / Clinical Trial / Life Science experience preferred\n<br><br>\n<strong>Additional skill set:</strong>\n<br>\nHighly motivated self-starter. A drive to learn and master new technologies, techniques, and data sources.\n<br>\nStrong problem-solving skills. Flexible. Adaptable.\n<br>\nKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc)\n<br>\nExcellent ability to manipulate, analyze, and perform computations.\n<br>\nAbility to work in agile operational environments.\n<br>\nBe accountable for the timely deliverables meeting all quality goals.\n<br>\nHands-on knowledge of current technology standards/trends coupled with a desire to continually expand personal knowledge/skills.\n<br>\nAbility to manage change and cope with complex and ambiguous situations.\n<br>\nAbility to establish and maintain relationships with other business and technology leaders.\n<br>\nStrong written and verbal communication skills coupled with the ability to tailor communication to all levels of an organization.\n<br>\nDemonstrated ability to debate ideas/strategy, comfortable managing constructive conflict, and not afraid to challenge the status quo.\n<br>\nStrong critical thinking and communication skills.\n<br>\nMust understand deep analytics’ methodologies and tools\n<br><br>\n<strong>Working conditions:</strong>\n<br>\nTravel: 0-20%\n<br>\nLifting: 0-15lbs\n<br>\nOther: Computer work for long periods of time\n<br><br>\nEEO Statement\n<br>\nBioclinica is an equal opportunity employer. Bioclinica evaluates qualified applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, protected veteran status, disability/handicap status or any other legally protected characteristic"}