{"job title": "Data Scientist Intern - 4 Month Spring Term", "company": "Blackberry", "city state": "– Irving, Texas", "rating": "3.3", "job description": "<strong>Worker Sub-Type:</strong>\n<br><br>\n<strong><strong><strong> Job Description:</strong></strong></strong>\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nBlackBerry is looking to hire a Data Scientist Engineer intern to join our Enterprise Engineering team and extend the capabilities of the BlackBerry Analytics platform. This engineer will join a senior team of engineers to learn how to classify and analyze large amounts of data and extract meaningful business information and also how this information can be used to enhance the user experience while maintaining a secure environment.. The Engineer will use a variety of tools including industry standard Big Data platforms, Web Frameworks as well as custom developed software.\n<br><br>\nLocation: Irving, Texas\n<br><br>\nLength of Term: 4 Months\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<ul>\n<li>Identify actionable information, forecast app and user behavior and influence app development by identifying the app and app feature usage patterns.</li><li>Implement reporting dashboards to display app, user metrics to provide actionable information to the team’s customers</li><li>Work together with the engineering team and participate in the software development process using Agile methodology</li><li>Suggest process, tool and technique improvements to help the team meet its commitments</li>\n</ul>\n<strong>SKILLS AND QUALIFICATIONS</strong>\n<ul>\n<li>Currently enrolled in a Bachelor's/Master's Degree Engineering program at an accredited college or university</li><li>Experience with Programming languages (Java, Scala) and SQL</li><li>Proficient in scripting languages (PERL, Python, etc.)</li><li>Experienced in statistical techniques using R, MATLAB (plus)</li><li>Knowledge of Web frameworks like Angular (plus)</li>\n</ul>\n<strong>Job Family Group Name:</strong><br><br>Business Practices &amp; Operations<br><br><strong>Scheduled Weekly Hours:</strong><br><br>40"}