{"job title": "Data Analyst", "company": "Blackbaud", "city state": "– Charleston (Customer Operations Center) - South Carolina -", "rating": "3.1", "job description": "<p><b>About Blackbaud:</b></p><p></p><p>Leading uniquely at the intersection point of technology and social good, Blackbaud provides software, services, expertise, and data intelligence that empowers and connects people to advance the social good movement. We serve the entire social good community, which includes nonprofits, foundation, corporations, education institutions, and the individual change agents who support them. We work with over 40,000 organizations, helping them realize their goals, fund their missions, manage their operations, and develop long-lasting supporter relationships. Our customers are passionate about making the world a better place, and we’re inspired by the opportunity to help them.</p><p></p><p></p><p><b><u>About the Role:</u></b></p><p>The Data Analyst works with key stakeholders to understand their business needs, and then addresses those needs through technology, where possible. The focus of the DA is acquisition of client legacy data for conversion, collaboration across resources to effectively prepare project for delivery team and accurate, efficient delivery of projects. The DA works closely with the business and technology teams to implement solutions that meet the needs of the business. This person understands business and ensures that there is integration between business and technology. The DA understands the system implementation process – and is very analytical with problem-solving and conflict resolution skills to help identify, communicate and resolve issues</p><ul><li>Coordinate internal resources and third parties/vendors for the flawless execution of projects</li><li>Investigates and takes action to meet customers’ current and future needs. Gives customer needs priority and responds quickly to customer concerns. Builds positive and fruitful customer relationships.</li><li>Work with customer to obtain usable legacy data that conforms to acceptable formats and scopes of service.</li><li>Ensure resource availability and allocation</li><li>Develop a detailed project plan to monitor and track progress</li><li>Manage changes to the project scope, project schedule, and project costs using appropriate verification techniques</li><li>Successfully manage the relationship with the client and all stakeholders</li><li>Understands programming concepts, database design, and SQL; will be required to write and troubleshoot SQL code</li><li>Collect, document, and maintain the authoritative list of requirements for all development efforts related to identified business systems</li><li>Learns the data models in use in the business and can effectively design and/or recommend technology solutions that align with the data model</li><li>Lead UAT efforts, including training UAT testers where necessary</li><li>Work with IT and other teams as the business representative during system implementations</li><li>Negotiates or mediates sound agreements in business or organizational situations where there is a disagreement or difference in interest. Successfully closes negotiations achieving best possible outcomes. Creatively approaches negotiations. Listens well and does not allow negativity to affect composure.</li></ul><p></p><p><b><u>Specific responsibilities will be: </u></b></p><ul><li>Critical thinker with the ability to manage multiple priorities. </li><li>Communicates information in a form well matched to and well received by the audience both internal and to customers</li><li>Manage client interactions and prioritize tasks for multiple concurrent projects</li><li>Looks beyond obvious solutions, and attempts to identify underlying or hidden problems or trends. </li><li>Evaluates the risks, benefits, and opportunities of various solutions. </li><li>Understands customers business needs and can interpret business analysis requirements. </li><li>Recognizes quickly when progress towards results is slowing or stalling and takes immediate action to get back on track. </li><li>Demonstrates commitment to ongoing improvement, achieves success by collaborating on cross-functional changes that impact others, and a commitment to data based decisions.</li><li>Demonstrates initiative and the ability to find information or solutions needed for assignments and/or projects. </li><li>Attempts through analysis to generate new, innovative ideas that optimize service delivery</li><li>Manages customer expectations throughout implementation process</li></ul><p></p><p><b><u>Desired Qualifications</u></b></p><ul><li>2+ years of experience in field</li><li>Experience with SQL coding and data analysis required</li><li>Excellent written and verbal communication</li><li>Strong customer service and interpersonal skills</li><li>Detail oriented</li><li>Ability to manage time and multiple tasks/projects efficiently</li><li>Basic problem solving and conflict resolution</li><li>Positive attitude centered on achieving high client satisfaction, both internal and external</li><li>Experience with Blackbaud’s RE7/RENXT product is nice to have</li></ul><p></p><p><b>Why you’ll want to come work here: </b></p><ul><li>Competitive salary (commission/bonus based on type of role), 4 weeks paid time off, great benefits (medical, dental, vision, FSA), 401K match</li><li>Gift matching, volunteer for vacation program, and endless community involvement opportunities</li><li>Named to Forbes’ Fast Tech 25 and Fortune’s Change the World List; we are growing and offer incredible opportunity for advancement</li><li>Tremendous company culture and office perks as well as a new cutting-edge new headquarters completed in 2018</li></ul><p></p><p></p><p>Stay up to date on everything Blackbaud, follow us on Linkedin, Twitter and Facebook. </p><p></p><p></p><p>Blackbaud is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, physical or mental disability, age, or veteran status or any other basis protected by federal, state, or local law.</p><p></p><p></p><p>To all recruitment agencies: We do not accept unsolicited agency resumes and are not responsible for any fees related to unsolicited resumes.</p><p></p><p></p>"}