{"job title": "Data Scientist", "company": "BlackLocus", "city state": "– Austin, TX, US", "rating": "5.0", "job description": "<div>\n<strong>About BlackLocus</strong> </div><div>\nBlackLocus is building cloud-based analytic tools to optimize and automate retail merchandising decisions such as pricing, assortment, space and fulfillment. By applying machine learning and revenue management techniques, the BlackLocus platform enables intelligent retail software to identify opportunities for competitive advantage. The company was a venture-funded startup, founded by Carnegie Mellon alumni and entrepreneurs with a passion for creative deployment of new technology. Acquired by The Home Depot in December of 2012, we operate with autonomy as a product lab from an office located in downtown Austin, TX.</div> <br>\n<div>\n<strong>Job Summary</strong></div><div>\nA BlackLocus Data Scientist solves difficult business problems with advanced statistical analytics and optimization. They are responsible for full life cycle of analytics and take the solution from concept to final prototype. Working with resources in engineering, product and services along with other members of the data science team, they deliver a solution in the shortest amount of time. Data Scientists are expected to contribute to projects as hands on expert level resource, capable of synthesizing the business requirements, nuances of the data available and analytic techniques to help create best in class solution.</div> <div>\n<strong>Requirements</strong></div>\n\n<ul>\n\n<li>\nMasters degree in the domain of data science</li> \n<li>\n2+ years experience in statistical modeling professional or course work</li> \n</ul>\n\n<div>\n<strong>Responsibilities</strong></div>\n\n<ul>\n\n<li>\nWork with merchants and other business experts to define an distill requirements for analytic solutions</li>\n<li>\nDesign analytic solutions leveraging advanced statistical modeling and optimization that are best suited to solve the business problems</li>\n<li>\nProvide thought leadership and establish a technical strategy and roadmap for advanced analytics</li>\n<li>\nCommunicate timely and effectively both verbal and written to the peers, team, managers, and others at Home Depot</li>\n<li>\nStay current with advancements in optimization, statistical modeling, programming techniques and advocates them where appropriate</li> \n</ul>\n\n<br>\n<div>\n<strong>Benefits</strong> </div>\n\n<ul>\n\n<li>\nExcellent work-life balance</li> \n<li>\nComprehensive benefit package</li> \n<li>\nCompetitive base and bonus package</li> \n<li>\nGenerous PTO policy</li> \n<li>\n401(k) eligible for matching company contribution after one year</li> \n<li>\nRestricted stock grants and Employee Stock Purchase Program</li> \n<li>\nStocked kitchen with healthy snacks, tons of drinks, and an espresso maker</li> \n<li>\nLots of team events including weekly catered lunches, happy hours, and other fun outings</li> \n<li>\nLocated in the heart of downtown Austin with garage parking provided</li> \n<li>\nThe Home Depot is an Equal Opportunity Employer</li> \n</ul>\n\n<div>\nLEGAL DISCLAIMER: BlackLocus and The Home Depot are Equal Opportunity/M/F/Vet/Disabled Employers. Available positions may vary by location. Bilingual candidates are encouraged to apply. ©2005-2018 Home Depot Product Authority, LLC. All rights reserved. Know your rights. Click here to view Federal labor law posters.</div>"}