{"job title": "Analytics Consultant II", "company": "Blast Analytics &amp; Marketing", "city state": "– Rocklin, CA", "rating": "4.3", "job description": "<strong>Requisition #:</strong> BAM0083A\n<br>\n<strong>Posted/Updated:</strong> 03/11/18<br><br><strong>Ready to Make your Mark?</strong><br><br>We are actively seeking an Analytics Consultant II who can generate customized digital analytics collection code (javascript, TMS setup, HTML markup, etc.) and assist with its implementation and deployment with an understanding of our clients businesses, industries, and environments. Specifically, the Analytics Consultant II will be responsible for developing structured/modular javascript code and processes.\n<br><br>\nFunctioning as a key member of our Analytics consulting team, the Analytics Consultant II integrates analytics code customizations into client sites. Performs auditing, documentation for analytics implementations and help companies explore their data. This client-facing role will help organizations capture data and turn insights into actionable recommendations to achieve their analytics goals.\n<br><br>\nThis is a full-time opportunity that will work in our Rocklin, CA location or optionally, remotely.<br><br>Who We Are<br><br>Blast Analytics &amp; Marketing is a leading analytics and digital marketing consulting company supporting leaders to EVOLVE their organizations. Through our deep expertise and proven process honed over 19 years working with clients worldwide, we help enterprises transform their data into actionable insights and better decision making to do more of what works and less of what doesnt. Our company is driven by smart, talented people who have a strong desire to learn and apply their knowledge, constantly evolving and pushing ourselves each day.<br><br>Why Work at Blast<br><br>At Blast, we believe in meaningful work. Regardless of role, you'll have the opportunity to Make Your Mark every day, solving challenges and seeing the positive impact of your contributions, as we support leaders to EVOLVE their organizations. Join us to Make Your Mark on each other, our clients, our company, our industry, and the community. Ask any employee why they come to work at Blast, and they'll say \"to make my mark!\"<br><br>To Be Successful\n\n\n<ul>\n<li>Demonstrate your knowledge of javascript and debugging</li>\n<li>Make Your Mark by executing highly-customized analytics implementations and developing innovative technical solutions</li>\n<li>EVOLVE your intellectual curiosity and help drive success</li>\n</ul>\n\nDesired Knowledge, Skills, &amp; Qualifications\n\n\n<ul>\n<li>Proven knowledge of javascript and Analytics tools</li>\n<li>Must know the fundamentals of traditional marketing and a passion for continued learning</li>\n<li>Bachelors degree preferred, or any equivalent combination of education and experience</li>\n</ul>\n\nPrimary Responsibilities\n\n\n<ul>\n<li>Develop structured/modular javascript code and processes</li>\n<li>Configure user profiles, goal funnels, and set up custom dashboards for Google Analytics accounts</li>\n<li>Integrate GA code customizations into client sites</li>\n<li>Audit GA accounts, document findings, and identify areas on the front end which would be beneficial to track</li>\n<li>Perform discovery and create documentation outlining processes for client reference</li>\n<li>Aid in tracking setup for the A/B testing of web pages</li>\n<li>Create performance reports and troubleshoot issues with data tracking setup</li>\n<li>Meet with clients to explain how accounts were configured and the capabilities of the advanced configuration we performed</li>\n</ul>\n\nJavaScript Test<br><br>Using http://www.blastam.com/analytics-consulting as your source page, write javascript that would accomplish the following:\n\n<ul>\n<li>Change the Blast Logo to redirect to the www.blastam.com/core-values instead of www.blastam.com</li>\n<li>Rearrange the order of the six analytic tiles within the body of the page to show the \"Testing &amp; Personalization\" as the first tile</li>\n<li>Using the same six tiles, dynamically generate a javascript object which will list each of the tiles displayed along with set of properties, including position, title and link url</li>\n<li>Using the Google Tag Manager (GTM) dataLayer that is already present on the page, push an event with these values:\n<br><br>\nevent : jsTest\n<br>\nevent_category : Application\n<br>\nevent_action : &gt;\n<br>\nevent_label : &gt;</li>\n<li>When a user presses the mouse down on the Tealium Partner icon, trigger an alert with your favorite ice cream flavor</li>\n</ul>\n<strong>Rules of the Test</strong>\n\n<ul>\n<li>You may use jQuery</li>\n<li>Your solution must be entirely done via JavaScript. This means that you cannot alter the existing html code. We are taking your snippet of JavaScript code that you write and applying it to the live page via the javascript console. We recommend you test your script the same way</li>\n<li>You are not disqualified from being considered if you are unable to deliver a complete solution; your technique in how you approach the problem is most important</li>\n</ul>\n<strong>Technical Questions</strong>\n\n<ul>\n<li>Identify two tracking opportunities on this page and explain their value. Example: Tracking the \"Request a Proposal\" link on the CTA (call-to-action) can help with lead generation conversion analysis by Page.</li>\n<li>In the tag management tool(s) you have expertise in, explain how you would fire a Facebook event conversion hit based on the click of the \"Request a Proposal\" link. Explain the requirements to deploying this tag.</li>\n<li>Provide an example documentation on how to track the \"Learn More\" links to trigger a GA event via GTM and include category to be a static value \"Learn More\", action to be a dynamic value based on the title of the tile and label to be a dynamic value based on the link url.</li>\n<li>For single page apps (SPA), explain the best method to capture screen views as pageviews?</li>\n</ul>\n<strong>Please attach your response for the JavaScript Test and Technical Questions as an additional page in your resume.</strong><br><br>You Will Work With<br><br>Director, Analytics Strategy; Analytics Strategists; Director, Optimization; Digital Marketing, reporting team members and other Subject Matter Experts (SMEs).<br><br>Are You a Fit?<br><br>Blast Analytics &amp; Marketing is a small yet rapidly growing company that is continuously inspired to learn and tackle challenges in digital analytics and marketing. To get an idea of whether or not you would be a fit within our culture, please review our core values.<br><br>Compensation &amp; Benefits<br><br>In addition to a competitive salary based on experience, Blast offers extensive benefits for full-time employees which include medical, dental, and vision insurance along with unlimited paid time off, a 401(k) plan, and much more. We provide a supportive, challenging, and fun work environment to ensure teamwork, productivity, and teammate happiness.<br><br>How to Apply<br><br>If you like what youve read thus far, please complete the application form and submit your cover letter and resume in PDF format. We read cover letters and weigh them heavily in our decision to consider an applicant. We are not interested in placement agencies or companies at this time.\n<br><br>\nBlast Analytics &amp; Marketing is an at will employer. Compensation, benefits, and job descriptions are subject to change based on individual performance and business conditions."}