{"job title": "Machine Learning Engineer - Equities", "company": "Bloomberg", "city state": "– New York City, New York", "rating": "3.7", "job description": "Machine Learning Engineer - Equities\n<br><br>\nNew York, NY\n<br><br>\nPosted Sep 26, 2018 - Requisition No. 70948\n<br><br>\nFor over 30 years, our clients have relied on our core product, the Bloomberg Terminal, to access the data and analytics they need to make informed investment decisions. We absorb billions of data points from hundreds of financial markets every single day. Our teams build applications that fuel the markets by providing intelligent analytics and transparency to level the playing field. We share a real passion for solving today's problems by innovating for tomorrow.\n<br><br>\nWe're building a new team, starting small, with researchers and engineers, whose goal is to leverage modern data science to enhance and extend the Bloomberg Equities suite of functionality. We will be working closely with product designers to understand how we could improve or optimize their products, including feature engineering, improved relevancy metrics, sentiment extraction, and more. We also intend to actively pursue research in the domain, publish papers, attend conferences, and represent Bloomberg in the industry.\n<br><br>\nWe leverage modern open source tools and will also work closely with an existing, dedicated team of infrastructure developers for big-data and distributed analytics. Our ultimate goals are new, novel applications of data science in the equity domain and making such analysis easy and quick for our clients.\n<br><br>\n<strong>We'll trust you to:</strong>\n<br><br>\nCollaborate closely with product designers on best uses of quantitative DS methods in new &amp; existing products\n<br>\nWork with a team of Data Scientists &amp; developers to design, experiment, and evaluate models\n<br>\nActively pursue research in the area of equities and data science\n<br>\nPublish such findings, present at conferences, and represent Bloomberg in the industry\n<br>\nWrite, test, and maintain production-quality code implementing these methods\n<br><br>\n<strong>You'll need to have:</strong>\n<br><br>\nBA, BS, MS, PhD in Computer Science, Engineering or related technology field\n<br>\nA strong quantitative background (Probability Theory, Statistics, Linear Algebra, etc.)- Experience in model evaluation, feature engineering, and time series analytics\n<br>\nA track record of relevant research- 3+ years experience applying these skills\n<br>\n3+ years of experience programming in C++, Python, or Java\n<br><br>\n<strong>We'd love to see:</strong>\n<br><br>\nExperience in Deep Learning methods and their applications\n<br>\nExperience with distributed computational frameworks (Kubernetes, Spark, Hadoop, etc)- Financial experience/knowledge a plus, but not required- Leadership experience building out teams in comparable areas\n<br>\nIf this sounds like you, apply! We are hiring for our headquarters in NYC."}