{"job title": "Clinical Lab Scientist", "company": "Blood Systems", "city state": "– Pittsburgh, PA, United States", "rating": "2.5", "job description": "<strong>PRIMARY PURPOSE</strong><strong>:</strong>\n<br><br>\nUnder direct supervision, this position is responsible for Laboratory functions that may include component production, labeling, maintenance of records, and data entry.\n<br><br>\n<strong>DUTIES AND RESPONSIBILITIES</strong><strong>:</strong>\n<br><br>\nPerforms all assigned duties in compliance with internal SOPs and external regulations. Is responsible for bringing compliance issues to the attention of management.\n<br><br>\nAssures quality customer service to all customers.\n<br><br>\nPrepares all blood components including centrifugation, separation, freezing, thawing, washing, storage, sterile docking, transformation, and filtration. Assures product quality, volume, assay requirements, appearance and time requirements.\n<br><br>\nMaintains accurate records and computer entry for component production.\n<br><br>\nPerforms receipt of freshly drawn units and samples, and unpacks, evaluates, and routes samples for accessioning.\n<br><br>\nPerforms labeling of routine and special components and quarantine of unacceptable components.\n<br><br>\nMaintains equipment and work areas as assigned.\n<br><br>\nPerforms all other related duties as assigned.\n<br><br>\n<strong>REQUIREMENTS</strong><strong>:</strong>\n<br><br>\n<strong>Knowledge/ Education</strong>\n<br><br>\nHigh School graduate or GED required.\n<br><br>\n<strong>Skills/Abilities</strong>\n<br><br>\nMust be able to stand for long periods of time, bend, and lift up to 50 lbs.\n<br><br>\nMust be detail oriented and possess strong communication, organization, and analytical skills.\n<br><br>\nMust be able to maintain donor, patient and employee confidentiality.\n<br><br>\nMust possess basic keyboarding skills and the ability to handle and operate laboratory equipment.\n<br><br>\nMust be able to work flexible shifts and overtime when necessary.\n<br><br>\n<strong>Experience</strong>\n<br><br>\nNo experience required.\n<br><br>\n<strong>***********************************************************************************************</strong>\n<br><br>\n<strong>EEO/Minorities/Females/Disabled/Veterans</strong>\n<br><br>\nOur organization is an equal employment/affirmative action employer. If you need accommodation for any part of the employment process because of a medical condition or disability, please send an e-mail toaccommodation@bloodsystems.org or call 1-844-220-2612 to let us know the nature of your request. A representative will respond to accommodation requests within two business days. Please note that this email/phone number is for medical/disability accommodations only and any other inquiries will not receive a response.\n<br><br>\nFor more EEO information about applicant rightsclick here\n<br><br>\nFor information about Pay Transparency rightsclick here\n<br><br>\nOur organization participates in E-Verify, for more informationclick here\n<br><br>\nAll candidates who receive a conditional written offer of employment will be required to undergo a pre-employment drug test in accordance with the Company's established guidelines.<br><br>.<br><br>."}