{"job title": "Data Scientist", "company": "Bloomberg", "city state": "– New York, NY", "rating": "3.7", "job description": "<strong>Job Requisition Number:</strong>68981<br><br>The Bloomberg Global Data Data Science Group seeks an experienced Data Scientist to solve complex business problems and create opportunities that enhance and extend our firm.\n<br>\nIn this role you will design, implement, and manage predictive analytics that leverage both financial and non-financial datasets using a wide range of analytical tools, methods, and platforms. You will join a small team where your interests and enthusiasm will significantly impact our business direction.\n<br><br>\nThe ideal candidate will be ready to identify areas of interest to a business, recognize which models and concepts apply to them, and acquire data resources to create and implement those models. An open approach and desire to cultivate the use of predictive modeling within the firm is essential.\n<br>\nJoin our Data Science Group and change the way the most influential people in business look at data.\n<br>\nThis position will be based out of New York, NY or Princeton, NJ.<br><br>Well trust you to:\n\n<ul>\n<li>Surface value early and communicate preliminary results in order to increase buy-in for more speculative work.</li>\n<li>Lead and mentor a community of data scientists, data analysts, and employees seeking to learn how to use technology in their products.</li>\n<li>Dive into product areas to learn what problems they have, formulate business questions, and then design models to answer targeted business questions.</li>\n<li>Work with proprietary, industry standard, and open source tools to research, develop and implement data science solutions.</li>\n</ul>\n\n<strong>We expect you to:\n<br><br>\n</strong>\n\n<ul>\n<li>Acquire subject-matter expertise as needed in order to deliver data science projects. For example, you might shadow experts in fixed income pricing in order to learn what patterns they consider anomalous, or you might observe analysts manually classify news stories about shareholder activism campaigns in order to develop priors about what features to include in a statistical classifier.</li>\n<li>Communicate effectively with non-technical stakeholders at all stages of a project, from sourcing ideas and determining requirements to explaining methodological decisions and modeling results.</li>\n<li>Have a track record of drawing insights from data and translating those insights into tangible business outcomes. Work experience, academic research, or a personal portfolio are great ways to demonstrate this.</li>\n<li>Have experience with software engineering best practices. We value code quality, reliable systems, and reproducible research.</li>\n<li>Have strong programming experience. We develop primarily in Python, and well expect you to do so as well, but we occasionally use languages like Scala, Go, C++, R, and JavaScript for specific projects. You should have experience with data munging and pipelining, querying databases, developing statistical models, and reporting and visualization.</li>\n</ul>\n\nWed love to see any of the following:\n\n<ul>\n<li>Experience working in a large organization. We deal with messy data from disparate sources and legacy systems with limited documentation.</li>\n<li>Experience with financial data, or with alternative data that could inform investment theses (such as government data, web data, or geospatial data).</li>\n<li>Formal training in statistical methods, machine learning, or software engineering.</li>\n</ul>"}