{"job title": "Python Data Scientist", "company": "Bloomberg", "city state": "– New York City, New York", "rating": "3.7", "job description": "Python Data Scientist\n<br><br>\nNew York\n<br><br>\nPosted Mar 9, 2018 - Requisition No. 65861\n<br><br>\n<strong>Our Team:</strong>\n<br><br>\nWe Protect Bloomberg.\n<br><br>\nAs part of the Chief Information Security Office - our Security Analytics team is dedicated to identifying, researching, and solving complex information security problems using a data-centric approach.\n<br><br>\nWorking closely with the security, development, and product teams - we are building a platform to collect, process, and analyze data generated throughout the company to find new approaches to take on hard security challenges.\n<br><br>\nWhat's The Role?\n<br><br>\nAs a Python Data Scientist, you'll help research and apply machine learning and statistical methods to solve information security problems. You will also contribute to the development of our data science platform.\n<br><br>\n<strong>We'll Trust You To:</strong>\n<br><br>\nIdentify and think about hard to solve information security problems\n<br>\nCollect and curate data needed to understand and solve the problems\n<br>\nExplore, research, describe, and analyze data\n<br>\nCommunicate the insights and results of our analysis\n<br>\nContribute to the development of our data science platform\n<br><br>\n<strong>You'll Need To Have:</strong>\n<br><br>\nStrong conceptual knowledge and background in probability, statistics, and machine learning\n<br>\nProficiency in Python, with an understanding of what it takes to write high quality code\n<br>\nFamiliarity with object oriented programming\n<br>\nInitiative and ability to thrive in a dynamic, fast-paced, and collaborative environment with minimum supervision\n<br>\nAn interest in Information Security and Computer Science\n<br><br>\n<strong>We'd Love To See:</strong>\n<br><br>\nAdvanced degree in a quantitative field, i.e. Mathematics or Statistics\n<br>\nAbility to communicate research results and explaining complex concepts to non-experts\n<br>\nDeep understanding of computer and networking fundamentals\n<br>\nInterest in learning more about our technology stack:\n<br>\nVisualization: D3.js, Sigma.js\n<br>\nPython 3 (numpy, scipy, pandas), R (dplyr, datatable), Jupyter\n<br>\nJavascript, React\n<br>\nApache, Postgres\n<br>\nLinux\n<br><br>\n<strong>If This Sounds Like You:</strong>\n<br><br>\nif you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at this:\n\n\n<ul>\n<li>*********************************</li>\n</ul>\n\nBloomberg is an equal opportunities employer and we value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}