{"job title": "Data Scientist", "company": "Blucora", "city state": "– TX - Irving", "rating": "3.4", "job description": "<div><div>Picture yourself adding your creativity toward game-changing innovation. Our businesses operate at the intersection of tax preparation and financial planning, and our competitive advantage lies in their unique combination. With award-winning products and services through our TaxAct and HD Vest brands, Blucora is on the forefront of financial tech, turning taxes into opportunity for our consumers, small business customers and tax professionals. We have a culture of creating market disruption; a place where big ideas, and those who think them, can flourish. If you’re interested in being part of a team that dreams large, talks straight, and helps millions of customers every year build their financial future, then we should talk!\n<br><br>\nThe Data Scientist works with the Analytics Team and serves various departments, including marketing, product development, partner management, and finance. We provide data, analysis, predictive modeling, and recommendations for key business initiatives. Major projects include optimizing SEM campaigns, interpreting A/B tests of our various products, and designing spam detection algorithms.\n<br><br>\nThe ideal candidate will be someone who can work with a variety of data sources to access and pull data, analyze and report on key findings &amp; questions, and recommend and drive new avenues for research and testing. We are looking for someone with the creativity and business sense to help us find real opportunities and ask ever more demanding questions of our data.\n<br><br>\nMajor responsibilities of the position are listed below. To perform the job successfully, the individual must be able to execute each essential duty satisfactorily. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n<ul>\n<li>Collaborate with product development, engineering and marketing to identify opportunities where predictive modeling can add value.</li> \n\n<li>Develop working prototypes of said models, prove they add meaningful value, and ensure they are implemented properly in a production environment.</li>\n\n<li>Assembling and cleansing of data for modeling purposes.</li>\n\n<li>Write and interpret complex SQL queries.</li>\n\n<li>Analysis of incidents, data corruption, and ad hoc questions.</li>\n\n<li>Design and communicate process improvement to our suppliers of data, including our internal Data Warehouse team.</li>\n\n<li>Summarize and report key analytical findings and recommendations in both oral and written form to various technical and non-technical teams</li>\n</ul>\nEducation and Experience:\n\n<ul>\n<li>A passion for innovating with data science at scale – applying modern algorithms to massive datasets and creating business value.</li>\n\n<li>Masters or Ph.D. in a quantitative discipline (e.g. statistics, physics, engineering)</li>\n\n<li>Minimum of 4 years hands-on experience in analysis and modeling of large complex datasets</li>\n\n<li>Fluency in SQL and experience with Big Data</li>\n\n<li>Experience with a MPP database (i.e. Netezza, Hadoop, etc…)</li>\n\n<li>Knowledge of data warehouse architectures and data models</li>\n\n<li>Strong Excel and data visualization skills</li>\n\n<li>Ability not just to retrieve and present data, but to draw conclusions and make recommendations</li>\n\n<li>Hands-on experience with optimization, data mining or machine learning</li>\n\n<li>Experience programming in a least one compiled programming language</li>\n\n<li>Experience working for a technology or internet company</li>\n\n<li>Web Analytics or SEM experience.</li>\n</ul>\nWe offer a competitive salary, outstanding benefits package that includes medical, dental, vision. Life insurance, paid vacation and sick days, paid holidays, tuition reimbursement, and 401(k) with company match.\n<br><br>\nQualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, or disability.</div>\n</div><div></div>"}