{"job title": "Senior Data Scientist", "company": "bluebird bio", "city state": "– Cambridge, MA", "rating": "4.3", "job description": "bluebird bio is a company that puts patients and its people first.\n<br><br>\nWe are a clinical-stage company committed to developing potentially transformative gene therapies for severe genetic diseases and T cell-based immunotherapies. The company aims to develop and bring to market the most advanced products based on the transformative potential of cell and gene therapy to provide patients hope for a better life in the face of limited or no long-term safe and effective treatment options.\n<br><br>\nWe have been consistently voted one of Boston Business Journal's \"Best Places to Work\". You can expect to join a team of motivated, inquisitive scientists that recognize the value of working hard, but also do not take themselves too seriously.\n<br><br>\nThe Senior Scientist, Translational Bioinformatics will be an integral part of bluebird's data sciences team. The team works across research, clinical, and pharmaceutical sciences to advance our gene therapies by leveraging expertise in bioinformatics, statistics, machine learning, disease biology, molecular biology, and human genetics. In this highly collaborative role, the person will work cross-functionally to plan and analyze biomarker data (e.g. NGS) generated from clinical trials to better understand and optimize our therapies.\n<br><br>\nThis position offers a unique opportunity to leverage bioinformatics, statistics, and data sciences to make an immediate impact on the efficacy and safety of our cell and gene therapies with the ultimate goal of improving patient lives.\n<br><br>\n<strong>About the Role:</strong>\n\n<ul>\n<li>Plan and perform exploratory biomarker studies by analyzing high-dimensional data measured from drug products and clinical samples.</li>\n<li>Apply integrative analysis methods to understand patient response holistically and derive actionable insights from the data.</li>\n<li>Visualize the data to explain the findings to a cross-functional team or external stakeholders.</li>\n<li>Learn about the needs of the translational teams and proactively suggest new ways data sciences can impact research and clinical projects.</li>\n<li>Be a key member of project teams across the organization.</li>\n<li>Mentor junior members of the data sciences team.</li>\n</ul>\n<strong>About You:</strong>\n\n<ul>\n<li>Have a passion for performing science that will directly improve the lives of cancer patients or patients with severe genetic diseases.</li>\n<li>PhD in data sciences, bioinformatics, statistics, or other computational/quantitative discipline with 3+ years of post-doctoral experience.</li>\n<li>Knowledge of Python and R. Experience in Linux environment and version control tools. Understanding of most common NGS workflows (DNA, RNA, amplicon-seq) and data formats generated in these workflows.</li>\n<li>Knowledge of core concepts in data analysis and applied statistics model testing, regression, classification and clustering methods.</li>\n<li>Demonstrated ability to derive biological insights from high-dimensional data and experience working on translational project teams.</li>\n<li>Prior experience in the immunotherapy or gene therapy or severe genetic diseases is preferred.</li>\n<li>Keen to mentor and develop leadership skills of junior team members.</li>\n<li>Must display a keen ability to help shape an organization, interface with stakeholders, and help manage the dynamics of change within a rapidly growing company.</li>\n<li>Must have strong interpersonal skills with the ability to motivate others, influence, and negotiate conflict situations.</li>\n<li>Outstanding communication, analytical, and organizational skills</li>\n<li>Highly collaborative team player who fosters open communication and facilitates mutual understanding and cooperation between all stakeholders</li>\n<li>Ability to navigate and be successful in a fast-paced, highly-matrixed work environment</li>\n<li>Willingness to embrace and demonstrate the principles of the bluebird bio culture: <em>b colorful, b cooperative, and b yourself.</em></li>\n</ul>"}