{"job title": "Associate Scientist, Immunotherapy, Antibody Discovery", "company": "bluebird bio", "city state": "– Cambridge, MA", "rating": "4.3", "job description": "Join bluebird bio's enthusiastic and collaborative Cellular Immunotherapy team by contributing to the overall success of our novel gene therapy-based immunotherapy approach. This new Associate Scientist will join our group focused on the design, development, and evaluation novel cellular immunotherapy approaches for clinical applications. This role will be responsible for screening large panels of antibodies derived from immunizations and hybridoma generation in a high throughput manner. S/he will be accountable for assay development, experimental design and execution, data analysis and presentation of data in a collaborative environment.\n<br><br>\n<strong>About the job:</strong>\n\n<ul>\n<li>Perform flow-based antibody screening</li>\n<li>Perform assays to support antibody characterization both in vitro and in CAR-engineered T cells</li>\n<li>Maintain a lab notebook and contribute to support documentation when necessary</li>\n<li>Contribute to experimental design and project direction</li>\n<li>Compile and present research data to functional teams</li>\n<li>Provide critical lab support while working in a collaborative team environment</li>\n</ul>\n<strong>About you:</strong>\n\n<ul>\n<li>BS/MS in cell biology, immunology or related discipline with 2+ years of experience</li>\n<li>Excellent organizational skills, proven ability to effectively plan and organize work activities to meet schedules and deadlines</li>\n<li>Expertise in mammalian cell culture and standard immunological assays</li>\n<li>Competency in basic molecular biology techniques</li>\n<li>Experience with antibody characterization assays a plus</li>\n<li>Familiarity with antibody discovery through rodent immunizations, hybridoma generation, and B cell cloning methods a plus</li>\n<li>Experience with sequencing and sequencing analysis in the context of hybridomas a plus</li>\n<li>Experience working with automation HTP liquid handlers a plus</li>\n<li>Effectively work independently and as part of a collaborative team comprised of multiple functional groups</li>\n<li>Proven ability to effectively plan and organize work activities to meet schedules and deadlines</li>\n<li>Capable of critical thinking and problem solving</li>\n<li>Excellent oral and written communication skills</li>\n<li>Excellent computer skills and experience with Microsoft Office and PowerPoint. FlowJo, Graphpad Prism and Geneious a plus.</li>\n<li>Understanding of safe lab practices and BSL requirements</li>\n<li>Bring curiosity and technical excellence to science that directly impacts patients</li>\n<li>\"Do-what it takes\" attitude</li>\n<li>Independently motivated, detail orientated, and good problem solving ability</li>\n<li>Be ready to embrace the principles of the bluebird bio culture: <em>b colorful, b cooperative, and b yourself</em></li>\n</ul>"}