{"job title": "Data Scientist", "company": "BlueVine", "city state": "– Redwood City, CA", "rating": "4.2", "job description": "<div><div>At BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.</div><br>\n<div>BlueVine is searching for a Junior Data Scientist, who will be responsible for the critical decision-making processes driving our automation: risk analysis, credibility scoring, fraud detection and financial strength prediction. You work will include the application of machine learning techniques to modeling, data mining and statistical analyses that push limits of performance and efficiency. You will also be responsible for writing, deploying, and maintaining production grade Python code.</div> </div><div><div>WHAT YOU'LL DO:\n\n<ul>\n\n\n<ul>\n<li>Work closely with data scientists on all stages of new model development: data exploration, feature generation and model training using the most advanced tools in the space</li><li>Support and optimize existing models by identifying new data sources and generating novel features</li><li>Collaborate with teams across the company: Business Operations, Marketing, Finance and Risk</li><li>Communicate key results to senior management in verbal, visual, and written media</li><li>Own the implementation of your models and insights and see them deliver real results</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>WHAT WE LOOK FOR:\n\n<ul>\n\n\n<ul>\n<li>Bachelors Degree in Computer Science, Statistics, Economics, Mathematics, Information Systems or equivalent technical degree</li><li>1-2 years of hands-on experience as a Data Scientist, Machine Learning engineer or a comparable analytical position</li><li>1-2 years of hands-on experience with Python and the supporting analysis libraries/ecosystem</li><li>An excellent understanding of both traditional statistical modeling and Machine Learning techniques and algorithms: regression, clustering, ensembling (random forest, gradient boosting), deep learning (neural networks), etc</li><li>Proficiency with Python and SQL</li><li>Familiarity with Git and Linux/OS command line</li><li>Self-starter - excited to learn unfamiliar concepts on the job</li><li>Delivery-oriented approachability to get things done within a strict time frame/ability to juggle multiple assignments</li><li>Deep interest in learning both the theoretical and practical aspects of working with and deriving insights from data</li><li>Great communication skills</li><div><strong>NICE TO HAVE</strong></div><li>Master’s Degree in Computer Science, Statistics, Economics, Mathematics, Information Systems or equivalent</li><li>Graduate of leading Data Science boot camp (Galvanize, Metis, etc)</li><li>Superior Python programming skillsSuperior SQL skills</li><li>Previous work experience with Amazon AWS ecosystem</li><li>Previous work experience with remote development &amp; distributed development architectures</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>BENEFITS &amp; PERKS:\n\n<ul>\n\n\n<ul>\n<li>Receive over $1,000 annually for a wellness benefit of your choice</li><li>Free commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees</li><li>Weekly catered lunches</li><li>Unlimited snacks in fully stocked kitchens</li><li>Generous PTO and holidays</li><li>Excellent health coverage and life insurance benefits</li><li>Generous, paid parental leave which covers up to 15 weeks</li><li>Pet-friendly offices</li> </ul>\n</ul>\n\n</div>\n</div><div><div>BlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.</div></div></div></div>"}