{"job title": "Health Data Analyst III", "company": "BMC HealthNet Plan", "city state": "– Boston, US-MA", "rating": "3.1", "job description": "The Health Data Analyst III is a key member of the Finance management team whose responsibility is to lead analyses to support Finance staff and the Chief Financial Officer in meeting corporate objectives.\n<br><br>\n<strong>Key Functions/Responsibilities:</strong>\n<br><br>\n<ul>\n<li>Leads the development and submission of key financial regulatory reports (i.e. 4B and 5C financial reports, membership reporting, etc.).</li>\n\n<li>Leads competitive analysis of regulatory financial and membership reports, including requesting the publicly available data from various state agencies, consolidating and analyzing the data, monitoring trends, researching unusual patterns, and presenting the results to senior leadership.</li>\n\n<li>Support marketing and sales departments in achieving corporate goals, and supports the Finance department in setting annual budget projections.</li>\n\n<li>Conducts budget to actual analysis.</li>\n\n<li>Leads analysis of medical expense reporting and monitoring/reporting of medical expense trend.</li>\n\n<li>Support other areas of Finance as needed, including, but not limited to, development of pricing and revenue requirements for all products, financial planning / budgeting, IBNR reserves, and high cost claimant tracking.</li>\n\n<li>Leads analysis of provider ratio reports, member disruption impacts, and provider termination impacts, including estimating future member and financial impacts of proposed changes.</li>\n\n<li>Develops and implements plans to measure and report on corporate-wide health care delivery cost and utilization / membership trends.</li>\n\n<li>Responsible for ad hoc analytics including modeling of membership and financial scenarios. Utilizes statistical applications as necessary.</li>\n\n<li>Serves as data expert for department. Advises Finance department on data warehouse design requests and works with IT to establish priorities.</li>\n\n<li>Responsible for supporting corporate initiatives/projects that require analysis of health plan data.</li>\n</ul>\n<strong>Supervision Exercised:</strong>\n\n<ul>\n<li>May supervise 1 – 3 staff members.</li>\n</ul>\n<br><br>\n<strong>Supervision Received:</strong>\n\n<ul>\n<li>General supervision is received weekly.</li>\n</ul>\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Education:</strong>\n\n<ul>\n<li>Bachelor’s Degree in Finance, Health Care Administration, or related field required</li>\n</ul>\n<br><br>\n<strong> Preferred/Desirable:</strong>\n<br><br>\n<ul>\n<li>Master’s Degree preferred.</li>\n</ul>\n<br><br>\n<strong>Experience:</strong>\n\n<ul>\n<li>4 years of progressively responsible experience in data modeling, informatics and analysis. Commensurate educational experience in related field will be considered.</li>\n</ul>\n<br><br>\n<strong>Preferred/Desirable:</strong>\n<br><br>\n<ul>\n<li>A background in managed healthcare, insurance operations preferred</li>\n</ul>\n<br><br>\n<strong>Certification or Conditions of Employment:</strong>\n<br><br>\n<ul>\n<li>Pre-employment background check</li>\n</ul>\n<strong>Competencies, Skills, and Attributes:</strong>\n<br><br>\n<ul>\n<li>The Analyst III is an experienced user of claims and membership data.</li>\n\n<li>Working knowledge of MS tools, including MS Office products, MS Access, MS Project, SQL and SAS or other statistical software. Should be proficient in Microsoft Excel.</li> \n\n<li>Analyst integrates external grouping methodologies such as DRG, ETG and DxCG in analytics.</li>\n\n<li>Ability to meet deadlines, multi-task, problem solve and use appropriate technology to analyze business problems. Project management skills a plus.</li>\n\n<li>Strong communications skills, both verbal and written, are required.</li>\n</ul>\n<br><br>\n<strong>Working Conditions and Physical Effort:</strong>\n\n<ul>\n<li>Regular and reliable attendance is an essential function of the position.</li>\n\n<li>Work is normally performed in a typical interior/office work environment.</li>\n\n<li>No or very limited physical effort required.</li>\n\n<li>No or very limited exposure to physical risk.</li>\n</ul>\n*Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nBoston, US-MA\n<br>"}