{"job title": "Data Scientist - Workforce&amp;FTE Analytics", "company": "BMO", "city state": "– Chicago, IL", "rating": "3.0", "job description": "The Data Scientist, Workforce&amp;FTE Analytics works with management and business partners to support the development and implementation of the retail branch staffing plans while employing advanced analytical solutions. We are looking for a strategic thinker with the ability to dissect business problems, conduct research, and utilize advanced statistical analysis to identify trends, variations, patterns, and insights relating to banker/ branch performance, staffing optimization and customer activities, and build end-to-end analytical solutions.\n<br><br>\nThis is an exciting opportunity that is on the forefront of a critical enterprise capability, providing thought leadership to U.S. Personal and Business Banking on the value of data and analytics. The incumbent will get to work with and support multiple lines of business around the enterprise to help them achieve their objectives\n<br><br>\nSupport Senior Management on U.S. Retail and Business Banking modeling and evaluation, as well as other analytical projects of varying sizes and complexities, including:\n\n\n<ul>\n<li>Identify the best analytical techniques that can be effectively applied to achieve business objectives and interpret next best action through data driven insights</li>\n<li>Building end-to-end automated analytic solutions that are intuitive, simple to maintain, and drive real business outcomes</li>\n<li>Work closely with other lines of business, such as; finance, sales effectiveness, human resources and field management in order to optimize sales in branches, forecast FTE needs and model branch staffing strategie</li>\n</ul>\n\nLead the workforce management and scheduling function including:\n\n\n<ul>\n<li>Analyzing current schedule information and industry best practices to recommend and implement proactive improvements</li>\n<li>Develop recommendations to optimize scheduling and minimize differences between forecast staff required and scheduled staff</li>\n<li>Lead the implementation of improvements to operational and forecasting scheduling processes to improve scheduling efficiencies and meet the business needs of the Branch network</li>\n<li>Ensure up to date on current best practices regarding resource planning and workforce strategies for implementation in the Branch network</li>\n<li>Coordinate and manage vendor tool contract, maintenance and enhancements</li>\n</ul>\n\nResponsible for the design, development, and implementation of innovative analytical solutions, including but not limited to:\n\n\n<ul>\n<li>Data gathering and cleansing, statistical transformation, feature engineering&amp;selection</li>\n<li>Apply analytical techniques such as linear/non-linear models, clustering, and optimization</li>\n<li>Visualize and build reports and visualizations to effectively communicate data driven insights to users for a variety of audiences</li>\n<li>Develop accurate financial models and make recommendations regarding financial impact of initiatives and projects</li>\n</ul>\n\nKnowledge\n\n\n<ul>\n<li>Possesses a university degree in mathematics, statistics, physics, engineering, or finance (Masters preferred)</li>\n<li>3 to 6 years of experience in advanced analytics, financial services and/or consulting is strongly preferred</li>\n<li>Advanced skills in Python, R, or SAS, including relevant packages and statistical testing methodologies</li>\n<li>Branch Scheduler tool knowledge (Verint) is desired</li>\n</ul>\n\n<strong>Skills</strong>\n\n\n<ul>\n<li>Demonstrates strong communication skills (both written and verbal) and relationship management skills at a senior management level</li>\n<li>Shows strong knowledge of mathematical and statistical models in a highly technical context, with proven record of building solutions to complex problems</li>\n<li>Exhibits advanced critical thinking skills, integrative skills and creativity to drive innovation</li>\n<li>Demonstrates ability to build a good fact base, apply sound reasoning, and generate relevant recommendations that get implemented and lead to business success</li>\n<li>Able to work highly independently and manage multiple priorities in an agile fast paced environment</li>\n<li>Possesses solid leadership skills and is able to work successfully with a team that has diverse skills, knowledge, and educational backgrounds</li>\n<li>Demonstrates strong attention to detail and a high level of due diligence</li>\n</ul>\n\nWe're here to help\n<br><br>\nAt BMO Harris Bank we have a shared purpose; we put the customer at the center of everything we do helping people is in our DNA. For 200 years we have thought about the futurethe future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we're changing the way people think about a bank.\n<br><br>\nAs a member of the BMO Harris Bank team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one for yourself and our customers. We'll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we'll help you gain valuable experience, and broaden your skillset.\n<br><br>\nTo find out more visit us at https://bmoharriscareers.com/\n<br><br>\nBMO Harris Bank is committed to aninclusive, equitable and accessible workplace. By learning from each other's differences, we gain strength through our people and our perspectives. BMO Harris Bank is an Equal Opportunity Employer for all, inclusive of Minorities, Women, Veterans, and Persons with Disabilities."}