{"job title": "Intern - Fellow (Data Scientist) Spring", "company": "BNSF", "city state": "– Fort Worth, TX", "rating": "3.4", "job description": "Apply early as this job may be removed or filled prior to the closing date, which is approximately seven (7) days after the posting date.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Job Location:</strong>&nbsp;Fort Worth\n<br>\n<strong>Anticipated Start Date:</strong>&nbsp;01/14/2019\n<br>\n<strong>Number of Positions:</strong>&nbsp;5\n<br>\n<strong>Salary Range:</strong>&nbsp;$45,760 - $54,080\n<br>\n<strong>Salary Band:</strong>&nbsp;19<br>\n<div>&nbsp;<strong>#LI-BNSF</strong></div>\n<br><strong>DUTIES/RESPONSIBILITIES:</strong>\n<br><br>\nA Data Scientist Intern-Fellow’s work in the BNSF Operations Research and Advanced Data Analytics Group may include, but is not limited to, the following:\n<ul>\n<li>Working with key stakeholders and subject-matter-experts to understand business problems and consider solution approaches</li><li>Enhancing data collection procedures to include information that is relevant for building analytic systems</li><li>Processing, cleansing, and verifying the integrity of data used for analysis and draw insights from large data sets</li><li>Presenting information using data visualization techniques</li><li>Sharing results with key stakeholders</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Time/Location&nbsp;</strong>\n<ul>\n<li>This position requires an onsite presence in our Fort Worth office.</li><li>40 hours per week, Monday through Friday, is preferred.</li>\n</ul>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong>BASIC QUALIFICATIONS:</strong>\n<ul>\n<li>Masters or Ph.D. students pursuing a major or minor in one of the following: Statistics, Operations Research, Applied Mathematics, Industrial Engineering, Computer Science, or Transportation. Ph.D. students are preferred.</li><li>An overall GPA of 3.0 is required. An overall GPA of 3.5 is preferred.</li><li>Strong analytical and problem solving skills</li><li>Strong interpersonal and communication skills</li><li>Proficiency in using statistical computer language R (experience in Shiny is a plus), SAS, and query languages such as SQL</li><li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</li><li>Experience using business intelligence tools (e.g. Tableau)</li><li>Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.</li>\n</ul>\n&nbsp;\n<br><br>\nBNSF Railway is an Equal Opportunity Employer Minorities/Women/Veterans/Disabled.\n<br><br>\n&nbsp;\n<br><br>\nTransportation Worker Identification Credential (TWIC): Federal authority requires BNSF employees, whose work requires unescorted access to secure areas of port facilities, to obtain a TWIC. A TWIC is a condition of employment for such positions and requires candidates to those positions to submit to a TSA security assessment (to include, but not limited to, providing: biographic information; identity documents; fingerprints; digital photograph). More information is available at&nbsp;www.tsa.gov/for-industry/twic."}