{"job title": "Scientist I/II/III, Drug Metabolism and Pharmacokinetics", "company": "Boehringer Ingelheim", "city state": "– US-CT-Ridgefield", "rating": "3.5", "job description": "<strong><u>Description:</u></strong>\n<br><br>\nBoehringer Ingelheim is seeking a\n<br>\nhighly motivated <strong>Scientist I/II/III</strong> to join the Drug Metabolism &amp;\n<br>\nPharmacokinetics (DMPK) department at our US headquarters in Ridgefield, CT.\n<br><br>\nAs a Scientist I/II/III, you will be\n<br>\nresponsible for conducting metabolite identification and structural elucidation\n<br>\nexperiments in support of our small molecule development candidates. You will\n<br>\nbe expected to evaluate and interpret experimental data and contribute toward\n<br>\nthe advancement of the field of drug metabolism. Studies involving the use of radioactive\n<br>\ntracers will be routinely employed. Active\n<br>\nand productive collaboration with other scientists in the fields of drug\n<br>\nmetabolism, transporters, and pharmacokinetics will also be expected.\n<br><br>\nAs an employee of\n<br>\nBoehringer Ingelheim, you will actively contribute to the discovery,\n<br>\ndevelopment and delivery of our products to our patients and customers. Our\n<br>\nglobal presence provides opportunity for all employees to collaborate\n<br>\ninternationally, offering visibility and opportunity to directly contribute to\n<br>\nthe companies' success. We realize that our strength and competitive advantage\n<br>\nlie with our people. We support our employees in a number of ways to foster a\n<br>\nhealthy working environment, meaningful work, diversity and inclusion,\n<br>\nmobility, networking and work-life balance. Our competitive compensation and\n<br>\nbenefit programs reflect Boehringer Ingelheim's high regard for our employees\n<br><br>\n<strong><u>Duties &amp;\n<br>\nResponsibilities:</u></strong>\n<ul>\n<li>Efficiently conduct, interpret, and report metabolite\n<br>\n identification data from in vitro, preclinical, and clinical studies utilizing\n<br>\n high resolution accurate mass spectrometry.</li><li>Participate in the development and\n<br>\nimplementation of new technologies in the field of metabolite identification\n<br>\nand biotransformation.</li><li>Comply with applicable regulations, perform\n<br>\nall work in a safe and responsible manner, and maintain proper records in\n<br>\naccordance with SOPs and corporate policies.</li><li>Effectively and\n<br>\nclearly communicate results in written reports and oral presentations.</li><li>Comply with\n<br>\napplicable regulations, perform all work in a safe and responsible manner, and\n<br>\nmaintain proper records in accordance with SOPs and corporate policies.</li><li>Initiate and\n<br>\ncomplete routine procedures in an independent and efficient manner, with\n<br>\nminimal supervision; independently operate LC/MS systems; troubleshoot\n<br>\neffectively.</li><li>Demonstrate\n<br>\ntechnical ability to assist in the design and execution of non-routine\n<br>\nexperiments.Initiates and completes routine procedures in an independent and efficient\n<br>\nmanner; Troubleshoots effectively and solves scientific problems independently;\n<br>\nOperates lab equipment and is independently responsible for maintenance</li><li>Designs\n<br>\nand executes non-routine experiments on a basis of literature analyses with\n<br>\nminimal supervision</li><li>Independently applies basic scientific principles, performs literature\n<br>\nsearches, attends scientific meetings, and keeps abreast of literature in own\n<br>\nfield</li>\n</ul>\n\n<div><strong><u>Scientist I Requirements</u></strong>:\n<ul>\n<li>Bachelor's of Science degree in in Chemistry “Organic and/or Analytical”, Biochemistry, Pharmacy, Biology, or other relevant field 0 years experience in related field</li><li>Laboratory experience should include familiarity with LC-MS, LC-MS/MS, HRMS, and NMR instrumentation preferred</li><li>Experience with mass spectrometry software (Analyst, MassLynx, and/or Xcalibur) would be advantageous.</li><li>Familiarity with general principles of small molecule biotransformation is considered beneficial.</li><li>Experience with the safe and appropriate use of radioactivity is preferred.</li> <li>Effective oral and written communication skills are essential.</li> </ul></div>\n<br>\n<strong><div><u>Scientist II Requirements:</u></div>\n<br>\n</strong>\n\n\n<ul>\n\n <li>Bachelor’s Degree in Chemistry “Organic and/or Analytical”, Biochemistry, Pharmacy, Biology, or other relevant field from an\n<br>\n accredited institution with three-plus (3 ) years of experience in related\n<br>\n scientific discipline or Master’s Degree Chemistry “Organic and/or Analytical”, Biochemistry, Pharmacy, Biology, or other relevant field from an accredited institution or equivalent experience in related field</li><li>Laboratory experience should include familiarity with LC-MS, LC-MS/MS, HRMS, and NMR instrumentation preferred</li><li>Experience with mass spectrometry software (Analyst, MassLynx, and/or Xcalibur) would be advantageous.</li><li>Familiarity with general principles of small molecule biotransformation is considered beneficial.</li><li>Experience with the safe and appropriate use of radioactivity is preferred.</li> <li>Effective oral and written communication skills are essential.</li> \n</ul>\n<strong><u>Scientist III Requirements:</u></strong>\n<ul>\n<li>Master’s Degree from\n<br>\nan accredited institution Chemistry “Organic and/or Analytical”, Biochemistry, Pharmacy, Biology, or other relevant field with three-plus (3 ) years of experience in related\n<br>\nscientific discipline, OR Bachelor’s Degree from an accredited institution Chemistry “Organic and/or Analytical”, Biochemistry, Pharmacy, Biology, or other relevant field with\n<br>\nseven-plus (7 ) years of experience in related scientific discipline or\n<br>\nequivalent experience in related field</li><li>Laboratory experience should include familiarity with LC-MS,\n<br>\n LC-MS/MS, HRMS, and NMR instrumentation preferred</li><li>Experience with mass spectrometry software (Analyst, MassLynx,\n<br>\n and/or Xcalibur) would be advantageous.</li><li>Familiarity with general principles\n<br>\nof small molecule biotransformation is considered beneficial.</li><li>Experience with the safe and appropriate use of radioactivity\n<br>\n is preferred.</li> <li>Effective oral and written communication skills are\n<br>\n essential.</li> \n</ul>\n<strong><u>Eligibility\n<br>\nRequirements:</u></strong>\n<ul>\n<li>Must be legally\n<br>\nauthorized to work in the United States without restriction.</li><li>Must be willing to\n<br>\ntake a drug test and post-offer physical (if required)</li><li>Must be 18 years of\n<br>\nage or older</li>\n</ul>\n<strong><u>Our Culture:</u></strong>\n<br><br>\n<strong></strong>\n<br><br>\nBoehringer Ingelheim is a different kind of pharmaceutical company, a\n<br>\nprivately held company with the ability to have an innovative and long term\n<br>\nview. Our focus is on scientific discoveries that improve patients' lives\n<br>\nand we equate success as a pharmaceutical company with the steady introduction\n<br>\nof truly innovative medicines. Boehringer Ingelheim is the largest\n<br>\nprivately held pharmaceutical corporation in the world and ranks among the\n<br>\nworld's 20 leading pharmaceutical corporations. At Boehringer Ingelheim,\n<br>\nwe are committed to delivering value through innovation. Employees are\n<br>\nchallenged to take initiative and achieve outstanding results. Ultimately, our\n<br>\nculture and drive allows us to maintain one of the highest levels of excellence\n<br>\nin our industry. Boehringer Ingelheim, including Boehringer\n<br>\nIngelheim Pharmaceuticals, Inc., Boehringer Ingelheim USA, Boehringer Ingelheim\n<br>\nAnimal Health USA, Inc., Merial Barceloneta, LLC and Boehringer Ingelheim\n<br>\nFremont, Inc. is an equal opportunity and affirmative action employer\n<br>\ncommitted to a culturally diverse workforce - Minority/Female/Protected\n<br>\nVeteran/Person with a Disability. All qualified applicants will receive\n<br>\nconsideration for employment without regard to race; color; creed; religion;\n<br>\nnational origin; age; ancestry; nationality; marital, domestic partnership or\n<br>\ncivil union status; sex, gender, gender identity or expression; affectional or\n<br>\nsexual orientation; disability; veteran or military status or liability for\n<br>\nmilitary status; domestic violence victim status; atypical cellular or blood\n<br>\ntrait; genetic information (including the refusal to submit to genetic testing)\n<br>\nor any other characteristic protected by law.\n<br><br>\nBoehringer Ingelheim is firmly committed to ensuring a safe, healthy,\n<br>\nproductive and efficient work environment for our employees, partners and\n<br>\ncustomers. As part of that commitment, Boehringer Ingelheim conducts\n<br>\npre-employment verifications and drug screenings."}