{"job title": "Scientist III, Cancer Immunology &amp; Immune Modulation (In vivo)", "company": "Boehringer Ingelheim", "city state": "– Ridgefield, CT", "rating": "3.5", "job description": "Description:\n<br><br>\n<strong><u>Description\\:</u></strong>\n<br><br>\n?\n<br><br>\nWe\n<br>\nare seeking a highly motivated Scientist III with strong interpersonal\n<br>\ncommunication skills to join the growing, innovative Cancer Immunology &amp; Immune\n<br>\nModulation (CI &amp; IM) Research Group at Boehringer Ingelheim?s US research\n<br>\nfacility in Ridgefield, CT. The successful candidate will work within the\n<br>\nCI&amp;IM in vivo pharmacology group to advance both exploratory and\n<br>\ndrug candidate discovery programs and provide target discovery/validation, in-vivo\n<br>\nefficacy, mechanism of action (MOA) and pharmacodynamic data essential to drive\n<br>\nprojects into clinical development. The ideal candidate will collaborate with\n<br>\nother members of in-vivo teams and with key responsibilities involving primarily\n<br>\ndesigning and conducting in vivo pharmacology models of inflammation and oncology,\n<br>\nas well as establishing early PK/PD for lead progression.\n<br><br>\n?\n<br><br>\nAs an employee of Boehringer Ingelheim, you will\n<br>\nactively contribute to the discovery, development and delivery of our products\n<br>\nto our patients and customers. Our global presence provides opportunity for all\n<br>\nemployees to collaborate internationally, offering visibility and opportunity\n<br>\nto directly contribute to the companies' success. We realize that our strength\n<br>\nand competitive advantage lie with our people. We support our employees in a\n<br>\nnumber of ways to foster a healthy working environment, meaningful work,\n<br>\ndiversity and inclusion, mobility, networking and work-life balance. Our\n<br>\ncompetitive compensation and benefit programs reflect Boehringer Ingelheim's\n<br>\nhigh regard for our employees.\n<br><br>\n?\n<br><br>\n<strong><u>Responsibilities\\:</u></strong>\n<br><br>\nmso-list\\:l1 level1 lfo1\"&gt;\n\n<ul>\n<li>Execute research\n<br>\nprojects according to the experimental design, ensure technically capable and\n<br>\nprovide accurate, reliable and reproducible data.</li>\n<li>Independently\n<br>\nperform in vivo studies, proficient in data collection/documentation, interpret\n<br>\ndata and with mentorship, present to project teams.</li>\n<li>Collaborate\n<br>\nextensively with other members of the Immune Modulation Group in Ridgefield,\n<br>\nwhile synergizing effectively with the in vivo pharmacology group in the Inflammation\n<br>\n&amp; Respiratory therapeutic area.</li>\n<li>Expand scientific/technical\n<br>\nknowledge and skill sets by regularly reading relevant scientific literature\n<br>\nand implement learnings in the study designs or project strategies.</li>\n<li>Ensure that the\n<br>\nhighest standard of animal welfare is maintained in all studies involving experimental\n<br>\nanimals.</li>\n<li>Understand and\n<br>\nimplement study protocol according to AAALAC and IACUC guidelines.</li>\n</ul>\n<strong><u>Qualifications\\:</u></strong>\n\n<ul>\n<li>Master?s\n<br>\nDegree from an accredited institution with three-plus (3+) years of\n<br>\nexperience in related scientific discipline, OR Bachelor?s Degree from an\n<br>\naccredited institution with seven-plus (7+) years of experience in related\n<br>\nscientific discipline or equivalent experience in related field</li>\n<li>Extensive hands-on experience\n<br>\non conducting rodent experiments including preparation of test compounds,\n<br>\nhandling and dosing mice by various routes (IP, SC, IV or PO), collection of\n<br>\nblood and tissues for PK and PD biomarker analysis.</li>\n<li>Familiar with human\n<br>\nor murine primary cell isolation, cytokine profiling by ELISA or MSD, T cell\n<br>\nand/or myeloid cell functional assays, Western blot, and qPCR. ?Experience in using multi-color flow cytometry\n<br>\n(FACS) to evaluate immune cell biomarkers and data analysis software is a plus.</li>\n<li>Past experience with syngeneic or xenograft tumor\n<br>\nmodels or PDX models is preferred. Familiarity with hydrodynamic tail vein\n<br>\ninjection is a plus but not required.</li>\n<li>Excellent oral and\n<br>\nwritten communication skills. Proficiency in all common Microsoft Office and\n<br>\nGraphpad Prism software.</li>\n<li>Strong ability to\n<br>\nmulti-task and willingness to work effectively in a fast-paced, highly collaborative,\n<br>\nand diverse research environment.</li>\n<li>The ability to both\n<br>\nwork independent and be a team player.</li>\n</ul>\n<strong><u>Eligibility Requirements\\:</u></strong>\n\n<ul>\n<li>Must be legally authorized to work in the United States without restriction.</li>\n<li>Must be willing to take a drug test and post-offer physical (if required)</li>\n<li>Must be 18 years of age or older</li>\n</ul>\n<strong><u>Who We Are\\:</u></strong>\n<br><br>\nAt\n<br>\nBoehringer Ingelheim we create value through innovation with one clear goal\\: to\n<br>\nimprove the lives of patients. We develop breakthrough therapies and innovative\n<br>\nhealthcare solutions in areas of unmet medical need for both humans and\n<br>\nanimals. As a family owned company we focus on long term performance.?We\n<br>\nare powered by 50.000 employees globally who nurture a diverse, collaborative\n<br>\nand inclusive culture.?Learning and development for all employees is key\n<br>\nbecause your growth is our growth.??Want\n<br>\nto learn more?? Visit boehringer-ingelheim.com and\n<br>\njoin us in our effort to make more health.?Boehringer\n<br>\nIngelheim, including Boehringer Ingelheim Pharmaceuticals, Inc., Boehringer\n<br>\nIngelheim USA, Boehringer Ingelheim Animal Health USA, Inc., Merial\n<br>\nBarceloneta, LLC and Boehringer Ingelheim Fremont, Inc.?is an equal\n<br>\nopportunity and affirmative action employer committed to a culturally diverse\n<br>\nworkforce.? All qualified applicants will receive consideration for\n<br>\nemployment without regard to race; color; creed; religion; national origin;\n<br>\nage; ancestry; nationality; marital, domestic partnership or civil union\n<br>\nstatus; sex, gender identity or expression; affectional or sexual orientation;\n<br>\ndisability; veteran or military status, including protected veteran status;\n<br>\ndomestic violence victim status; atypical cellular or blood trait; genetic information\n<br>\n(including the refusal to submit to genetic testing) or any other\n<br>\ncharacteristic protected by law.\n<br><br>\n#LI-SS1\n<br><br>\n?"}