{"job title": "Scientist III, NBE PK", "company": "Boehringer Ingelheim", "city state": "– Ridgefield, CT", "rating": "3.5", "job description": "<strong>Description:</strong>\n<br><br>\nDesign and implement non-regulated quantitative pharmacokinetic (biomarker) ligand binding assays in support of Boehringer Ingelheim's innovative pre-clinical New Biological Entity (NBE) R&amp;D portfolio. Represent pharmacokinetic discipline on multi-disciplinary drug discovery project teams and integrate antibody pharmacokinetic and biomeasure considerations into team strategy. Collaborate with key stakeholders in pre-clinical development in support of the overall research project strategy. Enhance capabilities of group via application of cell-based assays (e.g cytometry) and implementation of novel bioanalytical approaches and technologies.\n<br><br>\nAs an employee of Boehringer Ingelheim, you will actively contribute to the discovery, development and delivery of our products to our patients and customers. Our global presence provides opportunity for all employees to collaborate internationally, offering visibility and opportunity to directly contribute to the companies' success. We realize that our strength and competitive advantage lie with our people. We support our employees in a number of ways to foster a healthy working environment, meaningful work, diversity and inclusion, mobility, networking and work-life balance. Our competitive compensation and benefit programs reflect Boehringer Ingelheim's high regard for our employees.\n<br><br>\n<strong>Duties &amp; Responsibilities:</strong>\n\n\n<ul>\n<li>Independently develops and implements quantitative ligand binding assays, e.g., ELISA, MSD and/or Gyros to measure protein therapeutics and biomarkers in biological matrices</li>\n<li>Troubleshoots effectively and solves scientific problems independently; Operates lab equipment and is independently responsible for maintenance</li>\n<li>Designs and executes non-routine experiments on a basis of literature analyses with minimal supervision</li>\n<li>Independently applies basic scientific principles, performs literature searches, attends scientific meetings, and keeps abreast of literature in own field</li>\n<li>Proposes new experiments/technologies based on science as well as overall understanding of drug discovery/development process; Demonstrates expertise in field and contributes to training technicians and junior level scientists</li>\n<li>Effectively communicates and defends own work in the context of team and department goals both orally and in writing</li>\n<li>Reports and treats data with a high level of integrity and ethics; Writes protocols, procedures, and technical reports; Provides input for scientific reports</li>\n<li>Complies with applicable regulations, performing all work in a safe manner; Maintains proper records in accordance with SOPs and policies</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Master's degree in biology, biochemistry, immunology, physiology, chemistry, pharmacy or related field with 3 years of experience in laboratory research in the pharmaceutical and/or biotech industry or Bachelor's degree in biology, biochemistry, immunology, physiology, chemistry, pharmacy or related field with 7 years of experience in laboratory research in the pharmaceutical and/or biotech industry.</li>\n<li>Proficient in developing quantitative ligand binding assays, e.g., ELISA, MSD and/or Gyros. Cell culture, FACS and/or laboratory automation experience highly desirable.</li>\n<li>High technical proficiency/attention to detail, with strong problem solving skills and ability to adapt to evolving technologies</li>\n<li>Ability to build effective working relationship and aptitude for sharing expertise with cross-functional and global teams</li>\n<li>Ability to communicate effectively both orally and in writing in an interdisciplinary environment</li>\n</ul>\n\n<strong>Eligibility Requirements:</strong>\n\n\n<ul>\n<li>Must be legally authorized to work in the United States</li>\n<li>Must be willing to submit to a background investigation, including verification of your past employment, criminal history, and educational background</li>\n<li>Must be willing to take a drug test and post-offer physical (if required)</li>\n<li>Must be 18 years of age or older</li>\n</ul>\n\n<strong>Our Culture:</strong>\n<br><br>\nBoehringer Ingelheim is a different kind of pharmaceutical company, a privately held company with the ability to have an innovative and long term view. Our focus is on scientific discoveries that improve patients' lives and we equate success as a pharmaceutical company with the steady introduction of truly innovative medicines. Boehringer Ingelheim is the largest privately held pharmaceutical corporation in the world and ranks among the world's 20 leading pharmaceutical corporations. At Boehringer Ingelheim, we are committed to delivering value through innovation. Employees are challenged to take initiative and achieve outstanding results. Ultimately, our culture and drive allows us to maintain one of the highest levels of excellence in our industry. Boehringer Ingelheim, including Boehringer Ingelheim Pharmaceuticals, Inc., Boehringer Ingelheim USA, Boehringer Ingelheim Roxane Inc., Roxane Laboratories Inc., Boehringer Ingelheim Chemicals, Boehringer Ingelheim Vetmedica Inc. and Ben Venue Laboratories Inc., is an equal opportunity employer. M/F/D/V\n<br><br>\nBoehringer Ingelheim is firmly committed to ensuring a safe, healthy, productive and efficient work environment for our employees, partners and customers. As part of that commitment, Boehringer Ingelheim conducts pre-employment background investigations and drug screenings."}