{"job title": "Insider Threat Data Analysis Software Engineer", "company": "BOEING", "city state": "– Annapolis Junction, Maryland", "rating": "3.5", "job description": "Annapolis Junction,Maryland,United States\n<br>\n6J7BP3<br><br><strong>Relocation Assistance Available for Eligible Candidates</strong>\n<br><br>\nBoeing Defense, Space &amp; Securitys Autonomous Systems Division is seeking a well-qualified Software Engineer to support The Boeing Companys Enterprise Insider Threat Program. Boeings Enterprise Insider Threat Program has an established technology platform used to support their mission. This platform includes an Extract-Transform-Load capability used to normalize disparate data sources integrate them into a custom analytic platform.\n<br><br>\nResponsibilities:\n<br><br>\nSoftware Engineers for this Program are responsible for developing, documenting, and maintaining the architecture, requirements, algorithms, interfaces, and designs for their software system. The successful candidates develop and maintains code and integrate software components into the Programs fully functional software system; develop software verification plans, test procedures and test environments, executing the test procedures and documenting test results to ensure all software system requirements are met; and develop, select, tailor, and deploy software processes, tools, and metrics to maintain the utmost quality of their work.\n<br><br>\nCandidates must be able to communicate effectively and concisely with both fellow engineers and non-technical peers; must be capable of working in a fast-paced, multi-tasking environment; and must be capable of working in a geographically-dispersed team.\n<br><br>\nBoeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.\n<br><br>\n<strong>Typical Education/Experience:</strong>\n<br><br>\nDegree and typical experience in engineering classification: Bachelor's and 5 or more years' experience, Master's degree with 3 or more years' experience or PhD degree with experience. Bachelor, Master or Doctorate of Science degree from an accredited course of study, in engineering, computer science, mathematics, physics or chemistry. ABET is the preferred, although not required, accreditation standard.\n<br><br>\n<strong>Basic Qualifications (Required):</strong>\n<ul>\n<li>Current/Active Top Secret (TS) security clearance or a current Single-Scope Background Investigation (SSBI) is required. (Note: If you held a security clearance within the last two years, your clearance is considered current/active).</li> \n</ul>\n<strong>Desired Qualifications:</strong>\n<ul>\n<li>Quality applicants are considered independent self-starters, with experience developing and executing code for Extract-Transform-Load capabilities.</li> <li>Applicants should have a strong background in Ruby, JRuby, Java, and SQL coding languages; Bash scripting; and must be detail-oriented.</li>\n</ul>\nNo\n<br>\nAutonomous Systems\n<br>\nIndividual Contributor\n<br>\nNo\n<br>\nNo\n<br>\nStandard\n<br>\nUnited States; The Boeing Company"}