{"job title": "Senior Systems &amp; Data Analyst", "company": "Boeing", "city state": "– Everett, Washington", "rating": "3.5", "job description": "Company\n<br>\nThe Boeing Company\n<br><br>\nJob ID\n\n\n<ul>\n<li>*********</li>\n</ul>\n\nDate posted\n<br>\n<strong>11/16/2018</strong>\n<br><br>\nLocation\n<br>\nEverett Washington United States\n<br><br>\nOther Locations\n<br><br>\nAuburn;Washington;United States~\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nThe Boeing Company has an exciting opportunity for a\n<br><br>\nSenior Systems and Data Analyst\n<br>\nto join our Systems Application Support team in Everett OR Auburn Washington.\n<br><br>\nThis candidate will provide application and end-user support for Factory Automation System's Applications. Factory Automation System's applications consist of Electrical Systems Responsibility Center Suite of applications (ESRC), eWIRE, IRCNEST, MDMS-ECADS, MDMS-WSCC and NESTPROS and a host of other lower AEC level applications. Responsibilities include but are not limited to:\n<br>\nAnalyze/troubleshoot problem tickets and work directly with factory floor personnel to resolve issues/problems and on call support\n<br>\nParticipate in system updates and changes to applications and databases. Most of the applications to be supported are critical to ERSC, Factory Automation, Robotics, and Assembly\n<br>\nResearch and analyze system requests, document reoccurring systems issues to assist in solving issues similar issues in the future\n<br>\nBe customer liaison for status and metrics\n<br>\nResearches complex or multiple processes, applications, systems and data to identify functional requirements for application or system design\n<br>\nConsults with customers to clarify and refine complex requirements\n<br>\nInterprets and translates complex requirements into functional specifications\n<br>\nLeads and performs activities to develop and execute tests to validate system functionality against specifications\n<br>\nBoeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.\n<br><br>\nDivision\n<br><br>\nCIO, Information &amp; Analytics\n<br><br>\nRelocation Assistance Available\n<br><br>\nNo. Relocation assistance is not a negotiable benefit.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Typical Education/Experience:</strong>\n<br><br>\nTechnical bachelor's degree and typically 9 or more years' related work experience or a Master's degree with typically 7 or more years' or a PhD degree with typically 4 or more years' related work experience or an equivalent combination of education and experience. A technical degree is defined as any four year degree, or greater, in a mathematic, scientific or information technology field of study.\n<br><br>\n<strong>Required Skills/Experience:</strong>\n<br><br>\nThis position must meet Export Control compliance requirements, therefore a US Person as defined by 22 C.F.R. 120.15 is required. US Person includes US Citizen, lawful permanent resident, refugee, or asylee.\n<br>\n5+ years of experience in production operations or supporting end-users/customer support for IT systems\n<br>\n5+ years of experience with UNIX/AIX, command line executions &amp; creating scripts\n<br><br>\n<strong>Preferred Skills/Experience:</strong>\n<br><br>\nExperience with any of the following programming languages: C++, *******, C#, ******, VB6, VBA, MS Access/SQL, HTML/CSS, AJAX, JavaScript\n<br>\nExperience with any of the following operating Systems: Windows, Unix\n<br>\nExperience with any of the following database Systems: SQL server, Oracle\n<br>\nExperience with SQL Server Management Studio / SQL Developer, MS Visual Studio\n<br>\nExperience with UNIX (understand/change permissions, copy/move files, etc)\n<br>\nExperience with vi/vim/(other UNIX file editor) introduction\n<br>\nExperience with ORACLE sqlplus introduction to create ORACLE/CLOUD queries/updates/deletes\n<br><br>\nExperience Level\n<br><br>\nIndividual Contributor\n<br><br>\nJob Type\n<br><br>\nStandard\n<br><br>\nTravel\n<br><br>\nYes, 10 % of the Time\n<br><br>\nContingent Upon Program Award\n<br><br>\nNo\n<br><br>\nUnion\n<br><br>\nNo\n<br><br>\nJob Code\n<br><br>\n<strong>BAMAP4</strong>"}