{"job title": "Data Engineer", "company": "BOEING", "city state": "– Arlington, Virginia", "rating": "3.5", "job description": "<div><strong>**THIS POSITION REQUIRES AN ACTIVE TS/SCI **</strong>\n<br><br>\n<strong>BI&amp;A</strong> seeking <strong>DataEngineer</strong> with data transformation (ETL) experience working with latest industry tools.\n<br><br>\n<strong>DUTIES ENTAIL:</strong>\n<br><br>\n· Work with a teammate on data integration requirements.\n<br><br>\n· Write code on ETL platform to transform data to a suitable formats as defined by IC ITE initiatives.\n<br><br>\n· Add features to ETL platform to shorten timelines for future data integration efforts.\n<br><br>\n· Develop, maintain code, and integrate software into a fully functional software system.\n<br><br>\n· Participate in daily scum meetings, sprint retrospectives, and other agile processes.\n<br><br>\n· Work with external teams to validate data ingest.\n<br><br>\n· Provide and maintain documentation of system architecture, development, and enhancements.\n<br><br>\n<strong>EDUCATION:</strong>\n<br><br>\n· Bachelors Degree and 6 or more years experience or Master's Degree with 3 or more years' experience from an accredited course of study, in engineering, computer science, mathematics, physics or chemistry.\n<br><br>\n<strong>REQUIRED EXPERIENCE:</strong>\n<br><br>\n· 6+ years of software development experience\n<br><br>\n· Demonstrated understanding of high scale cloud architecture\n<br><br>\n· Linux/Unix experience\n<br><br>\n· Object Oriented programming language\n<br><br>\n· Possess strong verbal and written communication skills\n<br><br>\n· Possess strong analytical skills, with excellent problem solving abilities in the face of ambiguity\n<br><br>\n<strong>DESIRED EXPERIENCE:</strong>\n<br><br>\n· Expertise in data ingestion, data transformation (ETL), and data modeling.\n<br><br>\n· Experience with Java, Ruby, or Python\n<br><br>\n· Experience in Agile/SCRUM enterprise-scale software development\n<br><br>\n· 3 years experience working with batch-processing and tools (eg, Nifi, Midpoint, MapReduce, Yarn, Pig, Hive, HDFS, Oozie)\n<br><br>\n· 1 year working with Restful web services Experience with code development, deployment, versioning, and build tools (eg, Eclipse, git, svn, maven, Jenkins)\n<br><br>\n· Experience working with tools in the stream-processing (eg, Storm)\n<br><br>\n· Experience developing applications that work with NoSQL stores (eg, ElasticSearch, Hbase, Cassandra, MongoDB, CouchDB)\n<br><br>\n· Working in cloud architecture with AWS EC2, RDS, S3, VPC, Elastic Search<br>\n<div><div><div><div>BI&amp;A is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br><br>\nEqual Employment Opportunity is the Law (PDF)</div></div></div></div></div>"}