{"job title": "Data Scientist", "company": "BOLD", "city state": "– San Francisco, CA", "rating": "3.7", "job description": "BOLD is an established and fast-growing technology company that transforms work lives. Since 2005, BOLD has delivered award-winning career services that have a meaningful and positive impact on job seekers and employers. BOLD's robust product line includes a professional resume and cover letter writing services, scientifically validated career tests, and employer tools that help companies hire, onboard, and communicate with their staff.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nIn this critical role, you'll combine your analytical and data science skills to deliver key insights to our Product and Engineering teams. You will help develop data science and machine learning techniques that can be bundled as micro-services integral to Bold's data platform. You will work with teams whose domain experience include Big Data, Business Intelligence, and core product development.\n<br><br>\n<strong>Required Responsibilities:</strong>\n\n<ul>\n<li>Leverage our rich data sets of user data to perform research, develop models and create data products with our Development &amp; Product teams</li>\n<li>Develop novel and scalable data systems that leverage Big Data sets and machine learning techniques to enhance user experience and engagement</li>\n<li>Build a better understanding of our user base through exploratory and confirmatory analysis to increase user retention and B2B opportunities</li>\n<li>Develop entity taxonomies, knowledge bases and graphing techniques to find deep insights and recommendations for users in career space</li>\n<li>Develop deep learning techniques to do user segmentation and cohort analysis</li>\n<li>Mentor and coach related team members</li>\n</ul>\n<strong>Required Qualifications:</strong>\n\n<ul>\n<li>Bachelors or Masters in a relevant technical field, such as Computer Science, Statistics, Data Science, Data Engineering, Machine Learning</li>\n<li>3-4 years of relevant experience in Data Science and Machine Learning</li>\n<li>Deep understanding of data analysis, statistical techniques, natural language processing and knowledge base, graph systems</li>\n<li>Expertise in database querying (SQL, noSQL), search techniques, web services etc,</li>\n<li>Excellent problem-solving skills</li>\n<li>Domain expertise of data analysis tools (Python, R, Octave/MATLAB, or similar)</li>\n<li>Fluent in a programming language (Python, Ruby, PHP, Java or similar)</li>\n<li>Understanding of cloud computing (Amazon Web Services or Microsoft Azure)</li>\n<li>Familiarity with the Hadoop ecosystem, including HDFS, MapReduce, Hive, and Spark</li>\n<li>Write reusable, efficient code to automate analysis and data processes</li>\n<li>Ability to clearly communicate complex analytical methods and results to a non-technical audience</li>\n<li>Ability to map Data Science techniques to solve product and business problems to increase consumer and retention</li>\n</ul>\n<strong>About BOLD:</strong>\n<br><br>\nBOLD is a fast-paced, innovative company full of smart, committed people, who are passionate about our products and love helping people find the career of their dreams. We balance work and fun while continuing to build a successful, fast-growing company that is changing the way people get jobs.\n<br><br>\nOur vision is to revolutionize the online career world by creating transformational products that help people find the careers they love and reach their full potential.\n<br><br>\nBOLD is an equal opportunity employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, gender identity or expression, marital status, genetic information or membership in any other legally protected category.\n<br><br>\nQualified applicants with arrest and conviction records will be considered for the position in accordance with San Francisco's Fair Chance Ordinance."}