{"job title": "Data Scientist", "company": "Bold Metrics", "city state": "– Bay Area, California", "rating": "NA", "job description": "WHO WE ARE<br><br>Bold Metrics Inc. (BMI) has created a suite of AI technologies that allows brands to accurately predict customer body measurements and relate them to garment specifications. Using our cutting-edge machine learning algorithms, retailers and brands are ditching conventional sizing solutions and leveraging our technology to reduce returns and increase conversions. Ultimately, our goal is to revolutionize the apparel industry by leveraging this data to unlock body-relative apparel design.\n<br><br>\nHistorically, apparel sizes have been generated in the absence of customer-driven body data. This has lead to a worldwide apparel waste problem caused by a high rate of returns coupled with a bad consumer experience around fit and sizing, often amplified online. Along with garment sizing optimizations, the downstream experience becomes more customer-driven, leading to a significant reduction in returns and happier customers.\n<br><br>\nWe are a venture-backed well funded company ($3.77M raised to-date) with year-over-year growth of 350%. Bold Metrics works with some of the worlds largest brands, retailers and clothing manufacturers in the US, Europe and Asia, and has offices in Austin, TX and San Francisco, CA.<br><br>\n<br>\n<br>\n WHO WE ARE LOOKING FOR<br><br>We are looking for an intellectually curious person, who has the drive to create sophisticated algorithms that can be translated efficiently to a scalable framework. We value self-driven can-do people that are sticklers for writing quality code over writing code quickly to get the job done. The ideal candidate will have a deep interest in data science, good communication skills, and generally have a positive vibe. Perhaps most importantly, we are looking for someone with a strong sense of customer empathy who understands that accuracy matters and also has the desire to influence the product direction.<br><br>\n<br>\n<br>\n WHAT YOU WILL DO\n\n\n<ul>\n\n \n<li>Define problems, research solutions, and figure out which data to use in your solution</li>\n\n<li>Query, assemble, clean, and refine datasets in preparation for analysis</li>\n\n<li>Analyze data using a variety techniques in order to build a proof of concept for your solution</li>\n\n<li>Build high-quality prototypes and collaborate with the engineering team to implement the solution in a scalable framework</li>\n\n<li>Communicate findings to stakeholders and a broader audience of technical and non-technical co-workers and clients</li>\n\n</ul>\n\n \n<br><br>\n REQUIREMENTS\n\n\n<ul>\n\n \n<li>Extremely fluent in Python, Pandas, and Scikit Learn</li>\n\n<li>1+ years of work experience in machine learning in a commercial setting</li>\n\n<li>Deep expertise in statistics, algebra, geometry and mathematical modeling</li>\n\n<li>Fluent in data fundamentals including SQL and data manipulation using a procedural language</li>\n\n<li>Multiple pieces of evidence that youve successfully been able to scope, deliver and sell your own research and prototypes</li>\n\n<li>Excellent written and verbal communication skills on quantitative topics for a variety of audiences including clients (both technical and non-technical), product managers and engineers</li>\n\n<li>Experience with NLP or computer vision is a plus</li>\n\n<li>Willingness to learn new tools as they become needed</li>\n\n<li>Bachelor's degree or higher in natural sciences / computer science / mathematics</li>\n\n</ul>\n\n \n<br><br>\n PERKS &amp; BENEFITS\n\n\n<ul>\n\n \n<li>Stock options</li>\n\n<li>Full benefits, including medical, dental and vision insurance</li>\n\n<li>Working Environment: Open-office space in SF, equipped with snacks, working remotely is optional</li>\n\n<li>10 company paid holidays and generous vacation policy</li>\n\n<li>Top of the line technology to help you build your own workspace</li>\n\n</ul>\n\n<br>"}