{"job title": "Senior Product Data Analyst", "company": "BOLD", "city state": "– San Francisco, CA", "rating": "3.5", "job description": "BOLD is an established and fast-growing technology company that transforms work lives. Since 2005, BOLD has delivered award-winning career services that have a meaningful and positive impact on job seekers and employers. BOLD's robust product line includes a professional resume and cover letter writing services, scientifically validated career tests, and employer tools that help companies hire, onboard, and communicate with their staff.\n<br><br>\n<strong>DEPARTMENT SUMMARY:</strong>\n<br><br>\nThis role is in our Analytics team. This team supports product, marketing, and finance teams in presenting product performance metrics and providing key recommendations to promote growth.\n<br><br>\n<strong>POSITION SUMMARY:</strong>\n<br><br>\nAs our<strong> Senior Product Data Analyst</strong><strong>,</strong> you will lead the data reporting roadmap, become a strategic partner to various business units, and provide recommendations to the business for product growth. You will be responsible for driving the company's reporting capabilities, working with partner teams on ad-hoc analyses, and providing strategic support to the executive team. You will also be responsible for developing standardized metrics and reporting for the organization that keep us informed, and are the fingers on the pulse of our business. Through your insightful work and attention to detail, you will be the go-to person for information about performance and product development insights.\n<br><br>\nThe ideal candidate for this role will be highly motivated and will use not only their technical skills but their analytical and strategic direction to quickly make an impact!\n<br><br>\n<strong>REQUIRED RESPONSIBILITIES:</strong>\n\n<ul>\n<li>Develop data roadmaps for supporting marketing, finance, product, and traffic acquisition teams with product performance, user engagement, and strategic direction.</li>\n<li>Conduct in-depth analysis to find opportunities for product development and enhancement.</li>\n<li>Provide recommendations to improve performance and KPIs via monitoring dashboards, scorecards, and ad hoc analysis.</li>\n<li>Work closely with analysts to extract meaningful insights using a variety of data sources relational databases, front-end analytics tools, clickstream data, etc.</li>\n<li>Delegate responsibilities and tasks internally across a variety of concurrent projects.</li>\n<li>Train, educate, and guide analysts and external stakeholders on data extraction, consumption, and analysis.</li>\n<li>Present performance/engagement insights and recommendations to executive leadership via visualizations and concise messaging.</li>\n<li>Collaborate with BI and Engineering groups to advance data infrastructure, governance, and capabilities.</li>\n<li>Track and analyze website performance, click stream, and user paths to provide data for decision-making.</li>\n<li>Surface and analyze data to help us build more robust Customer Segmentation.</li>\n<li>Help create Customer Engagement reporting and modeling using our event stream.</li>\n</ul>\n<strong>REQUIRED</strong> <strong>QUALIFICATIONS:</strong>\n\n<ul>\n<li>Bachelor's degree in CS, Statistics, Business, Economics, or related field.</li>\n<li>4-6 years as an individual contributor performing quantitative analysis, preferably for an internet or technology company.</li>\n<li>Ability to write and execute complex SQL queries to extract data from a variety of internal sources.</li>\n<li>Experience implementing and using Google Analytics, MixPanel or other front-end analytical platforms to analyze product performance and engagement.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Self-starter with a desire to learn and the ability to rapidly understand the business and its drivers.</li>\n<li>High proficiency with Excel including pivoting capabilities and analysis modules.</li>\n<li>Ability to handle conflicting priorities and meet deadlines in a fast-paced environment.</li>\n</ul>\n<strong>DESIRED QUALIFICATIONS:</strong>\n\n<ul>\n<li>Experience writing and optimizing complex SQL queries.</li>\n<li>Knowledge of programming languages (Python preferred).</li>\n<li>Proficiency with Sisense, Tableau, or other BI platforms.</li>\n<li>Proficiency with Web Analytics tools Google Analytics, MixPanel, etc.</li>\n</ul>\n<strong>ABOUT BOLD:</strong>\n<br><br>\nBOLD is a fast-paced, innovative company full of smart, committed people who are passionate about our products and love helping people find the career of their dreams. We balance work and fun while continuing to build a successful, fast-growing company that is changing the way people get jobs.\n<br><br>\nOur vision is to revolutionize the online career world by creating transformational products that help people find the careers they love and reach their full potential.\n<br><br>\nBOLD is an equal opportunity employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, gender identity or expression, marital status, genetic information or membership in any other legally protected category.\n<br><br>\nQualified applicants with arrest and conviction records will be considered for the position in accordance with San Francisco's Fair Chance Ordinance."}