{"job title": "Employee Relations Data Analyst", "company": "Boly:Welch", "city state": "– Beaverton, Oregon", "rating": "4.8", "job description": "<strong>Salary:</strong> DOE \n<br>\n<strong>Industry:</strong> Footwear &amp; Apparel \n<br>\n<strong>What Matters Most:</strong>\n\n\n<ul>\n<li>3-5 years of experience with progressive analysis and problem solving required</li>\n<li>Proficiency in Oracle Cloud Services Case Management strongly preferred</li>\n<li>Proficiency in Tableau, MS PowerPoint, and MS Excel, including advanced formulas and charts required</li>\n<li>Knowledge of SAP, HCM, OM, and PA required</li>\n<li>Background and/or knowledge and passion for the footwear and apparel industry</li>\n</ul>\n\n<strong>Your New Role:</strong>\n\n\n<ul>\n<li>Performs daily analysis on ER Case Data to identify data integrity issues</li>\n<li>Performs actions to resolve data integrity gaps and to ensure reporting is correct and complete</li>\n<li>Utilizes multiple applications to extract data, perform audits, and create metrics reports according to schedule</li>\n<li>Creates and maintains documentation of audits and reports</li>\n<li>Participates in efforts to identify areas of potential process or data improvements and reports them to the Global Process &amp; Tools Manager</li>\n</ul>\n\n<strong>Your New Organization:</strong><br><br>This Beaverton-based industry leader in global footwear and apparel is looking for a great Employee Relations Data Analyst to join their team. The brand is at the forefront of product innovation and truly employs the best of the best. Boly:Welch is a preferred hiring partner of this organization and you’ll be eligible for Boly:Welch’s benefits offerings.\n<br><br>\n<strong>If this position caught your eye, send us your resume! For best consideration, include the job title and source where you found this position in the subject line of your email to bwfit@bolywelch.com</strong>.\n<br><br>\n<em>Already a Boly:Welch candidate? Please connect directly with your recruiter to discuss this opportunity.</em>\n<br><br>\nCategory: B:W Fit"}