{"job title": "Data Scientist", "company": "Bombfell", "city state": "– New York", "rating": "4.4", "job description": "<div><strong>WHAT WE DO</strong></div><div>Bombfell is an online personal styling service for men and one of the fastest-growing startups in the country. In 2017, we were included in the Inc. 5000 list for fastest-growing companies (#218). We're building a powerful, entirely personalized retail experience that enables men to buy their clothing with confidence.</div><br>\n<div>Featured in such prominent publications as the New York Times, TIME, Business Insider, Wall Street Journal, TechCrunch and Vogue, Bombfell is backed by world-class investors with deep e-commerce experience.</div><br>\n\n<div><strong>HOW WE DO</strong></div><div>We pride ourselves on blending best-in-class tech with expert styling and have attracted an extraordinarily well-rounded team of both technical and creative talent.</div><br>\n<div>We've entered hyper-growth stage and are scaling our team to make a dent in the e-commerce universe.</div> <br>\n<div>We've got a close-knit culture that prioritizes results, self-motivation, a diversity of viewpoints and open communication. We treasure humility and foster camaraderie. We've got engineers, fashionistas, marketers and ops all under one roof in an open floor plan.</div> <br>\n<div>We eat lunch together every day, have team-building exercises and dismissively snipe about each other in our Game of Thrones fantasy league.</div><br>\n\n<div><strong>YOU</strong></div><div>You crunch numbers for breakfast and extrude actionable recommendations before lunch, like a Cylon but one on the side of humanity (well even call you Boomer). You exhibit a keen intellectual curiosity and love to probe data for insights. Youre self-driven and like to take your own initiative, but you take pride in an ability to thoughtfully incorporate feedback from others.You can not only program recommendation engines in your sleep, but also adapt and learn from their real-world applications. You pay close attention to detail and strive to create a better product. You love working on something that makes peoples lives easier.</div><br>\n<div><strong>THE ROLE</strong></div><div>This is a tremendous opportunity to take on a leadership role in the Data Science efforts of a rapidly growing startup. Youll mine data for insights that will be translated directly into product. Youll build your own cutting-edge models in trying to craft solutions to a wide range of interesting problems, from analyzing customer behaviors to implementing machine learning algorithms to statistical modeling/analyses. Youll work directly with the founders to more intelligently build out an innovative and rapidly scaling product that reaches hundreds of thousands of people, and ride the forefront of the next wave in e-commerce.</div>REQUIREMENTS\n\n<ul>\n<li>Fluency in machine learning algorithms and analysis</li><li>Strong skills in statistics and probability</li><li>Familiarity with databases</li><li>Can code (preferably in Python)</li><li>Prior experience creating and deploying recommendation engines</li><li>Prior experience analyzing data to mine insights</li><li>Skilled in data visualization</li><li>Possess degree in technical field of study (PhD preferred)</li>\n</ul>\n\n<div><strong>PERKS</strong> </div><div>Health, dental, and vision plus disability insurance</div><div>Lunch provided every day</div><div>Commuter Benefits: $125 monthly allowance</div><div>Quarterly clothing allowance, plus the ability to purchase clothes at wholesale pricing</div><div>Company outings and wellness events</div> <div>Lots of free smiles from your co-workers</div>"}