{"job title": "Head of Data Science", "company": "Booster", "city state": "– Burlingame, CA", "rating": "4.1", "job description": "Do you want to impact the lives of everyone by eliminating the errand of going to the gas station? Booster has redesigned the infrastructure to deliver gas and replaced the gas station with an app. Our technology and operational expertise enable Booster to deliver fresh gas at the same price as traditional gas stations. This is a difficult problem to master and we are making it happen. Every day, we solve incredibly hard problems to create an experience for our customers that is absolutely magical.\n<br><br>\nBooster is powered by data. We are creating the best way for consumers and businesses to get gas by applying data, algorithms and machine learning to problems in logistics, retail, personalization, pricing and more.\n<br><br>\nAre you interested in working at the intersection of applied quantitative research, engineering development, and data science? Do you have an interest in leading and growing a top-notch science team to develop and apply quantitative solutions related to Booster's uniquely challenging problems? If so, this is the job for you.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n<li>Tackle the most impactful challenges of Booster's business through data:</li>\n\n\n\n<li>Delivery network and dispatch operations,</li>\n\n\n\n<li>Consumer demand forecasting and price elasticity,</li>\n\n\n\n<li>Service recommendations,</li>\n\n\n\n<li>Estimated time of arrival,</li>\n\n\n\n<li>Optimal service locations configuration</li>\n\n\n\n<li>and many more.</li>\n\n\n</ul>\n\n\n\n<ul>\n<li>Define the data science strategy for Booster overall.</li>\n\n<li>Lead the data science function and team at Booster.</li> \n\n<li>Hire and mentor a team of ambitious data scientists.</li>\n\n<li>Partner with Product and Business leaders to build data-centric solutions to business impact.</li>\n\n<li>Spearhead modeling and algorithmic development efforts as an integral part of the Booster system.</li>\n\n<li>Lead data-based analysis, balancing utmost precision with solid common sense.</li>\n\n<li>Hands-on leader, you will personally own critical initiatives.</li>\n\n<li>Find new opportunities to put our data to work in service of our customers without compromising end-user privacy or security.</li>\n\n<li>Partner with the Engineering organization to define the data infrastructure for Booster.</li>\n\n<li>Help us realize a data-informed culture and teach people how to Think Like A Scientist.</li>\n</ul>\n<strong>Required qualifications</strong>\n\n<ul>\n<li>Excellent educational background in a quantitative field, such as Operations Research, Economics/Econometrics, or Machine Learning.</li>\n\n<li>Comfortable with research methodologies to address abstract business and product problems with utmost precision, while staying grounded in common sense. Makes complex problems simple.</li>\n\n<li>4 years industry experience in data analytics and quantitative modeling, with significant work experience as a technical contributor.</li>\n\n<li>3-5 years of startup experience.</li>\n\n<li>3-5 years of team leadership experience.</li> \n\n<li>Excellent judgment and creative problem-solving skills.</li>\n\n<li>Excellent interpersonal and team leadership skills.</li>\n\n<li>Experience with common analysis tools - SQL, Python, R, etc. Demonstrable familiarity with code and programming concepts.</li>\n\n<li>Self-starter and relentless personal drive to get things done.</li>\n\n<li>Ability to drive multiple initiatives at once, while having a single-minded focus on highest priorities.</li>\n\n<li>Strives in fast-paced highly ambiguous environments. Sense of humor required.</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n\n<ul>\n<li>Ph.D. degree.</li>\n\n<li>Experience with operations, routing, dispatch, logistics modelization.</li>\n\n<li>Experience with deep learning, representation learning, convex &amp; combinatorial optimization, hypothesis testing, causal inference, and behavioral modeling.</li>\n\n<li>Experience leading a distributed team, deeply embedded in multiple functions and businesses.</li>\n</ul>\n<strong>Benefits</strong>\n\n<ul>\n<li>Medical, Vision and Dental insurance.</li>\n\n<li>Gas available at cost.</li>\n\n<li>Paid Vacation and Sick Time.</li> \n\n<li>Equity in Booster.</li>\n\n<li>Early stage startup environment.</li>\n\n<li>Work directly with the founders and executive team.</li>\n</ul>\n<strong><em>Learn More About Booster:</em></strong>\n<br><br>\n<em>News:</em>\n\n<ul>\n<li>https://www.cnbc.com/2017/07/31/booster-a-fuel-delivery-start-up-used-by-companies-like-facebook.html</li> \n\n\n<li>\nhttps://techcrunch.com/2017/08/01/booster-raises-20-million-to-fill-your-car-at-work/</li> \n\n\n<li>\nhttps://www.wsj.com/articles/the-new-corporate-perk-gassing-up-at-work-1511951401</li> \n</ul>\n<em>Founders:</em>\n\n<ul>\n\n<li>\nhttps://www.linkedin.com/pulse/note-from-co-founders-why-building-booster-means-so-much-mycroft</li> \n</ul>\n<em>Investors:</em>\n\n<ul>\n<li>Conversion Capital https://www.linkedin.com/pulse/our-investment-booster-fuels-christian-lawless</li> \n\n<li>Madrona Venture Group http://www.madrona.com/boosters-focus-customer-unit-economics-pays-off/</li> \n\n<li>Maveron https://www.linkedin.com/pulse/booster-fuels-end-trip-gas-station-david-wu</li> \n</ul>\n<em>Individuals seeking employment at Booster are considered without regards to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition (except where physical fitness is a valid occupational qualification), genetic information, veteran status, or any other consideration made unlawful by federal, state or local laws.</em>\n<br><br>\n<em>Booster does not discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant.</em>\n<br><br>\n<em>Disclaimer: The above statements are intended to describe the general nature and level of work being performed by associates assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed</em>\n<br><br>\n<em>Booster doesn't accept unsolicited agency resumes and won't pay fees to any third-party agency or firm that doesn't have a signed agreement with Booster.</em>"}