{"job title": "Operations Research Data Scientist", "company": "Booz Allen Hamilton Inc.", "city state": "– Norfolk, VA", "rating": "3.7", "job description": "<strong>Job Number: R0029362</strong>\n<br><br>\nOperations Research Data Scientist<br><br>Key Role:\n<br><br>\nAnalyze actual and predictable interacting operational activities of a military, governmental, or business system to obtain a quantitative, rational basis for decision making or resource allocation. Use modeling and measuring techniques, mathematics, statistical methods, engineering methods, operational mathematical techniques, and other principles and laws of scientific and economic disciplines in determining solutions. Assist with the definition of machine learning and data mining strategies. Create, deploy, maintain, and refine decision management models.\n<br><br>\nBasic Qualifications:\n<br><br>\n-2+ years of experience with advanced analytical functions\n<br><br>\n-Experience with at least one statistical analytical programming language, including Python or R\n<br><br>\n-Experience with source control and dependency management software, including Git or Maven\n<br><br>\n-Experience with using relational databases, including MySQL\n<br><br>\n-Experience with identifying analytic insight in data, developing visualizations, and presenting findings to stakeholders\n<br><br>\n-Knowledge of object-oriented programming, including Java, C++, and various machine learning algorithms, their design, capabilities, and limitations\n<br><br>\n-Knowledge of statistical analysis technique\n<br><br>\n-Ability to build complex extraction, transformation, and loading (ETL) pipelines to clean and fuse data together\n<br><br>\n-Ability to obtain a security clearance\n<br><br>\n-BA or BS degree required\n<br><br>\nAdditional Qualifications:\n<br><br>\n-Experience with designing and implementing custom machine learning algorithms\n<br><br>\n-Experience with graph algorithms and semantic Web\n<br><br>\n-Experience with designing and setting up relational databases\n<br><br>\n-Experience with Big Data computing environments, including Hadoop\n<br><br>\n-Experience with Navy mission systems\n<br><br>\n-MA or MS degree in Mathematics, CS, or quantitative fields\n<br><br>\nClearance:\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.<br><br>NMC\n<br><br>"}