{"job title": "CMD Summer Games Data Scientist - Intern", "company": "Booz Allen Hamilton Inc.", "city state": "– Annapolis Junction, MD", "rating": "3.7", "job description": "<strong>Job Number: R0037649</strong>\n<br><br>\nCMD Summer Games Data Scientist - Intern<br><br><strong>Key Role:</strong>\n<br><br>\nServe in an internship program geared towards students who have diverse backgrounds and are equipped to solve the complex and multidimensional problems that Booz Allen Hamilton consultants face every day. Work with internal or external clients through stages of the consulting life cycle, including business development, assignment planning, data gathering, data analysis, developing solutions, generating recommendations, communicating results, and implementation and follow up.\n<br><br>\nInterns will be expected to gather the required data, demonstrate analytic problem solving, present ideas clearly and logically, compose appropriately structured text, work with individuals at all levels, provide input to reports and other deliverables, execute multiple assignments, meet agreed deadlines, and adjust to changing client demands.\n<br><br>\n<strong>Experience and Training</strong>:\n<br><br>\n-1+ months of experience in a professional work environment obtained through internships or other work experience\n<br><br>\n-It is preferred that Electrical Engineering applicants have power or control systems experience\n<br><br>\n-Knowledge of standard research techniques, statistical analysis, data compilation\n<br><br>\n-Knowledge of the following domains will make for a stronger application: Python, R, Matlab, Machine Learning algorithms, Splunk\n\n\n<ul>\n<li>Ability to select, analyze, and present data and information in oral, written, and graphics form\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\n-Ability to show enrollment in a degree program following Summer 2019 internship completion\n<br><br>\n-Ability to show a minimum of 30 credit hours completed\n<br><br>\n-Ability to obtain a security clearance\n<br><br>\n-Pursuing a BA or BS degree in Mathematics, Statistics, Data Science, Operational Research, Industrial Engineering, CS, Computer Engineering, or EE\n<br><br>\n<strong>Additional Qualifications:</strong>\n<br><br>\n-Pursuing a MA or MS degree in Mathematics, Statistics, Data Science, Operational Research, Industrial Engineering, CS, Computer Engineering, or EE\n<br><br>\n<strong>Clearance:</strong>\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.</li>\n\n</ul>"}