{"job title": "Data Analyst/Data Scientist", "company": "Booz Allen Hamilton Inc.", "city state": "– Alexandria, VA", "rating": "3.7", "job description": "<strong>Job Number: R0040416</strong>\n<br><br>\nData Analyst/Data Scientist<br><br><strong>A Day in the Life of a Data Analyst Consultant at Booz Allen:</strong>\n<br><br>\nData is a gold mine if you know how to read it. Do you?\n<br><br>\nLeverage knowledge of Cloud computing technologies as part of the data science team. Work in conjunction with industry-leading Cloud computing technologists and develop machine learning, data mining, and statistical and graph-based algorithms designed to analyze massive datasets. Apply knowledge of Cloud technologies, partner with Cloud technologists, and ensure proper implementation and usage of algorithms. Work with a large financial government agency to save billions in tax fraud. Help a domestic intelligence agency reduce auto theft. Adapt mathematical and predictive models to delivering healthcare insights. These positions may be located in VA, DC, or MD.\n<br><br>\n<strong>About Booz Allen:</strong>\n<br><br>\nAt Booz Allen, were empowering people to change the worldstarting with you.\n<br><br>\nOn our team, youll enhance the security, economic well-being, health, and safety of people at home and around the globe. Were setting and raising the bar in analytics, consulting, cyber, digital solutions, and engineering &amp; science. We do it by finding the brightest minds and giving them a place to collaborate, take risks, and get even brighter.\n<br><br>\nOur focus on people isnt corporate jargon: its essential to our success. Its the reason Fortune, Forbes, Corporate Equality Index, and other organizations have consistently rated us a best place to work. And its how were going to leave the world better than we found it. Because products alone cant create progressbut people can. And our people do.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\n-Experience with machine learning, data mining, statistics, or graph algorithms in academic or internship environments\n<br><br>\n-Experience with using R, Perl, Python, SAS, or SPSS for the analysis of data\n<br><br>\n-Knowledge of an object-oriented language, including Java, C++, C#, or Python\n<br><br>\n-Knowledge of Hadoop, MapReduce, or HDFS\n<br><br>\n-Ability to show excellent data gathering, analytical, and problem-solving expertise\n<br><br>\n-Ability to obtain a security clearance\n<br><br>\n-Scheduled to obtain a BA or BS degree in Winter 2018 or Spring 2019\n<br><br>\n<strong>Additional Qualifications:</strong>\n<br><br>\n-Pursuing a BS degree in CS, Computer Engineering, Systems Engineering, or a related field preferred; pursuing an MS degree in CS, Computer Engineering, Systems Engineering, or a related field a plus\n<br><br>\n<strong>Clearance:</strong>\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}