{"job title": "Data Scientist, Senior", "company": "Booz Allen Hamilton Inc.", "city state": "– Alexandria, VA", "rating": "3.7", "job description": "<strong>Job Number: R0040758</strong>\n<br><br>\nData Scientist, Senior<br><br><strong>The Challenge:</strong>\n<br><br>\nAre you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection, to cancer research, to national intelligence you know the answers are in the data.\n<br><br>\nWe have an opportunity for you to use your leadership and analytical skills to improve the Department of Defense's management of multiple data sources. Youll work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. Youll mentor teammates, develop algorithms, write scripts, build dynamic dashboards and visualization tools, and apply machine learning turn a set of disparate data points into objective answers to help the most senior leaders in the Department of Defense make informed decisions. Youll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in our mission to provide cutting-edge analytics and data science methods to our nation's defense leadership.\n<br><br>\nEmpower change with us.\n<br><br>\n<strong>Build Your Career:</strong>\n<br><br>\nAt Booz Allen, we know the power of analytics and were dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:\n<ul>\n<li>access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk</li><li>a chance to change the world with the Data Science Bowlthe worlds premier data science for social good competition</li><li>participation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government</li>\n</ul>\nYoull have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. Well help you develop the career you want, as you chart your own course for success.\n<br><br>\n<strong>You Have:</strong>\n<br><br>\n-10 years of experience with OSD or Joint Staff analysis or similar strategic-level corporate or governmental analysis\n<br><br>\n-Experience with statistics, mathematics, data engineering, machine learning, or visualization\n<br><br>\n-Active Top Secret clearance\n<br><br>\n-MA or MS degree in Mathematics, Operations Research, CS, Data Science, Science, Technology, or Engineering\n<br><br>\n<strong>Clearance:</strong>\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Top Secret clearance is required.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}