{"job title": "Data Analyst", "company": "Booz Allen Hamilton Inc.", "city state": "– Arlington, VA", "rating": "3.7", "job description": "<b>Job Number: R0002378</b><br><br>Data Analyst<p>Key Role:<br>Provide analytic and management support to ensure Navy programs and requirements align with DoD guidelines and meet CNO strategic objectives. Assist the client with comprehending the context of its program data by extracting qualitative and quantitative relationships, including patterns and trends from large amounts of data and providing analytic support to help inform policy, rational decision making, and resource allocation at the highest levels of the Navy. Develop analytic products to facilitate the development of formal reports and senior leadership briefings, information papers, spreadsheets, and other documents, as required. Assist with programmatic analysis, metric development, and requirements analysis to support the Navys position during joint forums and adapt data analytic techniques to meet changing needs of key DoD stakeholders. Support the compilation, tracking, validation, and analysis of data from various reports, surveys, and government databases.<br><br>Basic Qualifications:<br>-Experience with Microsoft Office, including Word, PowerPoint, and Excel<br>-Ability to contribute in a team-oriented environment<br>-Ability to work independently, collaboratively, creatively, and analytically in a problemsolving environment<br>-Active Secret clearance<br>-MA or MS degree and 1 year of experience with data analysis<br><br>Additional Qualifications:<br>-Experience with applying inferential statistics<br>-Experience with Navy staff as military, civilian, or contractor in Joint Staff, OPNAV, or Navy SYSCOMs<br>-Possession of excellent oral and written communication skills<br>-Possession of excellent organizational skills<br><br>Clearance:<br>Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.</p><p></p><p></p><p>Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.</p><p></p><p></p>NMC<br><br> <br><br>"}