{"job title": "Data Engineer, Senior", "company": "Booz Allen Hamilton Inc.", "city state": "– Washington, DC", "rating": "3.7", "job description": "<strong>Job Number: R0033945</strong>\n<br><br>\nData Engineer, Senior<br><br>Key Role\n<br><br>\nIntegrate, manipulate, and manage vast amounts of data into the next generation of data analytic solutions for clients. Deliver robust solutions that serves clients and stands apart from competitors. Interact with a multi-disciplinary team of analysts, data scientists, developers, and users to comprehend the data requirements to develop a robust data processing pipeline that will ingest, manipulate, normalize, and expose potentially billions of records per day to support advanced analytics. Maintain responsibility for building and launching new data models that provide intuitive analytics to clients. Design, build, and deploy efficient and reliable data pipelines to move data, both large and small amounts, to the data platform. Design and develop new systems and tools to enable clients to consume and comprehend data faster.\n<br><br>\nBasic Qualifications:\n<br><br>\n-4+ years of experience with Java, Scala, or equivalent modern programming language\n<br><br>\n-3+ years of experience in working with Hadoop-based technologies\n<br><br>\n-3+ years of experience with RDBMS data stores, including PostgreSQL and MySQL\n<br><br>\n-Experience with custom or structured ETL design, implementation, and maintenance\n<br><br>\n-Experience with NoSQL data stores, including Accumulo, HBase, MongoDB, and Cassandra\n<br><br>\n-Ability to quickly learn technical concepts and communicate with multiple functional groups\n<br><br>\n-TS/SCI clearance\n<br><br>\n-BS degree in CS\n<br><br>\nAdditional Qualifications:\n<br><br>\n-Experience with batch and streaming frameworks, including Storm, NiFi, Apex, and Flink\n<br><br>\n-Experience with analytic databases, including Hive, Presto, and Impala\n<br><br>\n-Experience with multiple data modeling concepts, including XML and JSON\n<br><br>\n-Possession of excellent analytical and problem-solving skills\n<br><br>\n-Security+ or CISSP Certification\n<br><br>\nClearance\n<br><br>\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance is required.\n<br><br>\nWere an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.<br><br>SIG2017\n<br><br>"}