{"job title": "Data Scientist", "company": "Bose", "city state": "– US, MA - Framingham", "rating": "3.6", "job description": "<u><strong>Job Description</strong></u><br><br>At Bose, we're passionate engineers, developers, researchers, retailers, marketers … and dreamers. One goal unites us—to create products and experiences our customers simply can't get anywhere else.\n<br><br>\nBose is looking for an experienced data scientist to help understand how well our products perform in the field, across a wide set of customer use cases, and within in a complex ecosystem of 3rd party products, service providers and technologies.\n<br><br>\nAs a data scientist within Quality Assurance Engineering, you will leverage your expertise in building and tuning advanced analytics algorithms and models to measure the quality of our customers’ experiences.\n<br><br>\nIn addition to enabling analysts and engineers to leverage your models for their analysis, you shall also conduct targeted analysis, translating your findings into insights, and enabling decisions for both current and future products.\n<br><br>\nYou will also work closely with software development, IT, and product management teams, to help identify new data elements which could improve the detection and characterization of product experience issues.\n<br><br>\n<strong>Key Capabilities and Competencies</strong>\n<ul>\n\n<li>Expertise in developing, tuning, and deploying algorithms in ML, deep learning, probabilistic and statistical modeling and reasoning, and mathematical optimization</li>\n<li>Proficiency in data science software development using languages and frameworks such as Python, R, MATLAB, Tensorflow, and cloud machine learning engines</li>\n<li>Experience in working with big data frameworks such as Hadoop and Spark, cloud platforms such as AWS and GCP, visualization platforms such as Tableau, and SQL and other NoSQL databases.</li>\n<li>Passion for using data and insights to improve customer experiences and business outcomes, while helping people do their job better</li>\n<li>Appreciation for the sort of precision and excellence that Bose has always been known for in audio</li>\n\n</ul>\n<strong>Job Requirements</strong>\n<ul>\n\n<li>Master’s degree in computer science, business analytics, applied mathematics, statistics, engineering, economics, social sciences or related fields.</li>\n<li>7+ years of related experience in developing data analytics solutions for business applications using ML and AI technologies</li>\n<li>Proven track record of working with big data, as well as cloud-based delivery of solutions</li>\n</ul>\n\n<ul>\n\n<li>Strong business acumen, problem solving skills, and substantial operational experience</li>\n<li>Strong domain knowledge and a keen understanding of how to leverage IT and data analytics tools</li>\n<li>Excellent analytical, communication, organizational and presentation skills</li>\n<li>Previous experience with analysis of consumer electronics products a plus</li>\n\n</ul>\n\nBose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information."}