{"job title": "GAMMA - Machine Learning Engineer", "company": "Boston Consulting Group", "city state": "– New York", "rating": "4.2", "job description": "<div>\n <div>\n <p>Location:</p>\n <div>Boston, Chicago, Los Angeles, Montreal, New York, San Francisco, Seattle, Toronto, Washington, D.C.</div>\n </div>\n <div>\n <p>Geography:</p>\n <div>North America</div>\n </div>\n <div>\n <p>Capabilities:</p>\n <div>Big data &amp; advanced analytics, Technology &amp; digital</div>\n </div>\n <div>\n <p>Industries:</p>\n <div>Technology industries</div>\n </div>\n </div>\n\n <div>\n About Us\n <p>The Boston Consulting Group (BCG) is a global management consulting firm and the world’s leading advisor on business strategy. We partner with clients from the private, public, and not-for-profit sectors in all regions to identify their highest-value opportunities, address their most critical challenges, and transform their enterprises. Our customized approach combines deep insight into the dynamics of companies and markets with close collaboration at all levels of the client organization. This ensures that our clients achieve sustainable competitive advantage, build more capable organizations, and secure lasting results. Founded in 1963, BCG is a private company with more than 90 offices in 50 countries. For more information, please visit bcg.com</p>\n </div>\n\n <div>\n Practice Area Profile\n <div><div>BCG GAMMA combines innovative skills in computer science, artificial intelligence, statistics, and machine learning with deep industry expertise. The GAMMA team is comprised of world-class data scientists and business consultants who specialize in the use of advanced analytics to get breakthrough business results. Our teams own the full analytics value-chain end to end: framing new business challenges, building fact-bases, designing innovative algorithms, creating scale through designing tools and apps, and training colleagues and clients in new solutions. Here at GAMMA, you’ll have the chance to work with clients in every BCG region and every industry area. We are also a core member of a rapidly growing analytics enterprise at BCG – a constellation of teams focused on driving practical results for BCG clients by applying leading edge analytics approaches, data, and technology. </div></div>\n </div>\n \n \n \n <div>\n Role Profile\n <div><div><div><strong>OVERVIEW OF GAMMA ENGINEERING:</strong></div><div>The Gamma Engineering team is building the next generation of analytics tools. With your help, Gamma will develop a platform that fuels BCG Gamma‘s global data and analytics offerings. Data scientists depend on easy to use interfaces to easily code, increase productivity, answer questions, and envision their results. Clients need to easily interact with our analytics applications to measure the success of their new analytics enabled organization or quickly make decisions based on what and how they see analytic output. Our clients will use our analytics solutions to derive insights around business trends. We “open the doors“ to data for our clients giving them fast and trusted options to search, frame, and share data. Gamma X‘s goal is to help our clients understand what their data means and provide them the tools to share its narrative with various audiences. </div></div><br><p><strong>RESPONSIBILITIES:</strong></p><ul><li>Build Machine Learning based systems, tools, and services that serve as infrastructure for our internal and external clients</li><li>Responsible for inventing how we use technology, Machine Learning, and Data to enable the productivity of our clients</li><li>Help envision, build, deploy and develop our next generation of data engines and tools which will help our clients fundamentally transform their business</li><li>Bridge the gap between business and engineering, and functioning with deep expertise in both worlds.</li></ul></div>\n </div>\n \n \n <div>\n Your Qualifications\n <div><div><ul><li>Engineering Degree or Computer Science Degree (Bachelors or Masters)</li><li>3 to 5 years of experience in algorithms, data structures, and object-oriented programming</li><li>Good understanding of machine learning fundamentals and deep learning</li><li>Implementation experience in machine learning algorithms and applications</li><li>Knowledge of or experience in building production quality and large scale deployment of applications related to natural language processing and machine learning</li><li>Strong programming skills in at least one object oriented programming language (Java, Scala, C++, Python, etc.)</li><li>Fluency with at least one of the modern distributed ML frameworks such as TensorFlow, PyTorch,Caffe, MxNet</li><li>Familiarity with AWS/GCP/Azure technology stack</li><li>Fluency in English required</li></ul></div></div>\n </div>\n \n \n <div>\n <p>Date Posted:</p>\n <div>19-Sep-2018</div>\n </div>\n \n <div>\n <p>The Boston Consulting Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity / expression, national origin, disability, protected veteran status, or any other characteristic protected under national, provincial, or local law, where applicable, and those with criminal histories will be considered in a manner consistent with applicable state and local laws.\n <br>BCG is an E-Verify Employer. Click here for more information on E-Verify.</p>\n </div>"}