{"job title": "Data Scientist, Algorithms &amp; Data Systems", "company": "Boxy Charm", "city state": "– Pembroke Pines, FL", "rating": "3.2", "job description": "<strong><u>Summary</u></strong>\n<br><br>\nBoxy Charm is seeking a highly motivated individual responsible for driving intelligent solutions and recommendations for the company.\n<br><br>\nThe <strong>Data Scientist</strong> will use a range of data science and machine learning methodologies to build solutions for a variety of business initiatives. Additionally, the ideal candidate will be able to solve complex problems and apply those solutions within a cutting-edge cloud-based technology platform.\n<br><br>\nThe role will be filled with a solution-oriented candidate that thrives on working in a highly dynamic and engaging environment.\n<br><br>\n<strong><u>Essential Duties and Responsibilities</u></strong>\n\n<ul>\n<li>Work closely with different business units and translate high level business problems into actionable deliverables for the Data &amp; Algorithms team</li>\n<li>Work with a wide variety of data ranging between social media and email to customer transactions and logistics</li>\n<li>Develop a variety of machine learning models including customer recommendations, customer propensity, forecasting, and marketing performance.</li>\n<li>Collaborate closely with the Software Development and DevOps teams to ensure continued delivery of high quality data through our data processing pipeline</li>\n<li>Partner with various business stakeholders and implement solutions that improve their business process</li>\n<li>Conduct big data analysis using SQL, Python, Snowflake, Spark and other technologies</li>\n<li>Break down complex projects and problems into actionable tasks that be delivered quickly and iteratively and provide value to the business stakeholders</li>\n</ul>\n<strong><u>Key Understandings</u></strong>\n\n<ul>\n<li>Customer lifetime value, regression analysis, cohorts, retention, customer lifecycle, customer segmentation, machine learning, large-scale data analysis, classification and propensity modeling</li>\n</ul>\n<strong><u>Education and/or Experience</u></strong>\n\n<ul>\n<li>Bachelor's degree or higher in Computer Science, Math, Statistics or a related field</li>\n<li>3+ years of experience programming in languages such as Python, Java, Scala, Ruby, R</li>\n<li>3+ years of experience working with SQL and relational databases</li>\n<li>3+ years of experience with machine learning, statistical modeling, and data mining techniques</li>\n<li>Experience with one or more machine learning algorithms such as neural networks, regression, clustering etc.</li>\n<li>Working experience with machine learning technologies such as TensorFlow, Keras, ScikitLearn, H20.ai, MXNet, Caffe, Gluon etc. is highly desirable</li>\n<li>Experience working in an Agile (SCRUM, XP etc.) development environment</li>\n<li>Experience with AWS or other cloud environments is desirable</li>\n<li>Knowledge of Big Data and NoSQL systems such as Snowflake, Hadoop, Spark, MongoDB, etc. is a plus</li>\n</ul>"}