{"job title": "Data Scientist", "company": "BP", "city state": "– Denver", "rating": "3.5", "job description": "Role synopsis<br><br><strong>Data and Analytics Organization at BP Lower 48</strong>\n<br><br>\nThe Data Scientist will be intricately involved in running analytical experiments in a methodical manner, and will regularly evaluate alternate models via theoretical approaches.\n<br>\nThe role will participate in the team’s engagement with business stakeholders and partners with to enhance the existing analytics solutions and developing new solutions to business problems.\n<br>\nThe role requires a thought leader that will be instrumental in providing inputs to the Data Science &amp; Analytics Team for the design and building of predictive models and algorithms, exploratory data analysis, test design, statistical tests and measures, and business value measurement.<br><br>Key accountabilities \n<br>\n <div>\n\n<ul>\n<li>Evolve skills, solutions and the organization to predictive &amp; prescriptive analytics</li> <li>Reporting and visualizations development – using SSRS, Spotfire, PowerBI, realtime dashboarding, MI/BI and shallow analytics best practices.</li><li>Deliver quality analytic solutions, combining science with the software development process and challenging current data science trends with new ideas and alternative methods</li><li>Design and implement data analysis, data mining, research, analysis, and modeling strategies and best practices to internal clients</li><li>Ownership of the development and delivery of data science solutions from concept to production</li><li>Manages research targeted for innovations to solve business needs and technical challenges</li><li>Serve as the subject matter expert to articulate areas such as strategic, business and data analytics &amp; statistics, data science, big data, normalization and modeling</li><li>Initiates data science based solutioning with a focus on revenue growth and achievement of the business’ overall targets and objectives.</li><li>Responsible for the preparation of documentation, presentations, and scientific based papers to communicate ideas to business leaders and executives.</li><li>Personally, works on challenging fundamental data science issues where necessary, realizes, and develops solutions independently.</li> <li>In conjunction with Data Engineers, building and managing new data tables that support data collection, cross-functional data integration, data visualization, dashboards, predictive analytics, and data mining.</li><li>Leverages data science tools and techniques in analyzing large data-sets that will enable development of custom models and algorithms to uncover insights, trends, and patterns in the data, which will be useful in availing informed courses of action.</li><li>Create data science platforms to test and experiment with techniques inclusive of advanced analytics, behavioral modeling, and churn capitalizing on new data science approaches that can yield revenue for the business.</li><li>Responsible for the evaluation of analytics and machine learning technologies in use in the business and communicates findings to key stakeholders through reports and presentations.</li><li>Partners with other non-technical departments within the business assisting them in understanding how data science can benefit them and improve their effectiveness and performance.</li> <li>In collaboration with Data Engineers, Data Architects and Data Management, works closely with the IT department within the business for the purpose of facilitating easy and effective access to computing and data resources within the business.</li><li>Takes initiative and stays up to date with the latest data science trends, techniques, and best practices, determining how to incorporate the most suitable practices in the department.</li><li>Collaborative role with interaction with non-technical departments and, as such, will need to have exceptional communication skills in order to be able to tailor and convey technical messages in a clear and understandable manner, leading to business-wide improvement of data management, informed decision making, and ultimate improvement in performance.</li><li>Draw reports and presentations for Data and Analytics and key stakeholders to serve as valuable insights and aid in departmental decision making. These reports and presentation must, therefore, be clearly articulated, becoming clear, engaging, and convincing.</li><li>Selecting features, building and optimizing classifiers using machine learning techniques</li><li>Extending company’s data with third party sources of information when needed</li><li>Enhancing data collection procedures to include information that is relevant for building analytic systems</li><li>Leads by example demonstrating self-confidence, energy and enthusiasm</li><li>Work as part of geographically dispersed team, effectively communicating prioritized business unit needs and prioritized project statuses</li></ul></div>\n<br>\nEssential Education \n<br>\n <div>\n\n<ul>\n<li>A master’s degree (PhD preferred) in Statistics, Machine Learning, Mathematics, Computer Science, Economics, or any other related quantitative field.</li> </ul></div>\n<br>\nEssential experience and job requirements \n<br>\n <div>\n\n<ul>\n<li>3+ years of hands on experience in machine learning (supervised, unsupervised and ensemble methods), natural language processing; computer vision, deep learning experience is a bonus</li><li>Proven track record of developing, scaling and implementing these models in customer facing environments</li><li>Strong programming skills: R, Python, Java etc along with stellar visualization and persuasive story telling</li><li>Experience with big data, real-time streaming data and cluster computing environments</li><li>Knowledge and exposure to cloud technologies, Azure and/or AWS.</li></ul></div>\n<br>\nOther Requirements (e.g. Travel, Location)<br><br>N/A<br><br>Desirable criteria &amp; qualifications \n<br>\n <div>\n\n<ul>\n<li>Ability to lead others to draw conclusions from data and recommend actions</li><li>Ability to succeed in a fast-paced environment, deliver high quality performance on multiple, simultaneous strategic, value-added tasks and priorities</li><li>Relentless drive, determination, and self-learning ability</li><li>Highly organized and attentive to detail</li></ul></div>\n\n<br><strong><ul><li>Demonstrated use of IMPACT principles:</li>\n</ul>\n\n</strong>\n<br>\n<strong>I</strong> - Innovated: Learns from new ideas and applies solutions to add value.\n<br>\n<strong>M</strong> - Motivated: Overcomes obstacles with an intense desire to succeed.\n<br>\n<strong>P</strong> - Performance Driven: Makes value-based decisions involving measured risk to deliver business objectives.\n<br>\n<strong>A</strong> - Accountable: Takes responsibility and ownership of business performance.\n<br>\n<strong>C</strong> - Collaborative: Shares knowledge and works together for the good of L48.\n<br>\n<strong>T</strong> - Trustworthy: Keeps commitments, listens to others and authentically supports change necessary to achieve our Path to Premier. Relocation available<br><br>Negotiable<br><br>Travel required<br><br>Yes - up to 25%<br><br>Is this a part time position?<br><br>No<br><br>About BP<br><br>BP's US Lower 48 (L48) Onshore business operates across a vast US geography, from Texas north through the Rocky Mountains. The business manages a diverse portfolio which includes an extensive unconventional resource base of about 7.5 billion barrels of oil equivalent across 5.5 million gross acres in some of the largest and most well-known basins in the US. Headquartered in Houston (Texas), L48 employs about 1,700 people across six states, operates more than 9,600 producing wells and has 70,000 royalty owners. Our vision is to be the most respected and admired oil and gas company in the Lower 48 US states.\n<br><br>\nOur Wyoming operations are anchored on the giant Wamsutter tight gas field in the south central part of the state. In the San Juan area of Colorado and New Mexico we produce from tight gas sands and operate the largest coal-bed methane field in the US. Our Mid-Continent operations cover the prolific Anadarko, and is home to the famed East Texas basin, along with the Woodford shale gas play and Arkoma basin. We also have non-operating interests in over 10,000 wells across the US with substantial positions in both the Eagle Ford and Fayetteville shale basins.\n<br><br>\nIn 2015, the L48 Onshore is being established as a separate business within BP’s Upstream to manage its onshore oil and gas assets across the US onshore. This effort is being undertaken to improve competitiveness and help L48 remain at the forefront of innovation and development of technologies for unconventional resources.\n\n\n<ul>\n<li>LI-NOWRAP<br><br>Segment<br><br>Upstream<br><br>Closing Date<br><br>29-Sep-2018<br><br>Disclaimer </li>\n</ul>\n\nIf you are selected for a position in the United States, your employment will be contingent upon submission to and successful completion of a post-offer/pre-placement drug test (and alcohol screening/medical examination if required by the role) as well as pre-placement verification of the information and qualifications provided during the selection process. The drug screen requires a hair test for which BP must be able to obtain a sufficient hair sample for analysis (~4 cm/1 ½” scalp, or &gt; 2 cm/¾” body – arms &amp; armpits/legs/chest).\n<br><br>\nBP is an equal employment opportunity and affirmative action employer. View our policy statement.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\n<br><br>\nIf you are a US-based applicant or you are applying to a position in the US and you are an individual with disability or a disabled veteran, and would like any type of assistance to apply or to access or to attend any recruitment or selection event, system or process, we would like to help you to ensure that your application process goes as smoothly as possible. If you need assistance, information, or answers to your questions, and you are an individual with disability or a disabled veteran, feel free to contact us or have any of your representatives contact us at BP US Application Assistance BPUSApplicationAssis@bp.com,Telephone: 281.366.1999.\n<br><br>\nRead the Equal Employment Opportunity is the Law poster and the poster supplement - for more information about Equal Employment Opportunities. (Spanish version)\n<br><br>\nAn equal opportunity employer/disability/vet. \n<br>\n Eligibility Requirements<br><br>If you are applying for a position in the United States, you must be at least 18 years of age, legally authorized to work in the United States; and not require sponsorship for employment visa status (e.g., TN, H1B status), now or in the future."}