{"job title": "SIM Data Lead - Production/Data Science", "company": "BP Americas, Inc.", "city state": "– Houston, TX", "rating": "2.9", "job description": "<ul>\n<li>*94894BR**</li>\n<li>*Job title:**</li>\n</ul>\n\nSIM Data Lead - Production/Data Science\n\n\n<ul>\n<li>*Segment:**</li>\n</ul>\n\nUpstream\n\n\n<ul>\n<li>*Role synopsis:**</li>\n</ul>\n\nThe Data Lead Production provides leadership in terms of technical expertise, digital innovation and data management support to the GoM and Canada region. They provide day-to-day technical leadership to a production data team and work closely with both end users and the Subsurface Information Management (SIM) team to support current operations and use data science to pursue opportunities to gain further insights from GoM and Canada data. They also work with an expansive group of cross-functional stakeholders and external vendors to integrate data solutions and delivery of production data domain projects (i.e., Palantir and Foundry improvements, Honeywell PHD and OSIsoft PI uses).\n<br><br>\nThe Data Lead Production is a technical leadership role for those who have a passion for data and a zeal to unlock and use that data to inform business decisions.\n\n\n<ul>\n<li>*Req ID:**</li>\n</ul>\n\n<strong>94894BR</strong>\n\n\n<ul>\n<li>*Location:**</li>\n</ul>\n\nUnited States - Texas - Houston\n\n\n<ul>\n<li>*Is this a part time position?:**</li>\n</ul>\n\nNo\n\n\n<ul>\n<li>*Relocation available:**</li>\n</ul>\n\nNo\n\n\n<ul>\n<li>*Travel required:**</li>\n</ul>\n\nNo\n\n\n<ul>\n<li>*Key accountabilities:**</li>\n<li>*IMPROVEMENT OF INFORMATION AND MANAGEMENT OF DATA**</li>\n</ul>\n\n+ Actively seeking to improve data quality, automate and simplify workflows and processes\n<br><br>\n+ Creating innovative solutions to improve process, workflow, best practice and service delivery\n<br><br>\n+ Challenging conventional thinking, problem solving and innovating\n<br><br>\n+ Actively seeking to apply data science techniques; automation and machine learning, including the use of analytical and visualisation tools to translate data and interpreted results into actionable insights and value.\n\n\n<ul>\n<li>*EFFICIENT OPERATIONAL SUPPORT FOR SUBSURFACE, GWO AND REGIONAL TEAMS**</li>\n</ul>\n\n+ Acting as a Data Domain Lead (with or without direct reports) or Team Lead (with direct reports) within a region or function\n<br><br>\n+ Assisting the Region/Function SIM coordinating, supervising and leading day to day activities and identifying development opportunities for team members\n<br><br>\n+ Assisting Region/Function SIM to monitor and manage the service delivery, performance management and compliance\n<br><br>\n+ Planning, delivering and managing elements of projects on behalf of the Region/Function SIM and SIM Global Domain Lead\n<br><br>\n+ Preparing digital and physical data for use in upstream and subsurface workflows and technical systems, as well as managing the receipt and distribution to and from third parties, e.g. partners, contractors and regulatory authorities\n<br><br>\n+ Reformatting of digital data using scripting and tools\n<br><br>\n+ Analysing, modelling or mapping subsurface and upstream data using technical applications, analytical tools and technologies\n<br><br>\n+ Coordinating, managing and administering data and information within a variety of technical applications and tools\n<br><br>\n+ Managing contractor work and delivery, including monitoring their budgets and service level agreements (SLAs)\n<br><br>\n+ Actively using analytical tools and technologies e.g. Spotfire, Excel, Matlab, Python, SQL, R, Relational databases etc., and identifying opportunities for their use\n\n\n<ul>\n<li>*BETTER ACCESS TO TRUSTED INFORMATION AND DATA**</li>\n</ul>\n\n+ Identifying, championing and performing data improvement initiatives\n<br><br>\n+ Resolving data management, migration, integration, technical and data quality issues\n<br><br>\n+ Administering access to project and master data stores\n<br><br>\n+ Ensuring data is correctly loaded to project and master data stores, accurately catalogued and metadata captured\n<br><br>\n+ Ensuring key information is captured when data is archived\n\n\n<ul>\n<li>*PROCESS AND STANDARDS**</li>\n</ul>\n\n+ Leading efforts to deliver, implement and embed global and domain strategies, workflows, processes and solutions in a team or region\n<br><br>\n+ Ensuring compliance with safety, legal, regulatory, security and governmental guidelines\n<br><br>\n+ Accurately documenting data processes, standards &amp; workflows\n\n\n<ul>\n<li>*COMMUNICATION AND ENGAGEMENT**</li>\n</ul>\n\n+ Leading by example and exhibiting BP values and behaviours\n<br><br>\n+ Providing technical leadership or guidance as a specialist in one or more specific data domains or areas of expertise (i.e. Exploration, Geophysics, Geology, Geospatial, Reservoir, Production, Data Science, Physical Data, Documents, Information and Knowledge Management, Strategy, Performance etc.)\n<br><br>\n+ Creating clear, concise, high quality communications and presentations\n<br><br>\n+ Actively engaging with the team to make complex decisions &amp; solve complex problems\n<br><br>\n+ Encouraging peers to contribute new ideas and creative solutions\n<br><br>\n+ Actively participating, contributing or leading relevant Community of Practice (CoPs) or Communities of Interest (CoIs)\n<br><br>\n+ Actively sharing knowledge and best practices globally\n<br><br>\n+ Being an active member of relevant professional and industry bodies to develop deeper domain knowledge &amp; broaden expertise\n<br><br>\n+ Participating in industry events, bringing knowledge and information back to the SIM and Global Data Domain community\n<br><br>\n+ Engaging and effectively managing stakeholders\n<br><br>\n+ Managing and building relationships with external parties, partners, IT&amp;S, contractors and regulatory authorities\n<br><br>\n+ Communicating and promoting the purpose and benefits of information and data management within Upstream and Subsurface\n\n\n<ul>\n<li>*Essential Education:**</li>\n</ul>\n\nDegree (or higher) in relevant field and/or 10-15 years of experience working with data within the Upstream Oil &amp; Gas industry\n\n\n<ul>\n<li>*Desirable criteria and qualifications:**</li>\n</ul>\n\n+ Ability to supervise, mentor, train and inspire technical staff\n<br><br>\n+ Proven ability to network externally to keep current with technology and best practices\n<br><br>\n+ Ability to set and achieve challenging goals for self and others\n<br><br>\n+ Ability to facilitate the flow of ideas, creative solutions and feedback across the team from Challenger to Senior Management level\n<br><br>\n+ Ability to encourage and embed change in a team or a region\n\n\n<ul>\n<li>*About BP:**</li>\n</ul>\n\nWe are a global energy business involved in every aspect of the energy system. We have 75,000 employees in 80 countries, working towards delivering light, heat and mobility to millions of people, every day. We are one of the very few companies equipped to solve some of the big complex challenges that matter for the future. We have a real contribution to make to the world's ambition of a low carbon future. Join us, and be part of what we can accomplish together.\n<br><br>\nBP is one of the world's leading international oil and gas companies. Through our work we provide customers with fuel for transportation, energy for heat and light, lubricants to keep engines moving, and the petrochemicals products used to make everyday items as diverse as paints, clothes and packaging. Our objective is to create value for shareholders and supplies of energy for the world in a safe and responsible way. We strive to be a safety leader in our industry, a world-class operator, a responsible corporate citizen and a good employer.\n<br><br>\nOur Upstream segment is responsible for our activities in oil and natural gas exploration, field development and production, and midstream transportation, storage and processing.\n<br><br>\nAt the same time, we?re investing in the talents of the 20,000 people who work to make these activities a reality.\n\n\n<ul>\n<li>*Application close date:**</li>\n</ul>\n\n29-Nov-2018\n\n\n<ul>\n<li>*Sub-category:**</li>\n</ul>\n\nSubsurface Technologist\n\n\n<ul>\n<li>*Job category:**</li>\n</ul>\n\nSubsurface\n\n\n<ul>\n<li>*Countries (State/Region):**</li>\n</ul>\n\nUnited States - Flexible, United States - Texas\n\n\n<ul>\n<li>*Disclaimer:**</li>\n</ul>\n\nIf you are selected for a position in the United States, your employment will be contingent upon submission to and successful completion of a post-offer/pre-placement drug test (and alcohol screening/medical examination if required by the role) as well as pre-placement verification of the information and qualifications provided during the selection process. The drug screen requires a hair test for which BP must be able to obtain a sufficient hair sample for analysis (~4 cm/1 ?? scalp, or &gt; 2 cm/?? body ? arms &amp; armpits/legs/chest)\n<br><br>\nAs part of our dedication to the diversity of our workforce, BP is committed to Equal Employment Opportunity. Applicants will receive consideration for employment without regard for race, color, gender, religion, national origin, disability, veteran status, military status, age, marital status, sexual orientation, gender identity, genetic information or any other protected group status. We are also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us or have one of your representatives contact us at BPUSApplicationAssis@bp.com or by telephone at 281.366.1999.\n<br><br>\nRead the Equal Employment Opportunity is the Law poster and the poster supplement - for more information about Equal Employment Opportunities. ( Spanish version )\n<br><br>\nBP is an equal employment opportunity and affirmative action employer. View our policy statement .\n\n\n<ul>\n<li>*Essential experience and job requirements:**</li>\n</ul>\n\nIn supporting the Production/Data Science domains, the following elements of domain knowledge, understanding and experience shall be evident:\n\n\n<ul>\n<li>*Production**</li>\n</ul>\n\n+ Understand and improve end-to-end Upstream Production data types, data flow and lifecycle, Upstream architecture and base management toolkit\n<br><br>\n+ Monitor Production data conformance and quality within Upstream databases and data platforms using visulisation and analytical tools, identifying and fixing errors and inconsistencies\n<br><br>\n+ Define and implement data requirements and data standards for Upstream Production data, communicate requirements to IT&amp;S and Data Lake and manage stakeholder relationships\n<br><br>\n+ Manage relational databases, undertaking simple database queries (Access, SQL), utilising analytical tools to visualise trends and production performance\n<br><br>\n+ Integrate Upstream Production data from different sources, creating derived data sets to deliver analytical insights and automate workflows\n\n\n<ul>\n<li>*Data Science**</li>\n</ul>\n\n+ Basic Data Science workflow, basic use of visualisation tools (PowerBI, Spotfire) and simple database querying (Excel)\n<br><br>\n+ Simple programming code used to analyse data (Python, R, Matlab) and the use of basic mathematical and statistical analysis/techniques\n<br><br>\n+ Programming code used to analyse and manipulate data, the ability to wrangle data and apply basic machine learning, modelling and Big Data &amp; analytical techniques.\n<br><br>\n+ Advanced machine learning and program code (Java/C#, SQL) used to analyse, manipulate data and develop trends and insights and advanced use of visualisation tools; development of dashboards and advanced data analysis\n<br><br>\n+ Planning Data Science activities. The use of Cloud technologies (Azure, AWS, Delphi), the Data Lake, adoption of Big Data &amp; Analytical tools and the provision of data science products and solutions\n\n\n<ul>\n<li>*Other Requirements (eg Travel, Location):**</li>\n</ul>\n\nHouston/Flexible. Preference for Houston-based, but could work remotely with periodic domestic travel to Houston.\n\n\n<ul>\n<li>*Eligibility Requirements:**</li>\n</ul>\n\nIf you are applying for a position in the United States, you must be at least 18 years of age, legally authorized to work in the United States; and not require sponsorship for employment visa status (e.g., TN, H1B status), now or in the future."}