{"job title": "Data Science Lead", "company": "Bread", "city state": "– New York City, NY, US", "rating": "5.0", "job description": "Bread makes essential purchases affordable to regular people. We transform pricing in e-commerce: The $1,000 couch you’re looking at might become a $50/month charge. Clear, transparent terms with fair rates. We treat our customers with dignity with clear and transparent products.<br><br>\nTo enable this vision, we have enormous and engaging analytical challenges. We instantaneously approve and price credit products, predict fraud and customer’s propensity and preferences using predictive tools and logical criteria while providing a seamless and frictionless consumer experience all in real time.\n<br><br>\nWe are looking for an experienced modeler/data scientist to join the Risk team to build out our model suite and decisioning tools. Reporting to the CRO, you will have a hands-on role in all aspects of modeling from exploring new data sources, feature engineering, adopting new model specifications, implementations to managing model performance and quality on an on-going basis.\n<br><br>\n<strong>Things you will do:</strong>\n<br><br>\nFirst and foremost build models and predictive tools that answer actual questions to make Bread be and do better in a measurable fashion\n<br>\nCreate and execute a strategic roadmap for risk decision science\n<br>\nInvestigate new data sources, design model specifications and own model development cycle end-to-end\n<br>\nManage model inventory, performance thresholds, development cycle, and implementation and execution excellence\n<br>\n<strong>Requirements</strong>\n<br><br>\n5+ years of experience in building high-performing models with concentration in credit/fraud risk models preferred\n<br>\nHands-on experience and familiarity with machine-learning techniques, statistics, and optimization\n<br>\nAbility to work with cross-functional teams, implement models, thought leadership to drive decision science infrastructure\n<br>\nHave the drive and desire to innovate and experiment to continuously improve and leap-frog and have enough experience to know what can be done without and what cannot s\n<br>\nNative in R, Python, SQL or similar\n<br>\nIf this is you, submit a cover letter and resume to apply!"}