{"job title": "Data Scientist", "company": "BRIDGES Inc.", "city state": "– Hanover, MD", "rating": "NA", "job description": "Job Description<div>Our new data scientist will be fluent in data analysis techniques, cloud computing, AI platforms, and various other technologies. You will be working on projects within a fast-paced workspace that needs new ideas constantly. This position REQUIRES innovative thinkinking.\n<br><br>\nWith the passion to make an impact, BRIDGES solves national security vulnerability challenges using cyber intelligence. In today’s cyber battleground, our team of elite experts makes BRIDGES an industry pacesetter and agile innovator that delivers success as a trusted partner.\n<br><br>\nWe are hiring top talent for a rapid growth trajectory while maintaining our culture and values of commitment, integrity, respect, and courage. Within the BRIDGES family, our employees are our first priority. We offer best-in-class compensation and benefits, a collaborative atmosphere, and opportunities to develop and advance...and we have fun!\n<br><br>\nCulture matters every day at Bridges, and diversity/inclusion are rooted in our core values and beliefs. All employees are valued for their unique talents. Weaving together differing individual perspectives, traditions, and experiences, creates the rich, strong, and beautiful fabric that is our company. Hence, Bridges is committed to providing equal employment opportunities to all employees and applicants for employment, and we prohibit discrimination and harassment of any type without regard to race, color, religion, age, gender, marital status, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n<br><br>\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</div>"}