{"job title": "Digital Solutions Data Scientist", "company": "Bridgestone Americas", "city state": "– Akron, OH", "rating": "3.4", "job description": "<ul>\n<li>Builds new predictive/descriptive models, evaluate current effectiveness of old models, design experiments/campaigns and analyze the resulting data, perform post-hoc (correlational) analysis when experimental designs (causational analyses) are not feasible and explains the limitations of the results, advises analytical data programmers on quality and infrastructure needs/challenges, etc.</li><li>Write code intended for automation of tasks.</li><li>Perform a few of these types of analysis depending on capability to satisfy the need of the organization and project:</li>\n\n<ul>\n<li>Sample Selection / Stratification</li><li>Experimental Design</li><li>Categorical Data Analysis</li><li>Linear Regression</li><li>Non-Parametric Analysis</li><li>Multivariate Analysis</li><li>Time Series Analysis</li><li>Forecasting</li><li>Optimization</li><li>Simulation Models</li><li>Decision Trees</li><li>Heuristic Models</li><li>Algorithmic Models</li>\n</ul>\n\n<li>Translating analytical results, presenting to manager level and below, and making recommendations for improvements in the areas of application</li><li>Create and present technical results to business managers.</li><li>Creates technical documentation of basic analyses.</li><li>Identifies and works with other analysts and engineers on data preparation issues (such as missing values and invalid data)</li><li>Applies basic techniques for handling interactions with limited involvement from other analysts and engineers</li><li>Perform medium scale statistical analysis or medium scale modeling projects independently or in collaboration with other analysts and engineers.</li><li>Depending on prior roles, may require formal training in some topical areas.</li><li>Partner with more experienced analysts and engineers on large scale modeling projects.</li><li>Technically supervising, mentoring, coaching, and training other analyst and engineers on advanced statistical techniques and how to apply them to business problems</li></ul>\n\n<ul>\n<li>MS degree in Analytics, Statistics, or Mathematics fields and 2-4 years of Analytics experience, or industry experience equivalent.</li> <li>Expertise acquired through prior experience in applying statistical/mathematical techniques in 1 or more business units/focus areas (R&amp;D, Operations, Supply Chain, Pricing, Marketing, Credit Risk management).</li><li>Able to analyze technical data using 2 or more of the Statistical/Mathematical Specialties below:\n\n<ul>\n<li>Sample Selection / Stratification</li><li>Experimental Design</li><li>Categorical Data Analysis</li><li>Linear Regression</li><li>Non-Parametric Analysis</li><li>Multivariate Analysis</li><li>Time Series Analysis</li><li>Forecasting</li><li>Optimization</li><li>Simulation Models</li><li>Decision Trees</li><li>Heuristic Models</li><li>Algorithmic Models</li></ul></li>\n<li>Intermediate Statistical ability, able to apply techniques as appropriate for medium data sets with </li><li>Must be a proficient storyteller able to explain complicated statistical analyses, techniques, and results to non-statistical audiences of Director-level Executives and below.</li><li>Capable of working and communicating directly with Manager-level and below to scope the technical needs of medium scale, medium-value projects and ad-hoc analyses.</li><li>Capable of assisting in the technical supervision and training of other analysts / data scientists / engineers</li><li>Capable of writing basic technical documents of small analytics without assistance.</li> \n</ul>\n*GLASSDOOR\n<br><br>\n*indeed\n<br><br>\n*indeed\n<br><br>\nDesign, develop, and launch next-generation digital technologies for Bridgestone. Join us in a collaborative and hands-on team environment that fosters engineering excellence, creativity, and innovation with a focus on automotive and tire performance prediction.\n<br><br>\nThis teammate will perform and lead medium scale advanced statistical analysis with moderate supervision. This data scientist performs the analyses while also teaching less experienced data scientists and engineers in those and other techniques as applicable. This role will also require effective communication on multiple levels, using highly technical language with other engineers/scientists and translating technical results clearly and effectively for Manager-Level and below teammates. Despite this being a technical role, this teammate’s business skills are high enough to develop professional relationships with managers outside of the group that instill trust in the methodologies. Performs primarily medium scale statistical analyses or medium scale modeling projects independently."}