{"job title": "Data Scientist", "company": "Bright Cellars", "city state": "– Milwaukee, WI", "rating": "2.9", "job description": "<div><div>Bright Cellars (www.brightcellars.com) is the monthly wine subscription startup designed to help new wine drinkers discover and define their taste in wine! We curate wines from around the world with the goal of making wine fun, accessible, and educational.</div><div><br></div><div>How Bright Cellars works: Our members join the Bright Cellars club by taking a short quiz to share their taste preferences. The Bright Cellars learning algorithm evaluates these preferences to predict four bottles of wine matched to each member’s taste. Each month, our members receive four unique bottles in the mail and log on to our site to provide personalized feedback. Similar to Pandora, the Bright Cellars algorithm uses this feedback to improve monthly matches going forward. </div><div><br></div><div>Bright Cellars is a fun, fast-growing startup with a work hard, play hard attitude. We look for smart, motivated individuals who are excited to build something incredible from the ground up. </div></div><div><div>What you'll do<ul><ul><li>Build new data science processes from the ground up</li><li>Identify and implement industry best practices </li><li>Test hypotheses and effectively communicate results to both technical and non-technical audiences</li><li>Turn unstructured problems into robust technical solutions</li><li>Extract business insights from our data sets</li><li>Design and evaluate data platforms</li><li>Work cross functionally to identify business problems and assist in creating data-enabled solutions</li><li>Collaborate with our software team to build and implement scalable algorithmic systems</li></ul></ul></div></div><div><div>Who you are<ul><ul><li>Experience in data science or a related field, such as math or statistics</li><li>Strong skills in statistics, probability, and/or machine learning</li><li>Experience in training and deploying models</li><li>Fluent in at least one scripting language, such as R or Python</li><li>Experience with relational databases (e.g. MySQL)</li><li>Skill in data gathering, cleaning, and visualization</li><li>Self-driven and autonomous</li></ul></ul></div></div><div><div>Benefits<ul><ul><li>Flexible hours</li><li>Unlimited paid vacation and sick days</li><li>Bike rack and subsidized parking</li><li>Covered medical, dental, and vision insurance</li><li>Fully stocked breakfast, snack, and wine bar</li><li>Weekly wine tastings led by our co-founder and resident sommelier </li><li>Relaxed dress code</li><li>A fun, friendly office atmosphere in our brand new office space in the heart of Milwaukee’s Third Ward</li><li>Unlimited access to Ward4’s co-working space</li><li>Opportunity to build something incredible while being surrounded by intelligent, hardworking and motivated coworkers</li></ul></ul></div></div>"}