{"job title": "Senior Data Analyst", "company": "Brightree", "city state": "– GA, United States", "rating": "3.5", "job description": "<div>\n<div>\n<div><strong>Sr. Data Analyst</strong> </div><br>\n\n<div>Seeking a rewarding position in the rapidly expanding healthcare and technology solutions space? Join us at Brightree as a Senior Data Analyst reporting to the Director, Data Services.</div>\n\n<br><strong></strong><div><strong>Who we are:</strong>\n<br>\nBased just outside of Atlanta, Brightrees team of more than 600 employees is thinking, creating and challenging ourselves to better serve our patients and customers. Each day is a new day for ground-breaking ideas and unparalleled opportunity. Ours is a culture focused on what we can accomplish today, and where it can lead us tomorrow.</div><br>\n\n<div>\n<strong>Why work at Brightree?</strong>\n<br>\nWe have vision. Were a team of thinkers and innovators who constantly challenge ourselves to do everything better than the day before, so that people around the world can breathe easier.</div><br>\n\n<div>\nWe are an exciting and fast paced company looking for individuals who are passionate about technology, who will help drive world class customer support for Brightrees suite of healthcare software solutions.</div><br>\n\n<div><strong>Who we are looking for:</strong></div><div>As part of the Data Services team, Sr. Data Analyst - Reporting will be responsible for all Reporting needs for our parent company, Resmed. The individual may also support other data related tasks and activities. The individual will analyze and interpret data to offer recommendations based on the analysis. They will be expected to work closely with External Clients as well as Internal stakeholders to understand issues affecting the customers and make recommendations to assist them. The right candidate will have an expert level knowledge of SQl Server with particular emphasis on Store Procedures and SSIS packages. In addition, the candidate will have the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracy. Most importantly, the ideal candidate will be a creative thinker with a willingness to go the extra mile in order to satisfy the customers needs and assist them in whatever way possible.</div><br>\n\n<div><strong>What youll do:</strong> </div>\n\n\n<ul>\n\n\t<li>Work directly with Resmed associates to identify metrics and interpretation needed in deliverables.</li>\n\n<li>Partner with stakeholders to understand new report/data requirements to ensure results meet the business needs.</li>\n\n<li>Work directly with Brightree customers to interpret their requirements to design and implement solutions.</li> \n\n<li>Have an expert level understanding of SQL and stored procedures. Make modification to existing Stored Procedures. Will also be required to define new store procedures and SSIS packages.</li>\n\n<li>Create solutions that allow capture of existing data into useable Brightree data formats. Create Solutions to Extract the Data out of Brightree and Report on it.</li>\n\n<li>Mentor Data Analysts on the Data Services team.</li>\n\n<li>Communicate and consult with key accounts and customers in non-technical language.</li>\n\n<li>Be cognizant of the customers expectations on timelines and work diligently towards achieving that goal.</li>\n</ul>\n\n<div><strong>About you:</strong> </div>\n\n\n<ul>\n\n\t<li>Self-motivated with a focus on driving results and a strong sense of accountability.</li>\n\n<li>Advanced analytical and problem-solving skills as well as the ability to communicate ideas and opportunities to stakeholders in non-technical language.</li>\n\n<li>Strong verbal and written communication skills; strong organizational skills</li>\n\n<li>Strong project management skills</li>\n\n<li>Ability to work in a continually changing, customer-focused environment and to be simultaneously accountable to multiple peer team members</li>\n</ul>\n\n<div><strong>About your experience:</strong> </div>\n\n\n<ul>\n\n\t<li>Must have a Bachelors degree in Computer Science, Engineering, MIS or related field required; MS a plus</li>\n\n<li>Must have minimum of 8 years of SQL Server skills at an expert level.</li>\n\n<li>Expertise and past experience in Software Development</li>\n\n<li>Experience executing on pre-built SSIS/DTS packages to check data and migrate data to/from data staging tables in SQL</li>\n\n<li>Experience with ETL process and concepts</li>\n\n<li>Must be able to write select, update, delete, and insert statements with multiple table joins</li>\n\n<li>Able to balance multiple high-priority deliverables</li>\n\n<li>Equivalent combination of education and experience will be considered</li>\n</ul>\n\n<div><strong>EEO Statement</strong> </div><br>\n\n<div>Brightree LLC provides equal opportunity for all applicants without regard to race, color, religion, sex (including pregnancy), national origin, ancestry, age, disability, genetic information, marital status, sexual orientation, veteran status, or any other basis protected by state or federal law.</div></div>\n</div>\n<br>"}