{"job title": "Senior Data Scientist", "company": "Brighthouse Financial", "city state": "– Charlotte, NC", "rating": "3.9", "job description": "Brighthouse Financial is a new company established by MetLife. We’re on a mission to help people achieve financial security. Built on a foundation of industry knowledge and experience, we specialize in offering essential annuity and life insurance products designed to help customers protect what they’ve earned and ensure it lasts more predictably. In an industry that often has a reputation for complexity, confusion, and cost, Brighthouse Financial is different. Our approach includes simplicity, transparency, and more value so customers can face the future with confidence.\n<br><br>\nBrighthouse Financial is seeking passionate, high-performing team members to help us carry out our mission and be part of an exciting journey toward improving the financial futures of our millions of customers. Sound like you? Read on.\n<br><br>\n<strong><u>Role Value Proposition:</u></strong>\n<br><br>\nData Scientists in Brighthouse Financial’s Data Science organization work closely with cross-­functional teams in marketing, distribution, actuarial, product and other functions, leverage Brighthouse Financial’s rich datasets to develop and deliver propensity models and data-­driven insights, and ultimately drive Brighthouse Financial’s top line growth. A successful candidate will be passionate about finding insights in data and using quantitative analysis to answer complex questions, with a collaborative and resourceful style.\n<br><br>\n<strong><u>Key Responsibilities:</u></strong>\n<ul>\n<li>Conduct research using Hadoop and other data platforms along with the relevant programming / statistical package (such as R or Python) for large-scale problem solving</li><li>Works independently and possesses exceptional technical ability.</li><li>Understand complex business challenges, develop hypotheses, convert into the right analytical problems, and communicate the results back to the partner teams with limited or no analytical background to drive the business strategy</li><li>Analyze internal / external, online / offline, and structured / unstructured data such as speech analytics, digital footprints, financial information, proprietary market research and secondary sources to identify insights</li> <li>Conducts business analytics projects for multiple departments.</li><li>Partners with other operational areas to identify opportunities for new projects.</li><li>Builds strong working relations and improves workflow and organizational issues.</li><li>Handles and resolves questions and issues referred by junior staff members.</li><li>May propose, evaluate and implement process improvements to increase efficiency and effectiveness.</li><li>May identify, locate and provide needed training and resources.</li><li>Performs other duties as required or assigned.</li>\n</ul>\n<strong><u>Essential Business Experience and Technical Skills:</u></strong>\n<ul>\n<li>Doctoral degree in a technical field and two-three years of related work experience, or a Master’s degree in a technical field and at least 3-4 years of related work experience, or a Bachelor’s degree in a technical field and at least 8-10 years of related work experience.</li><li>Significant professional experience required applying quantitative analysis and modeling to solving real-world business problems including experience in model validation, testing and deployment</li><li>Demonstrated proficiency in Python/PySpark required</li><li>Demonstrated ability to perform high quality work both independently as leading a team of data scientists and data engineers</li><li>Excellent oral and written communication skills, including the ability to explain complicated quantitative concepts to non-­technical stakeholders using effective story telling techniques and visualization</li><li>Ability to translate business requirements into detailed analysis plans.</li><li>Ability to prioritize requests to meet the most important and urgent business needs</li><li>Working knowledge of insurance industry is a plus</li><li>Prior exposure to financial services or insurance industry preferred</li>\n</ul>\n<strong><u>Travel</u></strong>\n<br><br>\nN/A"}