{"job title": "Data Engineer", "company": "Brighthouse Financial", "city state": "– Charlotte, NC", "rating": "3.9", "job description": "Brighthouse Financial is a new company established by MetLife. We’re on a mission to help people achieve financial security. Built on a foundation of industry knowledge and experience, we specialize in offering essential annuity and life insurance products designed to help customers protect what they’ve earned and ensure it lasts more predictably. In an industry that often has a reputation for complexity, confusion, and cost, Brighthouse Financial is different. Our approach includes simplicity, transparency, and more value so customers can face the future with confidence.\n<br><br>\nBrighthouse Financial is seeking passionate, high-performing team members to help us carry out our mission and be part of an exciting journey toward improving the financial futures of our millions of customers. Sound like you? Read on.\n<br><br>\n<strong><u>Role Value Proposition:</u></strong>\n<br><br>\nThe Data &amp; Analytics have a mission to use big, alternative and directly sourced data to describe and predict key metrics of companies and economies so that we may deliver innovative data solutions and insights to our internal analyst teams and the firm's clients. We are looking for self-starting and innovative data engineers to join and grow our team. You must have a keen interest in financial markets and experience with modern tools and methods, including processing data at large scale for analytical purposes.\n<br><br>\n<strong><u>Key Responsibilities:</u></strong>\n<ul>\n<li>Build data pipeline frameworks to automate high-volume and real-time data delivery for our Hadoop and research data hub</li><li>Build data APIs and data delivery services that support critical operational and analytical applications for our internal business operations, customers and partners</li><li>Transform complex analytical models into scalable, production-ready solutions</li><li>Continuously integrate and ship code into on premise and cloud Production environments</li><li>Develop applications from ground up using a modern technology stack such as Scala, Spark, Postgres, Angular JS, and NoSQL</li><li>Develop sustainable data driven solutions with current new gen data technologies to meet the needs of our organization and business Customers</li><li>Grasp new technologies rapidly as needed to progress varied initiatives</li><li>Break down data issues and resolve them</li><li>Build robust systems with an eye on the long-term maintenance and support of the application</li><li>Leverage reusable code modules to solve problems across the team and organization</li><li>Utilize a working knowledge of multiple development languages</li>\n</ul>\n<strong><u>Essential Business Experience and Technical Skills:</u></strong>\n<ul>\n<li>Master's Degree and or equivalent work experience.</li><li>Expert level experience in designing, building and managing applications to process large amounts of data in a Hadoop ecosystem</li><li>Extensive experience with performance tuning applications on Hadoop and configuring Hadoop systems to maximise performance</li><li>Experience building systems to perform real-time data processing using Spark Streaming and Kafka, or similar technologies</li><li>Experience with common SDLC, including SCM, build tools, unit testing, TDD/BDD, continuous delivery and agile practices</li><li>Experience working in large-scale multi tenancy Hadoop environments;Hadoop, HDFS, AVRO, MongoDB, or Zookeeper</li><li>Strong software development experience in Scala and Python programing languages; other functional languages</li><li>Experience with Unix-based systems, including bash programming</li><li>Experience with other distributed technologies such as Cassandra, Solr/ElasticSearch, Flink, Flume would also be desirable</li>\n</ul>\n<strong><u>Travel:</u></strong>\n<br><br>\nNone"}