{"job title": "Senior Data Analyst", "company": "Brilliant Corners", "city state": "– Los Angeles, CA", "rating": "3.2", "job description": "<strong>Organization Overview</strong>\n<br>\nFounded in 2004, Brilliant Corners provides innovative housing and housing-related services to those transitioning from or at risk of homelessness or institutionalization. We develop, own, and manage multi-family supportive housing and licensed residential care homes. Additionally, we implement a broad array of scattered-site, one-on-one supportive housing, and clinical case management programs through partnerships with developmental services, homeless services, veteran services, and health care sectors.\n<br><br>\nIn short, we do good work.\n<br><br>\nWe have offices statewide with a staff of passionate people. While we are growing rapidly, we are also selective: We're seeking inspired, talented people who want to be part of a team effecting profound change and who have fun doing it.\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nThe Sr. Data Analyst will be responsible for the development, testing, implementation, and maintenance of ad-hoc and recurring reports as well as dashboards and other business intelligence applications that utilize the underlying data stores for internal and external use. Working with cross-functional teams, the Report Developer will thoroughly analyze and clarify report requirements, make recommendations, and educate when necessary to meet business needs. They will also be responsible for creating and maintaining internal control tools and reference materials.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n<strong><em>Data Analysis</em></strong>\n\n<ul>\n\n\t<li>Work with management to prioritize business and information needs, such as process and performance indicators across the organization</li>\n\n<li>Acquire data from primary or secondary data sources and assist in the on-going optimization and maintenance of databases/data systems</li>\n\n<li>Locate and define new process improvement opportunities, particularly in the areas of data definition/coding, data collection and data quality</li>\n\n<li>Interpret data, analyze results using statistical and geographic techniques and provide ongoing reports</li>\n\n<li>Identify, analyze, and interpret trends or patterns in complex data sets</li>\n\n<li>Develop and maintain any necessary reference materials, such as data dictionaries, code books, and report specifications</li>\n</ul>\n<strong><em>Data Visualization</em></strong>\n\n<ul>\n\n\t<li>Develop business intelligence dashboards for staff across the organization</li>\n\n<li>Automate ETL process to ensure all end users have seamless access to current, actionable information</li>\n\n<li>Combine/Integrate data across multiple sources/platforms as required by business users</li>\n\n<li>Use a design thinking approach to deliver data visualizations that are useful, clear and insightful, given the intended audience(s)</li>\n</ul>\n<strong>Mindsets</strong>\n<br><br>\n<strong><em>You bring your A game to work.</em></strong> You inspire a culture of excellence and take pride in doing whatever it takes for our clients and partners. You believe that it's a reflection on you, your work, and the organization you represent.\n<br><br>\n<strong><em>You're a people person.</em></strong> You invest in relationships and love to cultivate the talents of the people around you. You are the cheerleader for your team. You enjoy providing great customer service.\n<br><br>\n<strong><em>You thrive in an entrepreneurial environment.</em></strong> You're resourceful and at ease with ambiguity and rapid change. You possess a positive, can-do attitude, and are adept at identifying creative solutions that turn challenges into opportunities. You can handle many important responsibilities at once and you're rigorous about prioritization.\n<br><br>\n<strong>KNOWLEDGE, SKILLS AND ABILITY</strong>\n<br><br>\nRequired:\n\n<ul>\n\n\t<li>Proven experience working as a data analyst or business data analyst</li>\n\n<li>Excellent analytical and critical thinking skills</li>\n\n<li>Ability to work with large amounts of information, toggling between the forest and the trees</li>\n\n<li>Number cruncher/math whiz</li>\n\n<li>Ability to collect, organize, analyze, and disseminate significant amounts of information with exhaustive attention to detail and accuracy</li>\n\n<li>Technical expertise regarding data models and database design development</li>\n\n<li>Knowledge of and experience with reporting packages, databases (SQL, etc.) and programming (XML, Javascript, Python, or ETL frameworks)</li>\n\n<li>Adept at queries, report writing and presenting findings</li>\n\n<li>Working experience with data visualization and/or business intelligence software (Tableau, Looker, Power BI, Qlik)</li>\n\n<li>Four year degree in Mathematics, Economics, Computer Science, Information Management, Statistics, or related field; graduate degree or applicable work experience desired</li>\n\n<li>Excellent interpersonal skills, and verbal/written communication skills</li>\n\n<li>Other duties as assigned</li>\n</ul>\nStrongly Preferred:\n\n<ul>\n\n\t<li>Knowledge of statistics and experience using statistical packages for analyzing datasets (SPSS, SAS, Stata, JMP)</li>\n\n<li>Experience with Geographic Information Systems (ESRI ArcGIS, etc.)</li>\n\n<li>Experience in a non-profit, human services setting</li>\n</ul>\n<strong>Position Details</strong> \n<br>\nLocation: Los Angeles, CA\n<br>\nStart date: November 2018\n<br>\nCompensation: $65-75K/annual, DOE\n<br>\nStatus: Exempt, full-time\n<br>\nBenefits: Health, dental, vision, retirement match, long-term disability, life insurance, flex spending, commuter plan, sick leave and vacation pay\n<br>\nReports to: Director of Data and Technology\n<br>\nTravel required: Occasional\n<br><br>\n<em>Brilliant Corners does not discriminate on the basis of race, color, religion (creed), gender, gender expression, age, national origin (ancestry), disability, marital status, sexual orientation, or military status, in any of its activities or operations. These activities include, but are not limited to, hiring and firing of staff, selection of volunteers and vendors, and provision of services. We are committed to providing an inclusive and welcoming environment for all members of our staff, clients, volunteers, subcontractors, vendors, and clients.</em>\n<br><br>\n<em>Brilliant Corners is committed to fair hiring practices and does not ask applicants to disclose conviction history before extending a conditional job offer.</em>\n<br><br>\n<em>Disclaimer: Brilliant Corners does not accept unsolicited assistance from search firms / employment agencies / third-party recruiters for any of its employment opportunities. Please, no phone calls or emails to any employee of Brilliant Corners about this opening. All resumes submitted by search firms / employment agencies / third-party recruiters to any employee at Brilliant Corners via-email, the Internet or in any form and/or method without a valid written search firm agreement in place for this position will be deemed the sole property of Brilliant Corners; no fee will be paid in the event a candidate is hired by Brilliant Corners as a result of the unsolicited referral or through other means.</em>"}