{"job title": "Scientist - Protein Characterization", "company": "Bristol Myers Squibb", "city state": "– Hopewell, NJ", "rating": "3.6", "job description": "In the Molecular and Analytical Development group of BMS, we are a world-class Mass Spectrometry and Biophysics Center of Excellence to support the development of life-saving medicines in immuno-oncology and other therapeutic areas. We specialize in biologics development using state of the art biophysical methods to decipher the structural complexities of biological molecules. We foster an innovative and collaborative environment that values and recognizes diversity of contributions, and pushing the limits of technology for analyzing monoclonal antibodies, fusion proteins, and other novel scaffolds progressing in clinical trials for unmet medical needs.\n<br><br>\nThe Molecular and Analytical Development group is seeking a highly motivated and creative Biophysical Scientist to analyze structure, stability, and post-translational modifications of proteins to support development of biopharmaceuticals, and be part of the leadership position of BMS in Immuno-Oncology. This individual is also expected to push the limits of advanced biophysical techniques for characterization of therapeutic monoclonal antibodies, antibody drug conjugates, fusion proteins, and other protein modalities.\n<br><br>\nThese techniques include, but are not limited to:\n<br><br>\n+ spectroscopy (UV/VIS, CD, fluorescence, FTIR, Raman)\n<br><br>\n+ analytical ultracentrifugation\n<br><br>\n+ microscopy (FTIR, Raman, AFM)\n<br><br>\n+ protein particulate enumeration and imaging (HIAC, MFI, FlowCam, NTA, RPS)\n<br><br>\n+ static and dynamic light scattering\n<br><br>\n+ calorimetry (DSC, ITC)\n<br><br>\n+ chromatography (SEC, IEX, RP)\n<br><br>\n+ capillary electrophoresis (iCIEF, SDS-CGE)\n<br><br>\nAn ideal candidate would have significant experience with therapeutic proteins including mAb, bispecific antibodies, fusion proteins, antibody drug conjugates and other derivatized proteins, and their structure-function relationships. Prior expertise in protein-protein interactions, HOS analysis, protein aggregation mechanisms and particle characterization would be highly valued. Strong background in mathematical skills including statistical analysis is a plus. Proven track record of independent research capability and problem solving ability is required for this position.\n<br><br>\nAdditional responsibilities include defining critical quality attributes and understanding protein post-translational modifications including degradation pathways in in-vitro systems. He/she is also expected to publish novel findings in journals and present scientific data at internal and external conferences.\n<br><br>\nResponsibilities will also include matrix team leadership. The individual will work independently and in collaboration with colleagues within analytical and across various functional areas to support programs from clinical development through registrational studies.\n<br><br>\nThis individual will be required to interpret and present scientific data, contribute to IND, IMPD, BLA, and other regulatory filings, write technical reports and represent the department in matrix team environment when needed. Attention to detail and be able to work in a highly collaborative environment under tight timelines are required attributes.\n<br><br>\nApplicants must have a PhD with a minimum of 0-4 years, or MS or equivalent with a minimum of 5 years, or BS or equivalent with a minimum 8 years, of relevant experience in biopharmaceutical or biotechnology industry.\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}