{"job title": "Scientist", "company": "Bristol Myers Squibb", "city state": "– Hopewell, NJ", "rating": "3.6", "job description": "Division: Biologics ? Molecular and Analytical Development (MAD).\n<br><br>\nBristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases. One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. And driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\nThis Scientist position within the Impurity Method Center of Excellence has the opportunity to drive the method development of process related impurities such as HCP, including identification, characterization and quantification of impurities during clinical product development of biologics in BMS pipeline. This position reports to the Group Leader in Impurity COE, within the Biologics Development organization.\n<br><br>\nBristol-Myers Squibb is the industry leader in immuno-oncology and other innovative therapies with life-saving medicines such as Opdivo?, Yervoy?, Empliciti?, Eliquis?, and a rich clinical portfolio of diverse modalities including monoclonal antibody, fusion protein, gene therapy, and combination regimes. The position provides exciting opportunity to be involved in early and late stage clinical development programs, progress the assets to marketing approval, and bring life-saving medicines to patients who are waiting. The candidate will have opportunity to work on a variety of biologic compounds across various therapeutic modalities, and actively partner with various biologics development &amp; commercialization groups across sites in New Jersey, New York, Massachusetts, and globally.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\n+ Responsible for performing and leading development and validation for qPCR and ELISA method.\n<br><br>\n+ Maintain laboratory notebook and record keeping under GxP compliance and guidelines\n<br><br>\n+ Participate and / or lead departmental initiatives, such as data trending for method performance evaluation, critical reagent qualifications, etc.\n<br><br>\n+ Maintain readiness of the GMP laboratory. This includes, but not limited to, preventative maintenance and calibration of equipment, maintaining laboratory supplies, sample inventory and preparation, audit preparation and readiness, 5S initiatives\n<br><br>\n+ Participate in the development and validation work for various impurity methods\n<br><br>\n+ Author or Review method development, qualification/validation protocol and reports, method procedures and technical transfer reports\n\n\n<ul>\n<li>*Competencies:**</li>\n</ul>\n\n+ Ph.D. in analytical chemistry, biotechnology, pharmaceutical sciences, biochemistry, or equivalent field, with a minimum of 0 - 4 years , or MS in related discipline with 4 - 6 years relevant experience, or, BS in related discipline with a minimum of 6 - 8 years relevant experience\n<br><br>\n+ Excellent communication and interpersonal skills, both written and verbal required.\n<br><br>\n+ Proficient with variety of bioanalytical techniques, specifically qPCR and ELISA based residual assays.\n<br><br>\n+ Proficient with analytical instrument operation, maintenance troubleshooting and software programming. Experienced in the use of SoftMax software is a plus.\n<br><br>\n+ Experiences in a GMP environment is required.\n<br><br>\nBristol-Myers Squibb is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}