{"job title": "Associate Research Scientist --Oncology Mechanistic Disease Discovery (9)", "company": "Bristol-Myers Squibb Company", "city state": "– Redwood City, California", "rating": "3.6", "job description": "Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\n<br><br>\nOne shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.\n<br><br>\nThe Associate Research Scientist will join the Mechanistic Disease Discovery Research team within the Oncology Discovery organization at Bristol-Myers Squibb in Redwood City, CA, to deliver potential biomarker and mechanism of action data for therapeutic targets in oncology.\n<br><br>\nThe qualified candidate is a highly motivated, interactive, and creative individual that possesses the ability to work across a highly matrixed environment to support progression of targeted therapies in oncology. This position will specifically support the identification of potential biomarkers, receptor occupancy, target engagement, and pharmacodynamic assays for these oncology targets. Additionally, the position will support mechanism of action studies using primary human tumors and mouse models. The candidate will be expected to effectively collaborate with colleagues in the oncology, protein engineering, chemistry, translational medicine, biomarker and clinical groups. The successful candidate will demonstrate superb verbal and written communication skills.\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>A B.S. with a minimum of 2 years of academic/industrial experience, or an M.S. with strong scientific knowledge and research experience in cancer biology/cellular and molecular biology is required.</li><li>Demonstrated independence in experimental design, execution, data analysis and troubleshooting is required.</li><li>Hands on experience with a wide range of in-vitro cellular and biochemical assays, including cell culture, western blotting, immunoprecipitation, ELISAs (MSD), reporter assays, siRNA/shRNA knockdown, CRISPR-mediated genome editing, qPCR, cloning, lentivirus generation and transduction is required.</li><li>Experience with in vivo/ex vivo pharmacology, including rodent handling and common procedures including tissue processing is desired. Working knowledge of in-vivo PK, PD and efficacy studies is desirable.</li><li>Experience in data mining through use of desktop tools/interfaces and public databases (e.g., UCSC genome Browser, CBIO, GTex, Oncoland etc) is highly desirable.</li> <li>Experience in bioinformatic approaches both technically and theoretically is desirable.</li><li>Proficiency in utilizing software such as Graph Pad, Microsoft office etc. for data analysis and figure generation is required.</li><li>Attention to detail with excellent organizational and record keeping skills is a requirement.</li><li>Excellent interpersonal skills with the ability to interact effectively, internally and externally is required.</li><li>This position is located in Redwood City, CA.</li>\n</ul>"}