{"job title": "Data Engineer", "company": "Brivo Systems", "city state": "– Bethesda, MD", "rating": "3.5", "job description": "<div> <div>Brivo is seeking a talented <strong>Data Engineer​</strong> with a passion for transforming, wrangling,&nbsp;and manipulating data with current big data technologies. We are looking for people that have real world experience with Spark, Cassandra, Amazon S3 and related Amazon Big Data offerings. If you enjoy collaborating with other engineers, architects, and product management and are passionate about data we want to hear from you.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Your Role</strong>\n<ul>\n<li>Support the design and implementation of a large scale big data solution utilizing Spark in AWS</li><li>Identify, break down, and solve data-oriented problems</li><li>Work in an open, agile environment and participate in agile team sprint planning sessions, provide work estimates and strategies to implement solutions in a most effective way</li><li>Assist with the analysis of informational needs and elements, data relationships and attributes, proposed manipulation, data output, and reporting capabilities</li><li>Collaboratively work with architects and product managers to develop a robust data processing pipeline that will ingest, enrich, and expose large amounts of data</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Minimum Qualifications</strong>\n<ul>\n<li>Experience with object-oriented design, coding, and testing patterns</li><li>Experience developing Java or Scala Spark applications</li><li>Experience with enterprise-class software development and understand what it means to support a SaaS product</li><li>Experience in data warehousing and NoSQL technologies</li><li>Strong background in working with Data Scientists and a good foundation in Statistics and Mathematics</li><li>Ability to engineer large-scale data and data processing infrastructures</li><li>Experience supporting the maintenance of Spark applications in a productized production environment</li><li>Strong understanding of big data design principles, security and the factors that affect big data and distributed system performance</li>\n</ul>\n&nbsp;\n</div></div>"}