{"job title": "Senior Data Scientist - Global Production", "company": "Brown-Forman", "city state": "– Louisville, KY", "rating": "4.5", "job description": "<strong>Title</strong>\n<br>\nSenior Data Scientist - Global Production\n<br><br>\n30-Aug-2018\n<br><br>\n<strong>Business Area</strong>\n<br>\nGlobal Production\n<br><br>\n<strong>State</strong>\n<br>\n<strong>KY</strong>\n<br><br>\n<strong>About Brown-Forman</strong>\n<br>\n<strong>COMPANY:</strong>\n<br>\nFor more than 145 years, Brown-Forman Corporation has enriched the experience of life by responsibly building fine quality beverage alcohol brands, including Jack Daniel’s Tennessee Whiskey, Jack Daniel’s &amp; Cola, Jack Daniel’s Tennessee Honey, Jack Daniel’s Tennessee Fire, Gentleman Jack, Jack Daniel’s Single Barrel, Finlandia, Korbel, el Jimador, Woodford Reserve, Old Forester, Canadian Mist, Herradura, New Mix, Sonoma-Cutrer, Early Times, Chambord, BenRiach and GlenDronach. Brown-Forman’s brands are supported by nearly 4,600 employees and sold in approximately 160 countries worldwide\n<br><br>\nFor more information about the company, please visit http://www.brown-forman.com.\n<br>\nWe're on Twitter: https://twitter.com/BrownFormanJobs\n<br>\nSee us on LinkedIn: https://www.linkedin.com/company/brown-forman\n<br><br>\nBrown-Forman Corporation is committed to equality of opportunity in all aspects of employment. It is the policy of Brown-Forman Corporation to provide full and equal employment opportunities to all employees and potential employees without regard to race, color, religion, national or ethnic origin, veteran status, age, gender, gender identity or expression, sexual orientation, genetic information, physical or mental disability or any other legally protected status.\n<br><br>\n<strong>Req Type</strong>\n<br>\nExempt\n<br><br>\n<strong>AutoReqId</strong>\n<br>\n<strong>4637BR</strong>\n<br><br>\n<strong>City</strong>\n<br>\nLouisville\n<br><br>\n<strong>Job Description</strong>\n<br>\n<strong><u>Job Summary:</u>\n<br>\n</strong>\n<br>\n<strong>Scope of Position:</strong>\n<br><br>\nWorks with business partners to determine data analysis, data visualization and data analytics tools needed to address a business need. Leverages resources to conduct non-routine statistical modeling and develops data analytics tools independently. Solves complex problems using in-depth knowledge and experience. Analyzes and interprets data in the context of existing knowledge and understanding of Global Production and makes business recommendations. May have direct reports.\n<br><br>\n<strong>Basic Function:</strong>\n<br><br>\nWorks with all Global Production Groups to define and implement production analytics opportunities in response to specific requests. Develops and manages manufacturing analytics projects. Works with IT, Production Sites and external vendors to properly set up analytics environments and ensure appropriate data analytics are generated in production. Conducts statistical analysis and modeling and data visualization to answer short term / tactical as well as long term / strategic questions. Educates and builds best data practices around Global Production.\n<br><br>\n<strong>jd2</strong>\n<br>\n<strong><u>Job Responsibilities:</u>\n<br>\n</strong>\n<br>\n40% - Works with business partners to determine data analysis, data visualization and data analytics tools to address their needs. Understands the complexities of the business situation and designs the most appropriate data analytics approach. Draws on in-depth knowledge and experience.\n<br><br>\n20% - Conducts non-routine statistical modeling and develops complex analytics tools independently. Leverages resources to conduct routine statistical analysis, data visualization and to develop analytics tools. Solves complex problems using in-depth knowledge and experience.\n<br><br>\n20% - Analyzes and interprets data in the context of the existing body of knowledge. Communicates results to business partners and makes recommendations for next steps independently. Translates complex scientific ideas into business applicable recommended actions. and issues reports with minimum supervision.\n<br><br>\n20% - Acts as a resource for colleagues with less experience. Leads project implementation internal to own function with no supervision. Leads external projects with minimal supervision.\n<br><br>\n<strong>jd3</strong>\n<br>\n<strong><u>Required Experience &amp; Education:</u>\n<br>\n</strong>\n<br>\n<strong>Education:</strong>\n<br>\n: • BS degree in Data Science, Statistics or related discipline and 5+ yrs work experience in discipline or MS degree in discipline and 3+ yrs experience\n<br>\n<strong>Experience:</strong>\n\n\n<ul>\n<li>Extensive experience with R programming and with SQL, SAP and Salesforce databases</li>\n<li>Exceptional communication skills</li>\n<li>Experience with and solid understanding of beverage alcohol and barrel manufacturing</li>\n</ul>\n\n<strong>Country</strong>\n<br>\nUnited States\n<br>"}