{"job title": "Research Scientist - Global Water Treatment (General OG) (2 Positions)", "company": "Buckman Laboratories", "city state": "– Memphis, TN", "rating": "4.1", "job description": "Buckman is a privately held, global specialty chemical company with headquarters in Memphis, TN, USA, committed to safeguarding the environment, maintaining safety in the workplace, and promoting sustainable development. Buckman works proactively and collaboratively with its worldwide customers in pulp and paper, leather, and water treatment to deliver exceptional service and innovative specialty chemical solutions to help boost productivity, reduce risk, improve product quality, and provide a measurable return on investment.<br>\n<div>Job Description<br><br>Research Scientist will be responsible for delivering innovative and accurate products, services and solutions in the Water Treatment domain area. Supporting and contributing to leadership of research projects using agile methods in a fast-paced environment that will cross multiple industries globally. Play a technical and consultative role in the physical product/solutions/applications development in support of the global WT goals. Contribute to the creation and maintenance of a research and innovation agenda that ultimately delivers viable solutions for our customers.<br><br><strong><u>Desired Skills</u></strong>\n\n<ul>\n\n\t<li>Strong knowledge of organic and inorganic chemistry, required</li>\n<li>Knowledge of polymer chemistry is desirable.</li>\n<li>Planning and Executing Laboratory-Scale Synthesis.</li>\n<li>Purification and Isolation Techniques.</li>\n<li>Analytically competent with use of most modern Instrumental Techniques.</li>\n<li>Hands-on experience in preparation and authentication of new compounds.</li>\n<li>Ability to operate independently and as a part of a high-functioning team</li>\n<li>Proficiency in MS Word, MS Excel, and MS PowerPoint</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Detail orientated and excellent time management skills</li>\n<li>Strong Organizational skills; Self-management; Management and leadership skills.</li>\n<li>Desire to constantly seek knowledge to remain relevant in this fast pace technology world.</li>\n</ul>\n<strong><u>Desired Experience</u></strong>\n\n<ul>\n\n\t<li>Minimum 5 years relevant experience in product/solutions/applications development in the Water treatment domain.</li>\n<li>Preferred experience in the development of products to manage cooling water, boiler water, produced water and water reuse in the Oil and Gas industry.</li>\n<li>Ability to conduct organic structure validation using classical methods as well as most modern instrumental techniques (GC; LC; NMR/FTIR/Mass Spectrometry; etc.).</li>\n<li>Operation of robotic synthesis procedures to produce compounds for high-throughput screening.</li>\n<li>Transitioning technologies from laboratory to full scale manufacture.</li>\n<li>Support trouble shooting of new technologies.</li>\n<li>Supporting trials and the development of marketing material.</li>\n<li>Conducting customer technical presentations.</li>\n<li>Idea management – from concept to implementation.</li>\n<li>Intellectual Property development.</li>\n</ul>\n<strong><u>Education</u></strong>\n<br><br>\nPh.D. in Analytical Chemistry, Inorganic, Organic Chemistry or Polymer Chemistry.</div>\n\n<br>"}