{"job title": "Data Scientist I", "company": "Business Technology Group", "city state": "– Jacksonville, Florida", "rating": "5.0", "job description": "One of our clients on the Southside area of Jacksonville, FL has an immediate need for a Data Scientist. The perfect candidate will have the following skills and experience:\n<br>\nData ScientistCandidate should have experience in some form of SQL (e.g. HIVE, PostgreSQL, MSSQL, etc.) and either Python or R for statistical application development. Experience in a Hadoop environment and / or statistical development tool (e.g. RapidMiner, Knime) a plus.\n<br>\nDevelop and communicate a deep understanding of client needs, perform analytical deep-dives to identify problems, opportunities and specific actions required\n<br>\nDevelop reproducible and deployable statistical applications on platform such as R/Python/Spark using techniques such as Regression, SVM, and Neural Networks\n<br>\nImplementing processes that improve and lead to greater data quality\n<br>\nConducting statistical analyses to develop strategies\n<br>\nDocumenting all processes and research\n<br>\nBuilding new algorithms and model training\n<br>\nExecuting projects involving analytics\n<br>\nIdentifying data patterns and trends\n<br>\nAnalyzing data to develop predictive models\n<br>\nCreating, managing, and maintaining analytically rigorous data\n<br>\nPossessing a solid machine learning foundation\n<br>\nProven record of successful statistical product delivery\n<br>\nAbility to execute health insurance use cases via statistical applications such as R or Python\n<br>\nEfficiently access data via multiple vectors (e.g. NFS, FTP, SSH, SQL, Sqoop, Flume, Spark)\n<br>\nSignificant experience with SQL and working with large datasets required\n<br>\nWork with cross-functional teams (including Finance, IT areas, and Operational Areas) to rapidly execute and iterate\n<br>\nNoting anomaly detection and running diagnostics\n<br>\nPerforming graphical model analysis\n<br>\nStrong verbal and written communication skills\n<br><br>\nIf you believe that your skills and experience are a match for this position, please e-mail your resume to apply@btginc.com, or apply on line at www.btginc.com (search jobs).\n<br>\nIf you have any questions, please call 904-998-9414 and reference Data Scientist position."}