{"job title": "Data Scientist, Business Intelligence", "company": "Button", "city state": "– New York", "rating": "5.0", "job description": "<div>Working at Button is one of the most fun, fulfilling, and challenging experiences you'll have - and it's one of the reasons why we were voted one of the best places to work in NYC.</div> <br>\n<div>Buttons mission is to be the abstraction point for mobile commerce. Today we work with some of the largest and most interesting businesses in the world, connecting customers through higher-quality, better-performing user experiences. Data is at the very core of proving were on the right track and deciding where to go next, and that is where you fit in.</div><br>\n<div>As a member of our Data Analytics Team, you will be responsible for empowering everyone at Button to access and use data to advance the business. You will be a partner to our customer success, finance, marketing and product engineering teams, preparing them with key insights from challenging datasets. As an early employee, you will have a foundational role in shaping how the company draws key insights and uses data effectively and consistently in order to drive our business forward.</div> AS A DATA SCIENTIST YOU WILL:\n\n<ul>\n<li>Work with our data warehousing systems to design, build, and maintain analyses and performance visualizations for key customers, major product initiatives, and other internal needs.</li><li>Democratize data at Button by helping to define KPIs, metrics and key terminology that allows the company to communicate and measure ideas consistently.</li><li>Work closely with engineers and data scientists to design and execute on-the-fly experiments, like A/B and multivariate testing of consumer/client facing product features.</li><li>Partner with our customer success, sales and finance teams to tackle their data challenges in short(weekly) tasks or long(quarterly) projects</li>\n</ul>\n\n<strong>WE LOOK FOR TEAMMATES WHO HAVE:</strong>\n\n<ul>\n<li>Experience with SQL and BI tools. We use Chart.io, but experience in similar tools like Tableau is great too.</li><li>Familiarity with a variety of data sources, such as Redshift, APIs, S3 logs and Athena.</li><li>An open and active approach to sharing knowledge as well as excellent communication skills</li><li>Programming experience in one or more application or systems languages like Python</li><li>Expert critical thinking, problem solving and analytical skills</li>\n</ul>\n\n<strong>WHO YOU WILL WORK WITH:</strong>\n\n<ul>\n<li>Jiaqi Liu, <strong>Software Engineer</strong>: Jiaqi is Software Engineer at Button, responsible for several backend and data engineering projects. An avid Pythonista and a frequent speaker at conferences large and small, outside of work she loves to mentor at hackathons and organize meetups for Women Who Code.</li>\n</ul>\n\n<ul>\n<li>Sean Summers, <strong>Data Scientist:</strong> Sean works on all things data at Button, developing the machine learning algorithms that drive Button's contextual matching engine. Born and raised in California, Sean loves to travel the world with his family, often to Switzerland where he lived for 7 years before being deported.</li>\n</ul>\n\n<ul>\n<li>Yunchi Luo, <strong>Software Engineer:</strong> Yunchi has a background in Data Engineering and is an authority when it comes to implementing accessible web applications here at Button. When he is not coding you can find him drinking lots of bubble tea.</li>\n</ul>\n\n<ul>\n<li>Mike Wakerly, <strong>CTO:</strong> Mikey is Buttons Hawaiian shirt enthusiast and Chief Technology Officer. A former Googler and a San Francisco transplant, he loves mountain biking, tinkering on electronics, and any excuse to take a road trip.</li>\n</ul><br>\n\n<div>Our team values and celebrates our diverse backgrounds. Being open about who we are and what we do allows us to do the best work of our lives. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. You can learn more about how we are making Button a diverse and inclusive environment through our perks and benefits here.</div>"}