{"job title": "Data Scientist", "company": "BuzzFeed", "city state": "– New York, NY", "rating": "3.2", "job description": "BuzzFeed is looking for extraordinary data scientists to join its New York and Los Angeles offices. We're seeking passionate professionals who have a proven track record using data in a meaningful way - whether building product or supporting decisions. You balance technical expertise, domain knowledge and a capacity to be deeply inquisitive.\n<br><br>\nBuzzFeed's data science team is diverse. The team uses data-driven methods to power decisions, inform strategy, build robust data products, and identify opportunities for innovation across the company. We are true hybrids - software engineers, statisticians, mathematicians, domain experts and analysts - who specialize in translating questions into methodical approaches, experiments, and products. We think deeply about the limitations of data, and communicate our output coherently.<br><br><strong>You Will</strong>\n\n\n<ul>\n<li>Collect, interpret, and disseminate data to allow for rapid product and content experimentation.</li>\n<li>Build learning loops in which user experiences generate insights used to create growth and engagement across different platforms.</li>\n<li>Develop and foster services that will use data to create personalized and optimized experiences.</li>\n<li>Develop KPIs in a cross-platform world.</li>\n<li>Support development of data tools, such as dashboards and A/B testing platforms.</li>\n<li>Communicate complex ideas in a clear way to product, engineering, and editorial teams.</li>\n</ul>\n\n<strong>You Have</strong>\n\n\n<ul>\n<li>2+ years of industry experience, working on data-related initiatives.</li>\n<li>Experience in applying Machine Learning, Predictive Analytics, and Classification techniques towards real product and problems.</li>\n<li>Proficiency with the Python programming language.</li>\n<li>Experience with social data or media is a plus.</li>\n</ul>\n\n<strong>Life at BuzzFeed</strong><br><br>At BuzzFeed, we believe our work benefits from the diverse perspectives of our employees. As such, BuzzFeed celebrates inclusion and is committed to equal opportunity employment. As a BuzzFeed employee, you can expect:\n\n<ul>\n<li>A supportive, inclusive atmosphere on a team that values your contributions</li>\n<li>Opportunities for personal and professional growth via work experience, offerings from our in-house Learning Team, Employee Resource Groups, and more</li>\n<li>An attractive compensation package, including salary and equity</li>\n<li>A generous and well-rounded benefits program featuring PTO and unlimited sick time, comprehensive medical benefits, a family leave policy, access to mental health platforms, retirement plans, gym and wellness discounts, and much more</li>\n<li>No shortage of snacks, catered lunches, beverages, birthday treats... even leftovers from the Tasty kitchens in LA and NYC!</li>\n</ul>"}