{"job title": "Data Scientist", "company": "C3 IoT", "city state": "– Redwood City, CA", "rating": "4.9", "job description": "C3 IoT meets an urgent and fast-growing demand for enterprise scale Big Data, AI, and IoT applications to enable Digital Transformation. The C3 IoT Platform utilizes real-time performance monitoring and predictive analytics to optimize business processes, differentiate products and services, and create new revenue streams. Through the innovative C3 Type System and an open, extensible platform, C3 IoT has become the world's leader in delivering Digital Transformation initiatives.\n<br><br>\nAs a Data Scientist, you will participate in the definition of new analytics capabilities able to provide our customers with the information they need to make proper decisions to support our customers in operating the internet of things (IoT). In addition, you will help find the appropriate machine learning / data mining algorithms to answer these questions. Finally, you will be responsible for implementing this into the product and making it available to our customers.\n<br><br>\nQualified candidates will have an in-depth knowledge of most common machine learning techniques and their application. You will also understand the limitations of these algorithms and how to tweak them or derive from them to achieve similar results at large-scale.\n<br><br>\nWe are looking for Data Scientists in both Redwood City, CA and Washington, D.C.\n<br><br>\n<strong>Your Responsibilities:</strong>\n\n<ul>\n<li>Driving adoption of Deep Learning systems into next-generation of C3 IoT products.</li>\n<li>Designing and deploying Machine Learning algorithms for industrial IoT applications such as fraud detection and predictive maintenance.</li>\n<li>Collaborating with data and subject matter experts from C3 IoT and its customer teams to seek, understand, validate, interpret, and correctly use new data elements.</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>MS or PhD in Computer Science, Electrical Engineering, Statistics, or equivalent fields.</li>\n<li>Applied Machine Learning experience (regression and classification, supervised, and unsupervised learning).</li> \n\n<li>Strong mathematical background (linear algebra, calculus, probability and statistics).</li>\n<li>Experience with scalable ML (MapReduce, streaming).</li>\n<li>Ability to drive a project and work both independently and in a team.</li>\n<li>Smart, motivated, can do attitude, and seeks to make a difference.</li>\n<li>Excellent verbal and written communication.</li>\n</ul>\n<strong>Preferred</strong>\n\n<ul>\n<li>Experience with JavaScript and prototyping languages such as Python and R. Experience with Java and Scala is a plus.</li>\n<li>Knowledge in electrical engineering and cyber-physical systems is a plus.</li>\n<li>A portfolio of projects (GitHub, papers, etc.) is a plus.</li>\n</ul>\nC3 IoT provides a competitive compensation package and excellent benefits including:\n\n<ul>\n<li>Competitive salary, generous stock options, 401K, medical, dental, and vision benefits. At the office, we offer a fully stocked kitchen with catered breakfast and lunch, table tennis and pool table, free membership at our on-site gym, Friday evening social hours with food, drink and music and a fun team of great people.</li>\n</ul>\nC3 IoT is proud to be an Equal Opportunity and Affirmative Action Employer. We do not discriminate on the basis of any legally protected characteristics, including disabled and veteran status. Please let us know if you have a disability that requires an accommodation."}