{"job title": "Data Scientist", "company": "CACI International", "city state": "– Charlottesville, VA", "rating": "3.4", "job description": "<p><strong>Job Description</strong></p><p></p><p><br><b>What Youll Get to Do:</b><br><br>This position is in support of the Facilities and Infrastructure Characterization and Analysis (FICA) Branch at the National Ground Intelligence Center (NGIC).<br><br><b>More About the Role:</b><br><br>Candidate will work on a multi-intelligence fusion team consisting of all-source, Imagery Intelligence (IMINT), Signals Intelligence (SIGINT), and Culture and Language analysts. Supports analytical teams with deskside development support, with particular emphasis on custom tools, scripts, and quick-turnaround technical solutions. Advises analytical teams in workflow development, employing a broad spectrum of both GOTS and COTS resources. Provides expertise in a wide variety of technologies, to include scripting languages, relational databases, and Linux distributions. Contributes to web mapping application projects through the interpretation of business logic, data modeling, API development, and User Interface design, and data analytics. Creates and deploys tools customized to analysts specifications to improve efficiency. Remains current in emerging technologies as they apply to changing mission requirements through proactive training, collaboration, and professional development.<br><br><br><b>Youll Bring These Qualifications:</b><br> </p><ul><li>5-7 years of experience and a BA/BS degree in Computer Science or other technical degree</li><li> Must have an in scope TS/SCI clearance.</li><li> Experience providing direct technical support to analysts</li><li> Experience with one or more of the following C#, Java, JavaScript, Python, R </li><li> Experience leveraging and creating web based APIs</li></ul><p><br><br><b>These Qualifications Would be Nice to Have:</b></p><ul><li>Experience developing models, algorithms and visualization tools to help end users understand the data and answer complex intelligence questions</li><li>Experience programmatically retrieving and cleaning up large volumes of disparate data</li><li>Experience with Java Script visualization libraries like D3, Cross Filter, Ember etc.</li><li>Experience using Data Science libraries and software like Pandas, R, and Tableau</li><li>Experienced using statistics to clearly convey complex findings </li><li>Familiarity with unsupervised, semi-supervised, and supervised learning algorithms and technologies such as TensorFlow, Caffe etc.</li><li>Experience using modern MVC frameworks and ORMs</li><li>Security+ certified.</li><li> Military experience. </li><li> Good written and verbal communication skills and experience briefing senior personnel.</li><li>Knowledgeable in all intelligence disciplines capabilities, limitations and platforms to include HUMINT, SIGINT, IMINT, and OSINT.</li><li>Ability to provide innovation and critical thinking skills to all customer problem sets. Expected to expertly translate creative and critical thinking into written and oral forms.</li></ul><p><br><b>What We Can Offer You:</b><br><br>- Weve been named a Best Place to Work by the Washington Post.<br><br>- Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.<br><br>- We offer competitive benefits and learning and development opportunities.<br><br>- We are mission-oriented and ever vigilant in aligning our solutions with the nations highest priorities.<br><br>- For over 55 years, the principles of CACIs unique, character-based culture have been the driving force behind our success.</p><p></p><p><strong>Job Location</strong></p><p>US-Charlottesville-VA-CHARLOTTESVILLE</p><br><p> </p>\n<p>CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities.</p>"}