{"job title": "Senior Data Scientist", "company": "Cadre", "city state": "– New York, NY", "rating": "4.7", "job description": "We're building, from the ground up, a technology-driven trading platform for the coveted commercial real estate asset class, previously only accessible to the largest institutional investors.\n<br><br>\nCadre is looking for a Senior Data Scientist with a strong quantitative background to work alongside our acquisition and asset management teams to build the next generation of machine learning products for the CRE industry. We are looking for a talented lead who can develop and apply machine learning algorithms to CRE datasets; understand the various drivers of our business and partner with research to find meaningful solutions; lead as well as mentor junior members of the team.\n<br><br>\n<strong>WHAT YOU'LL DO</strong>\n\n\n<ul>\n<li>Build and deploy machine learning models to accelerate our acquisition and asset management processes</li>\n<li>Partner with Research to drive top-down investment strategies</li>\n<li>Research traditional and non-traditional CRE data sources to integrate into various models</li>\n<li>Develop and drive the data science roadmap</li>\n</ul>\n\n<strong>YOUR EXPERTISE</strong>\n\n\n<ul>\n<li>A bachelor's degree in computer science, applied mathematics, or other relevant quantitative disciplines</li>\n<li>Graduate degree in a similar technical discipline is a plus but not required</li>\n<li>Prior experience in financial engineering is a plus but not required</li>\n<li>5+ years of hands-on experience developing and deploying machine learning models, statistical modeling and advanced analytics</li>\n<li>Strong written and verbal communication skills, comfortable discussing quantitative results in a clear and actionable manner</li>\n<li>Self-starter, thriving in a startup environment</li>\n</ul>\n\n<strong>OUR TECH STACK</strong>\n<br><br>\nCadre runs a robust stack (React + Redux, Django, PostgreSQL), continuously integrated with zero-downtime deployments (Ansible, Packer) on AWS.\n<br><br>\nThe majority of our time is spent in that environment, but our goal is to always utilize the best tool for the job: you'll be working with members of our team to keep refining our toolset.\n<br><br>\n<strong>PERKS</strong>\n\n\n<ul>\n<li>Our biggest asset? Our team members and culture: join a fun and driven environment to work with, learn from, and mentor some of the brightest engineers in the industry, equally intent on building a great business as on celebrating each victory.</li>\n<li>401(K), significant equity, 100% of Healthcare premium coverage and unlimited PTO</li>\n<li>Amazing office space in the heart of SoHo with fully stocked kitchen (No water bottles though, we are green conscious!)</li>\n<li>Fun company offsites</li>\n</ul>"}