{"job title": "Director, Gaming Innovation and Data Science", "company": "Caesars Entertainment Corporation", "city state": "– Las Vegas, NV", "rating": "3.5", "job description": "Responsibilities:<br>\n<br>\nThe Director, Gaming Innovation andData Science requires an extremely high potential candidate who can thinkcritically about how to solve complex problems with minimal direction. The Director,Gaming Innovation and Data Science position is on the critical path to drive Caesarsgaming growth which includes sports betting expansion, mergers and acquisitionsdue diligence, and innovative casino product launches across the US. Thecandidate is required to have business, financial and technological knowledgeto successfully collaborate with the IT, Accounting, Finance, Analytics, Gaming,and Property operations groups with the mission of supporting the gaming activitiesat Caesars. The position requires a highly skilled candidate who is familiar withand can use advanced business analytics methods to identify insights andrevenue growth opportunities which would assist Caesars in making better informedbusiness decisions.<br>\n<br>\nEducation and Experience:<br>\n<br>\n* Bachelor's Degree in quantitativefield. MBA or Master's Degree inquantitative field is strongly preferred<br>\n<br>\n* Graduation from a top-tier program withevidence of high performance/potential is strongly preferred<br>\n<br>\n* Work experience in analyticsincluding working with data visualization and technical tools such as Tableau, SQL,SAS, R, SSIS, SPSS, Python, ETL are required<br>\n<br>\n* Experience working with gamingindustry legacy system knowledge is strongly preferred<br>\n<br>\n* Knowledge of sportsbook businessterminology and methods is strongly preferred<br>\n<br>\n* Experience communicating complexanalytical results to all levels of employees within an organization<br>\n<br>\nQualifications:<br>\n<br>\n* Ability to interact with data inlarge databases through direct command line syntax<br>\n<br>\n* Skill with reporting and datavisualization tools such as Tableau<br>\n<br>\n* MS Office Products experience(ability to manage data/reports in Excel, Word, PowerPoint)<br>\n<br>\n* Ability to quickly understandbusiness problems and how they may be solved<br>\n<br>\n* Strong analytics skill and aptitudefor working with data<br>\n<br>\n* Knowledge of gaming and sportsbook concepts<br>\n<br>\n* Excellent communication/presentationskills that can be adapted to audiences from staff to senior executive level<br>\n<br>\n* Ability to manage numerous projectssimultaneously<br>\n<br>\n* Must work well with multi-functionalwork teams and be willing to take initiative<br>\n<br>\n* Must be able to respond calmly todemands of internal customers and work in pressure situations<br>\n<br>\n* Strong project management, timemanagement, organizational and consultative skills<br>\n<br>\nDuties and Percentages of Time Allocation:<br>\n<br>\n20%<br>\n<br>\n* Perform due diligence and evaluation process for casino acquisition deals from a gaming perspective as well as business development opportunities for existing company gaming assets. Project operational cash flow and optimized operating models to enhance financial performance. Business knowledge such as creating financial proformas and discounted cash flows is required.<br>\n<br>\n5%<br>\n<br>\n* Architect and design a new server based infrastructure to enable new gaming and sports betting analytics capabilities while collaborating with and managing various stake-holders internally and externally such as IT, Accounting, and external data platform vendors<br>\n<br>\n15%<br>\n<br>\n* Create new internal data warehouse and new data transformation processes to store Gaming big data while collaborating with IT Data Logistics and Accounting internal teams, and 3rd party data vendors. Knowledge in coding languages such as SQL, SAS (Statistical Analysis System), SSIS (SQL Server Integration Services), and ETL (Extract, Transform, Load) processes is required<br>\n<br>\n5%<br>\n<br>\no Integrate 3rd party big data (i.e. Scientific Gaming, Stadium) into the new internal data environment by collaborating with external vendor and assessing and understanding critical gaming and sports betting data (i.e. line and odds, customers data, ticket transactions)<br>\n<br>\n5%<br>\n<br>\no Build processes to refresh data on regular cadence (i.e. daily uploads) to present real-time updated data to drive more accurate and informed business decisions<br>\n<br>\n5%<br>\n<br>\no Create advanced audit processes to validate data integrity through all data steps and monitor data reliability to be in line with accounting financial data<br>\n<br>\n15%<br>\n<br>\n* Develop financial and business performance measurements to drive better gaming decisions regarding gaming products mix, prices and profitability, and marketing and customer behavior. Deliver recurring and ad-hoc financial and business performance reporting and dashboards to inform senior management on key gaming performance. Knowledge in statistical computing languages such as R and Python is required<br>\n<br>\n2.5%<br>\n<br>\no Develop new criteria and matrix for measuring the business performance, sales, and financials of the gaming and sportsbook activity across the company<br>\n<br>\n10%<br>\n<br>\no Build automatic reports of gaming products, financial performance and customer data to present senior management with daily/weekly/monthly/yearly business performance. Visualize the data in an intuitive and easy-to-read ways to help make better informed business decisions<br>\n<br>\n2.5%<br>\n<br>\no Conduct ad-hoc analyses to understand impact of complex marketing and casino activities on gaming products<br>\n<br>\n15%<br>\n<br>\n* Identify and discover new insights through advance analysis to maximize financial results and explore untapped revenue growth opportunities. Perform due diligence on all gaming areas. Knowledge in conducting and building analytics regression models, machine learning, and decision trees is required<br>\n<br>\n5%<br>\n<br>\no Build customer price elasticity models to better understand customer demand patterns by segment, date, location and other relevant criteria. Measure how the business is being impacted by price for different games and other business environment settings<br>\n<br>\n5%<br>\n<br>\no Build yield management process/system to provide dynamic price recommendations<br>\n<br>\n5%<br>\n<br>\no Analyze impact of external events influencing/cannibalizing Caesars gaming products such as competitors' products, market trends, special days and holiday<br>\n<br>\n10%<br>\n<br>\n* Design and conduct incremental revenue lift analyses to better understand positive/negative impact a sportsbook and other gaming products on other revenue streams (such as hotel lodging, other casino gaming products, food &amp; beverage, and retail)<br>\n<br>\n10%<br>\n<br>\n* Communicate all analyses, findings, conclusions, and recommendations to all relevant business, operating, and marketing constituents in the enterprise (such as Gaming and Marketing senior executives and General Managers of hotels) and actively assist in the implementation of accepted recommendations<br>\n<br>\n10%<br>\n<br>\n* Lead the Gaming Innovation and Data Science team and provide training, guidance and other managerial needs to the team analysts. Be an active participant and contributor to the thought leadership of the Analytics Center of Excellence. Take part of special Analytics projects and gain better understanding of other verticals at Caesars"}