{"job title": "Data Scientist", "company": "CALIBRE Systems", "city state": "– Alexandria, Virginia, United States", "rating": "3.6", "job description": "Tracking Code\n<br><br>\n<strong> FPI 2598-585 </strong>\n<br><br>\nJob Description<br><br>CALIBRE is looking for an experienced professional to join a team responsible for modernizing Army analytics processes. The ideal candidate should be able to provide input on how to create new sources of data-driven innovation through technology and analytics that would add value for our customers. They will explore new ways to analyze data using statistical methods, machine learning, and predictive models.\n<br><br>\nCandidate must be passionate about helping others solve problems, gain insights, and make decisions using data. They will display deep technical knowledge and be able to communicate it to a wide-ranging audience.<br><br>Required Skills\n<br>\n<br>\n<ul>\n<li>Must have or be able to obtain and maintain a DoD Secret security clearance (U.S. Citizenship required)</li>\n<li>Strong qualitative and quantitative analysis skills</li>\n<li>Must be a lifelong learner, willing to share and grow the knowledge of those around them</li>\n<li>Experience with Process Improvement/ Lean /Six Sigma/ Business Process Management/ BPR</li>\n<li>Experience with predictive modeling</li>\n<li>Experience with data visualization tools such as Qlik, Tableau, or Microsoft BI (Qlik preferred)</li>\n<li>Excellent verbal and written communication skills</li>\n</ul>\n\nRequired Experience<br><br><strong>Required Experience:</strong>\n\n<ul>\n<li>BS/BA in related degree such as Data/Business Analytics, Operations Research, Economics, Engineering, Mathematics, Business Management, etc. MS preferred. (Other education, commensurate experience and demonstrated ability of individual may be substituted)</li>\n<li>Minimum of 5 years professional work experience providing data analytics services.</li>\n</ul>\n<strong>Preferred Experience or Knowledge:</strong>\n\n<ul>\n<li>Experience in budgeting or cost-analysis</li>\n<li>Knowledge and understanding of the Army’s PPBE process</li>\n<li>Experience with R programming</li>\n<li>Experience using SQL</li>\n<li>Experience with Army Acquisition costing</li>\n<li>CDFM, CCEA, DAWIA or other relevant certification preferred.</li>\n<li>Experience with Army Logistics</li>\n<li>Experience with and understanding of Army enterprise data</li>\n</ul>\n\nJob Location\n<br><br>\nAlexandria, Virginia, United States\n<br><br>\nPosition Type\n<br><br>\nFull-Time/Regular"}