{"job title": "Data Scientist", "company": "Calm", "city state": "– San Francisco", "rating": "4.8", "job description": "<div>Calm - 2017 Apple iPhone App of the Year!</div><br>\n<div>Our mission is to make the world happier and healthier through the superpower of Calm. We are developing a range of digital and physical products that enhance mental fitness and alleviate some of the most important mental health issues of the modern age (anxiety, depression, insomnia and stress). Calm has reached over 30 Million users and is profitable (10x revenue growth in two years).</div> <br>\n<div>Mental Fitness is fast becoming the new Physical Fitness, and we believe a huge global brand will be built in this space. Our vision is to build Calm into one of the most valuable and meaningful brands of the 21st Century - The Nike of the Mind.</div><br>\n<div>Calm was co-founded by Alex Tew (Million Dollar Homepage) and Michael Acton Smith (Mind Candy, Moshi Monsters, Firebox).</div><br>\n<div>What Youll Do</div><div>You will wear a few hats as a data scientist, however your primary role will be to oversee AB-testing at Calm and to help in the development of a more complex and automated system that can handle our growing scale. You will help design AB experiments (e.g., identify interactions between tests, establish the stopping-criterion, etc.), statistically analyze results, present results in meetings with the executive team, and generate new tests ideas for product, growth, lifecycle, etc. In addition to AB testing, some of your time will be spent building machine-learning and statistical models that can reveal insights into the data or enable other team members to make better and faster decisions.</div>Who You Are\n\n<ul>\n<li>You have an advanced degree from a quantitative field such as economics, cognitive science, neuroscience, statistics, etc.</li><li>Experienced in designing, analyzing, and interpreting the results of experiments.</li><li>Have an expertise in the type of applied statistics, whether frequentist or bayesian, needed to test hypotheses (e.g., chi-squared, regression, multi-level modeling, etc) and design experiments (e.g., power analysis).</li><li>Fluent in Python and packages relevant to data analysis (e.g., Pandas, statsmodel, sklearn, etc)</li><li>Fluent in SQL</li> <li>Have theoretical knowledge and experience applying machine-learning models to real-life problems.</li><li>Interest and skill in data visualization and relevant tools, such as matplotlib, plotly, etc</li><li>Excellent communication skills with the ability to explain findings in layman terms</li><li>Able to communicate results and ideas to key decision makers</li><li>Scrappiness and can thrive on autonomy</li><li>The ability to identify whats important, and whats not.</li> <li>The ability to recognize that simple is sometimes best.</li>\n</ul>\n\n<div>Benefits</div><div>Competitive salary and equity</div><div>Unlimited PTO</div><div>We pay your medical, dental, &amp; vision insurance premiums</div><div>401K</div><div>Commuter benefits</div><div>Life insurance and disability benefits</div><div>Apple equipment</div><div>Fun, energetic work environment, and daily perks - snacks, drinks, catered lunch twice a week</div><div>Opportunity to work with a product focused on making the world happier and healthier</div><div>And much more!</div>"}