{"job title": "Data Scientist", "company": "Cambia", "city state": "– Portland, OR", "rating": "3.2", "job description": "We are always looking for talented and qualified Data Scientist individuals for future opportunities. Within the Data Science and Advanced Analytics Department, we offer exciting opportunities depending on your level of experience and qualifications!\n<br>\n<strong>Responsibilities &amp; Requirements:</strong>\n<br>\nCambia Health Solutions is working to create a seamless and frictionless health care experience for consumers nationwide. This presents a unique challenge and opportunity for innovative and disruptive solutions from the Data Office.\n<br>\nOur Data Scientists design, develop, and implement data-driven solutions using machine learning technologies and advanced statistical analyses. You should be passionate about finding insights in data, comfortable with large and fragmented data sets, and command a variety of analytic tools at your disposal.\n<br>\nThe ideal candidate is an independent, solution-oriented thinker with a strong background processing large data sets, applying analytical rigor and statistical methods, and driving toward actionable insights and novel solutions.\n<br>\n<strong>Responsibilities</strong>\n<br>\nResearch, design, develop, and implement machine learning technologies.\n<br>\nWork in a multi-disciplined team where you’ll take full ownership of turning discoveries and ideas into machine learning models. You’ll use the model’s output to create and improve products for our customers.\n<br>\nDesign, implement, and analyze online experiments, including A/A and A/B testing, in a variety of configuration environments.\n<br>\n<strong>Requirements</strong>\n<br>\ndegree (or equivalent experience) in a strongly quantitative field such as: Statistics, Applied Mathematics, Physics, Operations Research, Computer Science, or Econometrics and 3 years of database analytics experience or equivalent combination of education and experience. s or PhD degree preferred. Ideally, with a specialization in entity resolution/disambiguation, information retrieval, machine learning, or natural language processing.\n<br>\nExperience with state-of-the-art techniques in machine learning algorithms, including deep neural networks, NLP, kernel methods, dimensionality reduction, ensemble methods, graph algorithms, and hidden Markov models.\n<br>\nStrong analytical skills and comfortable work with large data sets and ability to transform data into actionable insights.\n<br>\n<strong>Exceptional technical skills:</strong>\n<br>\nStrong programming skills in at least one language such as Python, Java, Scala, C++, Julia\n<br>\nExperience with SQL and relational databases.\n<br>\nExperience with unstructured &amp; semi-structured data sources and requisite processing tools.\n<br>\nAbility to work in an agile environment.\n<br>\nPreferred Capabilities &amp; Responsibilities\n<br>\nPassion for helping healthy people stay well and for improving the comfort and health level of sick people as efficiently and compassionately as possible.\n<br>\nFamiliarity with retail, e-commerce, or financial analytics, including approaches such as life event modeling, customer lifetime value.\n<br>\nExperience in Hadoop, Spark, Storm or related paradigms and associated languages such as Pig, Hive, Mahout\n<br>\nExperience in AWS, Azure, or other cloud ecosystems\n<br>\nFamiliarity with NoSQL databases: DynomoDB, Cassandra, MongoDB, or Neo4j.\n<br>\nFamiliarity with Elasticsearch, Soir, or Lucene.\n<br>\nPublished work in academic conferences or industry circles.\n<br>\nDemonstrated ability to guide and contribute to research of new analytic approaches, inference algorithms, and machine learning techniques."}