{"job title": "Data Scientist - Deep Learning", "company": "Cambia Health Solutions", "city state": "– US-OR-Portland", "rating": "3.4", "job description": "Overview<br><br><strong>Data Scientist - Deep Learning</strong>\n<br><br>\n<strong>Portland, OR</strong>\n<br><br>\n<strong>We are always looking for talented and qualified Data Scientist individuals for future opportunities. Within the Data Science and Advanced Analytics Department, we offer exciting opportunities depending on your level of experience and qualifications!</strong><br><br>Responsibilities &amp; Requirements<br><br>Cambia Health Solutions is working to create a seamless and frictionless health care experience for consumers nationwide. This presents a unique challenge and opportunity for innovative and disruptive solutions from the Data Office.\n<br><br>\nOur Data Scientists design, develop, and implement data-driven solutions using machine learning technologies and advanced statistical analyses. You should be passionate about finding insights in data, comfortable with large and fragmented data sets, and command a variety of analytic tools at your disposal.\n<br><br>\nThe ideal candidate is an independent, solution-oriented thinker with a strong background processing types of data sets (e.g. images, text dataset, etc.), applying deep learning and computer vision methods, and driving toward actionable insights and novel solutions.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n <li> Research, design, develop, and implement machine learning, especially deep learning and computer vision technologies..</li> \n\n<li> Work in a multi-disciplined team where you’ll take full ownership of turning discoveries and ideas into machine learning models. You’ll use the model’s output to create and improve products for our customers.</li> \n\n<li> Design, implement, and analyze online experiments, including A/A and A/B testing, in a variety of configuration environments.</li> \n</ul>\n<strong>Requirements</strong>\n\n<ul>\n\n <li> BA/BS degree (or equivalent experience) in a strongly quantitative field such as: Statistics, Applied Mathematics, Physics, Operations Research, Computer Science, or Econometrics and 3 years of database analytics experience or equivalent combination of education and experience. Master's or PhD degree preferred. Ideally, with a specialization in deep learning, computer vision.</li> \n\n<li> Experience with state-of-the-art techniques in machine learning algorithms, including object recognition, image processing, deep neural networks, NLP, kernal methods, dimensionality reduction, ensemble methods, graph algorithms, and hidden Markov models.</li> \n\n<li> Strong analytical skills and comfortable work with large data sets and ability to transform data into actionable insights.</li> \n\n<li> Strong programming skills in at least one language such as Python, Java, Scala, C++, Julia</li> \n\n<li> Experience in deep learning frameworks such as Tensorflow, Torch, Theano and Caffe.</li>\n<li>Experience with SQL and relational databases.</li> \n\n<li> Experience with unstructured &amp; semi-structured data sources and requisite processing tools.</li> \n\n<li> Ability to work in an agile environment.</li> \n</ul>\n<strong>Preferred Capabilities &amp; Responsibilities</strong>\n\n<ul>\n\n <li> Passion for helping healthy people stay well and for improving the comfort and health level of sick people as efficiently and compassionately as possible.</li> \n\n<li>Experience in new algorithm development, model enhancements, around some key research areas regarding deep learning, object/image recognition and image processing.</li>\n<li> Experience in Hadoop, Spark, Storm or related paradigms and associated languages such as Pig, Hive, Mahout.</li>\n<li>Experience in working with GPU accelerated environments, or CUDA programming.</li>\n<li> Experience in AWS, Azure, or other cloud ecosystems.</li>\n<li> Familiarity with NoSQL databases: DynomoDB, Cassandra, MongoDB, or Neo4j.</li> \n\n<li> Familiarity with Elasticsearch, Soir, or Lucene.</li> \n\n<li> Published work in academic conferences or industry circles.</li> \n\n<li> Demonstrated ability to guide and contribute to research of new analytic approaches, inference algorithms, and machine learning techniques.</li> \n</ul>\nThis position is posted at levels I, II, Senior or Principal DOE.<br><br>About Us<br><br>At Cambia, we advocate for transforming the health care system. You aren’t satisfied with the status quo and neither are we. We're looking for individuals who are as passionate as we are about transforming the way people experience health care. We offer a competitive salary and a generous benefits package. We are an equal opportunity employer dedicated to workforce diversity and a drug and tobacco-free workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, age, sex, sexual orientation, gender identity, disability, protected veteran status or any other status protected by law. A drug screen and background check is required.\n<br><br>\nCambia’s portfolio of companies spans health care information technology and software development; retail health care; health insurance plans that carry the Blue Cross and Blue Shield brands; pharmacy benefit management; life, disability, dental, vision and other lines of protection; alternative solutions to health care access; and free-standing health and wellness solutions.\n<br><br>\nWe have nearly a century of experience in developing and providing health solutions to serve our members. We had our beginnings in the logging communities of the Pacific Northwest as innovators in helping workers afford health care. That pioneering spirit has kept us at the forefront as we build new avenues to improve access to and quality of health care for the future."}