{"job title": "Data Analyst", "company": "Cambridge Systematics", "city state": "– Medford, Massachusetts", "rating": "4.2", "job description": "<div> Position Description</div> <div>Cambridge Systematics, Inc. is shaping the future of transportation. We are industry leaders, transportation specialists dedicated to ensuring that transportation investments can deliver the best possible results. By providing innovative policy and planning solutions, objective analyses and technology applications, we help our clients anticipate and meet future transportation needs while improving the performance of existing infrastructure and operations. Above all, we are committed to our clients’ success in making transportation better for future generations.\n<br><br>\nThe Modeling or Travel Demand Forecasting (TDF) business line works to research, develop, and apply innovative and practical decision support tools, including transportation models. Our practice is built on a foundation of expert skills, quality assurance, customer service, and effective teamwork. We successfully leverage a variety of planning, engineering, market research, statistical analysis, visualization, and software development and application techniques to provide insights into existing conditions and problems, forecast alternative outcomes, and explain complex traveler (and consumer) behavior mechanisms.\n<br><br>\nWe are looking to add a Data Analyst to the team in Medford. The Data Analyst will work closely with travel demand modelers and transportation planners to implement, update, run and report the results of transportation models, as well as to analyze and communicate information from transportation data. Specifically, the Data Analyst will work to create, update and enhance transportation networks representing highway and transit conditions, as well as zonal systems that represent the location of population and employment in an area. S/he will also maintain and develop scripts that run transportation models in both specialized and open-source software platforms. The Data Analyst will initiate, oversee, troubleshoot and report model runs, and organize, analyze and interpret transportation data sets.\n<br><br>\n<u><strong>Essential Duties and Responsibilities</strong></u>\n<br><br>\n<strong>Project Delivery</strong>\n\n\n<ul>\n<li>Produces and delivers exceptional quality work that is thorough, polished, and reflects well on CS. •Delivers all projects on-time, on-budget, and to the client’s satisfaction •Possesses the technical skill necessary to deliver project assignments effectively and efficiently •Takes full ownership of all assignments, regardless of task at hand; takes a proactive approach to completing assignments. •Consistently and effectively manages time and workload. •Demonstrates good judgment in determining when to work independently and when to seek assistance. •Provides exceptional value-added service to clients (internal and external) •Strives to develop long-lasting client relationships •Actively listens and seeks to understand client needs •Maintains chargeability expectations</li>\n</ul>\n\nEOE AA M/F/VET/DISABILITY</div> <div> Position Requirements</div> <div>Bachelor’s degree required\n<br>\nExperience with C# and/or Java\n<br>\nFamiliarity with open-source software\n<br>\nExperience using GitHub repositories</div>"}