{"job title": "Data Scientist", "company": "Campbell Soup Company", "city state": "– USA - NJ - Camden", "rating": "3.2", "job description": "<strong>Imagine</strong>...working for a company that knows that its people are the key to its success in the marketplace. A company in which achieving extraordinary results and having a stimulating work experience are part of the same process.\n<br><br>\nWe cultivate and embrace a diverse employee population. We recognize that people with diverse backgrounds, experiences and perspectives fuel our growth and enrich our global culture.\n<br><br>\nWe are looking for an individual who enjoys working in a fast-paced, team oriented environment, likes to be challenged, and values the opportunity to make a difference.\n<br><br>\n<strong>Summary</strong>\n<br><br>\nData scientist is responsible for developing statistical algorithms to generate actionable recommendations that will drive disproportionate value to the Campbell’s business. The incumbent will need to have a strong quantitative background, programming skills, knowledge or interest in the CPG business, leadership presence and engagement. The incumbent must possess ability to articulate complex algorithms in practical terms to business partners to facilitate adoption and execution. Strong written and verbal communication skills to influence other are crucial.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Develop and operationalize proprietary algorithms to promote joint value creation in the food industry across retailers, making Campbell a preferred supplier.</li><li>Retrieve, cleanse, manipulate, and translate complex data into business solutions across the company.</li><li>Work with business analysts to oversee the implementation of the advanced analytics tools within business units.</li><li>Work with cross-functional stakeholders (Supply Chain, Finance, Marketing, Sales, etc.) to identify areas where data science can bring disruptive value.</li><li>Create meaningful data visualizations to communicate findings to generate buy-in and business impact</li><li>Work with data engineers to improve the existing data science infrastructure, by evaluating or implementing new tools, and overseeing the development of databases.</li><li>Provide thought leadership for the advanced analytics within the company, by providing support in training and recruitment of the new or existing talent.</li> \n</ul>\n<strong>Requirements</strong>\n<ul>\n<li>MS/PhD, in statistics, computer science, mathematics, engineering, operations research, or other quantitative field required</li><li>3- 5 years experience in Data Science and/or advance analytics required</li><li>Solid knowledge of both theory and practice of data science required. Demonstrated expertise in some or all of the following: probability, statistics, operations research, simulation, time series analysis, classification and clustering methods, variable selection, decision trees, Bayesian statistics, deep learning.</li><li>Programming: 2+ years of experience in languages such as R, Python, Spark, Scala, Java</li><li>Big Data Ecosystem: MapReduce, Hadoop, Parallel and Distributed Computing</li><li>Databases: 2+ years of database experience using SQL, Hive, or similar. Experience with data blending tools such as Alteryx or KNIME is a plus.</li><li>Familiarity with modern data science libraries and tools, including but not limited to Scipy, Scikit-learn, Pandas, Tensorflow, Keras, and similar.</li><li>Experience with visualization software such as Tableau is a plus.</li><li>Communication Skills – Business Writing and Presentation</li><li>Influencing and negotiation skills</li><li>Business acumen</li>\n</ul>\n<strong>The Company is committed to providing equal opportunity for employees and applicants in all aspects of the employment relationship, without regard to race, color, sex, sexual orientation, gender identity, national origin, citizenship, marital status, veteran status, disability, age, religion or any other classification protected by law.</strong>\n<br><br>\n<strong>In that regard, U.S. applicants and employees are protected from discrimination based on certain categories protected by Federal law. Click here for additional information.</strong>"}