{"job title": "Data Scientist", "company": "Can-Am Consultants, Inc.", "city state": "– Fremont, CA", "rating": "5.0", "job description": "Major pharmaceutical R&amp;D and manufacturing organization seeks Data Scientist who will mainly focus on data capture, management and analysis using innovative software/services for Process Science. \nThe candidate should be able to work cross-functionally to translate scientific workflows into process design with the help from the vendors and internal partners.\n \nThis role is in charge of creating process design/platform template, data capture, import data from different database/excel/other forms, help to set up API to export data from interface to statistical software, interpret the statistical analysis as needed. You will have the opportunity to learn the routine biopharm processes/practices as well as exposure to cutting-edge technologies generating different formats of data.\n \nSkills\nBasic Requirements:\n\n-B.S./M.S. in statistics, computer science, chemical engineering, biology, analytical chemistry or related field. Must have completed 12 credit hours within a related major and/or other related coursework. Overall, cumulative GPA (from last completed quarter) must be at least 3.2 (on 4.0 scale) or better\n-Proficiency using Excel, python and/or scripting languages for data capture, analysis and reporting\n-Demonstrated data-driven capability to identify and solve scientific problems\n-Strong communication and organization skills.\n-Highly self-motivated, be flexible and willing to learn.\n\nPreferred Qualities:\n\n-Experience in biopharma R&amp;D or knowledge about process development is a plus\n-Experienced using JMP, R, Spotfire, SIMCA or other software for multivariate data exploration or analysis\n-Experience in advanced data and/or statistical treatments such as machine learning\n-Experience in Design of Experiments (DoE), Partition of Variance and associated statistical methodologies highly sought\n\n \nEducation\n\n-B.S./M.S. in statistics, computer science, chemical engineering, biology, analytical chemistry or related field. Must have completed 12 credit hours within a related major and/or other related coursework. Overall, cumulative GPA (from last completed quarter) must be at least 3.2 (on 4.0 scale) or better\n\n\n<div><strong>NO CORP TO CORP SOLICITATIONS!!</strong></div>"}