{"job title": "Data Engineer - Java", "company": "Capital One", "city state": "– Richmond, VA", "rating": "3.8", "job description": "West Creek 8 (12080), United States of America, Richmond, Virginia\n<br><br>\nAt Employer, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Employer is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nData Engineer - Java\n<br><br>\nAt Employer, you'll be part of a big group of makers, breakers, doers and disruptors, who love to solve real problems and meet real customer needs. We want you to be curious and ask what if? Employer started as an information strategy company that specialized in credit cards, and we have become one of the most impactful and disruptive players in the industry. We have grown to see ourselves as a technology company in consumer finance, with great opportunities for software engineers who want to build innovative applications to give users smarter ways to save, transact, borrow and invest their money, as we seek to disrupt the industry again.\n<br><br>\nAs a Employer Data Engineer, you'll work on Fast/Big data, machine learning to customer-facing web and mobile applications using cutting-edge open source frameworks, to highly-available RESTful services, to back-end Java based systems using the hottest techniques in Big Data. You'll bring solid experience in emerging and traditional technologies such as: Spark, Hadoop, Flink, Snowflake, Machine Learning, Node.js, Java, Python, REST, JSON, XML, NoSQL databases, relational databases, Chef, Maven, and AWS/Cloud Infrastructure to name a few.\n<br><br>\nYou will:\n<br><br>\n- Work with product owners to understand desired application capabilities and testing scenarios\n<br><br>\n- Continuously improve software engineering practices\n<br><br>\n- Work within and across Agile teams to design, develop, test, implement, and support technical solutions across a full-stack of development tools and technologies\n<br><br>\n- Lead the craftsmanship, availability, resilience, and scalability of your solutions\n<br><br>\n- Bring a passion to stay on top of tech trends, experiment with and learn new technologies, participate in internal &amp; external technology communities, and mentor other members of the engineering community\n<br><br>\n- Encourage innovation, implementation of cutting-edge technologies, inclusion, outside-of-the-box thinking, teamwork, self-organization, and diversity\n<br><br>\nBasic Qualifications:\n<br><br>\n- Bachelors Degree or military experience\n<br><br>\n- At least 4 years experience in software development\n<br><br>\n- At least 3 years of experience in Java or Scala\n<br><br>\n- At least 2 years of experience in SQL or Nosql\n<br><br>\nPreferred Qualifications:\n<br><br>\n- Masters Degree\n<br><br>\n- 5+ years experience in software development\n<br><br>\n- 3+ years experience in Agile practices\n<br><br>\n- 1+ year of experience with AWS\n<br><br>\n- 1+ year of experience with Kafka\n<br><br>\n- 1+ year of experience with Spark\n<br><br>\n- Experience with CI/CD\n<br><br>\nAt this time, Employer will not sponsor a new applicant for employment authorization for this position."}