{"job title": "Data Engineer", "company": "Capital One", "city state": "– Tysons Corner, Virginia", "rating": "3.8", "job description": "7900 Westpark Drive (12131), United States of America, Tysons, Virginia\n<br><br>\nAt Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nData Engineer\n<br><br>\nAre you a high-performing software engineer passionate about building production-quality applications using cutting-edge machine learning algorithms? We experiment and innovate leveraging the latest technologies to engineer breakthrough customer experiences, and bring simplicity and humanity to banking. At Capital Ones Center for Machine Learning (C4ML), you'll be part of an elite team accelerating machine learning solutions within Capital One by building enterprise-class applications that solve big problems and meet real customer needs.\n<br><br>\nAs a Data Engineer in C4ML, you will build fast data and machine learning solutions to address some of the many complex problems in the financial services industry. Capital One leverages full stack technology solutions including streaming big data, state of the art machine learning, micro-service architecture, distributed computation engines, and intuitive visualizations in the cloud. We work with several cutting-edge technologies and actively develop and contribute to the open source community. You will work alongside highly technical peers, with deep domain expertise (from cyber threat prevention to sophisticated NLP), and partner with product and business teams to deliver game changing solutions for our customers.\n<br><br>\n#ilovedata\n<br><br>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Bachelors Degree or Military Experience</li><li>At least 2 years of experience with Python, Java or Scala</li><li>At least 2 years of experience in deploying scalable, distributed systems or multi-node database paradigms.</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>Masters Degree or PhD</li><li>At least 2 years of experience with cloud software design using microservices and distributed caching</li><li>At least 2 years of experience delivering applications from architectural design to production implementation</li><li>At least 1 year of experience working with Machine Learning, Deep Learning or Artificial Intelligence</li>\n</ul>\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position."}