{"job title": "Data Scientist", "company": "Capital One", "city state": "– McLean, Virginia", "rating": "3.8", "job description": "McLean 1 (19050), United States of America, McLean, Virginia\n<br><br>\nAt Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nData Scientist\n<br><br>\nAt Capital One, data is at the center of everything we do. When we launched as a startup we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.\n<br><br>\nAs a Data Scientist at Capital One, youll be part of a team thats leading the next wave of disruption at a whole new scale, using the latest in distributed computing technologies and operating across billions and billions of customer transactions to unlock the big opportunities that help everyday people save money, time and agony in their financial lives.\n<br><br>\nOn any given day youll be:\n<br><br>\n-Using Big Data tools (Hadoop, Spark, H2O, AWS) to conduct the analysis of billions of customer transaction records\n<br><br>\n-Writing software to clean and investigate large, messy data sets of numerical and textual data\n<br><br>\n-Integrating with external data sources and APIs to discover interesting trends\n<br><br>\n-Building machine learning models from development through testing and validation to our 30+ million customers in production\n<br><br>\n-Designing rich data visualizations to communicate complex ideas to customers or company leaders\n<br><br>\n-Investigating the impact of new technologies on the future of digital banking and the financial world of tomorrow\n<br><br>\nThe Ideal Candidate will be:\n<br><br>\n-Curious. You ask why, you explore, you're not afraid to blurt out your disruptive idea. You probably know Python, Scala, or R and youre constantly exploring new open source tools.\n<br><br>\n-Wrangler. You know how to programmatically extract data from a database and an API, bring it through a transformation or two, and model it into human-readable form (ROC curve, map, d3 visualization, Tableau, etc.).\n<br><br>\n-Creative. Big, undefined problems and petabytes of data don't frighten you. Youre used to working with abstract data, and you love discovering new narratives in unmined territories.\n<br><br>\nTwenty-five years after Capital One was started its still led by its founder. Be ready to join a community of the smartest people youve ever met, who see the customer first, and want to use their data skills to make a difference.\n<br><br>\nBasic Qualifications:\n\n\n<ul>\n<li>Bachelors Degree plus 2 years of experience in data analytics, or Masters Degree plus 1 year of experience in data analytics, or PhD</li>\n<li>At least 1 year of experience in open source programming languages for large scale data analysis</li>\n<li>At least 1 year of experience with machine learning</li>\n<li>At least 1 year of experience with relational databases</li>\n</ul>\n\nPreferred Qualifications:\n<br><br>\n-Masters Degree in STEM field (Science, Technology, Engineering, and Mathematics) plus 1 year of experience in data analytics, or PhD in STEM field (Science, Technology, Engineering, and Mathematics)\n<br><br>\n-At least 1 year experience working with AWS\n\n\n<ul>\n<li>At least 3 years experience in Python, Scala, or R</li>\n<li>At least 3 years experience with machine learning</li>\n<li>At least 3 years experience with SQL</li>\n</ul>\n\nCapital One will consider sponsoring a new qualified applicant for employment authorization for this position."}