{"job title": "Data Engineer, Senior Associate", "company": "Capital One", "city state": "– Richmond, VA", "rating": "3.8", "job description": "Towers Crescent (12066), United States of America, Vienna, Virginia\n<br><br>\nAt Employer, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Employer is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nData Engineer, Senior Associate\n<br><br>\n<strong>Location: McLean, VA</strong>\n<br><br>\nAre you passionate about technology and enjoy finding the simple route for complex problems? Are you someone who likes to understand \"why\" and is excited by bringing big ideas to life? Do you shine in a collaborative team environment?\n<br><br>\nWe are looking for a passionate technologist who thrives in collaborative teams and is comfortable mentoring others. This individual will be joining an agile team of engineers to build the next wave of data engineering solutions.\n<br><br>\n<strong>Who You Are:</strong>\n<ul>\n<li>Fun to work with you smile and solve problems.</li><li>Curious. You like to learn new technologies, adapt well to change.</li><li>Passionate. You care about growing others and bringing them together around whats possible.</li><li>You have a bias toward action, you try things, and you wear your failures as a badge of honor.</li><li>You believe that writing code is as much an art as its a science. You believe in automating everything</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Bachelors Degree or military experience</li><li>At least 3 years of experience in working on the full Software Development Life cycle (SDLC)</li><li>At least 2 years of experience with big data</li><li>At least 1 year of experience deploying Cloud applications</li><li>At least 1 year of experience working on data warehouse, Spark, ETL solution</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>5+ years of experience working on the data ecosystem.</li> <li>2+ year experience working with Hadoop based environment.</li><li>2+ year experience working on data warehouse, Spark, ETL solution.</li> <li>2+ year of experience working with Amazon Web Services (AWS)</li><li>1+ year of experience working with Docker containers</li><li>1+ year of experience working with CI/CD pipelines</li><li>Understanding of the data engineering space, specifically Hadoop based environments.</li><li>Experience with enterprise search frameworks.</li> <li>AWS Certification</li>\n</ul>\nAt this time, Employer will not sponsor a new applicant for employment authorization for this position"}