{"job title": "NLP Senior Data Scientist", "company": "Capital Group", "city state": "– Irvine, CA", "rating": "3.5", "job description": "<div><p><strong>Req ID:</strong> 21643<br><strong>Experience Level:</strong> Professional <br><strong>Other Location(s):</strong> Los Angeles (CA) <br><strong>Relocation offered: </strong>Yes<br><strong>Travel required: </strong>None</p><p><strong>Come grow with us</strong></p><p>At Capital Group, how we work is defined by shared values that include absolute integrity, respect and collaboration. But it’s more than that. It’s smart and highly driven people united in purpose to serve our investors and one another.</p><p>Bring your energy and unique perspective to Capital and you’ll have the opportunity to grow with us professionally, personally, and financially. You’ll be part of a team that genuinely cares about helping you succeed. You’ll work alongside talented colleagues, many of whom build long careers while progressing through multiple roles, establishing lifelong friendships and making a difference in our communities. In return for your contributions, you’ll receive premier compensation and benefits, and a company-funded retirement plan that ranks among the most generous.</p><div>The Advanced Analytics Group reports into the North America Distribution Insights &amp; Analytics organization as a new function driving business value through the use of internal and external data, predictive analytics and data science. The group focuses on providing cutting edge data and analytic solutions which will be used to support sales and marketing efforts within North America Distribution. </div><div> </div><div>You will be experienced with and passionate about using data to drive business strategy, tactical program recommendations and identify new areas of ROI through the use of the firm’s data assets. You are a self-starter with a high degree of rigor, organization, and discipline to get things done. You are able to communicate effectively in delivering complex data-driven findings across the distribution group. You are an independent, solution-oriented thinker with a strong background processing large data sets, applying analytical rigor and statistical methods, and driving toward insights and solutions. </div><div> </div><div><strong>Responsibilities:</strong></div><ul><li>Leverage structured and unstructured data to solve both tactical and strategic business problems. </li><li>Develop machine learning and deep learning models to create intelligent software applications used by sales and marketing teams.</li><li>Analyze advisor, investor and economic trends that impact sales/marketing/business performance and recommend ways to improve outcomes.</li><li>Develop pattern recognition algorithms by identifying and integrating internal and external sources of information using analytical tools and techniques.</li><li>Perform complex data manipulation and analytics, while working with business functions to identify and to respond to complex technical and business problems.</li><li>Interpret and communicate analytic results to analytical and non-analytical business partners and senior managers.</li></ul><div> </div><div><strong>Qualifications: </strong></div><ul><li>Degree in Computer Science, Mathematics, Cognitive Science, Neuroscience, Computational Linguistics, Operations Research, or related field. Master’s degree is required and PhD degree is preferred.</li><li>4+ years of relevant experience with a proven track record of leveraging analytics and large amounts of data to drive significant business impact.</li><li>Passion for learning and innovating new methodologies in the intersection of applied math, computer science, and statistics. Proficiency in translating business problems into concrete mathematical framework. Strong problem solving skills. </li><li>Expertise in machine learning, deep learning, natural language processing, and data mining algorithms. Must have knowledge/experience in all of the following: relational databases, linear and logistic regression, support vector machines, tree methods, ensemble methods, regularization, model selection, common clustering algorithms, common optimization algorithms, deep learning frameworks and methods for natural language processing and computer vision. Experience with recommender systems is a plus.</li><li>Proficiency in SQL and at least one common data analysis language such as Python, R, Matlab or SAS (Python and R are preferred).</li><li>Knowledge of common data structures and ability to write efficient code in at least one programming language (preferably Python, Scala, F#, Java, C#, or C++).</li><li>Experience with cloud analytics platforms such as Microsoft Azure/AWS/Google Cloud Platform.</li><li>Experience with distributed systems and query languages like Spark/Hive/Pig and/or general map reduce computing is a plus. </li></ul><p> </p><p> </p><p><strong>Company Overview:</strong><br>Founded in 1931, Capital Group is one of the world’s largest and most trusted investment management companies and home to the American Funds. We manage more than US$1.39 trillion in assets, and our 7,500 associates make our clients their first priority every day. When we do our job right, millions of investors around the world fulfill their dreams and financial goals, from home ownership and higher education, to a comfortable retirement. Our long-term investment results and outstanding service set us apart from our competitors, while our workplace sets us apart from other employers. <br> </p><p><em>We are an equal opportunity employer, which means we comply with all federal, state and local laws that prohibit discrimination when making all decisions about employment. As equal opportunity employers, our policies prohibit unlawful discrimination on the basis of race, religion, color, national origin, ancestry, sex (including gender and gender identity), pregnancy, childbirth and related medical conditions, age, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, citizenship status, AIDS/HIV status, political activities or affiliations, military or veteran status, status as a victim of domestic violence, assault or stalking or any other characteristic protected by federal, state or local law. </em></p></div>"}