{"job title": "Data Engineer, Finance Tech (Richmond or NoVa)", "company": "Capital One", "city state": "– McLean, VA", "rating": "3.8", "job description": "West Creek 3 (12073), United States of America, Richmond, Virginia\n<br><br>\nAt Employer, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Employer is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nData Engineer, Finance Tech (Richmond or NoVa)\n<br><br>\nThe <strong> Finance Technology</strong> team at Employer is searching for innovative and analytical data engineers to join our team in <strong>Richmond, VA and Mclean, VA.</strong>  Our data engineers are multilinguists who can speak the languages of how we operate as a business, how that business impacts our financials, and the latest technologies that are reshaping our Finance Tech landscape.\n<br><br>\nIn this role, you will be responsible for building generic data pipelines &amp; frameworks using <strong>open source</strong> tools on public <strong>Cloud</strong> platforms. The right candidate for this role is someone who is passionate about technology, interacts with product owners and technical stakeholders, thrives under pressure, and is hyper-focused on delivering exceptional results with good teamwork skills. Human centered design is the underlying framework for this candidate who will have the opportunity to influence and interact with fellow technologists beyond his team and influence technology partners across the enterprise.\n<br><br>\n* We are hiring for <strong>Principal Associate and Manager</strong> level <strong>Data Engineer</strong>s in the <strong>McLean/NoVa &amp; Richmond areas. *</strong>\n<br><br>\n<strong>The Job &amp; Expectations</strong>:\n<ul>\n<li>Partner with product owners, peers, and end-users to understand business requirements</li><li>Be the intersection with lines of business, <strong>Finance</strong> and <strong>technology</strong>. The ability to understand various perspectives is critical when optimizing an engineering solution</li><li>Provide technical guidance concerning business implications of application development projects</li><li>Leverage <strong>ETL</strong> programming skills in open source languages including P<strong>ython, Scala and SQL</strong> on various frameworks especially <strong>Apache Spark</strong></li><li>Deploy <strong>DevOps</strong> techniques and practices like <strong>Continuous Integration, Continuous Deployment, Test Automation, Build Automation</strong> and <strong>Test-Driven Development</strong> to enable the rapid delivery of working code utilizing tools like <strong>Jenkins, Nexus, Git and Docker</strong></li><li>Manage multiple responsibilities in an unstructured environment where you're empowered to make a difference. In that context, you will be expected to research and develop cutting edge technologies to accomplish your goals</li>\n</ul>\n<br><br>\n<strong>Skills and Experience</strong>\n<ul>\n<li>Comfortable interpreting <strong>legacy Ab Initio logic</strong> which will be <strong>re-coded in new open source languages and cloud technologies</strong></li><li>Experience with <strong>Cloud computing</strong>, preferably <strong>AWS</strong> and its services including <strong>S3, EMR/EC2 and Lambda</strong> functions</li><li>2 years of experience delivering <strong>big data solutions</strong> using <strong>open-source languages</strong> such as<strong> Python and Scala</strong> on <strong>Apache Spark framework</strong></li><li>5 or more years experience working on data projects</li><li>4 years of work experience in data management engineering</li><li>3 years of experience in <strong>scripting languages</strong> (e.g. <strong>UNIX shell scripting, perl, etc.)</strong></li>\n</ul>\n<br><br>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Bachelor's Degree or military experience</li><li>At least 1 year of experience developing, deploying, testing in AWS public cloud</li><li>At least 2 year of experience in system analysis</li><li>At least 2 years of experience delivering big data solutions using open-source languages</li> <li>At least 3 years of experience in scripting languages</li> <li>At least 3 years of experience leveraging SQL for database querying</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>3+ years experience in at least one scripting language</li><li>5+ years experience developing full stack software solutions</li> <li>3+ years of experience in AWS Cloud computing</li> <li>1+ years of experience in an Agile delivery environment</li><li>AWS certification</li>\n</ul>\n<strong>At this time, Employer will not sponsor a new applicant for employment authorization for this position.</strong>"}