{"job title": "Senior Data Analyst", "company": "Capital One", "city state": "– New York, NY", "rating": "3.8", "job description": "114 5th Ave (22114), United States of America, New York, New York\n<br><br>\nAt Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nSenior Data Analyst\n<br><br>\nAs a Data Analyst at Capital One you will leverage analytic and technical skills to innovate, build, and maintain well-managed data solutions and capabilities to tackle business problems.\n<br><br>\nOn any given day you will be challenged on three types of work Innovation, Data Management and Business Intelligence:\n<br><br>\n<u>Innovation</u>\n<ul>\n<li>Use Open Source/Digital technologies to mine complex, voluminous, and different varieties of data sources and platforms</li></ul>\n\n<ul>\n<li>Build well-managed data solutions, tools, and capabilities to enable self-service frameworks for data consumers</li>\n<li>Demonstrate ability to explore and quickly grasp new technologies to progress varied initiatives</li>\n</ul>\n<u>Business Intelligence</u>\n<ul>\n<li>Partner with the business to provide consultancy and translate the business needs to design and develop tools, techniques, metrics, and dashboards for insights and data visualization.</li>\n</ul>\n<u>Data Management</u>\n<ul>\n<li>Drive an understanding and adherence to the principles of data quality management including metadata, lineage, and business definitions</li>\n<li>Work collaboratively with appropriate Tech teams to manage security mechanisms and data access governance</li>\n<li>Build and execute tools to monitor and report on data quality</li>\n</ul>\n<u>Our ideal candidate will have:</u>\n<ul>\n<li>Degree specialized in a Science, Technology, Engineering, Mathematics discipline</li></ul>\n<ul>\n<li>Scripting experience in (Python, Perl, JavaScript, Shell)</li></ul>\n<ul>\n<li>Strong desire and experience with data in various forms (data warehouses/SQL, unstructured data environments/PIG,HIVE, Impala)</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Bachelors Degree</li></ul>\n<ul>\n<li>At least 1 year of experience in at least one scripting language</li></ul>\n<ul>\n<li>At least 1 year of experience in querying and analyzing and working with data languages and platforms</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>Masters Degree in a Science, Technology, Engineering, Mathematics discipline</li></ul>\n<ul>\n<li>1+ years experience working BI reporting tools (i.e. Tableau and Business Objects)</li>\n<li>1+ years of experience working within process management and improvement methodologies Lean, Six Sigma, etc.</li>\n<li>1+ years of experience working with and demonstrating knowledge of data governance, data quality management concepts and data quality tools (i.e. Informatica DQ)</li>\n<li>1+ years of experience working with Agile development methodologies</li>\n</ul>\n<strong>Capital One will consider sponsoring a new qualified applicant for employment authorization for this position.</strong>\n<br><br>\n<strong>TBLI</strong>"}