{"job title": "Senior Data Scientist", "company": "Capital Group", "city state": "– Los Angeles, CA", "rating": "3.6", "job description": "<strong>Req ID:</strong> 22804\n<br>\n<strong>Experience Level:</strong> Professional&nbsp;\n<br>\n<strong>Other Location(s):</strong>&nbsp;N/A\n<br>\n<strong>Relocation offered:</strong> Yes\n<br>\n<strong>Travel required:</strong> None\n<br><br>\n<strong>Come grow with us</strong>\n<br><br>\nAt Capital Group, how we work is defined by shared values that include absolute integrity, respect and collaboration. But it’s more than that. It’s smart and highly driven people united in purpose to serve our investors and one another.\n<br><br>\nBring your energy and unique perspective to Capital and you’ll have the opportunity to grow with us professionally, personally, and financially. You’ll be part of a team that genuinely cares about helping you succeed. You’ll work alongside talented colleagues, many of whom build long careers while progressing through multiple roles, establishing lifelong friendships and making a difference in our communities. In return for your contributions, you’ll receive premier compensation and benefits, and a company-funded retirement plan that ranks among the most generous.\n<br><br>\nOur Data Solutions team is focused on enriching core investment and distribution processes, quantitative analytics, reporting and analysis, and artificial intelligence. We are focused on defining Capital Group's investment data strategy to establish a comprehensive set of data capabilities. We are implementing and evolving to enable the full range of business objectives. We use data to minimize risk and increase efficiency/effectiveness.\n<br><br>\nOur team is looking for a data expert to stand-up our fundamental capabilities to source, automate, and curate data with quality data access. Eventually you will help us build-out our Data Science function and mentor 3-5 additional associates.\n<br><br>\n<u><strong>Responsibilities:</strong></u>\n<ul>\n<li>Leverage structured and unstructured data to solve tactical and strategic problems</li><li>Develop machine learning and deep learning models to create intelligent software applications used by Investment Operations teams</li><li>Create pattern recognition algorithms by identifying and integrating internal and external sources of information using analytical tools and techniques</li><li>Perform complex data manipulation and analytics, while working with business functions to identify and to respond to complex technical and business problems</li><li>Interpret and communicate analytic results to analytical and non-analytical business partners and senior managers</li>\n</ul>\n<u><strong>Qualifications:</strong> </u>\n<ul>\n<li>Master’s degree required</li> <li>4+ years’ directly applicable experience leveraging data to drive significant business impact</li><li>Creating new methodologies in the intersection of applied math, computer science, and statistics</li> <li>Proficiency in translating business problems into concrete mathematical framework</li><li><u>Communication Skills:</u>\n\n<ul>\n<li>Clear and concise</li><li>Storyteller</li><li>Adapt to different audiences</li><li>Data visualization and presentation</li></ul></li>\n\n<strong></strong><li><strong><u>Technical Skills:</u>\n<br>\n</strong>\n\n<ul>\n<li>Programming</li><li>Quantitative analysis</li><li>Machine learning, deep learning, natural language processing</li><li>Data mining algorithms</li><li>Data analysis languages; Python, R, Matlab, or SAS</li><li>Cloud analytics platforms; Microsoft Azure, AWS, Google Cloud</li><li>Distributed Systems</li><li>Query languages; Spark, Hive, Pig</li><li>SQL</li><li>Write efficient code; Python, Scala, F#, Java, C#, C++</li></ul></li>\n\n&nbsp;\n<br><br>\n<strong>Company Overview:</strong>\n<br>\nFounded in 1931, Capital Group is one of the world’s largest and most trusted investment management companies and home to the American Funds. We manage more than US$1.39 trillion in assets, and our 7,500 associates make our clients their first priority every day. When we do our job right, millions of investors around the world fulfill their dreams and financial goals, from home ownership and higher education, to a comfortable retirement. Our long-term investment results and outstanding service set us apart from our competitors, while our workplace sets us apart from other employers.&nbsp;\n<br>\n&nbsp;\n<br><br>\n<em>We are an equal opportunity employer, which means we comply with all federal, state and local laws that prohibit discrimination when making all decisions about employment. As equal opportunity employers, our policies prohibit unlawful discrimination on the basis of race, religion, color, national origin, ancestry, sex (including gender and gender identity), pregnancy, childbirth and related medical conditions, age, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, citizenship status, AIDS/HIV status, political activities or affiliations, military or veteran status, status as a victim of domestic violence, assault or stalking or any other characteristic protected by federal, state or local law.&nbsp;</em></ul>"}