{"job title": "Senior Data Engineer", "company": "Capital One", "city state": "– Tysons Corner, Virginia", "rating": "3.8", "job description": "7900 Westpark Drive (12131), United States of America, Tysons, Virginia\n<br><br>\nAt Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nSenior Data Engineer\n<br><br>\nWe are looking for intellectually curious and driven individuals to join our team of talented data engineers and create cutting-edge Big Data solutions for Capital Ones Cloud and on-premises data platforms.\n<br><br>\nOn any given day you will:\n<br><br>\n·Develop Big Data applications using technologies such as Java, Scala,Hadoop, Spark, MapReduce, REST API, Hive, AWS, S3, Postgres\n<br><br>\n·Develop solutions to enable auditing and data usage monitoring in our Cloud platforms.\n<br><br>\n·Work directly with Product Owners and end- develop solutions in a hi highly collaborative and agile environment.\n<br><br>\n·Help grow and mentor team members on the fine art of data engineering and software abstractions\n<br><br>\n·Passion for learning, growing, and mentoring in a team environment\n<br><br>\nWhat we have:\n<br><br>\n· Flexible work schedules\n<br><br>\n· Generous salary and merit-based pay incentives\n<br><br>\n· A startup mindset with the wallet of a top 10 bank\n<br><br>\n· Monthly innovation challenges dedicated to test driving cutting edge technologies\n<br><br>\n· Your choice of equipment (MacBook/PC, iPhone/Android Device)\n<br><br>\nBasic Qualifications\n<br><br>\n·Bachelor's Degree or Military experience\n<br><br>\n·At least 3 years of experience in Java or Scala\n<br><br>\n·At least 3 years of experience with Unix/Linux systems with scripting experience in Shell or Python\n<br><br>\nPreferred Qualifications\n<br><br>\n·Masters Degree\n<br><br>\n·2+ years of experience delivering analytical data warehouse solutions or fit\n<br><br>\nfor purpose data stores\n<br><br>\n·3+ years of experience building data pipelines and fit for purpose\n<br><br>\n·data stores\n<br><br>\n·1+ years of experience working with Spark, Hadoop, AWS, SQL, Database\n<br><br>\n·design and Modeling\n<br><br>\n·1 + years of experience working with automated build and continuous\n<br><br>\n·integration systems\n<br><br>\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position."}