{"job title": "Tech Lead, Data Engineering", "company": "Capital One", "city state": "– Richmond, VA", "rating": "3.8", "job description": "West Creek 3 (12073), United States of America, Richmond, Virginia\n<br><br>\nAt Employer, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Employer is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n<br><br>\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.\n<br><br>\nTech Lead, Data Engineering\n<br><br>\nWe are looking for intellectually curious and driven individuals to join our team of talented data engineers and create cutting-edge Big Data solutions for Employers Cloud and on-premises data platforms.\n<br><br>\nOn any given day, you will:\n<ul>\n<li>Develop Big Data applications using technologies such as Python, Spark, Representational State Transfer (REST) Application Programming Interface (API), Hive, Amazon Web Services (AWS), Amazon Simple Storage Service (S3), Postgres</li> <li>Develop solutions to enable auditing and data usage monitoring in our Cloud platforms.</li><li>Work directly with Product Owners and end-users to develop solutions in a highly collaborative and agile environment.</li><li>Help grow and mentor team members on the fine art of data engineering and software abstractions</li><li>Passion for learning, growing, and mentoring in a team environment</li>\n</ul>\nWhat we have:\n<ul>\n<li>Flexible work schedules</li><li>Richmond is one of the Top 10 U.S. Cities to Visit</li><li>Convenient office locations</li><li>Generous salary, benefits packages, and merit-based pay incentives</li><li>A startup mindset with the wallet of a top 10 bank</li><li>Monthly innovation challenges dedicated to test driving cutting edge technologies</li><li>Your choice of equipment (MacBook/PC, iPhone/Android Device)</li>\n</ul>\n<strong>Basic Qualifications</strong>:\n<ul>\n<li>Bachelors Degree or military experience</li><li>At least 4 years of data analysis experience</li><li>At least 3 years of experience in Data Management, ETL (Extract, Transform, Load) jobs, tables, and models in a Data Warehousing or unstructured data environments.</li><li>At least 2 years of experience in people management</li>\n</ul>\n<strong>Preferred Qualifications</strong>:\n<ul>\n<li>Masters Degree</li><li>7+ years of data analysis experience</li><li>4+ years of experience with PowerPoint and Excel</li><li>1+ years of project management experience</li><li>1+years of experience with AWS, Redshift, or PostgreSQL</li><li>1+ years of experience with R or Python</li><li>1+ years of experience in Tableau</li>\n</ul>\nAt this time, Employer will not sponsor a new applicant for employment authorization for this position."}