{"job title": "Res Scientist-NA Pharmacovigilance", "company": "Cardiac Pacemakers", "city state": "– Greenfield, Indiana", "rating": "3.0", "job description": "Res Scientist-NA Pharmacovigilance\n<br><br>\n23-Sep-2018\n<br><br>\n22-Dec-2018\n<br><br>\n<strong>Responsibilities</strong>\n<br>\n<strong>Position Description:</strong>\n<br>\nThe Pharmacovigilance (PV) Research Scientist provides leadership for and performs key functions within the Elanco Animal Health Global Pharmacovigilance Unit. The individual provides direction to internal and external partners in the collection, analysis, interpretation and reporting of adverse event (AE) data. In addition, the individual is responsible for collaborating with PV colleagues to develop a comprehensive signal detection and trending program to ensure product safety at a global level.\n<br><br>\n<strong>Functions, Duties, Tasks</strong>:\n<br>\n<strong>Key Leadership Responsibilities:</strong>\n\n<ul>\n<li>Proactively search for solutions.</li><li>Work effectively and flexibly within and across all Elanco R&amp;D teams and external collaborators to achieve overall Elanco R&amp;D deliverables.</li><li>Create a positive work environment that is aligned with company objectives.</li><li>Provide and accept challenge to deliver innovative technical solutions and create an innovative culture.</li><li>Create an engaging culture with a “Play to Win” mentality.</li><li>Identify and utilize methods to deliver individual objectives in a high quality, timely, cost-effective manner.</li><li>Provide information to facilitate accurate and timely project and budget forecasts.</li><li>Provide effective leadership and technical coaching to team members and/or direct reports</li><li>As appropriate, represent Elanco GPV at regulatory agency meetings and industry working groups. Seize any opportunities to influence the external animal health environment on the strategy and application of data mining technologies (e.g. through chair of the PV Analyser Subcommittee, AHI WG7, AAVPT, ACVCP).</li>\n</ul>\n\n<strong>Key Technical Responsibilities:</strong>\n\n<ul>\n<li>Understand and ensure compliance with local and global PV Regulations.</li><li>Provide direction to call center regarding case entry conventions to ensure consistency and follow up necessary for regulatory submission. Call center maintains customer relationship and owns decisions on how to handle that interaction once regulatory requirements are met.</li><li>Participate in Signal Detection and Trending (SDT) for assigned products.</li><li>Communicate SDT information as needed in region/affiliate.</li><li>Collaborate with the Global PV team to implement a global strategy and work flow processes for signal detection and trending.</li><li>Contributes to PV guidance/questions in the region &amp; ensure responses align with Global PV processes.</li><li>Participate in case oversight process for cases in region and outside region as feasible.</li><li>Maintain and build relationship with Regulatory Authorities (RAs) related to PV; always be the single point of contact for RAs with regard to PV in the region/affiliate.</li><li>Liaise with quality to ensure appropriate connection between AEs and PCs.</li><li>Review, analyze and interpret data to identify potential safety trends and signals in order to make recommendations for risk mitigation/management.</li><li>Provide support for internal business partners by providing appropriate scientific/statistical interpretation of PV data. Ensure an accurate representation of the data collection and analysis process to internal customers.</li><li>Prepare, interpret and present aggregate data to internal and external customers and global regulatory authorities, as appropriate.</li><li>Provide interpretation of PV requirements to Elanco and contract personnel. Provide PV training and ongoing technical input to business partners (internal and external), as appropriate, regarding AE data contained within PV Works and other tools.</li><li>Lead and/or support key PV projects to assure safety information drives labeling and promotional material changes for currently marketed products, as required.</li><li>Proactively enhance work flow practices to increase data robustness while promoting efficiency.</li><li>Provide support to the technical review and interpretation of scientific data. Network with and provide guidance to teams working on new product development.</li>\n</ul>\n\n<strong>Req ID</strong>\n<br>\n<strong>44621BR</strong>\n<br><br>\n<strong>Additional Skills/Preferences</strong>\n\n<ul>\n<li>Desired, Doctor of Veterinary Medicine (DVM)</li>\n</ul>\n\n<strong>Additional Information</strong>\n<br>\nLilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n<br><br>\n<strong>Title</strong>\n<br>\nRes Scientist-NA Pharmacovigilance\n<br><br>\n<strong>Job Category</strong>\n<br>\nAnimal Health\n<br><br>\n<strong>Basic Qualifications</strong>\n\n<ul>\n<li>PhD degree with 2 years or master degree with 10 years experience in pharmacovigilance</li>\n</ul>\n\n<strong>Company Overview</strong>\n<br>\nElanco is a global research-based company that develops and delivers product and services to enhance animal health and production. We value innovation, both in scientific research and daily operations, and strive to cultivate a collaborative work environment for more than 7,000 employees worldwide. Founded in 1954, Elanco is a division of Lilly. Our worldwide headquarters and research facilities are in Greenfield, Indiana.\n<br><br>\n<strong>City</strong>\n<br>\nGreenfield\n<br><br>\n<strong>Country</strong>\n<br>\n<strong>USA</strong>\n<br><br>\n<strong>State / Province</strong>\n<br>\nIndiana\n<br><br>\n<strong>Region</strong>\n<br>\nNorth America\n<br>"}