{"job title": "Senior Data Science Engineer - Algorithmic", "company": "CarGurus", "city state": "– Cambridge, MA", "rating": "4.6", "job description": "Meet CarGurusthe #1 visited online car shopping website in the US. At CarGurus, we're building the world's most trusted and transparent automotive marketplace where it's easy to find great deals from top-rated dealers.\n<br><br>\nFounded in 2006 by Langley Steinert (co-founder of TripAdvisor), CarGurus is a technology company with a passion for data and its power to simplify every aspect of the car shopping experience. Using proprietary technology, search algorithms and innovative data analytics, we provide unbiased validation on pricing, dealer reputation and vehicle history.\n<br><br>\nCarGurus' Algorithmic Traffic Acquisition team is looking to hire a Senior Data Science Engineer. Our goal is to bring car shoppers to CarGurus as efficiently as possible. We're central to CarGurus' growth strategy, both in the US and abroad. This is a high impact role with exceptional visibility within the company.\n<br><br>\nOne of our core beliefs is that useful data will lead to the best outcomes. We make decisions based on our data and insights. The Data Science Engineer will work closely with our data scientists, helping productizing our newest data science approaches and solutions. There will be great projects that can be both challenging and long term.\n<br><br>\n<strong>What You'll Do:</strong>\n<br><br>\nAt CarGurus, we expand our reach by finding new ways to identify car shoppers. We scale our efforts to handle and take advantage of ever-increasing volumes of traffic and data. To be able to do so, we improve our efficiency by developing algorithms and heuristics that analyze our data and adjust bids via partner APIs to show ads to people based on the likelihood that they'll find CarGurus useful.\n<br><br>\nWe advertise on several platforms, in multiple countries, targeting millions of people. Managing, optimizing and bidding all our ads requires efficient and scalable architecture that can update and process large amounts of data. As a part of the team, you will work closely with our data scientists, as well as independently. Our goal is to build and evolve the engine while we expand to new advertising platforms, new countries, and scale up our targeting to hundreds of millions of keywords.\n<br><br>\n<strong>Who You Are:</strong>\n\n<ul>\n<li>5+ years of programming experience</li>\n<li>Strong ability to write high quality code and tests</li>\n<li>Excellent knowledge of SQL and strength with queries and tables</li>\n<li>Deep engineering experience with Python coding, including with Python data science libraries such as Pandas, Numpy, SQLAlchemy, Scikit-learn, Tensorflow and Keras</li>\n<li>Experience with cloud computing (e.g. AWS), REST Interfaces</li>\n<li>Experience productizing data science code with Docker</li>\n<li>Experience coding in Ruby on Rails (preferred)</li>\n<li>Experience with big data technologies for data science engineering, including Spark (preferred)</li>\n</ul>\n<strong>CarGurus Culture:</strong>\n<br><br>\nAt the core of our company culture is a spirit of innovation, curiosity and collaboration. True to our start-up roots, we're nimble, flexible and hardworking. We have a great respect for testing and learning and a healthy aversion to scheduling meetings to discuss meetings. Lunch is catered daily. Gym membership is free. Foosball and ping pong are played often. Now a publicly-traded company, we're as committed as ever to cultivating the culture that got us here.\n<br><br>\nIn addition to the US, CarGurus operates sites in Canada, the UK and Germany with other markets on the horizon. Our offices are located in Cambridge, MA, Detroit, MI and Dublin, Ireland. If you'd like to learn more, please visit our careers page."}