{"job title": "Data Scientist", "company": "Carters, Inc", "city state": "– Atlanta, GA", "rating": "3.5", "job description": "<strong>Job Description:</strong><br><br>Carter's, Inc. is the largest branded marketer in North America of apparel exclusively for babies and young children. The Company owns the <em>Carter's</em> and <em>OshKosh B'gosh</em> brands, two of the most recognized brands in the marketplace. These brands are sold in leading department stores, national chains, and specialty retailers domestically and internationally. They are also sold through more than 1,000 Company-operated stores in the United States, Canada, and Mexico and online at www.carters.com, www.oshkoshbgosh.com, and www.cartersoshkosh.ca. The Company's <em>Just One You</em> and <em>Genuine Kids</em> brands are available at Target, its <em>Child of Mine</em> brand is available at Walmart, and its <em>Simple Joys</em> brand is available on Amazon. The Company also owns <em>Skip Hop</em>, a global lifestyle brand for families with young children. Carter's is headquartered in Atlanta, Georgia. Additional information may be found at www.carters.com.<br><br>Provide reporting and analysis to support business partners across multiple brands and channels. Includes customer dashboard reporting; marketing, loyalty, and direct marketing reporting &amp; analysis; and ad-hoc Direct to Consumer business requests.\n<br><br>\n50% - Business analytics<br><br>- Provide insights through data analysis and reporting that aids decision making: gather requirements, create and analyze reports, and translate into actionable recommendations and strategies<br><br>- Support analysis of marketing campaigns through customer segmentation and profiling, design of experiment, and data mining<br><br>- Generate and analyze reports designed to optimize marketing spend<br><br>- Analyze and report on test and learn experiments across marketing channels (A/B, direct mail, digital, email testing)<br><br>- Develop strategies to measure consumer response across channels and brands and quantify the overall impact of multi-channel initiatives<br><br>- Spot potential to implement innovative new methodologies and improve reporting process<br><br>- Enhance existing reporting tools on an on-going basis to accommodate evolving business needs.<br><br>- Monitor and analyze key metrics; use available data sources to deep dive and troubleshoot KPI metrics<br><br>- Define and create lifetime value of customers and segments<br><br>- Work closely with team members to provide accurate forecast projections/goals across marketing channels\n<br><br>\n30% - Predictive model development<br><br>- Design and develop algorithms and models to use against large datasets to create business insights<br><br>- Key contributor in all predictive analytics and data modeling efforts<br><br>- Develop and maintain predictive models to be used in marketing campaigns\n<br><br>\n20% - Presenting findings to key stakeholders<br><br>Present analysis and resulting recommendations to senior management; Leverage data to present a compelling business case to optimize investments and operations\n<br>\nRequired Experience:<br><br>- Strong quantitative skills coupled with business foundation, especially in Marketing Measurement, Loyalty, and eCommerce.<br><br>- Efficiently use large databases and external data sources<br><br>- Expert knowledge in large scale information retrieval and statistical analysis<br><br>- Working knowledge of relational databases and systems processing<br><br>- Strong financial analysis skills, including P&amp;L and ROI analysis<br><br>- Present data in an actionable and useful way to allow business owners to make decisions<br><br>- Able to manage multiple analysis and requests at once. Able to flex to handle Ad-hoc, quick turn report requests.<br><br>- Self-motivated and able to operate independently, as well as work effectively with others.<br><br>- Has natural curiosity about the business and customer<br><br>- Experience with testing methodologies<br><br>- SQL experience<br><br>- Advanced Excel &amp; PowerPoint Skills<br><br>- Undergrad in STEM (Science, Technology, Engineering or Mathematics), Advanced degree preferred<br><br>- 5-10 Years of experience with reporting and database query tools<br><br>- 5-10 Years of experience developing and presenting business conclusions based on data analysis<br><br>- Retail experience strongly preferred<br><br>Carters is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, genetics, disability, age, veteran status, or any other status protected by federal, state, or local law.\n<br>\nVisit http://carters.submit4jobs.com/ today\n<br><br>\nFrom: Carters, Inc"}