{"job title": "Senior Data Engineer", "company": "Castlight Health", "city state": "– San Francisco, CA, United States", "rating": "4.0", "job description": "Castlight is looking for seasoned data engineers who have a penchant for problem solving with a passion for innovation to join our Provider Directory data engineering team. You must be comfortable dealing with large sets of imperfect data and designing components to process it. You will be working in the context of a complex set of systems within a multi-tier enterprise architecture. As our data volume explodes, you will apply your deep knowledge of performance, scalability, and optimization to make appropriate recommendations, as well as to help materialize them.\n<br><br>\nTo succeed in this role, you'll need to be a versatile engineer. You must have an innate desire to build things the right way. You should be pain-averse -- if some process or system isn't as streamlined as it could be, you want to fix it! You want to accelerate your career growth by taking on a role that will give you deep knowledge of a complex system, acting as the gatekeeper of the results. Finally, you should want to communicate and collaborate with a team of smart people just like you.\n<br><br>\n<strong>\n<br>\nResponsibilities:</strong>\n<ul>\n<li>Participate in development efforts incorporating new data sources, as well as in support of infrastructure improvements</li><li>Provide architectural and technical leadership to improve and scale our existing data store capabilities</li><li>Enjoy working in a collaborative engineering team, analyzing data, writing code and validating the resulting data</li><li>Participate in design discussions, sizing exercises, and code reviews</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>BS or MS in Engineering or Computer Science, or related technical field</li><li>5+ years of experience in production software development, preferably in a SaaS environment</li><li>Experience handling complex data sources and large scale batch data infrastructure</li><li>Proficiency in writing SQL queries, performance tuning, and data analysis</li><li>Proficiency in Python, or another object-oriented programming language such as Ruby or Java</li><li>Experience working with very large data warehouses</li><li>Knowledge of PostgreSQL and Greenplum a plus</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}