{"job title": "Senior Software Engineer, Data Science", "company": "Castlight Health", "city state": "– San Francisco, CA, United States", "rating": "4.0", "job description": "Help us bring the U.S. healthcare system into the 21st century and shed light on what is an opaque and un-navigable experience for most Americans. We're looking for software engineers to improve the predictive pricing engine powering Castlight's cost estimation tools and infer information about the quality of doctors. Our goal is to help our users understand their healthcare options, predict how much medical procedures are likely to cost them and choose the best quality providers.\n<br><br>\n<strong>WHAT YOU'LL DO:</strong>\n<br><br>\nDesign and build the predictive algorithms and data pipelines that power Castlight's medical cost estimation tools. Derive accurate insights out of billions of medical claims and terabytes of rich healthcare data.\n<br><br>\nImprove the performance and scalability of our predictive pricing engine. Develop a robust data infrastructure to manage our batch workloads, and identify potential improvements to our technical stack.\n<br><br>\nTackle difficult problems in an incredibly complex domain, and modernize the healthcare experience for millions of people.\n<br><br>\nMine billions of healthcare claims for information that will help us steer users to the best quality doctors.\n<br><br>\n<strong>ABOUT YOU:</strong>\n<br><br>\n5+ years of programming experience\n<br><br>\nBachelor's in Computer Science or related field (MS or PhD preferred)\n<br><br>\nStrong experience with a dynamic language, such as Python or Ruby, or OOP with Java or C++\n<br><br>\nSolid CS fundamentals; understanding of scaling and performance tradeoffs when dealing with large data sets\n<br><br>\nExperience with relational databases\n<br><br>\nAbility to perform independent research and analysis of complex data sets and communicate insights derived from this research to other stakeholders\n<br><br>\n<strong>BONUS IF YOU HAVE...</strong>\n<br><br>\nExperience with MPP databases (e.g., Greenplum, Redshift) or distributed data processing frameworks (e.g., Spark)\n<br><br>\nExposure to machine learning and statistical methods\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}