{"job title": "Business Intelligence and Analytics Manager", "company": "Catholic Medical Center", "city state": "– Manchester, NH", "rating": "3.9", "job description": "The Business Intelligence and Analytics (BIA) Manager will support data analytic strategies across the organization and help produce new business analytics and intelligence solutions for CMC. They will work closely with leaders across various departments to identify and address high priority business issues and opportunities. Working collaboratively with the departments, the BIA Manager will gain a working knowledge of many areas of the organization and understand the dependencies and processes that impact the data. The BIA Manager will identify opportunities to enhance the integrity of the data and ensure data accuracy and consistent reporting. They will use advanced data modeling, predictive modeling and analytical techniques to interpret key findings from CMC data and leverage these insights to support business outcomes high-quality, data-driven decisions\n\n\n<ul>\n<li>Education:?Bachelor's Degree in Computer Science, Statistics, Data Management, Analytics or a related field.Experience:?2 to 5 years of Analytics Manager or Data Scientist experience.?Experience with VBA, SQL, Oracle and/or PowerBI.?Experience with Microsoft Office with exceptional skill in Microsoft Excel.Individuals must possess the following knowledge, skills and abilities or be able to explain and demonstrate that the individual can perform the essential functions of the job, with or without reasonable accommodation, using some other combination of skills and abilities and to possess the necessary physical requirements, with or without the aid of mechanical devices to safely perform the essential functions of the job:1.Excellent analytical skills in terms of ability to define a problem or opportunity, identify needed data, analyze the data, and present recommendations and options in a format that is easily comprehensible to customers. 2.Ability to convert data into actionable information.3.Strong problem solving, quantitative and analytical abilities.4.Strong ability to visually represent concepts, but also have a breadth of other skills to support end-to-end development. 5.A solid understanding of key BI concepts and trends.6.Familiarity with and understanding of analytics, risk modeling and predictive analytics preferably in healthcare7.Impeccable presentation skills and the proven ability to tailor messages appropriately dependent on the specific audience. 8.Leadership experience in engaging with executive-level leaders9.Strong interpersonal; client relations; fact finding; analytical; project management; communication, collaboration and delegation skills</li>\n</ul>"}