{"job title": "Data Engineer", "company": "CBS Corporation", "city state": "– San Francisco, CA", "rating": "3.5", "job description": "Data Engineer\n<br><br>\n<strong>REF#: 32321</strong>\n<br><br>\nCBS BUSINESS UNIT: CBS Interactive\n<br><br>\nJOB TYPE: Full-Time Staff\n<br><br>\n<strong>JOB SCHEDULE:</strong>\n<br><br>\nJOB LOCATION: San Francisco, CA\n<br><br>\n<strong>ABOUT US:</strong>\n<br><br>\nCBS Interactive is the premier online content network for information and online operations of CBS Corporation as well as some of the top native digital brands in the entertainment industry. Our brands dive deep into the things people care about across entertainment, technology, news, games, business and sports. With over 1 billion users visiting our properties every quarter, we are a global top 10 web property and one of the largest premium content networks online.\n<br><br>\nCheck us out on [1] The Muse, [2] Instagram and [3] YouTube for an inside look into 'Life At CBSi' through employee testimonials, office photos and company updates.\n<br><br>\nReferences\n<br><br>\nVisible links\n\n\n<ul>\n<li>https://www.themuse.com/companies/cbsinteractive</li>\n<li>https://www.instagram.com/cbsinteractive/?hl=en</li>\n<li>https://www.youtube.com/channel/UCAvGapyifCtUlmNTagAl_sQ</li>\n</ul>\n\n<strong>DESCRIPTION:</strong>\n<br><br>\n<strong>Role Details:</strong>\n<br><br>\nThe Data Product Engineer should possess a deep sense of curiosity and a passion for building smarter products based on data, and the ability to communicate data structures and tools throughout the CBS Digital Media organization. The perfect candidate for this role will use their skills in reverse engineering, analytics, and creative experimental solutions to devise data and BI solutions. This engineer supports data product development using disparate data sources. The ideal candidate will also work with BI, Research, Engineering and Product teams to implement data-driven plans that drive the business.\n<br><br>\n<strong>Your Day-to-Day:</strong>\n\n\n<ul>\n<li>Works with large volumes of traffic data and user behaviors to build products and tools that enhance raw data.</li>\n<li>Able to break down and communicate highly complex data problems into simple, feasible solutions.</li>\n<li>Find answers to business questions via hands-on exploration of data sets via Jupyter, SQL, dashboards, statistical analysis, and data visualizations.</li>\n<li>Partnering with the internal product and business intelligence teams to determine best approach around data ingestion, structure and storage then, working with team to ensure these are implemented correctly.</li>\n<li>Contributing ideas on how to make our data more effective and working with other members of the engineering, BI teams and business units to implement changes.</li>\n<li>Ongoing development of technical solutions while developing and maintaining documentation, at times training impacted teams.</li>\n<li>Early on collaboration with the team on internal initiatives to create strategies that improve company processes.</li>\n</ul>\n\n<strong>#LI-SC1</strong>\n<br><br>\n<strong>QUALIFICATIONS:</strong>\n<br><br>\n<strong>What you bring to the team:</strong>\n<br><br>\nYou have -\n\n\n<ul>\n<li>Bachelor's degree and 2-4 years work experience in Analytics/Measurement/Data Operations fields or consulting roles with focus on digital analytics implementations.</li>\n<li>Experience with full stack application development.</li>\n<li>Proficient in Python. Including experience with a Python web framework such as Django or Flask as well as exploratory data analysis using tools like iPython Notebook, Pandas &amp; matplotlib.</li>\n<li>Experience with data management systems, both relational and NoSQL (e.g., HBase, Cassandra, MongoDB)</li>\n<li>Familiarity with SQL skills for MySQL, Postgres and BigQuery to perform common types of analysis</li>\n<li>Strong problem solving and creative-thinking skills.</li>\n<li>Ability to break down and communicate highly complex data problems as simple, feasible solutions</li>\n<li>Demonstrated development of ongoing technical solutions while developing and maintaining documentation, at times training impacted teams.</li>\n<li>Experience developing solutions to business requirements via hands-on discovery and exploration of data.</li>\n<li>Exceptional written and verbal communication skills, including the ability to communicate technical concepts to non-technical audiences, as well as translating business requirements into Data Solutions</li>\n</ul>\n\nYou might also have -\n\n\n<ul>\n<li>Experience with Workflow systems such as Airflow or UC4.</li>\n<li>Experience building and deploying application on a cloud platform (Google Cloud Platform preferred)</li>\n<li>Familiarity with Data Modeling.</li>\n<li>Familiarity in Hadoop pipelines using Spark, Kafka.</li>\n<li>Familiar with version control systems.</li>\n<li>Can perform statistical analyses using tools such as R, Numpy/SciPy with Python</li>\n<li>Experience with Adobe Analytics (Omniture) or Google Analytics.</li>\n<li>Digital marketing strategy including site, video, social media, SEM, SEO, and display advertising.</li>\n<li>Familiarity with Informatica and ETL concepts.</li>\n</ul>\n\n<strong>EEO STATEMENT:</strong>\n<br><br>\nEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}