{"job title": "Senior Data Scientist", "company": "CCRi", "city state": "– Charlottesville, VA", "rating": "4.5", "job description": "<strong>The Company</strong>\n<br><br>\nAt CCRi, our clients look to us to solve their hardest problems, and we have a long history of exceeding their expectations. With clients in both the private sector and the US government, we provide a variety of advanced analytical techniques, and we render our solutions in software that our clients can apply immediately.\n<br><br>\nWith projects ranging from optimizing the world's largest container port to predicting future asymmetric warfare events, CCRi has no shortage of experience in diverse client expectations. As a small company, we are able to adjust our process to the requirements of each client.\n<br><br>\nWant to know more about CCRi? https://www.youtube.com/watch?v=xjIqoDmAg4I\n<br><br>\n<strong>The Role</strong>\n<br><br>\nYou'll help create machine learning analytics that will be integrated into streaming data processing pipelines and appealing user interfaces that provide real-time situational awareness and expose advanced analytics to end users. As a senior data scientist, you will be expected to balance technical responsibilities (design and development) with team responsibilities (technical planning, roadmaps, ticket creation and delegation, mentorship). You’ll likely conduct demos and give presentations, and will be expected to contribute to the data science culture and ecosystem at CCRi through opportunities like design reviews and shared learning opportunities.\n<br><br>\n<strong>Who You Are</strong>\n<ul>\n <li>Curious: You enjoy peeling apart a problem and examining the interrelationships between data and how they can be used to form a solution.</li> <li>Creative: You try new approaches to solving problems, looking for ways to apply techniques across domains and in new contexts.</li>  <li>Practical: You explore theories with an eye to their real world applications and their potential for improving performance for clients.</li> <li>Collaborative: You work well on a team and understand how to lead a group of bright, technical coworkers. You can explain your work to your peers and source ideas and improvements from them.</li>  <li>Determined: You enjoy the challenge of finding solutions to difficult problems, testing them to discover what is successful and what should be optimized further, to develop industry-leading tools. You learn from failure and trying again.</li> <li>Organized: You know how to keep track of both high-level goals and the tasks required to meet those goals. You take personal ownership of your team’s success.</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li><strong>US citizenship required. We do not offer sponsorships.</strong></li> <li>3+ years of experience as a data scientist, machine learning engineer, or similar role</li>\n</ul>\n<em>Successful candidates will have some combination of the following:</em>\n<ul>\n <li>Understanding of structure and theory of common machine learning models</li> <li>Familiarity with common machine learning libraries for implementation (sklearn, weka, tensorflow, torch, …)</li> <li>Proficiency in one or more of: Python, Scala, Java, R, Matlab</li> <li>Expertise in a subfield of machine learning (computer vision, natural language processing, ...)</li> <li>Ability to understand and implement new models from the literature</li> <li>Project team leadership</li> <li>Experience presenting team progress and results</li> <li>Technical writing experience, including reports and proposals</li> <li>Experience with distributed analytics and processing (Spark, Hadoop, …)</li> <li>Experience with geospatial data and analytics</li> <li>Active TS security clearance</li> <li>Familiarity with Agile development</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nCCRi offers an engaging and supportive environment. We're interested in continual learning and creative problem solving. Solving fun and challenging problems is in our DNA—we take on interesting projects, and we love to learn. Our superlative team includes Data Scientists, Systems and DevOps Engineers, Mathematicians, Computer Scientists, Statisticians, Image Scientists, and other kinds of software developers and programmers, all of whom offer unique backgrounds to solve very difficult problems ranging from machine learning with neural networks to massive-scale spatio-temporal analytics. Our diverse team naturally has a wide-ranging set of interests— a holiday gift experiment produced a 3D printer, Oculus Rift, an espresso machine, and a kegerator for the homebrew crew. CCRi provides a challenging and fun work environment, competitive pay, health care, generous retirement, and a very flexible vacation policy.\n<br><br>\nCCRi is an equal opportunity employer. All qualified applicants will be considered for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, or status as a qualified individual with a disability or protected veteran."}