{"job title": "Data Scientist", "company": "CCRi", "city state": "– Charlottesville, VA", "rating": "4.5", "job description": "Do you like to look at data sets to find trends and tendencies? Do you like dealing with complex, multi-variable problems using cutting-edge analytics? CCRi is looking for smart, innovative data scientists. We conduct research and development in data mining and machine learning techniques to solve complex problems and then implement scalable solutions in data-driven environments.\n<br><br>\n<strong>Tools we use:</strong>\n<ul>\n <li> <strong>Statistical Computing:</strong> R, NumPy, SciPy</li> <li> <strong>Modern Programming:</strong> Python, Scala, Java, C++,</li>  <li> <strong>Machine Learning Sub-Specialties:</strong> graph analytics, natural language processing, computer vision</li>\n</ul>\n<strong>About You:</strong> You’ve got a year or more of professional engineering under your belt or you have compelling personal projects grounded in machine learning. Ideally, you have a bachelor’s in Computer Science, Systems Engineering, Statistics, Mathematics, or a related field. You are comfortable in at least one modern language and have some familiarity with a second language or computing tool (e.g., Python, R, Matlab, Java, Scala).\n<br><br>\n<strong>Requirements</strong>\n<ul>\n <li><strong>US citizenship required</strong></li> <li>We DO NOT offer sponsorships or contracting work. This position is for Charlottesville only.</li> <li>Bachelor’s Degree in a technical field</li> <li>Prior Work experience in a related field and/or a working portfolio that clearly demonstrates your abilities.</li>\n</ul>\n<strong>In compliance with federal law, all persons hired will be required to verify identity and status as a US citizen, and to complete the required employment eligibility verification document form upon hire. Failure to do so can and will result in dismissal.</strong>\n<br><br>\n<strong>Benefits</strong>\n<br><br>\n<strong>The Company:</strong>\n<br><br>\nCCRi is a small engineering firm located in Charlottesville, Virginia. We develop and deploy novel machine-learning approaches to real problems at massive scale. Since 1992, we’ve been stopping bombs, predicting piracy, and guiding disaster relief.\n<ul>\n <li>Casual Work Environment</li> <li>Intellectually Challenging Work</li> <li>Health Insurance</li> <li>Short Term Disability Insurance</li> <li>Generous Defined Benefit Retirement</li> <li>Very Flexible Vacation Policy</li> <li>Want to know more? Check out our recruitment video: https://www.youtube.com/watch?v=W_b2EY1tlRM</li>  <li>Commonwealth Computer Research, Inc. does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.</li>\n</ul>"}