{"job title": "Supervisory Health Scientist", "company": "Cdc", "city state": "– Hyattsville, Maryland", "rating": "2.9", "job description": "SunIRef:it\n<br><br>\nSupervisory Health Scientist - Hyattsville, MD - **********\n<br><br>\nFind Jobs\n<br>\nCompany Reviews\n<br>\nFind Salaries\n<br>\nFind Resumes\n<br>\nEmployers / Post Job\n<br>\nUpload your resume\n<br>\nSign in\n<br><br>\nHome\n<br><br>\nwhatjob title, keywords, or company\n<br><br>\nwherecity, state, or zip code\n<br><br>\nFind Jobs\n<br><br>\nAdvanced Job Search\n<br><br>\nSupervisory Health Scientist\n<br><br>\n<strong>CDC</strong>\n<br><br>\n105 reviews\n\n<li>Hyattsville, MD</li>\n\n<strong>CDC</strong>\n<br><br>\n105 reviews\n<br><br>\nRead what people are saying about working here.\n<br><br>\n$134,789 - $164,200 a year\n<br><br>\nDepartment: Department of Health And Human Services\n<br>\nAgency: Centers for Disease Control and Prevention\n<br>\nJob Announcement Number: HHS-CDC-D2-19-********\n<br>\nSALARY RANGE: $******.00 to $******.00/Per Year\n<br>\nOPEN PERIOD: 2018-11-16 to 2018-11-27\n<br>\n<strong>SERIES &amp; GRADE: GS--15/15</strong>\n<br><br>\n<strong>AGENCY MARKETING STATEMENT:</strong>\n<br>\nThe Centers for Disease Control and Prevention (CDC) is the agency Americans trust with their lives. As a global leader in public health, CDC is the nation's premier health promotion, prevention, and preparedness agency. Whether we are protecting the American people from public health threats, researching emerging diseases, or mobilizing public health programs with our domestic and international partners, we rely on our employees to make a real difference in the health and well-being of people here and around the world. This position is located in the Department of Health and Human Services (DHHS), Centers for Disease Control and Prevention (CDC), Office of Public Health Scientific Service (OPHSS), National Center for Health Statistics (NCHS), in Hyattsville, MD. CDC is an Equal Opportunity Employer.\n<br><br>\n<strong>DUTIES:</strong>\n<br>\nAs a Supervisory Health Scientist you will: Serve as the Chief of the Reproductive Statistics Branch (RSB). Responsible for the activities of the Birth and Infant Health Team and the National Survey of Family Growth (NSFG) Team of the RSB in the Division of Vital Statistics. Provide leadership and scientific direction for all aspects of preparing and disseminating vital statistics data from the national birth, linked birth, infant death, and fetal death files and the NSFG. Plan, develop and direct a comprehensive research program on the trends and factors associated with the reproductive experience of the US population and oversight of the National Survey of Family Growth (NSFG). Conceive, plan, and direct the Center's overall analytic research program focused on understanding the birth rate, improving the accuracy of projections of future population growth and providing information relevant to policy in the areas of infant and maternal health. Direct efforts to evaluate and improve quality and reliability in the collection, processing and coding of natality data. Personally carry out innovative research projects on some of the most critical and sensitive problems identified as part of the overall research plan in reproductive health. Direct a comprehensive national statistical program in the areas of reproductive health. Develop and oversee the implementation of a publication plan which assures that the results of the analytic research program are disseminated to the appropriate audiences. Other duties as assigned.\n<br><br>\n<strong>REQUIREMENTS:</strong>\n<br>\nUS Citizenship is required. Background Investigation is required. E-Verify: If you are selected for this position, the documentation that you present for purposes of completing the Department of Homeland Security (DHS) Form I-9 will be verified through the DHS \"E-Verify\" System. Federal law requires DHS to use the E-Verify System to verify employment eligibility of all new hires, and as a condition of continued employment obligates the new hire to take affirmative steps to resolve any discrepancies identified by the system. The U.S. Department of Health and Human Services is an E-Verify Participant. Direct Deposit: All Federal employees are required to have Federal salary payments made by direct deposit to a financial institution of their choosing. All qualification requirements must be met by the closing date of the announcement. One-year probationary period may be required. Travel, transportation, and moving expenses will be paid: No Bargaining Unit Position: No Drug Screening Required: No Recruitment Incentive may be authorized: No Annual Leave for non-federal service may be authorized: No Research position: No Promotion potential: No Supervisory position: Yes. Since this is a supervisory position, candidates must also have demonstrated or shown the potential to develop the necessary knowledge, skills, and abilities. A supervisory probationary period may be required. Applicants should describe any previous experience or responsibilities which could be used in relation to the supervisory requirements of this position. CDC Financial Disclosure -OGE form 450 Holding ourselves to a higher standard; the Centers for Disease Control and Prevention inspires public confidence in its trust responsibilities and mission by maintaining high ethical principles. This position is subject to the confidential financial disclosure requirements of the Ethics in Government Act of 1978 (P.L. 95-521). Therefore, if selected, you will be required to complete a Confidential Financial Disclosure Report (OGE Form 450) to determine if a conflict or an appearance of a conflict exists between your financial interest and your prospective position with the agency. This Information will be required annually.\n<br><br>\n<strong>QUALIFICATIONS REQUIRED:</strong>\n<br>\nBasic Qualification Requirements for GS-601: Bachelor's or graduate/higher level degree: major study in an academic field related to the medical field, health sciences or allied sciences appropriate to the work of the position. This degree must be from an educational program from an accrediting body recognized by the U.S. Department of Education at the time the degree was obtained.\n<br>\nIn Addition to the basis qualification requirements: Applicants must have one year of specialized experience at or equivalent to the GS-14 level in the Federal service as defined in the next paragraph.\n<br>\nSpecialized Experience: Specialized experience is experience which is directly related to the position which has equipped the applicant with the particular knowledge, skills and abilities (KSAs) to successfully perform the duties of the position that includes developing plans and systems for solving statistical and methodological problems and planning and conducting scientific studies relating to public health.\n<br><br>\n<strong>HOW YOU WILL BE EVALUATED:</strong>\n<br>\nOnce the application process is complete, a review of the resume and supporting documentation will be made and compared against your responses to the assessment questionnaire to determine if you are qualified for this job. If, after reviewing your resume and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully. Errors or omissions may affect your eligibility. Category rating procedures will be used to rate and rank candidates. The category assignment is a measure of the degree to which your background matches the competencies required for this position. Qualified candidates will be ranked into one of three categories: Best Qualified, Well Qualified or Qualified. The Category Rating Process does not add veterans' preference points but protects the rights of veterans by placing them ahead of non-preference eligibles within each category. Preference eligibles who meet the minimum qualification requirements and who have a compensable service-connected disability of at least 10 percent must be listed in the highest quality category (except in the case of scientific or professional positions at the GS-9 level or higher). Your qualifications will be evaluated on the following competencies (knowledge, skills, abilities and other characteristics).\n<br>\nAccountabilityAcquisition Management (1)Collaboration / PartneringConflict ManagementCustomer ServiceData Analysis and InterpretationDiversityInfluencing/NegotiatingInterpersonal SkillsLeveraging DiversityOral CommunicationResearch TranslationResults DrivenTechnology ManagementWritten Communication\n<br><br>\n<strong>BENEFITS:</strong>\n<br>\n<strong>OTHER INFORMATION:</strong>\n<br>\nThis vacancy is also being announced concurrently with vacancy announcement HHS-CDC-M2-19-******** under merit promotion procedures. Please review that announcement to see if you are eligible for consideration under merit promotion procedures. NOTE: Applicants must apply separately for each announcement in order to be considered. PHS Commissioned Corps Officers interested in performing the duties of this position within the Commissioned Corps (not as a career/career-conditional employee) are encouraged to apply under the merit promotion announcement indicated above. Additional selections may be made within the same geographical location CDC-wide. If you are a veteran with preference eligibility and you are claiming 5-points veterans' preference, you must submit a copy of your DD-214 or other proof of eligibility. If you are claiming 10-point veterans' preference, you must also submit an SF-15, \"Application for 10-Point Veterans' Preference\" plus the proof required by that form. For more information on veterans' preference see *************************************************** Males born after December 31, 1959 must be registered or exempt from Selective Service (see ******************** For information on \"People with Disabilities\" please visit **************************************************** Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible see *************************************************************** To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated at 85.0 or above on the rating criteria for this position. To view the questionnaire, click on the following link:\n\n\n<ul>\n<li>******************************************************* If you are unable to apply online or need to fax a document(s), view the following link for information regarding an Alternate Application.</li>\n</ul>\n\n<strong>HOW TO APPLY:</strong>\n<br>\nTo apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section.\n<br>\nA complete application package must be submitted by 11:59 PM (EST) on11/27/2018 of this announcement to receive consideration. To begin, click to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your rsum and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. To verify the status of your application, log into your USAJOBS account (************************************** all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: ******************************************************** If you cannot apply online: You are encouraged to apply online. If you are unable to apply online, please use the Alternate Application link listed in the Additional Information section of this vacancy announcement. Applicants are strongly encouraged to apply online if at all possible. ing online, through your USAJOBS account, will expedite the application process and allow you to check your application. If you utilize the Alternate Application method, your USAJOBS account will not display this application and you will not receive status updates.\n<br><br>\n<strong>REQUIRED DOCUMENTS:</strong>\n<br>\nTo apply for this position, you must submit a complete Application Package which includes:\n\n\n<ul>\n<li>Your rsum showing work schedule, hours worked per week, dates of employment and duties performed.</li>\n<li>Other supporting documents: Cover Letter, optional College Transcript(s) Veterans' Preference documentation, if applicable (e.g., DD-214 Member Copy 4 showing type of discharge/character of service, SF-15 Form and related documentation, VA letter, etc.) Career Transition Assistance Program/Interagency Career Transition Assistance Program documentation, if applicable (e.g., Certification of Expected Separation, Reduction-In-Force Separation Notice, or Notice of Proposed Removal; SF-50 that documents the RIF separation action; and most recent performance appraisal). Schedule A Letter if you are applying as a Schedule A candidate Note: You may submit an unofficial transcript or a list of college courses completed indicating course titles, credit hours, and grades received. An official transcript from an accredited educational institution is required if you are selected for the position. Failure to submit any of the above mentioned required documents may result in loss of consideration due to an incomplete application package. It is your responsibility to ensure all required documents have been submitted. For Rsum and Application Tips visit: ****************************************</li>\n</ul>\n\n<strong>WHAT TO EXPECT NEXT:</strong>\n<br>\nOnce the online questionnaire is received you will receive an acknowledgement email that your submission was successful. The most highly qualified candidates will be referred to the hiring manager for further consideration and possible interview. We expect to make a selection within 45 days of the closing date of this announcement. You will receive notice via email once this process is completed (generally 4-6 weeks).\n<br><br>\n<strong>AGENCY CONTACT INFO:</strong>\n<br>\n<strong>CDC HELPDESK</strong>\n<br>\n1600 Clifton Road NE\n<br>\nAtlanta GA US 30333\n<br>\nTelephone: **************\n<br>\nEmail: ************\n<br><br>\nCenters for Disease Control and Prevention - 4 hours ago - report job - original job\n<br><br>\nOn Company Site\n<br><br>\nSave this job"}