{"job title": "Data Scientists", "company": "CDI Corporation", "city state": "– Dearborn, MI", "rating": "2.9", "job description": "Are you passionate about working with the latest cutting edge technologies to test and expand your skills? Come join CDI! We offer competitive pay and access to a variety of benefits including Health Insurance and vacation plans. Our client is a leader in the automotive industry and has recently invested $1 billion in developing self driving vehicles in addition to creating revolutionary automotive mobility products. If you are a Data Scientist interested in leading long term exciting projects and growing your skill set, please send us your resume!\n<br><br>\nThe Data Ops Analyst role resides was formed to support the Blueprint for Mobility strategy and the plan for profitable growth. In this role, you will support the data requirements of the Data Scientists who are using analytics to achieve business outcomes including insights to accelerate our Connected Customer and Connected Vehicle initiatives.\n<br><br>\nEssential Responsibilities: You will be responsible for providing the data support for enterprise data integration tasks, including ingestion, standardization, enrichment, mastering and assembly of data products for downstream applications. In addition, you will:\n\n\n<ul>\n<li>Drive the Data Strategy and align it with continuously changing business landscape</li>\n<li>Work on all the data types across the enterprise including Customer, Dealer, Vehicle, Manufacturing, etc.</li>\n<li>Continuously increase Data Coverage by working closely with the Data Scientists, understanding and evaluating their data requirements and delivering the data they need</li>\n<li>Support the data requirements of the different functional teams like MS&amp;S, PD, Quality, etc. and all the regional KPI / Metrics initiatives</li>\n<li>Evaluate, explore and select the right data platform technologies including Big Data, RDBMS&amp;NoSQL to meet the analytics requirements</li>\n<li>Provide visibility to Data Quality issues and work with the business owners to fix the issues</li>\n<li>Implement an Enterprise Data Governance model and actively promote the concept of data sharing, data reuse, data quality and data standards</li>\n<li>Perform any necessary data mapping, data lineage activities and document information flows</li>\n<li>Build the Metadata model&amp;Business Glossary by gathering information from multiple sources: business users, existing data sources, databases and other relevant documents and systems</li>\n<li>Serve as data subject matter expert and demonstrate an understanding of key data management principles and data use</li>\n</ul>\n\n<strong>Education Required:</strong>\n<br><br>\nBachelor's Degree in Computer Science or related field from an accredited college or university\n<br><br>\n<strong>Experience Required:</strong>\n<br><br>\nMinimum of 5 years of experience in a Data Management role including running queries and compiling data for analytics\n\n\n<ul>\n<li>Minimum of 3 years of experience in data design, data architecture and data modeling (both transactional and analytic)</li>\n<li>Minimum of 2 years of experience in Big Data / NoSQL technologies such as Greenplum&amp;Hadoop (HDFS, MapReduce, Hive, Shark, Spark, etc.)</li>\n</ul>"}