{"job title": "Project Scientist - Medical Imaging", "company": "Cedars-Sinai", "city state": "– Los Angeles, California", "rating": "3.8", "job description": "<div>Summary of Essential Job Duties:\n<br><br>\n&nbsp;<br>\n<div>\nThe Artificial Intelligence in Medicine (AIM) Program is a medical imaging research and software development group within the Department of Medicine. The Project Scientist works independently but in close cooperation and consultation with the Principal Investigator to make significant and creative contributions to AIM Program research.\n<br>\n&nbsp;\n<br>\nThe Project Scientist will lead current and future research projects related to cardiac image processing. Primary responsibilities include development and implementation of new research techniques, protocols and algorithms, and data analysis and interpretation including deep learning techniques. Highly specialized and technical expertise in scientific programming, medical imaging and machine learning methods is required to carry out designated research projects. The Project Scientist is a key member of the AIM research team and is expected to collaborate effectively with faculty investigators, engineers and research staff to achieve project objectives.\n<br>\n&nbsp;\n<br>\n<strong>Essential Job Duties and Responsibilities:\n<br>\n</strong>\n<br>\n&nbsp;<br><br>Develops and implements novel research techniques, protocols and algorithms for fully automated software analysis of fast Myocardial Perfusion SPECT (MPS) and PET.\n<br><br>\n&nbsp;\n<br><br>\nParticipates in publications, scientific abstracts and presentations as first author or co-author.\n<br><br>\n&nbsp;\n<br><br>\nPresents research results at scientific meetings.\n<br><br>\n&nbsp;\n<br><br>\nParticipates in research and technical meetings and utilizes expertise to plan and develop new research projects and proposals.\n<br><br>\n&nbsp;\n<br><br>\nAssists in the preparation of grant proposals of Senior Investigators.\n<br><br>\nCompiles, analyzes, interprets, and summarizes data.\n<br><br>\n&nbsp;\n<br><br>\nMay submit grant proposals independently, as approved by supervising Principal Investigator.\n<br><br>\n&nbsp;\n<br><br>\nMay lead or train research fellows, associates and students.\n<br><br>\n&nbsp;\n<br><br>\n#LI-Academics\n<br><br>\n&nbsp;<br><br></div></div><br>\n\n<div>\n<div>Education Requirements:\n<br><br>\nPhD in Computer Science or related field\n<br><br>\nExperience:\n<br><br>\n1. Completion of postdoctoral scholar training\n<br><br>\n2. Demonstrated significant, original or creative contributions to research project or program\n<br><br>\n3. Knowledge of PI’s area of research specialization\n<br><br>\n4. Background in medical imaging, image processing, machine learning and/or computer vision\n<br><br>\n5. Proficiency in mathematics, medical statistics and 3D geometry\n<br><br>\n6. 6+ years programming experience; proficiency in scientific and numerical C++ or Python programming\n<br><br>\n7. Basis system administration skills\n<br><br>\n8. Strong analytical and problem-solving skills\n<br><br>\n9. Excellent communication (written and verbal) skills</div>\n</div>\n<br>"}