{"job title": "Scientist I", "company": "Celgene", "city state": "– San Diego, CA US", "rating": "3.8", "job description": "<div>\n<div>\nScientist I\n<br>\n <div><strong>Req #:</strong> 1803782</div>\n<br>\n <div><strong>Location:</strong>\n<br><br>\nSan Diego, \n<br>\n<strong> CA</strong>\n<br>\n US</div>\n<br>\n <div><strong>Job Category:</strong> Research and Early Development</div>\n<br>\n <div><strong>Work Location:</strong> 3033 Science Park Road Suite 300 RCPTSD 92121</div>\n<br>\n <div><strong>Organization:</strong> Receptos, Inc.</div>\n<br>\n <div><strong>Schedule:</strong> 40</div><br>\n\n<div><strong>Shift:</strong></div><div><strong>Employee Status:</strong> Full time</div>\n<br>\n <div><strong>Job Type: Regular</strong></div>\n\n<br><strong><div>Job Level:</div>\n<br>\n</strong>\n<br>\n<div><strong>Travel:</strong></div><div><div><strong>Other Locations:</strong>US- CA- San Diego- Science Park</div>\n<br>\nDescription<br><br>Celgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, ​quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.\n<br><br>\n<strong><strong>Status:</strong></strong> Non-Exempt\n<br><br>\n<strong><strong>Reports to:</strong></strong> Sr. Scientist, Biology\n<br><br>\n<strong><strong>Position Description:</strong></strong>\n<br><br>\nWe are seeking a highly motivated and innovative hands-on biologist to support the discovery and development of small molecules targeting the treatment of autoimmune, neuro-inflammatory and CNS diseases. The successful applicant will have a strong background in in vitro experimental design and execution, with an understanding of, and willingness to work with, in vivo models of disease. This individual will participate in a broad range of programs in a dynamic, small company and be comfortable working in a fast paced environment. Industry experience is preferred but not essential.\n<br><br>\n<strong><strong>Responsibilities and Duties:</strong></strong>\n<ul>\n<li>With guidance from supervisor, design, plan, execute and analyze in vitro pharmacology and MOA assays for inflammation and immunology targets</li><li>Analyze, interpret and communicate data to team</li><li>Duties will include performing in vitro assays for lead development, mechanism of action studies, and cell culture.</li><li>Support senior scientists in execution of proof-of-concept in vivo studies</li><li>Maintain well written and accurate research notebooks detailing work undertaken.</li><li>Other responsibilities as assigned.<br><br><strong>Minimum Requirements:</strong>\n<br><br>\nBachelor Science+3 years or MS+1 years\n<br><br>\nTissue culture and blood cell isolation skills are essential\n<br><br>\nStrong hands-on experience with common immunological assays including FACS, cell migration, cell activation</li>\n<li>Experience with molecular biology and protein immunodetection techniques desirable</li><li>Experience with hepatocyte and immune cell co-culture systems a bonus</li><li>Technical skills to assist with in vivo studies including drug dosing by all routes, blood draws and necropsy<br><br>Possess a thorough knowledge of experimental design and underlying scientific principles\n<br><br>\nAbility to work within a collaborative work environment\n<br><br>\nExcellent organizational, record keeping, oral and written communication skills\n<br><br>\nMotivated, detail-oriented person desiring to work in a small company\n<br><br>\nIndustry experience is preferred but not essential</li>\n\n</ul>\n#LI-POST<br><br>Celgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Celgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S.</div></div>\n\t</div>\n<br>"}