{"job title": "Senior Scientist, Analytical Development", "company": "Celgene Corporation", "city state": "– Summit, NJ", "rating": "3.8", "job description": "Celgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries - and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.\n<br><br>\nThe successful candidate will be highly motivated to work within a science focused, collaborative, multidisciplinary drug substance and drug product development environment to achieve the company’s aggressive drug development targets. As part of Celgene’s R&amp;D team, this Senior Scientist will play an important role throughout the development of new drug candidates from discovery to commercialization, contributing to the advancement of new therapeutics in the areas of hematology, oncology, inflammation &amp; immunology.\n<br><br>\n<strong>Responsibilities will include, but are not limited to, the following:</strong>\n<br><br>\nThe Senior Scientist position will be responsible for the development and validation of analytical methodology for the characterization of our products and processes, the creation of fundamental product and process understanding, and the advancement of innovative approaches to drug development. Support for drug candidates across all stages of development and, as needed, within our commercial product portfolio will be required.\n<br><br>\nThe Sr. Scientist should work with minimal supervision to carry out laboratory based de novo analytical methods development, chemical characterization studies and chemical stability characterization evaluations. Where required, activities will be performed in accordance with cGLP/cGMP regulations, established business processes and protocols, and applicable standard operating procedures.\n<br><br>\n As the analytical lead on one or more project teams, this Sr. Scientist is responsible for the development, vetting, and implementation of the comprehensive analytical control strategy to advance the asset throughout development.\n<br>\n Support drug substance process development including characterization of starting materials, intermediates and final API.\n<br>\n Support drug product formulation and process development including characterization of the process and finished product.\n<br>\n Develop, optimize and validate analytical methods.\n<br>\n Support drug substance and drug product impurity characterization and identification.\n<br>\n Generate laboratory clinical release and stability data.\n<br>\n Qualify/transfer analytical methodology to quality control and contract laboratories.\n<br>\n Serve on and lead departmental, interdepartmental and project teams.\n<br>\n Report and discuss analytical results and conclusions both orally and in writing.\n<br>\n Write formal reports for inclusion in regulatory filings and support the generation of appropriate responses to questions from regulatory authorities.\n<br>\n Review analytical data for completeness and correctness.\n<br>\n Adhere to all relevant compliance requirements.\n<br>\n Ensure that all facilities, equipment, and personnel are and remain in compliance with applicable cGMP and regulatory requirements, appropriate SOPs and corporate policies.\n\n\n<ul>\n<li>LI-KM1</li>\n</ul>\n\n<strong>BIO-US</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong>Skills/Knowledge required:</strong>\n<br><br>\n Academic background in Analytical Chemistry or an allied chemistry discipline (e.g. Physical, Organic) with demonstrated analytical capabilities.\n<br><br>\n Comprehensive knowledge of chemistry with extensive expertise in measurement science.\n<br><br>\n Fluency in synthetic chemistry, drug substance processing, formulation development, pharmaceutical processing or pharmaceutical sciences is expected.\n<br><br>\n A demonstrated record of scientific accomplishment, laboratory experimentation, publication and presentation.\n<br><br>\n Extensive hands-on laboratory experience with and an in-depth knowledge of conventional laboratory characterization techniques such as HPLC, GC, UV, IR, mass spectrometry, and NMR is a must.\n<br><br>\n Strong problem-solving and troubleshooting skills.\n<br><br>\n Strong capabilities in experimental design and execution.\n<br><br>\n Ability to work independently.\n<br><br>\n Strong verbal and written communication skills.\n<br><br>\n Strong interpersonal skills and the ability and interest to serve as a team member/leader in an environment where individual initiative, collaboration and accountability are valued.\n<br><br>\n Ability to provide scientific guidance, leadership and training to others within the department.\n<br><br>\n Ability to manage others and a commitment to and demonstrated proficiency in employee development.\n<br><br>\nSkills/Knowledge in the following areas are a plus:\n<br><br>\n Experience in the development and performance of analytical tests for a variety of drug substances and products (including solid oral dosage forms and injectables).\n<br><br>\n Advanced skills in statistics and statistical analysis of process capability.\n<br><br>\n Advanced skills in DOE, Lean and/or Six Sigma.\n<br><br>\n Knowledge of dissolution method development and testing, biopharmaceutical classification system, and IVIVC / IVIVR.\n<br><br>\n Modern laboratory automation.\n<br><br>\nCelgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status.\n<br><br>\nCelgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S.\n<br><br>\n<strong>Req ID:</strong>  16001185\n<br>\n<strong>Primary Location:</strong> United States-New Jersey-Summit\n<br>\n<strong>Job:</strong>  Manufacturing/Technical Operations\n<br>\n<strong>Organization:</strong>  Celgene Corporation\n<br>\n<strong>Schedule:</strong>  Regular\n<br>\n<strong>Shift:</strong>  Standard\n<br>\n<strong>Employee Status:</strong>  Individual Contributor\n<br>\n<strong>Job Type:</strong>  Full-time\n<br>\n<strong>Job Level:</strong>  Day Job\n<br>\n<strong>Travel:</strong>  Yes, 5 % of the Time\n<br>\n<strong>Job Posting:</strong>  2016-09-06 00:00:00.0\n<br>"}