{"job title": "Senior Associate Scientist, Analytical Development", "company": "Celgene Corporation", "city state": "– Summit, NJ", "rating": "3.8", "job description": "Celgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries - and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.\n<br><br>\nAs part of Celgene’s R&amp;D team, this Senior Associate Scientist will develop, validate, and implement analytical methods to assess physical and chemical properties of pharmaceutical materials. This work is conducted in a highly-collaborative, multi-disciplinary team charged with the overall research &amp; development of our active ingredients, formulated products, and the associated manufacturing processes. The Sr. Associate Scientist plays an important role throughout the development of new drug candidates from discovery to commercialization, contributing to the advancement of new therapeutics in the areas of hematology, oncology, inflammation &amp; immunology.\n<br><br>\n<strong>Responsibilities will include, but are not limited to, the following:</strong>\n<br><br>\n1) Contributes to the development of priority drug candidates through the development, validation, and implementation of analytical methods involving modern analytical instrumentation including HPLC/UPLC, GC, dissolution, FT-IR, Karl Fischer titrations, etc.\n<br>\n2) Transfers validated methods to customer labs, including Celgene and partner-owned quality control (QC) labs.\n<br>\n3) Performs testing for development and clinical materials and stability samples in accordance with established methods, specifications and protocols with limited supervision.\n<br>\n4) Knows the fundamentals of analytical methodology and is able to troubleshoot instrumentation and method performance issues of moderate complexity.\n<br>\n5) Documents / reviews laboratory work using laboratory notebooks / worksheets that is detailed, timely and in compliance with GLP / GMP requirements.\n<br>\n6) Contributes to the preparation of high-quality technical reports as source documents for regulatory submissions.\n<br>\n7) Reviews data for compliance to specifications and acceptance criteria.\n<br>\n8) Communicates results according to project timelines and works with collaborators to understand project needs and contribute to overall analytical control strategy. Draws basic conclusions from data and results.\n<br>\n9) Other duties as assigned by supervisor.\n\n\n<ul>\n<li>LI-KM1</li>\n</ul>\n\n<strong>BIO-US</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong>Skills / Knowledge Required:</strong>\n\n\n<ul>\n<li>BS/MS Chemistry (or relevant discipline).</li>\n<li>Minimum 5 years recent cGMP / GLP pharmaceutical laboratory experience, with in-depth knowledge of cGMP/GLP guidelines, ICH, FDA, and EMA guidances.</li>\n<li>Familiar with USP and other compendia.</li>\n<li>Extensive hands-on experience with separations techniques (HPLC, UPLC, GC, etc.)</li>\n<li>Experience with HPLC, dissolution, FT-IR, UV/VIS spectrophotometry, titrations, etc.</li>\n<li>Experience in laboratory investigation and documentation of OOS / OOT results.</li>\n<li>Strong verbal and written communication skills, and interpersonal skills as a team player.</li>\n<li>Willing to work in an environment where individual initiative, accountability to the team, and professional integrity are required.</li>\n<li>Recognizes analytical test problems, can investigate problems and take appropriate steps to resolve and communicate issues. Recognizes technological limitations and addresses them.</li>\n<li>Exhibits sound scientific judgment based on reasonable assumptions and available information.</li>\n<li>Demonstrated ability to conduct and document analytical laboratory experiments under minimal supervisory guidance.</li>\n<li>Experience in the development and performance of analytical tests for a variety of drug substances and products (including solid oral dosage forms and injectables) is a plus.</li>\n</ul>\n\nCelgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status.\n<br><br>\nCelgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S.\n<br><br>\n<strong>Req ID:</strong>  16001182\n<br>\n<strong>Primary Location:</strong> United States-New Jersey-Summit\n<br>\n<strong>Job:</strong>  Manufacturing/Technical Operations\n<br>\n<strong>Organization:</strong>  Celgene Corporation\n<br>\n<strong>Schedule:</strong>  Regular\n<br>\n<strong>Shift:</strong>  Standard\n<br>\n<strong>Employee Status:</strong>  Individual Contributor\n<br>\n<strong>Job Type:</strong>  Full-time\n<br>\n<strong>Job Level:</strong>  Day Job\n<br>\n<strong>Travel:</strong>  Yes, 5 % of the Time\n<br>\n<strong>Job Posting:</strong>  2016-07-05 00:00:00.0\n<br>"}