{"job title": "Data Analyst", "company": "Cellnet", "city state": "– Overland, MO", "rating": "2.0", "job description": "Data Analyst I provides standard operational support directly for the customer. This includes standard database operations and predictive data analysis. Responsible for monitoring the daily processes of the database function; deliver and troubleshoot database operations and meter level data management. Coordinates with other Data Analysts and the NOC for escalation of issues as necessary.\n\n\n<ul>\n<li>Provides operational data support for internal and external customers.</li>\n<li>Writes SQL queries to analyze data and generate, monitor, and maintain informational reports.</li>\n<li>Supports meter level monitoring; provides meter data analysis and troubleshoots issues on a daily basis.</li>\n<li>Monitors performance metrics (stales, read performance, billing, etc.) for issues and troubleshoots as necessary.</li>\n<li>Is familiar with and supports at least 1 Company product (1-way, 2-way Mesh IP, etc.).</li>\n<li>Will be expected to learn 2-way Mesh IP support.</li>\n<li>Works closely with the Radio Frequency (RF) Technicians to maintain high network performance and meets customer Service Level Agreements (SLAs).</li>\n<li>Assists with inventory management and database updates for equipment changes (meters, modules, collectors, concentrators).</li>\n<li>Proactively analyzes meter and reads data to identify issues and resolve, minimizing customer impact.</li>\n<li>Provides complete and accurate responses to inquires.</li>\n<li>Follows up with customer requests. Provides reports as necessary per customer requirements.</li>\n<li>Generates reports and exception handling for customer billing.</li>\n<li>Escalates issues as necessary to other Data Analysts and the Service Desk.</li>\n<li>Assists in data discrepancy trouble shooting and resolution.</li>\n<li>Makes recommendations for standard metrics, reporting, and service improvement.</li>\n<li>Communicates issues and potential resolutions to management as necessary.</li>\n<li>Minimal support required after business hours. Works independently 75% of the time.</li>\n<li>Maintain individual professional development plan with associated goals.</li>\n<li>Supports and adheres to Company's core values.</li>\n<li>Performs other duties or responsibilities as assigned or required.</li>\n<li>Supports and adheres to Company's Code of Conduct and Ethics Policy.</li>\n<li>Represents Company in a positive, professional manner when working with both internal and external customers.</li>\n</ul>\n\n<strong>Required Skills</strong>\n\n\n<ul>\n<li>Personal computer skills</li>\n<li>Proficient with Microsoft Office Suite</li>\n<li>Excellent keyboard/typing skills</li>\n<li>Ability to effectively communicate both verbally and in writing</li>\n<li>Strong team player; reliable, respectful, able to build meaningful working relationships with other team members</li>\n<li>Write and execute SQL and Oracle queries</li>\n<li>Data analysis, identifying trends and gaps, process improvement suggestions and enhancements is a must; not just data reporting</li>\n<li>Problem solving, technical troubleshooting and analytical abilities</li>\n<li>Demonstrated customer focus and ability to resolve customer issues</li>\n<li>Accustomed to working in an environment driven by high standards for service and system delivery Self-motivated, proactive, able to work under stressful conditions</li>\n</ul>\n\n<strong>Required Experience</strong>\n\n\n<ul>\n<li>1 to 3 years of related experience is preferred (data analysis, ad-hoc queries, and customer support).</li>\n<li>Windows server experience is required; UNIX experience is preferred.</li>\n<li>Bachelors in Management Information Systems (MIS) or Computer Information Systems (CIS) is preferred.</li>\n<li>Experience with scripting is beneficial.</li>\n<li>Experience communicating, verbal and written, with a variety of audiences (customers &amp; peers).</li>\n</ul>\n\nEOE AA M/F/Vet/Disability VEVRAA Federal Contractor"}