{"job title": "Senior Scientists, Computational Biology", "company": "Celsius Therapeutics", "city state": "– Cambridge, MA", "rating": "NA", "job description": "Celsius Therapeutics is charting a new course of target and drug discovery by understanding the specific cells, among many others, that are key players in disease and by identifying the genes that are triggering their malfunction.\n<br><br>\nThe company is applying a systematic approach to single-cell sequencing, combining massive datasets and complex algorithms in order to discover first-in-class precision therapies that have a transformative impact on the lives of patients with autoimmune diseases and cancer.\n<br><br>\nCelsius is backed by Third Rock Ventures and GV (formerly Google Ventures) and is based in Cambridge, Mass. For more information, please visit www.celsiustx.com.\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nWe are seeking innovative, collaborative and accomplished computational biologists/data scientists to work on a variety of genomics projects in the field of immuno-oncology and autoimmune-diseases. This position will work on multiple internal and external datasets composed primarily of single cell RNAseq data. A critical component of the job will be to develop and implement innovative analysis strategies to generate focused hypotheses for the identification of new therapeutic targets.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<br><br>\nSuccessful candidates will join a dynamic and growing team of scientists using cutting edge genomics techniques and single cell sequencing for the discovery of new targets. Primary responsibilities will be to:\n<br><br>\n· \n<br>\nGenerate meaningful biological hypotheses from genomics data.\n<br><br>\n· \n<br>\nPrioritize and validate drug discovery targets.\n<br><br>\n· \n<br>\nApply or develop new tools or data-mining techniques for integrative analysis and visualization of large data-sets.\n<br><br>\n· \n<br>\nDevelop a platform for genomics-based target discovery.\n<br><br>\n· \n<br>\nContribute to experimental study design.\n<br><br>\n<strong>QUALIFICATIONS</strong>\n<br><br>\n· \n<br>\nA Ph.D. in Bioinformatics, Computer Science, Biology, Genetics or equivalent, and a minimum of 5 years of experience in computational biology and genomics required.\n<br><br>\n· \n<br>\nA strong background in cancer biology and/or single cell genomics and/or immunology.\n<br><br>\n· \n<br>\nStrong scientific background and publication record with proven high levels of performance.\n<br><br>\n· \n<br>\nAbility to innovate, apply and develop new tools for the integrative analysis and visualization of multi-dimensional genomics datasets.\n<br><br>\n· \n<br>\nExperience with machine learning algorithms and data mining methods.\n<br><br>\n· \n<br>\nFamiliarity with pathway analysis.\n<br><br>\n· \n<br>\nProficiency with R, Python or other scripting language for statistical computing and graphics.\n<br><br>\n· \n<br>\nExperience with cloud computing is a plus.\n<br><br>\n· \n<br>\nAbility to adapt to increasing scope and complexity of work brought on by growth/change and helps others manage through change.\n<br><br>\n· \n<br>\nStrong written, oral and public speaking communication skills.\n<br><br>\n· \n<br>\nKnowledge of industry trends and ability to utilize that knowledge to determine the most efficient ways to meet business needs."}