{"job title": "Data Analyst II (Commercial Solutions", "company": "Cenpatico", "city state": "– Chicago, Illinois", "rating": "2.8", "job description": "Data Analyst II (Commercial Solutions)\n<br>\nUSA-Illinois-Chicago\n<br>\n<strong>Position Purpose:</strong>\n\n\n<ul>\n<li>Analyze health management programs including: data collection,</li>\n</ul>\n\n<strong>validation and outcome measurement. May include:</strong>\n<br>\no Financial, pharmacy, claims, provider, and member data\n<br>\no IRS, CMS, HHSC, HEDIS reporting\n<br>\no Internal data cleansing and data reconciliation analysis\n<br>\no Trend analysis in various functional areas of health care\n<br>\nmanagement.\n\n\n<ul>\n<li>Create and generate reports through MS-Excel, MS-Access, and SQL</li>\n</ul>\n\nusing Business Objects interface and direct links to core\n<br>\ndatabases (ODS/EDW)\n\n\n<ul>\n<li>Produce reports for and interface with senior management and</li>\n</ul>\n\ninternal and external stakeholders.\n\n\n<ul>\n<li>Gather and interpret business requirements and monitor data</li>\n</ul>\n\ntrends to proactively identify issues\n\n\n<ul>\n<li>Execute data changes and update core systems as needed</li>\n<li>Handle multiple projects and timelines effectively and</li>\n</ul>\n\ncommunicate risks and issues to manager regularly\n\n\n<ul>\n<li>Assist with training lower level Data Analysts.</li>\n</ul>\n\nResponsible for analytical data needs. Handle complex data requests,\n<br>\nreports, and predictive data modeling.\n<br>\n<strong>Knowledge/Experience:</strong>\n<br>\nBachelor s degree s related field or equivalent experience. 2+ years\n<br>\nof statistical analysis or data analysis experience. Advanced\n<br>\nknowledge of Business Objects, SQL, and Microsoft Applications,\n<br>\nincluding Excel and Access. Work experience using R, Python, SAS, or\n<br>\nMicroStrategy strongly preferred.\n<br>\nCentene is an equal opportunity employer that is committed to\n<br>\ndiversity, and values the ways in which we are different. All\n<br>\nqualified applicants will receive consideration for employment without\n<br>\nregard to race, color, religion, sex, sexual orientation, gender\n<br>\nidentity, national origin, disability, veteran status, or other\n<br>\ncharacteristic protected by applicable law.\n<br>\nData Analytics\n<br>\nFull-time"}