{"job title": "SR DATA SCIENTIST", "company": "CenturyLink", "city state": "– Broomfield, CO", "rating": "2.9", "job description": "<div><p><strong>CenturyLink (NYSE: CTL) is a global communications and IT services company focused on connecting its customers to the power of the digital world. CenturyLink offers network and data systems management, big data analytics, managed security services, hosting, cloud, and IT consulting services. The company provides broadband, voice, video, advanced data and managed network services over a robust 265,000-route-mile U.S. fiber network and a 360,000-route-mile international transport network. Visit CenturyLink for more information.</strong></p><p> </p><div><p></p><p><b>Job Summary</b>\n</p><p></p><p>Responsible for developing tools to collect, clean, analyze and manage the data used by strategic areas of the business. Employ techniques and theories drawn from mathematics, statistics, in particular from the subdomains of machine learning, classification, cluster analysis, and data mining. Collaborate with cross-functional teams to understand complex business problems, build statistical models, and create predictive tools</p>\n<p></p><p></p><p></p><p><b>Job Description</b>\n</p><p></p><ul><li>Clearly communicate methods and conclusions with simple language and innovative visualizations to management and executives.</li><li>Work effectively on a team as well as a self-driven individual to do research and develop cutting edge and effective solutions for the business. </li><li>Provide expertise in analyzing and visualizing large, complex, and unique data sets.</li><li>Create new insights that will drive business growth and profitability in the short and long term.</li><li>Deploy analytics code with a continuous integration environment incorporating version control, build servers, and test servers. </li><li>Design and implement programs and automation to collect, mash up, process and analyze distributed real-world data.</li></ul>\n<p></p><p></p><p></p><p><b>Qualifications</b>\n</p><p></p><ul><li><u>Required:</u></li><li>BS or MS Degree(s) in Operations Research, Math, Statistics, Computer Science, Physics and Economics.</li><li>4+ years of experience or 2+ years with a MS degree in data analysis or related field.</li><li>Strong experience with tools for managing, analyzing, and visualizing large datasets.</li><li>Experience with relational databases.</li><li>Programming experience with two or more of R, Python, Scala, Java, Perl, Mathematica and C++.</li><li>Strong analytical thinking and ability to quickly pick up new methods, tools and programming languages.</li><li><u>Preferred:</u></li><li>MS/PhD Degree(s) in Operations Research, Math, Statistics, Computer Science, Physics and Economics.</li><li>6+ years of experience in data analysis or related field</li><li>Experience with non-relational database</li><li>Experience articulating business questions and using mathematical techniques to arrive at an answer using available data.</li><li>Past success in extracurricular math/science activities or competitions is highly regarded.</li><li>Creativity and persistence in locating, extracting and analyzing any and all relevant data.</li><li>Problem solving versatility: making the best decisions possible given the data quality and time available.</li><li> <p><strong>Education</strong></p><p>Bachelors or above in Operations Research, Math, Statistics, Computer Science, Physics and Economics</p></li></ul>\n<p></p><p></p></div><p><strong>Alternate Location:</strong> US-Colorado-Broomfield</p><p><strong>Requisition #</strong><strong>:</strong> 205804 </p><p>This job may require successful completion of an online assessment. A brief description of the assessments can be viewed on our website at <u>http://find.centurylink.jobs/testguides/</u> </p><p><strong><u>EEO Statement</u></strong></p><p>We are committed to providing equal employment opportunities to all persons regardless of race, color, ancestry, citizenship, national origin, religion, veteran status, disability, genetic characteristic or information, age, gender, sexual orientation, gender identity, marital status, family status, pregnancy, or other legally protected status (collectively, “protected statuses”). We do not tolerate unlawful discrimination in any employment decisions, including recruiting, hiring, compensation, promotion, benefits, discipline, termination, job assignments or training.</p><p><strong><u>Disclaimer</u></strong></p><p>The above job definition information has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. Job duties and responsibilities are subject to change based on changing business needs and conditions.</p></div>"}