{"job title": "Lead Data Scientist", "company": "CenturyLink", "city state": "– Broomfield, CO", "rating": "2.9", "job description": "<div><strong>CenturyLink (NYSE: CTL) is a global communications and IT services company focused on connecting its customers to the power of the digital world. CenturyLink offers network and data systems management, big data analytics, managed security services, hosting, cloud, and IT consulting services. The company provides broadband, voice, video, advanced data and managed network services over a robust 265,000-route-mile U.S. fiber network and a 360,000-route-mile international transport network. Visit CenturyLink for more information.</strong><br>\n<div>\n<strong>Job Summary</strong>\n<br><br>\nDevelop algorithms to optimize capital allocation in the area of telecom network and project investment decisions. Responsibilities will include collecting and analyzing data to identify opportunities, designing algorithms to address these opportunities, and the ongoing tuning of the algorithm parameters. This work will involve cross-functional collaboration to understand and develop solutions to complex business problems. Employ techniques and theories drawn from mathematics, statistics, in particular from the subdomains of machine learning, classification, cluster analysis, and data mining.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nClearly communicate methods, conclusions, and recommendations with simple language and innovative visualizations to management and executives.\n<br><br>\nWork effectively on a team as well as a self-driven individual to research and develop cutting edge solutions for the business.\n<br><br>\nProvide expertise in analyzing and visualizing large, complex, and unique data sets.\n<br><br>\nCreate new insights that will drive business growth and profitability in the short and long term.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n10+ years of experience\n<br><br>\nPh.D in Operations Research, Mathematics, Physics, Computer Science, and/or Statistics. Candidates with strong backgrounds in at least two of the areas and an advanced degree in one are preferred (relevant work experience may substitute) preferred.\n<br><br>\nStrong experience with managing, analyzing, and visualizing large datasets.\n<br><br>\nCreativity and persistence in locating, extracting and analyzing any and all relevant data.\n<br><br>\nProgramming experience with two or more of Python, R, Java, Scala, Mathematica, and C++.\n<br><br>\nExperience with relational and non-relational databases.\n<br><br>\nStrong analytical thinking and ability to quickly pick up new methods, tools and programming languages.\n<br><br>\nProblem solving versatility: making the best decisions possible given the data quality and time available.\n<br><br>\nRecord of success and top-tier achievement in prior work and education experiences.\n<br><br>\nPast success in extracurricular math/science activities or competitions is highly regarded.<br>\n<div><strong>Education</strong></div>\n<br>Ph.D preferred\n<br><br>\nField of Study preferred:\n<br><br>\nOperations Research, Mathematics, Physics, Computer Science, and/or Statistics.\n</div>\n<br><strong>Alternate Location:</strong> US-Colorado-Broomfield\n<br><br>\n<strong>Requisition #</strong><strong>:</strong> 206010\n<br><br>\nThis job may require successful completion of an online assessment. A brief description of the assessments can be viewed on our website at <u>http://find.centurylink.jobs/testguides/</u>\n<br><br>\n<strong><u>EEO Statement</u></strong>\n<br><br>\nWe are committed to providing equal employment opportunities to all persons regardless of race, color, ancestry, citizenship, national origin, religion, veteran status, disability, genetic characteristic or information, age, gender, sexual orientation, gender identity, marital status, family status, pregnancy, or other legally protected status (collectively, “protected statuses”). We do not tolerate unlawful discrimination in any employment decisions, including recruiting, hiring, compensation, promotion, benefits, discipline, termination, job assignments or training.\n<br><br>\n<strong><u>Disclaimer</u></strong>\n<br><br>\nThe above job definition information has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. Job duties and responsibilities are subject to change based on changing business needs and conditions.</div>"}