{"job title": "Data Scientist IV", "company": "Central California Alliance for Health", "city state": "– Scotts Valley, CA", "rating": "4.1", "job description": "\n<br>\n<strong>ABOUT US</strong><br><br>We are a group of over 500 dedicated employees, committed to our mission of providing accessible, quality health care that is guided by local innovation. We feel that our work is bigger than ourselves. We leave work each day knowing that we made a difference in the community around us.\n<br><br>\nJoin us at Central California Alliance for Health (the Alliance), where you will be part of a culture that is respectful, diverse, professional and fun, and where you are empowered to do your best work. As a regional non-profit health plan, we serve approximately 350,000 members in Santa Cruz, Monterey and Merced counties. To learn more about us, click here or check out this video.<br><br>\n<br>\n<br>\n<strong>WHAT YOU'LL BE RESPONSIBLE FOR</strong><br><br>Managing and leading the process of designing and developing innovative, data-driven exploratory analysis and predictive and decision models to address business issues related to healthcare management and value-based payment models. You will act as a subject matter expert and as a lead to subordinate analysts and provides orientation, training and mentoring and will provide proactive, strategic consultative solutions related to population health and program evaluation and independently collaborates.\n<br><br>\n<strong>THE IDEAL CANDIDATE WILL HAVE</strong>\n\n<ul>\n<li>Ph.D. in Data Science, Predictive Analytics, Engineering, Mathematics, Statistics, Computer Science or a related field</li>\n<li>Certification as a Certified Professional in Healthcare Quality (CPHQ)</li>\n<li>Working knowledge of provider analytics, value based payment models, and provider evaluation</li>\n<li>Working knowledge of SQL and data visualization tools, such as Tableau</li>\n<li>Experience working on Artificial Intelligence projects</li>\n</ul>\n<strong>WHAT YOU'LL NEED TO BE SUCCESSFUL</strong>\n<br><br>\n<strong>\n</strong><ul><strong>\n<li>Thorough Knowledge of:</li>\n\n</strong>\n\n\n<ul>\n<li>Predictive modeling, data mining, and risk adjustment</li>\n<li>Statistical techniques and data science</li>\n<li>Principles and practices of project management</li>\n<li>Statistical software, such as SAS/R/Python</li>\n<li>Windows based PC systems and Microsoft Word, Outlook, PowerPoint, and Excel, as well as report-generating software</li>\n<li>A variety of quality initiative and cost reduction techniques applicable to multiple settings within the healthcare industry</li>\n<li>Tools and techniques used to perform analysis of large data sets</li>\n<li>Program outcomes evaluation metrics, such as National Committee for Quality Assurance (NCQA), Utilization Review Accreditation Commission (URAC), Agency for Healthcare Research and Quality (AHRQ), and/or Leapfrog</li>\n<li>Healthcare industry and healthcare information standards such as HL7, LOINC, FHIR, ICD 9/10 and CPT codes, industry standard groupers, such as ETGs, DRGs, and DCGs</li>\n<li>Health plan and delivery system operations, healthcare informatics, and healthcare benefits and terminology</li>\n</ul>\n\n<strong></strong><li><strong>Ability to:</strong>\n\n\n<ul>\n<li>Perform new product development from concept to final delivery</li>\n<li>Develop new algorithms and modify existing algorithms in order to solve business problems</li>\n<li>Identify and analyze database and data processing problems and recommend solutions</li>\n<li>Apply business acumen and quickly and effectively assess business situations, risks, and opportunities in order to ensure beneficial outcomes</li>\n<li>Manage multiple projects simultaneously, organize work, maintain accurate records, and achieve goals and timelines</li>\n<li>Develop data-driven and outcome-based initiatives to improve business decision making</li>\n<li>Work collaboratively with individuals at all levels in a matrix organization while supporting multiple customers</li>\n</ul>\n\n</li>\n\n<strong></strong><li><strong>Education and Experience:</strong>\n\n\n<ul>\n<li>Master's degree in Data Science, Predictive Analytics, Engineering, Mathematics, Statistics, Computer Science or a related field</li>\n<li>Minimum of seven years of advanced analytics experience in a healthcare setting which included a minimum of five years of experience building and applying predictive models and performing programming using statistical software or an equivalent combination of education and experience which would provide the required knowledge, skills and abilities may be qualifying. (Note: a Bachelor's degree in Data Science, Predictive Analytics, Engineering, Mathematics, Statistics, Computer Science or a related field and two years of additional experience may substitute for the Master's degree and a Ph.D. may substitute for four years of the required experience)</li>\n</ul>\n\n</li>\n</ul>\n\n<strong>To read the full position description, and list of requirements click here.</strong> \n<br><br>\nOUR BENEFITS\n\n\n<ul>\n<li>Medical, Dental and Vision Plans</li>\n<li>Ample Paid Time Off</li>\n<li>11 Paid Holidays per year</li>\n<li>401(a) Retirement Plan</li>\n<li>457 Deferred Compensation Plan</li>\n<li>Robust Health and Wellness Program</li>\n<li>Fresh Fruit Delivery</li>\n<li>EV Charging Stations</li>\n<li>And <strong>many more</strong></li>\n</ul>\n<em>Applicants must be currently authorized to work in the United States on a full-time basis.</em>"}