{"job title": "Data Scientist", "company": "CGH Technologies, Inc.", "city state": "– Washington, DC", "rating": "2.6", "job description": "Job Description<div><p>CGH Technologies, Inc. (CGH) is a business solutions firm, specializing in Data Management, Software Engineering, and Business Intelligence solutions. Located within the Washington corridor, CGH has worked successfully with Government, Commercial and International sectors, providing management, development and maintenance, and support of large and complex environments. CGH has an exciting opportunity for a seasoned Data Scientist to join the CGH Team.</p><p> </p><p><strong>Purpose:</strong></p><p>The Data Scientist will support projects under the guidance of the Chief Technical Officer to help define and support long-term, enterprise-level data analytics and management strategies. The qualified candidate will have proven abilities in developing data solutions for large scale enterprise applications.</p><p> </p><p> </p><p><strong>Responsibilities:</strong></p><ul><li>Work closely with business analysts, subject matter experts and development teams to design, develop, test, implement, and support master data management (MDM) and/or Big Data projects.</li><li>Participate in meetings with both technology and business teams to facilitate the understanding, clarification, and implementation of data requirements.</li><li>Integrates and prepares large, varied datasets for analysis. Identify and assess data attributes using statistical software packages in order to develop recommendations and analytical processes based on customer requirements.</li><li>Researches, develops, implements and utilizes statistical methods and strategies to address tactical and strategic problem sets, while working with a technical team.</li><li>Interprets and analyze sdata collected from a variety of sources using exploratory and statistical techniques, validating findings using an experimental and iterative approach.</li><li>Coordinates multifaceted scientific research and analytic activities and provide scientific and technical consultation about applicable best practices and new techniques.</li><li>Models complex problem sets to help discover insights and identify opportunities through the use of statistical, algorithmic, mining and visualization techniques.</li><li>Designs and implements or coordinates systematic and rigorous scientific procedures for determining reliability, validity and statistical confidence associated with specific technologies and methodologies.</li><li>Presents key findings and methodology to team members, customers, and management.</li><li>Plan/Execute data analysis, system development, prototyping and deployment utilizing agile and project management best practices.</li><li>Create and execute project plan; plan and track cost, schedule and technical quality performance requirements; provide weekly status reports to customer and to contract Program Manager; and ensure task is completed on schedule and within budget.</li><li>Conduct Technical Solutions Assessments and Trade-off Analysis.</li><li>Define the overall customer master data strategy for a portfolio of programs. This will require solving some fundamental and highly challenging issues in terms of what data to capture and how to integrate the data between the business functions, and how to organize it for maximum leverage; what tools and technologies we should deploy; and how we define data governance.</li><li>A key challenge will be to build capabilities that can grow and expand to encompass Software as a Service offerings and an increasing portfolio of support, service, and community web-sites. A core component of the execution is the setup of data stewardship capabilities to implement data governance.</li><li>Work with downstream application designers to integrate MDM into the various workflows. Work with data warehousing, analytics systems to make sure that master data is leveraged appropriately.</li><li>Develop and deliver critical dashboards that described the state of master data health across the organization at the highest level. This will highlight data issues from capture or edge systems.</li><li>Act as an industry thought leader to continue to build up awareness of company as a front-runner SaaS Company across the broader web business community as well as a company that leads in utilizing data as a strategic advantage. This will involve speaking at industry events, sharing best-practices with other companies, building working relationships with key data experts, firms, and consultants, and more.</li><li>The data scientist needs to be able to have an end-to-end vision, and to see how a logical design will translate into one or more physical Databases, and how the Data will flow through the successive Stages involved. He (or she) will need to be able to address issues of Data Migration (Validation, Clean-up and Mapping), and will need to understand the importance of Data Dictionaries.</li></ul><p> </p><p><strong>Qualifications </strong></p><p><strong> </strong></p><p><strong>Number of Years Experience Required:</strong></p><ul><li>A minimum of 9 years of experience in data mining, machine learning and distributed computing is required</li></ul><p><strong> </strong></p><p><strong>Minimum Education and Certifications Required:</strong> </p><ul><li>Bachelors degree in Statistics, Data Science, Computer Science or Mathematics preferred.</li></ul><p> </p><p><strong>Technical Skills Required:</strong></p><ul><li>Experience with data modeling, data analysis, data migration tools, data modeling, data integration, data warehousing, database design, and performance tuning on larger databases.</li><li>Experience in various technologies and design.</li><li>Strong experience in integrating services in a MDM mode. </li></ul><p><strong>Computer Skills:</strong></p><p> </p><p> </p><p><strong>Other Knowledge, Skills, and Abilities Required:</strong></p><ul><li>U.S. Citizen or person with valid U.S. Work Visa who has lived in the U.S. for three or more years</li><li>Deep mastery of master data management architecture. Must have a mastery of a wide range of data architectures, including Master Data Management (MDM), Big Data, Customer Data Integration (CDI), unstructured data and metadata, data warehouse, real-time database for personalization, in order to best define the appropriate data architecture.</li><li>Experience working with appropriate programming languages, operating systems, hardware and software.</li><li>Experience working with industry specific technologies.</li><li>Strong communication skills.</li><li>Strong interpersonal and presentation skills for interacting with the most senior levels of internal staff, management and clients.</li><li>Strong analytical and problem solving skills.</li><li>Strong leadership skills.</li><li>Good project management skills.</li></ul><p> </p><p> </p><p>Candidates selected will be subject to a Government background investigation and must meet eligibility requirements.</p><p>CGH offers a comprehensive benefits package to include medical, dental, short- and long-term disability insurance, life insurance, commuter benefit, and flexible spending account. Other benefits include 401K, paid government holidays, and Paid Time Off (PTO).</p><p> </p><p>CGH is an Equal Opportunity Employer</p><p><br><br>For more information, or to apply now, you must go to the website below. Please DO NOT email your resume to us as we only accept applications through our website.<br><br>https://www.applicantpro.com/j/833396-69890</p></div>Company Description<div>CGH Technologies is an information engineering and management support company located in Washington, D.C., with satellite offices in Herndon, VA, Southern Pines, NC, Tallahassee, FL and a workforce spanning 38 states. We have over 25 years of experience with federal and international government agencies, as well as commercial and private sector organizations.<br><br>CGH Technologies, Inc. was founded in 1989 as a woman-owned small business. We pride ourselves on our dedication to meeting each client's unique requirements with personalized and innovative solutions, focusing on services and solutions that add value to the decision management chain. We deliver on time, on budget, and with high-quality results.<br><br>Guided by nearly a quarter of a century of experience, CGH is dedicated to helping our clients succeed by providing \"Satisfaction through Quality\" with every solution we implement. We provide comprehensive solutions to improve operational efficiency across your organization. This includes, but is not limited to:<br><br>Management and organizational consulting<br> Data fusion<br> Cloud computing<br> Custom web &amp; mobile applications<br> Software-as-a-Service (SaaS) solutions<br> GIS and spatial technologies<br> Physical and cyber security<br> Facilities management and engineering<br> Modernization and standards integration<br><br>CGH is also proud to have been ranked as one of the Top Woman-Owned Businesses and as one of the 50 fastest-growing companies in the Washington region by the Washington Business Journal. For a more detailed account of the awards CGH has received, please click here. Or read more about our work with Federal NOTAM System (FNS) NOTAM Search, the Sector Design and Analysis Tool (SDAT), and the FAA's NextGen Program.<br><br>To us, every project we take on is a promise we make: a commitment guaranteeing excellence, integrity, and leadership. If you have any questions, please contact us.</div>"}