{"job title": "Data Engineer, ETL", "company": "CGI Group, Inc.", "city state": "– Bloomfield, CT", "rating": "3.4", "job description": "Want to leverage your experience and development skills in the Healthcare industry as a ETL Engineer ?\n<br><br>\nCGI is seeking a Sr ETL talent with strong Object Oriented Programming knowledge with modern software engineering practices (Continuous Integration, Specification by Example, Behavior / Test Driven Development BDD, TDD) and respective tools, to become a part of a dynamic team located in Bloomfield, CT ! This is an exciting opportunity to augment your current skills, as well as, learn new technologies.\n<br><br>\nIf you are looking for a new challenge and want to make a difference in the Healthcare Industry, this role is for you.\n<br><br>\n<strong>Your future duties and responsibilities:</strong>\n<br><br>\n<strong>FUTURE DUTIES AND RESPONSIBILITIES</strong>\n<br><br>\nList principle responsibilities.\n\n\n<ul>\n<li>Develops Extract, Transform, Load (ETL) scripts utilizing a thorough understanding of relational databases, object oriented programming, available technology, tools and existing designs.</li>\n<li>Designs, codes, tests, debugs, and documents programs leveraging Python and Java</li>\n<li>Provides comprehensive consultation to business unit and IT management and staff at the highest technical level on all phases of application programming.</li>\n<li>Overall understanding of Big Data architecture and latest trends.</li>\n<li>Works closely with client and IT management and staff to identify application development solutions, new or modified programs, reuse of existing code through the use of program development software alternatives, or integration of purchased solutions or a combination of the available alternatives.</li>\n<li>Perform project delivery functions in support of releases</li>\n<li>Responsible for delivery of medium to high complexity project work</li>\n<li>Maintain in-depth knowledge of project tools and data sources.</li>\n<li>Participate in all sprint planning, daily standups, and sprint review sessions</li>\n<li>Perform sprint demos to get stakeholder agreement that sprint deliverables meet the requirements</li>\n<li>Provide support for technical specifications</li>\n<li>Engage in operational readiness activities to ensure that project \"go-live\" is stable and successful</li>\n<li>Perform QA Automation functions to ensure project delivery is successful</li>\n<li>Maintain breadth of knowledge on all business processes.</li>\n<li>Communicate analytical findings/gaps/solutions to management and offer solutions to meet gaps.</li>\n<li>Manage the synthesis of large data-sets into meaningful information used to drive action.</li>\n<li>Determine opportunities and identify technical solutions to increase analytical processing efficiency.</li>\n<li>Communicate statuses, good and bad, to partners to keep them informed and engaged in the project, minimizing surprises</li>\n<li>Develops Data workflows and automated scripts in Hadoop Environment using Hive, Impala, Hue, Sqoop, Oozie.</li>\n<li>Demonstrate passion for anticipating and meeting the expectations and requirements of business partners.</li>\n<li>Ability to work with different groups to close bridges/gaps, problem solve, and develop solutions</li>\n<li>Strong accountability and desire to deliver a quality product on time, communicate statuses, or offer alternatives to meet customer objectives</li>\n</ul>\n\nRequired qualifications to be successful in this role:\n<br><br>\nSQL (Expert in any RDBMS, such as Teradata, Oracle, DB2, MSSQL)\n<br><br>\nObject Oriented Design and Development (Python, Java, C#)\n<br><br>\nAgile Engineering Practices\n<br><br>\nTest Driven Development (TDD)\n<br><br>\nContinuous Integration\n<br><br>\nContinuous Delivery\n<br><br>\nRefactoring\n<br><br>\nScripting in *nix environments\n<br><br>\nDatabase performance tuning\n<br><br>\nSkill SetYears of ExperienceProficiency Level\n\n\n<ul>\n<li>SQL (Expert in any RDBMS, such as Teradata, Oracle, DB2, MSSQL) 5 Expert</li>\n</ul>\n\nObject Oriented Design and Development (Python, Java, C#) 3 Advanced\n<br><br>\nAgile Engineering Practices\n<br><br>\nTest Driven Development (TDD),Continuous Integration\n<br><br>\nContinuous Delivery\n<br><br>\nRefactoring - 2\n<br><br>\nDatabase performance tuning 5\n\n\n<ul>\n<li>- Design Patterns</li>\n<li>- Business Intelligence dashboard creation (Tableau, Looker, etc.)</li>\n<li>- Data automation, quality testing and validation</li>\n</ul>\n\nWhat you can expect from us: Build your career with us.\n<br><br>\nIt is an extraordinary time to be in business. As digital transformation continues to accelerate, CGI is at the center of this changesupporting our clients' digital journeys and offering our professionals exciting career opportunities.\n<br><br>\nAt CGI, our success comes from the talent and commitment of our professionals. As one team, we share the challenges and rewards that come from growing our company, which reinforces our culture of ownership. All of our professionals benefit from the value we collectively create.\n<br><br>\nBe part of building one of the largest independent technology and business services firms in the world.\n<br><br>\nLearn more about CGI at www.cgi.com.\n<br><br>\nNo unsolicited agency referrals please.\n<br><br>\nCGI is an equal opportunity employer.\n<br><br>\nQualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status, political affiliation, genetic information, or any other legally protected status or characteristics.\n<br><br>\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com. You will need to reference the requisition number of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a requisition number will not be returned.\n<br><br>\nWe make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.\n<br><br>\nAll CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held.\n<br><br>\nCGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGI's legal duty to furnish information.\n<br><br>\nHave you been referred by a CGI Member for this position?*YesNo"}