{"job title": "Senior Software Data Engineer, Full Stack Java", "company": "CGI Group, Inc.", "city state": "– Owings Mills, MD", "rating": "3.4", "job description": "The Software Data Engineer is an accomplished technical leader, proactive customer-focused advocate, a team player with substantial software engineering experience, preferably with some experience within the healthcare industry. The Software Engineer must have hands-on experience with enterprise level software development, integration and implementation with web based applications. The ideal candidate will have an advanced understanding of Java, JEE platform, data ingestion, data discovery &amp; analysis, data cleansing, data transformation, data modelling, and data visualization. This candidate must demonstrate a willingness to learn new cutting edge technologies and overcome technical challenges in a fast paced environment. The Software Engineer will provide architecture, design, and implementation expertise to a cross-functional software development team. The Software Engineer will play a key role of migrating three enterprise applications into a consolidated application which leverages cloud computing and data lake / big data technologies.\n<br><br>\n<strong>Your future duties and responsibilities:</strong>\n\n\n<ul>\n<li>Design, code, and implement next-generation web application using software engineering best practices in the latest technologies</li>\n</ul>\n\noSingle Page Application Front-End (Angular, Saas, Typescript, NodeJS)\n<br><br>\noNetflix OSS stack (Eureka, Zuul, etc)\n<br><br>\noSpring Framework (Boot, Cloud, Security, Data)\n<br><br>\noDevOps (Jenkins Pipelines, Docker, Groovy, Ansible)\n\n\n<ul>\n<li>Provide software expertise in one or more of these areas: Java application integration, java enterprise services, service oriented architectures, security, business process management/business rules processing, user experience (UX) and accessibility (Section 508/WCAG/USDS Web Standards).</li>\n<li>Investigate and repair application defects regardless of component, including front-end, business logic, middleware, or database (SQL and data modeling).</li>\n<li>All other duties as assigned or directed</li>\n</ul>\n\nRequired qualifications to be successful in this role:\n\n\n<ul>\n<li>Bachelor's Degree in Computer Science or a related field</li>\n<li>10+ years of experience with full lifecycle development</li>\n<li>7+ years of experience with systems/application analysis &amp; design</li>\n<li>4+ years of combined experience SOA/Microservice architecture/REST integration</li>\n<li>Education and/or formal training may substitute for experience requirement</li>\n<li>Technical Skills</li>\n<li>Experience in building responsive UIs with modern front end technologies (Angular 2+, Sass, Typescript, Bootstrap)</li>\n<li>Demonstrable knowledge with Java EE, Java generics and concurrent programming.</li>\n<li>Excellent knowledge of relational databases (PostgreSQL, Oracle), SQL and ORM technologies (JPA2, Hibernate)</li>\n<li>Preferred experience with Spring Framework (Boot, Cloud, Security, Data)</li>\n<li>Preferred experience with ATTD and associated technologies (Fitnesse, Junit, Karma/Jasmine)</li>\n<li>Preferred experience with delivering code using Continuous Integration and Continuous Delivery (CI/CD) best practices and DevOps to production</li>\n</ul>\n\n<strong>DESIRED QUALIFICATIONS</strong>\n<br><br>\nList items desired for the Candidate, but not required.\n<br><br>\n<strong>Other Preferred Skills:</strong>\n<br><br>\nExperience with Centers for Medicare &amp; Medicaid (CMS) systems or with healthcare performance measures a plus\n<br><br>\n#cgifederaljob\n\n\n<ul>\n<li>LI-RS1</li>\n</ul>\n\nWhat you can expect from us: Build your career with us.\n<br><br>\nIt is an extraordinary time to be in business. As digital transformation continues to accelerate, CGI is at the center of this changesupporting our clients' digital journeys and offering our professionals exciting career opportunities.\n<br><br>\nAt CGI, our success comes from the talent and commitment of our professionals. As one team, we share the challenges and rewards that come from growing our company, which reinforces our culture of ownership. All of our professionals benefit from the value we collectively create.\n<br><br>\nBe part of building one of the largest independent technology and business services firms in the world.\n<br><br>\nLearn more about CGI at www.cgi.com.\n<br><br>\nNo unsolicited agency referrals please.\n<br><br>\nCGI is an equal opportunity employer.\n<br><br>\nQualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status, political affiliation, genetic information, or any other legally protected status or characteristics.\n<br><br>\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com. You will need to reference the requisition number of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a requisition number will not be returned.\n<br><br>\nWe make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.\n<br><br>\nAll CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held.\n<br><br>\nCGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGI's legal duty to furnish information.\n<br><br>\nHave you been referred by a CGI Member for this position?*YesNo"}