{"job title": "Data Engineer", "company": "CGI Group, Inc.", "city state": "– Newport News, VA", "rating": "3.4", "job description": "Are you interested in expanding your knowledge of Data Science and Big Data? If so, CGI Federal's Defense Business Unit has an exciting opportunity supporting the federal government as a Data Engineer. We are looking for people with deep understanding of operational data, analytical capabilities and an innovative mindset to solve problems and a customer focused advocate that can work in an agile fast-paced team environment using cutting edge technologies. Data Engineers are responsible for the creation and maintenance of analytics infrastructure that enables almost every other function in the data world. They are responsible for the development, construction, maintenance and testing of architectures to include databases and large-scale processing systems.\n<br><br>\nCome join an exciting team focused on supporting Intelligence and Operational Training Environment through data science, modeling and simulation.\n<br><br>\n<strong>Your future duties and responsibilities:</strong>\n\n\n<ul>\n<li>Support, develop or contribute to data ingestion/workflows, data streaming, data processing, data catalogs, data analysis &amp; exploration, data quality, data visualization, business process management/business rules processing, data exchange, or data modeling and ETL processes using open source and user- developed tools.</li>\n<li>Collaborate with other Data Science, Operations and Intelligence Analysts on data science and big data problems to include utilizing the data science process for defining the question, identifying the needed data sources, developing data model &amp; data capture strategy, developing technical design specifications, and implementation.</li>\n<li>Design, construct, install, test and maintain highly scalable data management systems.</li>\n<li>Design, develop, implement, and maintain code to support data processing, flows thru the Data Lake, and self-service analytics.</li>\n<li>All other duties as assigned or directed.</li>\n</ul>\n\nRequired qualifications to be successful in this role:\n\n\n<ul>\n<li>Bachelor's degree in Information Management, Mathematics, Statistics, Computer Science, Information Technology or a related technical area.</li>\n<li>3-5 years of relevant consulting or industry experience.</li>\n<li>Hands-on experience with enterprise level data ingestion, data discovery &amp; analysis, data cleansing, data transformation, data modelling, and data visualization.</li>\n<li>Understanding of data architecture, governance, and management.</li>\n<li>Ability to code in PL/SQL and RShiny.</li>\n<li>Understanding of and experience with analyzing structured, semi-structured, and unstructured data.</li>\n<li>Programming experience in Java, Python or R. Ability to plan, prioritize, and execute multiple tasks in a fast paced environment. Excellent team player with strong collaboration skills to lead cross functional teams on multi-team projects; strong sense of commitment and responsibility.</li>\n<li>Excellent analytical and problem solving skills; experience building scalable, distributed, high availability services; enjoy technical challenges and constantly striving to improve existing services, systems, and techniques.</li>\n</ul>\n\n<strong>Preferred Qualification:</strong>\n\n\n<ul>\n<li>Experience working with open source or COTS big data tools on Azure or AWS cloud environment.</li>\n<li>Experience working with Geospatial data.</li>\n<li>Experience working with Hive, Pig, S3/Azure Storage Services, Zeppelin, Spark, Elasticsearch, NiFi, Talend etc.</li>\n<li>Strong orientation to quantitative and qualitative, data-driven analysis using stats packages such as SAS; SPSS; MATLAB; R; Python and other open source packages.</li>\n<li>Familiar with the capabilities and value of Service intelligence systems.</li>\n<li>Army or Joint field experience preferred.</li>\n</ul>\n\n<strong>Conditions of Hire:</strong>\n\n\n<ul>\n<li>At hire, possess a valid Secret Clearance, with the eligibility to earn a Top Secret Clearance with SCI access.</li>\n<li>Willing to travel up to 20% of the time</li>\n<li>Possess a valid US passport (required).</li>\n</ul>\n\n#clearedcareers\n<br><br>\nWhat you can expect from us: Build your career with us.\n<br><br>\nIt is an extraordinary time to be in business. As digital transformation continues to accelerate, CGI is at the center of this changesupporting our clients' digital journeys and offering our professionals exciting career opportunities.\n<br><br>\nAt CGI, our success comes from the talent and commitment of our professionals. As one team, we share the challenges and rewards that come from growing our company, which reinforces our culture of ownership. All of our professionals benefit from the value we collectively create.\n<br><br>\nBe part of building one of the largest independent technology and business services firms in the world.\n<br><br>\nLearn more about CGI at www.cgi.com.\n<br><br>\nNo unsolicited agency referrals please.\n<br><br>\nCGI is an equal opportunity employer.\n<br><br>\nQualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status, political affiliation, genetic information, or any other legally protected status or characteristics.\n<br><br>\nCGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com. You will need to reference the requisition number of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a requisition number will not be returned.\n<br><br>\nWe make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.\n<br><br>\nAll CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held.\n<br><br>\nCGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGI's legal duty to furnish information.\n<br><br>\nHave you been referred by a CGI Member for this position?*YesNo"}