{"job title": "Data Analyst IRES - SAFB", "company": "CH2M Jacobs", "city state": "– Colorado, Colorado", "rating": "NA", "job description": "Salary/Rate\n<br><br>\n<strong>N/A</strong>\n<br>\nPermanent\n<br><br>\nLocation\n<br><br>\nColorado-Schriever AFB, United States\n<br><br>\nPosted By\n<br><br>\nCH2M &amp; Jacobs\n<br><br>\nDate Posted\n<br><br>\n6 hours ago\n<br><br>\nExpires 15 Dec 2018\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nNone\n<br><br>\nData Analyst IRES - SAFB in Colorado-Schriever AFB, United States\n<br><br>\nColorado-Schriever AFB, United States | N/A | Permanent\n<br><br>\nAs a Data Analyst, youll work closely with team members and the executive team to implement and execute strategies surrounding data and integrations. You will take part in design and prototype data ingestion, cleaning, curation, storage and retrieval, concentrating particularly on analytics, statistical modeling, dissemination and presentation. The Data Analyst will work with the team to build and maintain endtoend user capabilities and interface based on business functional and performance requirements. The purpose of the Data Analyst is to function as the internal subject matter expert for Data and managing information. Allow for centralized reporting and analysis assuring consistency.\n<br><br>\nBasic Requirements: High School diploma (or GED) with 8 years general experience and/or an Associates degree and 6 years general experience, or a Bachelors degree with 4 years of general experience. General experience must include 4 years of related data science and data analytic development experience. Must be a United States Citizen and must be able to obtain a Secret DoD Secret security clearance. Resumes must be submitted with application in order to be considered for the position. The successful candidate will be assigned as an employee for Jacobs or one of the following teammates companies: HX5, GCS, ERC, MEIT or Aerodyne.\n<br><br>\nDesired Requirements: PMP, Knowledge of Remedy, Microsoft Project and SharePoint. Active Secret Clearance or above\n<br><br>\nAbout Jacobs\n<br><br>\nJacobs leads the global professional services sector delivering solutions for a more connected, sustainable world.\n<br><br>\nWith $15.0 billion in combined revenue and a talent force more than 77,000 strong, Jacobs provides a full spectrum of services including scientific, technical, professional, construction- and program-management for business, industrial, commercial, government and infrastructure sectors.\n<br><br>\nFor more information, visit\n<br><br>\nJob Reference\n<br><br>\n<strong>AER0000WY</strong>"}