{"job title": "Quantitative Research Analyst", "company": "Charles Schwab", "city state": "– San Francisco, California", "rating": "3.5", "job description": "Job ID: ********-6372\n<br><br>\n<strong>Description:</strong>\n<br><br>\nSan Francisco - CA, SF211MN, 211 Main St, 94105-1905\n<br>\nAxle J Marcoline\n\n\n<ul>\n<li>*******-6372</li>\n</ul>\n\nWe believe that, when done right, investing liberates people to create their own destiny. We are driven by our purpose to champion every client's goals with passion and integrity. We respect and appreciate the diversity of our employees, our clients, and the communities we serve. We challenge conventions strategically to create value for our clients, our firm and the world. We live and bring to life the concept of 'own your tomorrow' every day. We champion our employee strengths, guide their development, and invest in their long-term success. We hire optimistic, results-oriented, curious, innovative, and adaptable people with the desire to help our clients and one another succeed.\n<br>\nAs a company, we were established by Chuck over 40 years ago to champion Main Street over Wall Street, and to help Americans transform themselves from earners to owners. Through advocacy and innovation, we work to make investing more affordable, accessible and understandable for all. As we enter our fifth decade, we are looking for talented, innovative and driven people who believe they can help themselves, and our clients, create a better future.\n<br>\n<strong>Our Opportunity:</strong>\n<br>\nCharles Schwab Investment Management (CSIM), the asset management arm of Charles Schwab Corporation, has approximately $350 Billion in assets under management (AUM) and is one of the nation's largest retail money managers. CSIM provides a wide variety of products ranging from money market funds, index mutual funds, actively managed mutual funds, exchange traded funds and multi-asset fund-of-funds. As a provider of core investment products, CSIM is both an important enabler in fulfilling Schwab's mission of helping everyone be financially fit and critical engine in the company's profitability and growth.\n<br>\nCSIM currently manages over $26 billion of multi-asset strategy funds which include Target Date Funds, Target Risk Funds, Monthly Income Funds, Variable Insurance Trust funds, and a number of asset class specific multi-manager funds.\n<br>\nThe associate research analyst will be part of the Multi-Asset Quantitative Solutions team which is responsible for producing cutting edge, top-notch quantitative and qualitative research to be published and used in portfolio construction and management of CSIM's multi-asset strategy funds. This is a great opportunity for moving to a front office role on buy-side.\n<br>\n<strong>What you'll do:</strong>\n\n\n<ul>\n<li>Support senior team members on conducting research on the intersection between economics and financial markets across a wide class of assets including equities, fixed income/credit, REITs, currencies, and commodities.</li>\n<li>Develop and maintain quantitative models, software and database to support the Multi-Asset Strategies team, the CIO of Equity and Multi-Asset Strategies, and sales/product strategist teams.</li>\n<li>Support thought leadership efforts through white papers, timely market commentary, or other potential publications</li>\n<li>Perform research on behavioral finance</li>\n<li>Develop software and design databases to automate reports and PowerPoint presentations</li>\n<li>Support senior research team members and portfolio managers in creating presentations</li>\n<li>Develop software to support the Production Team which is responsible for creating board and committee presentations and documents</li>\n<li>Perform industry analysis and quantitative research and back tests for retirement investment strategies, Target Date Funds, Retirement Income funds, and ETF model portfolios to respond client requests</li>\n<li>Assist in asset allocation and portfolio construction decisions</li>\n</ul>\n\n<strong>What you have:</strong>\n\n\n<ul>\n<li>Bachelor's degree required</li>\n<li>Formal education in Statistics, Econometrics, Computational Finance, Finance, Operations Research, Computer Science or another quantitative field is preferred.</li>\n<li>Strong interest in investment management and long-term strategic investing</li>\n<li>A passion for programming and strong knowledge of R, Python, S-Plus, VB, VBA, SQL Server, SQLite, and MSAccess.</li>\n<li>Comfort and ability to self-direct and prioritize work flow, able to work independently on multiple complex projects.</li>\n<li>Effective writing skills to support thought leadership efforts through white papers, timely market commentary, or other potential publications</li>\n<li>Experience in handling statistical modeling of large complex data sets</li>\n<li>Thorough knowledge of software and database design problems related to various financial analytics' components including risk management, portfolio analysis and back-testing</li>\n<li>Outstanding communication and presentation skills, ability to discuss and explain involved concepts in finance and mathematics in both verbal and written form</li>\n<li>Quick learner, comfortable dealing with ambiguous, fluid situations</li>\n<li>Analytical and critical thinking skills; ability to make good decisions when faced with complex or ambiguous data</li>\n<li>Passion, integrity, creativity, inquisitiveness and self confidence</li>\n<li>The candidate should be a self-starter, well organized, results oriented team player</li>\n</ul>\n\n<strong>What you'll get:</strong>\n\n\n<ul>\n<li>Comprehensive Compensation and Benefits package.</li>\n<li>Financial Health: 401k Match, Employee Stock Purchase Plan, Employee Discounts, Personalized advice, Brokerage discounts.</li>\n<li>Work/Life Balance: Sabbatical, Paid Parental Leave, New Mothers returning to work Program, Tuition Reimbursement Programs, Time off to volunteer, Employee Matching Gifts Program.</li>\n<li>Everyday Wellness: Health and Lifestyle Wellness Rewards, Onsite Fitness Classes, Healthy Food Choices, Wellness Champions.</li>\n<li>Inclusion: Employee Resource Groups, Commitment to diversity, Strategic partnerships.</li>\n<li>Not just a job, but a career, with an opportunity to do the best work of your life.</li>\n</ul>\n\nLearn more about Life@Schwab.\n<br>\nCharles Schwab &amp; Co., Inc. is an equal opportunity and affirmative action employer committed to diversifying its workforce. It is Schwab's policy to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, disability, legally protected medical condition, genetic information, marital status, sexual orientation, protected veteran status, military status, citizenship status or any other status that is protected by law. Schwab also does not discriminate against applicants or employees because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. At Schwab, we believe that every employee, through their diverse abilities and experiences, can contribute to our growth, innovation and client loyalty. We embrace diversity and are committed to providing equal opportunity to all employees and applicants. If you have a disability, and require reasonable accommodations in the application process, call Human Resources at ************. We will be happy to assist you. Schwab will only share your accommodation request with those individuals who have a specific need to know. The request for an accommodation will not affect Schwab's hiring decisions. All other submissions should be performed online.\n<br><br>\n<strong>Job Specifications:</strong>\n<br><br>\nRelocation Offered? Yes\n<br><br>\nWork Schedule Days\n<br><br>\nLanguages English - spoken\n<br><br>\nCurrent Licenses / Certifications None\n<br><br>\nRelevant Work Experience Investment Management - less than 2 yrs, Investment Management - 2-5 yrs, Financial Services-less than 2 yrs, Financial Services-2-5 yrs\n<br><br>\nPosition Located In CA - San Francisco\n<br><br>\nEducation BA/BS\n<br><br>\nJob Type Full Time\n<br><br>\n<strong>Category :</strong>\n<br>\nInvestment Management &amp; Research"}