{"job title": "Quantitative Analyst/Senior Quantitative Analyst", "company": "Charles Schwab", "city state": "– Lone Tree, Illinois", "rating": "3.5", "job description": "Job ID: 0514-40923\n<br><br>\n<strong>Description:</strong>\n<br><br>\nLone Tree - CO, DENR1, 9800 Schwab Way, 80124\n<br>\nBrian Parker\n<br>\n<strong>0514-40923</strong>\n<br><br>\nWe believe that, when done right, investing liberates people to create their own destiny. We are driven by our purpose to champion every client's goals with passion and integrity. We respect and appreciate the diversity of our employees, our clients, and the communities we serve. We challenge conventions strategically to create value for our clients, our firm and the world. We live and bring to life the concept of 'own your tomorrow' every day. We champion our employee strengths, guide their development, and invest in their long-term success. We hire optimistic, results-oriented, curious, innovative, and adaptable people with the desire to help our clients and one another succeed.\n<br>\nAs a company, we were established by Chuck over 40 years ago to champion Main Street over Wall Street, and to help Americans transform themselves from earners to owners. Through advocacy and innovation, we work to make investing more affordable, accessible and understandable for all. As we enter our fifth decade, we are looking for talented, innovative and driven people who believe they can help themselves, and our clients, create a better future.\n<br>\n<strong>Our Opportunity:</strong>\n<br>\nModel Risk Management is a strategic function within the broader Corporate Risk Management umbrella that utilizes a broad spectrum of models to create innovative products for our clients, and to prudently manage our financial risk using sophisticated quantitative approaches. The Model Risk Management team plays a key role in identifying, reviewing, and monitoring all the models at the company.\n<br>\nWe are hiring a quantitative analyst to conduct model validations and make additional contributions to the Model Risk Management team. More seasoned applicants may qualify for the senior analyst position. The analyst may participate in model governance activities in several business areas including regulatory capital stress testing (CCAR/DFAST and Advanced Approaches), statistical classification, and investment management. The analyst will need strong quantitative aptitude and a good understanding of how financial models are used in business contexts. Prior experience with model-driven trading of financial instruments is highly desirable.\n<br>\n<strong>What you'll do:</strong>\n<br>\nThe job responsibilities will include, but not be limited to:\n\n\n<ul>\n<li>Performing model validations following guidelines based on SR 11-7, to include an assessment of model usage, documentation, conceptual soundness, data integrity, the control environment, and the software environment;</li>\n<li>Presenting work through formal model validation reports, as well as through presentations to model owners and senior management;</li>\n<li>Working effectively as a team member with other quantitative analysts at the company, as well as with external consultants;</li>\n<li>Evaluating model performance monitoring reports and conducting model annual reviews.</li>\n</ul>\n\nThis will be an individual contributor role.\n<br>\n<strong>What you have:</strong>\n<br>\n<strong>Required skills and qualifications:</strong>\n\n\n<ul>\n<li>Advanced degree in a quantitative discipline (statistics, mathematics, physics, economics).</li>\n<li>2-5+ years of work experience in quantitative modeling.</li>\n<li>Advanced skill with one or more analytical tools, such as SAS, R, MATLAB, Python, or EViews.</li>\n<li>Strong oral and written communication skills.</li>\n</ul>\n\n<strong>Preferred skills and qualifications:</strong>\n\n\n<ul>\n<li>Experience working with investment management models, including model-driven trading of financial instruments.</li>\n<li>Ph.D. in a quantitative discipline (statistics, mathematics, physics, economics).</li>\n<li>Experience working as a quant in the financial industry.</li>\n<li>CFA and/or FRM certification.</li>\n<li>Knowledge of model governance processes and regulatory requirements for large US banks.</li>\n</ul>\n\n<strong>What you'll get:</strong>\n\n\n<ul>\n<li>Comprehensive Compensation and Benefits package</li>\n<li>Financial Health: 401k Match, Employee Stock Purchase Plan, Employee Discounts, Personalized advice, Brokerage discounts</li>\n<li>Work/Life Balance: Sabbatical, Paid Parental Leave, New Mothers returning to work Program, Tuition Reimbursement Programs, Time off to volunteer, Employee Matching Gifts Program</li>\n<li>Everyday Wellness: Health and Lifestyle Wellness Rewards, Onsite Fitness Classes, Healthy Food Choices, Wellness Champions</li>\n<li>Inclusion: Employee Resource Groups, Commitment to diversity, Strategic partnerships</li>\n<li>Not just a job, but a career, with an opportunity to do the best work of your life</li>\n</ul>\n\nLearn more about Life@Schwab.\n<br>\nCharles Schwab &amp; Co., Inc. is an equal opportunity and affirmative action employer committed to diversifying its workforce. It is Schwab's policy to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, disability, legally protected medical condition, genetic information, marital status, sexual orientation, protected veteran status, military status, citizenship status or any other status that is protected by law. Schwab also does not discriminate against applicants or employees because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. At Schwab, we believe that every employee, through their diverse abilities and experiences, can contribute to our growth, innovation and client loyalty. We embrace diversity and are committed to providing equal opportunity to all employees and applicants. If you have a disability, and require reasonable accommodations in the application process, call Human Resources at ************. We will be happy to assist you. Schwab will only share your accommodation request with those individuals who have a specific need to know. The request for an accommodation will not affect Schwab's hiring decisions. All other submissions should be performed online.\n<br><br>\n<strong>Job Specifications:</strong>\n<br><br>\nRelocation Offered? No\n<br><br>\nWork Schedule Days\n<br><br>\nLanguages English - spoken\n<br><br>\nCurrent Licenses / Certifications None\n<br><br>\nRelevant Work Experience Risk Analysis\n<br><br>\nPosition Located In IL - Chicago, CO - Lone Tree\n<br><br>\nEducation MA/MS/MBA\n<br><br>\nJob Type Full Time\n<br><br>\n<strong>Category :</strong>\n<br>\nRisk Management"}