{"job title": "Data Scientist", "company": "Chartboost", "city state": "– San Francisco, CA", "rating": "3.9", "job description": "We're seeking a superb data scientist to build and evolve our monetization models for both the demand (advertisers) and supply (app publishers) sides of our business. These models have tremendous reach and impact within Chartboost, our partners, and game players around the world.\n<br><br>\n<strong>Who we are:</strong>\n<br><br>\nChartboost is the largest mobile games-based ad monetization platform in the world. We reach an audience of over 900M unique users every month across more than 300,000 mobile games and work with 90% of the top grossing iOS and Android game developers, globally. The Chartboost SDK is the highest-integrated independent mobile ad SDK and through Chartboost Exchange, Ad Network, and other services, we empower developers to build businesses, while connecting advertisers to highly engaged audiences.\n<br><br>\n<strong>What you'll do:</strong>\n\n<ul>\n<li>Generate insightful and actionable information driving ranking and revenue performance by using rigorous scientific and statistical methods.</li>\n<li>Train and tune learning models offline, provide clear guidelines for A/B testing and production launch.</li>\n<li>Analyze millions of structured and unstructured data points and identify meaningful features/signals to improve model performance.</li>\n<li>Clearly document experiments failures and successes backed by data.</li>\n<li>Define, advocate and maintain high standards for data quality.</li>\n</ul>\n<strong>Who you are:</strong>\n\n<ul>\n<li>3-5 years of practical experience in a machine learning or data science role.</li>\n<li>Ability to make progress independently, e.g. you know enough SQL to pull your own data and have mastered a programming language enough to assist you in analysis.</li>\n<li>Degree in statistics, math, machine learning or computer science.</li>\n</ul>\n<strong>Bonus:</strong>\n\n<ul>\n<li>Knowledge of distributed tools and frameworks, like spark/pyspark, for quick train/deploy cycles</li>\n<li>Knowledge of adtech</li>\n</ul>\n<strong>Perks:</strong>\n\n<ul>\n<li>The opportunity to help build a company with the founding team</li>\n<li>Stock Options - you will have a stake in the future success of Chartboost</li>\n<li>Comprehensive medical, dental and vision insurance options</li>\n<li>Catered lunch and fully stocked kitchens</li>\n<li>Commuter Program and 401k savings plan</li>\n<li>Flex Vacation personal time to refresh your mind/body/soul, spend time with loved ones and celebrate life events. There is no accrual or specific limit to the amount of time an employee may use</li>\n</ul>\n<strong>More about us:</strong>\n<br><br>\nWe are proud of the product we have built and appreciate the impact it has on other people's businesses and lives. We want to be surrounded by people who are always finding opportunities to try something new and grow. We love data and anything that helps drive intelligent decisions and always design with the user in mind. Sounds like a fit? Join us, and be part of the team that will change the future of mobile gaming!"}