{"job title": "Sr Data Engineer", "company": "Charles Schwab", "city state": "– Westlake, TX", "rating": "3.5", "job description": "Description:<br><br>Westlake - TX, TX2050R, 2050 Roanoke Road, 76262-9616\n<br>\nJeanie Lynn Bannon\n<br>\n0821-42905\n<br><br>\n<strong>We believe that</strong>, when done right, investing liberates people to create their own destiny. <strong>We are driven</strong> by our purpose to champion every clients goals with passion and integrity. <strong>We respect</strong> and appreciate the diversity of our employees, our clients, and the communities we serve. <strong>We challenge</strong> conventions strategically to create value for our clients, our firm and the world. We live and bring to life the concept of own your tomorrow every day. <strong>We champion</strong> our employee strengths, guide their development, and invest in their long-term success. <strong>We hire</strong> optimistic, results-oriented, curious, innovative, and adaptable people with the desire to help our clients and one another succeed.\n<br><br>\nAs a company, we were established by Chuck over 40 years ago to champion Main Street over Wall Street, and to help Americans transform themselves from earners to owners. Through advocacy and innovation, we work to make investing more affordable, accessible and understandable for all. As we enter our fifth decade, we are looking for talented, innovative and driven people who believe they can help themselves, and our clients, create a better future.\n<br><br>\n<strong>Our Opportunity:</strong>\n<br><br>\nWe are looking for a Sr Data Engineer who has a passion for data and the new technology patterns that support business insight and analytics. We need someone with experience implementing data solutions across a wide variety of tools and technologies. As a Sr Data Engineer you will be responsible for partnering with business product leadership to understand and interpret solution requirements. The role also includes working with Platform Architects to ensure technical integrity and consistency of solutions with Schwabs strategy and standards. This role requires someone excited to advance a team through the transition from traditional data solutions to emerging data patterns.\n<br><br>\n<strong>What youll do:</strong>\n<ul>\n<li>Work with business product owners to understand business requirements and use cases</li><li>Create technical and business solutions architectures (logical and physical)</li><li>Resolve questions during design and implementation of architecture</li><li>Evaluate tools for use case fit, perform vendor/tool comparisons and present recommendations</li><li>Contribute to the capability roadmaps for data platforms</li><li>Review schemas, data models and data architecture for Hadoop and Teradata environments</li><li>Prototype solutions for specific use cases</li><li>Advise peers and business partners on fit-for-use and technical complexities</li><li>Partner with other technical leaders for solution alignment with strategy and standards</li>\n</ul>\n<strong>What you have:</strong>\n<ul>\n<li>Hands-on experience with Hadoop, Teradata (or other MPP RDBMS), MapReduce, Hive, Sqoop, Splunk, STORM, SPARK, Kafka and HBASE (At least 2 years)</li><li>Experience with end-to-end solution architecture for data capabilities including:</li><li>Experience with ELT/ETL development, patterns and tooling (Informatica, Talend)</li><li>Experience with BI tools (BusinessObjects, Tableau) and other visualization (D3)</li><li>Experience with Advanced Analytics (SAS, R)</li><li>Experience with Graph and In-memory databases</li><li>Experience with Machine Learning techniques and practices</li><li>Experience with Test Driven Code Development and SCM tools</li><li>Fluent understanding of best practices for building Data Lake and analytical architectures on Hadoop</li><li>Strong scripting / programming background (Unix, Python preferred)</li><li>Strong SQL experience with the ability to develop, tune and debug complex SQL applications</li><li>Expertise in schema design, developing data models and proven ability to work with complex data is required</li><li>Experience in real time and batch data ingestion</li><li>Proven experience in working in large environments such as RDBMS, EDW, NoSQL, etc.</li><li>Understanding security, encryption and masking using various technologies including Kerberos, MapR-tickets, Vormetric and Voltage</li><li>Familiarity with MapR distribution of Hadoop is preferred</li>\n</ul>\n<strong>What youll get:</strong>\n<ul>\n<li>Comprehensive Compensation and Benefits package</li><li>Financial Health: 401k Match, Employee Stock Purchase Plan, Employee Discounts, Personalized advice, Brokerage discounts</li><li>Work/Life Balance: Sabbatical, Paid Parental Leave, New Mothers returning to work Program, Tuition Reimbursement Programs, Time off to volunteer, Employee Matching Gifts Program</li><li>Everyday Wellness: Health and Lifestyle Wellness Rewards, Onsite Fitness Classes, Healthy Food Choices, Wellness Champions</li><li>Inclusion: Employee Resource Groups, Commitment to diversity, Strategic partnerships</li><li>Not just a job, but a career, with an opportunity to do the best work of your life</li>\n</ul>\nLearn more about Life@Schwab.\n<br><br>\nCharles Schwab &amp; Co., Inc. is an equal opportunity and affirmative action employer committed to diversifying its workforce. It is Schwab's policy to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, disability, legally protected medical condition, genetic information, marital status, sexual orientation, protected veteran status, military status, citizenship status or any other status that is protected by law. Schwab also does not discriminate against applicants or employees because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. At Schwab, we believe that every employee, through their diverse abilities and experiences, can contribute to our growth, innovation and client loyalty. We embrace diversity and are committed to providing equal opportunity to all employees and applicants. If you have a disability, and require reasonable accommodations in the application process, call Human Resources at 800-725-3535. We will be happy to assist you. Schwab will only share your accommodation request with those individuals who have a specific need to know. The request for an accommodation will not affect Schwab's hiring decisions. All other submissions should be performed online.<br><br>Job Specifications <div> Relocation Offered?: No</div> <div> Work Schedule: Days</div> <div> Languages: English - spoken</div> <div> Current Licenses / Certifications: None</div> <div> Relevant Work Experience: IT-Other Specialty Engineering-6+ yrs</div> <div> Position Located In: CO - Lone Tree, TX - Westlake</div> <div> Education: BA/BS</div> <div> Job Type: Full Time</div> \n<br>\nCategory:Information Technology\n<br>\nActivation Date: Tuesday, August 21, 2018\n<br>\nExpiration Date: Thursday, November 22, 2018\n<br>\nApply Here"}