{"job title": "Manager of Data Science, Consumer Analytics", "company": "Chegg", "city state": "– Santa Clara, CA, United States", "rating": "4.1", "job description": "The Analytics team is central to Chegg’s digital marketing efforts – we use data and analysis to support every business line and functional organization at the company. It is a team composed of data scientists, engineers, mathematicians, statisticians, and business analysts. We use a world-class set of data science and BI technologies to transform our data into insights and then into knowledge.\n<br><br>\nOur responsibilities include:\n<ul>\n<li>partnering with teams to measure and optimize marketing performance modeling customer behavior and lifetime value drivers</li><li>building executive dashboards and helping drive self-serve analytics</li><li>managing and evolving our digital marketing technology</li><li>designing and driving forward our customer data platform</li>\n</ul>\nIn short, we are a diverse team of folk who absolutely love working with data to help Chegg deliver on our Student First mission.\n<br><br>\nThe role: Manager, Data Science, Consumer Analytics\n<br><br>\nWe are looking for someone to help us accelerate our journey from Consumer Analytics to Consumer Science. We have a roadmap, and are looking for you to own, influence and accelerate this to drive the biggest business impact. You will manage a team that focusses on making us better at what we already do, testing key hypotheses underpinning our roadmap, and evolving that roadmap based on what you discover.\n<br><br>\nThe Manager, Data Science will primarily focus on improving our analyses and modeling that helps understand relationships between marketing initiatives, marketing KPIs and business KPIs. You will work with the marketing, product and business leads to guide decisions and prioritization based on scientific methods. You create and operationalize insights that help identify effective user acquisition strategies that helps maximize CLV. Working with other Analytics team members, you will balance multiple analytics efforts with several organizations, delivering insights with innovative problem solving methods.<br><br>Responsibilities:\n\n<ul>\n<li>Become a trusted partner who provides expert advice in the usage and interpretation of data.</li><li>Identify impactful opportunities to improve our analytical measurement approaches and shape the roadmap based on such learning to keep us moving forward.</li><li>Evangelize and support scientific, measurement, based approaches. Partner with marketers to apply statistical rigor to their analyses and business recommendations.</li><li>Support and design sophisticated experiments to test the validity of hypotheses. Use exploratory data analysis techniques to identify meaningful relationships, patterns, or trends from complex data sets.</li><li>Collaborate with other analysts/data scientists and help guide the marketing acquisition/engagement strategy based on learning from other analyses/projects across the organization.</li><li>Lead a small team of analysts/data scientists to empower marketing team to make their own decisions with data.</li>\n</ul>\nRequirements:\n<ul>\n<li> 7+ years previous marketing analytics experience required.</li><li>Master’s degree in a quantitative field (Sciences, Engineering, Economics, etc.)</li><li>Experience leading a small team preferred.</li> \n</ul>\nMarketing analytics skills:\n<ul>\n<li>Proficiency in web analytics platforms such as Google Analytics, Adobe Analytics or others.</li><li>Familiarity with multi-channel attribution platforms (Convertro, VisualIQ, Adometry or Adobe Data Workbench).</li><li>Experience in SEO analytics preferred.</li>\n</ul>\nAnalytical Skills:\n<ul>\n<li>Top-decile data wrangling skills; strength in SQL, R, Python for data analysis, modelling and visualization.</li><li>Experience working with big data platforms such as Hadoop and Hive, a plus.</li><li>Extensive analytical toolset including an advanced understanding of statistics (time series analysis, cluster analysis, multivariate analysis).</li><li>Experience with predictive modeling, forecasting, and segmentation analysis.</li><li>Hands-on experience with BI tools such as Tableau, Domo, Qlikview, Looker.</li><li>Self-motivated, independent, organized and proactive, highly responsive, flexible and adaptable when working across multiple teams.</li><li>Passionate about producing high-quality analytics deliverables and communicating recommendations effectively to a broad audience.</li> \n</ul>\n<strong>About Chegg:</strong>\n<br><br>\nAs the leading student-first connected learning platform, Chegg's Student Hub makes higher education more affordable and more accessible, all while improving student outcomes. Chegg is a publicly-held company based in Santa Clara, California and trades on the NYSE under the symbol CHGG and has 900+ employees with offices in Santa Clara, San Francisco, Portland, New York, Provo, Atlanta, Israel, and Ukraine and trades on the NYSE under the symbol CHGG. Chegg Student Hub Services Include: Chegg Study, Chegg Tutoring, Careers Search, Internship Admissions, and College Admissions.\n<br><br>\n<strong>Life at Chegg:</strong> <strong>https://www.youtube.com/watch?v=YYHnkwiD7Oo</strong>\n<br><br>\n<strong>Chegg Benefits:</strong> <strong>http://www.chegg.com/jobs/benefits</strong>\n<br>\n<strong>Chegg for Good:</strong> <strong>http://blog.chegg.com/category/chegg-for-good/</strong>\n<br><br>\n<strong>Video Shorts - Life at Chegg:</strong> <strong>https://jobs.chegg.com/Video-Shorts-Chegg-Services</strong>\n<br><br>\n<strong>Certified Great Place to Work!</strong>: <strong>http://reviews.greatplacetowork.com/chegg</strong>\n<br><br>\n<strong><em>For More Information:</em></strong> <strong>https://jobs.chegg.com/</strong>\n<br><br>\n<em>Chegg is an equal opportunity employer</em>\n<br><br>\n#LI-BR"}