{"job title": "Health Scientist", "company": "Cherokee Nation Businesses, LLC", "city state": "– Atlanta, GA", "rating": "3.2", "job description": "Health Scientist (PPLB)\n<br>\nAtlanta, GA\n<br><br>\nThe Polio and Picornavirus Laboratory Branch (PPLB), Division of Viral Diseases, National Center for Immunization and Respiratory Diseases, provides: 1) laboratory assistance, technical expertise and support for surveillance and related activities to monitor impact of vaccination and other prevention programs, and determine patterns of infection and disease; 2) provides laboratory support and technical expertise for epidemiologic and laboratory studies to define patterns and risk factors for infection, disease, and disease burden; study vaccine-related issues; and, identify and evaluate non-vaccine prevention strategies; (3) provides laboratory consultation and technical expertise regarding use of vaccines and other measures to prevent infections to other national centers, collaborators, and partners; (4) provides laboratory consultation and support and/or participates in investigations of national and international outbreaks of viral vaccine preventable and other respiratory and enteric viral diseases; (5) provides laboratory leadership and technical expertise to develop science-based statements to Global Polio Eradication Initiative (GPEI), the Advisory Committee on Immunization Practices (ACIP), and other groups to support the development and evaluation of immunization practices and policies in the U.S and internationally; (6) provides laboratory support for surveillance and epidemiologic studies and maintains reference/diagnostic services and expertise; (7) conducts studies of immunology and pathogenesis of disease and the biology, biochemical, genetic, and antigenic characteristics of the agents; (8) develops, evaluates, and improves diagnostic methods and reagents, transfers assays and techniques to national and international public health laboratories, and provides and supports training for laboratorians; (9) facilitates and participates in the development and evaluation of antiviral compounds, vaccines, and vaccination programs; (10) responds to and assists internal and external partners on other public health problems of national and international significance as needed; and (11) serves as the National Reference Laboratory (poliovirus and enteroviruses), World Health Organization (WHO) Collaborating Center for Poliovirus and Enteroviruses Virus Reference and Research, and WHO Global Specialized Polio Reference Laboratory.\n<br><br>\nCherokee Nation Assurance is committed to delivering advanced solutions to its clients, from management consulting to scientific research. The <strong>Health Scientist</strong> position will support work in various scientific and public health areas associated with numerous biological agents.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong>\n\n<ul>\n<li>Conducts Scientific Studies/Surveys/Investigations</li> <li>Designs, oversees, implements, and conducts major scientific surveys/studies, research or projects to identify and solve public health problems.</li> <li>Collects, analyzes and interprets data using appropriate quantitative or qualitative methods.</li> <li>Identifies and analyzes public health issues and their impact on operations that are critical to the public health community at large.</li> <li>Develops and or uses innovative methodologies and techniques.</li> <li>Recommends changes in programs, policies, and/or resource allocations as a result of these efforts</li> <li>Searches, synthesizes and interprets information relevant to public health.</li> <li>Reviews and analyzes studies and projects assessing major and or sensitive public health issues in order to make recommendations for processes, procedures and /or policies related to public health programs, practices and research.</li> <li>Collaborates with internal staff and governmental and non-governmental partners. Accomplishes work independently and/or on teams.</li> <li>Consultation on Scientific and Technical Issues</li> <li>Provides technical advice and assistance to national, state and local health agencies and to various other organizations.</li> <li>Leads collaboration on programs/projects/studies and coordinates efforts, as appropriate, with other program staff, other CDC Centers, Institutes and Offices, other federal agencies, national, State and local health agencies, and private and non-profit organizations, etc.</li> <li>Synthesizes results into written documents and/or oral presentations. Communicates information to various audiences.</li> <li>Prepares scientific and other articles and technical reports for publication.</li> <li>Makes presentations at international and national meetings.</li> <li>Performs other duties as assigned.</li>\n</ul>\n\n<strong>EDUCATION and/or EXPERIENCE</strong>\n<br><br>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Masters of Science degree plus at least 10 years of relevant experience OR Ph.D./Doctoral Degree in microbiology, biology, biotechnology, chemistry, or related field plus 5 years experience.</li>\n</ul>\n\n<strong>KNOWLEDGE, SKILLS, AND ABILITIES</strong>\n\n<ul>\n<li>Knowledge of the principles, concepts, methods, and techniques of public health research and evaluation to analyze, evaluate and provide expert advice and consultation.</li> <li>Knowledge of the principles, methods, applications, and state-of-the-art technology in the position's scientific area of responsibility to provide direction and guidance on critical and complex issues.</li> <li>Ability to perform complex analytical studies and interpretation of results to coordinate the evaluation of programs and recommend improvements.</li> <li>Ability to communicate, both orally and in writing, to make clear, convincing presentations, explain and justify recommendations, represent the agency and assigned program or project areas, provide guidance and advise program administrators and members of the community, respond to inquiries, and interact with high level officials and representatives from public and private public health organizations.</li>\n</ul>\n\nApplicants selected will be subject to a U. S. Government security investigation and must meet eligibility requirements for access to classified information.\n<br><br>\nCherokee Nation Assurance (CNA) is a technology solutions provider specializing in delivering information technology, management consulting program support and professional support services. CNA's full scope of computer and technology-related services include enterprise architecture, application development, database administration, systems administration, networking, security compliance, configuration management, infrastructure services, video surveillance, access control and professional IT services. Wholly owned by the Cherokee Nation, CNA is part of the Cherokee Nation Businesses family of companies.\n<br><br>\nWe are an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected Veteran status, gender identity and sexual orientation. If you'd like more information about your EEO rights as an applicant under the law, please visit the following two sites:\n<br><br>\nhttp://www.eeoc.gov/employers/upload/poster_screen_reader_optimized.pdf\n<br><br>\nhttp://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\n<br><br>\nIf you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may e-mail CNB.Compliance@cn-bus.com for assistance. This email address is for accommodation requests only and cannot be used to inquire about the application process or status.\n<br><br>\nFor Pay Transparency Non Discrimination provision, click here: www.dol.gov/ofccp/pdf/PayTransparencyNotice_JRFQA508c.pdf\n<br>"}