{"job title": "Data Scientist", "company": "Chicago Transit Authority (CTA)", "city state": "– Chicago, IL", "rating": "NA", "job description": "<strong>Description</strong> <br>Under general supervision, provides data-based insights and recommendations that lead to change. Coordinates within the team to augment performance analysis insights for the entire agency. Works with the executive office and operating departments by delivery of key performance metric relationships and performance improvement strategies to enhance organizational performance and managerial effectiveness. Manages multiple diverse and complex projects to implement performance improvement strategies resulting from data reporting and modeling and serves as liaison to address structural data needs and achieve efficiencies and process improvements throughout the Authority. <br> <strong>Qualifications</strong> <br> <p><strong>PRIMARY RESPONSIBILITIES</strong></p> <ul> <li>Identifies and leads predictive analytic projects aimed towards pre-emptive action, enabling new magnitudes of cost savings and service quality improvements in effort to maximize value of new and existing streams of data. </li> <ul> <li>Oversees the usage, framework and requirements of the analysis systems and data needs that are required to for data modeling. </li><li>Identifies and monitors project deliverables, scope, plan, issues, risks, and milestones. Establishes measures to determine success of projects (e.g., costs, scope, time, intended results). Interfaces with departments to effectively communicate project goals and ongoing insights. Ensures all targets and requirements are met. </li><li>Performs predictive analysis required by employing advanced mathematical techniques, standard statistical methods and programming languages to discover explanatory and predictive models of business performance that represent the inherent relationship between data inputs and outputs/agency performance outcomes. </li> </ul> <li>Works with departments in obtaining performance process insights by performing diagnostic and descriptive analysis. </li> <ul> <li>Oversees reports and dashboards that provide insights into key programs and initiatives on an on-going basis. </li><li>Documents departmental processes and workflows to gain general understanding necessary to measure performance levels. </li><li>Develops meaningful performance metrics that result in organizational and service improvements. </li><li>Implements and maintains document data collection, reporting requirements and ongoing data validation. </li><li>Provides on-going oversight and support to departments to ensure that measures are being used to effectively manage operations and affect improved efficiency. </li> </ul> <li>Assists management in gaining an understanding of the goals and objectives of performance management and how to incorporate the concept into their daily routine by providing solutions and answers to department's issues and questions relating to performance management.</li><li>Develops ad hoc analyses of critical issues that impact site performance and translate the analyses into actionable recommendations.</li><li>Reviews data from department reporting tools, analyzes data using performance management methods, and prepares analysis and conclusions to ensure department reporting tools are complete and accurate. Constantly works towards data pipeline improvements and reporting optimization of all agency systems. Continually works towards automating reporting processes to improve workflows and expand performance management insight capabilities. </li><li>Performs related duties as assigned. </li> </ul> <p><strong>CHALLENGES</strong></p> <ul> <li>Synthesizing large amounts of data into meaningful results from numerous sources. </li><li>Presenting and explaining complex, technical subject matter to a non-technical audience. </li> </ul> <p><strong>EDUCATION/EXPERIENCE REQUIREMENTS</strong></p> <ul> <li>Bachelor's degree in Business Administration, Statistics, Mathematic, Computer Science, or a related field, or an equivalent combination of related education and experience. </li> </ul> <p><strong>PHYSICAL REQUIREMENTS</strong></p> <ul> <li>Requires sitting for extended periods of time, standing, visual acumen, manual dexterity, and fingering for working with computer keyboards. </li><li>May be exposed to noise, machinery, and garage environment in field locations. </li> </ul> <p><strong>KNOWLEDGE, SKILLS, AND ABILITIES</strong></p> <ul> <li>Advanced quantitative knowledge needed for data modeling, testing, validation and evaluation </li><li>In depth knowledge of various data programming languages including R, Python, and SQL. </li><li>Excellent analytic, quantitative and problem solving skills with proven ability to deliver actionable insights</li><li>Effective data visualization and business intelligence process flow automation skills </li><li>Working understanding of technical systems as related to reporting data flows </li><li>Working understanding of programming development requirements and use of revision control systems </li><li>Working knowledge of performance management principles and effective use of logic models.</li><li>Working knowledge in developing and implementing performance measurement management systems. </li><li>Working knowledge of performance measures and change management principles and practices. </li><li>Working knowledge of data analysis techniques with an understanding of basic statistical concepts. </li><li>Working knowledge of databases, analysis, and presentation software: Microsoft Word, PowerPoint, Excel, Access, and SQL. </li><li>Strong oral and written communication skills and ability to effectively communicate with a variety of audiences. </li><li>Strong organization, analytical, and problem solving skills. </li><li>Ability to provide technical guidance and coordinate collaboratively within a team </li><li>Ability to manage multiple projects and balance multiple priorities, deadlines and budget constraints. </li><li>Ability to multi-task and possess the flexibility to frequently transition from one project assignment to another. </li><li>Ability to work effectively with a diverse group of stakeholders, to include senior management, project managers, and subject matter experts. </li> </ul> <p><strong>WORKING CONDITIONS</strong></p> <ul> <li>General office environment.</li><li>Required to travel to various CTA field locations and transit property locations. </li> </ul> <p><strong>EQUIPMENT, TOOLS, AND MATERIALS UTILIZE</strong>D</p> <ul> <li>Standard office equipment. </li><li>Personal computer and related software (R, Microsoft Word, Power Point, Excel, Access). </li> </ul> <br> <strong>Additional Details</strong> <br>Final salary will be determined in part by the qualifications of the selected candidate and may be higher or lower than target. <br> <br>Applicants, if hired,must comply with CTA's residency ordinance. <br> <br>CTA IS AN EQUAL OPPORTUNITY EMPLOYER <br> <br>IT IS THE POLICY OF THE CHICAGO TRANSIT AUTHORITY THAT NO EMPLOYEE OR APPLICANT FOR EMPLOYMENT WILL BE DISCRIMINATED AGAINST BECAUSE OF RACE, COLOR, CREED, RELIGION, SEX, MARITAL STATUS, NATIONAL ORIGIN, SEXUAL ORIENTATION, ANCESTRY, AGE, UNFAVORABLE MILITARY DISCHARGE OR DISABILITY. CTA WILL MAKE REASONABLE ACCOMMODATIONS FOR THE KNOWN DISABILITIES OF OTHERWISE QUALIFIED APPLICANTS FOR EMPLOYMENT AS WELL AS ITS EMPLOYEES, UNLESS UNDUE HARDSHIP WOULD RESULT. IF YOU REQUIRE AN ACCOMMODATION IN THE APPLICATION OR HIRING PROCESS, PLEASE CONTACT (see application details) PRIOR TO THE SUBMISSION OF YOUR APPLICATION OR UPON NOTIFICATION OF YOUR ACTUAL TEST DATE. CTA WILL WORK WITH YOU TO DETERMINE IF AN ACCOMMODATION CAN BE PROVIDED. <br> <br> *CB"}