{"job title": "Bioinformatics Scientist II", "company": "Children's Hospital of Philadelphia", "city state": "– Philadelphia, PA", "rating": "3.9", "job description": "Req ID:&nbsp;22131\n<br><br>\nShift: Days\n<br><br>\nEmployment Status:&nbsp;AF - Active - Regular - Full Time&nbsp;<br>\n<div>\n<strong>Job Summary</strong>\n<br><br>\nThe Bioinformatics Scientist II position in the CHOP Microbiome Center is an entry level position for a PhD level professional and a 2nd stage position for those with moderate experience without a PhD. The focus of the position is service-level application of bioinformatics tools and methods to bench and clinical research problems in various biomedical domains. The position allows for a wide variety of activities described within the job responsibilities and encompasses positions within both research and clinical environments. Activities occur with a moderate degree of supervision with some latitude for independent judgment, development of bioinformatics workflows and processes, and presentation of results. The Bioinformatics Scientist II will begin to apply best practices in collaborative science as a bioinformatics domain expert. Academic output, while not a primary focus of this position, is also expected with a moderate degree of supervision. The Bioinformatics Scientist II is primarily focused on supporting scientific teams and projects as a bioinformatics domain expert.\n<br><br>\nThe Bioinformatics Scientist II must be able to perform all responsibilities listed in the Bioinformatics Scientist I job description. All responsibilities listed in this description are additional.\n<br><br>\n<strong>Job Responsibilities</strong>\n<br><br>\n<strong>Pre-Analysis (20%): Contribute to the development of application portfolio by developing knowledge of internally developed systems, open-source programs, and commercial applications. Provide efficient data management support.</strong>\n\n\n<ul>\n<li>Use standard pipelines for data processing and manipulation in advance of performing analysis in a manner that best enables the analysis plan.</li>\n<li>Contribute to the development of additional pipeline functionality and changes by providing knowledge of both collaboration-specific requirements and bioinformatics discipline advances.</li>\n<li>Advocate for specific collaboration requirements for continual advancement of shared pipeline and code resources.</li>\n<li>Provide collaboration-specific transparency for data processing and pre-analysis, including sample- and cohort-level status.\n<br><br>\n<strong>Coding (20%): Code and generally support code and applications on behalf of collaborative project and/or team.</strong></li>\n<li>Within the context of the collaboration or project, develop and apply best practices to code development.</li>\n<li>Establish requirements with the project team.</li>\n<li>Review existing applications and code sources (both commercial and open source) and selection of best strategy for development or adoption.</li>\n<li>Advocate for chosen strategy to project team by showing value of approach</li>\n<li>Develop best practices for project-based code development, QC, and execution consist with the expectations of specific collaborations.</li>\n<li>Regularly seek peer-to-peer code reviews by participating in informal and formal critical code reviews.\n<br><br>\n<strong>Data Analysis (20%): Analyze data of high complexity by applying sound statistical and commonly accepted bioinformatics methods to -omics data primarily under the direction of the collaborative project team.</strong></li>\n<li>Develop robust analysis plans independently with regular peer-to-peer review in both informal and formal settings.</li>\n<li>Incorporate more advanced applications and methods into analysis.</li>\n<li>Develop at least one “specialty” analytical or biomedical area that serves the collaborative team.\n<br><br>\n<strong>Collaboration (20%): Establish role within collaborative project team as primary bioinformatics resource.</strong></li>\n<li>Contribute to and influence project-level management by serving as bioinformatics point.</li>\n<li>Define and promote boundaries of support by assessing all stakeholders, including bioinformatics management, collaborator expectations, and funding levels and mechanisms.</li>\n<li>Regularly discuss satisfaction and expectations with collaborators; continually advocate for clear understanding of role.</li>\n<li>Develop new collaborations with high degree of supervision.\n<br><br>\n<strong>Academic Output (20%): Develop presentations, grant sections, and manuscript sections with subsequent review by peers and mentors.</strong></li>\n<li>Regularly contribute to bioinformatics-focused manuscripts and publications.</li>\n<li>Regularly contribute to podium presentations and posters.</li>\n<li>Contribute to bioinformatics sections of grant and award proposals.\n<br><br>\n<strong>Required Education and Experience</strong>\n<br><br>\nRequired Education: Bachelor’s Degree in biological or computational discipline.\n<br><br>\nRequired Experience:</li>\n\n</ul>\n\n\n<ul>\n<li>At least three (3) years of experience in applied bioinformatics, genomics, and computational work.</li><li>Experience with management and analysis of complex data types.</li></ul>\n\n<ul>\n<li>Experience with genomic/proteomic data analysis methods.</li>\n</ul>\n<strong>Preferred Education, Experience &amp; Cert/Lic</strong>\n<br><br>\nPreferred Education: Master’s or Doctorate Degree in biological or computational discipline\n<br><br>\nPreferred Experience:\n\n\n<ul>\n<li>Experience with Python, R, or other programming languages preferred.</li>\n<li>Experience with pipeline or workflow development frameworks preferred.</li>\n<li>Experience or knowledge of technologies commonly used in biological labs, such as PCR, cloning, electrophoresis gels, and cell culture preferred\n<br><br>\n<strong>Additional Technical Requirements</strong>\n<br><br>\n• Strong UNIX/LINUX expertise required.</li>\n<li>Proficiency in R, Python, or similar commonly used bioinformatics language required.</li>\n<li>Proficiency in various open source and commercial bioinformatics resources and software required.</li>\n<li>Knowledge of the working mechanism of next-generation DNA sequencing or other high-throughput technologies; awareness of their strengths, weaknesses, and applicability to a specific biological problem is preferred.</li>\n<li>Familiarity with resources of genomic data sets and analysis tools, such as NCBI databases, the Sequence Read Archive, genomre browsers, Bioconductor, etc is required.</li>\n<li>Ability to correctly select and perform statistical tests for most types of genomic data, and to properly interpret their results in the scenario of a specific study is preferred.</li>\n<li>Ability to interact with biologists and clinicians during a scientific discussion is required.</li>\n<li>Accountability and attention to timelines.</li>\n<li>Excellent organization and communication skills with an emphasis on strong presentation skills.</li>\n<li>Ability to independently plan and execute analyses of moderate complexity required.</li>\n<li>Ability to provide objective validation of results required.</li>\n<li>Ability to work in a team environment.\n</li></ul></div>\n<br><strong>All CHOP employees who work in a patient building or who provide patient care are required to receive an annual influenza vaccine unless they are granted a medical or religious exemption.</strong>\n<br><br>\n<strong>Children's Hospital of Philadelphia is committed to providing a safe and healthy environment for its patients, family members, visitors and employees. In an effort to achieve this goal, employment at Children's Hospital of Philadelphia, other than for positions with regularly scheduled hours in New Jersey, is contingent upon an attestation that the job applicant does not use tobacco products or nicotine in any form and a negative nicotine screen (the latter occurs after a job offer).</strong>\n<br><br>\n<strong>Children's Hospital of Philadelphia is an equal opportunity employer. We do not discriminate on the basis of race, color, gender, gender identity, sexual orientation, age, religion, national or ethnic origin, disability or protected veteran status.</strong>\n<br><br>\n<strong>VEVRAA Federal Contractor/Seeking priority referrals for protected veterans. Please contact our hiring official with any referrals or questions.</strong>\n<br><br>\n<strong>CHOP Careers Contact&nbsp;</strong>\n<br><br>\n<strong>Talent Acquisition</strong>\n<br><br>\n<strong>2716 South Street, 6th Floor</strong>\n<br><br>\n<strong>Philadelphia, PA 19146&nbsp;</strong>\n<br><br>\n<strong>Phone: 866-820-9288&nbsp;</strong>\n<br><br>\n<strong>Email:TalentAcquisition@email.chop.edu</strong>\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n\n"}