{"job title": "Data Scientist", "company": "Chipotle", "city state": "– Newport Beach, CA", "rating": "3.4", "job description": "<strong>Talent Acquisition Powered by LEAPROS</strong>\n<br><br>\nChipotle Mexican Grill has partnered with LEAPROS™ Workforce Solutions to build a world-class corporate team in beautiful Newport Beach, CA. This is a rare and exciting opportunity to be part of a major brand revitalization and culture transformation that will drive growth and enable long-term success. Don’t miss this opportunity to be part of a world-class team and help shape the future of a well-branded Fortune 500 company.\n<br><br>\n<strong>ABOUT CHIPOTLE</strong>\n<br><br>\nChipotle Mexican Grill, Inc. (NYSE: CMG) is cultivating a better world by serving responsibly sourced, classically-cooked, real food with wholesome ingredients without added colors, flavors or other additives. Chipotle has more than 2,400 restaurants as of March 31, 2018 in the United States, Canada, the United Kingdom, France and Germany and is the only restaurant company of its size that owns and operates all its restaurants. With more than 70,000 employees passionate about providing a great guest experience, Chipotle is a longtime leader and innovator in the food industry. Chipotle is committed to making its food more accessible to everyone while continuing to be a brand with a demonstrated purpose as it leads the way in digital, technology and sustainable business practices.\n<br><br>\n<strong>CULTIVATING A BETTER WORLD</strong>\n<br><br>\nFood served fast doesn’t have to be a typical fast food experience. Chipotle has always done things differently, both in and out of our restaurants. We're changing the face of fast food, starting conversations, and directly supporting efforts to shift the future of farming and food. We hope you'll join us as we continue to learn, evolve, and shape what comes next on our mission to make better food accessible to everyone.\n<br><br>\n<strong>THE OPPORTUNITY</strong>\n<br><br>\nThe Data Scientist will lead the design and execution of measurement, analytics, and reporting. Key responsibilities include food &amp; beverage menu analytics, sales trend analytics, innovation test measurement, guest behavior analytics, and business intelligence dashboard development. The Data Scientist will extract, organize, analyze, and present data with the goal of highlighting useful information and suggesting conclusions that will improve and grow the business.\n<br><br>\n<strong>WHAT YOU’LL DO</strong>\n<br><br>\nIn addition to following Chipotle’s policies and procedures, principal responsibilities include, but are not limited to:\n\n<ul>\n<li>Contribute to the success of the overall company including revenue, same-store sales, net income, and restaurant unit growth</li>\n<li>Leverage sales, guest, financial, and operational data to conduct deep dive analyses to help the business thoroughly understand key sales trends, drivers, and opportunities</li>\n<li>Perform financial analyses of food and beverage menu’s, new items, and promoted items</li>\n<li>Construct test designs and measure the financial and guest behavior impact of innovation tests and programs to influence decisions on program roll-outs</li>\n<li>Design and develop credible and robust KPI dashboards that help management understand and measure sales and guest performance</li>\n<li>Conduct advanced data mining and on check detail and guest behavioral data</li>\n<li>Assemble, analyze, and synthesize data from multiple sources (sales, cost, guest, market)</li>\n<li>Develop key insights and initial recommendations of actionable opportunities based on analytical results</li>\n</ul>\n<strong>WHAT YOU’LL BRING TO THE TABLE</strong>\n<br><br>\nTo perform this job successfully, you’ll need to be able to perform each essential duty. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n<ul>\n<li>Have a Bachelor’s degree in Computer Science, Engineering, Math, Finance, Statistics or related discipline.</li>\n<li>Possess extreme passion for using data to uncover insights and drive business performance.</li>\n<li>5+ years of relevant experience in a business intelligence role, including data warehousing and business intelligence tools, techniques and technology, or experience in analytics, business analysis or comparable consumer analytics solutions.</li>\n<li>Strong analytical and problem solving skills</li>\n<li>Skilled in extracting, manipulating, and transforming raw data into meaningful information</li>\n<li>Ability to present multidimensional data in a clear and concise fashion in tables, charts, and graphs</li>\n<li>Understanding of database capabilities and experience with integrating, structuring and analyzing large amounts of data from diverse sources</li>\n<li>Emerging ability to derive key business insights from complex information</li>\n<li>Solid written and verbal communication skills for interfacing with individuals with less technical background</li>\n<li>Exceptionally organized and skilled in time management with excellent attention to detail</li>\n<li>Results driven</li>\n<li>Able to take direction and follow through multi-step project steps/procedures consistently</li>\n<li>Able to work on multiple projects simultaneously with moderate levels of supervision</li>\n<li>Ability to work in a fast-paced team environment with frequent and changing deadlines</li>\n</ul>\n<em>At LEAPROS™, we are committed to our core values and guiding ethical principles, to conducting business in a non-discriminatory manner, and to operating in strict compliance with applicable federal and state laws pertaining to Equal Employment Opportunity. This commitment enhances our ability to conduct business with the highest level of integrity, solidifying our position as the most trusted workforce solutions partner. To learn more about LEAPROS™ or to speak with one of our recruitment partners, call 866-920-LEAP or visit our website at www.leapros.com.</em>"}