{"job title": "Chubb Associate Program - Jr. Data Scientist/Data Engineer", "company": "Chubb", "city state": "– Jersey City, NJ", "rating": "3.3", "job description": "Chubb is the world's largest publicly tradedproperty and casualty insurer. With operations in 54 countries, Chubb providescommercial and personal property and casualty insurance, personal accident andsupplemental health insurance, reinsurance and life insurance to a diversegroup of clients. The company is distinguished by its extensive product andservice offerings, broad distribution capabilities, exceptional financialstrength, underwriting excellence, superior claims handling expertise and localoperations globally.\n<br><br>\nAbout Chubb's Information Technology Early CareerDevelopment Program\n<br><br>\nChubb is looking forprofessionals with a Bachelor's Degree to join our Early Career DevelopmentProgram. This is a permanent full-time position and a compelling opportunityto join a global, growing, financially stable and successful company. Asthe industry leader, Chubb is an employer of choice for students aspiring todevelop a meaningful career in a fast-paced, diverse company with offices inmost major US cities.\n<br><br>\nChubb's Information Technologygroup manages all of our critical business systems and data including, forexample, information about customers, rates, premium and expenses. OurInformation Technology team is dedicated to creating competitive advantages inproducts, customer services and business costs by driving digitaltransformation in our business with a modernized focus on agile methodology anddata analytics.\n<br><br>\nAt Chubb, we have designed ourEarly Career Development Program to hone your skills and talents, to help youreach your career goals. By joining the Chubb Early Career DevelopmentProgram, you will be part of an experience that supports the well-roundeddevelopment of critical business skills which in turn contributes to the futuresuccess of our company. Our blended program is designed to include hands-onbusiness assignments in a variety of disciplines, interactive classroominstruction, team assignments and direct interaction with many of our seniorexecutives. As part of this program you will receive:\n\n\n<ul>\n<li>Businesstraining unique to a career at Chubb;</li>\n<li>Technicaltraining to deepen your skill level within your chosen discipline; and anunderstanding of our broader industry;</li>\n<li>Interpersonaleffectiveness training to help you gain strong communication and interactiveskills;</li>\n<li>Access toadditional training to compliment your professional development.</li>\n</ul>\n\n<strong>Position Summary:</strong>\n<br><br>\nIdealcandidate will be a software engineer with experience of working withdistributed data processing systems. You are a self-starter who is passionateabout developing elegant data processing, analytics and machine learningapplications. You are adept at solvingchallenging data problems by utilizing a variety of different strategies, algorithmsand programming models.\n\n\n<ul>\n<li>Identifyrequirements for data challenges that may be loosely defined</li>\n<li>Collectand analyze data from diverse sources and assess accuracy for use</li>\n<li>Analysisoptimize and simplifying datasets for modelling and general consumption</li>\n<li>Designbuild and own distributed cloud-based streaming data pipelines</li>\n<li>Developdata models and algorithms to apply to datasets for normalization</li>\n<li>Identify,evaluate and implement data management framework for data lake</li>\n<li>Continuallyexplore new ways of producing, processing, and analyzing data</li>\n<li>Improvediscoverability and reliability of data by creating and managing metadata</li>\n<li>Researchingand develop modern data engineering techniques</li>\n<li>Buildproof of concepts &amp; prototypes to solve emerging challenges</li>\n<li>Staycurrent with new data technologies and programming models</li>\n<li>Beself-motivated and creative.</li>\n</ul>\n\n<strong>Position Qualifications:</strong>\n\n\n<ul>\n<li>Degree insoftware engineering, computer science or other engineering field</li>\n<li>Passionfor data, numbers and statistics</li>\n<li>Proficientin advanced data manipulation techniques</li>\n<li>Experiencein building data processing and data pipelining workflows</li>\n<li>Experiencein developing python and spark data structures and algorithms</li>\n<li>Experiencein data and database design and best practices</li>\n<li>Experiencedeveloping and implementing machine learning algorithms</li>\n<li>Familiarwith working in linux operating system</li>\n<li>Familiarwith big-data technologies such as spark</li>\n<li>Familiarwith development tools such as git</li>\n<li>Familiarwith data processing technologies in platforms</li>\n</ul>\n\nWho arewe looking for?\n<br><br>\nSuccessful professionals at Chubbcome from many backgrounds and experiences and bring that rich diversity withthem to our company. They also have some things in common and theseattributes will lead to your success at Chubb:\n\n\n<ul>\n<li>Results orientation: a demonstrated ability to meet commitments under pressure</li>\n<li>Practical intellectual adaptability: capable and successful at adapting to new knowledge</li>\n<li>Personal capacity: accepting and welcoming of additional responsibility over time</li>\n<li>Communication skills: an ability to communicate successfully in various settings</li>\n<li>Interpersonal/team skills: works effectively with colleagues at all levels</li>\n<li>Self-leadership: an ability to take full ownership of work and show initiative as needed</li>\n<li>Client focused: understanding of the needs of customers and clients</li>\n<li>Work ethic: a commitment to hard work and a high ethical conduct</li>\n</ul>\n\nChubb offers a competitive compensation package andcomprehensive benefits package including life, health and dental, vision, agenerous retirement savings plan, disability coverage, stock purchase plan,flexible spending accounts, tuition reimbursement, and business casual dress.At Chubb, we are committed to equal employment opportunity and compliancewith all laws and regulations pertaining to it. Our policy is to provideemployment, training, compensation, promotion, and other conditions oropportunities of employment, without regard to race, color, religion, age, sex,sexual orientation, transgender, national origin, disability, geneticinformation, veteran or marital status, or any other characteristic protectedby law."}