{"job title": "Data Scientist", "company": "Chubb", "city state": "– Basking Ridge, NJ", "rating": "3.2", "job description": "<strong>Overview:</strong>\n<br><br>\nReporting to the VP in Data Analytics and Predictive Modeling Unit, the Data Scientist is responsible for working in a collaborative team environment to develop models, and perform ad-hoc data analysis to support various lines business units within Chubb. Project work may span across various lines of business in various geographies (e.g., North America, international, etc.).\n<br><br>\n<strong>Job Responsibilities:</strong>\n<br><br>\nApplication of machine learning and natural language processing in predictive modeling projects aimed at influencing claim outcomes such as but not limited to fraud detection &amp; severity estimation.\n\n\n<ul>\n<li>Participating in meetings with business units to understand the business problems, and assisting in the development of the technical solution to the business problem.</li>\n<li>Building machine-learning models including all aspects of data extraction, cleansing, feature creation, algorithm selection and tuning and performance evaluation</li>\n<li>Developing professional relationships and working collaboratively with counterparts in IT and business units, and working with them to advance understanding of the business, and to secure data needed for project work.</li>\n<li>Monitor the performance of current models that are in place and recommend changes to models</li>\n<li>Assist in preparing presentation and reports to communicate complex analysis to non-technical audience. Participate in presentations to business users.</li>\n<li>Identify new opportunities to leverage analytics within Chubb.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Four-year or master's college degree or equivalent in Statistics, Mathematics, Computer Science, Economics, Actuarial Science, or other related field of study.</li>\n<li>Strong programming expertise in data manipulation using Python</li>\n<li>Strong verbal and written communication skills.</li>\n<li>Ability to work on multiple projects simultaneously and adhere to mutually agreed upon schedules.</li>\n<li>Attention to detail and high level of accuracy in work product.<br><br>SDL2017</li>\n\n</ul>"}