{"job title": "Data Scientist", "company": "CIA", "city state": "– Washington, DC", "rating": "4.0", "job description": "<div>\nDescription\n<br><br>\n Qualifications\n<br><br>\n How to Apply</div><br>\n\n<div>\nDescription<div>\n<div>As a Data Scientist for the CIA, you will organize and interpret data to inform US decision makers, drive successful operations and shape CIA technology and resource investments. Through CIA's global mission, the Agency has access to unique and highly specialized data sets. You will work with advanced hardware, software and techniques to develop computational algorithms and statistical methods that find patterns and relationships in large volumes of data. Data Scientists clearly communicate their conclusions to a diverse audience and become experts through Agency-sponsored continuing education, attendance at academic and technical conferences as well as collaboration with the Intelligence Community.<br><br>Offices of the CIA – Directorate of Digital Innovation<br><br>The Directorate of Digital Innovation (DDI) is at the forefront of defining the future of digital expertise within the CIA. DDI focuses on developing the workforce with cutting-edge skills, investing in IT infrastructure, and modernizing the way the Agency does business. DDI officers help accelerate the integration of innovative methods and tools to enhance the CIA's cyber and digital capabilities on a global scale and ultimately help safeguard our nation. Learn more about the Directorate of Digital Innovation.<br><br>See our work in action:<br><br>Click to watch the video on a separate page.<br><br>Life at CIA<br><br>In addition to a comprehensive benefits package, the CIA offers exciting career opportunities and a dynamic environment. We're on the forefront of world-altering events – as they happen. So working here isn't just a job, it's a mindset and a lifestyle.</div><br>\n\n<div>Add to Job CartRemove From Cart</div></div>\n\n<br>Qualifications<div>\n<div>US citizenship required (dual-national US citizens eligible). All positions require relocation to the Washington, DC metro area.<br><br>Minimum Qualifications:\n\n<ul>\n<li>Bachelor's degree</li>\n<li>Experience in a science, technology, engineering or mathematics (STEM) related field, such as:</li>\n\n<ul>\n<li>Computational social science</li>\n<li>Computer science</li>\n<li>Data analytics</li>\n<li>Economics</li>\n<li>Engineering</li>\n<li>Geospatial analysis</li>\n<li>Mathematics</li>\n<li>Operations research</li>\n<li>Quantitative finance</li>\n<li>Statistics</li>\n</ul>\n\n<li>GPA of at least 3.0 on a 4-point scale</li>\n<li>Experience with real world data through thesis research, internships, or work experience</li>\n<li>Creativity</li>\n<li>Initiative</li>\n<li>Integrity</li>\n<li>Leadership abilities</li>\n<li>Problem solving skills</li>\n<li>Ability to work in a diverse team environment</li>\n</ul>\n\n<strong>Desired Qualifications:</strong>\n\n<ul>\n<li>Advanced degree in a data science equivalent field or sub-field</li>\n<li>Experience working with data rich problems through research or programs</li>\n<li>Experience with computer programming or user experience/user interface</li>\n<li>Ability to successfully complete projects with large or incomplete data and provide solutions</li>\n<li>Strong written and verbal communication skills</li>\n</ul>\n\n<strong>All applicants must successfully complete:</strong>\n\n<ul>\n<li>A thorough medical and psychological exam</li>\n<li>A polygraph interview</li>\n<li>A comprehensive background investigation</li>\n</ul>\nTo be considered suitable for Agency employment, applicants must generally not have used illegal drugs within the last 12 months. The issue of illegal drug use prior to 12 months ago is carefully evaluated during the medical and security processing.</div><br>\n\n<div>Add to Job CartRemove From Cart</div></div>\n\n<br>How to Apply<div>\n<div><strong>If you are ready to apply, add this position to your job cart.</strong> You can add up to four (4) positions. Job cart selections will only be retained during this site visit, so be sure to click \"Apply Now\" before closing the browser window. After clicking \"Apply Now\" you will be taken to the application account creation page. The positions will appear in the cart once you have created an account.\n<br><br>\nDO NOT submit multiple applications; this will only slow the review of your application and delay processing. Please read the Application Instructions carefully before you begin the online application process.<br>\n<div><strong>Important application instructions for this position:</strong>\n<br><br>\nThe following items must be attached to your on-line application (PDF format preferred):\n<ul>\n<li>Resume</li>\n<li>Cover letter in which you specify your qualifications for this position. Please address why you want to work in this role and what differentiates you from other applicants.</li>\n<li>Unofficial transcripts for all degrees</li>\n<li>A writing sample, five (5) pages MAXIMUM, single spaced, technical or analytic paper that focuses on your current area of expertise or interest and is related to your interest in positions at CIA. You can excerpt longer papers.</li>\n</ul>\n\n</div>\n<br>Important Notice: Friends, family, individuals, or organizations may be interested to learn that you are seeking employment with the CIA. Their interest, however, may not be benign or in your best interest. Once you reveal your interest you lose control of that information. We ask all applicants to exercise discretion and good judgment in disclosing your interest in a position with the CIA. You will receive further guidance on this topic as you proceed through your CIA employment processing.\n<br><br>\nWatch the Application Process videos on a separate page.\n<br><br>\nAn equal opportunity employer and a drug-free workforce.</div>\n </div>\n </div>"}