{"job title": "Senior Data Scientist for Tubular Labs", "company": "Ciklum", "city state": "– Kyiv", "rating": "3.7", "job description": "Senior Data Scientist for Tubular Labs (Kyiv) - Jobs at Ciklum<br>\n\n<div>\n<div>\nToggle navigation</div><br>\n\n<div>\n\n<ul>\n<li>Open Vacancies</li>\n<li>About Ciklum</li>\n<li>Our offices</li>\n<li>Relocate</li>\n<li>Send CV</li>\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>\n<div>\nSenior Data Scientist for Tubular Labs (Kyiv)<br><br>Kyiv, Gulliver, Ukraine\n<br><br>\nApply</div>\n </div>\n </div><br>\n\n<div>\n<div>\n<div>\n<div>\n<div><strong>Tubular</strong> is the only online video marketing platform that provides actionable insights based on the behavior of over 150 million individual viewers in order to elevate brands and publishers to the forefront of video.\n<br>\nTubular Audience Dashboard and Tubular Intelligence together create the first easy, instant, and actionable video marketing platform for brands, media companies and multi-channel networks. For enterprises with advanced needs, Tubular’s intelligent video marketing platform options include full-service consulting, content strategy, and paid media planning and optimization.\n<br>\nOnly Tubular tracks 1 billion tracks across 30+ platforms including YouTube, Facebook, Vine, Instagram, Vimeo, AOL, and Yahoo.\n<br>\nWe are your actionable intelligence to grow engaged video audiences.\n<br><br>\nRead more about the client</div>\n </div>\n\n<br>Description<br><br>On behalf of <strong>Tubular Labs</strong>, Ciklum is looking for a <strong>Senior Data Scientist</strong> to join Kyiv team on full-time basis.\n<br><br>\nWe are looking for scientist engineers with product-oriented mindset who are both curious about the data and consistently learn the business domain to produce fruitful and scientifically proven results.\n<br><br>\nGetting analytics for one YouTube channel is easy.Getting it for the entire online video ecosystem is not. Tubular monitors more than 4B online videos, 11M creators and their audience across top platforms including YouTube, Facebook, Instagram and others.\n<br><br>\nHundreds of terabytes of collected data, advanced tooling and data science on top of it let brands, media companies and publishers across the world get a comprehensive picture of what happened today, a week or years ago.<br>\n<div>\nResponsibilities<br><br>You will join a small team of senior engineers in Kyiv to work on key business challenges. We will help you learning the business, challenges, technology so you feel comfortable when starting on your first project.\n<br><br>\nBeing metric-driven we communicate wins and problems through the facts so you should be ready to track, know, and communicate a story with numbers and graphs. It’s everyone’s responsibilities to proactively get all the input needed, plan work, deliver and share results.\n<br><br>\nWe love getting things done, winning, having fun and being boring engineers. Apart from various local events we visit the head office twice a year which is located in Mountain View (California).</div><br>\n\n<div>\nRequirements\n\n\n<ul>\n<li>You can produce well structured and well written and validated code in Python/Spark or have solid experience in other languages and ready to add Python/Scala to your list of skills;</li>\n<li>You are able to easily explain solutions to less experienced engineers and comfortable guiding them through the key points of the problem and the solution;</li>\n<li>You have at least 3 years of experience as Data Scientist or similar role. We expect you to describe a significant business problem you had and your or your team’s solution to it;</li>\n<li>You have a degree in Computer Science, Statistics or similar field including certificates from publicly recognized online courses.</li>\n</ul>\n\n</div><br>\n\n<div>\nPersonal skills\n\n\n<ul>\n<li>Working well autonomously, without close supervision, readiness to take responsibility;</li>\n<li>Acting as a Team player and having highly developed communication skills, both toward co- programmers and project manager;</li>\n<li>Being committed to timely delivery of quality results;</li>\n<li>Innovative in his/her work;</li>\n<li>Knowledge seeking, updated with regards to latest SDK and technological directions in general;</li>\n<li>Documenting his code and general functionality.</li>\n</ul>\n\n</div><br>\n\n<div>\nWhat's in it for you\n\n\n<ul>\n<li>Unique working environment where you communicate and work directly with client;</li>\n<li>Variety of knowledge sharing, training and self-development opportunities;</li>\n<li>Business trips to Mountain View twice a year;</li>\n<li>Competitive salary;</li>\n<li>State of the art, cool, centrally located offices with warm atmosphere which creates really good working conditions.</li>\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>Related jobs\n\n<ul>\n\n \n<li>\n Data DevOps Engineer for Betsson Group (Kyiv)</li>\n<li>\n Data Warehouse (DWH) Engineer for Betsson (Kyiv)</li>\n</ul>\nAll vacancies</div>\n </div>\n </div>\n </div><br>\n\n<div>\nApply for this position<br>\n\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\nAttach your CV (pdf, doc, docx) Max size is 2MB x</div></div>\n<br>\n<div>\nKyiv, AmosovaKyiv, GulliverDniproKharkivGdańskLvivMálagaMinskOdessaTel AvivVinnytsiaWrocław</div></div></div>\n<br>\n<div>\n<div>\n<div>SEND CV\n</div></div></div></div></div>\n</div><br>\n\n<div>\n<div>\n<div>Copyright © 2002-2018 Ciklum. All rights reserved.\n<br><br>\nTerms of\n<br>\n Use | Privacy\n<br>\n Policy</div><br>\n\n<div>\n\n\n<ul>\n\n <li>Ukraine</li>\n<li>Poland</li>\n<li>Spain</li>\n<li>Belarus</li>\n</ul>\n\n </div>\n</div>\n </div><br>\n\n<div>getDBInfo</div>"}