{"job title": "Data Scientist", "company": "Cincinnati Reds", "city state": "– Cincinnati, OH", "rating": "4.7", "job description": "<div>\n<strong>Department:</strong> Baseball Operations</div><div>\n<strong>Job Title:</strong> Data Scientist</div><div>\n<strong>Reports To:</strong> Manager of Baseball Analytics</div><div>\n<strong>Job Purpose:</strong> Work with the Manager of Baseball Analytics to implement the departments research and development efforts within new and existing applications. We envision the person in this position to play a major role in the creation of new baseball analytics concepts with the ultimate goal of enhancing on-field performance.</div><br>\n\n<div><strong>Essential Duties and Responsibilities:</strong></div>\n<ul>\n<li>Design, develop, test, implement and maintain predictive models and metrics utilizing appropriate tools and techniques.</li>\n<li>Work with our Baseball Analytics and Systems staff to integrate new statistical analyses, models and data visualizations into existing and new applications.</li>\n<li>Keep up to date on new predictive modeling techniques and evaluate their potential for application to baseball data sets.</li>\n<li>Collaborate with Major League Operations, Player Development and Sports Science Departments to design and implement statistical analyses.</li>\n</ul><br>\n\n<div><strong>Knowledge, Skills and Abilities:</strong></div>\n<ul>\n<li>3+ years of experience in a computational field, such as Statistics, Biostatistics, DataScience, Mathematics, Engineering, Quantitative Social Sciences or Analytics.</li>\n<li>Strong knowledge of statistical analysis and predictive modeling.</li>\n<li>Demonstrated experience with statistical software (e.g. R, Python) and database querying (SQL).</li>\n<li>Ability to communicate effectively with all aspects of Baseball Operations, Scouting and Player Development staff.</li>\n<li>Experience with Bayesian statistics (preferable, but not required).</li>\n<li>Understanding of typical baseball data structures.</li>\n<li>Knowledge of current baseball research, traditional baseball statistics and strategy.</li>\n</ul>\n\n<div><strong>Work Environment:</strong></div>\n<ul>\n<li>Work is normally performed in a typical interior/office work environment.</li>\n<li>Remote working accommodations are available, as needed.</li>\n<li>Hours may include nights, weekends and holidays.</li>\n</ul>\n\n<div><strong>Expectations:</strong></div>\n<ul>\n<li>Adhere to Cincinnati Reds Organization Policies and Procedures.</li>\n<li>Act as a role model within and outside the Cincinnati Reds Organization.</li>\n<li>Performs duties as workload necessitates.</li>\n<li>Demonstrate flexible and efficient time management and ability to prioritize workload.</li> \n\n<li>Meet Department productivity standards.\n<br><br>\n<strong>Equal Opportunity Statement:</strong>\n<br>\nThe Cincinnati Reds are an Equal Opportunity Employer. It is the policy of the Cincinnati Reds to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, national origin, religion or creed, sex, age, disability, citizenship status, marital status, genetic predisposition or carrier status, sexual orientation or any other characteristic protected by law.</li>\n</ul>\n\n<div><strong>Disclaimer:</strong></div><div>The statements herein are intended to describe the general nature and level of work being performed by the employee in this position. The above description is only a summary of the typical functions of the job, not an exhaustive or comprehensive list of all possible job responsibilities, tasks, and duties. Additional duties, as assigned, may become part of the job function. The duties listed above are, therefore, a partial representation not intended to be an exhaustive list of all responsibilities, duties, and skills required of a person in this position.</div>"}