{"job title": "Big Data Engineer", "company": "Cisco Systems", "city state": "– RTP, North Carolina", "rating": "4.0", "job description": "<strong>What You'll Do</strong><br><br>We need a self-motivated and highly curious individual that is excited to work with ever-evolving groundbreaking technology in the big data field. You will apply a variety of big data technologies to the security space to ingest, transform, index, aggregate, correlate, provide API's, visualize and enable a spectrum of organizations across Cisco.<br><br><strong>Who You'll Work With</strong><br><br>As a member of the Threat Intelligence Platform team, you'll be part of a highly empowered collaborative group who's passionate about using data to help secure Cisco, enable security products, and cultivate security research.<br><br><strong>Who You Are</strong><br><br>You are a self-starter who loves to dig into data and who your teammates trust to throw challenging problems in your direction. As a result, you help make data much easier to understand and consume for others and have managed to pivot to new technologies rapidly.<br><br>At minimum, we expect you to have:\n\n<ul>\n<li>BS in Computer Science or related technical degree</li><li>Active proficiency with Python, Git and test automation</li><li>Minimum 3 years of experience on big data platform (ex. Hadoop, Spark, Kafka, Clickhouse, NiFi)</li><li>Experience with crafting and managing data pipelines</li><li>DevOps mindset with experience on agile team</li><li>Strong technical writing and communication skills</li><li>Excellent problem solving and decision-making skills</li>\n</ul>\n\nThe following would be beneficial, but not required:\n\n<ul>\n<li>Experience with containerization (specifically Docker &amp; Kubernetes)</li><li>Experience with SQL and Linux</li><li>Security experience</li><li>Splunk dashboards, reports, and alerting</li>\n</ul>\n\n<strong>Why Cisco</strong><br><br>At Cisco, each person brings their unique talents to work as a team and make a difference. Yes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people.\n<br><br>\n<strong>We connect everything securely</strong>– people, process, data and things – and we use those connections to change our world for the better.\n<br><br>\n<strong>We innovate everywhere</strong>- from launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education and more – from Smart Cities to your everyday devices.\n<br><br>\n<strong>We benefit everyone</strong>- We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities.Colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Be you, with us! #WeAreCisco\n<br><br>\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis.\n<br><br>\nCisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n<br><br>\n*LI-KM1"}