{"job title": "Digital Analytics Manager", "company": "Citadel Federal Credit Union", "city state": "– Exton,PA", "rating": "3.8", "job description": "Citadel’s Digital Analytics Manager will work with the Digital Experience team and across the organization by leveraging web analytics to improve customers’ online experience and provide insight into the customer journey. This requires deep experience in web-based analytics and the ability to provide insight and strategic recommendations to internal departments and teams based on analysis and trending of site data.\n<br><br>\n<strong>The Digital Analytics Manager reports to the VP Digital Experience and is based in our corporate headquarters in Exton, PA.</strong>\n<br><br>\nThe individual will build a suite of reporting, ensuring it meets the business needs. It's expected that the manager will work with the Digital Experience team to help determine what information is necessary and how to best present it to the business. He/she must be able to present complicated analytics in a clear and concise manner to a variety of audiences. The manager will be asked to leverage analytics to improve the holistic customer experience on the web site, and provide continued insight to that end.\n<br><br>\nExperience in pathing analysis, user behavior, waterfall/fallout analysis and site testing is a must. The manager should be familiar with the major web analytics tools, in particular with Google Analytics. They should have knowledge and understanding of site QA, tagging requirements, and tag management tools. He/she will work with the technology team to identify gaps in the data capture strategy and collaboratively implement enhancements.\n<br><br>\n<strong>Duties and Responsibilities</strong>\n<ul>\n<li>Develop meaningful Key Performance Indicators (KPIs) at all levels, including executive summaries and detailed channel performance reports</li><li>Forecast and report actuals sales against plan for Digital Experience channel.</li><li>Proactively produce insightful analytics to drive the business forward</li><li>Partner with an array of teams to identify business drivers, trends, and drive execution opportunities within the scope of optimizing customer experience and product sales analyzing traffic, order volume, conversion funnel, navigation, and user engagement</li><li>Function as the day-to-day business user of web analytics (such as Google Analytics)</li></ul>\n\n<ul>\n<li>Analyze web traffic and site behavior for customer and business insights to support business decisions and deliver on improved customer site experience or business growth (sales, margin, traffic and conversion)</li></ul>\n\n<ul>\n<li>Respond to ad-hoc inquiries about specific web analytics questions</li><li>Create presentations with structured format to share results</li><li>Contribute to tagging and variable capture requirements for new and changing pages</li><li>Take an active role in identifying potential new data and ways to analyze</li><li>Create statistically sound A/B and holdout tests on various parts of the website</li><li>Manage the Digital Experience channel testing calendar. Coordinate with stakeholders to test new and modified approaches for digital channel sales. Analyze results and recommend next steps.</li></ul>\n\n<ul>\n<li>Maintain data integrity&amp; privacy.</li><li>Stay current on latest digital analytics and VOC trends in financial services and other relevant B2C industries.</li>\n</ul>\n<strong>Qualifications and Education Requirements</strong>\n<br><br>\n<strong>Required Work Experience -</strong> 5-7 years’ quantitative analytics experience\n<br><br>\n<strong>Required Education</strong> - Bachelor’s degree in business or information sciences.\n<br><br>\n<strong>Required Technical Knowledge -</strong> Strong proficiency in Google Analytics, tag management, and website testing tools. Knowledge of CX tools, eg Opinion lab, Qualtrics, Medallia.\n<br><br>\n<strong>Preferred Education</strong> - Master’s degree in business or information sciences.\n<br><br>\n<strong>Preferred Work Experience</strong> - 5+ years’ analytics experience in the financial services or retail industries.\n<br><br>\n<strong>Preferred Technical Knowledge</strong> - Deep experience with Google Analytics and Google Tag Manager (GTM)"}