{"job title": "Quantitative Researcher – Intern (Asia)", "company": "Citadel Securities", "city state": "– Chicago, IL", "rating": "4.9", "job description": "<div>\n<div>\n<div>\nJob Description\n<br>\n <div>Quantitative Researchers play a key role on the Quantitative Research (“QR”) team, which is responsible for developing and testing automated quant trading strategies using sophisticated statistical techniques. You’ll get to apply and hone your quantitative skills in a structured program that allows you to work side-by-side with, and learn from, those who are thriving in this exciting and growing field.</div>\n<br>\n<div><strong>Your Objectives</strong></div>\n\n\n<ul>\n<li>Conceptualize valuation strategies, develop and continuously improve upon mathematical models, and help translate algorithms into code</li>\n<li>Back test and implement trading models and signals in a live trading environment</li>\n<li>Use unconventional data sources to drive innovation</li>\n<li>Conduct research and statistical analysis to build and refine monetization systems for trading signals</li>\n</ul>\n\n<div><strong>Your Skills &amp; Talents</strong></div>\n\n\n<ul>\n<li>Advanced training in Mathematics, Statistics, Physics, Computer Science, or another highly quantitative field (Bachelors, Masters, PhD degree)</li>\n<li>Strong knowledge of probability and statistics(e.g.,machine learning,time-series analysis,pattern recognition,NLP)</li>\n<li>Prior experience working in a data driven research environment</li>\n<li>Experience with NoSQL databases (e.g.,MongoDB)</li>\n<li>Experience with distributed computing using MapReduce</li>\n<li>Experience with analytical packages (e.g., R,Matlab)</li>\n<li>Independent research experience</li>\n<li>Ability to manage multiple tasks and thrive in a fast-paced team environment</li>\n<li>Excellent analytical skills, with strong attention to detail</li>\n<li>Strong written and verbal communications skills</li>\n</ul>\n\n<div>Opportunities available in Chicago, London, Hong Kong and New York</div>\n<br>\n About Citadel Securities<br><br>Citadel Securities is a leading global market maker across a broad array of fixed income and equity securities. Our world-class capabilities position us to meet the liquidity demands of our diverse group of institutional clients in all market conditions. In partnering with us, our clients, including asset managers, banks, broker-dealers, hedge funds, government agencies and public pension programs are able to gain a powerful trading advantage and are better positioned to meet their investment goals.\n<br><br>\nThe team makes its mark every day from our offices around the world: Chicago, New York, London, Hong Kong, Toronto, Shanghai, Sydney, Dublin.</div><br>\n\n<div>\nApply Now</div>\n </div>\n</div>\n\n<br>Apply"}