{"job title": "Developer/Data Scientist - AVP", "company": "Citibank", "city state": "– New York", "rating": "3.4", "job description": "We are looking for talented and energetic developers and data scientists to form a core team that can help Citi identify, evaluate, and adopt best practices and emerging trends to improve human and machine-driven cognition and analytics. This team will design and conduct Proofs-of-Concept projects within the data and cognitive sciences domain include Knowledge Graph tools and technologies, Machine Learning (ML), data profiling technologies, and Big Data analytics. Other complementary technologies include Natural Language Processing (NLP), Natural Language Generation (NLG), Robotics and Process Automation (RPA). Successful projects will move forward to product and program implementation.\n<br><br>\n· Work with stakeholders to refine requirements, communicate progress and create effective feature roadmap\n<br><br>\n· Work with the team to develop a system for semantic search, ontology, knowledge graph creation and query execution\n<br><br>\n· Independently work on end-to-end development of NLP models to build sophisticated and extendable natural language-based search engine\n<br><br>\n· Train deep learning models with internal and external training datasets\n<br><br>\n· Develop highly scalable classifiers and tools leveraging machine learning, data regression and rules-based models\n<br><br>\n· Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU)\n<br><br>\n· Code deliverables in tandem with the team and mentor junior members of the team\n<br><br>\n· Evaluate current market place products and research in architecting solutions\n<br><br>\n· Expert programming skills in Java, Python or Scala with 5 years of relevant work experience\n<br><br>\n· Experience in building/using large scale knowledge graphs (including Linked Data) and ontologies (RDF(S)/OWL, SPARQL)\n<br><br>\n· Strong command over linear algebra and statistics having the ability to quickly translate ideas to efficient, elegant code\n<br><br>\n· Development experience in Python or Java/Scala with good command over respective data pipelining, matrix algebra and statistics libraries\n<br><br>\n· Experience in NLP methods such as LSA, LDA, Semantic Hashing, Word2Vec, LSTM, BiDAF etc.\n<br><br>\n· Experience in information retrieval tools such as Elastic Search, Lucene, Solr and graph databases such as Neo4J, OrientDB, or a triple store\n<br><br>\n· Tuning and optimization of sequential deep learning models\n<br><br>\n· MS in Computer Science with emphasis on Data Science, Analytics and/or Machine Learning. PhD preferred.\n<br><br>\n· Knowledge of Financial Planning &amp; Analysis, Risk Management, Financial products is a plus."}