{"job title": "Data Scientist - Sr. Programmer Analyst", "company": "Citi", "city state": "– Irving, Texas", "rating": "3.5", "job description": "<ul>\n<li><strong>Primary Location:</strong> United States,Texas,Irving</li><li><strong>Education:</strong> Bachelor's Degree</li><li><strong>Job Function:</strong> Technology</li><li><strong>Schedule:</strong> Full-time</li><li><strong>Shift:</strong> Day Job</li><li><strong>Employee Status:</strong> Regular</li><li><strong>Travel Time:</strong> Yes, 10 % of the Time</li><li><strong>Job ID:</strong> 18048603</li>\n</ul>\n\nDescription\n<br>\nCitibank is one of the largest digital banks in the world, spanning over\n<br>\n140 countries and holds over 200,000 customer accounts. The diversity of\n<br>\nbusinesses within Citibank (Retail Bank, Cards, Mortgage, Investments etc.),\n<br>\nwithin each of these countries presents a large portfolio of customer needs to\n<br>\nbe delivered through elegant experiences. We believe that building a\n<br>\nworld-class banking and financial technology platform is the only way to\n<br>\nsupport Citibanks unlimited growth potential, while continuing to provide\n<br>\nexcellent service to both internal businesses and external stakeholders. Citi is hiring a Data Scientist to join the growing digital technology team<br>\n<div><div><strong>Role Description</strong> </div><div>\n\n<ul>\n<li>Hands on experience in predictive analytics and statistical tools, machine learning algorithms and big data tools</li><li>Identify, analyze and interpret trends or patterns in complex data sets using unsupervised ML approaches</li> <li>Use statistical techniques to interpret data and analyze results</li><li>Manipulate, extract, process, and analyze large data sets to develop insights and surface implications</li><li>Create visualizations to visually represent data for consumption by different audiences</li></ul></div>\n</div>\n<br>\nQualifications\n<br>\n<div><strong>Required Technical Skills</strong> </div><div>\n\n<ul>\n<li>SQL, R or Python</li><li>Frameworks/libs: sklearn, nltk, genism, pandas, numpy, matplotlib</li><li>Visualization toolsets and web app creation with popular JS frameworks (Angular, d3.js)</li></ul></div>\n<br>\n<div><strong>Desirable Technical Skills</strong> </div><div>\n\n<ul>\n<li>Hadoop, Spark, Elastic Stack, Git</li><li>Familiarity with HTTP and invoking web-APIs</li> </ul></div>\n<br>\n<div><strong>Personal Skills</strong></div><div>\n\n<ul>\n<li>Experienced in managing work with distributed teams</li><li>Experience working in SCRUM methodology</li><li>Proven sense of high accountability and self-drive to take on and see through big challenges</li><li>Confident, takes ownership, willingness to get the job done</li><li>Excellent verbal communications and cross group collaboration skills</li></ul></div>\n<br>\n<div><strong>Total Experience Required</strong> </div><div>\n\n<ul>\n<li>2+ years of relevant experience</li><li>NLP exposure beneficial</li> </ul></div>\n\n<br>"}