{"job title": "Data Scientist - Innovation Lab", "company": "CitiGroup", "city state": "– NAM-USA-NY-New York", "rating": "3.5", "job description": "<div>We believe the future’s here. Right here with us. Home to where we define, ideate, develop and distribute production-ready financial solutions of far-reaching impact. And right now, the door’s open to direct the future of our technology for a truly global client base. This means collaborating with the keenest minds in data science, big data, software engineering, web development, UX design and more. Doers looking to bring the next bold ideas to life for a fascinating array of clients - investing, trading and transacting at the forefront of change in markets and economies the world over.</div>\n<div> </div>\n<div>If you have this kind of vision, capable of seeing ahead, of developing a clear path forward in a quest to try the as yet untried, here is the opportunity. In a supported, resource-rich, vibrant co-working environment, part of an ecosystem of globally interconnected labs, realizing a broader mission of enabling growth and economic progress on a scale you won’t find anywhere else. Welcome to our New York Innovation Lab!</div>\n<div> </div>\n<div><b> </b></div>\n<div><b>Job Purpose:</b></div>\n<div> </div>\n<div>We are looking for a Data Scientist to help us discover information contained in vast streams of online and offline time-series data, enabling us to make data-driven decisions based on an enhanced understanding of our business performance in the financial markets. </div>\n<div> </div>\n<div>Your primary focus will be in applying data mining techniques, statistical analysis and feature selection in the training, testing and validation of models to be integrated into our financial markets decision-making systems and processes.</div>\n<div> </div>\n<div>You will work closely with product owners and team members to design, build and integrate targeted client solutions into one of our existing well-supported platforms, or through new channels as required. To meet client demand, our project lifecycles are measured in months, not years, presenting many opportunities to take on new challenges.</div>\n<div> </div>\n<div><b>Key Responsibilities</b>:</div>\n<div> </div>\n<ul>\n<li>\n<div>Formulate business ideas in machine learning terms</div></li>\n<li>\n<div>Understand our data and apply techniques for feature engineering and selection </div></li>\n<li>\n<div>Apply state-of-the-art machine learning techniques to financial data, including model selection, training, testing and validation </div></li>\n<li>\n<div>Model visualization, demonstration and documentation, in an online form such as an interactive notebook or single-page application </div></li>\n<li>\n<div>Work closely with product owners to develop client solutions for new and existing channels</div></li>\n<li>\n<div>Grow our catalogue of common assets, such as code templates, libraries, utilities, services, etc.</div></li></ul>\n<ul>\n<li>\n<div>Advanced applied statistics skills, including distributions, statistical testing, regression, etc. </div></li>\n<li>\n<div>Excellent understanding of fundamental machine learning techniques and algorithms, such as k-NN, Regression, SVM, Random Forests, etc. </div></li>\n<li>\n<div>Excellent communicator, able to explain your feature selection or model ensemble in layman’s terms </div></li>\n<li>\n<div>Experience with common data science toolkits, with excellence in the SciPy.org stack (NumPy, SciPy, Matplotlib, Pandas, IPython, etc.) and Scikit-Learn highly desirable </div></li>\n<li>\n<div>Great working knowledge of Python an absolute given </div></li>\n<li>\n<div>May/may not be excited about very deep neural nets but can respect an opposing view too </div></li>\n<li>\n<div>Experience in Gradient Boosting Machines, Bayesian Optimization and Time Series Cross Validation ticks a lot of our boxes</div></li>\n<li>\n<div>Equipped to face the curse of dimensionality</div></li>\n<li>\n<div>Experience with data visualization tools, such as Matplotlib, D3.js, GGplot, etc.</div></li>\n<li>\n<div>Proficiency in using query languages, such as SQL, Spark DataFrame API, etc. </div></li>\n<li>\n<div>Portfolio of interactive notebooks, with experience in single-page web app dev nice-to-have </div></li>\n<li>\n<div>Academically-rigorous, but commercially-minded, and enjoy seeing your work make money for a company that rewards you in return</div></li>\n<li>\n<div>Adaptable, resourceful, well organized team player with a strong work ethic</div></li>\n<li>\n<div>Agree that verbal and written communication skills are vital</div></li>\n<li>\n<div>Eager to grow your skills</div></li>\n<li>\n<div>Educated to degree level or above</div></li></ul>"}