{"job title": "Data Scientist", "company": "Cityblock Health", "city state": "– New York, NY", "rating": "5.0", "job description": "<div><strong>Who we are</strong></div>\n<br>\n<div>Cityblock Health is a new type of healthcare company, operating out of Brooklyn and backed by Alphabet's <em>Sidewalk Labs,</em> along with some of the top healthcare investors in the country.</div>\n<br>\n<div>Our mission is to radically improve the health of urban communities, one block at a time. Importantly, our solutions are designed specifically for Medicaid and lower-income Medicare beneficiaries, and we bring the capability to deliver care in the home and neighborhood with our field-based teams.</div>\n<br>\n<div>In close collaboration with community based organizations and a leading commercial partner, we are reorganizing the health system to focus on what matters to our members. We deliver personalized primary care, behavioral health, and social services through a network of neighborhood hubs with deep community-based partnerships and world-class technology.</div> \n<br>\n<div>We partner with payers and at-risk providers, taking capitated financial risk to care for their most vulnerable, high and rising risk members. Additionally, we invest in strategic partnerships with community-based and social services organizations, in some instances bringing them into the value equation through sub-capitation and performance-based compensation.</div> \n<br>\n<div>Over the next year we'll grow quickly, including entering new markets, each with their own commercial relationships and field-based teams. This role will be a key contributor to the success of our business.</div>\n<br>\n<div>\n<strong>The role</strong></div>\n<br>\n<div>We are seeking an entrepreneurial and hands-on Data Scientist to design and execute solutions for data self-service, historical and real-time business intelligence, and predictive modeling. Most notably, we are seeking someone with years of experience partnering closely with both clinical and business functions, translating company needs into technical solutions and answers, and then building those solutions.</div><br>\n\n<div>Cityblock has built a series of production data feeds servicing our custom made care management application, \"Commons\", as well as some early business intelligence infrastructure and tooling. We consume a variety of clinical and administrative data elements from our internal and external partners, as well as collecting novel structured social health data from Commons.</div><br>\n\n<div>Over the next six months, we need to build best-in-class data products atop these streams, from financial, operations and risk management dashboards, to member identification and stratification tools incorporating predictive modeling techniques.</div><br>\n\n<div>If you like hard problems, have deep experience architecting and working with clinical data, and are an amazing teammate, we want to hear from you!</div><br>\n\n<div><strong>You will:</strong></div>\n<ul>\n<li>Design, execute, and evaluate complex analyses of structured and unstructured data to solve complex business problems using cutting edge statistical techniques</li>\n<li>Adroitly navigate the tradeoffs between speed and feature completion, in order to deliver the right solution in the right time</li>\n<li>Import, clean, and analyze a variety of datasets in order to generate ad-hoc analyses and build long-running data products</li>\n<li>Work with our Associate Chief Health Officer, Chief Product Officer, and Engineering teams daily to provide decision support</li>\n<li>Build production data processes for risk segmentation, member cohorting, and risk assessment</li>\n<li>Document and simplify complex processes and tools</li> \n\n<li>Design reports and dashboards to steer our value-driven business lines, including traditional and non-traditional success metrics Work with our clinical operations team to design robust evaluation models</li>\n<li>Mentor and build a team of both direct reports and cross-functional partners across the organization - encouraging growth in both individual and company-wide data maturity</li>\n<li>Own our vendor relationships with top clinical data providers and analyst groups</li>\n</ul>\n\n<div><strong>You'd be a good fit if:</strong></div>\n<ul>\n<li>You enjoy doing whatever it takes to execute on complex projects</li>\n<li>You have 3+ years of experience in a highly operational data science role</li>\n<li>You are a strong SQL programmer, with experience navigating and cleaning messy data at scale</li>\n<li>You demonstrate expertise across a range of data analysis, data visualization and machine learning toolsets (Python, R, SAS, SPSS, Scala, matplotlib, ggplot Hadoop, Spark)</li>\n<li>You have good applied statistics skills (hypothesis testing, experimental design)</li>\n<li>You have hands-on experience using machine learning techniques to solve real-world problems</li>\n<li>You have deep familiarity with a BI tool like Tableau, Looker, QlikView, Periscope, Mode, etc</li>\n<li>You have experience in a high growth technology company</li>\n<li>You have worked with healthcare data (administrative or clinical)</li>\n</ul>\n\n<div><strong>Nice to have:</strong></div>\n<ul>\n<li>Deep expertise in one or many domains of healthcare data, including claims processing, EHR data, HIE/CCD data, HEDIS measures, Stars, RaF scoring, and risk segmentation</li> \n\n<li>Master's Degree or PhD in Epidemiology, Mathematics, Statistics, Biostatistics/Bioinformatics or a related field</li>\n<li>D3.js, seaborn, bokeh or other advanced data visualization experience</li>\n<li>Experience building data workflows on Google Cloud Platform</li>\n<li>Medical economics, actuarial, or finance/revenue cycle background</li>\n</ul>\n\n<div><strong>You should include these in your application:</strong></div>\n<ul>\n<li>A resume and/or LinkedIn profile</li>\n<li>A short cover letter and link to any public portfolio or previous data analyses and visualization work</li>\n</ul>\n\n<div>Cityblock values diversity as a core tenet of the work we do and populations we serve. We are an equal opportunity employer, indiscriminate of race, religion, ethnicity, national origin, citizenship, gender, gender identity, sexual orientation, age, veteran status, disability, genetic information, or any other protected characteristic.</div>"}