{"job title": "Data Scientist", "company": "City of Seattle", "city state": "– Seattle, WA", "rating": "3.3", "job description": "<div>\nPosition Description<br><br>Seattle City Light, a department of the City of Seattle, is one of the nation's largest municipally owned utilities in terms of the number of customers served. Over the years we have worked very hard to keep Seattle's electricity affordable, reliable, and environmentally sound. Today, City Light is a recognized national leader in energy efficiency and environmental stewardship.\n<br>\n<strong>&nbsp;</strong>\n<br>\nSeattle City Light's Customer Energy Services (CES) Division is looking for a Data Scientist. This position will help leverage analytics to drive the organization's programs in energy efficiency, renewable energy and electric transportation. The role will be responsible for building usable data tools for staff, as well as being the subject matter expert in analyzing and evaluating data sources. The position uses quantitative, data management, and business intelligence techniques to solve analytical business problems, translate data into actionable insights, and communicate finding which help shape the division policies and programs.\n<br>\n<strong>&nbsp;</strong>\n<br>\nThis position will report to the Manager of Strategy, Planning and Analytics.<br><br>Job Responsibilities<br><br>Data modeling and integration\n\n<ul>\n\t<li>Works with staff to identify and strategize unique opportunities to collect and use existing and new data, utilizing both internal and external data systems.\t</li><li>Prepare and integrate internal and external data sets to build out the functionality of data systems and make them accessible and useful for staff.\t</li><li>Works with IT to support data collection, integration and retention requirements.</li>\n</ul>\n\nBusiness process and requirements analysis\n\n<ul>\n\t<li>Works with staff to model and frame meaningful business scenarios which materially impact critical business processes and/or decisions. This includes identifying business requirements in relation to data modeling, dashboard development, and report creation.\t</li><li>Performs analysis to ensure business requirements are clear, complete, free from contradictions, and prioritized correctly, with appropriate solutions then identified and operationalized.\t</li><li>Delivers solutions that take into account systems development, process improvement, organizational change and strategic planning.</li>\n</ul>\n\nData mining / predictive modeling\n\n<ul>\n\t<li>Uses quantitative analysis techniques to collect, analyze and detect patterns, rules, anomalies, clusters or statistically significant relationships in data from various sources, including unstructured data and disparate data sources.\t</li><li>Conducts predictive modeling and experiment design as part of an iterative process to include model testing and validation using experimental design approaches.\t</li><li>Discovers stories told by the data and presents them to internal stakeholders.</li>\n</ul>\n\nProject management\n\n<ul>\n\t<li>Manages and oversees data acquisition, development and management projects.\t</li><li>Works as a part of cross-functional teams as well as assisting in oversight of outside consultants that provide complex data sets, data analysis, and data modeling services.\t</li><li>Provides contract and budget management in support of data programs.</li>\n</ul>\nQualifications<br><br><strong>Education:</strong> Bachelor's Degree in Business, Economics, Mathematics, Statistics, Computer Science, or a related quantitative field.\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>Experience:</strong> Five years of progressively responsible experience related to quantitative, business intelligence and data management skills.&nbsp;\n<br><br>\n<strong>Desired Qualifications:</strong> Graduate Degree in Business, Economics, Mathematics, Statistics, Computer Science, or a related quantitative field.\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>Demonstrated proficiency with:</strong>\n\n<ul>\n\t<li>Common programming languages (such as SQL) used in major relational database management systems (such as Oracle)\t</li><li>Statistical software packages such as R, S-Plus, MATLAB, SAS, STATA, GAUSS, MINITAB, Eviews, or others\t</li><li>Microsoft products, including Access, SQL Server and Excel\t</li><li>Data visualization software such as Tableau</li>\n</ul>\n\n<strong>Demonstrated experience with:</strong>\n\n<ul>\n\t<li>Data analysis techniques, including segmentation analysis, propensity modeling, multivariate analysis, querying and reporting tools, and metrics reporting\t</li><li>Principles and practices of data modeling, including logical and physical data modeling concepts, relational and dimensional data modeling techniques\t</li><li>Utility industry data systems and business processes\t</li><li>Project management techniques and practices\t</li><li>Effectively communicating complex ideas to varied audiences.\t</li><li>Managing shifting priorities and thinking strategically about how data can drive programs and decisions\t</li><li>Working independently and utilizing intellectual curiosity to take appropriate level of initiative</li>\n</ul>\nAdditional Information<br><br>Job offers are contingent on the verification of credentials and other information required by the employment process including the completion of a background check which includes criminal history and driving history review.\n<br><br>\nWant to know more about Seattle City Light? Check out our web page: http://www.seattle.gov/light/.&nbsp;</div>\n\n<br>"}