{"job title": "Data Engineer - Principal (Big Data Architect) with Cloud experience", "company": "Clarity Insights", "city state": "– United States", "rating": "4.1", "job description": "<div>Do you have a passion for data? Clarity Insights is a leading professional services firm focused exclusively on data and analytics. We own our solutions, providing business and technology landscape review, gap analysis, and go-forward strategy for our clients, in addition to implementing the future-state vision.</div><br>\n<div><strong>We are...</strong></div><li>The Industry-recognized data and analytics leaders</li>\n<li>Passionate problem solvers across a broad spectrum of technologies and industries</li>\n<li>Value seekers for measurable business outcomes</li>\n<li>Continuous learners through training and education</li>\n\n<div>Focused on a work-life balance with an unlimited paid time off policy</div><div>Big data architects are challenged with leading the next generation of data solutions for many of the most high-profile and technologically-advanced organizations nationally, targeting a variety of use cases across data engineering, data science, data governance, and visualization.</div>Big data architects deliver value through...\n\n<ul>\n<li>Design of highly-scalable, reliable, and performant pipelines to consume, integrate and analyze large volumes of complex data using a variety of best-in-class proprietary and open-source platforms and tools</li><li>Demonstration of client and solution leadership through strong communication skills to recommend actionable, data-driven insights</li><li>Collaboration with team members, business stakeholders and data SMEs to elicit, translate, and prescribe requirements</li><li>Management of technical, project, and organizational complexity, with a proven ability to simplify tough problems, track many moving parts across functional teams and business domains, and influence strategic direction</li><li>Internal contribution and influence over the growth of their consultancy with direct lines of communication from team member to CEO</li>\n</ul>\n\nA big data architect's skills include but are not limited to...\n\n<ul>\n<li>Bachelors Degree and 6+ years of work experience</li><li>6+ years of professional IT work experience</li><li>3+ years consulting experience</li><li>2 years of professional work experience implementing big data solutions in the cloud (MS Azure preferred)</li><li>SQL, SQL, SQL!</li><li>Programming / Scripting (Python, Java, C/C++, Scala, Bash, Korn Shell)</li><li>Linux / Windows (Command line)</li><li>Big Data (Hadoop, Flume, HBase, Hive, Map-Reduce, Oozie, Sqoop, Spark)</li><li>Cloud Platforms (AWS, Azure, Google Cloud Platform)</li><li>Data Concepts (ETL, near-/real-time streaming, data structures, metadata and workflow management)</li><li>Data Integration Tools (Ab Initio, DataStage, Informatica, SSIS, Talend)</li><li>Databases (DB2, HANA, Netezza, Oracle, Redshift, Teradata, Vertica)</li><li>Markup Languages (JSON, XML, YAML)</li><li>Code Management Tools (Git/GitHub, SVN, TFS)</li><li>DevOps Tools (Chef, Docker, Puppet, Bamboo, Jenkins)</li><li>Testing / Data Quality (TDD, unit, regression, automation)</li><li>Solving complex data and technology problems</li><li>Excellent communication to narrate data driven insights and technical approach</li>\n</ul>\n\n<br>\n<div><strong>If this sounds like you, lets talk!</strong></div><br>\n<div>Candidates must be comfortable with a national travel model to client locations weekly (M-TH is typical).</div><br>\n<div>Clarity Insights is an Equal Employment Opportunity Employer. We believe in treating each employee and applicant for employment fairly and with dignity.</div><br>\n<div>GLDR</div><div>#LI-RC1</div>"}