{"job title": "Senior Scientist", "company": "Clinique", "city state": "– Blaine, Minnesota", "rating": "3.9", "job description": "Senior Scientist\n<br>\nBrand: Aveda\n<br>\nDescription\n<br>\n<strong>Position Summary:</strong>\n<br>\nThis position will be focused on hair color formulation for Aveda. This position is for a skilled individual contributor, reporting to the Director of Hair Color. They will demonstrate collaboration and deliver sustained important contributions for new launches and product improvements. They will independently work projects in a highly collaborative environment. They should be knowledgeable in the hair color category with technical depth and previous experience. This person may supervise a technician or temporaries.\n<br>\n<strong>Key Responsibilities:</strong>\n<br><br>\nDesigns, executes, analyzes &amp; recommends next steps to optimize delivery of project objectives - balancing agility with robustness. Documents, summarizes, reviews and interprets data. Output is timely, robust &amp; reliable so can be used with confidence by the project team. Shares results, recommendations, and next steps with director &amp; understands the impact of their results vs the project objectives.\n<br><br>\nHas hair color category understanding of competition, guest and stylist expectations, products, and packagesdevices. Seeks out cross category learnings. Defines how the technical choices &amp; levers affect the critical desired consumer benefits &amp; experience. Uses their technical knowledge to generate &amp; analyze data.\n<br><br>\nDevelops knowledge &amp; acceptance of company culture, resources, processes, etc. Becomes competent in standard operating procedures &amp; methodologies. Develops an understanding of &amp; able to use available resources needed to get the job done. Integrates into organization &amp; becomes a valuable contributor. Actively seeks out &amp; addresses opportunities to build improve capabilities &amp; systems including safety. Identifies where help is required with system deficiencies.\n<br>\n<strong>Qualifications</strong>\n<br>\n<strong>Qualifications:</strong>\n<br><br>\nEducation: minimum 4 year B.S. degree in chemistry, biochemistry, chemical engineering, biochemical engineering or related field.\n<br><br>\nPrevious personalbeauty care experience required.\n<br><br>\nPrevious hair color experience, preferred.\n<br>\n<strong>Experience:</strong>\n<br><br>\nProficiency with typical office software: Word, Excel, etc.\n<br><br>\nExperience with technical writing in a scientific field.\n<br><br>\nEffective time management skills.\n<br><br>\nLaboratory experience\n<br><br>\n<strong>Others:</strong>\n<br><br>\nAbility to learn operation of scientific instruments and applicable software\n<br><br>\nFollow Good Laboratory Practices and other regulations, where applicable\n<br><br>\nMaintain a clean and organized lab area\n<br><br>\nFollow safe lab practices.\n<br>\n<strong>Potential Companies:</strong>\n<br>\nPersonal Care: Procter &amp; Gamble, Coty, Unilever, Henkel, L'Oreal, Avon, Shiseido, KaoKao Brands, Johnson &amp; Johnson, 3 rd party manufacturers, hair dye supply companies\n<br>\nHair Color: Procter &amp; Gamble, Coty, Henkel, L'Oreal, KaoKao Brands, 3 rd party manufacturers (e.g. Alfaparf), hair dye supply companies\n<br>\nJob: Research &amp; Development\n<br>\nPrimary\n<br>\nLocation: Americas-US-MN-Blaine\n<br>\nJob Type: Standard\n<br>\nSchedule: Full-time\n<br>\nShift: 1st (Day) Shift\n<br>\nTravel: No\n<br>\nWe are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. Job Number: *******"}