{"job title": "Data Platform Engineer, Analytics", "company": "Clover Health", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "<em>Clover is reinventing health insurance by working to keep people healthier.</em>\n<br><br>\nWe value diversity in backgrounds and in experiences. Healthcare is a universal concern, and we need people from all backgrounds and swaths of life to help build the future of healthcare. Clover's engineering team is empathetic, caring, and supportive. We are deliberate and self-reflective about the kind of engineering team and culture that we are building, seeking engineers that are not only strong in their own aptitudes but care deeply about supporting each other's growth.\n<br><br>\nWe are looking for an Analytics Engineer to join our team. In this role, you will be a part of the team that is building out foundational infrastructure to support data-driven analytical decisions and operational processes at Clover. This includes definition and maintenance of our data warehouse core data sets and conventions, as well as developing a robust ecosystem of tools and workflows to support data scientists and operations.\n<br><br>\n<strong>As an Analytics Engineer, you will:</strong>\n\n<ul>\n<li>Be a primary steward and architect of our data warehouse and business intelligence capabilities to support critical operational decisions</li>\n<li>Design and implement robust pipelines in SQL and Python that scale our analytical data sets and workflows</li>\n<li>Design data models collaboratively with data scientists, operations, and other engineering teams that best reflect the given use cases and contexts</li>\n<li>Implement and maintain high level of data quality monitoring in our analytics ecosystem</li>\n<li>Work with data scientists and operations to unblock opportunities and workflows for more data-driven decision-making or relevant self-serve workflows</li>\n</ul>\n<strong>You will love this job if:</strong>\n\n<ul>\n<li>You are excited by big, complicated problems and like to solve them with creative, elegant, and simple solutions. You have a natural <strong>intellectual curiosity</strong> that drives you to find out how things work and if they can work better.</li>\n<li>You care about quality but also have a<strong> pragmatic approach</strong> to software that prioritizes delivering value continuously. You understand there is a time and place for optimizing for shipping throughput vs. optimizing for robustness that survives gnarly edge cases.</li>\n<li>You value <strong>collaboration</strong> and feedback. You can communicate the technical vision in clear terms to your peers as well as outside of the engineering team. You are willing and able to help your teammates grow by demonstrating best practices, providing (and receiving) respectful and constructive feedback, and sharing your unique insights with everyone.</li>\n<li>You enjoy working in a <strong>fluid environment</strong>, defining and owning priorities that adapt to our larger goals. You can bring clarity to ambiguity while remaining open-minded to new information that might change your mind.</li>\n<li>You are not hesitant to jump in to help fix things that are broken and you feel a great responsibility to make <strong>sustainable systems</strong>. You are happy to fill in the gaps to reach a goal where necessary, even if it does not always fit your job description.</li>\n<li>You have a genuine interest in what good technology can do to help people and have a <strong>positive attitude</strong> about tackling hard problems in an important industry.</li>\n</ul>\n<strong>You should get in touch if:</strong>\n\n<ul>\n<li>You have strong experience designing and maintaining data warehouse schemas, as well as data modeling for different usage contexts</li>\n<li>You have strong SQL skills and knowledge of databases, and can work your way around in Python or similar general programming language</li>\n<li>You love data as a product and enjoy working with different stakeholders to build data workflow and data sets that truly draw out the value of data for decision making and creating business leverage</li>\n</ul>\n<em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. We are an E-Verify company.</em>\n<br><br>\n<strong>About Clover:</strong> We are reinventing health insurance by combining the power of data with human empathy to keep our members healthier. We believe the healthcare system is broken, so we've created custom software and analytics to empower our clinical staff to intervene and provide personalized care to the people who need it most.\n<br><br>\nWe always put our members first, and our success as a team is measured by the quality of life of the people we serve. Those who work at Clover are passionate and mission-driven individuals with diverse areas of expertise, working together to solve the most complicated problem in the world: healthcare."}