{"job title": "Data Scientist", "company": "Clover Health", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "<em>Clover is reinventing health insurance by working to keep people healthier.</em>\n<br><br>\nClover's Data Science team is charged with leveraging our dataour most important assetto generate value for our members. From understanding how the member experience impacts clinical outcomes to making our home visits more efficient and effective, our team pushes out insights central to executing on our core mission. And our impact is tremendous: you'll be able to point to one of our members and say, \"I helped make that person's life better.\"\n<br><br>\nWe're looking for a Data Scientist to help us build a revolutionary new health care company.\n<br><br>\n<strong>As a Data Scientist, you will:</strong>\n\n<ul>\n<li>Partner with Product and Clinical teams to define criteria and measure success of new initiatives.</li>\n<li>Empower our operations staff to understand relevant data, and how it should impact their decisions.</li>\n<li>Build models, tools and validation processes that help Clover translate insights into action at scale.</li>\n<li>Determine priorities by estimating the potential impact of projects.</li>\n<li>Acquire and bring structure to data so that it can be used in our reports and data apps.</li>\n</ul>\n<strong>You will love this job if:</strong>\n\n<ul>\n<li>You want to create <strong>impact</strong> with your work by finding insights in the data that unlock value and improve outcomes.</li>\n<li>You have a <strong>strong understanding</strong> of how to structure analyses and experiments to yield interpretable, actionable <strong>results</strong>.</li>\n<li>You reason <strong>holistically</strong>. From project scope to priority to implementation, you'll have an impact on how decisions get made.</li>\n<li>You are comfortable acting <strong>autonomously</strong> in ambiguous and dynamic environments.</li>\n<li>You are fearless in the face of <strong>messy data</strong>, and adept at programmatically structuring and cleaning records collected from the real world.</li>\n<li>You strive to <strong>automate</strong> as much as possible, yet understand the value of explicitly incorporating <strong>human decisions</strong> into the systems you build.</li>\n<li>You have just as much interest in <strong>helping</strong> other people move faster as you do building your own analyses.</li>\n</ul>\n<strong>You should get in touch if:</strong>\n\n<ul>\n<li>You have a strong foundation in probability, statistics and statistical modeling or machine learning.</li>\n<li>You have a solid track record working cross-functionally.</li>\n<li>You have developed a technical skillset which allows you to work efficiently and leverage relevant data science software tools.</li>\n</ul>\n<em>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. We are an E-Verify company.</em>\n<br><br>\n<strong>About Clover:</strong> We are reinventing health insurance by combining the power of data with human empathy to keep our members healthier. We believe the healthcare system is broken, so we've created custom software and analytics to empower our clinical staff to intervene and provide personalized care to the people who need it most.\n<br><br>\nWe always put our members first, and our success as a team is measured by the quality of life of the people we serve. Those who work at Clover are passionate and mission-driven individuals with diverse areas of expertise, working together to solve the most complicated problem in the world: healthcare."}