{"job title": "Principal Research Scientist", "company": "CNA Corporation", "city state": "– Corporate Arlington, VA, US 22201", "rating": "3.9", "job description": "<div>\n<div>\nJob Title</div><br>\n\n<div>\nPrincipal Research Scientist</div>\n </div><br>\n\n <div>\n<div>\nOrganizational Unit</div><br>\n\n<div>\nCNA Corporation -&gt; The Center -&gt; Operational Warfighting Division</div>\n </div><br>\n\n <div>\n<div>\nLocation</div><br>\n\n<div>\nCorporate - Arlington, VA 22201 US (Primary)</div>\n</div><br>\n\n <div>\n<div>\nDivision Summary</div><br>\n\n<div>\nOPS-The Operational Warfighting division conducts field-based research and manages the Field Program. We work on projects that help the Department of the Navy and other government agencies improve operational effectiveness through analysis of training methods, organizational alignment, policy, system performance, test &amp; evaluation, interoperability, training, operational concepts, experimentation, and tactics development.</div>\n </div><br>\n\n <div>\n<div>\nJob Description</div><br>\n\n<div>Is a recognized expert in specific fields/research areas and has demonstrated leadership skills. Typically lead projects addressing complex issues that may be large in size, and will have clear accountabilities for business development and for managing, growing, and enhancing client/sponsor relationships. Operate as a senior researcher at CNA HQ or in the field.\n<br><br>\n1 Work independently and effectively on a wide range of non-traditional analytic problems that are of increasing complexity, and increasing visibility &amp; significance to our sponsors/clients. Routinely take the lead in supporting the work and development of other staff either individually or as a member of a project team. Consistently produce the highest quality analysis.\n<br><br>\n2 Operate as a recognized expert in a specific field/research area within CNA; leverage that expertise to enhance CNA's reputation with existing clients/sponsors. Develop and maintain deep, specific institutional knowledge and expertise of new and existing clients/sponsors; their culture, organization, and issues. Apply that knowledge and expertise to lead development and shaping of new work for both existing &amp; new sets of clients/sponsors.\n<br><br>\n3 Independently pursue business development opportunities and develop new clients/sponsors. Use network of clients/contacts to develop and sustain sponsor base, and develop new networks of clients/sponsors. Write competitive proposals and provide major support in marketing one or more areas.\n<br><br>\n4 Participate in frequent and independent interaction &amp; engagement with clients/ sponsors and related parties at all levels. Effectively represent CNA as an organization at the most senior levels of client organizations.\n<br><br>\n5 Shape/influence how our sponsors/clients think about issues. Deliver fundamental change. Play a lead role in enhancing CNA's reputation as an organization. Play a lead role in efforts to enhance CNA's reputation via publishing and outreach activities.\n<br><br>\n6 Communicate complex analytic results in a clear and concise fashion to sponsors/clients at all levels, and to audiences of all sizes. Summarize and synthesize large bodies of work down to the essential elements and convey those results effectively and efficiently, in both written and oral form, to the most senior leaders in client organizations. Effectively communicate with &amp; engage colleagues at all levels of the organization.\n<br><br>\n7 Work independently under limited supervision from division management. Lead our largest and/or most complex and significant projects or multiple projects simultaneously. Take responsibility for making connections and integrating work across teams and divisions.\n<br><br>\n8 Effectively distribute responsibilities to the appropriate people and levels. Serve as a role model/mentor for other staff regularly in the home division and occasionally in other divisions. Develop internal and external networks of contacts and have a positive influence on those networks. Play an active role in supporting corporate initiatives, and support senior leadership initiatives to realize CNA's goals and vision.\n<br><br>\n9 Perform other duties as assigned.</div>\n </div><br>\n\n <div>\n<div>\nJob Requirements</div><br>\n\n<div>1 Education: Minimum Master’s degree in a relevant field or equivalent experience, PhD preferred.\n<br><br>\n2 Experience: Typical minimum requirements 15+ years of experience in research and analysis.\n<br><br>\n3 Skills: Demonstrated ability to apply leading-edge principles, theories, and concepts to solve the most complex problems of critical importance to clients; Demonstrated ability to conceptualize and develop solutions, to formulate problem statements conducive to application of analytical methods, and to develop analysis methods and approaches; Ability to work in an unstructured environment; Demonstrated ability to identify, evaluate, and propose original and practicable methods of resolving complex problems; Demonstrated ability to supervise program and project operations by developing procedures, planning and directing all aspects of the effort, and monitoring and reporting progress; Demonstrated ability in managing projects, contracts, funds, and resources; ability to conceptualize, develop, and manage execution of a portfolio of projects in support of multiple client organizations; Demonstrated ability to interact, communicate, and advise at senior levels in government and the parent corporation; Widely considered expert in a broad scope of applications and uses of analytic methods; Excellent communications skills, both oral and written; experience in packaging analytic results in report format as well as in development and presentation of oral briefings.\n<br><br>\n4 Other: Ability to obtain and maintain an Active Secret Security Clearance.\n</div>\n </div><br>\n\n <div>\n<div>\nJob Family</div><br>\n\n<div>\nResearch</div>\n </div><br>\n\n <div>\n<div>\nRequisition #</div><br>\n\n<div>\nCER0448.18</div>\n </div><br>\n\n <div>\n<div>\nCNA is committed to providing equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, religion, color, sex (including pregnancy, gender identity, and sexual orientation), parental status, national origin, age, disability, family medical history or genetic information, political affiliation, military service, or other non-merit based factors. In addition to federal legal requirements, CNA complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. These protections extend to all terms and conditions of employment, including recruiting and hiring practices, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training and career development programs. For more information about EEO protections, please view the EEO is the Law poster.</div>\n </div><br>\n\n <div>\n<div>\nTo be considered for hire, all individuals applying for positions with CNA are subject to a background investigation. For positions requiring access to classified information, U.S. citizenship is required. Individuals will also be subject to an additional government background investigation, and continued employment eligibility is contingent upon the ability to obtain and maintain an active security clearance.</div>\n </div>\n<br>"}