{"job title": "Sr Research Scientist (Test and Evaluation)", "company": "CNA Corporation", "city state": "– Corporate Arlington, VA, US 22201", "rating": "3.9", "job description": "<div>\n<div>\nJob Title</div><br>\n\n<div>\nSr Research Scientist (Test and Evaluation)</div>\n </div><br>\n\n <div>\n<div>\nOrganizational Unit</div><br>\n\n<div>\nCNA Corporation -&gt; The Center -&gt; Operational Warfighting Division</div>\n </div><br>\n\n <div>\n<div>\nLocation</div><br>\n\n<div>\nCorporate - Arlington, VA 22201 US (Primary)</div>\n</div><br>\n\n <div>\n<div>\nDivision Summary</div><br>\n\n<div>\nOPS-The Operational Warfighting division conducts field-based research and manages the Field Program. We work on projects that help the Department of the Navy and other government agencies improve operational effectiveness through analysis of training methods, organizational alignment, policy, system performance, test &amp; evaluation, interoperability, training, operational concepts, experimentation, and tactics development.</div>\n </div><br>\n\n <div>\n<div>\nJob Description</div><br>\n\n<div>Has considerable relevant experience in experimentation or test and evaluation design and/or statistical analysis of results. Can operate independently. Typically lead projects of moderate size and/or complexity or small teams, will be increasingly involved in business development efforts, and taking greater responsibility for managing client/sponsor relations. Operate as a more experienced researcher at CNA HQ and in the field. Would support test and evaluation of new systems and platforms with test design and rigorous statistical analysis of results.\n<br><br>\n1 Independently develop and apply creative and innovative analytic solutions to complex problems. Begin to play a lead role in the mentoring and training of new staff individually or as a member of a project team.\n<br><br>\n2 Apply established credentials as an expert in a specific field/research area. Apply deep, specific institutional knowledge &amp; expertise of primary clients/sponsors to lead training &amp; mentoring of new staff, to support on-going work, and to lead development and shaping of work for multiple existing clients/sponsors. Develop expanding knowledge of other clients/sponsors.\n<br><br>\n3 Identify above core, above ceiling, and other opportunities and assist in developing new business with existing clients/sponsors. Assume responsibility for managing relationships with existing clients/sponsors and develop relationships with potential clients/sponsors to help develop future business. Occasionally take the lead on developing competitive proposal ideas and managing proposal development.\n<br><br>\n4 Take the lead in engaging with clients/sponsors and related parties. Engage in some independent interaction at the more senior levels of client organizations. Effectively represent CNA as an organization.\n<br><br>\n5 Shape/influence how our sponsors/clients think about issues. Play a supporting role in enhancing CNA's reputation as an organization. Periodically deliver change. Play a key and active role in supporting efforts to enhance CNA's reputation via publishing and outreach activities.\n<br><br>\n6 Communicate complex, technical analytic results in a clear and concise fashion to sponsors/clients. Tailor analytic products, both briefings and reports, to suit particular audiences, and effectively adapt to unexpected situations when communicating results of analysis. Effectively communicate with &amp; engage colleagues at all levels of the organization.\n<br><br>\n7 Work independently under general supervision from division management. Lead and manage multiple projects of low to medium size and/or complexity simultaneously or larger, more complex projects. Responsible for follow-through with sponsors and synthesizing results of projects in a broader context.\n<br><br>\n8 Manage the needs of projects and project staff. Exercise leadership in decision-making in the areas of budget planning and tracking, staffing, and delegating effectively. Serve as a role model/mentor for less experienced staff, particularly in helping them develop their own leadership skills. Proactively seek out opportunities to support corporate initiatives and to make CNA a better place to work.\n<br><br>\n9 Perform other duties as assigned.</div>\n</div><br>\n\n <div>\n<div>\nJob Requirements</div><br>\n\n<div>1 Education: Minimum Master’s degree in a relevant field or equivalent experience, PhD preferred.\n<br><br>\n2 Experience: Expert in Operational Test and Evaluation. Experience with Design of Experiment preferred. Typical minimum requirements 10+ years of experience in research and analysis. Will consider fewer years of experience based on educational background and experience.\n<br><br>\n4 General skills: Demonstrated ability to apply advanced principles, theories, and concepts to solve uniquely complex problems; Demonstrated ability to conceptualize and develop solutions, to formulate problem statements conducive to application of analytical methods, and to develop analysis methods and approaches; Ability to work in an structured environment; Demonstrated innovative and analytical thinking; Ability to use thoughtful attention to manage projects, project staff, contracts, funds, and resources; ability to manage execution of a portfolio of projects in support of multiple clients; Demonstrated ability to supervise program and project operations by developing procedures, planning and directing all aspects of the effort, and monitoring and reporting progress; Demonstrated ability to interact, communicate, and advise at senior levels in both client organizations and the parent corporation; Excellent communications skills, both oral and written; experience in packaging analytic results in report format as well as in development and presentation of oral briefings.\n<br><br>\n4 Other: Ability to obtain and maintain an Active Secret Security Clearance.\n<br><br>\n5 Relocation: Willingness to relocate to Edwards, or China Lake California; Patuxent River, Maryland; or Norfolk, Virginia. Relocation expenses are covered.\n<br><br>\n6. <strong>Required Documents:</strong> Use the “Resume Attachments” section to upload:1) Copies of transcripts from all schools attended (unofficial copies are sufficient); 2) Any writing sample(s) that best exemplifies your written work (i.e. post-conference writings, publications, etc...).</div>\n </div><br>\n\n <div>\n<div>\nJob Family</div><br>\n\n<div>\nResearch</div>\n </div><br>\n\n <div>\n<div>\nRequisition #</div><br>\n\n<div>\nCER0447.51</div>\n </div><br>\n\n <div>\n<div>\nCNA is committed to providing equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, religion, color, sex (including pregnancy, gender identity, and sexual orientation), parental status, national origin, age, disability, family medical history or genetic information, political affiliation, military service, or other non-merit based factors. In addition to federal legal requirements, CNA complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. These protections extend to all terms and conditions of employment, including recruiting and hiring practices, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training and career development programs. For more information about EEO protections, please view the EEO is the Law poster.</div>\n </div><br>\n\n <div>\n<div>\nTo be considered for hire, all individuals applying for positions with CNA are subject to a background investigation. For positions requiring access to classified information, U.S. citizenship is required. Individuals will also be subject to an additional government background investigation, and continued employment eligibility is contingent upon the ability to obtain and maintain an active security clearance.</div>\n </div>\n<br>"}