{"job title": "Data Scientist", "company": "Cobalt Robotics", "city state": "– San Mateo, CA", "rating": "NA", "job description": "<div>Cobalt builds autonomous security robots that keep buildings safe by combining the reliability of machines and the friendly face of human-in-the-loop Robot Specialists. Security costs US companies over $200B / year, and is a very difficult task for humans to perform because of long monotonous hours.</div> <br>\n<div>We have robots deployed to customers nationally and are an incredibly fast moving team - we went from nothing to shipping our first robots in 12 months! We are now 25 people working from San Mateo, and just raised our Series A from Sequoia and Founders Fund! We're looking for folks who are scrappy, collaborative, excited, and eager to share their knowledge and expertise with the rest of our team.</div><br>\n<div>Our robots generate a mountain of data each day, containing valuable insights on robot performance, understanding of the environment around the robot, and possible security anomalies. We are seeking a data scientist to help our robots and Specialists make the most of this data!</div>Responsibilities\n\n<ul>\n<li>Uncover patterns in the world around the robot - when we detect a person in a certain time / place, can we guess who they are from past records?</li><li>Use machine learning models and custom solutions to detect people, motion, and other security anomalies</li><li>Use images and 3D sensors to help the robot see more obstacles and stay safe</li><li>Collaborate with other engineers to productize and deploy these algorithms onto our robots and cloud infrastructure</li>\n</ul>\n\n<strong>Requirements</strong>\n\n<ul>\n<li>1+ years of industry experience working on machine learning or data science</li><li>Experience with Python</li><li>Experience with Numpy or SciKit Learn</li><li>Knowledge of statistical machine learning and CNNs</li><li>BA/BS in CS, Statistics, or a related field</li>\n</ul>\n\nBonus Points\n\n<ul>\n<li>Experience with person or object detection using neural networks</li><li>Experience with 3D data, i.e. LIDAR, laser scanners, or depth cameras</li><li>Experience with high performance Python or C++</li><li>Experience with robotics</li><li>Have worked in a startup environment</li>\n</ul>\n\n<div>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div>"}