{"job title": "Data Scientist", "company": "Coca-Cola Company", "city state": "– Atlanta, GA", "rating": "3.6", "job description": "<b>Job ID: </b>41318<br><br>Position Overview:<p></p>The Data Scientist will perform activities to support technical data and information analysis and reporting across key technical governance applications and platforms, collaborate with key business stakeholders to optimize and streamline reporting and metrics, and implement solutions to create better business value. This position will work under the guidance and direction of the Analytics and Insights Director, and will actively collaborate with extended team members from Data Intelligence team.<p></p><p><b>Function Specific Activities:</b></p><p>The Data Scientist will perform activities to support technical data and information analysis and reporting across key technical governance applications and platforms, collaborate with key business stakeholders to optimize and streamline reporting and metrics, and implement solutions to create better business value. This position will work under the guidance and direction of the Analytics and Insights Director, and will actively collaborate with extended team members from Data Intelligence team.</p><p></p><p>Function Related Activities/Key Responsibilities</p><ul><li>Work on the process of translating technical objectives into defined problems that can be solved by applying data science</li><li>Help to design algorithms to address current technical problems</li><li>Work closely with data analysts in the team to apply advanced analytics, modelling and simulation to replicate and anticipate issues.</li><li>Uncover new technical problems that need to be solved and support better decision</li><li>Communicate data analysis and insights using rich visualization tools (Tableau/MicroStrategy) and leverage data to present compelling cases to optimize solutions</li><li>Perform exploratory data analysis, generate and test working hypothesis, and uncover important trends and relationships</li><li>Provide expertise on mathematical concepts and inspire adoption of advanced analytics</li></ul><p>Education Requirements: <br>Master's Degree in applied statistics, applied math, or related quantitative discipline</p><p>Related Work Experience: <br>0-2 years of relevant experience</p><ul><li>Experience with relational databases, information and insights</li><li>Experience with modelling software, data mining techniques and methodologies</li><li>Experience with visualization software (Tableau, MicroStrategy)</li><li>Experience leveraging cloud platforms and developing in SQL</li><li>Superior critical thinking, analytical and problem-solving skills.</li><li>Passionate, creative and forward thinking individual</li></ul><p>Leadership Behaviors: </p><ul><li>Drive Innovation: Generate new or unique solutions and embrace new ideas that help sustain our business (encompassing everything from continuous improvement to new product and package innovation)</li><li>Collaborate with System and Stakeholders: Develop and leverage relationships with stakeholders to appropriately stretch and impact the System (Company and Bottler)</li><li>Act Like an Owner: Deliver results, creating value for our brands, our System, our customers and key stakeholders</li><li>Inspire Others: Inspire people to deliver our mission and 2020 Vision, demonstrate passion for the business and give people a reason to believe anything is possible</li><li>Develop Self and Others: Develop self and support others' development to achieve full potential</li></ul><p>Growth Behaviors:</p><ul><li>Growth Mindset: Demonstrates Curiosity. Welcomes failure as a learning opportunity.</li><li>Smart Risk: Makes bold decisions/recommendations</li><li>Externally Focused: Understands the upstream and downstream implications of his/her work. Tracks and shares external trends, best practices, or ideas.</li><li>Performance Driven &amp; Accountable: Has high performance standards. Outperforms her/his peers.</li><li>Fast/Agile: Removes barriers to move faster. Experiments and adapts. Thrives under pressure and fast pace.</li><li>Empowered: Brings solutions instead of problems. Challenges the status quo. Has the courage to take an unpopular stance.</li></ul><p>Functional Skills: </p><ul><li>Capture Info/Assess/Make Recommendation. Capture information, assess it and make recommendations to Company management (e.g., senior technical management) or give the KO system information about emerging business opportunities, technology capabilities or scientific breakthroughs to offer solutions to technical problems and/or affect the Company's strategic direction.</li><li>Gather/Org Info to Support Senior Mgmt. Decision. Gather and organize information to support senior management's decision-making during a crisis situation.</li><li>Performance Data Audit to Ensure Accuracy. Perform data audit in order to ensure accuracy of data and analytical processes. This may include database queries, statistical process control or correlation study.</li><li>Query Technical Governance Systems/Compile Reports. Query Technical Governance Systems and compile reports in response to ad hoc management requests or arrange for Global IT to run more complex queries.</li><li>Review Data for Completeness/Consistency. Review data for completeness and consistency in formula and/or regulatory databases, tracking systems, supplier documentation, etc.</li><li>Report/Analyze/Interpret Data. Report, analyze or interpret technical governance data in order to communicate information on the quality of products and packages in manufacturing or the marketplace.</li><li>Search External Databases. Search external and/or internal computerized databases in response to inquiries from scientists or to provide information to management or the field.</li><li>Apply Basic Statistical Tests/Methods. Apply basic statistical tests and methods to data in order to support Company decision-making by ensuring validity and statistical relevance.</li><li>Work on the process of translating technical objectives into defined problems can be solved by applying data science</li><li>Help to design algorithms to address current technical problems</li><li>Work closely with data analytics in the team to apply advanced analytics, modelling and simulation to replicate and anticipate issues</li></ul><p></p><p><b>Job Requirements:</b></p><p></p><p><b>Years of Experience:</b></p><p></p><p></p><p><b>Leadership Behaviors:</b></p><p></p><ul><li>DRIVE INNOVATION: Generate new or unique solutions and embrace new ideas that help sustain our business(encompassing everything from continuous improvement to new product and package innovation). </li></ul><ul><li>COLLABORATE WITH SYSTEM, CUSTOMERS, AND OTHER STAKEHOLDERS: Develop and leverage relationships with stakeholders to approximately stretch and impact the System (Company and Bottler).</li></ul><ul><li>ACT LIKE AN OWNER: Deliver results, creating value for our Brands, our System, our customers, and key stakeholders. </li></ul><ul><li>INSPIRE OTHERS: Inspire people to deliver our mission and 2020 Vision, demonstrate passion for the business and give people a reason to believe anything is possible. </li></ul><ul><li>DEVELOP SELF AND OTHERS: Develop self and support others' development to achieve full potential. </li></ul><p></p><p><b>Growth Behaviors:</b></p><ul><li>GROWTH MINDSET: Demonstrates curiosity. Welcomes failure as a learning opportunity.</li><li>SMART RISK: Makes bold decisions/recommendations.</li><li>EXTERNALLY FOCUSED: Understands the upstream and downstream implications of his/her work. Tracks and shares external trends, best practices or ideas.</li><li>PERFORMANCE DRIVEN AND ACCOUNTABLE: Has high performance standards. Outperforms her/his peers.</li><li>FAST/AGILE: Removes barriers to move faster. Experiments and adapts. Thrives under pressure and fast pace.</li><li>EMPOWERED: Brings solutions instead of problems. Challenges the status quo. Has the courage to take an unpopular stance.</li></ul><p></p>We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or local protected class."}