{"job title": "Data Scientist", "company": "Code Pilot", "city state": "– Austin, TX", "rating": "NA", "job description": "<div>\nWho we are:</div>\n<br>We are Code Pilot, a data science company with the mission to change the hiring process. An engineer should be judged on their talent which is why we created Code Pilot portfolio. An intelligent platform where you showcase, validate, and share your skills with hiring managers in real-time. There is no need for a resume, cover letter, phone screen, or technical interview when you build a Code Pilot portfolio. <em>Let your code do the talking</em>.<br><br>We are looking for:<br><br>A new data science team member to support the development of a platform for one of our hiring partners.<br><br>Responsibilities include:\n\n\n<ul>\n<li>Design and implement data analysis, data mining, research, analysis, modeling strategies and best practices</li>\n<li>Use analytical expertise to spot key business insights, trends, and opportunities in our vast database</li>\n<li>Help interpret and communicate your findings in a way that is easily understood by those less familiar with data</li>\n<li>Collaborate with a dynamic Product and Development team in delivering data products and insights to clients</li>\n<li>Establish and maintain relationships with distributed cross-functional teams to leverage domain and industry expertise</li>\n<li>Identify missing and inaccurate data in our platforms; seek out supplements and replacements to improve our data sets to the greatest extent possible</li>\n<li>Advise teams and clients as a subject matter expert in data science</li>\n</ul>\n\n<strong>Requirements:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Bachelor's degree in a quantitative field such as Statistics, Computer Science, Economics, or Mathematics; or equivalent work experience</li>\n<li>Relevant, successful professional industry experience</li>\n<li>Proficiency with database and analysis tools like R, SQL, Python, and others</li>\n<li>Expertise in statistical modeling, data collection, aggregation, analysis, machine learning, and productization</li>\n<li>Self-driven passion for finding and collaboratively solving problems</li>\n<li>Strong understanding of the benefits and flaws in the application of various methods</li>\n<li>Build your portfolio today: https://mycodepilot.com/candidates</li>\n</ul>"}