{"job title": "Machine Learning Engineer", "company": "Coffee Meets Bagel", "city state": "– San Francisco, CA (US)", "rating": "4.9", "job description": "<div></div><div><div><div><strong>Coffee Meets Bagel</strong> Coffee Meets Bagel’s vision is to inspire singles to share and connect authentically. Each day, our app generates millions of qualitative and quantitative data points that can be used to help us understand people's behaviors - their struggles and their delights. We need your help to mine and interpret this information from our customers and turn them into actionable changes that can further our vision of helping singles form meaningful connections with other amazing singles!</div><br>\n<div>The Coffee Meets Bagel Data team is seeking an experienced engineer to help us scale our matching algorithm, which helps millions of users connect and fall in love!</div><div>The ideal candidate will have experience building high throughput data pipelines at large scale, as well as experience working with data scientists to deploy machine learning models in production systems. We are seeking an individual that can help architect and own significant parts of our infrastructure.</div><div>The Data team at CMB owns the matching algorithm, which is responsible for generating recommended matches for users and creating a meaningful user experience via authentic connections. As a member of this team, you will be critical to the growth of our business as we continue to operate at large scale and innovate on new matching algorithms.</div></div><div><div>Responsibilities:\n\n<ul>\n\n\n<ul>\n<li>Scale our matching algorithm by building new, high throughput data pipelines</li><li>Work with data scientists to build and deploy machine learning models</li><li>Help us automate our model deployment process to facilitate fast, seamless experimentation</li><li>Help us rearchitect and consolidate our feature engineering layer</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Qualifications:\n\n<ul>\n\n\n<ul>\n<li>3+ years of industry experience implementing data pipelines and / or machine learning models at large scale</li><li>3+ years experience with Python or some other object oriented language</li><li>Experience with distributed computing systems (e.g. Spark)</li><li>Basic working knowledge of machine learning algorithms and experience using one or more ML libraries such as TensorFlow, Spark MLlib, Scikit-learn</li><li>Experience working with both SQL and NoSQL databases and caching technologies like Redis</li><li>Excellent technical communication skills, the ability to elaborate complex technical concepts and collaborate effectively with fellow engineers and data scientists</li><li>A dedication to quality control practices like automated testing, code review, manual QA, and operational monitoring</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Nice to Have:\n\n<ul>\n\n\n<ul>\n<li>BS, Masters or PhD in Computer Science or equivalent</li><li>Experience with Scala or Go</li><li>Experience with Postgres, Cassandra, Redis, or ElasticSearch</li><li>Experience with AWS (EC2, S3, SQS, Kinesis, ElasticCache, Redshift)</li><li>Experience with recommendation systems</li><li>Knowledge of A/B testing methodology and experience administering experiments</li></ul>\n</ul>\n\n</div>\n</div></div></div></div>"}