{"job title": "Research Scientist (Surfactants)", "company": "Colgate-Palmolive", "city state": "– Piscataway, NJ", "rating": "3.8", "job description": "Colgate-Palmolive is a leading global consumer products company, tightly focused on Oral Care, Personal Care, Home Care and Pet Nutrition. Colgate sells its products in over 200 countries and territories around the world under such internationally recognized brand names as Colgate, Palmolive, Speed Stick, Lady Speed Stick, Softsoap, Irish Spring, Protex, Sorriso, Kolynos, elmex, Tom’s of Maine, Sanex, Ajax, Axion, Fabuloso, Soupline and Suavitel, as well as Hill’s Science Diet, Hill’s Prescription Diet and Hill’s Ideal Balance.\n<br><br>\nFor more information about Colgate’s global business, visit the Company’s web site at http://www.colgatepalmolive.com. To learn more about Colgate Bright Smiles, Bright Futures® oral health education program, please visit http://www.colgatebsbf.com. To learn more about Hill's and the Hill’s Food, Shelter &amp; Love program please visit hillspet.com. To learn more about Tom’s of Maine please visit http://www.tomsofmaine.com.\n<br><br>\nLocation: Piscataway, New Jersey, United States\n<br>\nNo Relocation Assistance Offered\n<br>\n#&nbsp;70851\n<br><br>\n&nbsp;\n<br><br>\nColgate-Palmolive&nbsp;invites applications to a postdoctoral research Scientist position&nbsp;located in Piscataway, NJ. <strong>This is a two (2) year fixed term of at-will employment.</strong>\n<br><br>\n&nbsp;\n<br><br>\n<strong>The key responsibilities of this position are as follows:</strong>\n<br><br>\n&nbsp;\n<ul>\n<li>Design and execute experiments to investigate micro-emulsion phase behavior in complex surfactant systems, build fundamental understanding, guide product development and advance project objectives</li><li>Develop rapid and predictive methods for the stability and performance test of fragrance and active ingredients in consumer products using modern surfactant and colloid fundamentals</li><li>Interpret and communicate complex experimental and theoretical results to both technical and non-technical business partners effectively</li><li>Deploy tools and characterization techniques to study and predict ingredient interactions in Colgate’s next generation products, and work closely with other early research and product development teams to gain insights on predicting product stability and performance.</li><li>Present technical findings to the internal Research &amp; Development community and management teams, to present in external conferences, and to document findings in internal technical reports and/or external publications.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Required Qualifications:</strong>\n<br><br>\n&nbsp;\n<ul>\n<li>Fresh PhDs in surfactants, colloid, or petroleum engineering related interdisciplinary fields</li><li>Knowledge of surfactants, colloids, micro-emulsion, coacervation, and dispersion systems as well as ingredient interactions in such complex systems</li><li>Deep fundamental understanding and extensive hands-on experience on tensiometry, dynamic light scattering, electron microscopy, rheology, UV-Vis spectroscopy, and separation techniques such as Gas Chromatography / High Performance Liquid Chromatography (GC/HPLC)</li><li>Ability to think independently, and work effectively in a dynamic and cross functional working environment. Have experience in joint projects with industry partners.</li><li>Excellent oral and written communication skills. Be able to communicate complex technical results effectively to technical and non-technical personnel in oral presentations and writing documentations.</li><li>Strong record of peer-reviewed publications.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\n&nbsp;\n<ul>\n<li>Preferably have experience and knowledge on using surfactant chemistry in consumer products and oil field applications such as Enhanced Oil Recovery (EOR) and/or subsurface treatment.</li>\n</ul>\n&nbsp;\n<br><br>\nAre you interested in working for Colgate-Palmolive? You can apply to work with us using this online application. Attach all relevant documents such as a cover letter and resume or CV. Applications received by e-mail are not considered in the selection process.\n<br><br>\nBecome part of our team. We look forward to your application.\n<br><br>\nEqual Opportunity Employer\n<br>\nColgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, ethnicity, age, disability, veteran status, marital status, or any other characteristic protected by law."}