{"job title": "Sr Scientist, Research- Nutrition", "company": "Colgate-Palmolive", "city state": "– Topeka, KS", "rating": "3.8", "job description": "Work that matters, fueled by passion for pets! At Hill’s we have a purpose. Every day around the world, we transform the lives of millions of pet families through pioneering innovation, amazing nutrition, and the best and brightest people. Founded more than 75 years ago with an unwavering commitment to pet nutrition, Hills' mission is to help enrich and lengthen the special relationships between people and their pets.\n<br><br>\nHILL'S® Prescription Diet® therapeutic pet foods, HILL'S® Science Diet® and HILL'S® Ideal Balance™ wellness pet foods are sold worldwide. Hill’s is a division of Colgate-Palmolive, a leading global consumer products company, tightly focused on Oral Care, Personal Care, Home Care and Pet Nutrition, with sales of products in more than 200 countries. To learn more about Hill's and Colgate, please visit http://www.hillspet.com and http://www.colgatepalmolive.com, or find us on LinkedIn, Facebook, Twitter and YouTube.\n<br><br>\nLocation: Topeka, Kansas, United States\n<br>\nRelocation Assistance Offered Within Country\n<br>\n#&nbsp;67241\n<br><br>\n<strong>Position Purpose:</strong>\n<br><br>\n&nbsp;\n<br><br>\nSenior Scientist in Research as part of the Nutrition Innovation team will be responsible for the development of short and long-term strategies to deliver new technologies, new products, and product improvements, or product claims that provide a competitive advantage to Hill’s Pet Nutrition, Inc.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Let's talk about Responsibilities:</strong>\n<br><br>\n&nbsp;\n<ul>\n<li>Identify, evaluate and champion new, patentable and innovative technologies that can be used in development of new and improved products for pets</li><li>Partner with manager/director to develop and refine research strategy to establish clear deliverables for identification and evaluation of new technologies. Ensure strategy delivers a pipeline of technology options for short term and long term commercialization.</li><li>Provide expertise integrating basic scientific data (e.g. biochemical, genomic, metabolomic data) with clinical outcomes. Integrate consumer and veterinary insights into the research program strategy.</li><li>Maintain familiarity with the latest developments in appropriate areas of genomics and genetics so that new products and product improvements reflect the true “state of the art.”</li><li>Design, analyze summarize and write final reports of data from internal and outside research studies and make presentations to management and cross-functional Hill’s groups especially Product Development, Clinical Studies, and Marketing.</li><li>Simultaneously manage multiple projects, project budgets, time-lines and be accountable for deliverables.</li><li>Cultivate relationships with researchers and clinicians outside of Hill’s to provide expertise, ideas and technologies that fill gaps.<br><br>&nbsp;\n<br><br>\n<strong>What you need for this position:</strong>\n<br><br>\n&nbsp;</li>\n</ul>\n\n<ul>\n<li>PhD degree in Nutrition or Nutritional Biochemistry.</li><li>10 + years of post-graduate experience in applied science</li><li>&nbsp;3+ years of experience in canine/feline or human nutrition</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>It’s an advantage to have:</strong>\n<br><br>\n&nbsp;\n<ul>\n<li>Experience in pharmaceutical industry or genomics</li>\n</ul>\n&nbsp;\n<br><br>\nAre you interested in working for Hill's Pet Nutrition? You can apply to work with us using this online application. Attach all relevant documents such as a cover letter and resume or CV. Applications received by e-mail are not considered in the selection process.\n<br><br>\nBecome part of our team. We look forward to your application.\n<br><br>\nEqual Opportunity Employer\n<br>\nColgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, or any other characteristic protected by law.\n<br><br>\n&nbsp;"}