{"job title": "Post-Doctoral Research Scientist-Oral Care", "company": "Colgate-Palmolive", "city state": "– Piscataway, NJ", "rating": "3.8", "job description": "Colgate-Palmolive is a leading global consumer products company, tightly focused on Oral Care, Personal Care, Home Care and Pet Nutrition. Colgate sells its products in over 200 countries and territories around the world under such internationally recognized brand names as Colgate, Palmolive, Speed Stick, Lady Speed Stick, Softsoap, Irish Spring, Protex, Sorriso, Kolynos, elmex, Tom’s of Maine, Sanex, Ajax, Axion, Fabuloso, Soupline and Suavitel, as well as Hill’s Science Diet, Hill’s Prescription Diet and Hill’s Ideal Balance.\n<br><br>\nFor more information about Colgate’s global business, visit the Company’s web site at http://www.colgatepalmolive.com. To learn more about Colgate Bright Smiles, Bright Futures® oral health education program, please visit http://www.colgatebsbf.com. To learn more about Hill's and the Hill’s Food, Shelter &amp; Love program please visit hillspet.com. To learn more about Tom’s of Maine please visit http://www.tomsofmaine.com.\n<br><br>\nLocation: Piscataway, New Jersey, United States\n<br>\nNo Relocation Assistance Offered\n<br>\n#&nbsp;61241\n<br><br>\nColgate-Palmolive invites applications for a Post-Doctoral Research Scientist (PDRS) position based at our Piscataway, NJ location. The position is a two year fixed term of at-will employment with the opportunity to apply for full time employment at the termination of the term.\n<br><br>\n&nbsp;\n<br><br>\nThe PDRS will participate in early product research and design efforts in Oral Care and will document research results with technical reports, patent applications, and present technical findings to R&amp;D community and management.\n<br><br>\n&nbsp;\n<br><br>\nThe PDRS will employ a variety of biochemical and cell biology techniques (ELISA, proteomics, etc.) to study the physiology of oral soft tissue under different states of oral health and disease and the subsequent effects of treatment with Colgate products. The PDRS will work closely with other researchers at Colgate integrating aspects of microbiology and immunology as needed.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Key Responsibilities for this Position:</strong>\n<br><br>\n&nbsp;\n<ul>\n<li>Conduct and design research experiments to advance project objectives<br><br>&nbsp;</li>\n<li>Develop assays to investigate the physiology of oral soft tissue and saliva under various health and disease conditions<br><br>&nbsp;</li>\n<li>Investigate the role of oral biochemistry in maintaining oral soft tissue health<br><br>&nbsp;</li>\n<li>Identify and evaluate new technologies to deliver oral health benefits<br><br>&nbsp;</li>\n<li>Interpret and communicate experimental results to technical and non-technical business partners<br><br>&nbsp;</li>\n<li>Collaborate with external academic partners on research projects exploring fundamental and applied research related<br><br>&nbsp;</li>\n<li>Partner with technical, clinical, regulatory, legal, quality, safety and business partners to drive implementation of identified technologies<br><br>&nbsp;</li>\n\n</ul>\n<strong>Required Qualifications:</strong>\n<br><br>\n&nbsp;\n<ul>\n<li>Ph.D. in oral biology/physiology, oral and craniofacial sciences, or a related field. Preference will be given to candidates with thesis work in the following areas: physiology of mucosal membranes, oral biochemistry, oral soft tissue histology, soft-contact tribology, systems physiology<br><br>&nbsp;</li>\n<li>Research experience in one or more of the following areas:\n\n<ul>\n<li>Oral biochemistry</li><li>Oral cell biology</li><li>Mammalian tissue culture and 3D tissue systems</li><li>Bioanalytical techniques, e.g., ELISA, proteomics, etc.<br><br>&nbsp;</li>\n</ul></li>\n<li>Familiarity with or desire to learn data analytic tools<br><br>&nbsp;</li>\n<li>Capable of carrying out independent research programs with minimal supervision.<br><br>&nbsp;</li>\n<li>Excellent written and verbal communication skills including fluency in English.<br><br>&nbsp;</li>\n<li>Ability to interact with multifunctional technical/non-technical personnel and be an effective participant in a team environment</li>\n</ul>\nAre you interested in working for Colgate-Palmolive? You can apply to work with us using this online application. Attach all relevant documents such as a cover letter and resume or CV. Applications received by e-mail are not considered in the selection process.\n<br><br>\nBecome part of our team. We look forward to your application.\n<br><br>\nEqual Opportunity Employer\n<br>\nColgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, ethnicity, age, disability, veteran status, marital status, or any other characteristic protected by law."}