{"job title": "Data Modeler", "company": "Collabera", "city state": "– Chicago, Illinois", "rating": "3.8", "job description": "Chicago, Illinois\n<br>\n<strong>Skills :</strong> Data modeling, Erwin and/or power designer, information architecture, data governance, metadata management and administration\n<br>\n<strong>Description :</strong> Day to Day Responsibilities:\n<br>\nWe are looking for a Senior Data Modeler within the Identity and Access Management (IAM) Data Management and Information Architecture (DMIA) group. This candidate will be responsible for identifying areas where data can be used to improve business activities, define business users requirements and data flows, and propose and implement innovative data solutions. The role will be responsible for creating and maintaining data models for DMIA and assisting as requested in other IAM data modeling activities. Person will act as a data modeling SME and work closely with database engineers to create optimal physical data models. Based off of data analysis, the data modeler will make recommendations for standardization and proper data usage. This role will also be responsible for supporting defining and governing data modeling and design standards, tools, best practices, and related development methodologies for IAM. Additionally, this role will help promote a data-driven culture, with a focus on enterprise standards, maturity, and controls. Responsibilities will include the implementation of a centralized Data Modeling Repository.\n<br><br>\n<strong>Must Haves:</strong>\n\n\n<ul>\n<li>8-10 years of experience in data modeling</li>\n<li>Experience with Erwin and/or power designer</li>\n<li>Expertise in building dimensional reporting structures</li>\n<li>Strong communication both written and verbal</li>\n<li>Understanding of information architecture, data governance, metadata management and administration</li>\n</ul>\n\n<strong>Pluses:</strong>\n\n\n<ul>\n<li>Previous experience with information securityData modeling, Erwin and/or power designer, information architecture, data governance, metadata management and administration</li>\n</ul>"}