{"job title": "Commercial Excellence and Business Intelligence Analyst (Interventional Urology)", "company": "Coloplast", "city state": "– Minneapolis, MN", "rating": "3.4", "job description": "Coloplast has a new opportunity available for a Commercial Excellence and Business Intelligence Analyst to join our growing Interventional Urology team at our Minneapolis headquarters.<br> <br> You will work with cross-functional partners to provide fact-based analysis and information to increase sales performance, productivity and execution. As a primary business partner for working with our direct sales &amp; marketing representatives, this job is highly visible and impactful.<br> <br> This is a challenging role that will require strong analytical aptitude, ability to synthesize large volumes of information and translate it into easy-to-understand format, stakeholder and project management skills, flexibility, and natural curiosity to understand how to continuously drive value through improvements and new opportunities.<br> <br> Major Areas of Accountability<br> <br> * Partners with sales, marketing, finance and commercial excellence to provide information and analysis to accomplish sales goals including pricing trends, account information, ASP development, etc.<br> <br> * Develops, improves and executes standardized and ad hoc sales reporting to meet changing needs of the organization<br> <br> * Assist in field sales inquiries and works to develop new tools for analysis<br> <br> * Assists in monthly sales commission process<br> <br> * Provides database reporting support using Cognos ReportNet, PowerPlay and other reporting tools<br> <br> * Builds advanced analytical reports within Excel using data retrieved from multiple data sources and reporting tools<br> <br> * Serve as data owner for segmentation &amp; targeting data<br> <br> * Administers sales databases, CRM systems and reporting<br> <br> * Compiles monthly, quarterly and annual Key Performance Indicators for management<br> <br> * Serve as data owner for marketing programs; including follow-up with sales reps &amp; managers<br> <br> * Works with customer service on customer and product assignments to ensure accurate reporting of orders/ sales<br> <br> * Participates in development of sales, sales quotas and sales forecasting<br> <br> * Provide recommendations to improve business performance and efficiency<br> <br> * Other duties as assigned<br> <br> Essential Qualifications<br> <br> * BA or BS degree in Finance, Business or equivalent<br> <br> * 5+ years of experience with business analysis or similar function<br> <br> * Strong proficiency in Microsoft Excel (formulas, pivot tables, macros, etc.)<br> <br> * Working knowledge of relational databases &amp; CRM systems<br> <br> * Proficiency and accuracy in relational database reporting, data analysis &amp; financial/sales presentations<br> <br> * Ability to be analytical, creative, identify and develop new processes and tools<br> <br> * Demonstrated ability to work as a team player in a dynamic environment<br> <br> * Ability to build positive business relationships with internal and external customers<br> <br> * Excellent written and verbal communication skills in English<br> <br> * Strong business acumen and analytical skills<br> <br> * Personifies Coloplast Mission, Values and Vision as well as Coloplast Leadership Principals<br> <br> * Ability to travel, including international and weekend, up to 10%<br> <br> The job information contained herein will apply to the candidate successful in being hired for the position. If interested, please apply today!<br> <br> Pursuing an ambitious growth agenda, Coloplast develops and markets products and services that make life easier for people with very private and personal medical conditions. Employing more than 10,000 people and with products available in more than 100 countries, we are one of the world´s leading medical device companies. We are constantly growing our business and always looking for new ways to move forward we explore, learn and look for new ways of doing things. Curiosity works here.<br> <br> Visit us on Coloplast.com. Follow us on LinkedIn. Like us on Facebook.<br> <br> EOE M/W/Vets/Disabled<p>SDL2017</p>"}