{"job title": "Data Scientist", "company": "Colony Brands, Inc.", "city state": "– Monroe", "rating": "3.1", "job description": "<strong>Title</strong>\n<br>\nData Scientist\n<br><br>\n21-Aug-2018\n<br><br>\n<strong>Auto req ID</strong>\n<br>\n<strong>1485BR</strong>\n<br><br>\n<strong>Job Description</strong>\n<br>\nColony Brands, Inc. is one of North America’s largest and most successful direct marketing catalog and E-Commerce companies. Our company has grown from a premier mail-order cheese company to include a diverse portfolio of affiliates, brands and products ranging from apparel to kitchen appliances, while maintaining our roots as a private, customer-centric business based in Monroe, WI. To support our affiliate, DM Services, Inc., we are seeking a Data Scientist to utilize advanced analytics to provide accurate, relevant, and actionable insights that enable us to maintain and improve the profitability of all Colony Brands catalog titles. If you possess a passion for innovative analysis and cross-functional collaboration – this could be the place for you!\n<br><br>\nWhat You’ll Do\n<br>\nYou’ll develop models using a variety of statistical techniques, produce model prediction adjustments based on historical data and prepare reports outlining the testing and validation of each model. You’ll develop robust and flexible processes for major analytical production tasks and create automated, fail-safe tools for standard analytical tasks such as predictive modeling, profiling and clustering. You’ll also be responsible for:\n\n\n<ul>\n<li>Developing production ready code complete with error checking and assisting the IT department in developing automated scheduling and triggered execution.</li>\n<li>Conducting research on industry trends/techniques and available data and partnerships – evaluate this research to recommend changes to existing process and develop new ones</li>\n<li>Mentoring peers on how to use cutting edge techniques to address opportunities in marketing response, credit risk, marketing cost allocation, optimization, and customer segmentation</li>\n</ul>\n\nWhat It Takes\n<br>\nWe need a sharp, disciplined, and highly quantitative individual who has a passion for developing optimization solutions. Bachelors degree is required, Masters degree preferred in Statistics, Mathematics, Marketing or a related discipline and 3+ years’ related experience. In addition, we are looking for:\n\n\n<ul>\n<li>3+ years’ statistical data analysis experience</li>\n<li>A solid knowledge of SAS &amp; SQL; all modeling and data analysis will be conducted with these tools</li>\n<li>Solid grasp of probability, statistical and mathematical modeling with analytical and quantitative problem-solving ability</li>\n<li>Willingness to help others and ability to cultivate an environment of teamwork</li>\n</ul>\n\n<strong>Location</strong>\n<br>\nWisconsin\n<br><br>\n<strong>Employment type</strong>\n<br>\nRegular/Full-Time\n<br><br>\n<strong>Job category</strong>\n<br>\nAnalytics\n<br><br>\n<strong>About Us</strong>\n<br>\nDM Services, Inc. provides customer service regarding credit and account receivable services for leading direct marketing companies. DM Services, Inc. is an affiliate company of Colony Brands, Inc. which is one of North America's largest, multi-channel direct-marketing companies. We generously support the communities we work in and offer many benefits and programs that support the well-being of our employees.\n<br><br>\n<strong>Benefits details</strong><br><br>DM Services, Inc. is not just about growing our profits – We are about giving our employees the opportunity for growth and providing a better place to live and work. We also offer our employees many great rewards in addition to monetary compensation:\n\n<li>Medical/Dental/Vision insurance</li><li>A robust Wellness Program including Onsite Healthcare</li> <li>Superb Retirement Plans (401K &amp; a company-funded Pension Plan)</li> <li> Extensive Paid Time Off (PTO) benefits</li> <li> Seven 4-day work weeks in the summer months to give our employees additional time off</li> <li>Educational Assistance</li> <li> Company Profit-Sharing</li>  <li>Company Product Discounts</li> <li>And, so MANY more!</li>\n<strong>City</strong>\n<br>\nMonroe\n<br>"}