{"job title": "Advanced MS Excel/Data Analyst", "company": "COLSA Corporation", "city state": "– Tampa, FL", "rating": "3.7", "job description": "Advanced MS Excel/Data Analyst\n<br><br>\nTracking Code\n<br><br>\n<strong>3154-987</strong>\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nFounded in 1980, COLSA Corporation?s team of engineers, analysts and professionals across the US provide government and commercial customers with the latest and most sophisticated engineering, programmatic, and information technology services.\n<br><br>\nCentered at the core of its values, COLSA knows its people are its most valuable resource. In addition to receiving a competitive compensation package, our employees enjoy offerings such as flexible work schedules, paid time off, benefits that begin on the date of hire, recognition programs, tuition and certification assistance, and immediate vesting in our matching 401(k) plan. Our WE CARE Wellness program provides support and initiatives to empower employees and their families to live healthy, balanced lives and our Association of COLSA Employees (ACE) provides a fun way for employees and their families to come together in times of both celebration and need. We invite you to connect your talents with opportunity, and be a part of our ?Family of Professionals,? in supporting cutting-edge initiatives!\n<br><br>\nThe official functions of Tampa's various Assessment's teams are to (1) provide program assessment through quantitative analyses, (2) produce internal and external reports, and (3) develop new methods of assessment in response to changing reporting and operational requirements. The fast paced, fluid environment necessitates that we remain flexible, often taking on additional tasks well outside of these official duties. Most frequently, these additional responsibilities involve (1) providing operational direction face-to-face with teams and (2) developing and supporting internal software solutions to meet critical and immediate needs.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nCandidate will be responsible for evaluating and executing assessment strategies requiring: (1) collection of metrics to assess program effectiveness as it relates to both individual/team performance and the overall fulfillment of defined objectives, (2) data management including parsing, sanitizing, &amp; restructuring data from various sources and combining them into specific formats, (3) analysis of data to provide actionable insights, and (4) writing of reports and presentations appropriate for a lay audience.\n<br><br>\n<strong>Principal Duties and Responsibilities:</strong>\n<br><br>\n+ Use Intermediate Excel skills to extract data from CSV &amp; other delimited text formats, restructure data as needed (e.g., PivotTables, basic formulas), and update existing summary information (e.g., tables, graphics) for presentation to senior leadership\n<br><br>\n+ Collect and synthesize qualitative vignettes that provide support for data interpretations\n<br><br>\n+ Employ superior written communication to create meaningful stories by combining quantitative (e.g., correlation, trends over time) and qualitative data\n<br><br>\n+ Work with stakeholders to ensure assessment products have the appropriate focus and are providing an accurate representation of the environment\n<br><br>\nThe position may require participation in a 24/7-on-call work schedules and occasional travel in support of mission requirements.\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nRequired Qualifications\n<br><br>\n+ Bachelor's degree or higher from an accredited university in a field related to social science, math, or technology\n<br><br>\n+ Must possess Intermediate Excel skills--to include experience with PivotTables, formulas, creating/updating graphs\n<br><br>\n+ Intermediate data analysis skills, including the ability to (1) understand and work with structured data in standard (e.g., CSV, TSV) &amp; nonstandard delimited formats and (2) provide preliminary error checking (e.g., ensure correct parsing, missing values, valid data types).\n<br><br>\n+ Strong English written and verbal communication skills\n<br><br>\n+ U.S. citizenship required. Candidate must be able to obtain and maintain a DoD security clearance.\n<br><br>\nPreferred Qualifications\n<br><br>\n+ Master?s degree from an accredited university with a major in the Social Sciences (Political Science, Economics, Sociology, etc.) or a related field\n<br><br>\n+ Familiarity with basic principles of research design\n<br><br>\n+ Ability to devise measurement strategy given a research question and existing data constraints\n<br><br>\n+ Familiarity with unstructured data and related analysis techniques (text analytics, network analysis, etc.)\n<br><br>\n+ Ability to construct a logic model breaking down complex processes into key components\n<br><br>\n+ Valid DoD clearance\n<br><br>\n+ Proficiency in languages relevant to AFRICOM\n<br><br>\n+ SQL programming and relational database experience may be desired\n<br><br>\nApplicant selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information. COLSA Corporation is an Equal Opportunity Employer, Minorities/Females/Veterans/Disabled. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin.\n<br><br>\nJob Location\n<br><br>\nTampa, Florida, United States\n<br><br>\nPosition Type\n<br><br>\nFull-Time/Regular"}