{"job title": "Big Data Engineer 2", "company": "Comcast", "city state": "– Philadelphia, PA", "rating": "3.5", "job description": "Comcast's Technology &amp; Product organization works at the intersection of media and technology. Our innovative teams are continually developing and delivering products that transform the customer experience. We work every day to make a positive impact through innovation in the pursuit of building amazing products that are enjoyable, easy to use and accessible across all platforms. The team also develops and supports our evolving network architecture, including next-generation consumer systems and technologies, infrastructure and engineering, network integration and management tools, and technical standards.\n<br><br>\nSummary\n<br>\nThe Platform Services Analytics Team delivers analytics engineering and operations for Data Services Engineering and affiliated teams within IP &amp; Communications Services. The team provides end-to-end data analytics solutions (identify project data needs, architecting solution, implementing solution, deploying solution on one of the 3 owned and maintained platforms, and assist in KPI and dashboard development). Splunk, Kafka/Hadoop, and ELK and the corresponding data presentation layers are within their scope.\n<br>\nThe Big Data Engineer will be responsible for architecting, developing and performing ongoing operations of large-scale data processing systems. Expertise in data warehousing solutions is required and should be able to work technologies such as Kafka, Hadoop, Splunk and Elasticsearch. The hire will be responsible for expanding and optimizing our data architectures and as well as optimizing data flow and collection for cross functional teams. The ideal candidate has sufficient experience in software engineering, is a quick learner and enjoys working in a fast-paced environment. The candidate should enjoy being challenged and solve complex problems on a daily basis.\n<br><br>\nCore Responsibilities\n<br>\nDevelops solutions to a wide range of difficult applications, problems or procedures.\n<br>\nSupports Lead Engineer with the architecture, design, development, qualification and deployment of applications consistent with product and technical roadmaps.\n<br>\nWorks with engineering project management and lead engineer to deliver applications that meet or exceed product requirements, project schedules and reliability.\n<br>\nAssists product development and operations teams to define technical requirements to accompany existing products and operation requirements.\n<br>\nDesigns and develops use cases in support of the technical requirements.\n<br>\nDetermines resources, technology and course of action to achieve results.\n<br>\nProvides leadership and consultative direction to the organization, department and group.\n<br>\nConsistent exercise of independent judgment and discretion in matters of significance.\n<br>\nRegular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) as necessary.\n<br>\n<strong>Other duties and responsibilities as assigned.\n<br><br>\nQualifications:</strong>\n<br>\nExperience building and optimizing big data' architectures and data sets.\n<br>\nStrong analytic skills related to working with unstructured data sets.\n<br>\nFamiliarity with building processes supporting data transformation, data structures, metadata and workload management.\n<br>\nStrong understanding of how to employ technologies to solve big data problems and to develop innovative big data solutions.\n<br>\nProficiency in designing efficient and robust ETL workflows.\n<br>\nExperience with big data tools such as Hadoop, Spark, Kafka, Splunk, Elasticsearch.\n<br>\nAbility to tune Hadoop solutions to improve performance and end-user experience.\n<br>\nStrong project management and organizational skills.\n<br>\nAbility to work in teams and collaborate with others.\n<br><br>\nJob Specification:\n\n\n<ul>\n<li>Bachelors Degree or Equivalent</li>\n<li>Engineering, Computer Science</li>\n<li>Generally requires 2-5 years related experience\n<br><br>\nComcast is an EOE/Veterans/Disabled/LGBT employer</li>\n\n</ul>"}