{"job title": "Mid-Level to Senior Data Engineer", "company": "Comlinkdata", "city state": "– Boston, MA", "rating": "4.5", "job description": "<div>\n \n <div><div>\n \n \n \n \n <div>\n <div>\n \n \n <div>\n \n \n <div>\n <p>Mid to Senior Level Data Engineer</p>\n </div>\n </div> \n<div>\n \n \n <div>\n <p>Reports to: Director, Product Development</p>\n<p>Location: Boston, MA</p>\n<p><strong>Summary</strong></p>\n<p>Comlinkdata is looking for an experienced Data Engineer/Data Scientist to join our Research and Development team. If you have strong programming/problem solving skills, a desire to continue learning and a passion for developing and improving data analysis applications, then we want to speak with you. You’ll be challenged with improving our processes for working with large datasets, writing code for data processing and optimizing data analysis processes. You’ll also collaborate across Comlinkdata teams to ensure our data and products exceed client expectations, and to streamline and data operations.</p>\n<p><strong>Responsibilities</strong></p>\n<p>Including but not limited to:</p>\n<ul>\n<li>Work with large datasets of hundreds of terabytes to process it within hours leveraging Spark, Hive and AWS Elastic MapReduce (EMR)</li>\n<li>Create new environments for product development teams to run statistical and ML models, data analysis and ETL processes</li>\n<li>Directly implement complex models and data pipelines on large datasets</li>\n<li>Work with the wider team to educate them on the value of good software development practices such as architecture design, clean code and clear naming conventions</li>\n<li>Implement data tests and QA processes</li>\n<li>Participate in cross-functional projects e.g. EMR functionality enhancements, analysis tool evaluation,</li>\n</ul>\n<p><strong>Candidate Profile</strong></p>\n<p>Required Skills:</p>\n<ul>\n<li>2 – 5 years of work experience in large data processing and analytics projects, bringing algorithms and proof-of-concepts to production</li>\n<li>Bachelors Degree in Computer Science, Mathematics, Engineering or similar</li>\n<li>Well trained in good programming practices</li>\n<li>Sound computer science fundamentals</li>\n<li>Extensive applied experience using Spark to develop and implement ETL processes and data pipelines</li>\n<li>Advanced knowledge of Python (or similar scripting language)</li>\n<li>Advanced knowledge of SQL (MSSQL, MySQL and T-SQL)</li>\n<li>Familiarity with data analysis and statistical modeling using Python (e.g. NumPy/SciPy, pandas) or R (or similar statistical language)</li>\n<li>Experience with Object-Oriented programming</li>\n<li>Self-motivated; capable of working independently and as part of a team</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>Experience with AWS Environment or Similar Cloud Services</li>\n<li>Experience with Linux</li>\n<li>Experience with Java, C++ or C</li>\n<li>Database Design Experience</li>\n<li>Hadoop/EMR cluster tuning</li>\n<li>Test Driven Development</li>\n<li>ML algorithms and good ML implementation practices</li>\n<li>Application of ML techniques and other complex algorithms at large scale using Spark or similar</li>\n</ul>\n<p>At this time, Comlinkdata will not sponsor a new applicant for employment sponsorship for this position.</p>\n<p>Candidates must submit a resume and cover letter to be considered.</p>\n </div>\n </div> \n<div>\n \n \n <div>\n <p><strong></strong></p></div></div></div></div></div></div></div>"}