{"job title": "Data Analyst", "company": "Compulink Management Center, Inc", "city state": "– Long Beach, CA", "rating": "3.1", "job description": "Home Careers Jobs Data Analyst\n<br><br>\nData Analyst Analytics | Long Beach, California\n<br><br>\nDescription\n<br><br>\nJoin the team that is helping the world benefit from storing important documents to a digital repository. Successful candidates will have a passion for creating high performance, reliable, secure, and maintainable code that can be counted on by our customers.\n<br><br>\nIn this role, you will work on various data mining projects to assist management in product trending, ROI analysis, and business development. You will have the opportunity to take on various analytical projects such as customizing the Salesforce CRM software system to better facilitate the collection of pertinent data, performing customer segmentation to identify which marketing/sales activities are most effective, and developing ad hoc reports as needed.\n<br><br>\nThis position requires someone who possesses a deep appreciation of data and what it can mean to business.\n<br><br>\n<strong>What You'll Need:</strong>\n\n\n<ul>\n<li>BS or equivalent experience in Computer Science, Statistics, Mathematics, or other related fields</li>\n<li>Experience in statistics or data mining required</li>\n<li>General sales, marketing and business processes knowledge</li>\n<li>Excellent debugging, problem-solving, and analytical skills</li>\n<li>Strong organizational and communication skills, both verbal and written</li>\n<li>Experience with programming or SQL required</li>\n<li>Knowledge of C, C++, Java a plus</li>\n</ul>\n\nClick here to learn more about Life at Laserfiche.\n<br><br>\nLaserfiche complies with all Equal Opportunity and Affirmative Action regulations. Laserfiche makes all employment decisions such as recruiting, hiring, training, promotion, compensation, professional development practices, discipline and termination without regard to race, religion, color, national origin, ancestry, citizenship, sex, pregnancy, age, creed, physical or mental disability, medical condition, genetic characteristic, marital status, veteran status, gender identity/expression, sexual orientation or any other characteristic protected by law, except as may be permitted by law.\n<br><br>\nShare"}