{"job title": "Data Scientist", "company": "Compugain Corporation", "city state": "– Reston, VA", "rating": "3.3", "job description": "CompuGain is an Information Technology and Business Consulting firm providing project-based solutions, software solutions and professional staffing services.Position: Data Scientist Location: Reston, VA Duration: LongtermJob Description:The Data Scientist will help the organization make better decisions through the collection and analysis of internal and external data.Required Skills: Work with a large &amp; growing educational datasets using descriptive statistics and data visualization tools. Create &amp; improve predictive models in support of Client programs. Use various modeling techniques, network analysis, and machine learning techniques to creatively answer business questions Create insights from existing data and drive the collection of new data through instrumentation. Collaborate directly with internal clients to understand issues and deliver results that address client needs in a timely manner Communicate methodology and results of advanced analyses using accessible language and intuitive data visualizations Create reproducible, documented analyses that lend themselves to automation. Perform other duties or tasks as assigned or required.Related Skills &amp; Other Requirements: Strong skills in R and/or Python Strong foundation in statistical analysis and machine learning techniques Facility with relational, columnar, and NoSQL database systems Experience coping nimbly with imperfect data Experience with Bayesian analysis, nonparametric analysis, image recognition, or natural language processing a plus Experience with National Center for Education Statistics, Census, and/or consumer datasets is desirableEducation/Certifications: Master's in a quantitative discipline a plus 5-7 years related experienceThanks &amp; Regards,Abdul AijazSr. Technical RecruiterC: 703-###-####E: ...@compugain.com - provided by Dice Data Science, R and/or Python, statistical analysis and machine learning, NoSQL, Bayesian analysis, nonparametric analysis, image recognition, or natural language processing a plus\n<br>\nAssociated topics: data administrator, data architect, data engineer, data scientist, data warehouse, data warehousing, etl, mongo database administrator, sybase, teradata"}