{"job title": "Data Scientist", "company": "comScore", "city state": "– US-WI-Madison", "rating": "2.9", "job description": "<div><div>\n<div><strong>Job Title: Data Scientist</strong>\n<br><br>\n<strong>Location: Madison, WI</strong>\n<br><br>\n<strong>About This Role:</strong>\n<br><br>\nThe Data Scientist will address the challenges of modern big data, organizing massive disparate data sets using statistics, machine learning and optimization. The comScore Madison data science team is responsible for detection of invalid and anomalous data, organization of foundational data assets that track users across the internet, and research and development of new products that allow our clients to better understand how the world consumes digital content.\n<br><br>\n<strong>What You’ll Do:</strong>\n<ul>\n<li>Design and implement statistical, optimization and machine learning algorithms at scale using PySpark, Apache Pig, and SQL based languages.</li> <li>Validate, analyze and visualize results.</li> <li>Interpret and present findings to management and business decision makers.</li> <li>Work with enormous datasets, including graph structured data with billions of nodes.</li> <li>Author technical and academic publications showcasing capabilities of comScore’s data assets to solve real world problems.</li> <li>Deal with highly distributed data sources, cope with sampling biases and heterogeneity, and work with different data formats and structures.</li> <li>Develop algorithms that exploit parallel and distributed architectures.</li> <li>Ensure data integrity and security.</li><li>Develop methods for visualizing massive data.</li> <li>Develop scalable and incremental algorithms, and cope with the need for real-time analysis and decision-making.</li>\n</ul>\n<strong>What You’ll Need:</strong>\n<ul>\n<li>MS or PhD in Computer Science, Statistics, Engineering, Mathematics, or related field.</li><li>Experience in MATLAB, C/C++, Java, Perl, Python, Apache Spark, Apache Pig, Hadoop and MapReduce or related language.</li> <li>Sounds understanding of statistics.</li> <li>Ability to apply critical thinking to quickly identify and resolve data issues.</li> <li>Experience in data analysis and problem solving with big data.</li> <li>Ability to think creatively and solve complex problems.</li> <li>Ability to autonomously manage simultaneous projects in a fast-paced business environment.</li> <li>Knowledge of relational databases and methods for efficient data retrieval.</li> <li>Experience with SQL or knowledge of relational databases and methods for efficiently retrieving data.</li><li>Strong verbal and written communication skills.</li><li>Experience with statistical software or scientific computation software (e.g.,R, Matlab) is preferred</li> <li>Hadoop or other comparable MapReduce experience is preferred</li><li>Experience with hands-on coding from scratch is preferred</li><li>Exposure to panel data and/or Internet behavior data is a plus</li><li>Online advertising industry experience is a plus</li></ul></div>\n</div>\n</div>\n<br>"}