{"job title": "Custom Data Analyst", "company": "comScore", "city state": "– US-VA-Reston", "rating": "3.0", "job description": "Job Description<br><br>Job Title: Custom Data Analyst\n<br><br>\nLocation: Reston, VA\n<br><br>\nAbout This Role:\n<br><br>\nA Data Analyst for Custom Analytics will support the Technology team and organizational goals by providing industry knowledge and analytical thinking. Working as part of the Custom Analytics department within the company, this individual will work hands-on with the vast array of comScore data assets to maintain data quality,analyze data trends, champion data driven insights on online consumer behavior, and expand current product offerings. Additionally, this individual will work within a creative environment to manipulate data, statistically analyze data and convey findings to stakeholders.\n<br><br>\nWhat Youll Do:\n\n<ul>\n\n <li>Drive custom analytical analysis across a wide range of data assets including PC, Mobile and TV data.</li>\n<li>Work effectively with client services to deliver data on an ongoing and custom basis and ensure data meets clients needs.</li> \n\n<li>Preserve quality data by implementing team-wide standard and independent QA processes, maintaining proprietary data collection programs, and resolving any data anomalies.</li>\n<li>Understand core products by researching industry trends, knowing the base data used in all delivered reports.</li>\n</ul>\nWhat Youll Need:\n\n<ul>\n\n <li>Bachelors degree in a quantitative subject such as Statistics, Engineering, Economics, Computer Science, etc.</li>\n<li>Experience in data analysis and problem solving with big data.</li>\n<li>Extensive experience with SQL or knowledge of relational databases and methods for efficiently retrieving data.</li>\n<li>Familiarity with Python, R, Bash, regex, and web scraping tools.</li>\n<li>Ability to think creatively and solve complex problems.</li>\n<li>Excellent verbal, written and computer communication skills with strong analytical and troubleshooting skills.</li>\n<li>The nature of the teams dynamics will require an individual that is able to work closely in a collaborative role with other team members, as well as complete tasks individually as assigned.</li>\n<li>Strong analytical/critical thinking and innovation skills.</li>\n<li>Self-motivated, fast learner, creative, team player willing to help others.</li>\n<li>Flexible and able to work fast under tight deadlines with demanding quality requirements.</li>\n<li>Project management skills, including the ability to handle multiple projects in a fast-paced environment.</li>\n<li>High attention to detail.</li>\n</ul>\nAbout comScore\n<br><br>\nAt comScore, were pioneering the future of cross-platform media measurement, arming organizations with the insights they need to make decisions with confidence. Central to this aim are our people who work together to simplify the complex on behalf of our clients &amp; partners. Though our roles and skills are varied, were united by our commitment to five underlying values: Integrity, Velocity, Accountability, Teamwork, and Servant Leadership. If youre motivated by big challenges and interested in helping some of the largest and most important media properties and brands navigate the future of media, wed love to hear from you.\n<br><br>\ncomScore (NASDAQ: SCOR) is a trusted partner for planning, transacting and evaluating media across platforms. With a data footprint that combines digital, linear TV, over-the-top and theatrical viewership intelligence with advanced audience insights, comScore allows media buyers and sellers to quantify their multiscreen behavior and make business decisions with confidence. A proven leader in measuring digital and set-top box audiences and advertising at scale, comScore is the industrys emerging, third-party source for reliable and comprehensive cross-platform measurement. To learn more about comScore, please visit comScore.com.\n<br><br>\nEEO Statement: We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, disability status, sexual orientation, gender identity, age, protected veteran status or any other characteristic protected by law.To comply with federal law, comScore participates in E-Verify. Successful candidates must pass the E-Verify process after hire."}