{"job title": "Senior Data Engineer", "company": "Concho Resources", "city state": "– Houston, TX", "rating": "4.9", "job description": "Title\n<br><br>\nSenior Data Engineer\n<br><br>\nLocation\n<br><br>\nHouston, TX\n<br><br>\nJob Summary\n<br><br>\n<strong>Responsibilities include:</strong>\n\n\n<ul>\n<li>Write and maintain optimized stored procedures, functions, and SQL queries meant to assist the organization in accessing and analyzing business data.</li>\n<li>Assist in design and modeling of scalable database solutions which adhere to business requirements.</li>\n<li>Monitor and maintain database health and security.</li>\n<li>Ability to resolve database performance issues such as deadlocks and blocking.</li>\n<li>Recommend and perform regular database maintenance activities.</li>\n<li>Must have knowledge of database partitioning strategies and have experience working with high volume databases.</li>\n<li>Assist with ongoing maitenance and development of Operational Data Store and Datamarts.</li>\n<li>Monitor and maintain existing SQL Server Analysis Services (SSAS) cubes and provide support for additional cube development efforts.</li>\n<li>Design, build, and deploy effective ETL data integrations that adhere to enterprise standards</li>\n<li>Develop SQL Server Reporting Services (SSRS) reports and provide support for existing reports based on customer requirements</li>\n<li>Assist in identifying and resolving data quality issues and work with appropriate team to resolve them</li>\n<li>Participate in user group meetings to understand business needs, priorities, and provide technical guidance when necessary</li>\n<li>Resolve data issues in issue logs and reports; determine the root cause of issues</li>\n<li>Define and maintain all technical documentation; including data definitions, data flow, lineage, systems of record, technical and operational metadata, etc.</li>\n<li>Assist with the delivery of change communication, education and training materials</li>\n<li>Work effectively with other staff to better understand corporate initiatives and policies, and deliver cohesive and consistent solutions to the entire organization</li>\n</ul>\n\nEducation/Experience Required\n\n\n<ul>\n<li>Bachelors Degree in Computer Science, Math or Business Information Systems preferred or an equivalent combination of education and experience</li>\n<li>A minimum of 7 years of demonstrated experience and expertise in: database administration, standards and processes, data modeling, data mining, data warehousing, and data integration; preferably Informatica Powercenter</li>\n<li>Previous work experience with various data types and data models (e.g. well header, well logs, production, drilling and completion, seismic, culture, Public Petroleum Data Model (PPDM), data exchange standards and file formats (LAS, IHS, etc.))</li>\n<li>Experience in petroleum industry applications such as Aries, OFM, Enertia, WellView, Tobin, TDM, GeoGraphix, etc.</li>\n<li>Concho's annual review and application of the Fair Labor Standards Act has determined that this position is an exempt position</li>\n<li>Must be able to work in the United States indefinitely</li>\n</ul>\n\nSkills/Attributes Desired\n\n\n<ul>\n<li>Ability to work transparently with minimal supervision; strong teamwork and communications interpersonal skills</li>\n<li>Strong analytical and technical skills, written and verbal communication skills</li>\n<li>Ability to quickly develop expertise of the functions and capabilities of new technologies and standards</li>\n<li>Experience with Informatica Powercenter preferred; will consider experience with Microsoft SQL Server Integration Services (SSIS)</li>\n<li>Experience with BI visualization tools such as Spotfire or Tableau</li>\n<li>Experience with big data technologies such as Hadoop is a plus</li>\n<li>Proficiency with writing SQL and T-SQL</li>\n<li>Familiarity with data management &amp; programming essential and work exposure in the field of E&amp;P</li>\n<li>Ability to work as a team player with willingness to handle assigned tasks, whether simple or complex</li>\n<li>Ability to work in a fast paced organization and multi-task</li>\n</ul>\n\nCOG Operating LLC (\"Concho\") uses e-Verify to confirm eligibility to work in the United States. Concho is proud to be an Equal Opportunity/Affirmative Action (EEO/AA) employer. Concho's policies are intended to ensure qualified applicants and employees are treated fairly and have equal opportunities in all aspects of employment, regardless of personal characteristics or status. We maintain a drug-free workplace and perform pre-employment substance abuse testing.\n<br><br>\n<strong>NOTICE TO THIRD PARTY AGENCIES</strong>\n<br><br>\nPlease note that COG Operating LLC (\"Concho\") does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, COG Operating LLC (\"Concho\") will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, COG Operating LLC (\"Concho\") explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of COG Operating LLC (\"Concho\")."}