{"job title": "Data Engineer", "company": "Conduent", "city state": "– Morrisville, United States", "rating": "2.5", "job description": "<div><div>Description<br></div><div>Conduent is the world's largest provider of diversified business process services with leading capabilities in transaction processing, automation, analytics and constituent experience. We work with both government and commercial customers in assisting them to deliver quality services to the people they serve. <br><br> We manage interaction s with patients and the insured for a significant portion of the U.S. healthcare industry. We are the customer interface for large segments of the technology industry and the operational and processing partner of choice for public transportation systems around the world. <br><br> Whether it's digital payments, claims processing, benefit administration, automated tolling, customer care or distributed learning Conduent manages and modernizes these interactions to create value for both our clients and their constituents. Learn more atwww.conduent.com. <br><br> If you meet the requirements of this position and want to work for a world-class company with a great marketplace reputation, apply today.</div><div><b></b></div><div><b>Title:</b>Data Engineer</div><div><b></b></div><div><b></b></div><div>We are looking for a<b>Data Engineer</b>who will be part of our Analytics Practice and will be expected to actively work in a multi-disciplinary fast paced environment. This role requires a broad range of skills and the ability to step into different roles depending on the size and scope of the project; its primary responsibility is the acquisition, transformation, loading and processing of data. </div><div><b></b></div><div><b>Responsibilities:</b></div><div>- Engineer a modern data pipeline to collect, organize, and process data from disparate sources.</div><div>- Performs data management tasks, such as conduct data profiling, assess data quality, and write SQL queries to extract and integrate data</div><div>- Develop efficient data collection systems and sound strategies for getting quality data from different sources</div><div>- Consume and analyze data from the data pool to support inference, predicttion and recommendation of actionable insights to support business growth.</div><div>- Design and develop ETL processes using tools and scripting. Troubleshoot and debug ETL processes. Performance tuning and opitimization of the ETL processes.</div><div>- Provide support to new of existing applications while recommending best practices and leading projects to implement new functionality.</div><div>- Collaborate in design reviews and code reviews to ensure standards are met. Recommend new standards for visualizations.</div><div>- Learn and develop new ETL techniques as required to keep up with the contemporary technologies.</div><div>- Reviews the solution requirements and architecture to ensure selection of appropriate technology, efficient use of resources and integration of multiple systems and technology.</div><div>- Support presentations to Customers and Partners</div><div>- Advising on new technology trends and possible adoption to maintain competitive advantage</div><div></div><div><b>Preferred Qualifications:</b></div><div>- 5+ years of related experience is required.</div><div>- A BS or Masters degree in Computer Science or related technical discipline is required</div><div>- ETL experience with data integration to support data marts, extracts and reporting</div><div>- Experience connecting to varied data sources</div><div>- Excellent SQL coding experience with performance optimization for data queries.</div><div>- Understands different data models like normalized, de-normalied, stars, and snowflake models. Worked with transactional, temporarl, time series, and structured and unstructured data.</div><div>- Worked in big data environments, cloud data stores, different RDBMS and OLAP solutions.</div><div>- Experience in cloud-based ETL development processes.</div><div>- Experience in deployment and maintenance of ETL Jobs.</div><div>- Is familiar with the principles and practices involved in development and maintenance of software solutions and architectures and in service delivery.</div><div>- Has strong technical background and remains evergreen with technology and industry developments.</div><div></div><div><b>Additional</b><b>Requirements</b></div><div>- Demonstrated ability to have successfully completed multiple, complex technical projects</div><div>- Prior experience with application delivery using an Onshore/Offshore model</div><div>- Experience with business processes across multiple Master data domains in a services based company</div><div>- Demonstrates a rational and organized approach to the tasks undertaken and an awareness of the need to achieve quality.</div><div>- Demonstrates high standards of professional behavior in dealings with clients, colleagues and staff.</div><div>- Is able to make sound and far reaching decisions alone on major issues and to take full responsibility for them on a technical basis.</div><div>- Strong written communication skills. Is effective and persuasive in both written and oral communication.</div><div>- Experience with gathering end user requirements and writing technical documentation</div><div>- Time management and multitasking skills to effectively meet deadlines under time-to-market pressure</div><div>- Requires some travel (on average 10%-20%)</div><div></div><div></div><div>Conduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the Submit button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first: click here to access or download the form.</div><div></div><br></div>"}