{"job title": "Research Scientist - Computer Vision, Machine Learning, Video Analytics, Perceptive Systems", "company": "Conduent", "city state": "– Morrisville, NC", "rating": "2.5", "job description": "<div><div><div>Description</div>\n<br>\n<div><strong>Conduent is the world's largest provider of diversified business process services with leading capabilities in transaction processing, automation, analytics and constituent experience. We work with both government and commercial customers in assisting them to deliver quality services to the people they serve.</strong></div><div><strong> We manage interactions with patients and the insured for a significant portion of the U.S. healthcare industry. We are the customer interface for large segments of the technology industry and the operational and processing partner of choice for public transportation systems around the world.\n<br><br>\nWhether it's digital payments, claims processing, benefit administration, automated tolling, customer care or distributed learning - Conduent manages and modernizes these interactions to create value for both our clients and their constituents. Learn more at</strong> <strong>www.conduent.com</strong><strong>.</strong></div><div></div><div><strong>POSITION DESCRIPTION:ResearchScientist - Computer Vision, Machine Learning, Video Analytics, Perceptive Systems</strong></div><div></div><div><strong> Were seeking Research Scientists in the area of Computer Vision, Video &amp; Image Analytics and Perceptive Systems who want to work at the leading edge of automation in industries such as transportation, public safety, healthcare, and retail and want to make their innovations real. We are looking for skilled, dedicated teammates who believes their contributions can make the world more productive and a better place to live.</strong>\n</div><div><strong>Research, development and engineering performed by the team will include: understanding needs of the customers, overall video/imaging and sensing system design, extraction of understanding from images and real-time video streams, performing designed experiments to optimize the systems, and the delivery of robust prototypes leading to new product offerings. Examples include: (1) systems that aid intelligent transportation networks and self-optimize to enhance user experience (2) surveillance systems that monitor actions of persons and the state of objects and property for public safety and retail (3) systems that monitor and determine the state of production facilities and workflows enabling optimization and real-time control.</strong></div><div></div>\n\n<ul>\n<li><div><strong>Individuals will contribute to a team using state of the art open source tools as we as invent new methods</strong></div></li><li><div><strong>They will design and prototype novel applications that intelligently extract understanding from image streams</strong></div></li><li><div><strong>They will apply machine learning and other techniques to create intelligent, real-world applications</strong></div></li><li><div><strong>They will keep abreast of the latest developments in the field and can champion promising, new methods to explore</strong></div></li><li><div><strong>The team will proactively identify new areas of research and in partnership with business groups develop value-based proposals for investment</strong></div></li><li><div><strong>Individuals will work with intrapreneuial business teams to develop and commercialize user-centric, adaptive and robust systems</strong></div></li><li><div><strong>The researcher will also collaborate with academic and research institutions across the country with projects at MS and PhD level</strong></div></li><li><div><strong>Journal and conference publications are also expected</strong></div></li>\n</ul>\n\n<strong></strong></div><div></div><div><strong><u><strong>Qualifications:</strong></u></strong></div><strong><strong>\n<br>\n</strong>\n\n<ul>\n<li><div><strong>Ph.D., MS in computer science, electrical engineering, mathematics/statistics, imaging science, or other related areas with a record of work in the relevant domains</strong></div></li><li><div><strong>Applicants must have a solid background in mathematics, statistics and machine learning, with an emphasis in imaging / sensing systems, and computer vision</strong></div></li><li><div><strong>The applicant should also have strong skills in software prototyping and engineering with expertise in applicable programming and analytics languages (Matlab, Python, R, C/C++) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations</strong></div></li><li><div><strong>Experience and knowledge in services domains such as business process outsourcing systems, transportation systems, healthcare systems and financial services <u>is valued</u></strong></div></li><li><div><strong>Interdisciplinary skills: big data analytics, modeling and simulation, systems design and prototyping</strong></div></li><li><div><strong>Must be an out-of-the-box problem solver, capable of proposing novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context</strong></div></li><li><div><strong> Strong analytical, written, and verbal communication skills</strong>\n</div></li>\n</ul>\n\n<strong><div><u>Preferred:</u></div>\n<br>\n</strong>\n\n<ul>\n<li><div><strong>Experience in industrial research, development and engineering teams creating video/image analytics technology with a focus on information and content identification, extraction, and putting it to work in a system</strong></div></li><li><div><strong>A focus on developing algorithms that can be implemented with minimal/efficient computational resources</strong></div></li>\n</ul>\n\n<div></div><div></div><div></div><div><strong>Conduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the \"Submit\" button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first:</strong><strong>click here to access or download the form</strong><strong>.</strong></div><div></div></strong></div><strong>\n<br></strong>"}