{"job title": "Research Scientist: Blockchain", "company": "Conduent", "city state": "– Morrisville, United States", "rating": "2.5", "job description": "<div><div>Description</div>\n<br>\n<div><strong>Conduent is the world's largest provider of diversified business process services with leading capabilities in transaction processing, automation, analytics and constituent experience. We work with both government and commercial customers in assisting them to deliver quality services to the people they serve.</strong></div><div><strong> We manage interactions with patients and the insured for a significant portion of the U.S. healthcare industry. We are the customer interface for large segments of the technology industry and the operational and processing partner of choice for public transportation systems around the world.\n<br><br>\nWhether it's digital payments, claims processing, benefit administration, automated tolling, customer care or distributed learning - Conduent manages and modernizes these interactions to create value for both our clients and their constituents. Learn more at</strong> <strong>www.conduent.com</strong><strong>.</strong></div><div></div><div></div><div>POSITION DESCRIPTION: Research Scientist - Blockchain</div><div>Conduent Labs works closely with its business groups to addresses real world challenges in the areas of compliance, digital payments and processing, finance and accounting, healthcare solutions and more. Improving business agility and operational efficiency is of utmost importance in todays fast-changing and dynamic market to deliver rich customer experience through rapid innovation.</div><div></div><div><u>Position:</u></div><div>We are looking for a Blockchain scientist who will focus on various aspects of Blockchain research such as automation, transparency, trustworthiness, scalability, and performance as they relate to the next generation of business processes in domains such as banking and financial services, finance and accounting, legal and compliance, transportation and urban infrastructure, and healthcare. The successful candidate will be proficient in Blockchain technologies, will have excellent communication skills and be a proven problem solver. Candidates should have experience in distributed systems.</div><div></div><div><u>Responsibilities:</u></div>\n\n<ul>\n<li>Work with business teams and research teams to develop innovative use cases for Blockchain solutions</li><li>Evangelize the benefits of Blockchain as it relates to business process innovation and transformation</li><li>Ability to work with Blockchain platforms to create modern solutions for businesses</li>\n</ul>\n\n<strong><div></div><div><u>Qualifications:</u></div>\n<br>\n</strong>\n\n<ul>\n<li>A PhD degree in Computer Science, Electrical Engineering or equivalent discipline</li><li>Sound understanding of the concepts related to distributed computing, operating system principles, Cloud and IoT</li><li>Strong research background supported by top-tier conference and journal publications</li><li>Ability to quickly learn new technologies / next gen. frameworks and showcase their impacts to the respective business groups, engineering team and stakeholders</li><li>Hands-on experience in distributed computing frameworks and Blockchain technologies</li><li>Team player with excellent communication abilities</li><li>Passionate about keeping an update on the latest technology / system trends</li><li>Ability to maintain positive working relationships with a network of technical peers, business partners and customers</li><li>Demonstrated ability to use sound judgment and make good technical and business decisions</li>\n</ul>\n\n<div></div><div>Conduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the \"Submit\" button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first: click here to access or download the form.</div></div>\n<br>"}