{"job title": "Data Scientist - Data Analytics, Machine Learning and Statistical Modeling", "company": "Conduent", "city state": "– Morrisville, NC", "rating": "2.5", "job description": "<div><div>Description</div>\n<br>\nConduent is the world's largest provider of diversified business process services with leading capabilities in transaction processing, automation, analytics and constituent experience. We work with both government and commercial customers in assisting them to deliver quality services to the people they serve.\n<br><br>\nWe manage interactions with patients and the insured for a significant portion of the U.S. healthcare industry. We are the customer interface for large segments of the technology industry and the operational and processing partner of choice for public transportation systems around the world.\n<br><br>\nWhether it's digital payments, claims processing, benefit administration, automated tolling, customer care or distributed learning - Conduent manages and modernizes these interactions to create value for both our clients and their constituents. Learn more atwww.conduent.com.\n<br><br>\nPosition Description: Data Scientist - Data Analytics, Machine Learning and Statistical Modeling\n<br><br>\nConduent Labs works closely with Conduent business groups to addresses real world challenges such as the rising cost of healthcare, mobility in urban society and payment card fraud in financial welfare programs, using the power of Data Analytics. We adopt a multidisciplinary approach that combines techniques from diverse domains such as data mining and machine learning, statistical modeling, simuation, optimization and multimedia analysis, and use big data technologies to consolidate and analyze volumes of data from multiple sources in a scalable manner. Our work is guided by insights from ethnographic analysis and deep domain knowledge from both in-house and external experts.\n<br>\nAs a result, our business partners and clients gain state-of-the-art solutions that enable data-driven discovery and decision making, drive operational efficiency, and deliver personalized user experiences in areas such as transportation, healthcare and government services.\n<br><br>\nWe are looking for data scientists to work on machine learning, data mining, and statistical modeling for predictive and prescriptive enterprise analytics. Successful candidates will be expected to investigate state of the art techniques\n<br>\nin advanced machine learning and statistical modeling, and design, develop, and deploy state-of-art, scalable systems for innovative analytics applications in a set of industrial verticals (e.g. healthcare, transportation, customer care etc.). Applicants will be expected to work with a diverse set of data sources, such as time series data, spatial, graph data, semi-structured and unstructured data, and build statistical/machine-learning models in support of on-demand, real-time analytic services. The applicant should also have strong skills in explaining and interpreting the analytic models and outcomes in both research and application contexts.\n<br><br>\n<strong><u>Responsibilities:</u>\n<br><br>\n</strong>\n\n<ul>\n<li><div>Research, design and prototype novel models based on machine learning, data mining, and statistical modeling in order to solve hard analytics problems, where the problems may range from exploratory to highly applied</div>\n</li>\n<li><div>Keep abreast of the latest developments in the field by continuous learning and proactively champion promising new methods relevant to the problems at hand</div>\n</li>\n<li><div>Collaborate with university partners and other scientists and engineers in a multidisciplinary work environment</div>\n</li>\n<li><div>Work with existing intrapreneurship and business teams to develop and help commercialize robust models</div>\n</li>\n\n</ul>\n\n<strong><u>Qualifications:</u>\n<br><br>\n</strong>\n\n<ul>\n<li><div>Doctorate Degree or Masters Degree with an equivalent combination of education and work experience</div>\n</li>\n<li><div>LSS / DfLSS Certification or in process of attaining <u>is preferred</u></div>\n</li>\n<li><div>Demonstrated analytical and data modeling capability</div>\n</li>\n<li><div>Sustained performance exceeding standards</div>\n</li>\n<li><div>Demonstrated ability to regularly represent scientific findings and results to the scientific community (conferences, journals)</div>\n</li>\n<li><div>Demonstrated role model behavior on teams and as a team leader</div>\n</li>\n<li><div>Ability to effectively communicate with &amp; influence business leaders</div>\n</li>\n<li><div>Ability to absorb complex technical information and communicate effectively to both technical and non-technical audiences</div>\n</li>\n<li><div>Ability to establish and maintain a strong scientific network externally with academia or external organizations</div>\n</li>\n<li><div>Ability to maintain positive working relationships with a network of technical peers, business partners and customers</div>\n</li>\n<li><div>Demonstrated ability to influence, negotiate and manage objections effectively</div>\n</li>\n<li><div>Demonstrated ability to use sound judgment and make good technical and business decisions</div>\n</li>\n\n</ul>\n\nConduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the \"Submit\" button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first:<br>\n<strong>click here to access or download the form</strong><strong>.</strong></div>\n\n<br>"}