{"job title": "Senior Data Scientist: Data Analytics / Machine Learning", "company": "Conduent", "city state": "– Morrisville, NC", "rating": "2.5", "job description": "<div><div>Description</div>\n<br>\n Employer is the world's largest provider of diversified business process services with leading capabilities in transaction processing, automation, analytics and constituent experience. We work with both government and commercial customers in assisting them to deliver quality services to the people they serve.\n<br><br>\nWe manage interactions with patients and the insured for a significant portion of the U.S. healthcare industry. We are the customer interface for large segments of the technology industry and the operational and processing partner of choice for public transportation systems around the world.\n<br><br>\nWhether it's digital payments, claims processing, benefit administration, automated tolling, customer care or distributed learning Employer manages and modernizes these interactions to create value for both our clients and their constituents. Learn more at www.conduent.com.\n<br><br>\nIf you meet the requirements of this position and want to work for a world-class company with a great marketplace reputation, apply today.\n<br><br>\n<strong>Title:</strong> Senior Data Scientist: Data Analytics / Machine Learning\n<br>\n<div></div><div><strong>Position Overview:</strong></div> Do you want to uncover hidden insights from data and use those to drive decisions and influence behavior to create business value for our clients? If so, the Analytics Practice within the Employer Technology innovation (CTI) organization has an exciting opportunity for you. The CTI Analytics team works closely with Employer business groups to address real world challenges such as the rising cost of healthcare, mobility in urban society and payment card fraud in financial welfare programs, using the power of Data Analytics. We adopt a multidisciplinary approach that combines techniques from diverse domains such as data mining and machine learning, statistical modeling, simulation, optimization and multimedia analysis, and use big data technologies to consolidate and analyze volumes of data from multiple sources in a scalable manner.\n<br>\nWe are looking for senior data scientists to work on machine learning, data mining, and statistical modeling for predictive and prescriptive enterprise analytics. Successful candidates will be expected to investigate state of the art techniques in advanced machine learning and statistical modeling, and design, develop, and deploy state-of-art, scalable systems for innovative analytics applications in a set of industrial verticals (e.g. healthcare, transportation, customer care etc.). Applicants will be expected to work with a diverse set of data sources, such as time series data, spatial, graph data, semi-structured and unstructured data, and build statistical/machine-learning models in support of on-demand, real-time analytic services. The applicant should also have strong skills in explaining and interpreting the analytic models and outcomes in both research and application contexts.\n<br>\n<div><strong>Responsibilities</strong></div>\n\n<ul>\n<li>Research, design and prototype robust and scalable models based on machine learning, data mining, and statistical modeling to answer key business problems</li><li>Build tools and support structures needed to analyze data, perform elements of data cleaning, feature selection and feature engineering and organize experiments in conjunction with best practices</li><li>Work with development teams &amp; business groups to ensure models can be implemented as part of a delivered solution replicable across many clients</li><li>Present findings to stakeholders to drive improvements and solutions from concept through to delivery</li><li>Keep abreast of the latest developments in the field by continuous learning and proactively champion promising new methods relevant to the problems at hand</li><li>Collaborate closely with university partners and other scientists and engineers in a multidisciplinary work environment</li>\n</ul>\n\n<div><strong>Preferred Qualifications</strong></div>\n\n<ul>\n<li>PhD in computer science, computer engineering or MS with 5+ years of experience in related field.</li><li>Demonstrated history of driving and delivering analytics models and solutions</li><li>Deep knowledge of fundamentals of machine learning, data mining and statistical predictive modeling, and extensive experience applying these methods to real world problems</li><li>Strong skills in software prototyping and engineering with expertise in applicable programming and analytics languages (Python, R, C/C++) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations of their work</li><li>Desired interdisciplinary skills include big data technologies, ETL, statistics and causal inference, Deep Learning, modeling and simulation</li><li>Breadth of skills and experience in machine learning diverse types of data, diverse data sources, different types of learning models, diverse learning settings</li><li>Ability and inclination to work in multi-disciplinary environments, and desire to see ideas realized in practice</li><li>Experience and knowledge in services domains such as business process outsourcing systems, transportation systems, healthcare systems and financial services is valued</li><li>Demonstrated ability to propose novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context</li><li>Strong analytical, written, and verbal communication skills</li>\n</ul>\n\nEmployer is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply for or compete for employment with Employer may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the Submit button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first: click here to access or download the form.</div>\n\n<br>"}