{"job title": "Natural Language Processing Scientist", "company": "Conduent", "city state": "– Morrisville, NC", "rating": "2.5", "job description": "<div><div>Description<br></div> Conduent is the world's largest provider of diversified business process services with leading capabilities in transaction processing, automation, analytics and constituent experience. We work with both government and commercial customers in assisting them to deliver quality services to the people they serve. \n<br><br> We manage interactions with patients and the insured for a significant portion of the U.S. healthcare industry. We are the customer interface for large segments of the technology industry and the operational and processing partner of choice for public transportation systems around the world. <br><br> Whether it's digital payments, claims processing, benefit administration, automated tolling, customer care or distributed learning - Conduent manages and modernizes these interactions to create value for both our clients and their constituents. Learn more atwww.conduent.com.<br><b></b><br><b>POSITION DESCRIPTION:</b><br> Natural Language Processing Research Scientist<br><br><br><br>Were seeking Research Scientists in the area of Natural Language Processing who want to apply their skills to work at the leading edge of automation in industries such as customer care, healthcare, social media, and legal and compliance solutions, want to make their innovations real. We work on problems which are at the intersection of natural language processing, machine learning, and graph analytics. We apply deep learning, transfer learning, graph modelling, and computational linguistic techniques to novel domains. We are looking for skilled, dedicated teammates who believes their contributions can make the world more productive and a better place to live.<br><br><br><br>As a member of Conduent Technology Innovation, The Natural Language Processing Scientist will work with other researchers to explore, innovate and advance the fields of artificial intelligence, machine learning, deep learning, and natural language processing across the multiple industries that Conduent serves. Together the team will develop robust prototypes leading to new product offerings for our customers.<br><br><br><br>The Natural Language Processing research scientist will be part of innovative projects where natural language processing analytics will lead to increased efficiencies in businesses where Conduent operates.<br><br>They will apply machine learning and other techniques to design and prototype intelligent, real-world applications that intelligently extract understanding from text and/or audio sources.<br><br>They will keep abreast of the latest developments in the field by participating in conferences and other venues and can champion promising, new methods to explore.<br><br>They will proactively identify new areas of research and in partnership with business groups develop value-based proposals for investment.<br><br>Individuals will work with Intrapreneurial business teams to develop and commercialize user-centric, adaptive and robust systems.<br><br><u><br></u><br><b><u>Qualifications:</u></b><b></b><br><ul><li>MS with 3 years experience or Ph.D. in Computer Science, Computation Linguistics or a related field.<br><br></li><li>Experience with one or more of Natural Language Processing, Artificial Intelligence, Machine Learning or Deep Learning through research projects, internships, and/or thesis research.<br><br></li><li>Must be a self-driven problem solver, capable of implementing novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context and demonstrated experience of working with teams to solve problems.<br><br></li><li>The applicant should also have strong skills in software prototyping and engineering with expertise in applicable programming and analytics languages and frameworks (Matlab, Python, R, TensorFlow) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations.<br><br></li><li>Experience and knowledge in services domains such as business process outsourcing systems, transportation systems, healthcare systems and financial services<u>is valued.</u><br><br></li><li>Interdisciplinary skills: big data analytics, modeling and simulation, systems design and prototyping.<br><br></li><li>Strong analytical, written, and verbal communication skills.<br><br><br></li><li>Must be an out-of-the-box problem solver, capable of proposing novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context.<br><br></li></ul><b></b><br>Conduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the \"Submit\" button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first:click here to access or download the form.<br><br></div>"}