{"job title": "Data Scientist w Hadoop - Big Data", "company": "Connections IT Services", "city state": "– Durham, North Carolina", "rating": "4.0", "job description": "At Connections IT Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company's growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for Connections IT Services and for the people who work here.<br>\n<br>\n<strong><em>No Agency or 3rd Party</em></strong><br>\n<strong><em>Sponsorship is Available</em></strong><br>\n<br>\n<strong>Position ID: cITs1305</strong><br>\n<strong>Location: Durham, NC 27705</strong><br>\n<strong>Duration: 15 MTHS</strong><br>\n<br>\n \n<div><strong>Title: </strong>Data Scientist - Big Data<br>\n<br>\n<strong><u>Day to Day job Duties: </u></strong>(what this person will do on a daily/weekly basis) </div>\n\n<ul>\n\t<li>Evaluate trends, characterize factors, develop predictive models, and identify optimization opportunities.</li>\n\t<li>Provide accurate, timely, relevant and quality analysis that translate data into sound organizational decisions.</li>\n\t<li>Research, design and prototype robust and scalable models based on machine learning, data mining, and statistical modeling to answer key business problems.</li>\n\t<li>Build tools and support structures needed to analyze data, perform elements of data cleaning, feature selection and feature engineering and organize experiments in conjunction with best practices.</li>\n\t<li>Work with development teams &amp; business groups to ensure models can be implemented as part of a delivered solution replicable across many clients.</li>\n\t<li>Present findings to stakeholders to drive improvements and solutions from concept through to delivery. </li>\n</ul>\n<u><strong>Basic Qualifications:</strong></u> (what are the skills required to this job with minimum years of experience on each) \n\n<ul>\n\t<li>Data Scientist with Hadoop: 3-5 years</li>\n\t<li>Strong skills in software prototyping and engineering with expertise in applicable programming and analytics languages (Python, R, C/C++) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations of their work</li>\n\t<li>SQL programming skills</li>\n\t<li>Experience with design and implementation of analytic models and methodologies for new applications.</li>\n\t<li>Experience with data visualization tools (e.g. Tableau)</li>\n\t<li>Experience with large and complex data sets</li>\n\t<li>Demonstrated ability to propose novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context</li>\n\t<li>Strong analytical, written, and verbal communication skills </li>\n</ul>\n<strong><u>Travel:</u></strong> \n\n<ul>\n\t<li>Need Locals</li>\n</ul>\n<strong><u>Degree:</u></strong>\n\n<ul>\n\t<li>Bachelors in Computer Science or equivalent work experience </li>\n</ul>\n<u><strong>Desirable Skills / Experience:</strong></u>\n\n<ul>\n\t<li>PhD in computer science, computer engineering or MS with 3+ years of experience in related field.</li>\n\t<li>Deep knowledge of fundamentals of machine learning, data mining and statistical predictive modeling, and extensive experience applying these methods to real world problems</li>\n\t<li>Desired interdisciplinary skills include big data technologies, ETL, statistics and causal inference, Deep Learning, modeling and simulation</li>\n\t<li>Breadth of skills and experience in machine learning - diverse types of data, diverse data sources, different types of learning models, diverse learning settings</li>\n\t<li>Experience in Healthcare domain</li>\n</ul>"}