{"job title": "Data Scientist", "company": "ConnectYourCare", "city state": "– Hunt Valley, MD", "rating": "3.1", "job description": "<div><div><div>The Data Scientist will join our team as an experienced professional leading key initiatives surrounding data quality, analysis and modeling. As part of our overall reporting and analytics initiatives, the Data Scientist will play a hands on role in working collaboratively with technical and business stakeholders to develop meaningful insights that drive decision making capabilities and promote high value outcomes to our business and our clients. The ideal candidate will have a strong background in data engineering and warehousing in addition to required experience in cleansing, manipulating and modeling in big data environments. Industry experience in finance, healthcare or benefits is preferred.\n<br><br>\n<strong>ESSENTIAL FUNCTIONS:</strong>\n\n\n<ul>\n<li>Develop / enhance data processing and cleansing mechanisms to ensure high quality and accurate information outputs</li>\n<li>Develop strong understanding of business domain to ensure models, visualizations and other related reporting is relevant and meaningful</li>\n<li>Performing adhoc and self-driven analysis given minimal parameters</li>\n<li>Collaboratively drive definition of needed business insights amongst internal and external stakeholders through interviews, requirements collection and personal analysis of environment</li>\n<li>Develop reports, dashboards and other visualizations</li>\n<li>Work with data experts to drive data warehouse elaboration or use of real time data structures to create analysis packages</li>\n<li>Extend data domains to ensure “big picture” results are achieved while optimizing data structures to support analytical usage requirements</li>\n<li>Provide directive insights that drive corporate and client engagement / outcomes based on analytics findings</li>\n<li>Develop best practices for data and reporting standards, including but not limited to data dictionary, SLA definitions and overall standardized look and feel</li></ul></div>\n\n<strong>Requirements</strong>\n<br>\n<strong>MINIMUM QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>4 year degree in relevant field or equivalent professional experience</li>\n<li>5+ years of hands on experience working with large/complex data sets, data warehouses, data aggregation and reporting/analysis toolsets</li>\n<li>Proven experience using industry relevant toolkits and languages (R, Python, SAS, Scala, Java, etc.)</li>\n<li>Expert experience using SQL and familiarity with a variety of database systems</li>\n<li>AWS technology stack experience preferred</li>\n</ul>\n\n<strong>REQUIRED SKILLS:</strong>\n\n\n<ul>\n<li>Detail oriented and very strong analytical skills</li>\n<li>Strong communication, inter-personal and relationship-building skills</li>\n<li>Must be able to take analysis and present them in a well-crafted manner that articulates a story</li>\n<li>Demonstrated ability to foster rapport in a professional manner</li>\n<li>Strong process, organizational and time management skills</li>\n<li>Proven ability to manage and drive to detailed requirements given loosely defined parameters</li>\n<li>Competency in performing multiple functional tasks simultaneously</li>\n<li>Effective working independently as well as collaboratively</li></ul></div>\n\nAdditional Info\n<br>\nWe are an equal opportunity and affirmative action employer. Applicants are considered for positions without regard to veteran status, uniformed service member status, race, color, religion, sex, national origin, age, physical or mental disability, genetic information or any other category protected by applicable federal, state, or local laws. We are committed to taking affirmative steps to employ and advance qualified women, minorities, veterans, and individuals with disabilities.</div>"}