{"job title": "Senior Data Scientist - Product", "company": "Constant Contact", "city state": "– Waltham, MA (US)", "rating": "3.5", "job description": "Constant Contact, Inc. helps small businesses and nonprofits connect with their customers, clients, and members. Constant Contact® champions the needs of small organizations and provides an easy, affordable way to build successful, lasting customer relationships. Our customers get real results through email newsletters, surveys, events, Facebook promotions, online listings, and more.\n<br><br>\nDo you thrive in a fast-paced, analytical environment where innovation, excellence and creating actionable insight are not just catch-phrases but steeped in the company’s culture? We seek an analyst with a strong intellect, even stronger curiosity, and an experienced problem solver who can drive business value by proactively recognizing needs, connecting the dots, and turning it into actionable insights and recommendations.\n<br><br>\nWorking across nearly all parts of Constant Contact, leveraging customer, behavioral and “Big Data,” the Senior Data Scientist on the product team will be on a journey to develop a deep understanding of our customers across all aspects of their lifecycle. We leverage this insight to bring in more customers, more revenue, and drive customer success and engagement through in product recommendations.\n<br><br>\nThe Senior Data Scientist will be a key member of the product team, serving as subject matter expert and energized by tackling big challenges in a complex business environment. You will not only dive deep to find the answers, but craft meaningful and articulate recommendations that can be discussed and acted upon with your peers. This person will contribute to our product strategy by designing and developing models that can be productized to give customers insights and recommendations to achieve their business results.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Collaborate with Product Marketing, Product Management, Data Management Platform, UX, and Engineering groups to research, define, and execute a data-driven product roadmap</li>\n<li>Partnering with data infrastructure teams and other key internal engineering teams to understand the gaps within existing tools and services, and identify the best path forward</li>\n<li>Conduct analysis of prospects and customers for product design, go-to-market strategies and retention engagement efforts</li>\n<li>Develop data inquiries, and conduct data exploration and data mining to determine program effectiveness and predict future performance</li>\n<li>Develop and implement test designs that serve as champion and challenger for marketing programs</li>\n<li>Develop and analyze optimal testing strategies</li>\n<li>Analyze customer segments to drive growth</li>\n<li>Partner closely with stakeholders to ensure insights are leading to action and measuring the business impact</li>\n</ul>\n<strong>Skills and Experience:</strong>\n\n<ul>\n<li>The ideal candidate has past experience using data science / analytical research in a cloud environment to advance product development or product insights</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>Strong experience with SQL and Tableau or other BI tools.</li>\n<li>Experience developing data visualizations to enable data exploration.</li>\n<li>Experience developing scalable and automated data pipelines</li>\n<li>Machine learning experience in Python and/or R</li>\n<li>Experience with one or more cloud environments (AWS, Google Cloud Platform, Azure or other platforms)</li>\n<li>Practical knowledge applying analytical techniques such as time series regression, decision trees, segmentation, clustering, response modeling and factor analysis to real-world data.</li>\n<li>Curious, self-motivated thinker; always asks why and drives until the answer is clear.</li>\n<li>Strong communicator with demonstrated experiencing translating analytic findings to business insights and influencing business stakeholders to drive action and improved business performance.</li>\n<li>Strong project management and cross-functional collaboration skills required.</li>\n<li>Master’s Degree or higher in Statistics, Applied Mathematics, Economics, Computer Science or equivalent experience.</li>\n</ul>"}