{"job title": "Data Scientist", "company": "Consulting Services Group", "city state": "– VA", "rating": "5.0", "job description": "Consulting Services Group, LLC (www.csg-llcusa.com)<br><br>Consulting Services Group (CSG) is a niche provider of intelligence related support services. Our team of seasoned professionals has vast experience in the Intelligence Community and DOD experience, with subject matter expertise in the areas of Technical/IT Services, Operations and Maintenance, Knowledge Management, Language Services, and Intelligence Services (IMINT,FMV, GEOINT, MASINT, HUMINT, All Source, Counter Intelligence, Counter Threat Finance, and SME for Intelligence Analysis Technologies.<br><br>Clearance Requirement:<br><br>Active TS/SCI clearance with a polygraph is required.<br><br>Benefits:<br><br>Salary<br><br>We offer competitive compensation packages with plenty of opportunity for advancement. <br>Health Insurance<br>CSG will pay 100% of the employee’s health insurance. Family insurance options are available through payroll deduction. We offer comprehensive medical, prescription drug, (Anthem/ Blue Cross/Blue Shield) dental, (Delta Dental) and vision (Blue View Vision); life insurance (one year salary up to $200,000), DBA (for OCONUS employees), and short and long term disability. <br><br>401K Program<br><br>CSG has partnered with ADP Retirement Services to offer employees a robust 401(K) program. Employees are eligible to participate in the program through pre-tax deductions after their first paycheck. The company will match 25% of the first 4% of employee contribution. <br><br>Data Scientist Chantilly, Reston Virginia<br><br><br><br>The Sponsor requires the support of a data scientist to support a prototype and R&amp;D effort. This position specializes in collecting, creating, cleansing, correlating, analyzing, and storing data. They will be responsible for integrating and cleansing data from multiple sources to make sure that this data is accurate and valuable to the mission analyst. Data is regularly correlated, curated, and integrated with other data sets and used in data visualizations. The specialist will use problem-solving and analytical skills because they must often resolve issues quickly during prototype iterations. They will use interpersonal and communication skills in order to be able to work well with team members, vendors and the prototype team. They will understand and explain complex technical topics with non-technical users. They are also expected to understand the data output of multiple analytic tools and how they can be integrated for more complete solutions.<br><br><br>This effort will span many components and include a variety of activities, including:<br><br><br>• Collect, track, and integrate multiple sources of data<br><br>• Design, develop, test and deploy in our AWS architecture<br><br><br>• Test specific functionality and capability of multiple analytic software tools and algorithms.<br><br><br>• Work in a fast-paced multidisciplinary environment as in a competitive landscape where new data keeps flowing in rapidly<br><br><br>• Query databases and perform statistical analysis<br><br><br>• Develop or program databases<br><br><br>• Create examples, prototypes and demonstrations<br><br><br>• Understand design and architecture principles<br><br><br>• Analyze stakeholder needs and creating recommendations on tools and data that may meet their needs<br><br><br>• Work in a team environment; working hand in hand with the Program Manager, Strategic Director other members of the project team, etc. to analyze feasibility of requirements, propose workable solutions, and work towards a successful project outcome<br><br><br>• Use interpersonal and communications skills This resource shall also be called upon to do outreach and information gathering among external academic or commercial partners, in various settings, in support of the mission.<br><br> <br><br>Consulting Services Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, or genetics.<br><br>For additional information about Consulting Services Group or the position, please email Dave at dbriggs@csg-llcusa.com."}