{"job title": "Data Scientist", "company": "ConsenSys", "city state": "– Brooklyn", "rating": "4.6", "job description": "ConsenSys is a venture production studio focused on building and scaling tools and enterprise software products powered by Ethereum. Our mission is to use these solutions to power the emerging economic, social, and political operating systems of the planet.\n<br><br>\nOur teams are busy at work building the future of identity, financial markets, commerce, security and infrastructure, and more. If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.\n<br><br>\n<strong>About the Bounties Network:</strong>\n<br><br>\nBounties have existed for thousands of years as a tool to incentivize the completion of tasks; now the Bounties Network creates an open standard to manage bounties on all tasks, paying in any Ethereum token. We’re working to make it cheaper and easier to outsource work to the free market, so organizations can organize dynamically around what needs to get done. Visit https://bounties.network for more details.\n<br><br>\n<strong>About the Role</strong>\n<br><br>\nDevelopers at the Bounties Network will focus on building quickly, continuously iterating and shipping new updates. Developers at the Bounties Network should be passionate about bringing blockchain applications to the tourist users— the mainstream. On the Bounties Network team, you’ll enjoy an inclusive and open culture, centred around constantly exchanging positive and negative feedback. We are always iterating and improving our work, our culture, and ourselves. As a Data Scientist at the Bounties Network, you’ll help architect the off-chain systems needed to create meaningful on-chain experiences.\n<br><br>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>* Familiarity with continuous integration and deployment</li>\n<li>* Basic knowledge of relational and non-relational data stores like Postgres, MySQL, MongoDB, etc.</li>\n<li>* Experience programming with Python (SKLearn, Scipy, Numpy), R</li>\n<li>* Must be able to work autonomously and be self-motivated</li></ul>"}