{"job title": "Principal Data Engineer", "company": "ConsumerTrack", "city state": "– El Segundo, CA", "rating": "3.9", "job description": "ConsumerTrack is unique in the digital marketing and media industry - we combine marketing, digital, content and fintech. Our performance based approach increases brand awareness and generates targeted audience engagement on our internal web properties and partner sites.\n<br><br>\nLearn More About What We Do\n<br><br>\nConsumerTrack has big growth plans ahead and is looking for a Rockstar Data Engineer experienced in Python, AWS and Data Integration technologies to join our Data Engineering team. The CTI Data Engineering team is responsible for designing and developing the Enterprise Data Platform including a Serverless Data Lake and Data Warehouse, core application pipelines, reporting solutions, machine learning and predictive analytics. If you are a critical thinker with a solid track record of developing data solutions and solving complex problems, we want you to join our team! You will play a vital role in designing and developing our next generation data pipelines and data platform. Join the team and prototype new internal and external data product ideas and concepts!\n\n\n<ul>\n<li>Build and maintain multiple data pipelines to ingest new data sources (APIs, Files, Streaming, Databases, Email, etc.) and support products used by both external users and internal teams</li>\n<li>Optimize infrastructure and pipelines by building DataOps tools to evaluate and automatically monitor data quality, auto-scale serverless infrastructure, and develop data driven pipelines</li>\n<li>Work with our data science and product management teams to design, rapidly prototype, and productize new internal and external data product ideas and capabilities</li>\n<li>Work with the data engineering team to migrate and enhance our existing Pentaho-based ETL pipeline to a new Python-based system and develop a serverless cloud data lake to augment our existing Snowflake Data Warehouse</li>\n<li>Conquer complex problems by finding new ways to solve with simple, efficient approaches with focus on reliability, scalability, quality and cost of our platforms</li>\n<li>Build processes supporting data transformation, data structures metadata, and workload management</li>\n<li>Collaborate with the team to perform root cause analysis and audit internal and external data and processes to help answer specific business questions</li>\n<li>Provide technical leadership to evangelize, build and implement data and big data solutions</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Bachelor's degree in Computer Science or related field of study</li>\n<li>7+ years of professional data engineering experience</li>\n<li>Strong SQL and Python skills including knowledge of Python libraries / frameworks</li>\n<li>Comfortable working directly with data analytics to bridge business requirements with data engineering</li>\n<li>Experience with AWS tools including EMR/Athena, S3, Kinesis, API Gateway, LAMBDA, Athena, etc.</li>\n<li>Excellent troubleshooting and problem-solving skills</li>\n<li>Experience with workflow management tools (Airflow, Oozie, Azkaban, Luigi, etc.)</li>\n<li>Ability to operate in an agile, entrepreneurial start-up environment, and prioritize</li>\n<li>Excellent communication and teamwork, and a passion to learn</li>\n<li>Experience with Data Integration Technologies (Pentaho, Talend, Informatica, Glue, etc.)</li>\n<li>Experience with Snowflake, Redshift or other MPP databases is a plus</li>\n<li>Familiarity with distributed computing platforms (e.g. Hadoop, Spark, Storm)</li>\n</ul>\n\n<strong>Benefits</strong>\n\n\n<ul>\n<li>Competitive salary with excellent growth opportunity; we pride ourselves in having a team that exudes leadership, high initiative, creativity, and passion.</li>\n<li>Awesome medical, dental and vision plans with heavy employer contribution.</li>\n<li>Paid vacation, holidays, and sick days.</li>\n<li>401k- We match 3% of employee's salary after the first year of employment.</li>\n<li>In-office gym and weekly fitness and yoga classes.</li>\n<li>Fully stocked kitchen with snacks and beverages.</li>\n</ul>\n\n<strong>LOCAL LOS ANGELES COUNTY CANDIDATES ONLY!</strong>\n<br><br>\nNO REMOTE WORK- we want you to be a part of our elite team!\n<br><br>\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}