{"job title": "Data Scientist - Summer Internship", "company": "Contact Energy", "city state": "– Wellington", "rating": "3.1", "job description": "<div><div><strong>\n<br>\nData Scientist - Summer Internship</strong><br>\n\n<div>\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nWellington</strong>\n</div><br>\n\n<div>\nJob Number\n<br><br>\n<strong>6473</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div>A great summer internship opportunity has become available as a Data Scientist from November 2018 until February 2019.\n<br><br>\n<strong>Context of the role</strong>\n<br><br>\nWorking in the Data Management team, you’ll be part of the high-performing, fast-paced Trading team that Contact depends on to maximise the value of the business by buying and selling energy in NZ’s energy markets. You’ll be expected to play a key part in that. You’ll be working amongst a truly inclusive group of some of some great analytical minds. It’s a great place to learn, share and contribute to New Zealand’s low carbon future.\n<br><br>\n<strong>What you’ll do</strong>\n<br><br>\nYou’ll be key in helping us discover the information hidden in the vast amounts of data we have. You will help us make smarter decisions to deliver even better outcomes. Your primary focus will be in applying data mining techniques, doing statistical analysis, and building high quality prediction models.\n<br><br>\n<strong>How you’ll be successful</strong>\n<br><br>\nYou’re at your best when you’re working with data. You’re a master problem solver that seeks root causes and develops and implements practical and timely solutions. You’re comfortable to experiment with new approaches and improve productivity through trial and error. You’re skilled at turning technical-laden jargon into easy to understand, tangible outcomes without sacrificing the detail.\n<br><br>\n<strong>The type of experience you’ll bring to the role</strong>\n\n<ul>\n\n<li>Familiarity with Python and C++.</li>\n\n\n\n<li>Exposure to SAP and familiarity with the tools within.</li>\n\n\n\n<li>Some experience with data visualisation tools e.g. Tableau, QlikView, Spotfire.</li>\n\n\n\n</ul>\n<em><strong>Applications close 5pm, Friday 14th September 2018.</strong></em>\n<br><br>\nHelp us put our energy where it matters. You can either apply online or for more information contact Jenny Macdonald on 04 462 1163 or email resourcingteam@contactenergy.co.nz.</div>"}