{"job title": "Principal Data Scientist, Cyber-Security", "company": "Contingent Network Services", "city state": "– Reston, VA", "rating": "3.5", "job description": "Principal Data Scientist, Cyber-Security\n Moorestown, NJ\n\n <ul>\n\n <li><strong>Requisition #:</strong> 185882</li> <li><strong>Job Type:</strong> Full Time</li> <li><strong>Location:</strong> Moorestown, NJ</li> <li><strong>Other Locations:</strong> Reston, VA, Sunnyvale, CA, Schaumburg, IL, Philadelphia, PA, Greenwood Village, CO</li> <li><strong>Team:</strong> Other, Technology</li> <li><strong>Pub Date:</strong> 9/17/18</li> \n\n </ul>\n\n <div></div>\n\n <p></p><p>Summary:</p><p></p><p>Comcast Technology and Product Security (TPS) is the core Cybersecurity team at Comcast. TPS is composed of a team of dynamic security professionals working to provide protection for one of the world's largest, growing networks. At Comcast, security isn't simply about defending our network and systems, it's about innovating and transforming the Cybersecurity tools and products across our company. Ready to make a difference? Make yourself at home with us!</p><p>Broadly regarded as innovators and thought leaders, our executive team has served in key roles, on the boards of national and community-based organizations, and in a number of Federal and Legislative initiatives. We have spent decades investing in the technology and information security capabilities that help us protect and defend our company; we have developed solutions that are practical today and scalable for tomorrow; and we have created collaborative teams dedicated to innovation across each of our businesses to share our best thinking. The world will never be the same. And neither should you.</p><p></p><p>The Principal Data Scientist on the Security Analytics Team is responsible for developing solutions to identify suspicious or malicious behaviors using internal system logs and entity data for the TPS Security organization. The engineer must provide technical expertise and leadership on designing and developing statistical/machine learning models to analyze multiple data sets in our big data environment. Emphasis of this position will be in developing and deploying a robust cyber-security threat detection models in both on premises and cloud environments.</p><p></p><p>Core Responsibilities:</p><p>-Responsible for designing, deploying, and maintaining mission critical security analytics solutions identify suspicious or malicious behaviors using internal system logs and entity data.<br>-Conduct literature searches on current techniques in threat detection, data mining, machine learning.<br>-Apply statistical, machine learning and big-data techniques to cybersecurity, specifically in anomaly detection, pattern recognition, behavior-based analysis, and correlation.<br>-Consult with and/or assist in data engineering for proven techniques, including design, development, and efficacy testing.<br>-Mentors junior and senior data scientists/engineers.</p><p></p><p>Required Experience:</p><p>-Ph. D. or Masters in Computer Science, Math, Statistics, or related quantitative discipline<br>-Must have 5+ years of experiences as a data scientist applying statistical, machine learning to cybersecurity or fraud detection<br>-Must have working knowledge on information/network security detection systems/tools, logging systems, network architecture, cloud infrastructure and threat intelligence.<br>-Must have working experience in big data environment including Apache Spark and Hadoop<br>-Demonstrated, extensive experience with designing and executing machine learning models and applications<br>-Experience with data visualization and programming languages, including Python/scikit-learn/matplotlib, R, Scala or Java<br>-Experience formulating and driving applied research projects from proof-of-concept through implementation<br>-Experience with manipulating data and ETL in parallel processing and distributed compute environments<br>-Excellent presentation and communication skills<br>-Creativity to go beyond current tools to deliver best solution to the problem</p><p></p><p>Job Specification:<br>- Bachelors Degree or Equivalent<br>- Computer Science, Engineering<br>- Generally requires 11+ years related experience</p><p></p>\n\n <p></p>\n\n <div><p></p><p>Comcast is anEOE/Veterans/Disabled/LGBT employerand all qualified applicants will receive consideration for employment without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex or any other legally protected category.</p></div>"}