{"job title": "Data Scientist", "company": "Convergence Consulting Group", "city state": "– Tampa, FL", "rating": "4.8", "job description": "Data Scientist\n<br>\n <div>Are you an analytics leader passionate about helping clients leverage their data to make better business decisions? Do you have data science knowledge and a strong ability to synthesize complex concepts and present them simply for a business audience? Are you interested in accelerating your skills and experience within the Advanced Analytics field?\n<br><br>\nConsider joining the ranks of talented and passionate CCGers who are inspired to deliver innovative solutions that bring a lasting impact to our clients and the community. It’s a rewarding opportunity to engage in a “work hard, play hard” culture with a company that has been recognized year over year as one of <em>Florida’s Best Places to Work</em>.\n<br><br>\nAs a Data Scientist<strong></strong>with CCG<strong><em>,</em></strong> you will have the opportunity to work closely with fellow CCGers to understand our client’s analytic needs and develop innovative solutions that enable the analytic capabilities that drive their business decision-making.\n<br><br>\n<strong>Required Skills &amp; Experience:</strong>\n<ul>\n<li>Experience applying statistics to business contexts. A strong candidate will have previously delivered a wide range of statistical applications covering use cases like business forecasting with autoregressive techniques, customer segmentation with clustering techniques, etc.,</li><li>Ability to build machine learning applications for both supervised and unsupervised learning use cases,</li><li>Mastery of at least one of the following Advanced Analytics toolsets: R, Python, Azure Machine Learning, Spark, Alteryx. Proficiency in two or more is preferred.</li><li>Bachelor’s Degree in MIS, Statistics, CIS, or Analytics,</li><li>Minimum of 5 years applying advanced analytics techniques in a business setting,</li><li>Strong mathematical skills, including linear algebra and differential equations,</li><li>Mastery of advanced SQL concepts,</li><li>Background in Statistics and/or Economics.</li>\n</ul>\n<strong>Preferred Skills &amp; Experience</strong>\n<ul>\n<li>Master’s Degree in Computational Statistics, Analytics, Economics, Mathematics, CIS, Artificial Intelligence,</li><li>Minimum of 2 years of experience delivering consulting or project-based work,</li><li>Deep domain expertise in at least one of the following industries: Retail, Health Care, Education Administration, Industrial Goods, Financial Services, Marketing, Professional Services, Telco, Food Service,</li><li>Familiarity with various neural network architectures and the common use cases to which they apply.</li>\n</ul>\n<strong>Additional Benefits</strong>\n<ul>\n<li>Exceptional compensation and benefits</li> <li>World class collaborative office space</li> <li>Opportunities for client travel and flexible work arrangements</li> <li>Company sponsored trips and events</li> <li>Continuous learning and professional development opportunities</li>\n</ul>\nMust be able to work in the USA without CCG or Client sponsorship</div>"}