{"job title": "Data Scientist", "company": "Conversion Logic", "city state": "– Los Angeles, CA", "rating": "5.0", "job description": "Our team is changing the way marketing decision makers understand their cross channel portfolio and with our <strong>advanced attribution platform</strong> (XC Logic) delivering actionable insights in real-time across all devices. By using our proprietary Ensemble Method and state-of-the-art machine learning, which enables us to break free of the one size fits all algorithm and create a truly unique dynamic predictive solution for our customers, marketers can identify clear understandable ways to achieve efficiency gains of 30-50%. And as an independent lean startup, Conversion Logic is untethered from any media entity influence.\n<br><br>\nChanging an industry is never a small task and requires team of exceptional people. Our Data Science team is seeking a <strong>Data Scientist</strong> to help them drive R&amp;D in advanced attribution modeling and analytical support to client service and engineering teams in client delivery and product development.\n<br><br>\n<strong>HOW YOU WILL HAVE AN IMPACT...</strong>\n\n<ul>\n\n\t\n<li>Research, develop, operate, and extend advanced marketing attribution models with Machine Learning algorithms to be deployed in production</li>\n\n\n\n<li>Collaborate closely with client services and engineering to deliver insights to clients on time</li>\n\n\n\n<li>Define and implement features to our marketing analytics products in Python</li>\n\n\n\n</ul>\n<strong>WHAT YOU WILL NEED...</strong>\n\n<ul>\n\n\t\n<li>Degree in Computer Science, Statistics, Mathematics, Physics, or Engineering</li>\n\n\n\n<li>Experience in predictive modeling with Machine Learning algorithms</li>\n\n\n\n<li>Understanding of probability, statistics, and linear algebra</li>\n\n\n\n<li>Solid coding skills in Python</li>\n\n\n\n<li>Excellent teamwork and communication ability</li>\n\n\n\n<li>Being passionate in Data Science, disciplined at work, and confident while being humble</li>\n\n\n\n</ul>\nSo if you like solving data, product or engineering puzzles. Are excited by great data visualization. If happy clients make your day. And want to work in a lean startup with brilliant people. Then Conversion Logic is your next company. Our culture is defined by smart people who like to solve difficult problems. We have an entrepreneurial swager, a warm work environment, and a close-knit team that loves to solve hard problems.\n<br><br>\n<strong>Conversion Logic is an EOE M/F/D/V</strong>"}