{"job title": "Data Scientist", "company": "Cook Medical", "city state": "– US-IN-Bloomington", "rating": "3.4", "job description": "Overview<br><br>The Data Scientist helps design and executes data analytic projects and initiatives across the organization. This position is responsible for turning data into critical information and insights, through the use of statistical, data mining, and data visualization techniques that lead to more informed decision-making and improvements in our business processes and operations.<br><br>Responsibilities<br><br>• Identify business requirements, understand expected outcomes, and generate hypotheses.\n<br><br>\n• Prepare project plans to align with business needs and objectives.\n<br><br>\n• Set project and task deadlines and communicates status updates.\n<br><br>\n• Extract, Transform, Load (ETL) on large, varied datasets.\n<br><br>\n• Design experiments, tests hypotheses, discovers patterns and relationships within data, and build statistical models.\n<br><br>\n• Ensure data integrity and model reliability by validating results and cleansing data.\n<br><br>\n• Prepare and delivers results in a way that is easily interpreted and actionable for end users.\n<br><br>\n• Assist in developing data analytics processes and procedures.\n<br><br>\n• Attend, present and provide data for meetings to include project updates and reviews.<br><br>Qualifications<br><br>•Minimum 3 years experience in developing simulation, optimization, and predictive models.\n<br><br>\n•Minimum 3 years experience using large datasets and using databases.\n<br><br>\n•Minimum Master's Degree in Computer Science or related areas\n<br><br>\n•Familiar with basic principles of distributed computing and/or distributed databases.\n<br><br>\n•Experience using large datasets and using databases.\n<br><br>\n•Visual Studio and Microsoft SQL Server Management Studio.\n<br><br>\n•Expertise in SQL and querying databases efficiently.\n<br><br>\n•Knowledgeable of Agile SCRUM methodolgy."}