{"job title": "Principal, Data Scientist", "company": "CoreLogic", "city state": "– Irving, Texas", "rating": "2.8", "job description": "The Principal, Data Scientist will design, develop, and deliver solutions that will enhance and add value to new and existing data assets for broad industry application, aligned with business and market requirements. You\\u0027ll develop algorithmic and rule-based models and analytic capabilities based on rules engine, machine learning, mathematical modeling, pattern recognition, and data mining techniques. Perform data analysis and modeling using a variety of analytic techniques, tools, and programming languages to provide business insight and product analytics.\n<br><br>\n<strong>Job Duties:</strong>\n\n<ul>\n<li>Create data derivation and linkage through algorithm and/or data rules.</li><li>Create and select predictive features from raw data.</li> <li>Create model reports for stakeholder review and model documentation.</li> <li>Perform pattern recognition model creation and training using various types of algorithms and machine learning modeling techniques for unknown or less well-defined - an unknown problem, solve new problems (e.g., clustering, logistic regression, neural networks, CART, support vector machines, boosting trees, supervised and unsupervised models).</li><li>Develop analytics tool using SQL, R, Python, Spark and other big data tools such as Jaspersoft BI Suite, Talend Open Studio, Skytree Server, Tableau, and Splunk.</li><li>Develop analytics solutions using traditional database technology such as SQL and big data technology such as Hadoop, MongoDB, Cassandra, Redis, Riak, CouchDB, and Neo4j, NoSQL databases.</li><li>Perform complex data analysis on large volumes of property and consumer data and present model performance to stakeholders.</li> <li>Provide data science and analytic support for the Enterprise Data Group (EDG), and interact with other EDG teams as well as other business units.</li> <li>QA and analyze large amounts of data to create appropriate data sets for model building.</li> <li>Prepare and maintain programs and documentation for analytic models.</li><li>Conduct defined quantitative and qualitative research projects independently and communicates research results to internal and external stakeholders.</li> <li>Act as a consultant to EDG's data management and data technology teams.</li>\n</ul>\n\n<strong>Auto req ID</strong>\n<br>\n<strong>11767BR</strong>\n<br><br>\n<strong>Position Type</strong> \n<br>\nFull Time\n<br><br>\n<strong>Posting Job Summary</strong>\n<br>\nJoin the team that powers the global real estate economy - CoreLogic is an innovative, future focused company whose vision is to deliver unique property-level insights that power the global real estate economy.\n<br>\nWe are a $1.95 billion in sales company with more than 6,000 employees globally serving the financial services and insurance industries. We are evolving at a rapid pace and the clients we serve are challenged from every direction, which means we are growing and innovating to help drive their success. Working together, and differentiated by our superior data, analytics and data-enabled solutions, we empower our clients to make smarter business decisions through data-driven insights. We take initiative, are fully accountable, build respect and trust, make transparency a must - and engage, include and collaborate at every turn.\n<br>\nWe take pride in our work and believe in cultivating a work environment that supports and values our greatest asset: our talented employees.\n<br><br>\n<strong>State/Region/Province</strong>\n<br>\n<strong>TX</strong>\n<br><br>\n<strong>% Travel Involved</strong>\n<br>\n<strong>10-25%</strong>\n<br><br>\n<strong>Posting Job Requirements</strong>\n<br>\n<strong>Education, Experience, Knowledge and Skills</strong>\n\n<ul>\n<li>Master's or higher in machine learning, a hard science, math, or an engineering field</li><li>Ability to thrive in a team environment and adapt to quickly changing priorities</li><li>5-8 years of directly related Data Science, Data Mining and Data Analysisexperience</li><li>Strong working knowledge in multiple analytic development tools, statistical tools, programming languages, and big data tools</li><li>Strong problem solving and analytical ability</li><li>Strong communication skills</li><li>Ability to quickly and efficiently adapt to new concepts.</li><li>Demonstrated knowledge of statistical techniques</li><li>Ability to work collaborative with cross-function teams and business units</li><li>Demonstrated general business acumen; experience working in a real estate and mortgage related data industry a plus</li>\n</ul>\n\nCoreLogic offers an empowered work environment that encourages creativity, initiative and professional growth and provides a competitive salary and benefits package. CoreLogic is an Equal Opportunity/Affirmative Action employer committed to attracting and retaining the best-qualified people available, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability or status as a veteran of the Armed Forces, or any other basis protected by federal, state or local law. CoreLogic maintains a Drug-Free Workplace. We are fully committed to employing a diverse workforce and creating an inclusive work environment that embraces everyone's unique contributions, experiences and values. Please apply on our website for consideration.\n<br><br>\n<strong>Category</strong>\n<br>\nData &amp; Analytics\n<br><br>\n<strong>City</strong>\n<br>\nIrving\n<br><br>\n<strong>Business Segment</strong>\n<br>\nCorporate Shared Services\n<br><br>\n<strong>Country</strong>\n<br>\nUnited States\n<br>"}