{"job title": "Sr. Advanced Data Analytics Engineer / Data Scientist", "company": "Corning", "city state": "– Corning, NY", "rating": "3.7", "job description": "Corning is one of the world’s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people’s lives.\n<br><br>\nCorning succeeds through sustained investment in R&amp;D, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.\n<br><br>\nCorning's Manufacturing, Technology and Engineering division (MTE) is recognized as the leader in engineering excellence &amp; innovative manufacturing technologies by providing diverse skills to Corning’s existing &amp; emerging businesses.\n<br><br>\nWe anticipate &amp; provide timely, valued, leading edge manufacturing technologies and engineering expertise. We partner with Corning’s businesses and the Science &amp; Technology division. Together we create and sustain Corning’s manufacturing as a differential advantage.\n<br><br>\n<strong>Scope of Position:</strong>\n<br><br>\nThe position of Sr. Advanced Data Analytics Engineer / Data Scientist is a unique opportunity to be a part of a growing team that is demonstrating value and driving business impact within Corning, Inc. We are increasing our application of advanced analytics and machine learning to our growing manufacturing capabilities. New manufacturing measurements and controls systems provide vast amounts of untapped process and product data.\n<br><br>\nYou will be responsible for transforming our data assets into strong internal insights that drive strategic solutions delivering large value impact. Your experience and abilities in analytics will make you a key member on multi-disciplined teams. The challenges are diverse as you will work across the many businesses that comprise Corning.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Day to Day Responsibilities:</strong>\n<br><br>\n• Perform exploratory and targeted data analysis using commercial and open source data analytic software packages\n<br><br>\n• Apply multivariate statistical methods and machine learning techniques for finding structure and value in both large and small data sets\n<br><br>\n• Leverage multivariate statistical methods and machine learning techniques to identify key process input variables that can feed process control solutions\n<br><br>\n• Development of predictive/classification models for use in production and possible applications\n<br><br>\n• Successfully understand the problems from the customer’s point of view in order to build and execute data analytic work plans\n<br><br>\n• Communicate technical analyses and results to division customers\n<br><br>\n• Write technical reports summarizing development, application, and validation of the technical analysis\n<br><br>\n&nbsp;\n<br><br>\n<strong>Travel Requirement:</strong>\n<br><br>\n• Travel requirements will vary. Typical travel is 5% - 25% domestic and international.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Required Education:</strong>\n<br><br>\nMS or PhD in Engineering, Computer Science, Statistics, Mathematics, Physics or other quantitative disciplines\n<br><br>\n&nbsp;\n<br><br>\n<strong>Range of Required Skills:</strong>\n<br><br>\n• 5+ years of experience applying multivariate statistical analysis algorithms including machine learning techniques for classification, regression, and clustering. Techniques for example, but not limited to decision trees, random forest, SVM, logistic regression, neural networks, k-means clustering, Bayesian models, etc.\n<br><br>\n• 5+ years of experience with a broad base of commercial and open source analysis and visualization tools (i.e. Matlab, Python, R, SAS JMP, Tableau)\n<br><br>\n• Demonstrated experience transitioning proof-of-concept analysis and models into deployed production applications\n<br><br>\n• Ability to show the relevance of the applied techniques in manufacturing\n<br><br>\n• Ability to prioritize work across multiple projects\n<br><br>\n• Strong attention to detail and exceptional organizational skills\n<br><br>\n• Ability to work collaboratively in a team environment across stages of innovations\n<br><br>\n• Ability to communicate the outcome of complex and/or technical concepts in a clear manner to a non-analytical group\n<br><br>\n• Ability to articulate and take on challenges specific to analyzing disparate data sources\n<br><br>\n&nbsp;\n<br><br>\n<strong>Range of Desired Skills:</strong>\n<br><br>\n• 5+ years of experience with relational databases and SQL environments.\n<br><br>\n• 5+ years of experience with ETL tools for the purpose of data extraction, data cleansing, and data manipulation\n<br><br>\n• 5+ years of experience with deep learning techniques (i.e. CNN, RNN) and software packages such as TensorFlow, CNTK, Keras, etc.\n<br><br>\n• 5+ years of Software development experience in C,C++, and/or C# • 5+ years of experience in measurement system analysis (MSA) techniques and design of experiments\n<br><br>\n• Familiarity with applying time series analysis (i.e. ARIMA, Fourier analysis) • Familiarity with software version control experience (i.e. git)\n<br><br>\n• Familiarity with big data ecosystem (Spark, Hadoop, HIVE, etc.)\n<br><br>\n• Familiarity with cloud based storage and compute environments (AWS, MS Azure)\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status."}