{"job title": "Quality Data Analyst", "company": "Corning", "city state": "– Tewksbury, MA", "rating": "3.7", "job description": "Corning is one of the world’s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people’s lives.\n<br><br>\nCorning succeeds through sustained investment in R&amp;D, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.\n<br><br>\nAs a leading developer, manufacturer, and global supplier of scientific laboratory products for 100 years, Corning’s Life Sciences segment collaborates with researchers seeking new approaches to increase efficiencies, reduce costs and compress timelines in the drug discovery process. Using unique expertise in the fields of materials science, surface science, optics, biochemistry and biology, the segment provides innovative solutions that improve productivity and enable breakthrough discoveries.\n<br><br>\n<strong>Scope of Position:</strong>\n<br><br>\nIn this role as the Quality Data Analyst, you will be responsible for supporting the Quality System Project Manager and Quality System Analyst with EtQ quality system software projects and ongoing maintenance.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Day to Day Responsibilities:</strong>\n<ul>\n<li>Support on EtQ Projects for Upgrades, Patch Installations and Design Changes to meet regulatory requirements and business needs.</li><li>Data Analysis, cleaning, loading and verification of data in EtQ.</li><li>Coordinate and work with sites to review data, investigate and resolve issues with data.</li><li>Work with multiple sites to coordinate data changes that impacts more than one site.</li><li>Train SMEs and End Users in EtQ.</li><li>Hold continuing education trainings with site SMEs.</li><li>Generate EtQ Test Scripts for Design Changes.</li><li>Execute Test Scripts and lead sites through Test Script Execution.</li><li>Investigate and troubleshoot user issues with EtQ.</li><li>Handle EtQ Troubleshooting guides and FAQs.</li><li>Development and Maintenance of tools used for Quality Metrics for all CLS Sites.</li><li>Ability to identify areas of improvement and raise areas of concerns with Metrics to Management.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Travel Requirements:</strong>\n<ul>\n<li>Up to 10% to assist with projects, training, etc.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Hours of work/work schedule/flex-time:</strong>\n<ul>\n<li>Monday – Friday, Flex start and end times.</li><li>Flex time available for 1/day per week to work remotely as project allows.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Required Education:</strong>\n<ul>\n<li>Bachelor’s Degree required.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Required Years and Area of Experience:</strong>\n<ul>\n<li>Minimum 1+ years of experience working with quality systems software.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Required Skills:</strong>\n<ul>\n<li>Proficiency in Microsoft Office.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Desired Experience / Qualifications / Skills:</strong>\n<ul>\n<li>Prefer experience within the life sciences, medical device or highly regulated industry.</li><li>Understanding of Advanced EtQ Design and Configuration.</li><li>Understanding of EtQ Technical Documentations; User Requirement Specifications, System. Requirement Specifications and Functional Requirement Specifications.</li><li>Trained in Database Queries.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Soft Skills:</strong>\n<ul>\n<li>Be an effective communicator, and able to deliver messages through presentations, written and verbal communication.</li><li>Utilizes sound and rational problem solving and decision-making processes.</li><li>Ability to handle multiple tasks concurrently and timely.</li><li>Good interpersonal skills and ability to work effectively and efficiently in a team environment to accomplish goals.</li><li>Display eagerness to learn and continuously improve.</li><li>Positive work attitude that supports collaboration and continuous improvement.</li>\n</ul>\n&nbsp;\n<br><br>\nThis position does not support immigration sponsorship.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status."}