{"job title": "Research Scientist - Laser Spectroscopy", "company": "Corning", "city state": "– Painted Post, NY", "rating": "3.7", "job description": "Corning is one of the world’s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people’s lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n<br><br>\nScope of Position (i.e. projects involved with and role within group): This position will be responsible for the analysis of unique materials, focusing on organic materials and thin films using Raman Spectroscopy. This position is for a dynamic laboratory, by which high knowledge of instrumental equipment and the ability to build, modify, and develop experimental systems are required. New methods will need to be developed to deliver the necessary information required. This position requires a detailed understanding of Raman Spectroscopy as well as a strong understanding of Organic Chemistry and also entails responsibilities including instrument maintenance, modification, customer interaction, and experimental design for establishing scope of support required for measurements, projects, or processes. This position reports to the Laser Spectroscopy (Characterization Sciences) Supervisor and all objectives and deliverables for the role will be established with this person. Writing technical reports and contributing to intellectual property is also an expectation in this role.\n<br><br>\n&nbsp;\n<br><br>\nDay to Day Responsibilities: • Acts as a technical expert in a specific field • Hands on approach (in the laboratory) to solve fundamental, product development, and process research • Designs, builds, and or modifies instrumental equipment to complete a desired task • Designs and executes experiments to solve problems or develop new processes or products • Uses rigorous processes and technical knowledge to build fundamental understanding • Provides inputs and/or documents ideas and contributions in IDs, RTRs, NTRs as well as refereed publications • Identifies and articulates problems as well as develops and executes approaches to solving them • Provides day-to-day problem solving support to Research, Development, and Manufacturing • Runs and modifies testing processes • Makes technical presentations to customers and at conferences • Functions as a team member or team leader on focused projects\n<br><br>\n&nbsp;\n<br><br>\nTravel requirements (please note if international): No travel requirements except if required due to Project Involvement\n<br><br>\n&nbsp;\n<br><br>\nHours of work/work schedule/flex-time: 40hrs per week/ Monday-Friday / Flex-Time Available\n<br><br>\n&nbsp;\n<br><br>\nEducation and Experience (minimum required for consideration): • A M.S. or Ph.D. in Chemistry, Physics, Material Science, or related field is required • Post-doctoral experience preferred, but not required) Required Skills (These are skills that candidates must possess): • In depth experience with laser spectroscopic techniques, especially Raman Spectroscopy • Ability to build, modify, combine, and test spectroscopic equipment in order perform a desired experiment or task • Strong understanding of Organic Chemistry and Organic materials (composition and structure)\n<br><br>\n&nbsp;\n<br><br>\nDesired Skills (these are the skills that would be nice for candidates to possess): • Computer Programming (Labview, MatLab, etc.) • Part Fabrication expertise • Understanding of process analytical chemistry – requirements and challenges\n<br><br>\n&nbsp;\n<br><br>\nSoft Skills (Communication/Team/Leadership): • Works effectively across multiple disciplines in team-oriented environment. • One-one communication skills • Detailed oriented • Time Management\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status."}