{"job title": "Advanced Analytics Engineer/Data Scientist", "company": "Corning", "city state": "– Corning, NY", "rating": "3.7", "job description": "Corning is one of the world’s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people’s lives.\n<br><br>\nCorning succeeds through sustained investment in R&amp;D, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.\n<br><br>\nCorning's Manufacturing, Technology and Engineering division (MTE) is recognized as the leader in engineering excellence &amp; innovative manufacturing technologies by providing diverse skills to Corning’s existing &amp; emerging businesses.\n<br><br>\nWe anticipate &amp; provide timely, valued, leading edge manufacturing technologies and engineering expertise. We partner with Corning’s businesses and the Science &amp; Technology division. Together we create and sustain Corning’s manufacturing as a differential advantage.\n<br><br>\nAre you passionate about “Life Changing Innovation”? As with Thomas Edison, we have a history of working with the world’s greatest innovators. We solve our customers’ most complex problems that others can’t or won’t. Collaboration, Creative Spirit and Career Development are just a few of the reasons world-class professionals choose Corning Incorporated for a career. We are headquartered in Corning - a dynamic city in Upstate, NY where residents enjoy the benefits of a rich arts and culture scene, one of the fastest-growing wine regions and a family friendly area with affordable homes and quality education.\n<br><br>\nCorning is the world leader in specialty glass and ceramics, building and manufacturing keystone components that enable high-technology systems. Corning’s history is filled with breakthrough technologies that have played a meaningful role in the way the world works. We thrive on solving difficult, commercially relevant problems through a creative and collaborative research and development process. Corning succeeds through sustained investment in R&amp;D, more than 160 years of materials science and process engineering knowledge, and a distinctive reciprocal culture.\n<br><br>\nCorning's Manufacturing, Technology and Engineering division (MTE) is recognized as the leader in engineering perfection and innovative manufacturing technologies by providing diverse skills to Corning’s existing and emerging businesses. We anticipate and provide timely, valued, leading edge manufacturing technologies and engineering expertise. We partner with Corning’s businesses and the Science &amp; Technology division. Together we build and sustain Corning’s manufacturing as a differential advantage.\n<br><br>\n<strong>Scope of the position:</strong>\n<br><br>\nDo you want to be part of a unique opportunity to join a growing team that is demonstrating value and driving business impact within Corning Incorporated? We are increasing our application of advanced analytics and expert systems to our growing manufacturing capabilities. New manufacturing measurements and controls systems provide vast amounts of untapped process and product data. Your responsibilities will include transforming our data assets into strong internal insights that drive strategic solutions to deliver large value impact. You will act as a key member of multi-disciplined teams solving diverse challenges as you work across the many businesses that comprise Corning.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<ul>\n<li>Perform exploratory and targeted data analysis using commercial and open source data analytic software packages.</li><li>Apply multivariate statistical methods and machine learning techniques to find structure and value in both large and small data sets to identify key process input variables that can feed process control solutions.</li><li>Develop predictive/classification models for use in production and possible applications.</li><li>Successfully identify the real problem from the customer’s point of view to build and execute data analytic work plans.</li><li>Communicate technical analyses and results to division customers.</li><li>Write technical reports summarizing development, application, and validation of the technical analysis.</li>\n</ul>\n<strong>Travel Requirements:</strong>\n<ul>\n<li>Travel requirements will vary. Expected travel up to&nbsp;20% both Domestic and International</li>\n</ul>\n<strong>Hours of work/work schedule/flex time:</strong>\n<ul>\n<li>Flexibility is required. Normal Business hours (8 – 5, M – F): however, you are expected to work hours necessary to achieve objectives including overtime, weekend, and off-shift</li>\n</ul>\n<strong>Required Education:</strong>\n<ul>\n<li>MS with 5+ years of experience&nbsp;or PhD in Controls Engineering, Mechanical Engineer, Electrical Engineering, Computer Science, Statistics, Mathematics, Physics or other quantitative disciplines.</li>\n</ul>\n<strong>Range of Required Skills:</strong>\n<ul>\n<li>Your passion, knowledge of, and experience applying multivariate statistical analysis algorithms including intelligent automation techniques for classification, regression, and clustering. For example decision trees, random forest, SVM, logistic regression, neural networks, k-means clustering, and Bayesian models.</li><li>Demonstrated&nbsp;experience with a broad base of analysis and visualization tools (i.e. Matlab, Python, R, SAS JMP, Tableau).</li><li>Your Ability to show the relevance of the applied techniques in manufacturing and prioritize work across multiple projects will be critical.</li><li>Strong attention to detail and organizational skills.</li><li>Ability to work collaboratively in a team environment across stages of innovations.</li><li>Ability to communicate the outcome of complex and/or technical concepts in a clear manner to a non-analytical group and take on challenges specific to analyzing disparate data sources.</li><li>Transition proof-of-concept analysis and models into deployed production applications</li>\n</ul>\n<strong>Range of Desired Skills:</strong>\n<ul>\n<li>Knowledge of relational databases and experience with SQL.</li><li>Familiarity with ETL tools for data extraction, data cleansing, and data manipulation.</li><li>Understanding of measurement system analysis (MSA) techniques and design of experiments.</li><li>Experience applying time series analysis (i.e. ARIMA, Fourier analysis).</li><li>Software development experience in C,C++, and/or C#.</li><li>Software version control experience (i.e. git).</li><li>Knowledge of deep learning techniques (i.e. CNN, RNN) and software packages such as TensorFlow, CNTK, Keras, etc.</li><li>Familiarity with big data ecosystem (Spark, Hadoop, HIVE, etc) and cloud based storage and compute environments (AWS, MS Azure)</li>\n</ul>\n&nbsp;\n<br><br>\nThis position does support immigration sponsorship.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status."}