{"job title": "Senior Research Scientist - Physics", "company": "Corning", "city state": "– Painted Post, NY", "rating": "3.7", "job description": "Corning is one of the world’s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people’s lives.\n<br><br>\nAt Corning, our growth is fueled by a commitment to innovation. We succeed through sustained investment in research &amp; development, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges. We are a four-time National Medal of Technology winner thanks to our technology leadership and R&amp;D environment, which attract and enable the best scientific minds in the world. This pipeline of talent has brought life-changing innovation to your fingertips for more than 160 years.\n<br><br>\nScope of Position: Your primary function is to act as the lead technical scientist in our optical materials characterization laboratory. We seek a talented Researcher with a proven and sound technical background in the Physics of Optical Science and knowledgeable about various Optical Metrology techniques covering the ultraviolet to infrared spectral range. Specifically, you will be encouraged to have extensive hands-on experience with spectrophotometry, visual attributes (color, haze, gloss), refractometry, and interferometry for material characterization and excellent analytical skills. In this role, you will conduct experiments to assess the optical properties of materials and relate the measured attributes to improving product design and performance. The Scientist is also expected to develop new methods and optical configurations for non-routine measurements or processes. You will work with multi-functional teams enabling measurements and supporting data and models for evaluating materials and process options. Focus is also on understanding of fundamental science as it relates to the projects’ goals. You will be comfortable in working with technical groups related to Product Research, Development, Engineering, and Manufacturing. Strong knowledge of Material Science and the ability to collaborate with numerous project groups is an asset.\n<br><br>\nDay to Day Responsibilities: Collaborate, independently, with new product projects to:\n<ul>\n<li>Identify proper testing methods and develop new methods if needed to evaluate or measure optical properties of materials</li><li>Develop and manage testing plans</li><li>Collaborate with teams on ideation and problem solving</li><li>Support optical lab as technical SME to work with customers</li><li>Conduct experiments to gain fundamental knowledge and address technical challenges</li><li>Perform data analysis and interpretation</li><li>Make recommendations to projects to improve functional performance of materials and processes as appropriate</li><li>Develop new intellectual property</li>\n</ul>\nTravel Requirements:\n<ul>\n<li>Variable but expectation is less than 15%</li>\n</ul>\nHours of work/work schedule/flex-time:\n<ul>\n<li>40+ hours per week w/ flex time</li>\n</ul>\nRequired Education:\n<ul>\n<li>Master’s or PhD in Physics or Optical Science or related</li>\n</ul>\nRequired Years and Area of Experience:\n<ul>\n<li>A minimum of 3+ years’ experience with a Master’s Degree</li>\n</ul>\nRequired Skills:\n<ul>\n<li>Technical matter expert in area of optical properties measurements of various materials including glass, glass ceramic, ceramics, thin coatings and other polymeric materials</li><li>Some modeling experience or knowledge</li><li>Hands-on laboratory experience with optical equipment and test methods used in materials and process measurements</li><li>Willingness to collaborate across organizational boundaries from research to manufacturing</li><li>Strong communication and interpersonal skills with a comfort in the facilitation of technical personnel</li>\n</ul>\nDesired Skills:\n<ul>\n<li>Ability to define DOEs and perform statistical analyses</li><li>Experience in industrial research and development</li><li>Programming for equipment interfacing and data processing</li><li>Customer facing interaction and communication skills/experience</li><li>Experience with manufacturing environment is helpful</li><li>6-Sigma training is a plus</li>\n</ul>\nSoft Skills (Communication/Team/Leadership):\n<ul>\n<li>Great teammate who enjoys collaboration</li><li>Excellent communication (both verbal and written) and presentation skills.</li><li>Facilitation skills to enable leading of teams through ambiguous evaluations.</li><li>Eagerness to work with small to medium-sized multi-functional technical teams</li><li>Able to identify long term needs/goals as well as determine short term objectives to achieve</li><li>Comfortable with a hands-on approach to problem solving</li>\n</ul>\nThis position supports immigration sponsorship.\n<br><br>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status."}