{"job title": "Data Scientist", "company": "Corning", "city state": "– Corning, NY, US, 14830", "rating": "3.7", "job description": "<div><div></div>\n\n\n\n\n </div><br>\n\n <div>\nData Scientist<br><br><strong>Date:</strong> \n<br>\n Sep 24, 2018\n<br><br>\n<strong>Location:</strong>\n<br><br>\n Corning, NY, US, 14830<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n }<br><br><strong>Req #:</strong> \n<br>\n 10295</div><br>\n\n<div>Corning is one of the world’s leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people’s lives.\n<br><br>\nCorning succeeds through sustained investment in R&amp;D, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.\n<br><br>\nCorning's Manufacturing, Technology and Engineering division (MTE) is recognized as the leader in engineering excellence &amp; innovative manufacturing technologies by providing diverse skills to Corning’s existing &amp; emerging businesses.\n<br><br>\nWe anticipate &amp; provide timely, valued, leading edge manufacturing technologies and engineering expertise. We partner with Corning’s businesses and the Science &amp; Technology division. Together we create and sustain Corning’s manufacturing as a differential advantage.\n<br><br>\n<strong>Scope of Position:</strong>\n<br><br>\nThis candidate will be responsible for gathering existing data and/or generating new data to solve technical, business or project related problems. They should have experience with both the capture of data using different tools, management/manipulation of large data and extensive knowledge of a wide variety of data analysis methods. Data analysis tools and methods include, but are not limited to, linear and non-linear regression, multivariate methods, genetic algorithm, neural network, Gaussian processes and other machine learning techniques.\n<br><br>\nThe analytical work will support a range of projects from highly technical problems to business predictions. This will also involve work from manufacturing, development, research and commercial applications. It is expected that this person will create predictive tools that will enable both business and technical decisions. The work will often require validation through exhaustive research of prior art relative to the problem at hand.\n<br><br>\n<strong>Day to Day Responsibilities:</strong>\n\n<ul>\n\n\t<li>Develop new theories or expand upon existing theories using a combination of data and direction from project leaders</li>\n<li>Research all external and internal information relative to the problems identified by the project team</li>\n<li>Collaborate with existing subject matter experts to solve very difficult problems</li>\n<li>Participate on cross functional teams to develop and test hypotheses related to materials understanding</li>\n<li>Develop models using appropriate methods and software; expanding capabilities as needed</li>\n<li>Communicate results to teams and stake-holders as needed</li>\n<li>Document findings with internal and external publications</li>\n</ul>\n<strong>Travel requirements:</strong>\n\n<ul>\n\n\t<li>Limited travel, likely\n</li></ul>\n<strong>Hours of work/work schedule/flex-time:</strong>\n\n<ul>\n\n\t<li>Normal Business Hours 8:00-5:00 with additional hours occasionally needed for urgent project demands.</li>\n</ul>\n<strong>Education and Experience:</strong>\n\n<ul>\n\n\t<li>Ph.D. in Mathematics, Engineering, Statistics or related Field</li>\n</ul>\n<strong>Required Skills</strong>\n\n<ul>\n\n\t<li>Demonstrated experience and strong technical knowledge in data driven and predictive modeling</li>\n<li>Data Analysis Experience using any mix of software including, but not limited to: Matlab, R, SAS, JMP, Minitab</li>\n<li>Programming experience using C/C++, Java or R</li>\n<li>Ability to work effectively on diverse teams</li>\n<li>Ability to collaborate closely with scientific community, business leaders and management</li>\n<li>Good written and verbal communication skills</li>\n</ul>\n<strong>Desired Skills:</strong>\n\n<ul>\n\n\t<li>Familiar with physics-based modeling for technical field such as CFD, Heat Transfer or Solid Mechanics.</li>\n</ul>\n<strong>Soft Skills:</strong>\n\n<ul>\n\n\t<li>Must be collaborative and able to openly engage with colleagues to achieve project goals</li>\n<li>The ability to translate difficult technical concepts to broader audience</li>\n<li>Self-motivated with an ability to manage one’s own work independently</li>\n<li>Ability to communicate effectively by phone and video with team members in international locations</li>\n<li>Ability to take feedback constructively and use it for personal growth</li> \n</ul>\nWe prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.\n<br><br>\n<strong>Nearest Major Market:</strong> Corning</div>\n<br>"}