{"job title": "Data Analyst", "company": "CorTech International, LLC", "city state": "– Portland, OR", "rating": "2.9", "job description": "Job DescriptionThis position can only be filled with a retired UPS management employee or a Former UPSer with a positive rehire status referred by the Hiring Manager. The Feeder Dispatch Lead will be responsible for overseeing the UPS Dispatch activity to ensure timely and proficient service. He/She will monitor dispatch schedules to ensure adequate staffing for transportation needs, will track dispatch modifications, will review reports and analyze data to create plans to maximize dispatch results, will monitor load movement to identify cost reductions, will review drivers hours of service, will oversee yard operations; staffing, shifter performance, verifies trailers are loaded and empty and confirms trailer inventory. Lead Dispatchers will not be required to travel between buildings but will be domiciled out of a UPS Feeder office. Knowledgeable in Trailer Forecasting Control System (TFCS)- Able to track trailer movements for bypass and destined work. Is able to account for trailers on forecast. Has understanding of D.O.T. hours of service and can account for drivers who are assigned to him/her. The Feeder drivers will continue to report to and be managed by a UPS management person. Can use ?Hub and Feeder Control System (HFCS)? and ?Schedule and Dispatch Editing (SADE)? programs. Must be able to add/edit a driver?s schedule. Has previous knowledge of HFCS and its functionality. Demonstrates a detailed understanding of processes, procedures, and methods; demonstrates a broad knowledge of tools, equipment, and technology; describes and understands the general structure of the operation. Approximately 40 hours per week (able to work overtime as needed); occasional weekends as needed. This Feeder Dispatch Lead position does not have the authority to make any pre-employment or employment decisions or sign regulatory documents. These roles/responsibilities would fall to the UPS management person that this Lead reports to. This person will be responsible for providing input to the UPS management on Feeder Driver Performance. Hours: 8:00am to 11:00pm Work Week: 1 - Monday, 2 - Tuesday, 3 - Wednesday, 4 - Thursday, 5 - Friday, 6 - Saturday, 7 - Sunday"}