{"job title": "Lab Operations Data Scientist", "company": "Counsyl", "city state": "– South San Francisco, CA", "rating": "4.2", "job description": "<div>Our goal is to make the human genome practically useful for life-altering decisions.</div><br>\n<div>We invented the Counsyl Test, a breakthrough diagnostic intended for parents planning to start a family. The test won the Wall Street Journal Innovation Award for Medicine, was named one of Scientific Americans Top 10 World Changing Ideas, was featured in the New York Times -- and is now prescribed by physicians for over 3% of all the births in the United States.</div><br>\n<div>Few if any have done genetics on this scale before. As a data scientist, you will play a critical role in building an efficient, reliable, and data-driven vertically-integrated genetics organization.</div>What You'll Do\n\n<ul>\n<li>Build structured reports that can be automatically re-run to monitor critical laboratory parameters for process control and regulatory compliance.</li><li>Statistical modeling and process debugging to develop new assays and new technology in the lab.</li><li>Assist in data analysis, modeling, and reporting for scientific publications.</li><li>Cross-functional analysis: work with the business and sales development teams to optimize revenue using our large corpus of historical sales and insurance data.</li><li>Coordinate between the laboratory and operations teams to optimize the cost-effectiveness of the business.</li>\n</ul>\n\nAbout You\n\n<ul>\n<li>MS or PhD in Chemistry, Biology, Physics, Engineering or a similarly quantitative field; or significant prior experience in related work.</li><li>You have experience analyzing data from molecular biology or biochemistry experiments. Experience working with Next Generation Sequencing data is a plus. Interpreting exploratory analysis of data from the clinical laboratory is a core function.</li><li>You have a strong background in statistics and probability.</li><li>Experience writing reproducible analysis pipelines in a statistical programming environment like Python (preferable) or R is a must. Experience with modern web development is a plus. Experience with only Excel (or other spreadsheet tools) is insufficient.</li><li>Process control background is a plus.</li>\n</ul>\n\n<div>Counsyl, Inc. (the Company), a wholly-owned subsidiary of Myriad Genetics, Inc. doing business as Myriad Womens Health, is a leading personalized medicine company dedicated to being a trusted advisor transforming patient lives worldwide with pioneering molecular diagnostics. Myriad discovers and commercializes molecular diagnostic tests that: determine the risk of developing disease, accurately diagnose disease, assess the risk of disease progression, and guide treatment decisions across six major medical specialties where molecular diagnostics can significantly improve patient care and lower healthcare costs. Myriad is focused on three strategic imperatives: maintaining leadership in an expanding hereditary cancer market, diversifying its product portfolio through the introduction of new products and increasing the revenue contribution from international markets. For more information on how Myriad is making a difference, please visit the Company's website: www.myriad.com.</div><div>Myriad is an equal opportunity employer and as such, affirms in policy and practice to recruit, hire, train and promote, in all job classifications without regard to race, color, religion, gender, age, sexual orientation, gender identity, national origin, disability status or status as a protected veteran.</div><br>\n<div>Reasonable accommodation will be provided for qualified individuals with disabilities and disabled veterans in job application procedures. We believe that diversity lends a regional, national, and global advantage to the clients we serve. Our workforce consists of dynamic individuals, with a range of backgrounds, talents, and skills.</div>"}