{"job title": "Staff Data Scientist", "company": "Course Hero", "city state": "– Redwood City, CA", "rating": "4.3", "job description": "<strong>The Role:</strong>\n<br><br>\nWe are looking for an experienced Staff Data Scientist to join us and drive growth and evolution of our product. You will work with big data sets, using deep statistical models to drive actionable insights and tackle high impact business problems. Leveraging your expertise in stats and data science, as well as your business acumen and creative mind, you will be telling the story behind your insights. You'll be painting a picture to our functional partners, and explain to them what the numbers are telling us, why it matters to them, and recommend product changes, new features, and A/B tests for implementation. You can expect to spend 80% of your time individually driving analyses and insights, and the other 20% mentoring other data scientists.\n<br><br>\n<strong>The Team:</strong>\n<br><br>\nThe analytics team at Course Hero is central to our functional organization, and heavily influences the strategy and tactics of our company's roadmap. The analytics team is rapidly growing in order to generate more and more analytical insights to fuel Course Hero's growth while giving directions to our product strategy. We are also constantly improving and innovating ways that Course Hero can use data to drive growth and strategic initiatives.\n<br><br>\n<strong>Here are some ways you'll make an impact:</strong>\n\n<ul>\n<li>You'll lead and work with members of the Analytics team to deliver data insights that help product owners make better business decisions and strategies.</li>\n<li>You'll mine structured and unstructured data platforms to understand customer attributes, engagement with the products, and growth opportunities for our business. You'll help model complex relationships in the presence of many confounding factors.</li> \n\n<li>You'll be able to come up with quick hypotheses on the fly to diagnose and explain trends in our growth rate. You'll also be able to build diagnostic frameworks to come up with more scalable ways of answering business questions about trends in growth rate.</li> \n\n<li>You'll design innovative A/B testing techniques.</li> \n\n<li>You'll optimize the true impact of a test by segmenting millions of interconnected users and using a sound methodology to interpret test results in the face of such extensive interconnection.</li>\n<li>You'll work on predictive modelling problems everywhere across our product. You'll design and implement machine learning models to support Course Hero products.</li>\n<li>You'll conduct deep-dive analyses and investigations to understand customer experience including touch points, cross-channel behaviours, drivers, preferences and segmentation.</li>\n<li>You'll proactively identify opportunity areas and propose strategic initiatives and goals to help our functional partners to achieve their goals and drive growth</li>\n<li>You'll effectively communicate data findings to internal and external team members</li>\n<li>You'll be an integral part of our team and continue to build on our collaborative culture</li>\n<li>You'll always be looking for ways to improve the status quo and raise the standards of our team</li>\n<strong>Are you Our Star Staff Data Scientist?</strong>\n\n<ul>\n<li>You have 7-10 years of working experience in data science or analytics. Research experience gained during a doctoral program will be considered.</li>\n<li>You have a MS or PhD degree in a scientific or quantitative field.</li>\n<li>You have a deep understanding of data science and statistical analyses. You have experience building mathematical algorithms and machine learning models using tools like R, Python, Matlab, or Stata.</li>\n<li>You have experience using common data mining and visualization techniques</li>\n<li>You are proficient in SQL and have experience working with large datasets</li>\n<li>You have experience managing or mentoring other data scientists</li>\n</ul>\n<strong>Bonus Points:</strong>\n\n<ul>\n<li>You have knowledge and experience working with Google Analytics, Tableau, Amplitude, and Treasure Data</li>\n<li>You have experience working in education or e-commerce domain</li>\n</ul>\n<strong>What We Offer You</strong>\n\n<ul>\n<li>Industry competitive salary and stock options</li>\n<li>Full coverage (medical, dental, vision, and life)</li>\n<li>401(k) program to help you save for the future</li>\n<li>Educational assistance program to support lifelong learning</li>\n<li>Commuter benefits, cell-phone allowance, and a free gym membership</li>\n<li>Regularly planned team outings and company events</li>\n<li>Free weekly and discounted lunches, plus an endless snack and drink supply</li>\n<li>Opportunity to make a meaningful impact in a revolutionary space</li>\n</ul>\n<strong>About Us:</strong>\n<br><br>\nCourse Hero envisions a world where every student graduates, confident and prepared. We are a privately held, mission-driven educational technology company that is profitable and growing. We're building the optimal learning destination for every college course. Course Hero students can access over 20 million course-specific study materials and study resources to enhance their supplemental and deep learning experiences. We see more students that are confident and prepared when they can quickly find what they need and learn deeply.\n<br><br>\nAt Course Hero, we have an awesome team and a really engaging culture. We are customer-focused, collaborative, responsible, gritty and we love to learn!\n<br><br>\nWe're not the only ones that think we're onto something big. Course Hero has been recognized as one of the 250th Fastest Growing Company in North America on Deloitte's 2017 Technology Fast 500 and also 2018's One of the Best Places to Work in the Bay Area by San Francisco Business Times and Silicon Valley Business Journal.\n<br><br>\nRead up on some of our recent news coverage, blog, and learn more about us to understand what it is like to work on our team.</ul>"}