{"job title": "Staff Machine Learning Engineer", "company": "Course Hero", "city state": "– Redwood City, CA", "rating": "4.3", "job description": "<strong>The Role:</strong>\n<br><br>\nWe are looking for a Staff Machine Learning engineer who can hit the ground running and work on a lot of fun (and challenging) projects that range from recommending relevant content to our users to extracting question and answer pairs from documents. You'll be a part of the Applied Machine Learning team in the Artificial Intelligence Group at Course hero and will ship products that are used by millions of users. The key charter for AI Group is to build the semantic knowledge graph at Course Hero in order to help personalize bespoke learning experiences for students and help educators create unique course content.\n<br><br>\nAs a staff engineer on the Applied Machine Learning team, you'll be expected to take the lead on multiple projects and be involved in every step of the process. We expect you to thrive in a fast-paced, high-growth environment, and adapt to ever-changing business needs.\n<br><br>\nCheck out this blog post by our Director of Applied Machine Learning to see what edtech problems this team is tackling today!\n<br><br>\n<strong>Here are some ways you'll make an impact:</strong>\n\n<ul>\n<li>You'll ideate, prototype, develop and deploy machine learning models for various product features.</li> \n\n<li>You'll help build scalable platforms for training and evaluating machine learning models.</li> \n\n<li>You'll lead development on applications of Natural Language Processing for identifying question and answer pairs, disambiguating between topics and building personalized learning solutions.</li> \n\n<li>You'll collaborate with the other machine learning engineers, analytics, and other product teams to understand business needs, find the right solution to a problem and ship products.</li>\n<li>You'll help engineers from other teams to understand and learn machine learning and help Course Hero be a data-driven company.</li>\n</ul>\n<strong>Are you our star Staff Machine Learning Engineer?</strong>\n\n<ul>\n<li>You have at least 8+ years of relevant Machine Learning or Data Science work experience, preferably with a focus on Natural Language Processing and Information Retrieval.</li>\n<li>You have experience working with distributed data processing systems like Spark/Hadoop.</li> \n\n<li>You have solid programming skills and are proficient in python, java, scala or an equivalent language.</li>\n<li>You've worked on (and deployed) multiple machine learning models in the past and can design and architect machine learning pipeline and scoring systems.</li>\n<li>You have an excellent understanding of a variety of machine learning algorithms (both supervised and unsupervised) with a special focus on text mining techniques.</li>\n<li>You are passionate about data science and machine learning and are constantly learning as the field evolves.</li>\n<li>You are extremely passionate about education.</li> \n\n<li>You have an advanced (Masters or above) degree in a quantitative field like Statistics, Operations Research, Engineering or Math.</li>\n</ul>\n<strong>What We Offer You:</strong>\n\n<ul>\n<li>Industry competitive salary and stock options</li>\n<li>Full coverage (medical, dental, vision, and life)</li>\n<li>401(k) program to help you save for the future</li>\n<li>Educational assistance program to support lifelong learning</li>\n<li>Free weekly lunches, plus an endless snack and drink supply</li>\n<li>Regularly planned team outings and company events</li>\n<li>Commuter benefits, cell-phone allowance, and a free gym membership</li>\n<li>Opportunity to make a meaningful impact in a revolutionary space</li>\n<li>A top 250 fastest growing company according to Deloitte and Touche Technology Fast 500</li>\n</ul>\n<strong>About Us:</strong>\n<br><br>\nCourse Hero is an online learning library where you can access over 20 million course-specific study resources contributed by a community of students and educators. You'll find practice problems, study guides, videos, class notes, and step-by-step explanations for every subject you're studying from economics to literature, biology to history, accounting to psychology, and everything in between. We help you quickly find what you need so you can learn deeply.\n<br><br>\nOur company culture is very open, flat, and collaborative. In addition to hiring the best talent, we believe that a diversity of perspectives, ideas, and cultures leads to the creation of better products and services. On our team, we're problem solvers, we think like owners, and we embrace a growth mindset in our efforts to continually better our product. We're growing fast, we're profitable, and we're looking for new team members to help us plot our course towards future success!\n<br><br>\nRead up on some of our recent news coverage, learn more about us, and check out our values to understand what it is like to work on our team!"}