{"job title": "Senior Data Scientist, Supply Chain", "company": "Coyote Logistics", "city state": "– Chicago, IL", "rating": "3.2", "job description": "<strong>Wake up each day knowing that you are a part of something special. Something real. Something bold. What you do can make a difference. Coyote is an industry-leading transportation and logistics service provider that believes in doing the right thing every time. Every hour. Every minute. Every second. Are you looking for a place where you will have a role in shaping an industry? Are you Tenacious, True, Tribal, and Smart? Then it's time for you to apply to join the pack.</strong><br><br><strong>Senior Data Scientist, Supply Chain</strong>\n<br><br>\nWe are seeking an experienced Senior Data Science professional with a passion to derive value from data and insatiable curiosity to learn and try new things to join the Supply Chain Research &amp; Innovation group in our Strategy Services department. The Supply Chain Research group at Coyote Logistics is responsible for designing, selling, and implementing Coyote's emerging portfolio of non-transactional supply chain services. As a senior data scientist in the Supply Chain Research Group, you will play a key role in designing and implementing Coyote's product and service portfolio in the context of its broader competitive strategy. You will do this by conducting statistical analysis, proposing supply chain solutions, developing machine learning methodologies and contributing to a variety of research activities. Primary responsibilities will also include suggesting new innovative research approaches and exploring relevant evolving technologies.\n<br><br>\n<strong>Daily Tasks &amp; Responsibilities</strong>\n<ul>\n<li>Creating, designing and prototyping out next-generation machine / deep learning technologies in the areas of supply chain operations (tactical and strategic), transportation science</li><li>Designing and developing effective recommendation models, features and algorithms involving user activities and interests, pattern recognition, trends</li><li>Prototype real-time updating models to predict/estimate operational levers that adds value to our business</li><li>Analyzing and designing operational solutions for projects such as vehicle routing, disruption prediction, trip recommendation, etc.</li><li>Establishing Coyote's position as an industry thought leader through publishing articles and white papers, speaking at relevant industry conferences, and developing strategic value-added relationships with Coyote's customers and academic institutions</li><li>Building a best-in-class supply chain research &amp; innovation team that differentiates Coyote from market competitors with regard to scope, creativity, innovation, and efficiency</li><li>Leading diverse project teams focused on both internal and external improvement efforts</li><li>Collaborating with Logistics Analysts and Information Technology teams on a project-by-project basis</li><li>Evaluating effectiveness of current or future logistical process for Coyote clients</li>\n</ul>\n<strong>Essential Skills, Characteristics, &amp; Experience</strong>\n<ul>\n<li>5+ years of experience in Machine Learning, AI, Predictive Modeling</li><li>MS/PhD in Computer Science/Mathematics/Supply Chain/Statistics preferred</li><li>Strong quantitative analysis, programming, and statistical modeling skills.</li><li>Understanding of core ML concepts and its application in solving real world problems</li><li>High level of comfort in Python and R</li><li>Experience coding Microsoft SQL, C#, Visual Basic</li><li>Experience working on some modeling tools for optimization, data-simulation, statistics etc.</li><li>Capable problem solver who uses logic to create effective solutions to complex customer problems</li><li>Team focused and accountable of commitments made to the business</li><li>Previous experience in Transportation, Logistics and IT Systems experience preferred</li>\n</ul>\n<strong>Why Coyote?</strong>\n<ul>\n<li>Onsite training &amp; ongoing career development</li><li>Competitive base salary</li><li>Comprehensive benefits package</li><li>Great perks like onsite haircuts, massages, and intramural sports</li><li>Significant advancement opportunities for outstanding performers</li><li>Casual dress and company lunch</li>\n</ul>\nCoyote is an at-will employer.\n<br><br>\nWe are an Equal Opportunity Employer.<br><br>Associated topics: chip, c++, computer engineering, electrical engineering, java, linux, machine learning, malware, matlab, photonics"}