{"job title": "Business Intelligence Data Engineer", "company": "Credible", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "<strong>Who is Credible?</strong>\n<br><br>\nWe believe life's changes create financial needs for people and that the traditional financial system often puts up unnecessary obstacles. People celebrate major milestones like going to college, getting married, and buying a home. And most of the time, these milestones come with financial implications.\n<br><br>\nAt Credible, we have built a company with the mission of bringing transparency, choice, simple processes and savings to accessing credit for life's important moments. What you see is what you get. We are committed to being upfront, honest, and clear about your options. There are no mysteries, no hidden fees, and no secret clauses.\n<br><br>\nCredible is a fast-growing Australian Securities Exchange (ASX) listed Fintech company that has world class management, has raised multiple rounds of funding, is generating significant revenue and is disrupting the lending market and helping people save money and get out of debt faster.\n<br><br>\n<strong>About the role</strong>\n<br><br>\nOur Business Intelligence team is looking for a Business Intelligence Data Engineer who is passionate about data, analytics, and business strategy. You will help the team learn more about our business, teach others in the company about analytics, and improve the use of our data. You'll be an integral part of providing data-driven insights that inform significant company decisions.\n<br><br>\n<strong>You Will:</strong>\n\n<ul>\n<li>Build data pipelines and python-based ETL tools for getting, processing, and delivering data</li>\n<li>Partner with teams across the organization to understand their analytics needs and create dashboards and reporting that allow them to execute more effectively</li>\n<li>Work with business leaders to define key metrics and build reporting to monitor and understand performance along those metrics</li>\n<li>Conduct in-depth data analyses that lead to actionable insights, owning the entire process from ideation to execution to presentation of findings to stakeholders</li>\n<li>Develop data models in our data warehouse that enable performant, intuitive analysis</li>\n<li>Become an expert on all aspects of Credible's data and analytics infrastructure</li>\n<li>Be the driving force behind the adoption and effective use of our BI tool within every team at Credible</li>\n</ul>\n<strong>Education and Experience:</strong>\n\n<ul>\n<li>BA/BS in a quantitative field</li>\n<li>1-2 years of work experience as a data analyst, data engineer, or in a highly analytical role</li>\n<li>Experience writing SQL queries and using a BI tool</li>\n<li>Experience with a scripting language (preferably Python) for data processing and analysis a plus</li>\n<li>Experience using the command line and git</li>\n<li>Strong grasp of statistics and experience conducting rigorous data analyses</li>\n<li>Experience developing models and visualizations in Looker a plus</li>\n<li>Experience at an e-commerce or fintech company a plus</li>\n</ul>\n<strong>Personality and Values:</strong>\n\n<ul>\n<li>The capacity to juggle multiple priorities effectively within a fast-paced environment is critical</li>\n<li>You're a highly motivated self-starter with the ability to work efficiently with minimal supervision.</li>\n<li>Anticipate business needs and think with a business owner mindset think critically about analyses, don't just complete them</li>\n<li>Passion for spreading the value of data throughout the company and communicating insights to a broad audience with varying levels of technical expertise</li>\n</ul>\n<strong>Why you want to work at Credible</strong>\n<br><br>\nWe are a fast moving, fun-loving, seriously smart group of people who really care about impacting the lives of our customers. We empower our employees to make decisions, take risks, drive our business and make changes when we don't get it right. These are our values:\n\n<ul>\n<li>Exceed Customer Expectations: We provide an exceptional experience to each and every customer that compels them to share it with others.</li>\n<li>Take Ownership: We are trusted to make decisions that are in the best interests of our customers and our business. We think and act like owners. We care and that makes all the difference.</li>\n<li>Be Curious: We are curious, ask questions, seek to understand and try new things.</li>\n<li>Do the Right Thing: We earn trust by being transparent, respectful and honest with each person with whom we interact.</li>\n<li>Get Results: Results fuel our excitement and we know how our personal accomplishments tie to the success of the company</li>\n<li>Be Bold: We are courageous and take risks that scare us. Our enthusiasm for experimenting is how we will find the next breakthrough.</li>\n</ul>\nOur benefits: We offer competitive compensation, generous benefits, free food and a flexible vacation policy.\n<br><br>\nBut mainly, you want to work at Credible because you believe in our mission and want to have a major role in delivering on it! We look forward to getting to know you.\n<br><br>\n<strong>We</strong> <strong>are</strong> <strong>an</strong> <strong>equal</strong> <strong>opportunity</strong> <strong>employer</strong> <strong>and</strong> <strong>value</strong> <strong>diversity</strong> <strong>at</strong> <strong>our</strong> <strong>company.</strong> <strong>We</strong> <strong>do</strong> <strong>not discriminate</strong> <strong>on</strong> <strong>the</strong> <strong>basis</strong> <strong>of</strong> <strong>race,</strong> <strong>religion,</strong> <strong>color,</strong> <strong>national</strong> <strong>origin,</strong> <strong>gender,</strong> <strong>sexual</strong> <strong>orientation,age,marital</strong> <strong>status,</strong> <strong>veteran</strong> <strong>status,</strong> <strong>or</strong> <strong>disability</strong> <strong>status.</strong> <strong>Pursuant</strong> <strong>to</strong> <strong>the</strong> <strong>San</strong> <strong>Francisco</strong> <strong>Fair Chance Ordinance,</strong> <strong>we</strong> <strong>will</strong> <strong>consider</strong> <strong>for</strong> <strong>employment</strong> <strong>qualified</strong> <strong>applicants</strong> <strong>with</strong> <strong>arrest</strong> <strong>and conviction records.</strong>"}