{"job title": "Data Scientist - Cyberspace Situational Understanding (SU)", "company": "Credence Management Solutions", "city state": "– Fort Gordon, GA, US 30905", "rating": "4.0", "job description": "<div><div><strong>Credence Management Solutions, LLC</strong> is seeking a <strong>Data Scientist</strong> to provide <strong>Cyberspace Situational Understanding (SU)</strong> expertise in the development of current and future cyberspace SU requirements in support of the U.S. Army&nbsp;TRADOC&nbsp;Capability Manager Cyber (TCM Cyber). The contractor must be&nbsp;knowledgeable in the development and application of methods to identify, collect, process and analyze large volumes of data to build and enhance SU processes and systems. In addition the candidate must:\n<ul>\n<li>Understand the data architecture development, cloud based computing and visualization are necessary in order to provide technical guidance on future solutions development.</li>\n<li>Provide expertise in the development of current and future cyberspace SU requirements; knowledgeable in the development and application of methods to identify, collect, process and analyze large volumes of data to build and enhance SU processes and systems.&nbsp;</li>\n<li>Develops information materials, provides analysis and presentations in support of all cyberspace capability development efforts. Serve as a subject matter expert for integrating data science concepts into Army Warfighting Requirements.&nbsp;</li>\n<li>Write documents for requirements needs from the field on an academic&nbsp;level.</li> \n</ul>\n\n</div>\n</div><br>\n\n <div>\n<div>\nJob Requirements</div><br>\n\n<div>\n\n<ul>\n<li>Five (5) years’ experience in data management, analytics and visualization.</li>\n<li>Three (3) years’ experience with U.S. Army force modernization efforts, capability development process, or requirements determination process.&nbsp;</li>\n</ul>\n\n<div>&nbsp;</div><br>\n\n<div><strong>Education Requirements:</strong></div><ul><li>Bachelor's degree from an accredited institution Data Science, Informatics, Computing,&nbsp;or other relevant information science degree.&nbsp;</li>\n</ul>\n\n<div>&nbsp;</div><br>\n\n<div><strong>Security Clearance Requirements:</strong></div><ul><li>A Top-Secret security clearance with Sensitive&nbsp;Compartmented Information (SCI) eligibility.</li>\n</ul>\n&nbsp;\n<br><br>\nCredence Management Solutions, LLC is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or national origin.\n<br><br>\n&nbsp;\n<br><br>\nCJ</div>\n </div>\n<br>"}