{"job title": "Data Scientist", "company": "Credit Karma", "city state": "– San Francisco, CA", "rating": "3.5", "job description": "<div><p></p><div>Credit Karma’s fast growing Data Sciences team is seeking an experienced Senior Data Scientist. This role will allow a motivated individual to make a significant impact across the organization by delivering the most relevant content to our users and by helping drive accelerated revenue growth.</div><p></p></div><div><div>What the job entails<ul><ul><li>Partner with stakeholders across the organization to identify high-impact opportunities to leverage our extensive data to better serve our users.</li><li>Drive the creation of comprehensive datasets encompassing user profiles and behaviors, and incorporating a wide variety of signals and data types.</li><li>Assess the potential usefulness and validity of new statistical approaches and data sources.</li><li>Build complex predictive models to substantially improve and continuously optimize user engagement and revenue generation.</li><li>Rapidly develop proof-of-concept prototypes to prove out hypotheses.</li><li>Reach across multiple functions, such as Product Management and Data Engineering, to implement the models into production and to monitor their performance.</li><li>Motivate and mentor other data scientists to grow their skills and careers.</li></ul></ul></div></div><div><div>Our ideal candidate<ul><ul><li>Advanced Degree (Ph.D./MS) in Statistics or a related quantitative discipline.</li><li>3+ years of experience building and implementing complex models in a fast-paced corporate environment, ideally dealing with problems relevant to revenue, product, and/or marketing.</li><li>Experience with advanced modeling techniques, such as collaborative filtering, matrix factorization, time series analysis, and mixed-effect models, and learning techniques such as boosting and random forests.</li><li>Expert knowledge of R, Python, and SQL, or similar industry standard tools used for large-scale data analysis and modeling.</li><li>Experience with Machine Learning and Big Data technologies such as Map/Reduce, Hadoop, Hive, and Spark is a big plus.</li><li>Programming experience in Scala, Java, or C++, and familiarity with UNIX command line and core tools would be very helpful.</li><li>Recent experience with a consumer facing online company and/or prior exposure to consumer financial products is highly desirable.</li><li>Self-motivated, results oriented, enthusiastic, and a creative thinker.</li></ul></ul></div></div><div><p></p><div>#LI-AS1 </div><p></p></div>"}