{"job title": "Research Scientist, Gene Editing, IPS/ES Differentiation", "company": "CRISPR Therapeutics AG", "city state": "– Cambridge, MA", "rating": "NA", "job description": "Research Scientist, Gene Editing, IPS/ES Differentiation\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nWe are seeking a talented research scientist to join an exciting, fast growing and well financed new company to develop novel methods to edit and differentiate ES/IPS cells to multiple lineages for various therapies. The ideal candidate will have significant research experience in ES/IPS differentiation and gene editing. The candidate must be skilled in cell biology, molecular biology, and analytical techniques to characterize gene edited differentiated cell populations. This position requires ability to dissect challenging problems, interact effectively with team members, and enthusiasm to solve difficult problems.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Originate, design, and manage completion of experiments in a timely and competent manner with minimal direction. Complete and summarize documentation, analyses, and interpretation of experimental results; apply results to the design of follow-up experiments and development of new methodology or avenues of research. Able to prioritize assigned work effort.</li>\n<li>Demonstrate decision-making, initiative, innovation, and leadership in research area. Show strategic thinking and planning along with an ability to prioritize short and long-term goals and objectives.</li>\n<li>Demonstrate scientific proficiency at advanced level, specifically a familiarity with relevant scientific literature and advances in the IPS/ES field. Conduct literature searches. Communicate understanding in appropriate internal &amp; external forums. Participate in external scientific community through publications and seminars/conferences.</li>\n<li>Investigate and apply a wide variety of scientific principles and concepts to potential inventions and products. Initiate invention memos and coordinate filing of relevant intellectual property.</li>\n<li>Interact with employees inside and outside of the immediate working group in a collegial, professional manner, sharing information and expertise. Foster communication and collaborative teamwork. Supervise or mentor junior personnel.</li>\n</ul>\n\n<strong>Minimum Qualifications</strong>\n\n\n<ul>\n<li>PhD in molecular and cell biology, with a focus on IPS/ES gene editing and differentiation</li>\n<li>Proficiency in a variety of molecular and cellular techniques, the successful candidate must have significant experience working with human IPS/ES cells</li>\n<li>A track record of managing junior scientists</li>\n<li>A strong track record of intellectually challenging oneself to enhance scientific capabilities</li>\n<li>Scientifically rigorous, highly organized, and with significant attention to detail</li>\n<li>Excellent oral and written communication skills</li>\n<li>Ability to work independently as well as collaborate with peers and effectively work in a results oriented research team environment</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>PhD with 1+ years of post-graduate experience or relevant experience during graduate work</li>\n<li>Significant experience with gene editing of IPS/ES cells required.</li>\n<li>Significant experience in IPS/ES related research and performing relevant molecular and cellular assays</li>\n<li>Prior experience with various molecular cloning techniques is highly desired</li>\n<li>Prior experience with in vivo evaluation of IPS/ES derived cells is preferred</li>\n</ul>\n\n<strong>Competencies</strong>\n\n\n<ul>\n<li>Collaborative Openness, One Team</li>\n<li>Undaunted Fearless, Can-do attitude</li>\n<li>Results Orientation Delivering progress toward our mission. Sense of urgency in solving problems.</li>\n<li>Entrepreneurial Spirit Proactive. Ownership mindset.</li>\n</ul>\n\nIf interested and qualified, please include Requisition # 2018-397 in the subject line when emailing resume to: careers@crisprtx.com.\n<br><br>\nCrispr Therapeutics, Inc. is committed to equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, gender, age, religion, national origin, ancestry, disability, veteran status, genetic information, sexual orientation or any characteristic protected under applicable law.<br><br>SDL2017"}