{"job title": "Data Scientist - Applied Technology", "company": "Crowe", "city state": "– Chicago, IL", "rating": "3.8", "job description": "<strong>Job Summary</strong><br><br>Given substantial growth and impact at Crowe, the machine learning team has formed into an official unit, Advanced Data Science (ADS), which is responsible for all machine learning and artificial intelligence throughout the firm. This team works on a wide variety of projects utilizing numerous areas of machine learning, including: supervised regression/classification, unsupervised learning, anomaly detection, NLP, reinforcement learning, deep learning, forecasting, etc.\n<br><br>\nLeverage large sets of structured and unstructured data to develop tactical and strategic insights. Collaborate with analytic and data teams to set objectives, approaches, and work plans. Research and evaluate new analytical methodologies, approaches, and solutions. Develop and validate statistical forecasting models and tools. Interpret and communicate analytic results to analytical and non-analytical business partners and executive decision makers.<br><br><strong>Company Overview</strong><br><br><strong>Your Journey at Crowe Starts Here:</strong>\n<br><br>\nAt Crowe, you have the opportunity to deliver innovative solutions to today’s complex business issues. Crowe’s accounting, consulting, and technology personnel are widely recognized for their in-depth expertise and understanding of sophisticated process frameworks and enabling technologies, along with their commitment to delivering measurable results that help clients build business value. Our focus on emerging technology solutions along with our commitment to internal career growth and exceptional client value has resulted in a firm that is routinely recognized as a “Best Place to Work.” We are 75 years strong and still growing. <strong>Come grow with us!</strong><br><br><strong>Qualifications</strong><br><br><strong>Education</strong>\n<ul>\n<li>Advanced degree (Masters at a minimum) in a quantitative field in one or more of the following:\n\n<ul>\n<li>Statistics</li> <li>Computer Science</li><li>Data Science</li><li>Engineering</li><li>Physics</li><li>Mathematics</li><li>Computational Social Science</li><li>[or similar academic pedigree]</li></ul></li>\n</ul>\n<strong>Experience</strong>\n<ul>\n<li>2+ years of experience in advanced analytics and machine learning model development and validation</li></ul>\n\n<ul>\n<li>2+ years of experience working on analytic-based projects and delivering results within scope, funding, and duration</li> \n</ul>\n<strong>Required Skills</strong>\n<ul>\n<li>Experience with a statistical package and various programming languages such as R, Python, Java, C++, SAS, Matlab, etc.</li><li>Experience with standard classification and regression techniques, including dimension reduction, feature selection and hypothesis testing</li><li>Strong communication skills with ability to explain modeling results to non-technical users</li><li>Capacity for a high degree of autonomy and out-of-the-box thinking</li>\n</ul>\n<strong>Preferred Skills</strong>\n<ul>\n<li>Experience with forecasting, anomaly detection, and clustering techniques</li><li>Neural networks (Feed-forward, CNN, RNN)</li><li>Experience writing SQL queries and linking to enable read/write to the database</li><li>Parallel Processing (CPU &amp; GPU)</li><li>Cluster and cloud computing: Spark, Mesos, Azure ML, Kubernetes, etc.</li><li>API Implementation (Flask, plumber)</li>\n</ul>\n<strong>About the Team:</strong>\n<br><br>\nApplied Technology professionals at Crowe lead the software development efforts for the firm and build technology solutions in a consistent and reliable way. Applied Technology owns the software development competency for the firm, which is tied to standardized processes, practices, policies and controls for client-facing products and projects. Team members share expertise across various industries, targeting manufacturing and distribution, government, healthcare, financial services, and private equity groups based on demand from other Business Units. You will learn and build on a wide range of technologies in an environment where innovation and new ideas are highly encouraged. Hop on board to join one of the fastest growing technology consulting practices in the industry!\n<br><br>\n<strong>Our Benefits:</strong>\n<br><br>\nAt Crowe, we know that great people is what makes a great firm. We value our people and offer employees a comprehensive benefits package.\n<br><br>\nLearn more about what working at Crowe can mean for you.\n<br><br>\n<strong>How You Can Grow:</strong>\n<br><br>\nWe will nurture your talent in an inclusive culture that values diversity. You will have the chance to meet on a consistent basis with your Career Coach that will guide you in your career goals and aspirations. Learn more about where talent can prosper.\n<br><br>\n<strong>More about Crowe:</strong>\n<br><br>\nCrowe (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world."}