{"job title": "Data Scientist", "company": "Crystal Dynamics", "city state": "– Redwood City, CA, United States", "rating": "3.5", "job description": "Crystal Dynamics, a part of the Square-Enix family and the studio behind the award-winning <em>Tomb Raider</em> game franchise, is constantly on the hunt to add even more top-tier gaming talent worldwide to our family. We pride ourselves on attracting and developing the best of the best to craft the most exciting projects in gaming. Our 25 years of development experience, as well as our studio members’ combined AAA game industry pedigree, has established us as one of the premier studios in the world today. Come and make us even better! Crystal Dynamics is headquartered in sunny Redwood City, CA, just south of San Francisco and north of San Jose.\n<br><br>\nJoin the studio as a <strong>Data Scientist</strong> analyzing and deciphering player behavior, feature effectiveness, and fraudulent activities in our games. Benefits for this full-time position include a competitive salary, 100% employer-paid medical, dental, and vision insurance options and 20 days of paid time-off. You also receive free access to a well-appointed 50,000’ foot athletic club (complete with a rock climbing wall and pool!), an impressive on-site cafeteria with food options for every palate, and a gorgeous natural campus by San Francisco Bay.\n<br><br>\n<strong>\n<br>\nPosition Summary:</strong>\n<br><br>\nCrystal Dynamics is actively looking for an experienced and motivated <strong>Data Scientist</strong> to join our team. The Data Scientist will work alongside Production, Marketing, Community, and Engineering to deliver advanced analytics. They will be responsible for using big data, machine learning tools, and visualization techniques to find consistent patterns and correlations that will help drive our KPIs with respect to player acquisition, retention and e-commerce.\n<br><br>\nThe ideal candidate should have a security mindset. This candidate should be able to leverage various statistical, AI, and machine learning methods to detect fraudulent behavior and anomalies.\n<br><br>\n<strong>Essential Duties:</strong>\n<ul>\n<li>Analyze large data sets to identify behavior trends among users using quantitative, statistical and machine learning techniques.</li><li>Drive analysis and insight to help build predictive models, tools and processes to support production goals of player acquisition, retention and e-commerce.</li><li>Collaborate with Production and Engineering on operational performance analysis, product requirements, monitoring and launch support.</li><li>Define KPIs, build dashboards, reports on chosen platforms.</li><li>Manage and own platform user data and act as subject matter expert on relevant KPI-s.</li><li>Respond to operational needs by providing analytical support.</li>\n</ul>\n<strong>Essential Requirements:</strong>\n<ul>\n<li>5+ years of experience in business or data analysis with experience from identity, e-commerce, online payments, or gaming industry.</li><li>Bachelor’s degree required in a quantitative discipline such as Mathematics, Statistics, Economics, Engineering, Operations Research, Computer Science</li><li>Strong analytical skills including the ability to interpret and manipulate large structured data to develop recommendations and analysis.</li><li>Proficiency with SQL, tools such as Tableau, and other statistical/reporting packages.</li><li>Proficiency with one of coding language, such as Python or Java.</li><li>Spark experience is a plus.</li><li>Self-motivated, work well both independently and as part of an agile team.</li>\n</ul>\n<strong>Preferred Experience:</strong>\n<ul>\n<li>Master’s degree required in a quantitative discipline such as Mathematics, Statistics, Economics, Engineering, Operations Research, Computer Science</li><li>Preferred experience with console development for current platforms</li><li>Have a clear understanding of Big Data tools mainly being Splunk, Hadoop, and Spark</li><li>Experience with Visualization tools and platforms.</li>\n</ul>\n<strong>Crystal Dynamics is an EOE and M/F/D/V employer.</strong>\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}