{"job title": "Data Scientist", "company": "Cummins Power South", "city state": "– Columbus, Indiana", "rating": "3.8", "job description": "<strong>Data Scientist</strong>\n<br><br>\n<strong>Description</strong>\n<br><br>\nCummins is a place big enough to coach and develop a global workforce and create the world’s leading clean, engine technology. We’re also small enough for you to find your fit and personal passion with a team of dependable, innovative thinkers who are developing their careers within a diverse, inclusive, empowering environment.\n<br><br>\nLearn more about this role and how you can begin <em>Working Right</em> .\n<br><br>\nOur Corporate Business Unit delivers reliable, durable, high performing products to our global partners. Working in an innovative space, you’ll develop high tech solutions that will fuel your advanced career skill set and empower you to own your career. Our integrated businesses demand the talents and creativity of individuals with a wide range of skills and experience.\n<br><br>\nThis is an exciting opportunity in Columbus, IN for Data Scientist. Cummins USA is where you can work on industry leading projects.\n<br><br>\n<strong>Your impact will happen in these and other ways:</strong>\n\n\n<ul>\n\n<li>\nWork with Science team members to further enhance models written in the R/SparkR language by parallelizing code and/or rewriting portions of it to make sure the algorithm can execute in a production such as Azure.</li>\n<li>\nOwn the responsibility to implement new models created in conjunction with or by the science teams and be responsible to taking it to production.</li>\n<li>\nWork with the ETL team to determine data needs to support data flow to deployed algorithms.</li>\n<li>\nWork with data scientist to develop and build data pipeline for models developed by data scientists.</li>\n<li>\nParticipate in the Agile process and meet goals/deadlines.</li>\n<li>\nParticipate in R maintenance and upgrades as necessary.</li>\n<li>\nBe willing to portions of large projects and be accountable for time-sensitive deliverables.</li>\n</ul>\n\n<strong>Skills and Experience Required:</strong>\n\n\n<ul>\n\n<li>\nR language development: <strong>Must</strong> have a minimum 3 years of experience developing, deploying, and managing analytics models in Microsoft Azure environment.</li>\n<li>\nExperience in performance tuning of R code.</li>\n<li>\nStrong knowledge SparkR within Microsoft Azure environment.</li>\n<li>\nWorking knowledge of the statics of linear models: linear regression, logistics regression, etc.</li>\n<li>\nGood understanding of machine learning alogorithms.</li>\n<li>\nR/SparkR programming (primarily, especially SparkR).</li>\n<li>\nPython/pyspark programming is a bonus.</li>\n<li>\nBuilding machine learning models, deployment, and maintenance.</li>\n</ul>\n\n<strong>Required Education, Licenses or Certifications</strong>\n<br><br>\nBachelor's or Master’s degree in Computer Science or related discipline or relevant equivalent experience.\n<br><br>\n<strong>Compensation and Benefits</strong>\n<br><br>\nBase hourly rate commensurate with experience . Additional benefits vary between locations and include options such as our 401(k) Retirement Savings Plan, Cash Balance Pension Plan, Medical/Dental/Life Insurance, Health Savings Account, Domestic Partners Coverage and a full complement of personal and professional benefits.\n<br><br>\n<strong>Cummins and E-verify</strong>\n<br><br>\nAt Cummins, we are an equal opportunity and affirmative action employer dedicated to diversity in the workplace. Our policy is to provide equal employment opportunities to all qualified persons without regard to race, gender, color, disability, national origin, age, religion, union affiliation, sexual orientation, veteran status, citizenship, gender identity and/or expression, or other status protected by law. Cummins validates right to work using E-Verify. Cummins will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee’s Form I-9 to confirm work authorization.\n<br><br>\nReady to think beyond your desk? Apply for this opportunity to start your career with Cummins today. careers.cummins.com\n<br><br>\nNot ready to apply but want to learn more? Join our Talent Community to get the inside track on great jobs and confidentially connect to our recruiting team: http://connect.find.ly/cummins\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Job</strong> QUALITY\n<br><br>\n<strong>Primary Location</strong> United States-Indiana-Columbus-US, IN, Columbus, General Office Building\n<br><br>\n<strong>Job Type</strong> Experienced - Professional / Office\n<br><br>\n<strong>Recruitment Job Type</strong> Professional - Experienced\n<br><br>\n<strong>Job Posting</strong> Apr 3, 2017, 2:43:33 PM\n<br><br>\n<strong>Unposting Date</strong> Ongoing\n<br><br>\n<strong>Req ID:</strong> 1700019Y"}