{"job title": "Data Analyst", "company": "Curtiss-Wright Corporation", "city state": "– Clearwater, FL", "rating": "3.2", "job description": "The Opportunity - Data Analyst\n<br><br>\nA Data Analyst interprets data and turns it into information which can offer ways to improve a business, thus affecting business decisions. Data Analysts gather information from various sources and interpret patterns and trends. Once data has been gathered and interpreted, the Data Analyst will report back what has been found in a comprehensive study to the wider business/relevant colleagues.\n<br><br>\nMajor Accountabilities /Deliverables\n<br><br>\nAs a Data Analyst, you will play a key role in recommendations about the methods and ways in which the business obtains and analyses data to improve quality and the efficiency of data and recommends changes to current and future requirements. Responsibilities include, but not be limited to:\n\n\n<ul>\n<li>Collecting and interpreting data</li>\n<li>Analysing results</li>\n<li>Reporting the results back to the relevant members of the business</li>\n<li>Identifying patterns and trends in data sets</li>\n<li>Working alongside teams within the business or the management team to establish business needs</li>\n<li>Defining new data collection and analysis processes</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>University degree in computer science or a related field</li>\n<li>4 years plus experience in data models and reporting packages</li>\n<li>Ability to analyse large datasets</li>\n<li>Ability to write comprehensive reports</li>\n<li>An analytical mind and inclination for problem-solving</li>\n<li>Attention to detail</li>\n<li>Strong verbal and written communication skills</li>\n</ul>\n\nThis position may require exposure to information which is subject to US export control regulations, i.e. the International Traffic in Arms Regulations (ITAR) or the Export Administration Regulations (EAR). All applicants must be U.S. persons within the meaning of U.S. regulations.\n<br><br>\nCurtiss-Wright values diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. If you require accommodation due to a disability at any time during the recruitment and/or assessment process, please contact Talent Acquisition and we will make all reasonable efforts to accommodate your request.\n<br><br>\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}