{"job title": "Data Scientist", "company": "Custora", "city state": "– New York, NY", "rating": "5.0", "job description": "Data science is the core around which Custora is built. The central value proposition of our product is that we provide e-commerce businesses the ability to:\n\n<ul>\n<li>organize the overwhelming amount of data they deal with</li>\n<li>analyze it for patterns and predictions</li>\n<li>deliver these insights in a readily accessible, freely explorable way</li>\n<li>and do it again, repeatedly and reliably, as more data comes in the door</li>\n</ul>\nThe data science team at Custora can be found hard at work at each step above. Our projects range from the development and refinement of statistical models, to the design and implementation of scalable back-end infrastructure that powers our analyses, to collaboration with other teams at Custora to make sure customers get the most out of our analyses.\n<br><br>\nWe place particular emphasis on providing a robust <em>system</em> of statistical insights. Our goal is not to deliver a single paper or presentation's worth of material, but to give our customers a powerful analytical toolbox. We can help them use it, but we also want them to be able to take it and run with it, exploring their data on their own and finding uses for our models that we hadn't even thought of.\n<br><br>\nOn top of that, we have an expanding customer base and a growing interest in developing analyses and statistical modeling pipelines that extend beyond e-commerce. With more customers, richer data sets, and new domains of exploration, we'll face bigger and bigger challenges, but we think we're up for it, and we are looking for people who want to join us for the ride.\n<br><br>\n<strong>Specifically, we are looking for:</strong>\n\n<ul>\n<li>A solid foundation in statistics, either demonstrated through academic study or work experience.</li>\n<li>Experience with at least two programming languages and one general-purpose statistical package or programming library. The data science team mainly uses R, Scala, and Ruby, but that's not set in stone, and we value the ability to learn new libraries and ecosystems.</li> \n\n<li>Friendly and ready to work with others, both technical and non-technical. We don't work in isolation and regularly interact with each other and members of other teams.</li> \n\n<li>At least some familiarity with: Unix-like operating systems, SQL databases, and web application programming. Strong experience in any is a plus.</li> \n\n<li>Other pluses: experience with distributed-computing ecosystems like Spark; experience with Amazon Web Services; experience teaching statistics or programming</li>\n</ul>\n<strong>What</strong> <strong>it's</strong> <strong>like</strong> <strong>to</strong> <strong>work</strong> <strong>here:</strong>\n\n<ul>\n<li>On Monday we eat and meet as a team to chat projects and progress.</li>\n<li>We're 45 genuinely nice people. We work together and experiment with how to do things. It's an amazing environment to both explore your professional interests and shape your career trajectory.</li>\n<li>We move quickly. You build something and the next day it comes to life. You see and feel an immediate impact with the collective efforts of the team.</li>\n<li>We're building a company and a team we love. We're in it for the long run.</li>\n<li>Read more about what makes us, us here.</li>\n<li>Find out more here or here.</li>\n</ul>\n<strong>The perks</strong>\n\n<ul>\n<li>We're a flexible work environment</li>\n<li>Competitive salary and meaningful equity</li>\n<li>Health, dental and vision insurance (100% covered)</li>\n<li>Free lunch every day, plus free water hot and cold!</li>\n<li>Unlimited vacation: take as much time as you need (we recommend at least 3 weeks)</li>\n<li>Monthly unlimited MetroCard</li>\n</ul>\nCustora is an equal opportunity employer. We value diversity. We don't discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, marital status, veteran status, disability status, or socioeconomic status."}