{"job title": "Senior Data Scientist", "company": "CyberCoders", "city state": "– Redwood City, CA", "rating": "4.0", "job description": "Senior Data Scientist <div>\nIf you are a Data Scientist with experience, please read on!<br><br>Based in the tech hub of Redwood City, CA, our technology provides state of the art financial advice to our growing list of loyal clients. We consistently receive rave reviews from both our employees and clients based on the quality of work we provide and our unbeatable company culture. Our ample amount of funding will allow us to grow our workforce and continue taking the financial industry by storm!\n</div>\n\nWhat You Will Be Doing<div>\nYou will be using our proprietary database to analyze and develop automated investment strategies in addition to collaborating with other departments to create new and innovative products.\n</div>What You Need for this Position<div>\nAt Least 4 Years of Experience and Knowledge of:<br><br>- R or Python<br>- SQL<br>- Consumer facing technology products<br>- Complex data analysis <br>- Building statistical models<br><br>Nice to have skills: <br><br>- Scala<br>- AWS<br>- Java<br>- Financial Industry\n</div>What's In It for You<div>\n- Competitive Compensation of $160k - $220k DOE <br>- 100% Medical<br>- Gym membership<br>- Free drinks &amp; snacks<br>- Convenient location with free Caltrain GoPass!<br>- Bond with your coworkers at company sponsored social activities!\n</div><div>\nSo, if you are a Senior Data Scientist (Consumer facing) with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}