{"job title": "Data Scientist / Machine Learning Consultant", "company": "CyberCoders", "city state": "– Newark, NJ", "rating": "4.0", "job description": "Data Scientist / Machine Learning Consultant <div>\nBased in beautiful Newark, NJ, we are a global Technology company that specializes in the financial industries. Due to growth and demand for our services, we are in need of hiring for several Data Scientist / Machine Learning Consultants that possesses strong experience with Machine Learning or Artificial Intelligence, Must have a minimum of 2 years Python and R programming experience, and must have 2 years experience using Python Tool sets. These are 12 month contracts that may be extended.<br><br>If you are a Data Scientist/ Machine Learning Consultant with experience, please read on!\n</div>\n\nWhat You Will Be Doing<div>\n--Build &amp; Optimize Machine Learning or AI models<br>--Analyze Structured &amp; Unstructured Data<br>--Analyze patterns, anomalies, relationships &amp; trends in high dimensionality data<br>--Working knowledge of Regression, Classification, Machine Vision, Natural Language processing, Deep Learning and or statistical modeling\n</div>What You Need for this Position<div>\nAt Least 2 Years of experience and knowledge of:<br><br>-- R &amp; Python Programming language<br>--Python Tools<br>-- 2 years of experience with Machine Learning or Artificial Intelligence<br>--Financial Industry experience<br>--STEM Degrees : BS, MS or PhD.\n</div>What's In It for You<div>\n--Amazing work!<br>--Excellent long term contract<br>--High hourly rate<br>--Possible remote with good experience\n</div><div>\nSo, if you are a Data Scientist/ Machine Learning Consultant with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}