{"job title": "Principal Data Scientist", "company": "CyberCoders", "city state": "– Boston, MA", "rating": "4.0", "job description": "Principal Data Scientist <div>\nIf you are a Senior or Principal Data Scientist with experience, please read on!<br><br>Featured on Forbes, TechCrunch, VentureBeat, and Harvard Business Review, we're a venture capital backed digital AdTech SaaS organization helping companies use data to drive decisions. We combine business experience, expertise in large-scale data analysis and visualization, and advanced software engineering know-how to deliver results. From aerospace to finance to pharma, we help companies prototype, develop, and deploy bespoke data science and data visualization solutions to make better marketing decisions.\n</div>Top Reasons to Work with Us<div>\nAWARD WINNING Culture + FOUNDATION ~$50million in VC Funding<br>EXCELLENT Compensation (140k - 170K + MERIT BONUS)<br>FANTASTIC Location - Awesome Central Location in Financial District<br>INCREDIBLE SUITE of Benefits (Medical, Vision, Dental, GYM Benefits, 401K Match)\n</div>What You Will Be Doing<div>\n-Help to drive the analytical scope and method for projects, including formulating and shaping the models<br>-Use Math, Stats and Machine learning to derive key insights across various industry sectors including sports, pharma, automotive and high-tech.<br>-Lead the data science aspect of multiple engagements at the same time<br>-Work on complex data sets from some of the world's largest organizations<br>-Work in a multi-disciplinary environment mixing highly skilled people in data science, data engineering and design<br>-Build strong links with the academic world and constantly share ideas and stay ahead of the curve on the latest methods<br>-Help grow and shape an elite team of world-class data scientists\n</div>What You Need for this Position<div>\n-M.S or Ph.D degree in the field of Computer Science, Machine Learning, Applied Statistics or Mathematics<br>-Experienced in building analytic solutions in one or more domains like Finance, Healthcare, Retail, Digital Marketing, Advertising, <br>-Experience working with customers and partners in a collaborative manner<br>-Experience in deep learning frameworks (Keras, TensorFlow, CNTK, Theano, Caffe, Torch, H2O).<br>-Solid understanding of analytic tools such as Python, R SAS, SPSS, KNIME, RapidMiner etc.<br>-Excellent communication skills and ability to lead a team of data scientists, software engineers and program managers in a collaborative manner.<br>-Publications in related fields (deep learning, machine intelligence, data mining, etc.) preferred\n</div>What's In It for You<div>\n- Vacation/PTO<br>- Medical<br>- Dental<br>- Vision<br>- Relocation<br>- Bonus<br>- 401k\n</div><div>\nSo, if you are a Principal or Senior Data Scientist looking for a fantastic new opportunity in Boston, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}