{"job title": "Team Lead Computer Vision/Machine Learning Engineer", "company": "CyberCoders", "city state": "– Palo Alto, CA", "rating": "4.0", "job description": "Team Lead Computer Vision/Machine Learning Engineer <div>\nI am currently working with several companies in the area who are actively hiring in the field of Computer Vision and Deep Learning. AI, and specifically Computer Vision and Deep Learning are my niche market specialty and I only work with companies in this space.<br><br>I am actively recruiting for multiple levels of seniority and responsibility, from experienced Individual Contributor roles, to Team Lead positions, to Principal Level Scientists and Engineers.<br><br>I offer my candidates the unique proposition of representing them to multiple companies, rather than having to work with multiple different recruiters at an agency, or applying directly to many different companies without someone to manage the process with each of those opportunities. In one example, I am working with a candidate who is currently interviewing with 10 different clients of mine for similar roles across the country with companies applying Computer Vision and Deep Learning to various different applications from Robotics, Autonomous Vehicles, AR/VR/MR, Medical Imaging, Manufacturing Automation, Gaming, AI surveillance, AI Security, Facial ID, 3D Sensors and 3D Reconstruction software, Autonomous Drones, etc.<br><br>I would love to work with you and introduce you to any of my clients you see as a great fit for your career! Please send me a resume and tell me a bit about yourself and I will reach out and offer some times to connect on the phone!\n</div>Top Reasons to Work with Us<div>\nSome of the current openings are for the following brief company overviews:<br><br>Company 1 - company is founded by 3x Unicorn (multi-billion dollar companies) founders and are breaking into a new market with advanced technology, customers, and exciting applications including AI surveillance, robotics, AR/VR.<br><br>Company 2 - Autonomous Drones! Actually, multiple different companies working on Autonomous Drones for different applications - including Air-to-Air Drone Security, Industrial Inspection, Consumer Drones, Wind Turbine and Structure Inspection.<br><br>Company 3 - 3D Sensors and 3D Reconstruction Software - make 3D maps of interior spaces using our current products on the market. We work with builders, designers, Consumers and Business-to-Business solutions. Profitable company with strong leadership team currently in growth mode!<br><br>Company 4 - Industrial/Manufacturing/Logistics automation using our 3D and Depth Sensors built in house and 3D Reconstruction software to automate processes for Fortune 500 clients. Solid funding and revenue approaching profitability in 2018!<br><br>Company 5 - Hand Gesture Recognition technology for controlling AR/VR environments. We have a product on the market as of 2017 and are continuing to develop products for consumers and business applications that are used in the real and virtual world. We have recently brought on a renowned leader in Deep Learning and it's intersection with neuroscience and are doing groundbreaking R&amp;D in this field!<br><br>Company 6 - Full facial tracking and reconstruction for interactive AR/VR environments.<br><br>Company 7 - massively scalable retail automation using Computer Vision and Deep Learning, currently partnered with one of the largest retailers in the world. <br><br>Company 8 - Products in the market including 3D Sensors, and currently bringing 3D reconstruction capabilities to mobile devices everywhere. Recently closed on a $50M round of funding and expanding US operations. <br><br>Company 9 - Mobile AI company using Computer Vision for sports tracking and real time analytics for players at all levels from beginner to professional athletes to track, practice and improve at their craft.<br><br>Company 10 - Digitizing human actions to create a massive new dataset in manufacturing - augmenting the human/robot working relationship and giving manufacturers the necessary info to improve that relationship. We believe that AI and robotics will always need to work side by side with humans, and we are the only company providing a solution to this previously untapped dataset!<br><br>Company 11 - 3D facial identification and authentication for security purposes. No more key-fobs and swipe cards, our clients use our sensors and software to identify and permit employees.\n</div>What You Will Be Doing<div>\nIf you are interested in discussing any of these opportunities, I would love to speak with you! I am interested in learning about the work you are currently doing and what you would be interested in for your next step. If the above opportunities are not quite what you're looking for but would still like to discuss future opportunities and potential to work together, I would love to meet you! I provide a free service to my candidates and work diligently to help manage the stressful process of finding the right next step in your career. The companies that I work with are always evolving so I can keep you up to date on new opportunities I come across.<br><br>Please apply to this job, or shoot me an email at richard.marion@cybercoders.com and let's arrange a time to talk on the phone.\n</div>What You Need for this Position<div>\nGenerally, I am looking for Scientists/Engineers in the fields of Computer Vision, Deep Learning and Machine Learning.<br><br>I find that a lot of my clients are looking for folks who have experience with 3D Reconstruction, SLAM / Visual Odometry, Object Detection/Recognition/Tracking, autonomy, Point Cloud Processing, Software and Algorithm development in C++ (and C++11 and C++14), GPU programming using CUDA or other GPGPU related stuff, Neural Network training, Sensor Fusion, Multi-view stereo, camera calibration or sensor calibration, Image Segmentation, Image Processing, Video Processing, and plenty more!<br><br>- Team Lead experience!<br>- Machine Learning<br>- Computer Vision<br>- Deep Learning<br>- Tensorflow<br>- OpenCV<br>- CUDA<br>- Python<br>- Neural Networks\n</div>What's In It for You<div>\nA dedicated and experienced Computer Vision placement specialist! If you want to trust your job search in the hands of a professional who takes care and pride in their work, and will bring many relevant opportunities your way - I would love to work with you!\n</div><div>\nSo, if you are a Computer Vision Scientist or Engineer and are interested in having a conversation about the market and some of the companies I am working with, please apply or shoot me an email with resume today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}