{"job title": "Machine Learning Engineer", "company": "CyberCoders", "city state": "– Palo Alto, CA", "rating": "4.0", "job description": "Machine Learning Engineer <div>\nIf you are a Machine Learning Engineer with experience, please read on!</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>Highly competitive compensation and benefits package.</li>\n<li>Opportunity to work on highly dynamic innovations in AI - Autonomous Driving.</li>\n<li>Unlimited PTO.</li></ul></div>\n\n\nWhat You Will Be Doing<div>\nConstant focus on deployment and Iteration on novel unsupervised learning algorithms at petabyte scale.\n<br><br>\nHighly intensive collaboration with the research team to implement and maintain a steady stream of deep learning experiments.\n<br><br>\nOwn and develop to maintain petabyte scale data/training/experiment analysis infrastructure on EC2</div>\n<br>\nWhat You Need for this Position<div>\nLess Than 1 Year of experience and knowledge of:\n\n\n<ul>\n<li>Neural Networks</li>\n<li>Tensorflow</li>\n<li>ML Toolkits</li>\n<li>Python</li>\n<li>R</li>\n<li>Statistics</li>\n<li>Mathematics</li>\n<li>Petabyte Scale</li>\n<li>AWS</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Vacation/PTO</li>\n<li>Medical</li>\n<li>Dental</li>\n<li>Vision</li>\n<li>Relocation</li>\n<li>Bonus</li>\n<li>401k</li></ul></div>\n\n\n<div>\nSo, if you are a Machine Learning Engineer with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}