{"job title": "Senior Computational Biologist / Data Scientist", "company": "CyberCoders", "city state": "– Saint Louis, MO", "rating": "4.0", "job description": "Senior Computational Biologist / Data Scientist <div>\nIf you are a data scientist with hands on experience developing and analyzing complex biological data sets, please read on!<br><br>Based in St. Louis, we are a technology startup that just received 40 million in funding. We are in the agricultural solutions space focusing on unlocking the global genetic potential of plants to enhance the sustainability of food, feed, fiber and fuel production. We and our partners harness natural and novel genetic variation through breeding, trait development, and genome editing to develop products that accelerate crop improvement.\n</div>Top Reasons to Work with Us<div>\n- Competitive salary + Bonus + Equity <br>- Dynamic and exciting work environment<br>- Full Benefits (health, dental, vision, etc.)<br>- 401k match<br>- Casual work environment<br>- Partial time at work to continue your own creative ventures<br>- Working with some of the brightest minds in the world\n</div>What You Will Be Doing<div>\n- Working in a collaborative team and taking constructive feedback favorably <br>- Demonstrating agility and the ability to deliver in a highly dynamic, fast paced environment with multiple priorities <br>- Producing deliverables and meeting tight deadlines <br>- Effectively communicating through multiple channels <br>- Planning, organizing, solving problems and critical thinking\n</div>What You Need for this Position<div>\n5+ years hands-on experience developing and analyzing complex biological data sets with actionable outputs<br>- Experience using large genetic, or -omic data sets to solve problems in biology or molecular genetics<br>- Python (or java / related scripting language)<br>- AWS<br>- Experience using advanced statistical, machine learning, and AI concepts, methodologies and libraries<br>- PhD in computational biology, population genetics, mathematics, crop science, stats, etc. is preferred\n</div>\n\n<div>\nSo, if you are a Senior Data Scientist with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}