{"job title": "Sr. Data Scientist", "company": "CyberCoders", "city state": "– Pleasanton, CA", "rating": "3.8", "job description": "Sr. Data Scientist <div>\nBased in the East Bay, we are dedicated to creating game-changing SaaS solutions to be used by tens of thousands of businesses nationwide everyday. Currently, we are looking for a Sr. Data Scientist who values a high performance working environment, that empowers it's employees to have a direct impact on the company's success and growth.\n</div>Top Reasons to Work with Us<div>\n-Innovative, collaborative team environment!<br>-Great benefits!<br>-Career growth opportunities!\n</div>What You Will Be Doing<div>\n-Responsible for building the next generation Conversational AI systems<br>-Develop scalable NLP based components to reduce noise in unstructured data, query intent classification, dialog understanding and domain detection.<br>-Drive the machine regression / classification, normalization pipeline and analysis of queries using NLP, Deep Learning where the data is sparse and high-dimensional.<br>-Build algorithms required to gain deeper insights on data from thousands of interactions.<br>-Leverage massive datasets for modeling, real time recommendations and insight generation.\n</div>What You Need for this Position<div>\n-Extensive statistical analysis experience in Python/R/Julia.<br>-Experience with massive real-time data ingestion, pipeline, and enrichment services leveraging modern API architectures <br>- Experience with bigdata technologies (e.g., Hadoop, Pig, Spark, Cosmos).<br>- Experience with NLP and Deep Learning <br>-Must be strong in building algorithms\n</div>What's In It for You<div>\n-Competitive Base Pay (DOE)<br>-Equity<br>-Full Medical benefits<br>-401(k) with company match up to first 6%<br>-PTO<br>-Health/Wellness Initiatives<br>-Casual working environment<br>-Team events and outings<br>-Much more!\n</div><div>\nSo, if you are a Sr. Data Scientist with experience, please apply today or send me your resume to Rachel.Hilton@CyberCoders.com!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}