{"job title": "Executive Data Scientist*", "company": "CyberCoders", "city state": "– Sunnyvale, CA", "rating": "3.8", "job description": "Executive Data Scientist* <div>\nIf you are a Executivel Data Scientist with experience, please read on!\n<br><br>\nWe are a cutting edge technology company dominating the IoT (Internet of Things) market where we solve real world problems in real-time for our clients. We connect entire ecosystems creating digital enterprises. Due to growth and demand for our product and services, we are in need of hiring an Executive Data Scientist who has experience and passion for driving teams to exceptional while being hands-on with a product focused mind set. We are looking for a talented individual who has Machine Learning, NLP, and AI experience as well as expertise with Python, R, Java, or full stack development.\n<br><br>\nIf you are interested in joining a leading technology company that cares about its employees and their environment, then apply immediately.</div>\n<br>\nTop Reasons to Work with Us<div>\nCompetitive Salary\n<br>\n100% Paid Medical Benefits\n<br>\nBonus\n<br>\nGenerous Equity</div>\n<br>\nWhat You Will Be Doing<div>\nIn this role, you will bring your passion for technology and apply your skills to our platform. You will be a dynamic hands-on leader playing a key role in additions to our data science team. You will be responsible for both research and technical aspects of projects reporting directly to the CEO.</div>\n<br>\nWhat You Need for this Position<div>\nMore Than 5-10 Years of experience and knowledge of:\n<br><br>\nMachine Learning / Python / R\n<br>\nNatural Language Processing\n<br>\nDeep Learning\n<br>\n<strong>AI</strong>\n<br>\nBig Data\n<br>\nPredictive Analytics\n<br>\nAlgorithms\n<br>\nDistributed Computing</div>\n<br>\nWhat's In It for You<div>\n200k$-$300k + Bonus (DOE)\n<br>\n<strong>100% PAID MEDICAL</strong>\n<br>\nBonus\n<br>\nEquity\n<br>\nCreate cutting technology\n<br>\nHighly collaborative environment</div>\n<br>\n<div>\nSo, if you are an Executive Data Scientist with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}