{"job title": "Senior Database Administrator, Data Engineering", "company": "CyberCoders", "city state": "– Yonkers, NY", "rating": "4.0", "job description": "Senior Database Administrator, Data Engineering <div>\nIf you are a Senior Database Administrator, Data Engineering with experience, please read on!\n</div>Top Reasons to Work with Us<div>\nWe're building a diverse workforce that reflects our society, embraces new ways of thinking, celebrates a wide breadth of experiences, and reflects all of the audiences we serve.<br><br>Inclusion means valuing the uniqueness that each staff member brings by creating an environment where everyone is welcome. Our objective is simple: for all employees to feel supported so that they're set up for success.\n</div>What You Will Be Doing<div>\nWe are seeking an strong DBA with strong Oracle, MongoDB, unix, and AWS skills. The DBA is responsible for capacity planning, installation, on-going maintenance of all our databases that support various Ecommerce Applications and Internal Data Management Applications. This is hands-on technical role who will architect, administer, and provide 24-7 support as needed for ensuring there is minimal downtime to the production applications. The DBA will work with multiple cross functional teams ( System Admins, DevOps, Ecommerce Engineering, Web Engineering) to understand their data / database needs and provide/implement solutions as needed. The DBA will also work on proposals for future database architecture for the company.<br><br>Key Responsibilities:<br><br>Performs the capacity planning required to create and maintain the databases, and Install new software, versions, updates, patches on the databases servers.<br><br>Plans and implements monitoring, backup, and recovery of the Oracle database.<br><br>Develop Automation scripts for creating,installing,monitoring the databases<br><br>Develops scripts for Large-scale data migrations and ETLs.<br><br>Implements and enforces security for all of the Oracle Databases.<br><br>Ensures database availability with zero to minimal downtime, and be available off hours to support any production database issues.<br><br>Troubleshoots with problems regarding the databases, applications and development tools; Performs ongoing tuning of the database instances; controls migrations of programs, database changes, and reference data changes through the development lifecycle.<br><br>Work with other system admins, DevOps, software engineers, database developers, infrastructure, operations and QA teams and support their database project needs as required.\n</div>What You Need for this Position<div>\nExpert Hands-on Oracle DBA with experience in ;<br><br>- Oracle database installations on AWS (12.2 preferably with ASM, Grid Infrastructure, and Data Guard)<br>- Oracle security management<br>- Oracle backup and recovery scenarios<br>- Skills to Automate installation and creation of databases with standby configuration<br>- Performance tuning - both Oracle and also operating system performance monitoring<br>- Expert in Oracle Sql / PlSql<br><br>Expert in Unix Shell Scripting<br><br>Solid Knowledge of MongoDB and administration<br><br>Experience administering database on AWS cloud. ( Exposure to Amazon RDS and MongoDB Atlas is a plus)<br><br>Experience in development and implementation of large-scale data migrations\n</div>What's In It for You<div>\nBuild your future<br>Our 401(k) and retirement plans offer a range of options to help prepare for the day you choose to stop working and take up skydiving or spelunking. With a variety of investment choices and an excellent employer match, your savings will grow right along with your career. As you build your future, you can also take advantage of our credit union to make the most of your money while you're still working.<br><br>Stay Centered<br>Sure, we have best-in-class medical, dental, and vision benefits, but our wellness programs also help you build and maintain a healthy mind and body. Exercise classes, gym reimbursement, and nutrition counseling are just a few ways we help you bring your whole self to work.<br><br>Find Balance<br>We ask you to work hard for consumersbut in exchange, our vacation, illness, and holiday schedules allow you time to recharge. Add in amenities such as farm-to-table produce deliveries, on-site dry cleaning service, and an employee assistance program to help manage life's unexpected challenges, and life feels like less work.<br><br>Expand your Horizons<br>We offer our employees an integrated approach to professional development. A combination of on-site training, e-learning, external training, and tuition reimbursement set you up for success and prime you for the next challenge.\n</div><div>\nSo, if you are a Senior Database Administrator, Data Engineering with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}