{"job title": "Senior Director of Data Science", "company": "CyberCoders", "city state": "– Bellevue, WA", "rating": "4.0", "job description": "Senior Director of Data Science <div>\nIf you are a Senior Director of Data Science with a PhD or an MBA, please read on!<br><br>We are a world famous company e-commerce company with excellent benefits and access to a massive amount of data that needs analyzing! <br><br>Our Data Science team is looking for a Senior Director of Data Science to lead our team in tackling problems related to fraud and cybersecurity.\n</div>\n\nWhat You Will Be Doing<div>\nApply Data Science and Machine Learning Techniques to make new businesses cases and lead them to production.<br>Lead adoption of the analytic frameworks across the company<br>Collaborate and consult leaders across the company for BI and Data Science solutions<br>Lead an extremely high performing team.<br>Make the team's vision a reality using a roadmap <br>Use Machine Learning to develop solutions\n</div>What You Need for this Position<div>\n- PhD in Computer Science is Required<br>- MBA is also preferred <br>- 5+ years experience manging a data science team<br>- 10+ years of Data Science experinece<br>- Hadoop<br>- Hive<br>- hBase<br>- SPARK<br>- Machine Learning<br>- Tensorflow<br>- Deep Neural Networks<br><br>BIG PLUS:<br>- Fraud &amp; Security Experience\n</div>What's In It for You<div>\n- Competitive Pay<br>- Travel Allowance<br>- Fitness Allowance<br>- Tuition Reimbursement<br>- Sick days<br>- Vacation/PTO<br>- Medical<br>- Dental<br>- Vision<br>- 401k - 6%\n</div><div>\nSo, if you are a Senior Director of Data Science with a PhD in Computer Science or an MBA, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}