{"job title": "Marketing Data Scientist", "company": "CyberCoders", "city state": "– Bellevue, WA", "rating": "4.0", "job description": "Marketing Data Scientist <div>\nIf you are a Data Scientist with a Master of Science degree, please read on!<br><br>We are a world famous company e-commerce company with excellent benefits and access to a massive amount of data that needs analyzing! Our Marketing Data Science team is looking for several Data Scientists. You and your team will collaborate with leaders and cross-functional teams such as engineering, product, and applied research.<br><br>Your work will impact millions of customers. <br><br>Read below and apply -- I would like to chat with you!\n</div>\n\nWhat You Will Be Doing<div>\nWork with large volumes of data to extract insights regarding customer journey and behavior.<br>Reveal isight into pricing proposals<br>Redefine our bidding algorithms <br>Present your findings to other stakeholders<br>Build tools for scalable insights\n</div>What You Need for this Position<div>\n- Master of Science in a Quantitative Field<br>- 3+ Years of relevant work experience on top of your graduate degree<br>- Python<br>- R<br>- SAS<br>- SQL<br>- Hadoop\n</div>What's In It for You<div>\n- Travel Allowance<br>- Fitness Allowance<br>- Tuition Reimbursement<br>- Sick days<br>- Vacation/PTO<br>- Medical<br>- Dental<br>- Vision<br>- 401k - 6%\n</div><div>\nSo, if you are a Marketing Data Scientist with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}