{"job title": "Lead Data Scientist - CNN, Machine Learning", "company": "CyberCoders", "city state": "– West Hollywood, CA", "rating": "4.0", "job description": "Lead Data Scientist - CNN, Machine Learning <div>\nAre you an Expert with Convolutional Neural Networks?<br>Do you have Tensorflow experience?<br><br>If you said yes to the above questions, keep reading! <br><br>We are a new, well-funded startup in West Hollywood, CA, using Deep Learning to solve longstanding problems in the biology field. <br><br>We are looking to bring on an a Lead Data Scientist who is a CNN Expert to our team ASAP!<br><br>--WE WILL RELOCATE THE RIGHT CANDIDATE!--\n</div>\n\n\n\nWhat You Need for this Position<div>\n- PhD, or published CNN expert<br>- Convolutional Neural Networks<br>- Deep Learning <br>- Tensorflow<br><br>Plus Skills! (not required)<br>+ RNN<br>+ General Adversarial Networks or Autoencoders<br>+ Reinforcement Learning<br>+ Biology/Medical Related Skill Set\n</div>\n\n<div>\nSo, if you are a Lead Data Scientist who is a CNN Expert, please apply today!<br><br>Or, send your resume directly to Stephanie.Cluney@CyberCoders.com\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n <br><br>\n CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance."}