{"job title": "SQL Developer/Data Engineer", "company": "Cyber Guardian Consulting Group, LLC.", "city state": "– Kingston, NY", "rating": "NA", "job description": "Job Description<div><strong>CYBER GUARDIAN CONSULTING GROUP</strong> is a regional leader in cyber security and IT, providing innovative, customizable solutions and unparalleled services for almost a decade. We empower clients in healthcare, law, insurance, real estate and government with cutting-edge technologies and solutions that improve their bottom lines while protecting against the lethal threat landscape in today's world of business.\n<br><br>\nOur 'Client-first' focus has made CYBER GUARDIAN CONSULTING GROUP one of the most respected IT companies in the Greater Hudson Valley area. We value our clients and believe that strong relationships are the foundation for a strong company, and we're dedicated to providing quality and state-of-the-art offerings to these industries.\n<br><br>\n<strong>Company Culture:</strong> We constantly deal with confidential data and we take our work very seriously. If you’re a smart, hard-working, dedicated individual who thrives in a friendly work environment, CYBER GUARDIAN CONSULTING GROUP may be the place for you. We’re committed to attracting good people who are passionate about the work they do.\n<br><br>\nCYBER GUARDIAN CONSULTING GROUP was built on the values of innovation, efficiency, and service created in a collaborative work culture. As we have grown, we are proud to still possess the same energy and passion for what we do. We strive to provide exceptional customer experiences to our clients, which begins with first employing amazing people. CYBER GUARDIAN CONSULTING GROUP is proud to maintain a high-quality, innovative, and diverse workforce.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nEssential Duties and Responsibilities:\n<br><br>\n• Extract data from Client’s machines and restoring databases.\n<br><br>\n• Identify data elements from various database as requested by client.\n<br><br>\n• Working with Several Different Database Management Systems.\n<br><br>\n• Be very proficient with SQL Server.\n<br><br>\n• Strong SQL skills (SQL Server, Oracle, MySQL, Postgres etc.).\n<br><br>\n• Experience in database design and structure, with an emphasis on scalability.\n<br><br>\n• A strong desire to develop new and innovative ways to improve data storage and processing.\n<br><br>\n• Prepare and perform data analysis and transformations to align data to business rules.\n<br><br>\n• Work with our clients Subject Matter Experts to obtain a greater understating of the business needs and goals.\n<br><br>\n• Contribute to knowledge management activities and promote best practices for project execution.\n<br><br>\n• Programming experience required in any object-oriented programming languages like C#, Java, etc.\n<br><br>\n• Excellent SQL skills, with experience in building and interpreting complex queries.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n- Must have a High School Diploma or equivalent.\n<br><br>\n<strong>Nice-to-Haves:</strong>\n<br><br>\n• Azure knowledge preferred.\n<br><br>\n• Experience in Data Science/Machine Learning is a plus.\n<br><br>\n<strong>Additional Information:</strong>\n<br><br>\nThis is a full-time, onsite position at our HQ currently located in Kingston, NY.\n<br><br>\nFor more information on our company, visit HTTPS://CYBERGUARDIAN.CONSULTING\n<br><br>\nInterested applicants should submit a letter of interest with salary requirements and resume.\n<br><br>\nCYBER GUARDIAN CONSULTING GROUP, LLC. is a Smoke-Free Workplace.\n<br><br>\nApplicants must be authorized to work in the U.S.\n<br><br>\nCYBER GUARDIAN CONSULTING GROUP, LLC. is proud to be an Equal Opportunity Employer\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\nYour Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.</div>"}