{"job title": "Data Scientist - Sports Analytics", "company": "CyberCoders", "city state": "– New York City, NY", "rating": "3.8", "job description": "Data Scientist - Sports Analytics <div>\nWe are a 10 man startup team that creates products that make it more simple to bet on sports! The industry is now legal and booming! We have a stellar team, dedicated to engineering intuitive and innovative betting products, acquiring customers and partnerships, as well as engineering a profit-maximizing risk and data science engine.</div>\n<br>\nTop Reasons to Work with Us<div>\n\n\n<ul>\n<li>Well funded, ground level startup.</li>\n<li>Competitive, booming industry</li>\n<li>Cutting-edge machine learning software</li></ul></div>\n\n\nWhat You Will Be Doing<div>\nWe are looking to hire a Data Scientist to join our team. You will help build and design statistical machine learning algorithms that ensure maximum profit through pricing sports markets efficiently and improving customer metrics. To do well in this role you need first-rate problem solving skills, an interest in the sports or betting markets, as well as experience with statistics, machine learning, data structures and algorithms, and computer science fundamentals.\n\n\n<ul>\n<li>Apply statistical techniques to analyze data, and engineer relevant signals for sports markets pricing</li>\n<li>Implement baseline machine learning-based pricing models, and improve upon them iteratively</li>\n<li>Learn and implement cutting-edge machine learning algorithms to improve pricing accuracy</li>\n<li>Write production worthy code to productize any algorithms designed, ensuring they run in an online real-time fashion</li>\n<li>Apply statistics to and develop algorithms in problem spaces beyond pricing markets, such as user tailoring, determining betting limits, and managing risk</li>\n<li>Collaborate with management to align algorithm development with customer needs, business needs, and data science/risk engine vision</li>\n<li>Provide recommendations on algorithms and problem spaces to explore as you work with and analyze our data</li></ul></div>\n\n\nWhat You Need for this Position<div>\n\n\n<ul>\n<li>Bachelor's degree or Master's degree or PhD from an accredited university or college in statistics, mathematics, or related quantitative field.</li>\n<li>Strong interest in sports, the sports markets, and/or the betting markets</li>\n<li>Experience in sports analytics is preferred.</li>\n<li>Strong understanding of programming and computer science fundamentals</li>\n<li>Strong knowledge of statistics, AI/machine learning algorithms, and pattern recognition techniques.</li>\n<li>Experience in productizing algorithms, and improving their efficiency/runtime</li>\n<li>Understanding of Python, SQL, R, or related data processing languages.</li>\n<li>Strong problem solving and communication skills</li></ul></div>\n\n\nWhat's In It for You<div>\n\n\n<ul>\n<li>Competitive Base Pay $130-160K</li>\n<li>Competitive Equity</li></ul></div>\n\n\n<div>\nSo, if you are a Data Scientist - Sports Analytics with experience, please apply today!</div>\n\n\n<ul>\n\n<li>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer</strong></li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n<br><br>\n<strong>Your Right to Work</strong> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}