{"job title": "Data Engineer", "company": "CyberCoders", "city state": "– Los Angeles, CA", "rating": "4.0", "job description": "Data Engineer <div>\nIf you are a Data Engineer with experience, please read on!<br><br>Based in beautiful Santa Monica, California we are a cutting edge video ad-tech company who is obsessed with data and equally obsessed with ensuring a work culture of fulfillment, engagement, and high performance. We are backed by 8 top venture capital firms which contribute to our rapidly growing 100+ person startup. <br><br>Right now, we are looking for a several Data Engineers.\n</div>Top Reasons to Work with Us<div>\n- Based in beautiful Santa Monica, California<br>- Stock Options<br>- Unlimited PTO <br>- Unlimited use of in-office Yoga and Personal trainer <br>- In-office gym<br>- Fully stocked kitchen such as premium coffee, hot breakfast, and fresh produce)<br>- Catered meals<br>- Amazing Work Culture (Inc. Magazine's Best Workplaces 2018)\n</div>What You Will Be Doing<div>\n- Performance tune Spark apps<br>- Coordinate with engineering teams regarding data models<br>- Build new ingest pipelines<br>- Build and scale new and existing ETL apps<br>- Add new reporting features\n</div>What You Need for this Position<div>\n- ETL workflows<br>- SQL<br>- Hadoop<br>- Spark<br><br>Plus<br>- Scala<br>- Python<br>- Airflow<br>- CI/CD<br>- SCRUM/ Agile experience<br>- Docker/ Kubernetes\n</div>What's In It for You<div>\n- Based in beautiful Santa Monica, California<br>- Stock Options<br>- Unlimited PTO <br>- Unlimited use of in-office Yoga and Personal trainer <br>- In-office gym<br>- Fully stocked kitchen such as premium coffee, hot breakfast, and fresh produce)<br>- Catered meals<br>- Amazing Work Culture (Inc. Magazine's Best Workplaces 2018)\n</div><div>\nSo, if you are a Data Engineer with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n <br><br>\n CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance."}