{"job title": "Senior Research Scientist", "company": "CyberCoders", "city state": "– Santa Clara, CA", "rating": "4.0", "job description": "Senior Research Scientist <div>\nIf you are a Senior Research Scientist with experience, please read on!\n</div>\n\nWhat You Will Be Doing<div>\nYou will be responsible for doing independent and collaborative scientific research to solve new challenges in face-related projects.<br><br>Main tasks<br>Doing independent research on one of these topics: gaze estimation, driver drowsiness detection, driver behavior analysis, in-car human pose estimation<br>Doing research under the guidance on selected topics, including face liveness detection, face ID, 3D facial landmark point estimation, 3D face mesh reconstruction, facial expression recognition, etc.<br>Developing new solutions and write patent disclosure if needed<br>Guiding software engineer in algorithm optimization and platform integration<br>Following related technology advancement and discover new applications that can leverage our expertise\n</div>What You Need for this Position<div>\nExperience and knowledge of:<br><br>PhD degree in CS/EE or related major<br>Familiarity with computer vision, machine learning and deep learning is a must<br>Independent thinking and problem-solving skills are required<br>Prior experience with face detection, verification, head pose and gaze estimation, action/behavior analysis, driver drowsiness detection is very much desired<br>Programming experience in C/C++, Python, Java<br>Familiar with deep learning framework such as caffe, tensorflow, PyTorch, etc.<br>Familiar with embedded platform/system<br>Teamwork and collaboration with co-workers\n</div>\n\n<div>\nSo, if you are a Senior Research Scientist with experience, please apply today! ---If interested please apply or send resume AND salary requirements to Chelsea.Anderson@cybercoders.com ---\n</div> - <br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}