{"job title": "Senior Data Engineer", "company": "CyberCoders", "city state": "– Los Angeles, CA", "rating": "4.0", "job description": "Senior Data Engineer <div>\nIf you are a Senior Data Engineer with Amazon Redshift (preferred), Java, Python, and SQL experience, please read on!<br><br>Based in scenic Playa Vista, we are a technology-driven company dedicated to promoting and enabling an eco-friendly lifestyle for you and your family. Our technology team is ranked as one of the strongest development shops; our foundation is comprised of startup gurus and successful investors with lucrative company exits and acquisitions, along with a hint of star-studded involvement.\n</div>\n\n\n\nWhat You Need for this Position<div>\n- Bachelor's degree in Math, Computer Science or a related area<br>- 5+ years experience in Data Engineering, Analytics or Business Intelligence<br>- Expert in SQL - experience with MySQL, Redshift, Postgres and Oracle<br>- Strong experience with Python and Java. Experienced with Bash scripting.<br>- Strong experience working/managing data infrastructure using AWS technologies (EMR, Redshift, S3, etc)<br>- Proven experience in designing, building and maintaining data pipelines and ETL processes<br>- Proven experience building and tuning Data Warehouses, OLAP databases, preferably Amazon Redshift<br>- Ability and willingness to quickly troubleshoot and debug data deficiencies<br>- Proven ability to implement and follow standard SDLC principles in Data Engineering<br>- Experience with visualization frameworks, such as Domo or Tableau<br><br>Bonus points for:<br>- Experience in omni-channel CPG industry<br>- Experience with ERP data models, particularly JD Edwards<br>- Experience with Airflow, Mulesoft, Mongo, Cassandra, Hive, Maxwell, Spark, EMR, Hadoop, S3, Kafka and related data technologies\n</div>What's In It for You<div>\n- Competitive Salary<br>- Comprehensive health and wellness coverage - we even offer pet insurance! <br>- 401k with company match<br>- Wellness incentives including a monthly fitness reimbursement and onsite fitness classes<br>- Options for education reimbursement<br>- Discount on all products!<br>- A generous and flexible vacation policy<br>- Generous maternity and paternity leave\n</div><div>\nSo, if you are a Senior Data Engineer with Redshift (preferred), Java, Python, and SQL experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n <br><br>\n CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance."}