{"job title": "Data Scientist (*Relocation Assistance Available)", "company": "CyberCoders", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "Data Scientist (*Relocation Assistance Available) <div>\nIf you are a Data Scientist with experience, please read on!<br><br>If you are interested in joining a cutting edge company that definitely cares about providing a great working environment for its employees, then apply immediately.<br><br>--Your application will be considered incomplete unless the screening questions are answered, and incomplete applications cannot be submitted for further review. Please answer all of the screening questions in detail in order to expedite the process.--\n</div>\n\nWhat You Will Be Doing<div>\n-Partner with operations, real-estate and product teams to lead analytics projects and derive actionable insights to drive better product and business performance<br>-Acquire, manage and use data to inform business decisions and product design<br>-Design models and statistical analyses to answer specific questions<br>-Lead product and growth experiments<br>-Build relevant ETL pipelines to generate and track performance metrics\n</div>What You Need for this Position<div>\n-MS or PhD in Economics, Statistics, Operations Research or related quantitative field from a top university<br>-3+ years of relevant work experience as a Data Analyst, Data Scientist or Economist with a track record of manipulating, and extracting value from large datasets<br>-Experience building complex SQL queries<br>-Strong fundamentals in statistics and econometrics (e.g. regressions, hypothesis testing)<br>-Excellent communication skills with the ability to distill complex issues and analyses<br>-Fluency in Python or R preferred<br>-Familiarity with ETL processes Prior experience in experimental design is a plus\n</div>What's In It for You<div>\n- $150,000-$225,000 Base Salary (DOE)<br>- Unlimited PTO<br>- Medical<br>- Dental<br>- Vision<br>- Employee Discounts\n</div><div>\nSo, if you are a Data Scientist with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}