{"job title": "Lead Data Scientist", "company": "CyberCoders", "city state": "– Philadelphia, PA", "rating": "4.0", "job description": "Lead Data Scientist <div>\nIf you are a Lead Data Scientist with experience, please read on!<br><br>We are a fast-growing digital advertising technology company, recently named by Philadelphia Business Journal as one of Best Places to Work in the Greater Philadelphia area in 2018.<br><br>We are looking for a Lead Data Scientist to work cross functionally with our Engineering, Operations, and Product teams.<br><br>Our real-time bidding infrastructure handles tens of thousands of bid requests every second. It decides which ad to show based on the quality and value of each impression. This position works on production systems with high throughput and a large volume of data. Current models include bid price optimization, fraud detection/prevention, click prediction, conversion prediction, fill prediction, and target suggestion. Our predictive models need to be not only highly accurate, but also highly scalable.\n</div>\n\nWhat You Will Be Doing<div>\n- Work closely with a team of talented engineers and data scientists responsible for the machine learning of our real-time ad exchange platform.<br>- Lead and manage the Data Science team using an agile development process.<br>- Experience a unique opportunity to work with petabytes of data generated daily by our systems, analyze/process it with Spark, and build models in Python/Pandas.<br>- Build new predictive models, and test them on our experimentation infrastructure with the goal of improving machine learning performance of our current predictors or create entirely new predictors.<br>- Test and implement new models and features in our prediction microservice, written in GoLang, to ensure that the feature's performance and code quality has been fully vetted.<br>- Communicate directly with key stakeholders and founders to strategize feature requests into actionable and implementable machine learning systems.\n</div>What You Need for this Position<div>\n- Bachelor's degree in Computer Science, Engineering, Statistics, Math, or a related technical field.<br>- 3+ years of experience working as a data scientist, machine learning engineer, or software engineer. Must be able to support existing data infrastructure and embed your algorithms into a production environment.<br>- 2+ years of experience leading and managing an agile software engineering team or data science team.<br><br>Extensive experience with the following is required: <br>- Worked with Ecommerce, AdTech, or FinTech<br>- Large Datasets in the TeraBits (Hadoop, Spark, Athena, etc)<br>- Python and Go<br>- Pandas, Numpy, Scipy and scikit-learn<br><br><br>Nice to haves: <br>- XGBoost, Java and C++\n</div>What's In It for You<div>\n- Competitive base salary<br>- Bonus plan<br>- Comprehensive benefits<br>- PTO (25 days)<br>- 401k\n</div><div>\nSo, if you are a Lead Data Scientist with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}