{"job title": "Sr. Data Scientist - Healthcare Analytics", "company": "CyberCoders", "city state": "– Berkeley, CA", "rating": "4.0", "job description": "Sr. Data Scientist - Healthcare Analytics <div>\nLocated in beautiful Berkeley, CA, we have a passion for healthcare and are singularly focused on improving our healthcare system for all stakeholders - especially patients - by helping our clients make sense of complex data so they can answer their most challenging questions. We also believe that our distinctive capabilities shouldn't perpetuate the inertial 'zero sum game' where success is measured by how much the winners take from the losers. Only in this way we will be able to positively impact the delivery of healthcare while building a successful company.\n</div>Top Reasons to Work with Us<div>\n- HUGE room for Growth<br>- Very Competitive Salary<br>- Great Work/Life Balance\n</div>What You Will Be Doing<div>\nInform product strategy, influence the product roadmap, and guide product decisions by: <br>-Accessing and analyzing rich healthcare data to generate insights and make proactive recommendations. <br>-Formulating success metrics for optimizing healthcare resources and patient experience, creating visualizations to monitor them. <br>-Designing and analyzing experiments to test new ideas for optimizing improving our client's precious resources. <br>-Developing models and data-driven solutions that add material insight to our clients understanding of their business and their business environment\n</div>What You Need for this Position<div>\n-Minimum 2-5 years outside of PhD/Masters work working as a Data Scientist or Fellow. <br>-PhD or Masters in a quantitative discipline: Computer Science, Statistics, Applied Mathematics, Operations Research, Engineering <br>-Working knowledge of healthcare systems and healthcare terminology <br>-Expert in analyzing large complex, multi-dimensional data sets with a variety of tools <br>-Ability to thrive and demonstrate constant applied learning in highly complex, interdisciplinary, and dynamic work environment <br>-Strong programming experience in Python or R\n</div>What's In It for You<div>\nFor your hard work, you will be rewarded with a strong compensation package that includes a competitive base salary (D.O.E), excellent medical, dental and health benefits and other cool perks.\n</div><div>\nInterviews are ongoing so, please FULLY COMPLETE THE APPLICATION QUESTIONS INCLUDING THE SELF ASSESSMENT ASAP! Complete applications will receive priority!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}