{"job title": "Chief Data Scientist", "company": "CyberCoders", "city state": "– Palo Alto, CA", "rating": "4.0", "job description": "Chief Data Scientist <div>\nIf you are a Chief Data Scientist with experience, please read on!<br><br>We are a $3.2B startup that is looking for a Chief Data Scientist to build out a Data Science team. We have established ourselves as top in our industry in the US and are in the process of expanding internationally. To continue pushing forward we are looking to build a Data Science team and need the right leader in place to do so. <br><br>Note: We are based in Nashville and looking for someone willing to travel each week or relocate.<br><br>If you have extensive experience leading and building out Data Science teams, this is the position for you!\n</div>\n\nWhat You Will Be Doing<div>\n-Build out a Data Science team <br>-Heavy in Machine Learning<br>-Automate operations using predictive algorithmic recommendations<br>-Data Analysis to understand and solve problems<br>-Work closely with Business and Engineering teams<br>-Code production modeling, implement algorithms into production\n</div>What You Need for this Position<div>\nMore Than 5 Years of experience and knowledge of:<br><br>- Big Data<br>- Machine learning algorithms<br>- AI<br>- Predictive Analytics<br>- Distributed Computing\n</div>What's In It for You<div>\nSalary: Negotiable based on experience<br>- Vacation/PTO<br>- Medical<br>- Dental<br>- Vision<br>- Relocation<br>- Bonus<br>- 401k\n</div><div>\nSo, if you are a Chief Data Scientist with experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}