{"job title": "Big Data Engineer", "company": "CyberCoders", "city state": "– Austin, TX", "rating": "4.0", "job description": "Big Data Engineer <div>\nIf you are a Big Data Engineer with Scala, Hadoop and Spark experience, we would like to hear from you! We are an engineering services company working with leading technology companies to develop a high performance data analytics platform that can handle petabytes of datasets. If you are a truly talented Big Data engineer with super skills in Scala, Hadoop and Spark, and you are looking for an opportunity to help design and implement an amazing Big Data solution that will be deployed on a massive scale, this is your chance!\n</div>\n\nWhat You Will Be Doing<div>\n- helping design and develop Big Data analytical applications<br>- designing, supporting and continuously enhancing the project code base, continuous integration pipeline, etc.<br>- writing complex ETL processes and frameworks for analytics and data management<br>- implementing large-scale near real-time streaming data processing pipelines\n</div>What You Need for this Position<div>\n- 4+ years of Big Data experience<br>- Bachelor's degree in Computer Science or related field (Master's degree a PLUS)<br>- strength with Scala<br>- strong knowledge of Hadoop and Spark<br>- experience with data mining and stream processing technologies (Kafka, Spark Streaming, Akka Streams)<br>- experience with version control systems, particularly Git<br>- desire and ability to quickly learn new tools and technologies<br>- understanding of the best practices in data quality and quality engineering<br>- knowledge of Unix-based operating systems (bash/ssh/ps/grep etc.) - a PLUS<br>- experience with Github-based development processes - a PLUS<br>- experience with JVM build systems (SBT, Maven, Gradle) - A PLUS\n</div>What's In It for You<div>\n- competitive salary<br>- strong benefits package<br>- great work atmosphere!\n</div><div>\nSo, if you are a Big Data Engineer with Scala, Hadoop and Spark experience, please apply today!\n</div> - <p>Applicants must be authorized to work in the U.S.</p><br><br>\n <b>CyberCoders, Inc is proud to be an Equal Opportunity Employer</b>\n <br><br>\n All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n <br><br>\n <b>Your Right to Work</b> In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}