{"job title": "Jr Data Scientist - R,Python,CLoudAWS,Hadoop", "company": "Cygnus Professionals", "city state": "– Piscataway, NJ", "rating": "3.9", "job description": "<strong>Job Description:</strong>\n<br><br>\nWe are looking for smart, self-driven, high energy people with top notch communication skills, intellectual curiosity and passion for analytics. Our analysts have a blend of <strong>in-depth domain expertise</strong> in one or more areas, strong <strong>business acumen</strong> and excellent <strong>soft skills</strong>.\n<br><br>\n<strong>What do we require?</strong>\n<br><br>\n<strong>Industry knowledge</strong>- Knows basic principles of industry lexicon, competitor landscape, sub-verticals and related best practices in order to provide suggestions for specific functional processes. Basic understanding of industry standards to document current customer compliance and gaps.\n<br><br>\nWe look for candidates who have prior relevant work experience, excel in ambiguous situations, and possess a passion for helping companies become more competitive. We value intellectual curiosity, initiative and entrepreneurial drive!\n<br><br>\n<strong>Functional/Process knowledge</strong>- Shows the basic understanding of processes in relevant functional areas especially in telecom domain\n<ul>\n<li>Appreciate the context of customer requirements from specific engagements</li><li>Align our deliverables to customer requirements, provide business acumen to avoid apparently bookish or theoretical output</li><li>Ability to converse with customers on rationale for an approach taken, pros and cons, etc.</li><li>Understands the linkages of metrics and end objectives to key business drivers and aligns team efforts to deliver on it.</li><li>Assesses the target audience need, prepares and practices a logical flow, answers audience questions appropriately and sticks to timeline.</li>\n</ul>\n<strong>Analytical ability</strong>- Looks at data from multiple sources and integrates data/inputs in a manner to build cause effect linkages to arrive at key issues. Uses understanding of the problem to arrive at multiple solution alternatives keeping in mind the various stakeholders and assess the pros and cons of all the alternatives to arrive at the optimal solution\n<ul>\n<li>Assist clients in identifying type of analytics and management data that will directly relate to improving clients' market share or any other measure client is addressing. Identify the differentiators, map them to present-day environment, and then design an improvement plan</li><li>Ability to suggest Analytics algorithms to use based on business situation mindful of fundamental assumptions in the algorithms; OR Work with other data scientists as a team to understand algorithms suggested and provide QA in algorithm choice from a business perspective</li><li>Responsible for successful delivery of Advanced Analytics solutions and services in client consulting environments</li><li>Understand the models created for a business problem and translate this into a technical solution using R / Python or equivalent tools; identify meaningful information out of data WITHIN the guidelines, policies and norms of Infosys.</li><li>Develop statistical, machine learning or optimization models independently for low complexity projects and as per procedure outlined by Manager/Associate Principal for medium &amp; high complexity projects using R / Python or equivalent tools</li>\n</ul>\n<strong>Education and experience:</strong>\n<ul>\n<li>~8 Years of Experience with BE or Masters in quantitative discipline (Statistics, Economics, Econometrics, Mathematics, Operations Research, or equivalent), CFA, MBAs, MS Finance with Relevant experience in the field of Analytics.</li><li>Telecom Domain Experience preferred.</li>\n</ul>\n<strong>Technical /Tools / Platform / FrameWorks - Knowledge</strong>:\n<ul>\n<li>Proficiency with statistical analysis tools e.g. R &amp; Python</li><li>Hands on experience in Statistical &amp; Machine learning Techniques &amp; Deep Learning such as Decision Tree, Segmentation, Logistic and Multiple Regression, and others. Also, experience in Advance Analytics i.e. LSTM, RANDOM FOREST, KNN algorithm neural networks etc.</li><li>Hands-on experience in data cleaning, feature engineering, model development and deployment.</li><li>Understanding of various Analytical Tools, Visualization tool (Tableau, Click view) Platform &amp; Frameworks i.e. Hadoop, SPARK, Cloud AWS.</li><li>Experience in optimization (linear, mixed integer, constraint programming), simulation, rule based scoring and/or predictive analytics.</li><li>Analytics Experience in is required.\n\n<ul>\n<li>Forecasting/Recommendation</li><li>Customer, CRM Analytics</li><li>Billing and Device Analytics</li><li>Operations Analytics</li></ul></li>\n<li>Familiarity with database query tools (SQL). Basic understanding of data warehouse architecture</li><li>Strong Excel, Access and PowerPoint skills</li></ul>\n\n\n<ul>\n<li>provided by Dice</li>\n</ul>\n\nR,Python,Statistics,Machine Learning,Neutral Networks,cLOUD,sPRAK,hADOOP,aws,Forecasting/Recommendation Customer, CRM Analytics Billing and Device Analytics Operations Analytics"}