{"job title": "Data Scientist", "company": "Cyient", "city state": "– Phoenix", "rating": "3.4", "job description": "Celebrating its twenty-fifth anniversary in 2016, Cyient is an acknowledged leader in engineering design services, design-led manufacturing, networks and operations, data transformation, and analytics. We collaborate with our clients to help them achieve more and together shape a better future. We call it Designing Tomorrow Together.\n<br><br>\nOur industry focus includes aerospace, defense, rail transportation, off-highway &amp; industrial, power generation, mining, oil &amp; gas, communications, utilities, geospatial, semiconductor and medical technology. We align closely with the business needs, goals, culture, and core values of our clients. This reflects in the deep, long-standing relationships we have developed and sustained with some of the leading names in these industries.\n<br><br>\n<strong>LOCATION</strong><br><br>Phoenix<br><br><strong><strong>JOB DESCRIPTION SUMMARY</strong></strong>\n<br><br>\n<strong>JOB DESCRIPTION</strong><br><br><strong><strong>Data Scientist - Phoenix, AZ</strong></strong><br><br>The position creates new footprint for data-driven innovation and value for our customers and prospects while providing analytical capabilities. You would be part of core team that would help design and develop advanced analytics solutions across functional areas as per client requirement/opportunities. Key requirements include an ability to communicate complex quantitative analysis with a lucid, precise, clear and actionable insight. You should be experienced in solving analytical problems using quantitative approaches. You would also invest your time in developing new practices and methodologies using statistical methods, machine learning and predictive models under mentorship from experts across industry.\n<br><br>\n<strong><strong>Key Responsibilities</strong></strong>\n<ul>\n<li>Identify and manage the analysis and interpretation of clients' internal and external data to drive decision making.</li><li>Query databases and perform statistical, mathematical analysis</li><li>Work directly with customer teams to help design and generation of reporting frameworks that provide insight to the performance of clients’ business programs.</li><li>Create re-usable implementations of statistical tests and models (R, Python, SAS, SPSS etc.) using the available technologies.</li><li>Assist in customer engagement management, project scoping, timeline management, and results documentation to ensure professional relationship management.</li>\n</ul>\nRequirements:\n<ul>\n<li>Must have sound understanding of aerospace and aerospace systems particularly in design, manufacturing, test, operations, supply chain, aftermarket and MRO.</li><li>Must be strong on learning methods, data analytics, R/Python and Tableau.</li></ul>\n\n<ul>\n<li>Good in algorithm development with programming languages.</li><li>Must have strong understanding of statistics and machine learning.</li><li>Prior experience in R or Python and data analytics is preferred.</li></ul>\n\n<ul>\n<li>MS/PhD in Mechanical, Electrical, Computer Science or Aerospace Engineering from an accredited school</li><li>3+ years of applicable experience</li><li>US citizen/Green Card Required</li>\n</ul>\nCyient Inc. is an equal opportunity employer. If you are a team leader, self- motivated and willing to be a part of a global company"}