{"job title": "Data Scientist", "company": "Cynet Systems", "city state": "– Peoria, IL", "rating": "3.9", "job description": "<div><div>We are looking for <strong>Data Scientist</strong> for our client in <strong>Peoria, IL</strong></div><div><div><strong>Job Title: Data Scientist</strong></div><div><strong>Job Location: Peoria, IL</strong></div><div><strong>Job Type: Contract</strong></div><div><strong>“US citizens and those authorized to work in the US are encouraged to apply. We are unable to sponsor H1b candidates at this time.”</strong></div>\n<br>\n<div><strong>Job Description:</strong></div></div></div><div><div>\n\n<ul>\n<li>Strong problem solving skills with an emphasis on product development.</li><li>Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.</li><li>Experience working with and creating data architectures.</li><li>Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.</li><li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</li><li>Excellent written and verbal communication skills for coordinating across teams.</li><li>A drive to learn and master new technologies and techniques.</li><li>We’re looking for someone with 5-7 years of experience manipulating data sets and building statistical models, has a Master’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools:</li><li>Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.</li><li>Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.</li><li>Experience querying databases and using statistical computer languages: R, Python, SLQ, etc.</li><li>Experience using web services: Redshift, S3, Spark, DigitalOcean, etc.</li><li>Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.</li><li>Experience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.</li><li>Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.</li><li>Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.</li></ul></div>\n</div> - provided by Dice\n<br><br>\nData Scientist"}