{"job title": "Data Scientist", "company": "Daily Harvest", "city state": "– New York, NY", "rating": "2.0", "job description": "Position Overview<br><br>Daily Harvest is a direct to consumer brand reimagining frozen food to solve a modern eating dilemma: the desire for convenience without nutritional compromise. We deliver single-serve cups of frozen ingredients (organic, whole ingredients and superfoods, with no preservatives or added sweeteners) that can be turned into crave-worthy eats in just seconds.\n<br><br>\nWe are seeking a razor sharp Data Scientist to blend our data into insights that will enable us to deliver healthy and convenient frozen foods to more and more subscribers every day. You are a generalist who will develop an intimate understanding of how our data is structured and transform raw information into vital metrics and intuitive, eye-opening visualizations that empower critical decision making across the organization including in product, marketing, and operations. You will be a valued thought partner, helping the growing Data team to define the best metrics by which to measure success and to devise and evaluate experiments that will meaningfully drive growth as we create a new category and the next great consumer brand in food.<br><br><strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Perform quantitative analyses to enable sophisticated evaluations of product launches (both digital and culinary), marketing ROI</li>\n<li>Measure the performance and present this information to other stakeholders in live Looker dashboards and other reports</li>\n<li>Utilize proprietary data and other sources to better understand our customers, their preferences and their purchasing decisions</li>\n<li>Communicate insights to business partners including members of the Daily Harvest leadership team</li>\n</ul>\n\n<strong>Qualifications:</strong> \n\n\n<ul>\n<li>Deep understanding of numbers and business sense developed in 2-3 years experience in consulting, finance, high-growth start-up, or related business</li>\n<li>E-commerce experience, especially within a subscription company is a plus</li>\n<li>Technically skilled with large datasets and coding such as SQL, R, or Python, reporting and visualization software such as Looker (and of course Excel)</li>\n<li>Strong presentation skills and ability to effectively communicate complicated analyses to non-technical employees</li>\n<li>Demonstrated ability to multitask and prioritize with a proven ability to meet tight deadlines</li>\n<li>Ability to thrive in an unstructured, fast-moving and constantly evolving hyper growth environment</li> \n</ul>"}