{"job title": "Quality Assurance Scientist, Complaint Handling", "company": "Danaher", "city state": "– Miami, FL", "rating": "3.2", "job description": "Job Description Job ID: BEC013298\n<br><br>\nAbout Us\n<br><br>\nBeckman Coulter develops, manufactures and markets products that simplify, automate and innovate complex biomedical testing. Our diagnostic systems, found in hospitals and other critical care settings around the world, produce information used by physicians to diagnose disease, make treatment decisions and monitor patients. Scientists use our life science research instruments to study complex biological problems including causes of disease and potential new therapies or drugs. More than 275,000 Beckman Coulter systems operate in both diagnostics and life sciences laboratories on all seven continents. For 80 years, our products have been making a difference in peoples' lives by improving the productivity of medical professionals and scientists, supplying critical information for improving patient health and reducing the cost of care.\n<br><br>\nBeckman Coulter offers a broad array of comprehensive, competitive benefit programs that add value to associates' and their families' lives. Whether it's a health care program or paid time off, our programs contribute to life beyond the job. Check out our benefits. We think you'll like what you see.\n<br><br>\nIf you believe your education and experience are in line with the position description and qualifications referred to above, and are motivated, energetic, and looking for a new and exciting opportunity, please submit your resume online at the URL below or at www.beckmancoulter.com.\n<br><br>\nBeckman Coulter is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law.\n<br><br>\nDescription\n\n\n<ul>\n<li>Receive and process complaints escalated from internal and external customers related to products manufactured and or distributed and serviced by the company in a manner consistent with all laws and regulations for medical devices.</li>\n<li>Generate and analyze customer feedback (CF) data to improve product reliability and performance for our customers.</li>\n<li>Possess understanding of risk management concepts and is capable of assessing product risks across unit of work.</li>\n<li>Independently and collaboratively evaluate information, reports, and data and provide recommendations for process improvements.</li>\n</ul>\n\nJob Requirements\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's degree with 3+ years in Science or Engineering discipline, or relevant years of Quality/Regulatory Affairs experience</li>\n<li>Able to make judgment calls using combination of knowledge of regulations, knowledge of technology, critical thinking, and interpretation of intent of the regulations.</li>\n<li>Ability to drive results, foster teamwork, handle pressure, and provide feedback</li>\n<li>Able to apply extensive technical expertise and has full knowledge of other related disciplines.</li>\n<li>Ability to perform detail-oriented work with a high degree of accuracy.</li>\n<li>Proven ability to work cross-functionally in a team based environment.</li>\n<li>Proficient in MS Office Suite of products.</li>\n<li>Willingness to be flexible and adaptable to changing priorities.</li>\n<li>Excellent oral and written technical communication skills.</li>\n<li>Effective analytical and problem solving skills.</li>\n</ul>\n\nAt Danaher, we are dedicated to building and sustaining a truly diverse and inclusive culture. These are not just words on a pageDiversity and Inclusion is a top priority for the company, and it ties deeply to each of our core values. Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.\n\n\n<ul>\n<li>LI-TH1.</li>\n</ul>\n\nDanaher Corporation Overview\n<br><br>\nDanaher is a global science &amp; technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&amp;P 500 by more than 1,200% over 20 years.\n<br><br>\nAt Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We're innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you'll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team."}