{"job title": "Computational Biologist, Cancer Immunologic Data Commons (CIDC)", "company": "Dana-Farber Cancer Institute", "city state": "– Boston, MA", "rating": "4.0", "job description": "Overview\n<br><br>\nLocated in Boston and the surrounding communities, Dana-Farber Cancer Institute brings together world renowned clinicians, innovative researchers and dedicated professionals, allies in the common mission of conquering cancer, HIV/AIDS and related diseases. Combining extremely talented people with the best technologies in a genuinely positive environment, we provide compassionate and comprehensive care to patients of all ages; we conduct research that advances treatment; we educate tomorrow's physician/researchers; we reach out to underserved members of our community; and we work with amazing partners, including other Harvard Medical School-affiliated hospitals.\n<br><br>\nThe Shirley Liu Lab is recruiting a computational biologist to develop machine learning algorithms and conduct high throughput data analyses and integration to model tumor immunology and understand cancer patient response to immunotherapy. We recently received funding for a Cancer Moonshot Project by the National Cancer Institute to build a Cancer Immunologic Data Commons (CIDC). NCI plans to conduct comprehensive profiling of tumor, blood, and fecal samples from NCI-sponsored immuno-oncology trials. The computational biologist will work on various computational aspects of immune-profiling algorithms and analyses, with the goal of identifying biomarkers for optimizing immunotherapy strategies in cancer.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Develop, apply, document, and maintain computational tools, both for own use and support analysis by other scientists.</li>\n<li>Integration of data from public databases into the group's pipelines and analyses.</li>\n<li>Maintaining and updating the computational infrastructure within the group.</li>\n<li>Working collaboratively on interdisciplinary projects.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelors degree or higher in a quantitative science (Computer Science / Mathematics / Statistics / Physics / Computational Biology / Biology with a bioinformatics emphasis).</li>\n<li>Experience in high throughput genomics data analyses required.</li>\n<li>Proficiency with programming using Python and R.</li>\n<li>Excellent organizational, communication and collaboration skills.</li>\n</ul>\n\nHow to Apply\n<br><br>\nInclude a short description of your interest with your resume / CV and email to xsliu@mail.dfci.harvard.edu with subject line \"Computational Biologist Application.\"\n<br><br>\nDana-Farber Cancer Institute is an equal opportunity employer and affirms the right of every qualified applicant to receive consideration for employment without regard to race, color, religion, sex, gender identity or expression, national origin, sexual orientation, genetic information, disability, age, ancestry, military service, protected veteran status, or other groups as protected by law.<br><br>SDL2017"}