{"job title": "Data Scientist", "company": "Dassault Falcon Jet", "city state": "– Little Rock", "rating": "3.4", "job description": "<div><p>JOB SUMMARY:</p><p>Work closely with the respective Manager/Supervisor and business users to solve problems and identify opportunities. This position is responsible for the development of machine learning algorithms, analysis, cleansing and pipelining of business data in accordance with IT standards and processes. Work in a team environment and continously monitor performance and quality control plans to identify improvements.</p><p>PRIMARY RESPONSIBILITIES:</p><ul><li>Develop, administer, and maintain reusable and performant SQL queries / python scripts / data pipelines that integrate within the established information systems</li><li>Implement Machine Learning algorithms in collaboration with business users to ensure accuracy of the results and cleanliness of the data in entry</li><li>Assist in the establishment of technical standards / best practices by communicating with the team and contributing to the internal WIKI</li><li>Create visualization methods to communicate data in a meaningful manner</li><li>Work closely with the other MIS groups to support IT solutions by analyzing root causes, implementing work around, and developing stable patches</li><li>Assist in the definition and maintenance of architecture documents for current and new solutions</li></ul> </div><div> Position Requirements <p>MINIMUM REQUIRED QUALIFICATIONS:</p><ul><li>Bachelor's degree in quantitative discipline: Computer Science, Statistics, Engineering, etc.<ul> <li>May substitute equivalent amounts of directly related experience for eduction</li></ul></li><li>3 years of experience in a data analyst / scientist / engineer position</li><li>Experience applying machine learning to solve large scale problems</li><li>Strong knowledge of Python and the following libraries: scikit-learn and tensorflow</li><li>Strong knowledge of RDBMS (Oracle or SQL Server) in the following, but not limited to aspects:<ul> <li>Database normalization</li> <li>Functions and stored procedures</li> <li>Database indexing and optimization</li> <li>T-SQL queries</li></ul></li><li>General knowledge of architecture principles</li><li>Experience with code deployment, versioning, and build tools</li></ul><p> </p><p> </p><p> </p> </div><div> Location Little Rock </div>\n\n\n\n\n\n\n\n\n\n<div> </div><div> <p>This position is currently accepting applications. </p></div><div> <p>Apply Now</p> </div><div> <br> </div>"}