{"job title": "Data Scientist", "company": "Dataminr", "city state": "– New York, NY", "rating": "4.0", "job description": "<strong>Type: Full Time</strong>\n<br>\n<strong>Min. Experience: Experienced</strong>\n<br><br>\n<strong>Who we are:</strong>\n<br><br>\nWe are Dataminr, the leading company that turns social media into real-time, actionable alerts. Our ability to find and deliver information faster than any traditional source has completely revolutionized how critical, relevant and actionable information reaches the news, finance, public sector and corporate security industries.\n<br><br>\nWe are one of the most exciting companies to work for and have been referred to as the \"super tool of journalists and hedge funds\" while also receiving numerous accolades from professionals in both the corporate security area and public sector. We've been named to CNBC's Disruptor 50 list in 2014 and 2016, the Forbes FinTech 50 list in 2016, added to the AlwaysOn Global 250 Top Private Companies list and received an invitation to speak at the World Economic Forum.\n<br><br>\nHeadquartered in New York City and nearing 400 employees, Dataminr provides a challenging and dynamic environment where everyone feels that they have the freedom to be innovative, impactful and influential. Our culture promotes team interaction, work-life balance and the sharing of information and ideas because it empowers us to do our best work <em>and</em> have fun. If you want to be a part of the most interesting and exciting high-growth tech company in New York, please keep reading!\n<br><br>\n<strong>Who you are:</strong>\n<br><br>\nYou're a dedicated Data Scientist who wants nothing more than to help us sort, analyze and deliver relevant information from terabytes of unstructured data in the social media space. You will build machine learning models to transform social media feeds into actionable items. You will also work with engineers, product managers and other teams to solve challenging problems with your data science skills.\n<br><br>\n<strong>Desired Skills &amp; Experience</strong>\n\n<ul>\n<li>Ph.D. in Computer Science, Math, Statistics or Machine Learning</li>\n<li>2+ years of work experience in machine learning and natural language processing required</li>\n<li>Extensive programming experience in Java, Scala or Python, ability to work on projects with minimal engineering support</li>\n<li>Experience with Spark, Hadoop/MapReduce and machine learning frameworks</li>\n<li>Ability to communicate complex quantitative results in a clear, precise and actionable manner</li>\n<li>Self-motivation and an ability to handle multiple competing priorities in a fast-paced environment</li>\n<li>Ability to work both independently and collaboratively within a team</li>\n</ul>\n<strong>Our offering of competitive benefits and perks include:</strong>\n\n<ul>\n<li>Company paid benefits for employees and their dependents, such as medical, dental, vision, disability and life</li>\n<li>Flexible spending account to be used for out-of-pocket medical, transit, parking and dependent care expenses</li>\n<li>401(k) savings plan</li>\n<li>Generous leave</li>\n<li>Daily catered lunch</li>\n<li>A kitchen fully stocked with snacks and beverages</li>\n<li>Discounted Gym Membership</li>\n</ul>\n\n<div>\n<div><em>Dataminr is an equal opportunity and affirmative action employer. Individuals seeking employment at Dataminr are considered without regards to race, sex, color, creed, religion, national origin, age, disability, genetics, marital status, pregnancy, unemployment status, sexual orientation, citizenship status or veteran status.</em><br><br>#LI-ID</div>\n</div>\n<br>"}