{"job title": "Experienced Data Scientist", "company": "Dataiku", "city state": "– New York, NY", "rating": "4.9", "job description": "We're looking for a Data Scientist to join Dataiku.\n<br><br>\nAt Dataiku, you will help our customers to build data science applications -- from conception to deployment. You will get hands-on experience coding in multiple languages and applying the latest big data technologies to business uses cases. Our ideal candidate is comfortable learning new languages, technologies and modeling techniques, while being able to explain their work to other data scientists and clients.<br><br>\n<br>\n<strong>Responsibilities:\n<br>\n</strong>\n\n<ul>\n <li>Construct end-to-end data flows from raw data to predictions</li> <li>Crunch, analyze and investigate on any kind of data</li> <li>Explore new machine learning algorithms</li> <li>Build attractive visualizations</li> <li>Communicate results to non-technical colleagues and clients</li> <li>Provide data science expertise to sales, marketing and R&amp;D teams</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>2+ years experience with R or Python</li> <li>2+ years experience with predictive modeling</li> <li>Familiarity with data visualization in R or Javascript</li> <li>Understanding of relational data or SQL</li> <li>French is not required and all European languages are appreciated</li>\n</ul>\n<strong>Bonus points for any of these:</strong>\n<ul>\n\n\n<ul>\n <li>Experience with PySpark, SparkR or Scala</li> <li>Experience developing WebApps</li> <li>Experience building APIs</li> <li>Experience with HDFS and NoSQL databases (MongoDB, Cassandra, etc)</li></ul> \n</ul>\n<strong>Benefits</strong>\n<ul>\n <li>Equity</li> <li>Opportunity for a 2-month exchange to another Dataiku office (Paris, London, New York, San Francisco)</li> <li>Attending and presenting at big data conferences</li> <li>Startup atmosphere: Free foods and drinks, foosball (or babyfoot), regular social gatherings and more</li>\n</ul>"}