{"job title": "Data Scientist Team Lead", "company": "Datastax", "city state": "– Santa Clara, CA", "rating": "3.8", "job description": "We are looking for a Data Scientist who will support our Product &amp; Engineering teams with insights gained from analyzing support, engineering, and product related data. As a DataStax data scientist, you will have to combine the skills of a developer and a detective, drawing on a wide palette of mathematics, statistics, machine learning, and programming techniques to uncover rare insights hidden within the data.\n<br><br>\nThe ideal candidate is adept at using large data sets to find opportunities for product, technical support, customer sentiment and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams.\n<br><br>\nThis role is strategic to DataStax and requires an experienced leader comfortable in leading, formulating insights and making compelling recommendations to the executive leadership team for consideration and action.\n<br><br>\n<strong>Essential Job Functions:</strong>\n<ul>\n\n<li>Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions</li>\n<li>Mine and analyze data from company data sources to drive optimization and improvement of product development and business strategies</li>\n<li>Assess the effectiveness and accuracy of new / alternative data sources and data gathering techniques</li>\n<li>Develop scalable custom data models and algorithms to apply to data sets</li>\n<li>Develop statistical and machine learning models to fill in knowledge gaps</li>\n<li>Use predictive modeling to increase and optimize customer experiences, revenue generation, and other business outcomes</li>\n<li>Research, recommend and implement new data science approaches, algorithms and technologies that can help enhance product capabilities, improve product quality, improve customer experience and deliver business insights</li>\n<li>Develop processes and tools to monitor and analyze model performance and data accuracy</li>\n<li>Actively participate in contributing to internal knowledge base through Wikis, Forums and other collaboration mechanisms</li>\n<li>Formulate &amp; present business-centric insights and recommendations to DataStax executive leadership team</li>\n<li>Provide direction and guidance to junior team members on all aspects of analytics from business context and prioritization to technical coaching</li>\n\n</ul>\n<strong>Job Requirements:</strong>\n<ul>\n\n<li>Masters or PHD in Statistics, Mathematics, Computer Science or another quantitative field</li>\n<li>5-7 years of experience manipulating data sets and building statistical models</li>\n<li>Experience working with and creating data architectures</li>\n<li>Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets</li>\n<li>Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.</li>\n<li>Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.</li>\n<li>Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.</li>\n<li>Experience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.</li>\n<li>Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, Cassandra, etc.</li>\n<li>Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.</li>\n<li>Strong problem-solving and critical thinking skills</li>\n<li>Excellent verbal/written communication &amp; data presentation skills, including an ability to effectively communicate with both business and technical teams</li>\n<li>Intellectual curiosity and persistence to find answers to questions &amp; solutions hidden in large data sets</li>\n<li>Willingness and ability to learn new data science methods and tools with little guidance</li>\n\n</ul>"}