{"job title": "Senior Statistician/Predictive Modeler/Data Scientist", "company": "DataLab USA", "city state": "– Germantown, MD", "rating": "3.6", "job description": "Job DescriptionDataLab USA is an award winning database marketing company that focuses on optimizing multichannel marketing solutions. Through the use of data analytics, sourcing, processing, and digital services DataLab USA effectively enables national organization to maximize their direct marketing investments.\n<br><br>\nHighlights: 3-5 years Experience; Must know SQL; Financial or insurance industry experience strongly preferred; Must have direct marketing experience. R experience a plus.\n<br><br>\n<strong>Job Summary:</strong>\n\n\n<ul>\n<li>Analyze the effectiveness of existing predictive models and optimization strategies.</li>\n<li>Manage the full life cycle of model builds.</li>\n<li>Interface directly with clients to consult on the effectiveness of marketing programs.</li>\n</ul>\n\n<strong>Job Skills:</strong>\n\n\n<ul>\n<li>3-5 years experience in developing direct marketing response, conversion, attrition, &amp; LTV models.</li>\n<li>Analysis of entire business problems and management solution delivery.</li>\n<li>Management and development of the full life cycle of model builds.</li>\n<li>Programming with SQL.</li>\n<li>Working with extremely large datasets/data warehouses.</li>\n<li>Strong data mining proficiency.</li>\n<li>R/SAS/CART/TREENET experience is a plus.</li>\n</ul>\n\n<strong>Other Skills:</strong>\n\n\n<ul>\n<li>Aptitude in critical thinking and problem solving.</li>\n<li>Ability to set priorities and work independently and with a team to meet deadlines.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong interpersonal skills and ability to deal effectively in a team environment.</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>3-5 years of database marketing and data mining experience. Applicable experience with the Insurance and Financial industries is a strong advantage.</li>\n</ul>\n\nTo apply for this position, please complete an application online, which can be found at www.datalabusa.com/careers.\n<br><br>\nCompany DescriptionDataLab USA is an award winning addressable marketing consultancy that focuses on optimizing multichannel marketing solutions. Through the use of data analytics, sourcing, processing, and digital services DataLab USA effectively enables national organization to maximize their direct marketing investments."}