{"job title": "Data Modeler", "company": "DatRose", "city state": "– Herndon, VA", "rating": "3.7", "job description": "Datrose is seeking an experienced Data Modeler with a TS/SCI Clearance for an excellent Temporary Assignment in Herndon, VA! If interested in exploring, please apply directly at www.datrose.com/careers. If you have an active TS/SCI and 6 years exp please apply directly at www.datrose.com/careers.\n<br><br>\nNote: W2 only! No Corp-to-Corp.\n<br><br>\n<strong>Description:</strong>\n<br><br>\nData Modeler will be responsible for development and optimization of the geospatial Metadata Application Profile (MAP) to form the core metadata for content ingest, query and retrieval for a large, complex enterprise search system. This candidate will be working with the Data Architect to lead the efforts of translating business requirements into conceptual, logical and physical data models using various established metadata standards (NMF, DDMS, Dublin-core, etc.) Development tasks will include: • Creating system logical and physical data models to meet requirements. • Applying the Data Modeling Standards, logical and physical Data Naming Conventions appropriate for specific back-end databases. • Modifying and enhancing existing system data model with appropriate data types and sizes of data fields. • Documenting definitions for all new data model constructs as well as data model enhancements in a standard document. • Creating a mapping matrix describing the correlation between the data elements in the two system data models • Developing data mappings for reports, to correlate data elements on reports to tables/fields in the underlying physical data model • Performing analysis of system data to identify patterns, exceptions and erroneous data • Creating high-level process models (activity hierarchy diagrams, data flow diagrams, workflow diagrams, system interface diagrams) to represent business processes for the area under analysis • Conducting/attending requirements definition meetings with end users and document system/business requirements • Researching and adapting modeling methods from case studies or other proven approaches to integrate new data stores.\n<br><br>\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>Bachelors Degree with 6+ years of experience or equivalent</li>\n<li>5+ years of experience with hands-on data modeling expertise with relational databases - both logical and physical data models - including detailed knowledge of normalization techniques, forward-engineering and reverse-engineering techniques</li>\n<li>2+ years of experience of Cloud-based systems integration within an Amazon Web Service (AWS) environment.</li>\n<li>Active TS/SCI Clearance Required</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Degree in Systems Engineering or Software Engineering preferred</li>\n<li>Full Scope Poly Clearance preferred</li>\n<li>Experience in modeling large-scale (100+ entities) relational data models</li>\n<li>Experience performing data analysis of existing metadata profiles and identifying remediation required to conform to standards</li>\n<li>Experience with troubleshooting techniques to correct database problems and to proactively maintain the health of database systems</li>\n<li>Advanced knowledge in database design to produce sound logical and physical data models.</li>\n<li>Advanced knowledge of SQL and noSQL coding techniques to code stored procedures, functions, and views.</li>\n<li>Experience with NMF, DDMS, PUBS, Dublin-core, IC, ISM, NTK, data standards</li>\n<li>Experience performing cross walks between data standards and existing/proposed data models</li>\n<li>Experience with CSW, WMS, WFS and WCF OGC Services and Open Search Standards</li>\n<li>Experience with Geoserver and PostgreSQL</li>\n<li>Expereience with No-SQL databases such as SOLR, Elastic Search, IDOL</li>\n<li>Experience with various Imagery, Raster and Vector Geospatial data formats like CIB, DTED, SRTM, shapefile and Geodatabase</li>\n<li>Experience with CSW, WMS, WFS and WCF OGC Services and Open Search Standards</li>\n<li>Experience with Geoserver and PostgreSQL Hands-on experience with NGA geospatial data specifications.</li>\n</ul>\n\nDatrose is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, protected veteran status, or status as a qualified individual with disability."}