{"job title": "Data Visualization Engineer", "company": "Daxko", "city state": "– Highlands Ranch, CO", "rating": "4.0", "job description": "<strong>Company Description</strong>\n<br><br>\nnull\n<br>\nJob Description<br><br>Do you love visualizing data and evangelizing visualization approaches and best practices? Daxko is seeking an individual with experience in Business Intelligence and Data to be a hands-on addition to our Data &amp; Analytics team. The <strong>Data Visualization Engineer</strong> will work cross-functionally across the organization to set and achieve strategic objectives. To do so, you will research, analyze, and build solutions that visualize data to deliver insight to Daxko customers across all Daxko products.\n<br><br>\nWe are an Agile/Scrum shop with a strong sense of teamwork and collaboration, where teams are encouraged to operate with the autonomy and flexibility of startups, while enjoying the benefits of being part of an established company.\n<br><br>\n<em><strong>NOTE: This position can be located in any of our main offices - Birmingham, AL; Bannockburn, IL (Chicago); or Highlands Ranch, CO (Denver).</strong> </em>\n<br><br>\n<strong>Here are a few things you'll find yourself doing in this role...</strong>\n<ul>\n<li>Becoming an expert, managing, and administering Daxkos Business Intelligence tools and solutions</li><li>Creating interactive dashboards and visualizations leveraging Birst and other tools</li><li>Building a narrative coupled with data and visuals to explain to an audience whats happening and why a particular insight is important</li><li>Working with Data Scientists to distill data into actionable and intuitive visualizations that tell stories</li><li>Conducting customer research in collaboration with our Product Team</li><li>Continuously iterating and testing your ideas with end-users</li><li>Creating functional and technical documentation related to Business Intelligence &amp; Data solutions</li><li>Delivering transformative solutions to customers that are aligned to industry best practices and providing thought leadership in Daxkos market space</li><li>Aiding in the dissemination of business analysis best practices throughout the organization</li>\n</ul>\n\nQualifications<br><br><strong>Here's what you need to have...</strong>\n<ul>\n<li>Bachelors degree in Business, Marketing, Finance, Economics, Statistics, Computer Science, Engineering, Information Technology or similar quantitative field</li><li>Greater than 3 years experience in Business Intelligence or Information Management</li><li>Advanced SQL skills</li><li>Strong communication skills across all mediums and audience types (technical, business, executive, etc.)</li><li>Have a keen eye for visual aesthetics</li><li>Passion for data analysis and solving problems with data</li><li>Strong analytical mindset and ability to use data and logic to create solutions to solve customer problems</li><li>Ability to decompose complex business problems into their constituent parts</li><li>Ability to use innate curiosity to collaborate with different business units to co-create solutions</li>\n</ul>\n<strong>A plus if you have experience with some of these...</strong>\n<ul>\n<li>Experience with Birst, Tableau, or other industry leading BI tools</li><li>Experience with Big Data technologies such as Hadoop, Hive, Spark, Columnar databases, etc.</li><li>Knowledge of relational and dimensional modeling, theories, principles, and practice (Kimball methodology, star schemas, Normalization, etc)</li>\n</ul>\n\nAdditional Information<br><br>The Daxko Nation includes three distinct brands: Daxko, Club Automation, and Zen Planner. Through these brands, we deliver comprehensive technology solutions and experienced services to health &amp; wellness facilities. Since we began in 1998, weve grown to span 68 countries, 10,000 facilities and over 20 million members. Our customers rely on us to be the engine of their growth with deep insight, guidance, technology solutions, and exceptional experiences that make us the industrys recognized #1 software provider.\n<br><br>\nOur company, with a culture of collaboration, action, and entrepreneurship, has a well-deserved reputation of providing career defining opportunities for team members willing to pursue them.\n<br><br>\nWith a high value placed on taking care of our customers and our team members, we have frequently been recognized locally and nationally as best workplaces.\n<br><br>\nWe truly care for our team members, and this is reflected through our offices, benefits, and great perks. Some of our favorites include:\n<ul>\n<li>Flexible paid time off</li> <li>Affordable health insurance options</li><li>Monthly fitness reimbursement</li><li>401(k) matching</li><li>Casual work environment</li><li>Plenty of free food and caffeine</li>\n</ul>\nAll your information will be kept confidential according to EEO guidelines."}