{"job title": "Business/Data Analyst", "company": "Dedicated Tech Services", "city state": "– Columbus, OH", "rating": "4.5", "job description": "U.S. Citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor at this time.\n<br><br>\nApplicants only, no corp-to-corp candidates, third parties, or agencies please.\n<br><br>\n<strong>Required Skills and Experience:</strong>\n\n<ul>\n\n <li>Very strong, engaging, outgoing interpersonal skills</li>\n<li>Experience in interacting and working directly with business customers</li>\n<li>Experience translating data analysis to business customers</li>\n<li>Ability to sell products and suggest solutions to customers based on the data</li>\n<li>High energy, people person is required for this position</li>\n<li>Outstanding, articulate, and clear communication skills</li>\n<li>Ability to convey ideas and generate solutions to business customers</li>\n<li>Ability to answer clinical data-related questions from business customers</li>\n<li>Ability to manage customer expectations</li>\n<li>Strong personality</li>\n<li>Very strong attention to detail</li>\n<li>Outstanding organizational and prioritization skills to understand project status, answer questions, handle multiple (and sometimes conflicting) priorities and requests.</li> \n\n<li>Ability to analyze business needs to determine technical requirements and communicate with engineers and business stakeholders.</li> \n\n<li>Understand data warehouse concepts, schemas, relational and dimensional data models.</li>\n<li>Strong SQL query skills for relational databases (Postgres and Redshift)</li>\n<li>Healthcare data experience</li>\n<li>Understanding of healthcare data products</li>\n<li>Customer service background</li>\n<li>Data feasibility background</li>\n<li>Agile/Scrum experience</li> \n\n<li>Experience in Acceptance Test Driven Development (ATDD)-related requirements methods</li>\n<li>Data modeling</li> \n</ul>\n<strong>Job Description:</strong>\n<br><br>\nWe are seeking a business-focused data analyst who will work directly with our client’s customers and the sales team as a support and sponsor of our client’s products. It is a rapid and very fast-paced work environment because the selected candidate must respond very quickly to the client’s customers’ clinical data needs.\n<br><br>\nOur client has a very innovative, collaborative, friendly, and exciting work environment and culture.\n<br><br>\nResponsibilities include:\n\n<ul>\n\n <li>Execute daily operations queries to ensure that all files were received from vendors.</li>\n<li>Ensure that all data was ingested, exports occurred, and data quality counts match expectations.</li>\n<li>Serve as a triage point for issue resolution with vendors and customers.</li>\n<li>Contact vendors to arrange for data to be re-sent and communicate with downstream customers as to the status of issues resolution.</li> \n\n<li>Escalate to management, stakeholders, engineering, and infrastructure staff as necessary.</li>\n<li>Ensure data quality by analyzing counts of data sent, processed, and received.</li> \n\n<li>Identify and investigate data anomalies in the data warehouse and create defect cards for corrections of code and/or data.</li>\n<li>Decompose epics into user stories that include technical requirements for development</li>\n<li>Lead team joint application development discussions, and issue sizing and prioritization</li> \n\n<li>For small projects, work directly with stakeholders and other technical teams to plan sequencing and timeline for development and testing activities.</li>\n</ul>\n\n<br>"}