{"job title": "Data Scientist", "company": "DeepCurrent Technologies, Inc.", "city state": "– Los Angeles, CA, US", "rating": "4.0", "job description": "<div>\n<strong>Context</strong></div><div>\nDeepCurrent is focused on creating the most efficient invoice processing solution for a world where structured data can be directly leveraged to serve customers, create value and improve quality of work all without requiring time to master different layouts, structures, input formats or languages. To achieve this, we built cognitive, deep domain products that automate tedious human data extraction and classification tasks, while enabling quick deployment of AI capabilities without the difficulty and delay of trying to build an internal AI expertise.</div> <br>\n<div>\nWere looking for a Data Scientist to join our Technology Team. The ideal candidate will have industry experience working with a range of machine learning models and and data types in disciplines such as deep learning, computer vision, natural language processing, and collaborative filtering.</div> <br>\n<div>\nThis position is full-time and based in our Century City, California office.</div><br>\n<div>\n<strong>Responsibilities</strong></div>\n\n<ul>\n\n<li>\nDefine data specifications based on product and company needs</li> \n<li>\nCollect and clean data sets; apply appropriate analytical tools and methods to large, real-world data sets that may include heterogeneous or incomplete data</li>\n<li>\nPresent end results of data analysis in verbal and written form using visualizations and analytics to cross-disciplinary teams</li> \n<li>\nWork collaboratively with Engineering to design and improve DeepCurrent products based on data insights.</li> \n<li>\nWrite automated tooling for data analysis, and work with engineering to build and utilize internal data analysis pipelines</li> \n</ul>\n\n<br>\n<div>\n<strong>Minimum Qualifications</strong></div>\n\n<ul>\n\n<li>\nMS degree in Computer Science, Mathematics, Statistics or related quantitative field (physics, bioinformatics, economics, computational biology, electrical or industrial engineering)</li> \n<li>\n2+ years of relevant work experience in data analysis or related field</li>\n<li>\nStrong programming skills and significant experience developing and debugging the numerical Python stack: Python, numpy, Pandas, scikit-learn</li>\n<li>\nProven ability to evaluate and apply statistical tools to translate insights into workable solutions</li> \n<li>\nExperience working in Unix-based operating systems</li>\n</ul>\n\n<br>\n<div>\n<strong>Preferred Qualifications</strong></div>\n\n<ul>\n\n<li>\nPhD degree in a quantitative discipline</li>\n<li>\n4+ years of relevant work experience</li>\n<li>\nExperience developing in Golang, C, or C++</li>\n<li>\nApplied experience with machine learning on large data sets</li>\n</ul>"}