{"job title": "Business Scientist - Voice Analytics Consultant", "company": "Dell", "city state": "– Round Rock, Texas", "rating": "3.8", "job description": "<p>Why Work at Dell?</p><p>Endless challenges and rewards. Opportunities on six continents. A team of colleagues fueled by collaboration. All this, and a company deeply committed to integrity and responsibility.</p><p>DESCRIPTION:<br><br>Consultant Business Science (I9)<br><br>We are seeking a Business Science Consultant for a new position who has the entrepreneurial mindset to contribute to our growth and profitability, and can work toward developing a fundamentally new approach to how business generates meaning and value from data. As part of the Business Intelligence team, you will be responsible for drilling down into large quantities of data and driving organizational change. This position is an opportunity to join a team which is making its initial foray into call center speech and desktop analytics. This position requires an energetic, proactive professional with strong analytical and report modeling skills.<br><br>Principal Accountabilities<br><br>Interacts with business leaders to understand business strategy, conditions and problem areas<br>Contributes to business strategy and influences decision making based on information gained from deep dive analysis<br>Produces actionable &amp; compelling recommendations by interpreting, exploring, identifying and communicating insights discovered from complex data sets<br>Partners with both internal &amp; external sources to gather and examine data from disparate sources with the goal of discovering previously hidden insights<br>Designs, develops and documents methods, processes and systems to consolidate and analyze unstructured data to generate actionable insights and solutions<br><br>Principal Responsibilities<br><br>Develops and applies advanced techniques and theories to deliver actionable business insights to prospects and customers based on large-scale data<br>Works independently with internal and external teams<br>Leads end-to-end steps involved in model development in alignment with established core subject-matter expertise in key horizontal or vertical themes<br>Leads the design/testing of new analytical technologies, or the development of new algorithms/functions for application in model-development<br>Leads the development and testing of algorithms/functions to address core subject-matter requirements and customer engagements<br>Delivers results and presentations in a timely manner and handles projects with a long term focus<br>Leads definition of analytics vision, multiple use-case evaluations and selection criteria, as well as project-level scope definition<br>Serve as subject-matter analytics expert in presentations to customers and larger audiences<br>Collaborate with inside sales teams to educate prospects and customers on analytics offerings while leading pre-sales discussions by presenting on analytics service offering and technology stack while establishing customer rapport<br>Leads partnerships with the academic and business community to develop new techniques and contribute to research in the area of analytics on large databases<br>Authors White Papers in collaboration with academic peers and others on innovative techniques or new approaches to Machine Learning / Predictive Modeling on large-scale data<br>Generates requirements and advocates to internal engineering on the development of new analytics capabilities for the big data platform, in alignment with core subject-matter expertise<br>Serves as spokesperson on specialized projects and act as prime consultant on large projects<br>May be informal team leader<br>Lead partnerships &amp; relationships with third parties to develop vertical/horizontal analytical solutions and product integrations<br><br>Skills<br>Contact Center Background preferred<br>Voice Analytics Experience (preferred)<br>Process Engineering<br>Appropriate mathematical / Science Background<br>Expert statistical analysis skills<br>Expert understanding of business environment and industry trends<br>Expert communication and problem solving skills<br>Strives for professional development<br>Ability to work in a diverse team environment<br>Customer focused<br>Expert technical aptitude<br>Possesses expert product/technology/industry knowledge<br>Understanding of products and their value added to the customer<br>Expert leadership Skills<br>Expert mentoring/coaching skills<br>Ability to engage in multiple initiatives simultaneously<br>Technical writing skills<br>Familiar with database query strings<br>Knowledgeable in call center metrics<br>SQL/SSRS a plus<br>Ability to draw correlations, identify root causes, and summarize results for stakeholders<br><br><br><br><br>QUALIFICATION:<br><br>Minimum Qualifications<br><br>5 to 8 years in an analytical or reporting capacity with expert level exposure to BA/PM techniques<br>B/A or B/S; in business or technical field preferred<br>Must be proficient in Microsoft Suite, specifically Excel; pivot tables, V-lookups, formulas and importing of data<br>Consider yourself a true champion for change, challenging the status quo by recognizing opportunities to improve and successfully communicating and executing on recommended corrective actions<br>Proven ability to work independently and efficiently under aggressive deadlines<br><br><br>Company Description:<br>With more than 100,000 team members globally, we promote an environment that is rooted in the entrepreneurial spirit in which the company was founded. Dells team members are committed to serving our communities, regularly volunteering for over 1,500 non-profit organizations. The company has also received many accolades from employer of choice to energy conservation. Our team members follow an open approach to technology innovation and believe that technology is essential for human success.<br><br>Why work with us?<br>Life at Dell means collaborating with dedicated professionals with a passion for technology. When we see something that could be improved, we get to work inventing the solution. Our people demonstrate our winning culture through positive and meaningful relationships. We invest in our people and offer a series of programs that enables them to pursue a career that fulfills their potential. Our team members health and wellness is our priority as well as rewarding them for their hard work.<br><br>Dell is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work) and will not be discriminated against on the basis of such characteristics or any other status protected by the laws or regulations in the locations where we operate. Dell encourages applicants of all ages.</p>"}