{"job title": "SAP Hana Analytics - Manager (Analytics)", "company": "Deloitte", "city state": "– Chicago, IL", "rating": "3.8", "job description": "Are you looking for a career trajectory that few other organizations can offer in SAP? What about access to a high-quality portfolio of businesses and clients with opportunities to work across capabilities, industries, and geographies – in roles and on projects aligned with your SAP Analytics skills? If this matches your interests and aspirations Deloitte may be right for you.\n<br>\nWork you’ll do\n<br>\nOur SAP Analytics practice utilizes the latest technology from SAP to develop exciting, innovative solutions to our clients’ most pressing business problems.\n<br>\nYou will help conduct design thinking workshops with senior management to design industry and process centric digital boardrooms.\n<br>\nConceptualize, design and assist in the implementation of new and existing systems, middleware, data warehouse and production architectures.\n<br>\nIdentify and promote best practices and patterns for data modeling, and provide oversight for all activities related to data cleansing, data quality and data consolidation.\n<br>\nSupport data quality components during the implementation of the solution architecture. Provide technical recommendations for optimized data access and retention for the data warehouse.\n<br>\nIdentify emerging technology trends and help align the practice to these technologies.\n<br>\nThe team\n<br>\nThe full potential of SAP solutions isnt just about technology, its also about driving sustainable business value. At Deloitte Consulting LLP, our SAP specialists deliver the technology and services to help our clients meet business performance goals and improve processes. As an SAP Global Partner we provide a broad range of consulting services, from HR, CRM and supply chain to finance transformation. Learn more about our SAP practice.\n<br>\nRequired qualifications\n<br>\nFunctional/technical proficiency with at least 4+ full life cycle SAP implementations and 8+ years of industry and/or consulting experience\n<br>\nExperience implementing SAP HANA Analytics, SAP S/4HANA, HANA Cloud Platform (HCP) - Cloud for Analytics, Digital Board Room, and BOBJ.\n<br>\nMust have HANA on Cloud experience\n<br>\nInternet of Things (IoT), Altiscare Hadoop and Big Data experience a plus\n<br>\nExperience defining systems strategy, developing systems requirements, designing and prototyping, testing, training, defining support procedures and implementing practical business solutions under multiple deadlines\n<br>\nAdept at designing and implementing technology-enabled business solutions for clients as part of a high-talent team and as a team lead or Project Manager on at least 3+ full cycle implementations\n<br>\nAble to collaborate with clients, identify engagement follow-on opportunities and have a strong desire to excel and be committed to gaining exposure to multiple industries while further developing your career\n<br>\nStrong current hands-on configuration and design skills\n<br>\nAbility to travel 80-100% is REQUIRED\n<br>\nBachelor’s degree or equivalent required\n<br>\nMaster’s degree preferred\n<br>\nQualified candidates will also possess extensive experience in one or more of the following technologies:\n<br>\nSAP Native / Enterprise HANA\n<br>\nSAP HANA Cloud Platform Analytics / API Library\n<br>\nSAP BusinessObjects Cloud and Digital Boardroom\n<br>\n<strong>SAP SLT</strong>\n<br>\nHANA Predictive Analytics Engine (PAL)\n<br>\nHANA XS Engine\n<br>\nSQL Script Procedures"}