{"job title": "Reporting &amp; Analytics Manager", "company": "Deloitte &amp; Touche L.L.P.", "city state": "– Hermitage, TN", "rating": "3.8", "job description": "In Global Technology Services, we make an impact by providing leading edge technology products and support to the entire Deloitte organization. We offer innovative technology solutions that cross borders and help Deloitte deliver and connect with their clients, their communities, and one another in ways they never thought possible.\n<br><br>\n<strong>Work you'll do:</strong>\n<br><br>\nDeloitte Global currently has an exciting Performance Metrics and Analytics opportunity available. This unique role will require you to articulate strategic and operations reporting insights and recommendations in a manner that is meaningful to management. You need to be able to influence leadership to work through tough, complex issues.\n<br><br>\nDo you possess a drive for results while motivating the team and constantly driving towards key milestones, maintaining constant awareness of deliverables, and keeping focused on high quality scalable solutions?\n<br><br>\nThis Deloitte Global role requires limited travel (10%).\n<br><br>\nWhat you'll be part ofour Deloitte Global culture:\n<br><br>\nAt Deloitte, we expect results. Incredibletangibleresults. And Deloitte Global professionals play a unique role in delivering those results. We reach across disciplines and borders to serve our global organization. We are the engine of Deloitte. We develop and lead global strategies and provide programs and services that unite our network.\n<br><br>\nIn Deloitte Global, everyone has an opportunity to lead. We see the importance of your perspective and your ability to create value. We want you to fit inwith an inclusive culture, focus on work-life fit and well-being, and a supportive, connected environment; but we also want you to stand outwith opportunities to have a strategic impact, innovate, and take the risks necessary to make your mark.\n<br><br>\nDeloitte Global supports our talented professionals in answering the question: What impact will you make?\n<br><br>\n<strong>Who you'll work with:</strong>\n<br><br>\nThe Performance Metrics &amp; Analytics Technical SQL Architect/Developer will have accountability for the technical delivery of reporting solutions to support cyber reporting. The successful candidate will be responsible for standards and lead developer within the technical team in data warehousing / database architecture and ETL to support the teams reporting initiatives as defined. The individual will oversee research, review, and analyze the effectiveness and efficiency of existing procedures and develop strategies for enhancing or further leveraging these processes. The resource will collaborate with others to facilitate the implementation of new or improved processes that will aid the member firms. The candidate is also responsible for the maintenance, support and quality.\n<br><br>\nThis role is based in Chicago, IL or Hermitage, TN. Relocation assistance may be considered on a case by case basis.\n<br><br>\n<strong>How you'll grow:</strong>\n<br><br>\nDeloitte Global inspires leaders at every level. We believe in investing in you, helping you embrace leadership opportunities at every step of your career, and helping you identify and hone your unique strengths. We encourage you to grow by providing formal and informal development programs, coaching and mentoring, and on-the-job challenges. We want you to ask questions, take chances, and explore the possible.\n<br><br>\n<strong>Benefits you'll receive:</strong>\n<br><br>\nDeloitte's Total Rewards program reflects our continued commitment to lead from the front in everything we do that's why we take pride in offering a comprehensive variety of programs and resources to support your health and well-being needs. We provide the benefits, competitive compensation, and recognition to help sustain your efforts in making an impact that matters.\n<br><br>\nTo be considered for this role, there are certain qualifications you'll have to have. And others that would be really, really nice.\n<br><br>\n<strong>Required:</strong>\n\n\n<ul>\n<li>5+ years of experience in the Microsoft BI toolkit (SQL, SSIS, SSRS, SSAS), with SQL 2012 and 2016 within an enterprise environment, this includes data modeling, reporting services and support. This includes both tabular, and multi-dimensional databases to design, implementation and support.</li>\n<li>Proven experience with reporting tools, software, and other applications such as Power BI, required.</li>\n<li>Solid understanding of Microsoft SharePoint Server product and platform (2012 and 2016) with design through deployments including installation.</li>\n<li>Solid understanding of Microsoft SharePoint Server product and platform (2012 and 2016) with design through deployments including installation</li>\n<li>Extensive practical knowledge in importing data from varying data sources using differing data connections types (API, flat file, direct connection, etc)</li>\n</ul>\n\n<strong>Education and experience:</strong>\n\n\n<ul>\n<li>College diploma or University degree in Computer Science, Business, Engineering, or equivalent work experience</li>\n</ul>\n\n<strong>Preferred:</strong>\n\n\n<ul>\n<li>Experience in the cyber security arena is preferred, i.e. Privileged Access Management, Data Loss Prevention, Firewall, Vendor Risk Assessment, Penetration Testing, Vulnerability Management, etc.</li>\n<li>Experience with various technologies, HTML5, JavaScript, C#, ASP .NET</li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or protected veteran status, or any other legally protected basis, in accordance with applicable law.\n<br><br>\nDisclaimer: Nothing in this job description/posting shall constitute an offer or promise of employment. If you are not reviewing this job posting on our Careers' site (jobs2.deloitte.com) or one of our approved job boards we cannot guarantee the validity of this posting. For a list of our current postings, please visit us at jobs2.deloitte.com\n<br><br>\nDeloitte will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, where applicable. See notices of various ban-the-box laws where available. https://www2.deloitte.com/us/en/pages/careers/articles/ban-the-box-notices.html\n<br><br>\nRequisition code: DE19USAGTS005AJ1091"}