{"job title": "Data Engineer", "company": "Deloitte", "city state": "– Washington, DC", "rating": "3.8", "job description": "<ul>\n<li>*Seeking Data Engineers to join our Center for Analytics in Washington, D.C!**</li>\n<li>*Work you ll do**</li>\n</ul>\n\nOur Client's Center for Analytics is responsible for providing the cross-functional, enterprise-level data analysis and solutions needed to accomplish key policy objectives and make informed decisions. Over the last year, Deloitte has supported the incubation of the Center for Analytics through development and implementation of a strategic vision. This Centers' advanced analytics work stream produces enterprise-level advanced analytics and data-driven decision-support tools for principal executives and stakeholders.\n<br><br>\nWe are looking for Data Engineers to join our growing team of analytics experts. Our selected individuals will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. Ideal candidates are experienced data pipeline builders and data wranglers who enjoys optimizing data systems and building them from the ground up. Our Data Engineers will support our database architects, data analysts, and data scientists on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects, hence being self-directed and comfortable supporting the data needs of multiple teams, systems and products is a must.\n\n\n<ul>\n<li>*The team**</li>\n</ul>\n\nSystems Engineering\n<br><br>\nOur Systems Engineering team delivers large-scale software applications and integrated systems, and assists clients with architecture design, assessment and optimization, and definition. We develop service-oriented architecture (SOA) and other integration solutions to enable information sharing and management between business partners and disparate processes and systems, and we deliver technology enablement to support CIO services transformation.\n<br><br>\nSystems Engineering professionals focus on key client issues that impact the core business by maximizing operational value, driving down the cost of quality, and enhancing technology innovation. Our teams deliver a wide range of services, including application architecture design and optimization, application modernization, business process management and solution integration, custom application design and development, and large-scale technology delivery program efforts.\n\n\n<ul>\n<li>*Responsibilities:**</li>\n</ul>\n\nCreate and maintain optimal data pipeline architecture,\n<br><br>\nAssemble large, complex data sets that meet functional / non-functional business requirements.\n<br><br>\nIdentify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.\n<br><br>\nBuild the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL\n<br><br>\nBuild analytics tools that utilize the data pipeline to provide actionable insights\n<br><br>\ninto customer acquisition, operational efficiency and other key business performance\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n+ A minimum of 4 to 6 years of applicable experience coupled with a completed Bachelor's Degree\n<br><br>\n+ U.S. Citizenship is required as is an active Top Secret Security Clearance\n<br><br>\n+ Proven experience working with ANSI SQL, R Studio, Microsoft SQL Server, Database Design and Administration\n\n\n<ul>\n<li>*How you ll grow**</li>\n</ul>\n\nAt Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there s always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career. Explore Deloitte University, The Leadership Center. at https://zoomforth.com/s/deloitte/du#home\n\n\n<ul>\n<li>*Benefits**</li>\n</ul>\n\nAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you. at http://www2.deloitte.com/us/en/pages/careers/articles/life-at-deloitte-benefits-and-rewards.html\n\n\n<ul>\n<li>*Deloitte s culture**</li>\n</ul>\n\nOur positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture where our people excel and lead healthy, happy lives. Learn more about Life at Deloitte.\n\n\n<ul>\n<li>*Corporate citizenship**</li>\n</ul>\n\nDeloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte s impact on the world. at http://www2.deloitte.com/us/en/pages/about-deloitte/articles/deloitte-corporate-citizenship.html\n\n\n<ul>\n<li>*Recruiter tips**</li>\n</ul>\n\nWe want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you re applying to. Check out recruiting tips from Deloitte professionals. at http://www2.deloitte.com/us/en/pages/careers/topics/recruiting-tips.html\n<br><br>\nCategory: Management Consulting\n<br><br>\nAbout Deloitte\n<br><br>\nAs used in this document, Deloitte means Deloitte LLP and its subsidiaries. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law."}