{"job title": "Data Scientist/Engineer", "company": "Deloitte", "city state": "– Huntsville, Alabama, United States", "rating": "3.8", "job description": "Position summary<br>\n\n <div>Are you passionate about cyber and security challenges in information technology, associated with threats and vulnerabilities? Are you are interested in a role that offers an opportunity to provide front line support to our Federal clients? If yes, then Deloitte’s Cyber Risk team could be the place for you! Join our team of Cyber Risk professionals who collaborate with government agencies, IT professionals, and clients to support cyber security and risk consulting engagements.\n<br><br>\n<strong>Work you’ll do</strong>\n<br><br>\nAs a Project Delivery Manager in the Cyber Risk group you will:\n<br><br>\n• Improve the operational systems, processes, and policies in support of the client’s mission through the management and guidance of multiple work streams, teams, and clients\n<br><br>\n• Support engagements related but not limited to Operations &amp; Maintenance, Helpdesk Operations, Software and Application Development and Maintenance, Financial Operations, and Project and Acquisition Management\n<br><br>\n• Provide input to key deliverable structure and content, as well as facilitating buy-in of proposed solutions from top management levels\n<br><br>\n• Direct timely delivery of quality work products for the client\n<br><br>\n• Manage engagement risk\n<br><br>\n• Provide professional development of junior staff performing the role of counselor and coach, as well as providing leadership and support\n<br><br>\n• Collect data, perform Extract, Transform, Load (ETL) processes and develop analytics based on activity based intelligence (ABI) principles to output pattern of life and event driven triggers that drive mission decisions\n<br><br>\n• Be an integral part of all phases of the project development life cycle and will help develop scalable, fast, and robust solutions to solve complex analytic problems\n<br><br>\n• Will work with a diverse team of developers, analysts, and data scientists to develop innovative solutions that deliver value to customers\n<br><br>\n<strong>The Team</strong>\n<br><br>\nTransparency, innovation, collaboration, sustainability: these are the hallmark issues shaping Federal government initiatives today. Deloitte’s Federal practice is passionate about making an impact with lasting change. Carrying out missions in the Federal practice requires fresh thinking and a creative approach. We collaborate with teams from across our organization in order to bring the full breadth of Deloitte, its commercial and public sector expertise, to best support our clients. Our aspiration is to be the premier integrated solutions provider in helping to transform the Federal marketplace.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nRequired:\n<br><br>\n• Typically has 7 or more years of consulting and/or industry experience\n<br><br>\n• Ability to support engagements of greater than average size and complexity\n<br><br>\n• Ability to lead multiple teams and multiple clients with confidence\n<br><br>\n• Excellent teamwork and interpersonal skills\n<br><br>\n• Professional oral and written communication skills\n<br><br>\n• Ability to mentor and manage junior staff and further their professional growth\n<br><br>\n• Ability to obtain and maintain the required clearance\n<br><br>\n• Data Science\n<br><br>\nPreferred:\n<br><br>\n• Prior professional services or federal consulting experience\n<br><br>\n• Bachelor’s Degree\n<br><br>\n• Comfortable in scripting languages (Python, Matlab, R)\n<br><br>\n• Comfortable with Linux operating systems and command line interfaces\n<br><br>\n• OS Linux – Python – Big Data\n<br><br>\n<strong>How you’ll grow</strong>\n<br><br>\nAt Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs, our professionals have a variety of opportunities to continue to grow throughout their career.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.\n<br><br>\n<strong>Deloitte’s culture</strong>\n<br><br>\nOur positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture where our people excel and lead healthy, happy lives.\n<br><br>\n<strong>Corporate citizenship</strong>\n<br><br>\nDeloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.\n<br><br>\n<strong>Recruiter tips</strong>\n<br><br>\nWe want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you’re applying to. Check out recruiting tips from Deloitte professionals.<br>\n<div>As used in this document, “Deloitte” means Deloitte LLP and its subsidiaries. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.</div><br>\n\n<div> Requisition code: E19HUNEMGRAW001</div></div>\n<br>"}