{"job title": "Cognos Data Analyst", "company": "Deloitte &amp; Touche L.L.P.", "city state": "– Washington, DC", "rating": "3.8", "job description": "Are you interested in working in a dynamic environment? Our Human Capital practice is on the forefront of helping to solve the government's most complex challenges from the organizational shifts that result from rapidly evolving missions, to declining job satisfaction, duplication of HR services across agencies, and continuously rising costs of HR systems. If you are seeking a role that offers you the opportunity to work with Government clients, consider a career in Deloitte's Government and Public Sector Human Capital practice.\n<br><br>\nWork you'll do\n<br><br>\nAs a Project Delivery Analyst in the Human Capital group you will:\n\n\n<ul>\n<li>Support Implementation and Operations Management best practices</li>\n<li>Lead and support tasks and portions of the project scope on engagements related but not limited to HR Service Delivery, Learning &amp; Development, Communications, Change Management, and Compensation and Reward programs</li>\n<li>Demonstrate a foundational understanding of the client environment and overall project scope</li>\n<li>Identify and solve problems using analysis, experience, and judgment</li>\n<li>Independently perform tasks with some guidance to execute a portion of the project scope</li>\n<li>Be a member of the team that provides the client with an ongoing data analysis, modeling and forecasting support and briefings pertaining to the organization's workforce and the health of the organization.</li>\n<li>Facilitate workforce analytics by assisting the client to:</li>\n<li>Provide analysis and understanding of workforce data to facilitate strategic decision making, policy compliance and progress reporting of programs and initiatives designed to recruit, develop and retain a world class workforce.</li>\n<li>Develop products by implementing the defined analytics and modeling methodology - collect reporting requirements</li>\n<li>Conduct operations research studies</li>\n<li>Aggregate and synthesize data from authoritative systems into metrics and analytics</li>\n<li>Design models, tools for workforce planning and forecasts to facilitate recruitment, develop and retention of workforce excellence</li>\n<li>Analyze client workforce demographics, attrition trends, and develop sophisticated metrics</li>\n<li>Organize and build suitable data models</li>\n</ul>\n\nThe Team\n<br><br>\nTransparency, innovation, collaboration, sustainability: these are the hallmark issues shaping government initiatives today. Deloitte's Government and Public Sector practice is passionate about making an impact with lasting change. Carrying out missions in the government requires fresh thinking and a creative approach. We collaborate with teams from across our organization in order to bring the full breadth of Deloitte, its commercial and public sector expertise, to best support our clients. Our aspiration is to be the premier integrated solutions provider in helping to transform the Federal marketplace.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Required:</strong>\n\n\n<ul>\n<li>Typically has 1 or more years of consulting and/or industry experience</li>\n<li>Ability to work independently under general guidance</li>\n<li>Experience working in teams and in a team environment that is process-oriented and deadline-driven</li>\n<li>Professional oral and written communication skills</li>\n<li>Relevant software or application skills to complete job successfully</li>\n<li>Problem solving and troubleshooting skills with the ability to exercise mature judgment</li>\n<li>Active SECRET clearance required</li>\n<li>Bachelor's Degree</li>\n<li>Experience using and developing reports in Cognos 11</li>\n<li>At least 2 years of specialized hands-on experience in using Excel, R Studio, SAS or other analytical tools to conduct statistical data analysis</li>\n<li>Strong mathematical statistics skills, excellent analytical aptitude and extensive MS Excel skills</li>\n<li>Strong understanding of the following: federal human resource databases/systems, policies, processes and procedures</li>\n<li>Ability to synthesize large amounts of data and identify key trends</li>\n</ul>\n\n<strong>Preferred:</strong>\n\n\n<ul>\n<li>Prior professional services or federal consulting experience</li>\n<li>Oracle Data Warehousing</li>\n</ul>\n\nHow you'll grow\n<br><br>\nAt Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there's always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs, our professionals have a variety of opportunities to continue to grow throughout their career.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.\n<br><br>\nDeloitte's culture\n<br><br>\nOur positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture where our people excel and lead healthy, happy lives.\n<br><br>\nCorporate citizenship\n<br><br>\nDeloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte's impact on the world.\n<br><br>\nRecruiter tips\n<br><br>\nWe want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you're applying to. Check out recruiting tips from Deloitte professionals.\n<br><br>\nAs used in this posting, \"Deloitte\" means Deloitte Consulting LLP, a subsidiary of Deloitte LLP. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. Certain services may not be available to attest clients under the rules and regulations of public accounting.\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.\n<br><br>\nRequisition code: E18WASCPDASS43291-HC"}