{"job title": "Cyber Data Analytics Manager - Minneapolis, Houston, Charlotte", "company": "Deloitte", "city state": "– New York, NY", "rating": "3.8", "job description": "Position summary<br>\n\n <div><div><strong>\n<br>\n<div>Are you a leader who is passionate about working with data? If so, Deloitte could be the place for you! Our clients are large, complex organizations that constantly evolve and innovate to build better products and services, and serve their customers and constituents in new ways. In the process, they encounter new cyber risks and an increasingly sophisticated cyber threat terrain. The work we do to help them identify, assess, and address cyber risks is increasingly important to their success – and to the strength of the economy and public security</div>\n<br>\n<div><strong>Work you’ll do</strong></div>\n<br>\n<div></div>\n<br>\n<div>As a Manager in Cyber Risk, you’ll lead diverse teams of professionals to help design and implement solutions to some of today’s toughest cybersecurity challenges so they can achieve business growth and manage risk. You’ll build on your foundations in Information Technology and Business to design and implement business-aligned cyber risk management programs, processes, and systems that help clients focus their investments on key information technology risks.</div><br>\n\n<div><strong>In your role as a Data Analytics Manager, you will lead, develop &amp; influence a team of Senior Consultants and Consultants in delivering data analytics projects to a variety of Cyber clients internal and external, including such examples as:</strong></div>\n<ul>\n<li>Influence &amp; develop the impact &amp; direction of the team through awareness of Deloitte and our clients strategic goals</li>\n<li>Assessing or developing an organization’s cyber risk strategy and posture, as it relates to data risk, cyber risk management, cyber risk frameworks and policies, and/or cyber risk measures, methods, and reporting</li> \n\n<li>Analyzing cyber risk quantification models, assumptions, and outputs</li> \n\n<li>Evaluating compliance with government regulations and guidelines (GDPR, NIST)</li>\n<li>Querying and analyzing small and large data sets to discover patterns and deliver meaningful insights</li> \n\n<li>Performing assessment of client analytics and data management capabilities</li>\n<li>Organize and deliver services on a cross-section of complex projects</li>\n<li>Display leadership and business judgment by anticipating client and project needs and developing alternative solutions</li>\n<li>Provide coaching, oversight, and support for delivery teams and staff</li>\n<li>Support the development of data science and advanced analytics services with our clients</li>\n<li>Apply experience in analytics, data visualization and modeling to find solutions for a variety of business and technical problems</li>\n<li>Explore promising new technology tools and maintain/gain technical edge required for projects</li> </ul></strong>\n</div>\n<br>\n<div></div> \n<br>\n<div><div>\n<div><strong>Qualifications</strong></div>\n<br>\n<div></div><br>\n\n<div><strong>Required:</strong></div>\n<ul>\n<li>Bachelor or Master of Science/Business Administration with a concentration in computer science, information systems, information security, math, decision sciences, risk management, engineering (mechanical, electrical, industrial) or other business/technology disciplines</li>\n<li>Travel up to 80%</li> \n\n<li>Based out of Houston or Minneapolis as first choice; second choice is Charlotte</li>\n<li>6 minimum years of work experience in 4 or more of following areas:</li>\n<li>\n<div>Proven leadership skills demonstrating strong judgment, problem-solving, and decision-making abilities</div></li>\n<li>\n<div>Experience managing senior-level client relationships</div></li>\n<li>\n<div>Experience presenting to clients or other decision makers to present and sell ideas to various audiences (technical and non-technical)</div></li>\n<li>\n<div>Exposure to any of the following Analytics and Information Management competencies –Data Management and Architecture, Performance Management, Information Delivery and Advance Analytics</div></li>\n<li>\n<div>Hands on experience in analytical and data visualization tools and techniques</div></li>\n<li>\n<div>Experience with software development/engineering</div></li>\n<li>\n<div>Experience managing staff and budgets for at least 2 years</div></li>\n<li>\n<div>Experience with leading practices and frameworks in cyber risk identification, assessment, and management</div>\n\n</li><li>Experience working with cyber risk measurement methods, tools, and principles</li>\n<li>Experience and understanding of risk and controls frameworks</li>\n<li>Experience and understanding of cyber threat modeling and quantification concepts including statistics and probability principles</li>\n\n</ul></div><br>\n\n<div>\n<div></div>\n<br>\n<div><strong>How you’ll grow</strong></div>\n<br>\n<div>Through your variety of experiences at Deloitte, you will have the opportunity to develop analytical, communication, and leadership skills that can help you achieve your full potential, no matter what career path you eventually choose. You will be continually challenged by your clients, your team members, and your peers. Along the way, you will have access to mentoring, counseling, and training opportunities to help foster and accelerate your development of new skills and capabilities. For new campus hires, we offer extensive onboarding and new hire training to help you hit the ground running. You’ll travel to Deloitte University for national new hire training that includes technical and soft skills training, as well as invaluable networking opportunities. Explore Deloitte University, The Leadership Center.</div>\n<br>\n<div></div>\n<br>\n<div><strong>Benefits</strong></div>\n<br>\n<div>At Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.</div> \n<br>\n<div></div>\n<br>\n<div><strong>Deloitte’s Culture</strong></div>\n<br>\n<div>Our positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture where our people excel and lead healthy, happy lives. Learn more about Life at Deloitte.</div>\n<br>\n<div></div>\n<br>\n<div><strong>Corporate Citizenship</strong></div>\n<br>\n<div>Deloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.</div>\n<br>\n<div></div>\n<br>\n<div><strong>Recruiter Tips</strong></div>\n<br>\n<div>We want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you’re applying to. We also suggest that you brush up on your interviewing skills and practice discussing your experience and job history with a family member, friend, or mentor. Check out recruiting tips from Deloitte professionals.</div><br>\n\n<div>#LI:PTY</div>\n<br>\n<div>#IND:PTY</div>\n<br>\n<div>#CB</div></div>\n</div>\n<br>\n<div>As used in this document, “Deloitte” means Deloitte LLP and its subsidiaries. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.</div><br>\n\n<div> Requisition code: E18NATSCLPMGR – 1DA</div></div>\n<br>"}