{"job title": "Principal Data Scientist, Client Experience / Research and Insights", "company": "Deloitte", "city state": "– Washington, DC", "rating": "3.8", "job description": "<ul>\n<li>*Principal Data Scientist Client Experience / Research and Insights**</li>\n</ul>\n\nWe are looking for someone who has a proven track record of leadership of data science teams who have delivered practical insights using creative methods. The team you will lead designs and deploys impactful data driven research to a global audience on a wide range of topics spanning technology to the public sector. Candidates will need to demonstrate strong creativity in identifying non-traditional data sources as well as the rigorous application of leading data science techniques.\n<br><br>\nThe Principal Data Scientist will play a key role developing analytically-driven research products aimed at changing national perspectives on major business issues. Candidates will be responsible for the end-to-end research process including driving topic selection, presenting findings internally and externally, and co-authoring public facing research publications and products. Strong candidates will be simultaneously thorough and creative in their research approaches, comfortable with public speaking, focused on developing staff, and able to both deliver and receive candid feedback.\n<br><br>\nPrior work from this team has been cited in Congressional testimony, won an international Webby at https://www.webbyawards.com/winners/2017/websites/general-website/government-civil-innovation/data-usa/ award, been featured in Tier 1 Media outlets (WSJ, USA Today, etc.), and has supported millions in sales.\n\n\n<ul>\n<li>*Duties and Responsibilities:**</li>\n</ul>\n\n+ Identifies research projects that are relevant to the public discourse, Deloitte s clients, and are technically tractable\n<br><br>\n+ Manages internal stakeholders\n<br><br>\n+ Defines technical development plans for staff and manages the team s day to day workflow\n<br><br>\n+ Conducts code and methodology reviews across a broad range of technical domains(text analytics, network analysis, econometrics, etc.). The team primary works in Python and R. Python fluency is not required but must be obtained if not present after hiring.\n<br><br>\n+ Works on a technical team which simultaneously supports research requests covering multiple industry areas\n<br><br>\n+ Balances the demands of multiple long-term projects simultaneously\n<br><br>\n+ Presents on research findings to senior leadership both within and outside of DeloitteThis position will play a key role in developing novel research into critical phenomena affecting US businesses and the US government. This position may require occasional travel (a few times a year at most) to attend offsite meetings, conferences, and/or training sessions.\n<br><br>\nCategory: Management Consulting\n<br><br>\nAbout Deloitte\n<br><br>\nAs used in this document, Deloitte means Deloitte LLP and its subsidiaries. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law."}