{"job title": "Principal Data Engineer", "company": "Demandbase", "city state": "– San Francisco, CA", "rating": "4.5", "job description": "Demandbase, a leading SaaS-based B2B marketing technology company and San Francisco Business Times #5 Best Places to Work, is looking for more inspired and driven people to join us in our downtown San Francisco office. With a roster of dedicated, blue-chip customers that's growing every single day, we're in a phase of tremendous growth and establishing the team that will take us to the next level. As a company, we're as committed to growing careers as we are to building world-class B2B marketing technology, all while enjoying an unparalleled work-life balance. If you love innovating and collaborating with highly intelligent, motivated people who are also pretty fun to hang out with, you're probably a good fit for us.\n<br><br>\nThe <strong>Principal Data Engineer</strong> will own all aspects of engineering including technical design, architecture, implementation, quality assurance, deployment, and operations. You will be responsible for scaling our machine learning pipeline, including requirements, architecture, design &amp; development. You will establish the ins and outs of building a highly available, scalable, distributed, and robust system that uses all the modern cloud computing paradigms, techniques and tools.\n<br><br>\nTo apply for the role, you should possess strong analytical, design, and problem diagnosis skills. You like thinking \"outside the box\", are not afraid of ambiguity, get excited about difficult challenges, and are a motivated self-starter. You are a strong team player and thrive in a startup environment where flexibility is essential and delivering rock solid, customer focused solutions is paramount.\n<br><br>\n<strong>What you'll be doing...</strong>\n\n<ul>\n<li>Core responsibilities will be to help scale large scale machine learning models</li>\n<li>Own and drive processing of tens of petabytes of unstructured and structured data</li>\n<li>Provide leadership to the data science and engineering teams in terms of big data processing</li>\n<li>Enable machine learning systems to become more real-time in terms of decisions but also large scale data ingestion</li>\n<li>Working with the latest open source technology on highly distributed, scalable products</li>\n</ul>\n<strong>What we're looking for...</strong>\n\n<ul>\n<li>Master's Degree in Computer Science or related field</li>\n<li>Experience working with terabyte level, real-time datasets</li>\n<li>Must have build applications in the past (at the start/mid career point)</li>\n<li>Multiple large scale distributed systems or data platforms, including Spark, Flink, Kafka, Dataflow, BigQuery, BigTable, Dataproc etc</li>\n<li>Experience with Scala and/or Java and Python</li> \n\n<li>Experience building large scale crawlers, using Nutch, Gora, MapReduce, HBase, Elasticsearch etc</li>\n<li>Strong algorithm &amp; data structure knowledge</li>\n<li>Excellent communication skills and the ability to work well in a team</li>\n<li>Knowledge of professional software engineering practices &amp; best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations</li>\n<li>Strong customer focus, ownership, urgency and drive</li>\n</ul>\n<strong>Why join us...</strong>\n\n<ul>\n<li>Be part of a rapidly-growing, pre-IPO company</li>\n<li>Opportunity to extend our ABM leadership position and fast-track innovation behind AI-powered Account-Based Marketing solutions</li>\n<li>Drive the next generation of intelligent CRM technologies and invent how Artificial Intelligence, product design, and applications converge</li>\n<li>Work with a world class team of engineers, PMs, data scientists, sales and marketers</li>\n<li>Have the flexibility of a start up with the security of a sizable, well-funded organization (we recently closed a $65M round of funding)</li>\n</ul>\n<strong>About Demandbase...</strong>\n<br><br>\nThe Demandbase ABM Platform is the only comprehensive set of ABM solutions, Artificial Intelligence and patented technology purpose built for the account-based needs of B2B. This allows B2B companies to execute their marketing and sales efforts across the funnel to identify, attract, engage, and convert their target accounts and then measure the results. You can scale and grow your efforts with the leading ABM vendor instead of trying to patch everything together with multiple point solutions. The Demandbase ABM Platform allows customers to define their ABM strategies and initiatives and then take action from a single platform. It leverages unique B2B data sets, Artificial Intelligence and IP targeting technology, Real-Time Intent as well as ingesting our customers' first party and CRM data in order to provide insights and initiate account activities. Enterprise leaders and high-growth companies such as Accenture, Adobe, DocuSign, GE, Grainger, Salesforce and others use Demandbase to drive their ABM strategy and maximize their marketing performance. Demandbase was named a Best Place to Work by SF Business times in 2015, 2016, and 2017 and Glassdoor's Top 10 Best Places to Work in 2016. For more information, please visit https://www.demandbase.com or follow the company on Twitter @Demandbase.\n<br><br>\n<strong>Benefits...</strong>\n<br><br>\nOur benefits include 100% paid for Medical, Dental and Vision for you and your entire family, short-term/long-term disability, life insurance, flexible vacation policy, 401k, commuter benefits, free snacks, catered lunch every Friday, Pinot Noir Fridays, chair massages, weekly yoga and much more!"}