{"job title": "Computer Scientist", "company": "Department of the Air Force", "city state": "– Baltimore, MD", "rating": "4.2", "job description": "<div>\n\n\n<ul>\n\n \n<li>\n<br>\n Duties<br>\n\n <div>\nHelp\n<br>\n Help\n<br>\n<br>\n Duties\n<br>\n Summary\n<br>\n <div>The mission of the United States Air Force is to fly, fight and win...in air, space and cyberspace. To achieve that mission, the Air Force has a vision of Global Vigilance, Reach and Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do.\n<br><br>\n<strong>Direct Hiring Authority for Cyber Workforce Positions:</strong>\n<br><br>\nThese positions are being filled under Direct-Hire Authority for Cyber Workforce Positions. The Secretary of the Air Force has delegated authority by the Office of the Secretary of Defense to directly appoint qualified individuals directly into cyber workforce positions up to the GS-15 level (or equivalent) that are necessary to carry out the responsibilities of U.S. Cyber Command. These positions are located Air Force-Wide.\n<br><br>\n<strong>Selections made under this announcement may be non-competitively converted to CYBER excepted service.</strong>\n<br><br>\n<strong>For DHA Positions:</strong>\n<br><br>\nThis is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK). There may or may not be actual/projected vacancies at the time you submit your application.\n<br><br>\n<strong>This Public Notice is to gather applications which may or may not result in a referral or selection.</strong>\n<br><br>\n<strong>This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK).</strong>\n<br><br>\n<strong>Please read this Public Notice in its entirety prior to submitting your application for consideration.</strong><br><br>Learn more about this agency</div>\n\n<br>Responsibilities\n<br>\n <div>\n\n\n<ul>\n\n\t<li>Serve as a computer scientist and technical consultant for work involving both application and development of mathematical, statistical and computer-simulated models and applications Applies mathematical and software engineering principles and disciples to the building of software systems.</li>\n<li>Perform various duties concerned with the application of, or research into, computer science methods and techniques to store, manipulate, transform or present information. This work requires professional competence in the application of the theoretical foundations of computer science, including computer system architecture, system software organization and the modeling of the representation and transformation of information structure. You must also possess specialized knowledge of the design characteristics, limitations, and potential applications of information systems, and of broad areas of applications of computing which have common structures, processes, and techniques.</li>\n<li>Performs significant software engineering program management duties related to the System Engineering Process (SEP) which supports complex, often highly specialized, state-of-the-art software systems. Attends meetings, conferences, briefing, and seminars related to project planning, advanced technologies, and supporting system concepts. Accomplishes professional development and maintains technical proficiency through interaction with technical and professional societies, associations, academia, symposia, contractors, and research &amp; development (R&amp;D) organizations, by reading/reviewing technical journals and current literature, and participation in formal training programs.</li>\n</ul>\n\n<strong>Additional Information:</strong>\n<br>\nThis announcement may be used to fill one or more vacancies.\n<br>\nDuties and responsibilities vary and may increase according to grade level.\n<br>\nThis public notice may be used to fill target grades (e.g. GS-05 Target GS-15)</div><br>\n\n<div>\nTravel Required<br><br>Occasional travel - You may be expected to travel for this position.</div><br>\n\n <div>\n<div>\nSupervisory status<br><br>No</div><br>\n\n <div>\nPromotion Potential<br><br>15</div>\n </div>\n </div>\n</li>\n\n<li>\n <div>\nJob family (Series)<br><br>1550 Computer Science<br>\n<div>\nSimilar jobs\n\n\n<ul>\n\n \n<li>\n<br>\n Computer And Information Research Scientists</li>\n\n<br>\n<li>\n<br>\n Computer Research Scientists</li>\n\n<br>\n<li>\n<br>\n Information Research Scientists</li>\n\n<br>\n<li>\n<br>\n Scientists, Computer Research</li>\n\n<br>\n<li>\n<br>\n Scientists, Information Research</li>\n\n</ul>\n\n </div>\n</div>\n</li>\n\n<li>\n<br>\n Requirements<br>\n\n <div>\nHelp\n<br>\n Help\n<br>\n<br>\n Requirements\n<br>\n Conditions of Employment\n\n\n<ul>\n\n <li>U.S. Citizenship is required</li>\n<li>Males must be registered for Selective Service, see www.sss.gov</li>\n<li>Total salary varies depending on location of position</li>\n<li>PCS expenses if authorized will be paid IAW JTR and Air Force Regulations</li>\n<li>Recruitment incentives may be authorized</li>\n<li>This posn is subject to provisions of the DoD Priority Placement Program</li>\n<li>Disclosure of Political Appointments</li>\n<li>Position may be subject to random drug testing</li>\n<li>Position may require an appropriate security clearance</li>\n<li>Employee may be required to work other than normal duty hours, to include evenings, weekends and/or holidays</li>\n<li>Shift work and emergency overtime may be required</li>\n<li>Employee must maintain current certifications</li>\n<li>Per National Defense Authorization Act (NDAA) of fiscal year (FY) 2017. Section 1111 modifies 5 United States Code (U.S.C.) 3326; Veterans who are retiring within 180 days of appointment effective date may require a 180 day waiver package.</li>\n</ul>\n\n<br>\n<div>\nQualifications<br>\n\n <div>\n<strong>BASIC REQUIREMENTS:</strong>\n<br>\nBachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions. Meeting the basic requirements qualifies for GS-05 position.\n<br><br>\n<strong>SPECIALIZED EXPERIENCE:</strong>\n<br>\n<strong>FOR GS-07:</strong> One year of specialized experience equivalent to the GS-05 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation.\n<br><br>\n<strong>FOR GS-09:</strong> One year of specialized experience equivalent to the GS-07 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems.\n<br><br>\n<strong>FOR GS-11:</strong> One year of specialized experience equivalent to the GS-09 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience include professional knowledge and abilities applicable to a broad range of computer software development duties; modify standard practices and adapt equipment or techniques to solve a variety of unique and novel problems.\n<br><br>\n<strong>FOR GS-12:</strong> One year of specialized experience equivalent to the GS-11 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation. Serve as assistants to higher grade level scientists responsible for subject-matter or program areas.\n<br><br>\n<strong>FOR GS-13</strong>: One year of specialized experience equivalent to the GS-12 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation. Serving as staff specialist for a significant segment of a subject-matter or program area. Providing technical guidance in planning, coordinating, and evaluating proposed research projects and programs of interest to the agency.\n<br><br>\n<strong>FOR GS-14:</strong> One year of specialized experience equivalent to the GS-13 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation, and developing and applying system evaluation methods and techniques to major portions of large projects of studies. Serves as staff specialist responsible for providing technical leadership and guidance in a major subject-matter, functional, or program area.\n<br><br>\n<strong>FOR GS-15:</strong> One year of specialized experience equivalent to the GS-14 level in the Federal service or equivalent in other pay systems that equipped me with the particular knowledge, skills and abilities (KSAs) to perform successfully the duties of this position, and that is in or related to the position to be filled. An example of this experience includes developing software systems, high-speed computing systems; real time data acquisitions systems, simulation modeling, data analysis and complex electronic instrumentation systems for testing weapon system installation, and developing and applying system evaluation methods and techniques to major portions of large projects of studies. Serves as staff experts and consultants.\n<br><br>\n<strong>OR</strong>\n<br><br>\nClick on the following link to view qualification requirements for this position:\n<br>\nhttp://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=GS-PROF\n<br><br>\n<strong>AND</strong>\n<br><br>\nClick on the following link to view occupational requirements for this position:\n<br>\nhttp://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/computer-science-series-1550/\n<br><br>\n<strong>KNOWLEDGE, SKILLS AND ABILITIES (KSAs):</strong> Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n\n\n<ul>\n<li>Knowledge of computer science concepts and principles of standard computer science practices, methods, and techniques to perform, following specific instructions, routine projects or minor phases of a larger or more complex project.</li>\n<li>Knowledge of computer design, simulation or programming software or other appropriate software to perform routine design and analysis assignments.</li>\n<li>Knowledge of computer science and related disciplines to design, develop and adapt scientific methods and techniques to recommend solutions for computer problems.</li>\n<li>Ability to analyze, interpret and apply computer science procedures in a variety of situations and recommend effective solutions.</li>\n</ul>\n\n<strong>PART-TIME OR UNPAID EXPERIENCE:</strong> Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.\n<br><br>\n<strong>VOLUNTEER WORK EXPERIENCE:</strong> Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.</div>\n </div><br>\n\n<div>\nEducation<br><br><strong>IF USING EDUCATION TO QUALIFY:</strong> You <strong>MUST</strong> provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education.\n<br><br>\n<strong>FOREIGN EDUCATION:</strong> Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.</div><br>\n\n<div>\nAdditional information\n<br>\n <div><strong>Interagency Career Transition Assistance Program (</strong><strong>ICTAP</strong><strong>):</strong> For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.\n<br><br>\n<strong>Employed Annuitants (</strong><strong>Reemployed</strong><strong> Annuitants):</strong> Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.\n<br><br>\n<strong>Temporary and Term Appointments:</strong> If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. Additionally, if you are serving on a term appointment in the competitive service, you may be converted to a career or career-conditional appointment without further competition. NOTE: Current federal civilian employees may apply for this position and if selected, a break in service of at least 3 days may be required prior to appointment to this position.\n<br><br>\n<strong>Selective Service:</strong> Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here.\n<br><br>\n<strong>Direct Deposit:</strong> All federal employees are required to have direct deposit.\n<br><br>\nIf you have questions regarding this announcement and have hearing or speech difficulties click here.</div>\n<br>\n Read more</div><br>\n\n<div>\nHow You Will Be Evaluated\n<br>\n <div>You will be evaluated for this job based on how well you meet the qualifications above.\n<br><br>\n<strong>Your latest resume will be used to determine your qualifications.</strong>\n<br><br>\nYour application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment.\n<br><br>\nYour responses to the questionnaire may be compared to the documents you submit. The documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job.\n<br><br>\nApplicants who disqualify themselves will not be evaluated further.\n<br><br>\nTo apply for this position, you must provide a complete Application Package which includes:\n\n\n<ul>\n<li>Your Resume (your latest resume will be used to determine your qualifications)</li>\n\n</ul>\n\n\n\n<ul>\n\n\t<li>If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application.</li>\n<li>If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy.</li>\n<li>For qualification determinations your resume must contain hours worked per week and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position.</li></ul>\n\n\n<ul>\n<li>A complete Application Questionnaire</li>\n<li>Additional Required Documents (see Required Documents section below). Ensure all submitted documents contain your full name, address, phone number, and last four digits of your social security number.</li></ul></div></div></div></li>\n\n</ul>\n\nRead more<br>\n\n <div>\nBackground checks and security clearance\n<br>\n <div>\n<div>\nSecurity clearance<br><br>Secret</div>\n </div>\n </div>\n </div>\n \n\n\n<li>\n<br>\n Required Documents<br>\n\n <div>\nHelp\n<br>\n Help\n<br>\n<br>\n Required Documents\n<br>\n <div><strong>The following documents are required and must be provided with your application for this Public Notice:</strong>\n\n<ul>\n\n\t<li>Online Application - Questionnaire</li>\n<li>Resume - must include beginning and ending month and year for each employment period</li>\n<li>Transcripts - if qualifying based on education or positive education series</li>\n<li>Registration/License - active, current registration/license if applicable for the position</li>\n<li>Veterans' Preference - a copy of your DD Form 214 which must include character of service or a Statement of Service/Proof of Service which must include service dates and character of service. In addition, if claiming 10-point preference you must submit a VA Letter or a disability determination from a branch of the Armed Forces (or documentation of Purple Heart, if applicable) and a SF 15 (Application for 10-point veteran preference).</li>\n</ul>\n\n<strong>ACTIVE DUTY SERVICE MEMBERS:</strong> The VOW Act Chapter 21 of Title 5, United States Code (U.S.C.), Section 2108a, requires Federal agencies treat active duty service member as veterans, disabled veterans, and preference eligible, when they submit, at the time they apply for a Federal job, a \"certification\" of active service in lieu of a DD-214, assuming the service member is otherwise eligible. A \"certification\" letter should be on letterhea</div></div></li>"}