{"job title": "SCIENTIST", "company": "Department of the Navy", "city state": "– Indian Head, Maryland Indian Head, Maryland", "rating": "4.0", "job description": "<div>\n <ul>\n <li>\n \n Videos\n \n </li>\n </ul>\n </div>\n <div>\n <ul>\n <li>\n \n Duties\n \n <div>\n \n Help\n Help\n \n Duties\n Summary\n <div>\n <p>You will serve as a SCIENTIST in the HIGH ENERGY MATERIALS BRANCH, RESEARCH AND TECHNOLOGY DIVISION, RDT&amp;E DEPARTMENT of NAVSURFWARCEN IHEODTECHDIV.</p>\n \n Learn more about this agency\n \n </div>\n Responsibilities\n <div>\n <ul>\n <li>You will conceive, initiate and develop programs for the synthesis and application of new materials across multiple DoD/Navy areas of interest.</li>\n <li>You will consults, instructs and develops procedures for safe execution of experiments involving explosives.</li>\n <li>You will make recommendations for staffing and other resource management decisions based on technical direction and workload.</li>\n <li>You will mentor branch scientists and engineers in synthesis chemistry and other disciplines.</li>\n <li>You will lead semi-annual in person meetings with current and potentially new program sponsors to discuss current and future work.</li>\n </ul>\n </div>\n\n <div>\n Travel Required\n <p>Occasional travel - You may be expected to travel for this position.</p>\n </div>\n <div>\n <div>\n \n \n Supervisory status\n \n \n <p>\n No\n </p> </div>\n <div>\n \n \n Promotion Potential\n \n <p>\n None\n </p> </div>\n </div>\n </div>\n </li>\n <li>\n <div>\n Job family (Series)\n <p>\n \n 1320 Chemistry\n \n </p>\n </div>\n </li>\n <li>\n \n Requirements\n \n <div>\n \n Help\n Help\n \n Requirements\n Conditions of Employment\n <ul>\n <li>Must be a US Citizen.</li>\n <li>Must be determined suitable for federal employment.</li>\n <li>Must participate in the direct deposit pay program.</li>\n <li>New employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.</li>\n <li>Generally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade. Time-in-grade requirements must be met by the closing date of this announcement.</li>\n <li>You will be required to successfully complete a pre-appointment physical examination.</li>\n <li>You will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.</li>\n <li>Successful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or pass the test. You will be subject to random testing.</li>\n <li>This position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.</li>\n </ul>\n <div>\n Qualifications\n\n <div>\n In addition to the Basic Requirements for this position, your resume must also demonstrate at least one year of specialized experience at or equivalent to the ND-04 (GS-12/13) grade level or pay band in the Federal service or equivalent experience in the private or public sector; as a professional scientist representing an organization's role within the technical community through publications or communications of energetics or explosives testing, research and development.<br>\n<br>\nAdditional qualification information can be found from the following Office of Personnel Management website:<br>\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=GS-PROF.<br>\n<br>\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1300/chemistry-series-1320/<br>\n<br>\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.\n </div>\n </div>\n\n <div>\n Education\n <p>\n Applicants must meet the following positive education qualifications requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual: Applicants must possess Degree: physical sciences, life sciences, or engineering that included 30 semester hours in chemistry, supplemented by course work in mathematics through differential and integral calculus, and at least 6 semester hours of physics.<br>\n<br>\nOR<br>\n<br>\nCombination of education and experience -- course work equivalent to a major as shown in A above, including at least 30 semester hours in chemistry, supplemented by mathematics through differential and integral calculus, and at least 6 semester hours of physics, plus appropriate experience or additional education.<br>\n </p>\n </div>\n\n\n <div>\n Additional information\n <div>\n <p>This position is covered by the Department of Defense Priority Placement Program.<br>\n<br>\nAdditional vacancies may be filled by this announcement.<br>\n<br>\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.<br>\n<br>\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.<br>\n<br>\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf<br>\n<br>\nRecruitment incentives may be authorized to eligible new hires.<br>\n<br>\nA relocation incentive is generally a single payment intended to offset some of the relocation costs experienced by the selectee. A relocation incentive may be authorized.<br>\n<br>\nThis position is eligible for part time, full time or ad-hoc telework at the discretion of management.<br></p>\n </div>Read more\n \n </div>\n\n <div>\n How You Will Be Evaluated\n <div>\n <p>You will be evaluated for this job based on how well you meet the qualifications above.</p>\n <p>\n In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience.<br>\n<br>\nWhen the application process is complete, we will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this announcement. You will be rated based on the information provided in your resume and responses to the Occupational Questionnaire, along with your supporting documentation to determine your ability to demonstrate the following competencies:<br>\n<br>\n</p><ul><li>CHEMICAL PRINCIPLES, THEORIES, AND PRACTICES</li><li>MANAGING HUMAN RESOURCES</li><li>ORAL COMMUNICATION</li><li>PROJECT MANAGEMENT</li></ul><br>\n<br>\nYou should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation.<br>\n<br>\nIf after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, your score may be adjusted to more accurately reflect your abilities or you may be found ineligible/not qualified.<br>\n<br>\nPlease follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment.<br>\n<br>\nAll eligibility, qualifications, and time-in-grade requirements must be met by the closing date of this announcement.<br>\n <p></p>\n <p></p>\n </div>Read more\n\n <div>\n Background checks and security clearance\n <div>\n <div>\n Security clearance\n <p>\n \n Secret\n \n </p>\n </div>\n\n <div>\n Drug test required\n <p>\n Yes\n </p>\n </div>\n </div>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Required Documents\n \n <div>\n \n Help\n Help\n \n Required Documents\n <div>\n <p>\n A COMPLETE RESUME IS REQUIRED. Your resume must show relevant experience (cover letter optional) where you worked, job title, duties and accomplishments, employer's name and address, supervisor's name and phone number, starting and end dates (Mo/Yr), hours per week &amp; salary. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade level i.e. GS-0201-09. Note: Only the last resume received will be reviewed.<br>\n<br>\nYOU ARE REQUIRED TO DOCUMENT IN YOUR APPLICATION PACKAGE EVIDENCE THAT SUPPORTS YOUR ELIGIBILITY AND QUALIFICATION CLAIMS. You are strongly encouraged to upload the applicable documents with your application package. These documents will assist the staffing specialist in determining your eligibility and qualifications, but are not required at the time of application. If you do not upload the suggested documents, then you must document in your resume the information needed to determine your eligibility. If you are selected, these documents will be requested at the time of tentative job offer to verify eligibility and qualifications. You will have 2 business days to submit these documents before a job offer is rescinded.<br>\n<br>\nDOES THIS POSITION REQUIRE A LICENSE OR CERTIFICATE? You are strongly encouraged to provide a copy of your license or certificate in your application package. It is also acceptable to document your license number and the name of the licensing authority in your resume.<br>\n<br>\nARE YOU QUALIFYING BASED ON EDUCATION or A COMBINATION OF EDUCATION AND EXPERIENCE? You must provide sufficient documentation of your education in your resume. You are strongly encouraged to provide a copy of transcripts or degrees in your application package. It is also acceptable to document your applicable course listing in your resume (course number, credits earned, etc...). Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education. Applicants can verify accreditation at the following website: http://www.ed.gov/admins/finaid/accred/index.html. All education claimed by applicants will be verified by the appointing agency accordingly. If selected, an official/sealed transcript will be required prior to appointment.<br>\n<br>\nARE YOU AN ACTIVE DUTY SERVICE MEMBER? Active Duty Service Members are required to submit a statement of service printed on command letterhead and signed by the command. The statement of service must provide the branch of service, rate/rank, all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.).<br>\n<br>\nDocuments submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents contain personal information such as SSN and DOB and some documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove said personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.\n </p>\n <div>\n \n If you are relying on your education to meet qualification requirements:\n \n <p>\n Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from\n schools accredited by accrediting institutions recognized by the U.S. Department of Education.\n </p>\n <p>\n Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n </p>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Benefits\n \n <div>\n \n Help\n Help\n \n Benefits\n <div>\n <p>\n A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Learn more about federal benefits.\n </p>\n <p></p>\n <p>\n Review our benefits\n </p>\n <div>\n <p>Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered.</p>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n How to Apply\n \n <div>\n \n Help\n Help\n \n How to Apply\n <div>\n <p>Click the Apply Online button to create an account or log in to your existing USAJOBS account.<br>\n<br>\nTo apply for this position, you must provide a complete Application Package which includes:<br>\n1. Complete resume with relevant experience where you worked, job title, duties and accomplishments, employer's name and address, supervisor's name and phone number, starting and end dates (Mo/Yr), hours per week and salary. If you are a current or previous federal employee, provide your pay plan, series and grade level (e.g. GS-0201-09).<br>\n2. Complete assessment questionnaire. For a quick preview of the assessment questionnaire click here: https://apply.usastaffing.gov/ViewQuestionnaire/10349585<br>\n3. Supporting documentation<br>\n<br>\nFailure to submit a complete application package will result in an ineligible rating and loss of consideration.<br>\n<br>\nYour complete application (resume, assessment questionnaire, and all supporting documents) must be received by 11:59 pm Eastern Standard Time (EST) on 11/23/2018. Applications received after 11/23/2018 may result in an ineligible rating and loss of consideration. If more than one resume is received, only the last resume received and processed will be reviewed.<br>\n<br>\nNOTE: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account: https://mydon.usajobs.gov/Account/Login select Application Status, and click on the more information link under the application status for this position. Your uploaded documents may take several hours to clear the virus scan process so please plan appropriately.<br>\n<br>\nYou are encouraged to apply online. Applying online will allow you to review and track the status of your application.<br>\n<br>\nDo not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement.<br>\n<br>\nIt is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant.</p>\n </div>Read more\n \n <div>\n Agency contact information\n \n Department of Navy EIC\n\n Department of Navy EIC\n \n\n <div>\n <div>\n Phone\n <p>\n (800) 378-4559\n </p>\n\n\n Email\n <p>\n \n DONEIC@navy.mil\n \n </p>\n </div>\n <div>\n Address\n <p>\n </p>\n NAVSURFWARCEN IHEODTECHDIV<br>\n 4247 S Patterson Rd<br>\nSuite 116 <br>\n Indian Head,\n MD \n 20640-5150<br>\n US\n \n </div>\n </div>\n \n Learn more about this agency\n \n </div>\n\n Next steps\n <div>\n <p>\n When the application process is complete, your application will be reviewed to determine if you meet the hiring eligibility and qualification requirements for which you requested consideration. You will be rated based on the information provided in your resume and responses to the questionnaire, along with your supporting documentation to determine your level of knowledge, skill, and ability related to the job requirements.<br>\n<br>\nBest qualified applicants will be referred to the hiring manager. The hiring manager may choose to conduct interviews. Once the selection is made, you will receive a notification of the decision.\n </p>\n </div>Read more\n </div>\n </li>\n <li>\n \n Fair &amp; Transparent\n \n <div>\n Fair &amp; Transparent\n <p>\n The Federal hiring process is setup to be fair and transparent. Please read the following guidance.\n </p>\n Equal Employment Opportunity Policy\n <div>\n <p>\n The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.\n </p>\n <ul>\n <li>\n \n Equal Employment Opportunity (EEO) for federal employees &amp; job applicants\n \n </li>\n </ul>\n </div>Read more\n Reasonable Accommodation Policy\n <div>\n <p>\n Federal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application process should follow the instructions in the job opportunity announcement. For any part of the remaining hiring process, applicants should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.\n </p>\n <p>\n A reasonable accommodation is any change to a job, the work environment, or the way things are usually done that enables an individual with a disability to apply for a job, perform job duties or receive equal access to job benefits.\n </p>\n <p>\n Under the Rehabilitation Act of 1973, federal agencies must provide reasonable accommodations when:\n\n </p><ul>\n <li>An applicant with a disability needs an accommodation to have an equal opportunity to apply for a job.</li>\n <li>An employee with a disability needs an accommodation to perform the essential job duties or to gain access to the workplace.</li>\n <li>An employee with a disability needs an accommodation to receive equal access to benefits, such as details, training, and office-sponsored events.</li>\n </ul>\n <p></p>\n <p></p>\n <p>\n You can request a reasonable accommodation at any time during the application or hiring process or while on the job. Requests are considered on a case-by-case basis.\n </p>\n <p>\n Learn more about disability employment and reasonable accommodations or how to contact an agency.\n </p>\n\n\n </div>Read more\n\n Legal and regulatory guidance\n <ul>\n <li>\n Financial suitability\n </li>\n <li>\n \n Social security number request\n \n </li>\n <li>\n \n Privacy Act\n \n </li>\n <li>\n \n Signature and false statements\n \n </li>\n <li>\n \n Selective Service\n \n </li>\n <li>\n \n New employee probationary period\n \n </li>\n </ul>\n </div>\n </li>\n </ul>\n </div>\n\n\n <p>\n This job originated on www.usajobs.gov. For the full announcement and to apply,\n visit www.usajobs.gov/GetJob/ViewDetails/516967800.\n Only resumes submitted according to the instructions on the job announcement listed at www.usajobs.gov will be considered.\n </p>"}