{"job title": "COMPUTER SCIENTIST", "company": "Department of the Navy", "city state": "– Washington, DC (US)", "rating": "4.0", "job description": "<div><div><div>id=\"main-content\" role=\"main\" aria-label=\"Main Job announcement content\"&gt;\n <div>\n <ul>\n <li>\n \n Videos\n \n </li>\n </ul>\n </div>\n <div>\n <ul>\n <li>\n \n Duties\n \n <div>\n \n Help\n \n Duties\n Summary\n <div>\n <p>You will serve as a Computer Sciencetist in the DEPARTMENT OF THE NAVY.<br>\n<br>\n<strong>THIS IS AN EXPEDITED HIRING AUTHORITY ANNOUNCEMENT. </strong>The Duncan Hunter National Defense Authorization Act (NDAA) FY 2009 provides that the Secretary of Defense can designate acquisition positions as shortage positions and recruit and appoint highly qualified persons to these positions.</p>\n \n Learn more about this agency\n \n </div>\n Responsibilities\n <div>\n <ul>\n <li>Duties and responsibilities vary and increase according to grade level.</li>\n </ul>\n </div>\n\n <div>\n Travel Required\n <p>Occasional travel - You may be expected to travel for this position.</p>\n </div>\n <div>\n <div>\n \n \n Supervisory status\n \n \n <p>\n No\n </p> </div>\n <div>\n \n \n Promotion Potential\n \n  <p>\n None\n </p> </div>\n </div>\n </div>\n </li>\n <li>\n <div>\n Job family (Series)\n <p>\n \n 1550 Computer Science\n \n </p>\n <div>\n Similar jobs\n <ul>\n <li>\n \n Computer And Information Research Scientists\n \n </li>\n <li>\n \n Computer Applications Engineers\n \n </li>\n <li>\n \n Computer Research Scientists\n \n </li>\n <li>\n \n Engineers, Computer Applications \n \n </li>\n <li>\n \n Engineers, Software Applications \n \n </li>\n <li>\n \n Engineers, Software Systems \n \n </li>\n </ul>\n </div>\n </div>\n </li>\n <li>\n \n Requirements\n \n <div>\n \n Help\n \n Requirements\n Conditions of Employment\n <ul>\n <li>Must be a US Citizen.</li>\n <li>Must be determined suitable for federal employment.</li>\n <li>Must participate in the direct deposit pay program.</li>\n <li>New employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.</li>\n <li>Within the Department of Defense (DoD), the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.</li>\n <li>You may be required to successfully complete a pre-appointment physical examination.</li>\n <li>You may be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.</li>\n <li>This position is covered under the Defense Acquisition Workforce Improvement Act (DAWIA) and requires additional education, training and experience. Positions may be in any DAWIA Career Field at Level I, II, or III.</li>\n <li>This position may be designated Critical Acquisition Position (CAP). You must be a member of the Acquisition Corps, become a member, or obtain a waiver at the time of selection and sign a three-year tenure agreement prior to assuming the position.</li>\n <li>Successful completion of a pre-employment drug test (including marijuana) may be required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or pass the test. You will be subject to random testing.</li>\n <li>You may be required to complete ethics orientation within three months of appointment and submit a Confidential Financial Disclosure Report, OGE-450, within 30 days of appointment.</li>\n <li>Supervisors in the executive branch have a heightened personal responsibility for advancing government ethics. Those selected for a supervisory position will be required to review the 14 General Principles of Ethical Conduct at 5 CFR 2635.101.</li>\n <li>Position selected for may be under a bargaining unit.</li>\n <li>Warrant authority above the small purchase threshold may be required.</li>\n </ul>\n <div>\n Qualifications\n\n <div>\n <strong>In addition to the basic education requirements, applicants must meet the following minimum qualifications:</strong><br>\n<br>\nFOR THE GS-05 (or equivalent pay band): Your resume must demonstrate that you have successfully completed the basic education requirement<br>\n<br>\nFOR THE GS-07 (or equivalent pay band): Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-05 grade level or pay band in the Federal service or equivalent experience in the private or public sector as a Professional Engineer demonstrating knowledge of computer science, application of computer science methods and techniques to store, manipulate, transform or present information by means of computer systems, and knowledge of design characteristics, limitations, and potential applications. Specialized experience includes utilizing basic techniques, procedures, and methods to accomplish developmental computer scientist assignments.<br>\n<br>\nFOR THE GS-09 (or equivalent pay band): Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-07 grade level or pay band in the Federal service or equivalent experience in the private or public sector as a Professional Scientist demonstrating knowledge of computer science, application of computer science methods and techniques to store, manipulate, transform or present information by means of computer systems, and knowledge of design characteristics, limitations, and potential applications. Specialized experience must demonstrate the following: researching, interpreting, and carrying out computer scientist assignments.<br>\n<br>\nFOR THE GS-11 (or equivalent pay band): Your resume must demonstrate that you have have at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector as a Professional Scientist demonstrating knowledge of computer science, application of computer science methods and techniques to store, manipulate, transform or present information by means of computer systems, and knowledge of design characteristics, limitations, and potential applications. Specialized experience must demonstrate the following: 1) researching, interpreting, and carrying out computer scientist assignments; AND 2) providing technical input on the development of software or computing systems.<br>\n<br>\nFor the GS-12 (or equivalent pay band): Your resume must demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector as a Professional Scientist performing the following duties: 1) researching, interpreting, and carrying out computer scientist assignments; 2) providing technical input on the development of software or computing systems; AND 3) collecting and analyzing system architecture and software data to solve problems, develop reports, and provide recommendations.<br>\n<br>\nFOR THE GS-13 (or equivalent pay band): Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-12 grade level or pay band in the Federal service or equivalent experience in the private or public sector as a Professional Scientist performing the following duties: 1) researching, interpreting, and carrying out computer scientist assignments; 2) developing software systems or high-speed computing systems utilizing algorithms and system architecture types; AND 3) collecting and analyzing system architecture and software data to solve problems, develop reports, and provide recommendations.<br>\n<br>\nFOR THE GS-14 (or equivalent pay band): Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-13 grade level or pay band in the Federal service or equivalent experience in the private or public sector as a Professional Scientist demonstrating a substantive knowledge of computer science. This experience typically include duties such as: managing a operating systems environment, designing new or standard industry modeling software and engineering applications/models researching various data sources, applying systems engineering and operations research techniques to develop/design computer system architecture or system software model systems.<br>\n<br>\nFOR THE GS-15 (or equivalent pay band): Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-14 grade level or pay band in the Federal service or equivalent experience in the private or public sector as a Professional Scientist advising on the following matters: managing a operating systems environment, designing new or standard industry modeling software and engineering applications/models researching various data sources, applying systems engineering and operations research techniques to develop/design computer system architecture or system software model systems.<br>\n<br>\nAdditional qualification information can be found from the following Office of Personnel Management website:<br>\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=GS-PROF<br>\n<br>\nIndividual Occupational Requirements link:<br>\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/computer-science-series-1550/\n </div>\n </div>\n\n <div>\n Education\n <p>\n <strong>Applicants must meet the following basic education requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual:</strong><br>\n<br>\nSuccessful completion of a bachelor's or higher degree in operations research.<br>\n-OR-<br>\nSuccessful completion of a bachelor's or higher degree with at least 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must be a combination of statistics and mathematics that include differential and integral calculus.<br>\n<br>\n<strong>Applicants may substitute education for experience in the following situations:</strong><br>\n<br>\nFOR THE GS-07 (or equivalent pay band): Your resume must demonstrate that you have successfully completed one full year of graduate level education OR you have successfully completed a bachelor's degree with superior academic achievement<br>\n<br>\nFOR THE GS-09 (or equivalent pay band): Your resume must demonstrate that you have successfully completed a master's or equivalent graduate degree OR have successfully completed two full years of progressively higher graduate level education leading to a master's degree<br>\n<br>\nFOR THE GS-11 (or equivalent pay band): Your resume must demonstrate that you have have successfully completed a Ph.D. or equivalent doctoral degree OR you have successfully completed three full years of progressively higher level graduate education leading to a Ph.D. or equivalent degree<br>\n<br>\n<strong>NOTE: Education and experience may be combined for all grade levels for which both education and experience are acceptable.</strong><br>\n </p>\n </div>\n\n\n <div>\n Additional information\n <div>\n <p>This position is covered by the Department of Defense Priority Placement Program.<br>\n<br>\n<strong>Referral Lists may be issued on an as needed basis as vacancies occur. Multiple vacancies may be filled by this announcement.</strong><br>\n<br>\nA tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments.<br>\n<br>\nIf you are unable to apply online and request information about the Alternate Application process, please contact the Department of Navy's Employment Information Center.<br>\n<br>\nFederal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf<br>\n<br>\n<strong>In addition to meeting all minimum qualification and eligibility requirements, ICTAP applicants must be well qualified for the position to receive consideration for special priority selection. A well-qualified ICTAP applicant is one who possesses the competencies and experience to perform the duties of the position successfully with orientation to learn/understand the activities, procedures, policies and processes. Demonstrated work experience in the occupation is typically qualifying for placement. This criterion cannot be met by education and training.</strong><br>\nFor more information about ICTAP eligibility please review the following link: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/federal-employees/ictap/<br>\n<br>\n<strong>This public notice announcement is for anticipated vacancies to be filled under the Expedited Hiring Authority (EHA) for acquisition positions located at Department of Navy installations identified in this public notice. Positions may be filled as permanent, term or temporary with a full-time or part-time work schedule. Pay will vary by geographic location. Pay will vary by geographic location. There may or may not be actual/projected vacancies at the time you submit your application. Please read this Public Notice in its entirety prior to submitting your application for consideration.</strong><br>\n<br>\n<strong>There may or may not be actual vacancies filled from this register. As such, Notices of Results (NORs) may or may not be sent to applicants who apply to this announcement.</strong><br>\n<br>\nApplicants rated ineligible on this vacancy announcement need to reapply and update their application package to be considered on future vacancies filled through this announcement.<br>\n<br>\nApplicants selected and hired on this vacancy announcement need to reapply to be considered on future vacancies filled through this announcement.<br>\n<br>\n<strong>Overseas Info. for Guam and Hawaii locations:</strong><br>\nTo learn more about the living and working condition at an overseas military installation go to: http://www.militaryinstallations.dod.mil/pls/psgprod/f?p=MI:ENTRY:0<br>\nFor applicants located outside of the overseas commuting area, a service agreement may be negotiated in accordance with the Joint Travel Regulation and applicable Department of the Navy policies.<br>\nOverseas tour of duty will vary depending on location.<br>\nA Cost-of-Living-Allowance (COLA) will be added to the stated salary. COLA is subject to change at any time.<br>\nFor more info. go to: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/Overseas_Recruitment_information_NonForeign.pdf</p>\n </div>\n Read more\n </div>\n\n <div>\n How You Will Be Evaluated\n <div>\n <p>You will be evaluated for this job based on how well you meet the qualifications above.</p>\n <p>\n In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience.<br>\n<br>\nWhen the application process is complete, we will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this announcement. <strong>You will be rated based on the information provided in your resume and responses to the Occupational Questionnaire, along with your supporting documentation to determine your ability to demonstrate that you meet qualifications of the position.</strong><br>\n<br>\n<br>\n<br>\n<br>\n<br>\nIf selected, you may be required to provide supporting documentation.<br>\n<br>\nIf after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, your score may be adjusted to more accurately reflect your abilities or you may be found ineligible/not qualified.<br>\n<br>\nPlease follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment.<br>\n<br>\nAll qualifications requirements must be met by the closing date of this announcement.<br>\n<br>\n<strong>Positions may require a Financial Management Level I, II, or III certification per the National Defense Authorization Act (NDAA) 2012, Section 1599d. The certification level must be achieved within prescribed timelines. Certification requirements are outlined in the DoD Instruction 1300.26.<br>\n<br>\nVacancies filled from this announcement may be filled at any grade level listed and in equivalent pay systems (e.g., NH, NJ, NK, etc.). Selectees may be appointed to a position with promotion potential (e.g. selected at the GS-5 grade with potential to the GS-11). If selected below the full performance level, incumbent may be noncompetitively promoted to the next higher grade level after meeting all regulatory requirements, and upon the recommendation of management. Promotion is neither implied nor guaranteed.<br>\n<br>\nTerm appointments may be extended up to 8 years at the discretion of management and in accordance with applicable regulations. Additionally, you may be noncompetitively converted to a permanent career-conditional or career appointment under specific conditions.<br>\n<br>\nTemporary appointments may be extended up to 3 years at the discretion of management and in accordance with applicable regulations.<br>\nTemporary actions taken under this announcement may be made permanent without further competition.<br>\nTemporary actions taken under this announcement may be terminated at any time before the established not-to-exceed date.</strong><br>\n<br>\nThis position maybe eligible for part time, full time or ad-hoc telework at the discretion of management.<br>\n<br>\nRecruitment incentives may be authorized to eligible new hires.<br>\n<br>\nPositions may be subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required.<br>\n<br>\nEligible DoD career or career conditional employees shall be granted statutory return rights to their former position for a period of 5 years if continuously employed in a foreign or non-foreign area provided by Executive Order 10895 and DoDI 1400.25, v 1230.\n </p>\n <p></p>\n </div>Read more\n\n <div>\n Background checks and security clearance\n <div>\n <div>\n Security clearance\n <p>\n \n Other\n \n </p>\n </div>\n\n <div>\n Drug test required\n <p>\n No\n </p>\n </div>\n </div>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Required Documents\n \n <div>\n \n Help\n \n Required Documents\n <div>\n <p>\n A COMPLETE RESUME IS REQUIRED. Your resume must show relevant experience (cover letter optional) where you worked, job title, duties and accomplishments, employer's name and address, supervisor's name and phone number, starting and end dates (Mo/Yr), hours per week &amp; salary. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade level i.e. GS-0201-09. Note: Only the last resume received will be reviewed.<br>\n<br>\nYOU ARE REQUIRED TO DOCUMENT IN YOUR APPLICATION PACKAGE EVIDENCE THAT SUPPORTS YOUR ELIGIBILITY AND QUALIFICATION CLAIMS. You are required to upload the applicable documents with your application package. These documents will assist the staffing specialist in determining your eligibility and qualifications.<br>\n<br>\nDOES THIS POSITION REQUIRE A LICENSE OR CERTIFICATE?</p></div></div></li></ul></div></div></div></div>"}