{"job title": "Materials Research Scientist", "company": "Desktop Metal", "city state": "– Burlington, MA", "rating": "5.0", "job description": "Desktop Metal is revolutionizing 3D printing of metal parts. Our printers robust build processes create complex parts beautifully at a price attainable by any design and manufacturing team and can be used within an office environment. We are looking to bring on board bright, motivated team members across wide spectrum of engineering disciplines. Desktop Metal is seeking a talented and self-motivated Materials Research Scientist. The ideal candidate will have experience developing novel materials from conceptualization to production. This position reports to the VP of Engineering.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Developing materials that can be broadly applied to metal 3D printing</li>\n<li>Conducting material characterization and analysis</li>\n<li>Devising testing methods to evaluate specific material properties and performance</li>\n<li>Studying and interpreting the elastic, plastic, and failure behaviors of metals in standard and non-standard mechanical tests</li>\n<li>Maintaining high level of communications with cross-functional team, and partners</li>\n<li>Working with an interdisciplinary team to define, write, and execute designs of experiments</li>\n</ul>\n\nBasic Qualifications\n\n\n<ul>\n<li>Demonstrated ability to develop deep understanding of the end user needs quickly, and can proficiently translate those needs into the right technology solution</li>\n<li>Ability to resolve complex issues in creative, efficient, and effective ways</li>\n<li>Able to provide the customer and company-wide perspective to detailed technical decisions</li>\n<li>Excellent written and oral communication skills</li>\n<li>PhD Materials Science, Metallurgy, Mechanical Engineering or equivalent</li>\n</ul>\n\nPreferred Experience\n\n\n<ul>\n<li>Additive manufacturing</li>\n<li>Fractography</li>\n<li>High temperature experiments - corrosion, mechanics</li>\n<li>Inkjet technologies</li>\n<li>Mechatronics</li>\n<li>Metallurgy</li>\n<li>Process control methods for metals</li></ul>"}