{"job title": "Data Scientist", "company": "Det Norske Veritas", "city state": "– UK--Aberdeen", "rating": "3.2", "job description": "Local Unit &amp; Position Description<br><br>This role is a key support function to assist with digitalisation projects and improve delivery tools by automating the work flow undertaken by DNV GL Oil &amp; Gas in the UK.\n<br><br>\nThe role will be based in our Aberdeen or London office, but there will also be a requirement to travel between London and Aberdeen offices and occasionally overseas.\n<br><br>\n<strong>Key Accountabilities:</strong>\n<br><br>\nCarrying out activities, including:\n\n<ul>\n\n <li>Working with engineers in the Oil and Gas industry.</li>\n<li>Expected to leverage in-house expertise and self-teach the subject within a reasonable time period.</li>\n<li>Develop and validate statistical forecasting models and tools.</li>\n<li>Process improvements using digital techniques.</li>\n<li>Creative, self-starter and like solving problems.</li>\n</ul>\n\nPosition Qualifications\n\n\n<ul>\n\n <li>Graduate at degree level or above - Quantitative background in Computer Science, Mathematics, Informatics, Data Science.</li>\n<li>Experience in implementing optimisation methods and recommendation systems.</li>\n<li>Excellent understanding of machine learning techniques and algorithms such as regression, decision trees.</li>\n<li>Demonstrated ability to conduct independent research utilizing large data sets.</li>\n<li>Solid programming skills and experience designing prototypes using Python or equivalent.</li>\n<li>Any involvement in a project to implement a machine learning model from scratch would be a distinct advantage.</li>\n<li>An understanding and ability to use natural language processing techniques would also be an advantage.</li>\n<li>Experience with the PHP scripting language and the ability to maintain and manage code developed in existing solutions is required, as is the ability to suggest constructive improvements to production code.</li>\n<li>Knowledge of relational databases – Microsoft SQL Server, MySQL – is advantageous.</li>\n</ul>\n<strong>Competency Requirements:</strong>\n\n<ul>\n\n <li>Excellent communicator, adept at queries, report writing and presenting findings.</li>\n<li>Ability to effectively cooperate and deal with wide range of internal and external relationships.</li>\n<li>Have a strong motivation for knowledge and personal development.</li>\n<li>Be able to work both independently and in teams.</li>\n<li>Have a high level of attention to detail, meticulous but pragmatic processes and organisational skills.</li>\n<li>Be approachable, be a good listener, be diplomatic, be assertive.</li>\n<li>Flexibility to travel around the UK.</li>\n</ul>\n\nCompany &amp; Business Area Description<br><br>DNV GL is a global quality assurance and risk management company. Driven by our purpose of safeguarding life, property and the environment, we enable our customers to advance the safety and sustainability of their business. We provide classification, technical assurance, software and independent expert advisory services to the maritime, oil &amp; gas, power and renewables industries. We also provide certification, supply chain and data management services to customers across a wide range of industries.\n<br><br>\nCombining technical, digital and operational expertise, risk methodology and in-depth industry knowledge, we empower our customers’ decisions and actions with trust and confidence. We continuously invest in research and collaborative innovation to provide customers and society with operational and technological foresight. With origins stretching back to 1864 and operations in more than 100 countries, our experts are dedicated to helping customers make the world safer, smarter and greener.\n<br><br>\nDNV GL is the technical advisor to the oil and gas industry. We bring a broader view to complex business and technology risks in global and local markets. Providing a neutral ground for industry cooperation, we create and share knowledge with our customers, setting standards for technology development and implementation. From project initiation to decommissioning, our independent experts enable companies to make the right choices for a safer, smarter and greener future."}