{"job title": "AFC AML Transaction Monitoring MI &amp; Reporting Data Analyst-Associate", "company": "Deutsche Bank", "city state": "– Jacksonville, FL", "rating": "3.4", "job description": "AFC AML Transaction Monitoring MI &amp; Reporting Data Analyst-Associate\n<br><br>\nJob ID: 3182140 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2018-11-15 Location: Jacksonville, United States of America\n<br><br>\nRegulation, Compliance &amp; Anti-Financial Crime\n<br><br>\nRegulation, Compliance and Anti-Financial Crime (AFC) protects the integrity and reputation of Deutsche Bank. It manages the Bank's risks and help to avert unintentional rule breaches and conflicts of interest. At the same time, we also advise the bank on ethical conduct and governance issues and keep the bank up to date on regulatory and political challenges.\n<br><br>\nPosition Overview\n<br><br>\nJob Title: AFC AML Transaction Monitoring MI &amp; Reporting Data Analyst\n<br><br>\nCorporate Title: Associate\n<br><br>\nLocation: Jacksonville, FL\n<br><br>\nAbout Deutsche Bank\n<br><br>\nWe are Germany's leading bank with strong positions in Europe and significant presence in the Americas and Asia Pacific. We're driving growth through our strong client franchise, investing heavily in digital technologies, prioritizing long-term success over short-term gains, and serving society with ambition and integrity. We serve our clients' real economic needs in commercial and investment banking, retail banking and transaction banking, and provide ground-breaking products and services in asset and wealth management. That means a career packed with opportunities to grow and the chance to shape the future of our clients.\n<br><br>\nDepartment\n<br><br>\nRegulation, Compliance and Anti-Financial Crime (AFC) protect the integrity and reputation of Deutsche Bank. They manage the Bank's risks and help to avoid unintentional rule breaches and conflicts of interest. At the same time, they also advise on ethical conduct, governance issues and keep our organization up-to-date on regulatory and political challenges.\n<br><br>\nDeutsche Bank (DB) is committed to the highest standards of control in the areas of Anti-Money Laundering (AML), Sanctions &amp; Embargoes, Anti-Bribery and Corruption (ABC) and Anti-Fraud (collectively referred to as Anti-Financial Crime). All employees are required to adhere to these standards to protect Deutsche Bank and our reputation from those who may intend to use our products and services for illegal purposes including, but not necessarily limited to, money laundering, bribery, corruption, fraud and/or terrorist financing.\n<br><br>\n<strong>Anti-Financial Crime's Mission is:</strong>\n\n\n<ul>\n<li>To be a trusted and respected independent control function that aims to protect the Bank from financial crime risk</li>\n<li>To establish a proactive framework to prevent, detect, investigate and report bank-wide financial crime risk events</li>\n</ul>\n\nOverview\n<br><br>\nThe Anti-Financial Crime team is accountable for protecting Deutsche Bank from financial and reputational losses incurred by financial crimes by assessing, controlling and mitigating risks. The Management and Information Reporting Associate is primarily responsible for providing actionable intelligence to a variety internal and external stakeholders to further the enhancements of the Financial Crime Investigations platform.\n<br><br>\nThis position reports to the MI &amp; Analytics Team Manager\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Responsible for receiving, organizing and conducting productivity analysis and further establishing operational metrics</li>\n<li>Prepare regular &amp; periodic MIS reports</li>\n<li>Key player in the development, implementation and maintenance of a strategic reporting platform and framework for FCI using Hadoop, Hive, Impala and Tableau platform</li>\n<li>Implement streamlined analytical solutions and data quality controls to improve accuracy, efficiency, visibility and quality of data</li>\n<li>Design and create PowerPoint presentations, Excel Spreadsheets, and Word documents as directed for senior members of the AFC Department</li>\n<li>Create new ad-hoc reports and analysis to support specific initiatives &amp; requirements</li>\n<li>Keep abreast of new rules, regulations and reputation risks to develop, implement and revise current policies &amp; procedures</li>\n</ul>\n\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>Previous relevant work experience in the financial, compliance, legal and/or regulatory industry</li>\n<li>Excellent written &amp; verbal communication skills with strong interpersonal skills, professionalism and teamwork awareness</li>\n<li>Detail-oriented with excellent organizational skills</li>\n<li>Ability to communicate issues to Senior Management in an effective manner</li>\n<li>Ability to work under pressure and within tight deadlines</li>\n<li>A proactive approach to tasks &amp; responsibilities</li>\n<li>Ability to work independently &amp; in a team environment</li>\n<li>Strong analytical skills with an investigative mind-set</li>\n<li>Advanced knowledge of MS Access &amp; Excel, including pivot tables, macros, filtering and sorting</li>\n<li>Experience with Data Visualization Tools (e.g. Tableu)</li>\n<li>Excellent Troubleshooting skills to identify and fix data quality and operational issues</li>\n<li>Operational knowledge of USD payment systems, including SWIFT, CHIPS, ACH, and FedFunds</li>\n<li>Experience as an AML Investigator in a surveillance monitoring capacity</li>\n<li>Knowledge with Case Management System, Actimize / Mantas</li>\n<li>Experience working with AML or financial data systems</li>\n<li>Ability to adapt to a constantly changing environment</li>\n<li>Experience using statistical programming languages (e.g. SAS, R, Python)</li>\n<li>Experience in Computer Science, database design, ETL processes and data mining</li>\n</ul>\n\nFor candidates applying for positions in the US:\n<br><br>\nDeutsche Bank is an Equal Opportunity Employer - Veterans/Disabled and other protected categories. Click these links to view the \"EEO is the Law\" poster and pay transparency statement."}