{"job title": "Data Scientist- Vice President", "company": "Deutsche Bank", "city state": "– New York, NY", "rating": "3.4", "job description": "Data Scientist- Vice President\n<br><br>\nJob ID: 3179187 Full/Part-Time: Full-time Regular/Temporary: Regular Listed: 2018-08-30 Location: New York, United States of America\n<br><br>\nJob Title: Data Scientist\n<br><br>\nCorporate Title: Vice President\n<br><br>\nLocation: New York, NY\n<br><br>\nAbout Deutsche Bank\n<br><br>\nWe are Germany's leading bank with strong positions in Europe and significant presence in the Americas and Asia Pacific. We're driving growth through our strong client franchise, investing heavily in digital technologies, prioritizing long-term success over short-term gains, and serving society with ambition and integrity. We serve our clients' real economic needs in commercial and investment banking, retail banking and transaction banking, and provide ground-breaking products and services in asset and wealth management. That means a career packed with opportunities to grow and the chance to shape the future of our clients.\n<br><br>\nDeutsche Bank's Research team offers true global and industry knowledge that generates consistent outperformance through an in depth comprehensive multi asset class research product. Our teams deal with a range of functions from asset allocation to economic forecasting and cover all major global industry sectors. Key research disciplines include Equity, Fixed Income, Economics, Foreign Exchange and Emerging Markets. Over the past few years Deutsche Bank has consistently ranked in the Top 3 in Institutional Investor's European surveys.\n<br><br>\nThe Primary Research teams based in New York and London have a mission to use big, alternative and directly sourced data to describe and predict key metrics of companies and economies so that we may deliver innovative data solutions and insights to our internal analyst teams and the firm's clients. We are looking for self-starting and innovative data scientists to join and grow our team. You must have a keen interest in financial markets and experience with modern analytical tools and methods, including processing data at large scale for analytical purposes, while maintaining proper empirical discipline and rigor.\n<br><br>\n<strong>Key responsibilities:</strong>\n\n\n<ul>\n<li>Work with street leading analysts to facilitate their requests for new and innovative data analytics</li>\n<li>Help design and construct the data processing and analytics infrastructure necessary to perform advanced analytical research within a global enterprise</li>\n<li>Create original insights from data by executing applied empirical research in a timely manner</li>\n<li>Create content for existing research reports, or help write stand-alone insightful research for Deutsche Bank's clients</li>\n</ul>\n\n<strong>Key Requirements:</strong>\n\n\n<ul>\n<li>A PhD, or Masters with equivalent work experience, with a solid background in machine learning, statistical analytical techniques, quantitative social science research or experimental physical science</li>\n<li>Experience developing statistical and predictive models using software including Python and R as well as working knowledge of C/C++/Java</li>\n<li>Experience processing data at scale using SQL and NoSQL database systems</li>\n<li>Strong experience and desire to write research style reports, which could include a PhD thesis, but other research documents are equally relevant</li>\n<li>You must have a strong desire to see their work leveraged across multiple channels, including: providing written content for standalone research reports; adding insight to research reports written by other analysts, and; developing systematic trading strategies for investment by Deutsche Bank's clients</li>\n<li>Excellent written and spoken English, with ability to work collaboratively and communicate well within a highly skilled team, with a wide range of backgrounds and skillsets</li>\n</ul>\n\nPosition Overview\n<br><br>\nCorporate&amp;Investment Banking: Global Transaction Banking\n<br><br>\nThe Corporate&amp;Investment Bank (CIB) combines Deutsche Bank's Corporate Finance, Global Markets and Global Transaction Banking businesses. This new business division was created in 2017 with the aim to ensure greater alignment of product and sales efforts, enabling the bank to deliver a better service to clients and a more focused resource allocation.\n<br><br>\nGlobal Transaction Banking (GTB) is a leading global provider of cash management, trade finance and securities services, delivering the full range of commercial banking products and services for both corporates and institutions worldwide.\n<br><br>\nFor candidates applying for positions in the US:\n<br><br>\nDeutsche Bank is an Equal Opportunity Employer - Veterans/Disabled and other protected categories. Click these links to view the \"EEO is the Law\" poster and pay transparency statement."}