{"job title": "Sales Analytics Manager - DBC", "company": "Diageo", "city state": "– Norwalk, CT", "rating": "3.8", "job description": "Sales Analytics Manager - DBC\n<br><br>\n19-Oct-2018\n<br><br>\n<strong>AutoReqId</strong>\n<br>\n<strong>64452BR</strong>\n<br><br>\n<strong>Reporting Location</strong>\n<br>\nNorwalk\n<br><br>\n<strong>Country</strong>\n<br>\nUnited States\n<br><br>\n<strong>Function</strong>\n<br>\nSales\n<br><br>\n<strong>North America State/Province</strong>\n<br>\nConnecticut\n<br><br>\n<strong>Type of Job</strong>\n<br>\nEmployee\n<br><br>\n<strong>External Job Description</strong>\n<br>\n<strong>Role Purpose:</strong> Drive A&amp;P scorecarding, commercial execution score-carding, category and competitive analysis, key chain performance analysis and commercial data management as needed.\n<br><br>\n<strong>Role Deliverables:</strong>\n\n<ul>\n<li>Lead A&amp;P measurement and evaluation process and convey results to DBC LT to ensure efficient A&amp;P allocation</li><li>Own development and alignment on EDGE and National Execution goals</li><li>Develop and drive standard processes, tools and reporting to enable distributor performance management (Comm decks)</li><li>Work closely with spirits BAP teams to ensure consistency in approach and tools</li><li>Provide Forecasting Support to Commercial Innovation Team</li><li>Ad-hoc decision support projects to inform business decision making</li><li>Key point person for Brand teams for analytics</li><li>Provide support for business presentations – e.g. Investor relations, industry overviews etc.</li>\n</ul>\n\n<strong>Role Complexity</strong>\n<br>\nComplexity is high as analytical insights are required across geographies, products, accounts. Role requires deep understanding of financial and commercial data sources, and solid understanding of the beer industry. Role will interact with multiple stakeholders across functions including 3rd parties.\n<br><br>\n<strong>Key capabilities</strong>\n\n<ul>\n<li><strong>Great communication skills – ability to articulate points of view across levels and functions</strong></li><li><strong>Comfortable with constructive challenge and build process with senior leadership</strong></li><li><strong>Resourceful and proactive and takes initiative</strong></li><li><strong>Enjoys working in grey areas – Can work on complex projects that can be solved in a variety of ways</strong></li><li><strong>High standards of accuracy</strong></li>\n</ul>\n\n<strong>Management Responsibility</strong>\n<br>\nReports to Director of Trade Marketing<br><br>TO ALL RECRUITMENT AGENCIES: Diageo does not accept unsolicited agency resumes.\n<br><br>\nPlease do not forward resumes to our jobs alias, Diageo employees or any other company location. Diageo is not responsible for any fees related to unsolicited resumes.<br><br><strong>External Job Title</strong>\n<br>\nSales Analytics Manager - DBC\n<br><br>\n<strong>Town/City</strong>\n<br>\nNorwalk\n<br><br>\n<strong>EEOC Statement (Only for US Users. For other markets, please leave blank)</strong>\n<br>\nDiageo is an Equal Opportunity Affirmative Action employer and is subject to federal regulations pertaining to employment. Diageo does not unlawfully discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, marital status, Protected veteran status, or any other basis prohibited under federal, state or local laws governing non-discrimination in employment in every location in which the Company has facilities. Diageo also provides reasonable accommodation for qualified individuals with disabilities in accordance with the Americans with Disabilities Act (ADA) and any other state or local laws.\n<br><br>\n<strong></strong>"}