{"job title": "Business Analytics Manager - Advanced Analytics", "company": "Diageo", "city state": "– Norwalk, CT", "rating": "3.8", "job description": "<br><b></b><br>Business Analytics Manager - Advanced Analytics<br><br><b></b><br>19-Sep-2018<br><br><b>AutoReqId</b><br>63103BR<br><br><b>Reporting Location</b><br>Norwalk <br><br><b>Country</b><br>United States<br><br><b>Function</b><br>Sales<br><br><b>North America State/Province</b><br>Connecticut<br><br><b>Type of Job</b><br>Employee<br><br><b>External Job Description</b><br><strong>Purpose of Role </strong><br>Find analytic opportunities by translating business ideas into analytics &amp; clear use case outcomes<br> <br><strong>Dimensions:</strong><br> <br><strong>Leadership Responsibilities and DRM</strong><ul><li>Works as a partner with and challenge the business owner by Leads and manages large shared on-shore and off-shore analytics delivery</li></ul> <br><strong>Top 3-5 Accountabilities</strong><ul><li>Structure and identify the key business problems that data and analytics can help solve</li><li>Works as a partner with and challenge the business owner by asking the right questions</li><li>Provides insight to the business partner in terms of what “state of the art” looks like in data and analytics in their area</li><li>Understands strategic needs of the business, and is able to translate need into potential new use cases</li><li>Builds deep understanding of the product/functional area (e.g., Operations, Marketing) that the business partner is aligned with</li><li>Acts as the key contact within their BU for use case ideas and supports use case implementation teams</li><li>Knows the status of all use cases and ensures all feedback is gathered and addressed</li></ul> <br><strong>Qualifications and Experience Required</strong><ul><li>Bachelor's Degree in a quantitative field (business, math, economics, finance, statistics, science, engineering) with Master’s Degree in statistics, math, computer science, business, economics or finance</li><li>5+ years of experience in Business Analysis (former top tier consultant preferred), or Product Management (Media / Technology)</li><li>Excellent interpersonal skills, strong verbal and written communications skills - capable of developing well-structured communications and presentations, storytelling ability</li><li>Team oriented, goals oriented, and flexible with proven track record in collaborating with multiple stakeholders and driving results</li></ul><div><p>TO ALL RECRUITMENT AGENCIES: Diageo does not accept unsolicited agency resumes. </p><p>Please do not forward resumes to our jobs alias, Diageo employees or any other company location. Diageo is not responsible for any fees related to unsolicited resumes.</p></div><br><br><b>External Job Title</b><br>Business Analytics Manager - Advanced Analytics<br><br><b>Town/City</b><br>Norwalk<br><br><b>EEOC Statement (Only for US Users. For other markets, please leave blank)</b><br>Diageo is an Equal Opportunity Affirmative Action employer and is subject to federal regulations pertaining to employment. Diageo does not unlawfully discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, marital status, Protected veteran status, or any other basis prohibited under federal, state or local laws governing non-discrimination in employment in every location in which the Company has facilities. Diageo also provides reasonable accommodation for qualified individuals with disabilities in accordance with the Americans with Disabilities Act (ADA) and any other state or local laws.<br><br><b></b>"}