{"job title": "Sales Analytics Manager", "company": "Diageo", "city state": "– Norwalk, CT", "rating": "3.8", "job description": "Sales Analytics Manager\n<br><br>\n23-Oct-2018\n<br><br>\n<strong>AutoReqId</strong>\n<br>\n<strong>64531BR</strong>\n<br><br>\n<strong>Reporting Location</strong>\n<br>\nNorwalk\n<br><br>\n<strong>Country</strong>\n<br>\nUnited States\n<br><br>\n<strong>Function</strong>\n<br>\nSales\n<br><br>\n<strong>North America State/Province</strong>\n<br>\nConnecticut\n<br><br>\n<strong>Type of Job</strong>\n<br>\nEmployee\n<br><br>\n<strong>External Job Description</strong>\n<br>\n<strong>Purpose / Objective of the Role</strong>\n<br>\nThe purpose of the role is to provide analysis, support and insights to Division Leadership (Sales Directors, Marketing Director, VP of Sales and GM). The SAM will utilize business reporting systems to identify market opportunities with actionable recommendations and insights.\n<br>\n<strong>​</strong>\n<br>\n<strong>Top 3 - 5 Accountabilities of this role</strong>\n\n<ul>\n<li>Sales Leadership: Proactively Develop Division focused insights/opportunities thru analytics, uncovering additional volume/value &amp; market share opportunities. Develop presentations to communicate insights to Sr Mgmt., as well as track progress against these initiatives. Example: Scotch &amp; Multicultural Projects. Prepares / Coordinates Presentation Documents for Meetings: GSM, State Liquor Board Presentations, etc.</li><li>Manage / Update Relevant &amp; Timely Market Profiles &amp; Account Universe Maintenance by state across all 17 states</li><li>Work Closely with 3rd Party Platforms (GSC &amp; SFA) &amp; Broker SAM's on Performance Reporting</li>\n</ul>\n\n<strong>Qualifications and Experience/Skills Required</strong>\n\n<ul>\n<li>BA Required.</li><li>Experience working in a cross-functional team. 5 to 7 years’ experience of consumer products &amp; /or three-tier consumer products organization. Prior Experience in managing multiple projects and working with large amounts of data.</li> <li>Excellent excel skills, with mastery of pivot tables and advanced formulas. MicroStrategy helpful, but not necessary.</li><li>Must have excellent analytical organizational, computer &amp; communication skills. Working knowledge of functions within the consumer products industry.</li><li>Work effectively with cross-functional teams. Utilizing commercial acumen &amp; analytics to be a \"thought Partner\" with the sales &amp; marketing teams to drive optimal business decisions &amp; outcomes.</li>\n</ul>\n\nTO ALL RECRUITMENT AGENCIES: Diageo does not accept unsolicited agency resumes.\n<br>\nPlease do not forward resumes to our jobs alias, Diageo employees or any other company location. Diageo is not responsible for any fees related to unsolicited resumes.\n<br><br>\n<strong>External Job Title</strong>\n<br>\nSales Analytics Manager\n<br><br>\n<strong>Town/City</strong>\n<br>\nNorwalk\n<br><br>\n<strong>EEOC Statement (Only for US Users. For other markets, please leave blank)</strong>\n<br>\nDiageo is an Equal Opportunity Affirmative Action employer and is subject to federal regulations pertaining to employment. Diageo does not unlawfully discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, marital status, Protected veteran status, or any other basis prohibited under federal, state or local laws governing non-discrimination in employment in every location in which the Company has facilities. Diageo also provides reasonable accommodation for qualified individuals with disabilities in accordance with the Americans with Disabilities Act (ADA) and any other state or local laws.\n<br><br>\n<strong></strong>"}