{"job title": "Research Scientist", "company": "Dickinson State University", "city state": "– Dickinson, ND", "rating": "4.0", "job description": "Research Scientist\n<br><br>\nHiring Department: Energy &amp; Environmental Research Center (EERC)\n<br><br>\nMinimum Hiring Salary/Position Classifications: $60,000+/Annual, Full-Time, Benefited, Exempt\n<br><br>\nBenefits: Includes single or family health care coverage (premiums paid for by the university), basic life insurance, EAP, retirement plan, tuition waiver, and annual and sick leave. Optional benefits available: supplemental life, dental, vision, flexible spending account, supplemental retirement plans.\n<br><br>\nWork Schedule: Monday-Friday, 8:00 a.m. - 5:00 p.m. Some travel required.\n<br><br>\nFor full consideration, all application materials must be fully submitted by 5PM (Central Time) on the closing date.\n<br><br>\nPosition Details: A Complete Position Description is available as an attachment in the bottom right corner of this position announcement.\n<br><br>\nAt the Energy &amp; Environmental Research Center (EERC), we know our people are our greatest asset. Our team of over 200 is sought after worldwide to solve energy and environmental challenges in innovative ways. Since 1951, we've worked with over 1,300 clients in 53 countries. We recognize that quality, market-driven science and engineering technologies come from engaged, motivated employees. We encourage lifelong learning through our Employee Development Program and offer many opportunities for both professional and personal growth. In addition to competitive salaries and an outstanding benefits package, the EERC provides opportunities for inventors of commercialized technologies to share in the profits. As the EERC is part of the University of North Dakota, employees are eligible for tuition waivers and reduced tuition for family members. Apply with us for a position that can turn into a lifelong passion and a work environment that's more like a family.\n<br><br>\nWe are looking for experienced, aggressive, scientifically trained, and market-oriented individuals to contribute to the success of the organization by performing one or more of the following functions:\n\n\n<ul>\n<li>Work in strong collaboration with EERC subject matter experts, principal investigators, and EERC leadership to conduct laboratory analyses and interpret laboratory data to support research activities related to improved production of unconventional oil and gas reservoirs, enhanced oil recovery (EOR) in unconventional and conventional formations and subsurface storage of CO2 and/or rich gas.</li>\n<li>Work as part of a diverse, multi-disciplinary team of scientists and engineers to ensure that technical work is successfully completed on time, on budget, and within client expectations.</li>\n<li>Work in one or more of the analytical research laboratories in the EERC's Subsurface R&amp;D group that focuses on petrophysical, petrographic, geochemical, and geomechanical evaluation of rocks and other natural and man-made materials.</li>\n<li>Ensure that laboratory data and results are of excellent quality and integrated with the theoretical, modeling and field components of related EERC research efforts.</li>\n<li>Adhere to laboratory safety protocols and assist in regular review and updating of laboratory safety plans.</li>\n<li>Work closely with senior staff, project managers and laboratory staff to develop and expand the research-based efforts occurring in the laboratories.</li>\n<li>Provide technical assistance on projects related to CO2 EOR, CO2 storage, unconventional hydrocarbon recovery, natural resource management, critical resource characterization and recovery, geologic and synthetic materials characterization, and the environmental aspects of energy development.</li>\n<li>Some travel is required.</li>\n</ul>\n\n<strong>Required Competencies:</strong>\n\n\n<ul>\n<li>Excellent communication, teamwork, and interpersonal skills.</li>\n<li>Effective at project and task management in area of expertise.</li>\n<li>Knowledge and willingness to learn about new technologies.</li>\n<li>Adherence to and promotion of good safety practices in the workplace and field.</li>\n<li>Experience preparing high-quality technical reports and documents and in preparing and delivering technical presentations.</li>\n</ul>\n\nFor more information regarding the EERC, visit www.undeerc.org\n<br><br>\n<strong>Minimum Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's degree in geochemistry, geology, geological engineering, petroleum engineering, reservoir engineering, chemistry or closely related field.</li>\n<li>At least 2 years of scientific research experience.</li>\n<li>Experience working in a laboratory environment, including adherence to and implementation of laboratory safety and quality assurance (QA)/quality control (QC) protocols.</li>\n<li>Experience characterizing and evaluating subsurface media and/or fluids as they pertain to oil and gas production, EOR, and/or CO2 storage.</li>\n<li>Cover Letter and resume/CV</li>\n<li>Successful completion of criminal history background check.</li>\n</ul>\n\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Advanced degree in geochemistry, geology, geological engineering, petroleum engineering, reservoir engineering, chemistry or closely related field.</li>\n<li>Five or more years of scientific research experience.</li>\n<li>Experience performing SEM, XRF, and XRD analyses and interpretation of results.</li>\n<li>Experience writing proposals for technical work.</li>\n<li>Proficiency and experience with one or more of the following: geologic characterization; laboratory data collection, processing, QA/QC, and analysis; experimental design; applied laboratory research; gas chromatography and hydrocarbon analysis; environmental chemistry; geochemistry; organic petrology.</li>\n</ul>\n\nTo find out why living and working in Greater Grand Forks is way cooler, check out www.GrandForksisCooler.com\n<br><br>\nAll information listed in this position announcement will be used by Human Resources, the Hiring Department, and EO/Title IX for screening, interviewing and selection purposes.\n<br><br>\nConfidentiality of Application Materials\n<br><br>\nNote: Pursuant to NDCC 44-04-18.27, applications and any records related to the applications that identify an applicant are confidential, except records related to the finalists of the position, which are open to the public after the search committee has identified the top three finalists who will be invited to campus.\n<br><br>\nEEO Statement\n<br><br>\nUND is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or national origin. Women, minorities, veterans and individuals with disabilities are encouraged to apply. Applicants will be invited to provide information regarding their gender, race and/or ethnicity, veteran's status and disability status during the application process. This information will remain confidential and separate from your application.\n<br><br>\nND Veteran's Preference\n<br><br>\nNorth Dakota Veterans claiming preference must submit all proof of eligibility by the closing date. Proof of eligibility includes a DD-214 and if claiming disabled status, a current letter of disability from the VA dated within the last 12 months.\n<br><br>\nClery Statement\n<br><br>\nIn compliance with the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act, the University of North Dakota publishes an Annual Security and Fire Safety Report. The report includes the university's policies, procedures, and programs concerning safety and security, as well as three years' of crime statistics for our campus. As a prospective employee, you are entitled to a copy of this report. The report and statistical data can be found online at http://und.edu/discover/_files/docs/annual-security-report.pdf. You may also request a paper copy of the report from the UND Police Department located at 3851 Campus Road, Grand Forks, ND 58202."}