{"job title": "Data Scientist - Fraud Analytics", "company": "DiDi Labs", "city state": "– Mountain View, CA", "rating": "NA", "job description": "<strong>Data Scientist - Fraud Analytics</strong>\n<br><br>\nDiDi Labs is working to solve the world's most challenging problems. Located in Mountain View, California, we're developing advanced technologies to power our vision of the future: an open, efficient, collaborative, and sustainable transportation ecosystem. Our mission is to improve mobility, reduce pollution, and enhance the quality of life in cities and beyond.\n<br><br>\nThe Risk Management team is responsible for managing diversified risk associated with our products and business flows, ranging from payment risk, fraud risk, credit risk to public safety risk, tracking industry leading technical prevalence, developing innovative and state-of-art methodology to tackle the new challenges emerging from share economy ecosystem, for the purpose to protect sustainable growth and maximize business outcomes. We are looking for an experienced Data Scientist to provide data-driven, action-oriented solutions to risk problems through statistical data mining, analytics techniques and a consultative approach, own the end to end risk modeling and response for key metrics of model healthy.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Acute business sense, deeply understand the business model, transaction flow, and payment system. Discovery the potential risk point, work closely with product manager, engineer, and operations to design data pipeline and risk strategy framework.</li>\n<li>Lay the groundwork hypothesize as an individual researcher and in collaboration with other team members on how to solve fraud problems. Perform data preparation activities, such as collecting, cleaning, and organizing.</li>\n<li>Produce clear, understandable visualizations, dashboard and reports to share with Senior Management and business partners, provide the insightful story from the data perspective to risk policy owners.</li>\n<li>Establish a holistic risk modeling framework for addressing the risk of fraud and financial abuse across riders, drivers, merchants, and affiliates</li>\n<li>Deep dive into data through systematic and ad hoc analyses and build machine learning models to score the identity, behavior, reputation and other risk characteristics of the customers.</li>\n<li>Communicate Results on a regular basis to stakeholders around the world, including executive leadership</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n<li>Master degree (Ph.D. is a plus) in Statistics, Mathematics, Computer Science, Engineering or a similar Quantitative field, or equivalent practical experience.</li>\n<li>Strong modeling skillset, hands on mastery of data manipulation and experience with data analytics tools (SQL, R, Python, Hive, Spark, and other data analysis packages)</li>\n<li>Experience working in payments fraud or credit risk modeling is desired but not mandatory</li>\n<li>Knowledge of the latest ML techniques like decision tree, random forest is a plus, but not a requirement</li>\n<li>Creative problem solving and critical thinking skills</li>\n</ul>"}