{"job title": "Data Analyst", "company": "Digital Intelligence Systems, LLC", "city state": "– Long Beach, CA", "rating": "3.5", "job description": "<strong>Position: Data Analyst</strong>\n<br><br>\n<strong>Location: Long Beach, California</strong>\n<br><br>\n<strong>Duration: 6+ Months</strong>\n<br><br>\n<strong>Roles and Responsibilities:</strong>\n<br><br>\nAccess and integrate data from the various Healthcare systems (QNXT, Medinsight, (pharmacy,etc.)\n<br><br>\ncreate actionable management reports that can be used to analyze costs and quality, analyze results and identify opportunities to manage costs and improve quality.\n<br><br>\nReport observations to manager, pointing out areas of concern inaccuracy, cost trends, and efficiency.\n<br><br>\nEssential Functions:\n<br><br>\n*Extract and upload information including large data sets from various systems to support team needs.\n<br><br>\n*This resource is utilized for ad hoc requests for pharmacy, medical expenses, and enrollment data by other members of the team.\n<br><br>\n*Assist in preparation of reports produced regularly to support executive decision-making.\n<br><br>\n*Research and analyze report results identifying opportunities and trends.\n<br><br>\n*Develop efficient reporting methods.\n<br><br>\n*Support team members when additional analytics are required for medical costs.\n<br><br>\nKnowledge/Skills/Abilities:\n<br><br>\n*Ability to be a self-starter, motivated, energetic worker with an interest in learning the healthcare system or other BI software.\n<br><br>\n*Knowledge of healthcare and prescription drug claims data *Proficiency with Microsoft Office, Including Excel, Word and PowerPoint\n<br><br>\n*Ability to use data cubes to extract data and reports from Medinsight.\n<br><br>\n*Basic level of programming is desired. *Good verbal and written communication skills\n<br><br>\n*Good interpersonal and problem solving skills.\n<br><br>\n*Ability to abide by policies\n<br><br>\nMaintain regular attendance based on agreed-upon schedule\n<br><br>\n*Maintain confidentiality and comply with Health Insurance Portability and Accountability Act (HIPAA)\n<br><br>\n*Ability to establish and maintain positive and effective work relationships with coworkers, clients, members, providers and customers\n<br><br>\nRequired Education: A or BS in Biostatistics, Public Health, Statistics, Mathematics, or Health Care or related field required.\n<br><br>\nRequired Experience: 0-2 years of relevant work experience.\n<br><br>\nExperience with MS Office applications required, especially strong Excel skill.\n<br><br>\nSkill with SQL or SAS.\n<br><br>\nAlternate programming experience may substitute.\n<br><br>\nExperience with data management and analysis preferred.\n<br><br>\nMust have strong quantitative and analytical skills.\n<br><br>\nSome experience in health care industry or pharmacy claims desired.<br><br>- provided by Dice\n<br><br>\nData Analyst,QNXT, Medinsight,hoc requests ,report ,Biostatistics"}