{"job title": "Sr Quantitative Analyst", "company": "Digital Intelligence Systems, LLC", "city state": "– Coppell, Texas", "rating": "3.5", "job description": "Job Snapshot\n<br><br>\n<strong>Employee Type:</strong>\n<br><br>\nFull-Time\n<br><br>\n<strong>Location:</strong>\n<br><br>\nCoppell, TX\n<br><br>\n<strong>Job Type:</strong>\n<br><br>\nInformation Technology\n<br>\nBanking\n<br>\nFinance\n<br><br>\n<strong>Experience:</strong>\n<br><br>\nNot Specified\n<br><br>\n<strong>Date Posted:</strong>\n<br><br>\n<strong>11/15/2018</strong>\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nDallas, TX\n<br>\nJob Type: Full-time\n<br>\nSalary: $100,000.00 to $120,000.00 /year\n<br>\nOnsite position\n<br><br>\nKey Skills: Excellent experience with SQL programming, Python, R, and Quantitative Analysis and has worked with a Financial domain background.\n<br><br>\nVISA Sponsorship will not be offered now or in the future.\n<br>\nDISYS seeks a Sr. Quantitative Analyst to join one of our client based in Coppell location. The candidate is primarily responsible for designing, developing, testing, and maintaining stress test models or tools and performing Stress Test related analyses.\n<br><br>\nJob Requirements\n<br><br>\n<strong>Qualifications:</strong>\n<br>\n3-5 years of relative experience, ideally in risk analytics, model validation or front office quantitative modeling.\n<br>\nExcellent communication skills, both oral and written.\n<br>\nMust have excellent interpersonal skills and can work in an efficient and organized way and have the ability to work independently and under pressure.\n<br>\nPrior experience in quantitative modeling is preferred and should have a general knowledge about the financial market, products, risk metrics, and VaR modeling /backtesting approaches.\n<br>\nIdeally, the incumbent should be familiar with the regulatory requirements in terms of model risk management.\n<br>\nGood programming skills in database languages such as SQL, R, SAS, Access, VBA, Python etc. Knowing C++ is a plus.\n<br><br>\nA Ph.D. or Master's degree in a quantitative field, preferably in statistics, computer science, economics, financialDigital Intelligence Systems, LLC. is an Equal Opportunity Employer, M/F/D/V. We do not discriminate against any employee or applicant because they inquired about, discussed, or disclosed compensation. Email recruitinghelp @ ********* to contact us if you are an individual with a disability and require accommodation in the application process."}