{"job title": "Data Scientist", "company": "Dirty Lemon Beverages", "city state": "– New York, NY", "rating": "NA", "job description": "Overview<br><br>We're extending our technical products through web &amp; conversation interfaces and eager for a talented Data Scientist to join our team. You should be passionate in identifying customer trends, building bespoke natural language processing &amp; generation, and concepting A/B tests. You'll also get to work with new technologies across our spectrum of customer, support, and logistics systems.<br><br>Responsibilities\n\n<ul>\n <li>Be product-focused and self-motivated</li> <li>Feel comfortable working in a fast paced, iterative environment</li> <li>Be able to work in a collaborative environment with an interdisciplinary team of designers and engineers</li> <li>Build systems for handling natural language understanding and automated responses</li> <li>Craft a framework for A/B testing various ideas across our organization, everything from checkout flows to shipment routing optimizations.</li>\n</ul>\n\nQualifications\n\n<ul>\n <li>Understand the balance of moving fast and writing robust, organized, and easily maintainable code</li> <li>Be curious and excited about the latest technologies, especially in the conversational and consumer spaces</li> <li>Able to quickly and clearly communicate ideas, issues, and results</li> <li>Not afraid to juggle multiple projects on any given day</li> <li>2-4 years of experience in a similar data science role at an e-commerce or similar startup working on A/B testing, data analysis</li> <li>Some experience with building systems for natural language processing (NLP) and language generation (NLG) from robust data sets</li> <li>Ability to code and build in Ruby, Python, and/or NodeJS; interface with both relational and no-SQL databases</li> <li>Bonus for working on chatbots for Messenger, Slack, SMS, or other platforms</li> <li>Interest in working on logistical solutions involving hardware &amp; robotics using RFID, computer vision, and augmented reality</li> <li>Have at minimum a BA/BS in Computer Science, Applied Mathematics, Computer Engineering, or a related field... or not. (Most of us don't.)</li>\n</ul>\n\nBenefits<br><br>Dirty Lemon provides competitive salaries, full medical benefits (including dental &amp; vision), and wellness benefits (including free SoulCycle). We provide opportunities to grow within the company and shape our growth strategy. You’ll enjoy many perks like daily lunches from neighborhood restaurants, weekly team events &amp; dinners, and of course free Dirty Lemon. We also believe in hands-on-experiences with regular visits to our regional offices, production centers, and distribution centers.<br><br>About Dirty Lemon<br><br>Dirty Lemon is a direct-to-consumer beverage distribution company sold exclusively through text message. We embody a startup mindset as we aim to disrupt the food &amp; beverage retail industry through innovative technology, world-class logistics, and delicious products the world over.\n<br><br>\nWe're committed to building a culturally diverse team and strongly encourage applications from women, people of color, and other underrepresented groups in our industry."}