{"job title": "Data Scientist", "company": "DiscoverOrg", "city state": "– Vancouver, WA", "rating": "4.4", "job description": "Do you consider yourself a Data Scientist or want to move into that fast growing space? Do you have a degree and project or professional experience? Do you love statistics and the manipulation of data? Are you interested in Big Data environments? Do you have a solid experience with 'R' , SQL, Python, and Java development? Do any of these words sound familiar to you: Naïve Bayes, Bayesian Graphical Networks, NLP, Random Forest, Linear, Decision Tree, Gaussian, Regression?\n<br><br>\nIf so, you may want to join our expanding data science and machine learning team. Their primary mission is to increase the scale and automation of data acquisition, cleansing, refinement, enrichment, and curation. You will be working on a cross-functional collaborative team. Teamwork is tantamount to success in this environment.\n<br><br>\nWe are looking to add smart and confident people, who know when to seek advice, how to collaborate with a multi-functional team, and how to focus on practical solutions for productization.\n<br><br>\nThe ideal candidate is a collaborative, solutions-oriented thinker with a strong background processing large data sets, applying analytical rigor and statistical methods, and driving toward actionable insights and practical solutions that can make an immediate impact.\n<br><br>\nHere's what a typical day will look like as the Data Scientist:\n<ul>\n<li>Analyse data to gain deep understanding of the problem domains</li><li>Design algorithms for predictive modeling and clustering.</li><li>Develop working prototypes of algorithms.</li><li>Evaluate the performance of various algorithms/models/strategies</li> <li>Communicate and write research and technical reference reports to document not only the successful solutions, but also the failures as well</li><li>Implement results into robust frameworks and tools, and help transition them into into production systems</li><li>Continuously get better - seek out opportunities to further develop our analytical, engineering, and statistical toolkit</li><li>Data/problem analysis</li><li>Research the solution space.</li><li>Proof of concept solutions to demonstrate value to business stakeholders</li><li>Reports covering research results and software requirements</li><li>Software/algorithm development (productization/programming)</li><li>Requirements specifications and technical documents for developed tools and libraries</li>\n</ul>\nYou're likely a great fit for this opportunity if you have:\n<ul>\n<li>BA/BS degree (or equivalent experience) in a strongly quantitative field such as: Statistics, Applied Mathematics, Physics, Operations Research, Computer Science, or Econometrics with 2+ years of analytics experience or equivalent combination of education and experience.</li> <li>Familiarity with wide range of machine learning algorithms, including, NLP, neural networks, kernel methods, dimensionality reduction, bayesian inferencing graph algorithms, and hidden Markov models.</li><li>Strong analytical skills and comfortable working with large data sets</li> <li>Ability to transform data into actionable insights.</li></ul>\n\n<ul>\n<li>Strong programming skills in at least one some or all of the following: Java, R, Python, Spark, Hive, Pig, Hadoop, Scala, Julia, C#, C++</li><li>Experience with SQL and relational databases.</li><li>Experience with unstructured &amp; semi-structured data sources and requisite processing</li> \n</ul>\nWe offer an attractive benefits plan with health benefits that include three medical coverage options, vision and dental coverage – HSA, FSA, 401(k) with employer match, paid parental leave, paid time off, and paid sick leave.<br><br><strong>Why You Should Join DiscoverOrg:</strong>\n\n<ul>\n<li>An <strong>8-time honoree of the Inc. 5000</strong> fastest growing private companies</li><li>Software Industry (SIIA) <strong>2017 Growth Company of the Year</strong></li><li>A three time recipient of the <strong>Deloitte Fast 500</strong> award</li><li>Headquartered in <strong>Vancouver</strong></li><li>Has been <strong>profitable</strong> for the past 12 years</li><li>Was named the <strong>2017 Growth Company of the Year</strong> at the Oregon Technology Awards</li><li>Is the industry bellwether with <strong>award-winning products</strong></li><li>Supported by an award-winning <strong>Learning and Development</strong> team</li><li>Is led by an <strong>EY Entrepreneur of the Year finalist</strong></li><li>Has an impressive <strong>4.6 star rating on Glassdoor</strong></li><li>Is honored to be a <strong>2017 Fortune Magazine Best Workplaces, and</strong></li><li>Finally, is recognized as a <strong>2017 Inc. Magazine Top 50 Best Workplaces</strong></li>\n</ul>\nDiscoverOrg is an Equal Employment Opportunity (EEO) employer. We are committed to promoting a diverse and inclusive work environment. Our policy on equal opportunity and anti-discrimination applies to all terms and conditions of employment.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}