{"job title": "Digital Media Data Scientist - Predictive Modeling - Relocate to Denver", "company": "DISH", "city state": "– Billings, MT", "rating": "2.8", "job description": "<strong>Summary</strong>\n<br>\nDISH is a Fortune 200 company with more than $15 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service Sling TV that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.\n<br>\nNow we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers.\n<br>\nWe are driven by curiosity, pride, adventure, and a desire to win it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.\n<br><br>\nOpportunity is here. We are DISH.\n<br>\n<strong>Job Duties and Responsibilities</strong>\n<br>\nPrimary responsibilities fall into the following categories:\n\n<ul>\n\n <li>Use SAS and SQL development skills to perform data mining/predictive analytics activities: data quality assessment; data profiling; design and development of analytic data sets; statistical analysis and modeling; application of analytic algorithms for predictive modeling, segmentation, forecasting, and optimization; presentation of analytic results; documentation of all activities.</li>\n<li>Work with clients to understand requirements and potential uses for predictive and descriptive analyses</li>\n<li>Provide analytical support for campaign strategy development, campaign test and measurement design and post-campaign analysis;</li>\n<li>Develop and execute advanced queries, selects and marketing reports;</li>\n<li>Provide support for ad hoc analytical projects, including customer-level analysis, segmentation analysis, product affinity and customer profiling analysis; and,</li>\n<li>Develop and implement data mining and analysis education and training programs</li>\n</ul>\n<strong>Skills - Experience and Requirements</strong>\n<br>\nA successful candidate will have the following:\n\n<ul>\n\n <li>Bachelor's degree from four-year college or university; or two years related experience and/or training; and four plus years of experience; or equivalent combination of education and experience.</li>\n<li>Knowledge of advanced modeling and statistical techniques such as logistic regression, neural nets, and clustering</li>\n<li>SQL and database skills in Oracle, Teradata and/or SQL Server</li>\n<li>Solid experience with data mining methodologies and tools such as SAS Enterprise Miner, R, or similar platforms</li>\n<li>Experience with both technical and non-technical presentation of analytic results.</li>\n</ul>"}