{"job title": "Data Scientist", "company": "DomainTools", "city state": "– Seattle, WA, US", "rating": "4.8", "job description": "<div>\nDoes the idea of diving head first into one of the <strong>most comprehensive datasets</strong> of the internets metadata and infrastructure excite you? Do you want to to help win the battle against cyber crime by building predictive solutions for DomainTools threat intelligence platform?</div><br>\n<div>\nAs a Data Scientist at <strong>DomainTools</strong>, you will help us improve our ability to <strong>predict</strong> malicious domains, <strong>identify</strong> patterns of malicious activity, and <strong>advance</strong> our products &amp; services. You will collaborate with people across the entire organization to help identify new opportunities for predictive solutions, build prototypes, and work closely with product management and engineering to deliver them to the customer. Your work will inform both the R&amp;D and product roadmap &amp; contribute to <strong>primary research</strong> delivered to our customers and marketplace.</div><br>\n\n<div><strong>Who you are:</strong></div><ul>\n<li>\nPhD or MS in Computer Science, Mathematics, Statistics, or related field with a focus on data science and 3+ years work experience in data science and predictive modeling</li>\n</ul>\n\n<div>\n<em>Or</em></div>\n\n<ul>\n\n<li>\nBS in Computer Science, Mathematics, Statistics, or related field and 8+ years work experience in data science and predictive modeling</li>\n</ul><br>\n\n<div><strong>What you bring:</strong></div><ul>\n<li>\nYou are self-directed, <strong>research-focused</strong>, and excited by finding new patterns in data</li>\n<li>\nIn-depth knowledge of <strong>machine learning</strong> algorithms, both supervised and unsupervised, and statistical modeling methods</li>\n<li>\nAlgorithm and model optimization (hyper-parameter tuning; feature engineering, extraction, and selection)</li>\n<li>\nExperience building analytical pipelines with distributed, large scale data processing platforms</li>\n<li>\nAble to <strong>communicate</strong> your research and finding effectively across all levels of the company, as well as externally to customers and the cyber security community</li> \n</ul><br>\n\n<div><strong>Nice to haves:</strong></div><ul>\n<li>\nExperience working in <strong>CyberSecurity</strong> (Understanding of cyber kill chain model, threat actors and their TTPs)</li>\n<li>\nUnderstanding of IP networking, DNS, and Whois records</li>\n<li>\nExperience with actual \"Big Data\" datasets on NoSQL and/or RDBMS</li>\n<li>\nExperience designing data visualizations</li>\n<li>\nPython and/or Scala experience, including Jupyter Notebooks</li>\n<li>\nHive, Spark, MapReduce, R, Pandas, scikit-learn</li>\n</ul><br>\n\n<div><strong>What you will do:</strong></div><ul>\n<li>\nIdentify new complementary datasets</li>\n<li>\nExplore, analyze, and transform very large datasets</li>\n<li>\nDesign and build new models, and/or enhance existing models</li>\n<li>\nEvaluating effectiveness of models over time</li>\n<li>\nShare your research across the company and with our customers in the form of articles, papers, and presentations</li>\n<li>\nGenerate <strong>new intellectual property</strong></li>\n<li>\nThis position is located in our Seattle office. There will be occasional travel to conferences.</li>\n<li>\nMust be authorized to work in the United States.</li>\n</ul>\n\n<br>\n<div>\n<strong>DomainTools</strong> helps security analysts turn threat data into threat intelligence. We take indicators from your network, including domains and IPs, and connect them with nearly every active domain on the Internet. Those connections inform risk assessments, help profile attackers, guide online fraud investigations, and map cyber activity to attacker infrastructure. Fortune 1000 companies, global government agencies, and leading security solution vendors use the <strong>DomainTools</strong> platform as a critical ingredient in their threat investigation and mitigation work.</div><br>"}