{"job title": "Data Scientist", "company": "Domino's", "city state": "– Ann Arbor, Michigan", "rating": "3.4", "job description": "Dominos, which began in 1960 as a single store location in Ypsilanti, MI, has had a lot to celebrate lately: were a reshaped, re-energized brand of honesty, transparency and accountability not to mention, great food! In the rise to becoming a true technology leader, the brand is now consistently one of the top five companies in online transactions and over 60% of our sales in the U.S. are taken through digital channels. The brand continues to deliver the dream to local business owners, 90% of which started as delivery drivers and pizza makers in our stores. Thats just the tip of the icebergor as we might say, one slice of the pie! If this sounds like a brand youd like to be a part of, consider joining our team!\n<br><br>\nDid you know that over half of the team members at the Domino's headquarters in Ann Arbor, MI, work in technology and/or analytics?\n<br><br>\nTo continue building on our success in the food, digital and delivery space, Dominos is growing their team of data scientists to develop machine learning and AI applications to make our team members more efficient and ensure our consumers have the best pizza experience every time they choose to order from Dominos.\n<br><br>\nThe team will have access to a wide breadth of data generated by our current platforms, as well as new sensor data that the team will work to implement and collect. The team will work closely with our application development teams to deploy these solutions into Dominos customer and employee applications.\n<br><br>\n<strong><u>RESPONSIBILITIES AND DUTIES</u></strong>\n<br><br>\n<strong>(75%) Architect solutions to solve problems using machine learning and AI</strong>\n<br><br>\n<strong>(20%) Provide guidance, coaching and support</strong>\n<br><br>\n<strong>(5%) Rapid experimentation, prototyping and demonstration of new technology, tools, and techniques</strong>\n<br><br>\n<strong><u>MINIMUM QUALIFICATIONS</u></strong>\n<ul>\n<li>Masters degree (or Bachelors degree with equivalent experience) in a quantitative science such as statistics, mathematics, computer science, engineering, etc.</li><li>Minimum of two years of experience in enterprise database environments</li><li>Advanced knowledge of SQL</li><li>Proficient with at least one scripting and one programming language, e.g. R, Python, Java, C/C++</li><li>Experience with a wide variety of ML techniques and algorithms</li><li>Experience training models with at least one deep learning framework (TensorFlow, CNTK, Torch, Caffe, etc.)</li><li>Experience with data integration and ETL</li><li>Excellent project management skills</li>\n</ul>"}