{"job title": "Data Scientist", "company": "Domo", "city state": "– Salt Lake City, UT", "rating": "4.3", "job description": "<div><div><strong>Position Summary:</strong>\n<br><br>\nDomo is changing the way Executives manage their business. Pivotal within the most innovative business management platform. As a Data Scientist at Domo, you will help implement the applicable big data systems and help create and implement algorithms in relevant statistical inference.\n<br><br>\n<strong>Team Culture:</strong>\n\n<ul>\n<li><strong>Work</strong> <strong>–</strong>  Are you someone who has ideas and will stop at nothing until those ideas are made a reality?</li></ul>\n\n\n<ul>\n<li><strong>Fight</strong> <strong>–</strong>  Domo looks for individuals who can drive their own ideas forward and who can also support the initiatives within their team.</li></ul>\n\n\n<ul>\n<li><strong>Innovate –</strong>  Are you someone that can’t stand the status-quo? Do you improve upon the ideas of others?</li></ul>\n\n\n<ul>\n<li><strong>Create –</strong>  Like to build? Do you have a creative drive? Domo has a culture that embraces creativity.</li></ul>\n\n\n<ul>\n<li><strong>Serve –</strong> We’re all about the customer. We expect you to be relentless in your defense of the customer experience. We’ll do the same.</li>\n</ul>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Understand existing business flow and website features, dive into the underlying data, apply relevant Data Mining techniques and/or Machine Learning algorithms and propose data analytic product to improve the website intelligence</li>\n\n<li>Implement the applicable Machine Learning or statistics-based algorithm for prediction and optimization and deliver the trained model to production</li>\n\n<li>Create and implement algorithms in relevant statistical inference, graph, and network analysis, natural language processing with open source tools and libraries.</li>\n\n<li>Design, build and support algorithms of data transformation, conversion, computation on Hadoop, Spark and other distributed Big Data Systems</li>\n\n<li>Design and support efficient storage and retrieval of Big Data</li>\n</ul>\n<strong>Job Requirements:</strong>\n\n<ul>\n<li>Bachelor’s Degree. (Preferred Masters Degree or above in Data Science, Statistics, Computer Science, Math, or similar quantitative field) or equivalent work experience</li> \n\n<li>5+ years of professional experience with machine learning, statistical analysis, predictive modeling, and time series analysis.</li>\n\n<li>Strong data discovery, visualization, and analysis skills.</li>\n\n<li>Experience with big data using technologies like Spark, Hadoop, Pig, and Hive.</li>\n\n<li>Previous hands-on exposure to statistical software packages like R, SciPy, Matlab, SPSS, SAS).</li>\n\n<li>Experience with a variety of relevant data manipulation languages (Python, Java, SQL)</li>\n\n<li>Comfort with working in a Linux environment.</li>\n\n<li>A genuine desire to organize data and make it accessible with the technical skills to bring your ideas to reality</li>\n\n<li>An enjoyment in working with teammates to produce quality outcomes.</li>\n</ul>\n\n</div>\n</div><div></div>"}