{"job title": "Data Scientist", "company": "Donnelley Financial Solutions", "city state": "– Chicago, IL", "rating": "2.7", "job description": "<div><p>Donnelley Financial Solutions (NYSE: DFIN) provides software and services that enable clients to communicate with confidence in a complex regulatory environment. With 3,500 employees in 61 locations across 18 countries, we provide thousands of clients globally with innovative tools for content creation, management and distribution, as well as data analytics and multi-lingual translations services. Leveraging advanced technology, deep-domain expertise and 24/7 support, we deliver cost-effective solutions to meet the evolving needs of our clients.</p><div><p></p><p>\n</p><p></p><p>DFIN is advancing data science capabilities in machine learning and artificial intelligence. We are building AI and ML solutions utilizing both structured and unstructured data for supervised, unsupervised, and reinforced learning. We are actively looking for a candidate to lead our data science efforts in this space. This candidate will work with our functional teams to understand the problem, and work with our data engineering teams to build the solutions through ML pipelines and algorithms.</p>\n<p></p><p></p><p></p><p>Requirements\n</p><p></p><ul><li>Have experience in NLP of unstructured text documents to automatically tag via machine learning.</li><li>Unstructured feature extraction using Machine Learning (deep learning, multi-layer neural networks) </li><li>Building statistical models using python (NumPy, SciPy, etc.) </li><li>Data manipulation with Pandas</li><li>Have used Jupyter Notebook for consuming/sharing ML code</li><li>Deep learning workflows with Tensorflow, Pytorch, or other similar products</li><li>Natural Language Processing with Python Natural Language Toolkit (NLTK or SpaCy)</li><li>Bachelors degree in STEM</li></ul>\n<p></p><p></p></div><p>It is the policy of Donnelley Financial Solutions to select, place and manage all its employees without discrimination based on race, color, national origin, gender, age, religion, actual or perceived disability, veteran's status, actual or perceived sexual orientation, genetic information or any other protected status. </p><p>If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access jobs.dfsco.com as a result of your disability. You can request a reasonable accommodation by sending an email to AccommodationRequests@dfsco.com.</p></div>"}