{"job title": "Data Scientist - Analytics", "company": "DoSomething.org", "city state": "– New York, NY", "rating": "4.2", "job description": "Job: Data Scientist - Analytics\n<br><br>\nReports to: Director of Analytics\n<br><br>\nStart Date: ASAP\n<br><br>\n<strong>DoSomething.org is a movement to create the most socially active generation in history.</strong>\n\n<ul>\n<li><strong>We fight for our members every single day.</strong> We care deeply about activating millions of young people around the world to make impact in their communities.</li>\n<li><strong>We believe in young people.</strong> We believe all young people have the agency to create social change and we provide them with the guidance to make it happen.</li>\n<li><strong>We dont hire just anybody.</strong> We work hella hard, we move super fast, and were a bunch of weirdos. We want people who get excited to come to work at our dynamic office every day.</li>\n<li><strong>We genuinely stand behind who we are and what we do.</strong> No faking it here. Everyone on our staff has their own why for coming to work every day. What will yours be?</li>\n</ul>\nThe data scientists role at DoSomething.org is to be the technical powerhouse that fuels and informs strategy discussions across the organization, <strong>allowing us to most effectively create the most socially and civically engaged generation of young people, ever.</strong> The data teams job is to create and analyze large and rapidly evolving data sets, and the data scientist is expected to deliver technical products to enable and perform this work. A successful candidate will possess strong analytical and programming skills alongside a steadfast sense of curiosity and a positive attitude. Further, the best candidate will have a passion for using their skills to make a real and measurable impact on young people and society as a whole.\n<br><br>\n<strong>What you'll do:</strong>\n\n<ul>\n<li><u>Data Analysis and Model Building</u>\n\n\n<ul>\n<li>Work with large, complex data sets to assess campaigns and product performance</li>\n<li>Write scalable, portable scripts to automate querying and analysis</li>\n<li>Create and maintain reports/dashboards to present findings to non-technical staff via Looker or Notebooks</li>\n<li>Build statistical models to predict outcomes of interest and forecast KPIs</li>\n<li>Help us expand more into the world of machine learning to build the best performing models possible</li>\n</ul>\n\n</li>\n<li><u>Strategy and Implementation</u>\n\n\n<ul>\n<li>Utilize data to advise product development with cross-functional teams</li>\n<li>Contribute to development DoSomething.orgs long term data strategy</li>\n<li>Work closely with the data engineering team to build derived tables that enable analysis</li>\n<li>Build out a monitoring framework to ensure our pipelines are functional and working as expected</li>\n</ul>\n\n</li>\n</ul>\n<strong>What we're looking for:</strong>\n\n<ul>\n<li><strong>Strong sense of curiosity.</strong> You have the desire to learn new skills and understand complex problems fast.</li>\n<li><strong>Ability to explain analytical outcomes in basic terms.</strong> You understands why making data accessible to the larger organization is important, and don't want to be a gatekeeper to this pertinent information</li>\n<li><strong>2-3 years of experience</strong> with SQL (any variant is fine, though we use PostgreSQL)</li>\n<li><strong>1-3 years of experience</strong> with R or Python</li>\n\n<strong></strong><li><strong>Experience with the following:</strong>\n\n\n<ul>\n<li>BI tool (Tableau/Looker/PowerBI)</li>\n<li>working with non-relational data</li>\n<li>data warehousing technology and environments (a plus, not a non-negotiable)</li>\n<li>ETL (a plus, not a non-negotiable)</li>\n</ul>\n\n</li>\n<li><strong>Well-rounded teammate.</strong> You are currently learning a new skill or adopting a new hobby that has nothing to do with data science</li>\n</ul>\n<strong>Other Notes:</strong>\n\n<ul>\n<li>Data is everywhere. If youve worked with it at scale, apply, even if you dont meet every single qualification. Past successful candidates have come with backgrounds in CS, statistics, mathematics, and economics, although these are not required.</li>\n</ul>\n<strong>The Perks.</strong>\n\n<ul>\n<li>3 weeks vacation plus the week between Christmas and New Years (plus Summer Fridays from Memorial Day to Labor Day!). And your birthday, Valentines day, and a half-day on Halloween. If youre in costume. Seriously.</li>\n<li>An inclusive office environment, a gong, brownie bake-offs, and the best coworkers you could ask for.</li>\n<li>Medical and dental premiums fully covered by us. Mhmm. You read that right.</li>\n<li>Five (or six? Were losing count.) different ways of making coffee.</li>\n<li>An incredibly compelling reason to wake up and make it to work every day.</li>\n<li>DoSomething.org is an equal opportunity employer. Obviously.</li>\n</ul>\n<em>Please, no calls.</em>\n<br><br>\n------------------------------------------------\n<br><br>\nDoSomething.org and DoSomething Strategic (we, us) are committed to protecting and respecting your privacy. This policy explains when and why we collect personal information on candidates, and how we keep it secure.\n<br><br>\n<em>Who are we?</em>\n\n<ul>\n<li>DoSomething.org is one of the largest organizations in the world focused on young people and social change. DoSomething Strategic is the consulting arm of DoSomething.org. Our 6 million+ members take action, online and offline, to better their communities by participating in one of our 250+ cause campaigns.</li>\n</ul>\n<em>How and why we collect data from you.</em>\n\n<ul>\n<li>We collect and retain data that is included in your job application. This includes your full name, contact information, and any personal information disclosed in your resume, cover letter, and other supplemental application materials.</li>\n<li>Data is collected for evaluation criteria when seeking employment at DoSomething</li>\n<li>We will only use your data for what was originally intended -- for purposes of seeking and gaining employment at DoSomething. Your data will not be recycled for marketing emails or to sell to third parties.</li>\n</ul>\n<em>How long do we retain this data?</em>\n\n<ul>\n<li>DoSomething will retain candidate profiles for 3 years.</li>\n<li>Annually on August 1, candidate profiles from 3+ years prior will be entirely deleted from our system.</li>\n</ul>\n<em>Is your data secure?</em>\n\n<ul>\n<li>JazzHR maintains secure job board pages. Job boards will default to HTTPS. Additionally, if we were to terminate our contract with JazzHR our candidate data is deleted from JazzHRs systems in accordance with JazzHRs Terms of Service.</li>\n</ul>"}