{"job title": "Senior Statistics Data Scientist", "company": "Dow Chemical", "city state": "– Indianapolis, IN", "rating": "3.7", "job description": "Corteva Agriscience, Agriculture Division of DowDuPont has an exciting opportunity for a Statistician. This position, Senior Statistics Data Scientist, will join the Mathematics and Statistics Team within Data Science and Informatics R&amp;D. The position is located in Indianapolis, IN.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n<br><br>\nThe successful candidate will a) work with research partners to advance discovery, characterization, and development of agricultural chemical molecules (b) develop and apply state of the art statistical methods in the area of predictive toxicology and safety (c) develop advanced analytics capabilities for use by partners in research, production, and services in crop protection and seeds research. In addition, the successful candidate will be responsible for improving statistical awareness of partners and will work closely with them to carefully define research questions, design experiments and optimal study procedures. Working in a diverse group of data scientists, the candidate will also have opportunities to learn and apply modern machine learning and data science techniques to relevant problems.\n<br><br>\n<strong>Competencies:</strong>\n\n\n<ul>\n<li>The ideal candidate must have strong experience in applying regression models (e.g. linear regression, generalized linear models, mixed models, non-linear models), curve fitting, and other general statistical methods.</li>\n<li>Experience in statistical programming using R, SAS, Python, or MATLAB with strong experience in at least one of these is required.</li>\n<li>Written and verbal communication skills and the ability to successfully collaborate and lead projects with colleagues from diverse technical backgrounds is required.</li>\n<li>Critical thinking and strong problem solving skills are also required.</li>\n<li>Prior Experience in dose-response modeling is preferred.</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Ph.D. degree in Statistics, Biostatistics, or a related field and three or more years of relevant experience is required.</li>\n<li>Experience in statistical programming using R, SAS, Python, or MATLAB with strong experience in at least one of these is required.</li>\n<li>Strong experience in applying regression models (e.g. linear regression, generalized linear models, mixed models, non-linear models), curve fitting, and other general statistical methods.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Prior Experience in dose-response modeling is preferred.</li>\n<li>Experience in app development using R Shiny is preferred.</li>\n<li>Experience in Predictive Analytics/Machine Learning is a plus.</li>\n</ul>\n\nWe are excited to announce that Corteva Agriscience is the name of the new Agriculture Division of DowDuPont. We are bringing together DuPont Crop Protection, DuPont Pioneer and Dow AgroSciences to create a market-shaping, standalone agriculture company with leading positions in seed technologies, crop protection and digital agriculture. We will work across the global agriculture value chain to create a more efficient food system.\n<br><br>\nAt Corteva Agriscience, we seek to enrich the lives of those who produce and those who consume. This means we will help rejuvenate the agricultural ecosystem to support people and the planet and to ensure progress for generations to come.\n<br><br>\n<strong>About DowDuPont:</strong>\n<br><br>\nDowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty products sectors that will lead their respective industries through productive, science-based innovation to meet the needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n<br><br>\nThe positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies. Information on the division alignment will be provided during the recruitment process.\n<br><br>\n<strong>Dow Offers:</strong>\n\n\n<ul>\n<li>Competitive salaries and comprehensive benefits</li>\n<li>An annual variable pay program that rewards team and individual performance while sharing success across the company</li>\n<li>Employee stock ownership - and the commitment to long-term success that it brings</li>\n<li>On-going learning opportunities within a diverse, inclusive and rewarding work environment</li>\n<li>Career experiences that can span different Dow businesses and functions with opportunities for personal and professional growth</li>\n<li>The chance to work within a global company and interact with colleagues from around the world</li>\n<li>Opportunities that spark your imagination and ignite your passion to help others</li>\n<li>Dow is an Equal Employment Opportunity Employer</li>\n</ul>\n\nAs part of our dedication to the diversity of our workforce, Dow is committed to Equal Employment Opportunity without regard for race, color, national origin, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity, or religion. We are also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at http://www.dow.com/en-us/contact-us, you may call us at 1 800-523-3945 and select Option 1, or send a facsimile request to 1 989-636-3674.<br><br>SDL2017"}