{"job title": "Junior Data Scientist", "company": "Dow Jones", "city state": "– NEW YORK, USA", "rating": "3.4", "job description": "<strong>Job Description:</strong>\n<br><br>\n<strong>Junior Data Scientist, Membership Analytics</strong>\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\n<strong>We are looking for a junior data scientist to join The Wall Street Journals membership analytics team. The Wall Street Journals mission is to present factual, fair information that offers both nuance and balance to readerswe believe markets, economics, and business are the forces that animate our world, the jobs we have, and the products we buy. Our membership analytics team is committed to supporting great business journalism through the improvement of our products and the growth of our subscription business.</strong>\n<br><br>\n<strong>We obsess over building best-in-class data products, that bring applied research methods to all stages of the customer lifecycle. This includes developing innovative modeling approaches to inform product decisions and member engagement strategies.</strong>\n<br><br>\n<strong>This role will require exceptional visualization and data wrangling skillsas well as an obsession with great news products. Some background in machine learning applications, big data architecture, and ecommerce analytics is a plus. You will assist in the management and execution of large scale data projects and support daily reporting on both our business and our journalism.</strong>\n<br><br>\n<strong>What youll do:</strong>\n\n<ul>\n<li> <strong>Source and query data required for both ongoing business intelligence efforts and larger scale data science projects.</strong></li>\n\n<li> <strong>Draw meaningful insights from large datasetsfind creative ways those insights can be used to both sell subscriptions and make the experience of reading The Wall Street Journal better.</strong></li>\n\n<li> <strong>Assist in the management of long-term data projects. Effectively communicate with business, product, and newsroom stakeholders, identifying requirements and developing success metrics for the development and deployment of machine learning applications.</strong></li>\n\n<li> <strong>Use visualization tools to present complex data in a simple, engaging manner.</strong></li>\n\n<li> <strong>Identify opportunities for new data projects. Ask smart questions, diagnose the real problem, and develop a long-term solution.</strong></li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li> <strong>You have a bachelors degree in computer science, information systems, mathematics, statistics, or a related quantitative discipline. Applicants with some data-related expertise and a professional background in media are also encouraged to apply.</strong></li>\n\n<li> <strong>1-2 years professional experience at a media company is preferred. An enthusiasm for The Wall Street Journal and an understanding of the product is a must.</strong></li>\n\n<li> <strong>You have an entrepreneurial attitude toward work and sweat the details.</strong></li>\n\n<li> <strong>You have experience using analytics tools (SQL, Tableau, Excel) and an interest in more advanced topics in analytics (machine learning, artificial intelligence).</strong></li>\n\n<li> <strong>Coding skills (i.e. R, Python) and experience in building web applications is a plus.</strong></li>\n</ul>\n<strong>Dow Jones</strong> , Making Careers Newsworthy\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status. <strong>EEO/AA/M/F/Disabled/Vets</strong> .\n<br><br>\nDow Jones is committed to providing reasonable accommodation for qualified individuals with disabilities, in our job application and/or interview process. If you need assistance or accommodation in completing your application, due to a disability, please reach out to us at TalentResourceTeam@dowjones.com . Please put Reasonable Accommodation\" in the subject line.\n<br><br>\nBusiness Area: WSJ - CUSTOMER GROUP\n<br><br>\n<strong>About Us</strong>\n<br><br>\nDow Jones is a global provider of news and business information, delivering content to consumers and organizations around the world across multiple formats, including print, digital, mobile and live events. Dow Jones has produced unrivaled quality content for more than 125 years and today has one of the worlds largest news gathering operations globally. It produces leading publications and products including the flagship Wall Street Journal, Americas largest newspaper by paid circulation; Factiva, Barrons, MarketWatch, Financial News, DJX, Dow Jones Risk &amp; Compliance, Dow Jones Newswires, and Dow Jones VentureSource.Dow Jones is a division of News Corp (NASDAQ: NWS, NWSA; ASX: NWS, NWSLV).\n<br><br>\nIf you require assistance in completing the online application, please contact the Talent Management team for Application Help at TalentResourceTeam@dowjones.com\n<br><br>\nJob<em>Req</em>12873"}