{"job title": "Data Manager", "company": "Doximity", "city state": "– San Francisco, CA", "rating": "4.2", "job description": "Doximity is transforming the healthcare industry. Our mission is to help doctors save time so they can provide better care for patients.\n<br><br>\nWe value diversity in backgrounds and in experiences. Healthcare is a universal concern, and we need people from all backgrounds to help build the future of healthcare. Our data science team is deliberate and self-reflective about the kind of data team and culture that we are building, seeking data scientists and engineers that are not only strong in their own aptitudes but care deeply about supporting each other's growth. We have one of the richest healthcare datasets in the world, and our team brings a diverse set of technical and cultural backgrounds.\n<br><br>\nDoximity's social network has over 70% of US doctors as members. We recently launched a newsfeed which helps physicians navigate the latest practice-changing medical literature, parsing through millions of scientific studies while personalizing content to their patient base and every stage of their medical career. We're looking for a deep learning expert to help our data science and engineering teams build models in support of the newsfeed, combining metadata from our clinician social graph with text-based features.\n<br><br>\n<strong>How you'll make an impact:</strong>\n\n<ul>\n<li>Focus on the continued growth of our data team by helping with hiring, on-boarding and training.</li>\n<li>Build training and learning programs to help with the continued education of members of the data team.</li>\n<li>Help with selection of tooling and improvements to development processes.</li>\n<li>Continue to focus on technical projects involving analysis, reporting and ML pipelines.</li>\n</ul>\n<strong>What we're looking for:</strong>\n\n<ul>\n<li>4+ years of industry experience and B.S./M.S. in Computer Science, Engineering, Statistics, or other relevant technical field.</li>\n<li>4+ years experience managing Data projects and teams of 6 or more people.</li>\n<li>Passion to mentor and manage data team members in their continued education and growth.</li>\n<li>Fluent in SQL, Python and Apache PySpark.</li>\n<li>Solid engineering skills to build scalable solutions and help automate data processing challenges.</li>\n<li>Expert knowledge of probability and statistics (e.g., experimental design, optimization, predictive modeling).</li>\n<li>Excellent problem-solving skills and ability to connect data science work to product impacts.</li>\n</ul>\n<strong>About Doximity</strong>\n<br><br>\nWe're thrilled to be named the Fastest Growing Company in the Bay Area, and one of Fast Company's Most Innovative Companies. Joining Doximity means being part of an incredibly talented and humble team. We work on amazing products that over 70% of US doctors (and over one million healthcare professionals) use to make their busy lives a little easier. We're driven by the goal of improving inefficiencies in our $2.5 trillion U.S. healthcare system and love creating technology that has a real, meaningful impact on people's lives. To learn more about our team, culture, and users, check out our careers page, company blog, and engineering blog. We're growing fast, and there's plenty of opportunity for you to make an impactjoin us!\n<br><br>\n<em>Doximity is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.</em>"}