{"job title": "Senior Data Modeler", "company": "Droisys Inc", "city state": "– Las Vegas, Nevada", "rating": "3.1", "job description": "Are you open for Employment Enhancement Experience with a high job satisfaction, better pay, longer stability, innovative technology and enhancements of your skills? Let us connect and discuss the possibilities with your expectations, location priorities and targeted skills to find your next dream project. I am looking for Senior Data Modeler to join a huge project in Las Vegas, NV Area. Here are the job details: Job Title: Senior Data Modeler Job Location: Las Vegas, NV [100 Percent Onsite] Duration: 12 Months [Long Term Project with Potential Extensions] Job Summary Data Modeler is expected to work with Business Analysts, Data Analysts, DBAs, ETL and BI developers to create conceptual, logical and physical data models for the Enterprise Data Warehouse and other Data and Analytical Assets. This role requires strong knowledge of Data Warehouse modeling best practices as well as a working knowledge of BI stream to be able to effectively model the data for ease of reporting. Data Warehouse industry expert with knowledge of and interest in leading edge BI best practices. Strong ETL Analysis experience for use in complex and high-volume data warehouse environments. Prefer experience in RealTime Change Data Capture (CDC), Metadata Manager, Profiling. We are looking for a Data Modeler with 5+ years of experience in Data Modeling and Analysis along with strong SQL. Experience in performing data mining and data analytics, on data-sets and data-marts Good SQL experience, SQL Queries, UNIX writing skills. Experience in programming, in particular to drive analysis tools and prepare data marts, including expertise in writing Teradata Queries. The ability to assist with the creation and delivery of a data analytics system, with cross functional stakeholders and time-sensitive client deliverables. Experience in data profiling and writing source to target mappings. Thanks &amp; Regards, Abhay Saini Client Success Director, Droisys Inc. Office : ************** Ext 214 || Direct: ************** Email: ******************* | *************** Ten-Time Inc. 5000 Honoree (2008-2017) - provided by DiceBusiness Intelligence,Data modeling,Data Warehouse,Data Modeler"}