{"job title": "Data Scientist", "company": "Dropbox", "city state": "– San Francisco, CA", "rating": "4.2", "job description": "Company Description<br><br>Dropbox is a leading global collaboration platform that's transforming the way people work together, from the smallest business to the largest enterprise. With more than 500 million registered users across more than 180 countries, our mission is to unleash the worlds creative energy by designing a more enlightened way of working. \n<br><br>\nHeadquartered in San Francisco, CA, Dropbox has more than 12 offices around the world.<br><br>Team Description<br><br>Our Business Strategy &amp; Operations team sets and drives key business initiatives across the company. We complement and support product, engineering, sales, and marketing teams across three critical areas: corporate and business unit strategy, business planning and sales operations, and business systems and tools development.<br>\n<div>\nRole Description</div>\n\n<ul>\n<li>Work on high priority initiatives including (but not limited to) account prioritization, account prospecting, and opportunity scoring</li><li>Instrumentation of propensity modeling: query and process big data: integrate volumes of data from multiple internal and external sources and into Dropboxs systems of record</li> <li>Partner closely with data scientists to develop internal and external data sources to be used in propensity modeling and predictive analytics</li><li>Implement propensity models into Dropboxs revenue systems of record, track their effectiveness, analyze &amp; report on findings</li>\n</ul>\n\n<div>\nResponsibilities</div>\n\n<ul>\n<li>Establish scaleable revenue prospecting initiatives using Dropbox internal data</li> <li>Conceptualize, design and build data-fueled insights to help Dropbox improve analytics for prospects and customers. Examples include:</li><li><strong>Benchmarking</strong>: Develop comparative indexes that measure how companies compare to industry peers in key performance and usage metrics</li><li><strong>Recommendation engine</strong>: Use real-time analytics to recommend ways in which customers can maximize adoption and usage of Dropbox</li><li>Work closely with other team members and the business to further develop metrics, KPIs, and insight that provides performance improvement</li>\n</ul>\n\n<div>\nRequirements</div>\n\n<ul>\n<li>Bachelors degree or higher in computer science, applied statistics, economics, etc.</li><li>5 - 8 years experience as strategic project/program lead in management consulting, B2B software (ideally SaaS) or a high-growth technology firm</li><li>Experience working with very large semi-structured data sets and integrating them into systems of record</li><li>Good SFDC skills and ability to develop analysis based on CRM data in a scalable manner</li><li>Ability to solve complex analytical problems using quantitative approaches with a unique blend of analytical, mathematical and technical skills</li><li>Highly detailed-oriented and exceptional organizational and follow-through skills a must</li><li>Strong data-oriented scripting (e.g. SQL) and statistical programming (e.g., R or python)</li><li>Excellent judgment and creative problem solving skills</li><li>Excellent at planning and project management ability to look ahead to meet regular deadlines and prevent last minute fire drills</li><li>Strong desire to take initiative; thrive on change and comfortable with ambiguity</li>\n</ul>\n\n<div>\nBenefits and Perks</div>\n\n<ul>\n<li>100% company paid individual medical, dental, &amp; vision insurance coverage</li><li>401k + company match</li><li>Market competitive total compensation package</li><li>Free Dropbox space for your friends and family</li><li>Wellness Reimbursement</li><li>Generous vacation policy</li><li>10 company paid holidays</li><li>Volunteer time off</li> <li>Company sponsored tech talks (technology and other relevant professional topics)</li>\n</ul>\nDropbox is an equal opportunity employer. We are a welcoming place for everyone, and we do our best to make sure all people feel supported and connected at work. A big part of that effort is our support for members and allies of internal groups like Asians at Dropbox, BlackDropboxers, Latinx, Pridebox (LGBTQ), Vets at Dropbox, Women at Dropbox, ATX Diversity (based in Austin, Texas) and the Dropbox Empowerment Network (based in Dublin, Ireland)."}