{"job title": "Associate Data Scientist", "company": "DST Systems, Inc.", "city state": "– Kansas City, MO", "rating": "2.8", "job description": "The speed of technology. The influx of data. Shifting regulations. Increased customer expectations.\n<br><br>\nThat's where you'll find DST, helping clients find opportunity in ever-changing and complex customer, business, and regulatory requirements. Mastering complexity is a constantly changing and evolving challenge one that only a few people can embrace and thrive upon.\n<br><br>\nIf you see your opportunity in complexity, then we are the right fit for you.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nOrganizational Overview\n<br><br>\nAs an Associate with DST Pharmacy Solutions, you will be part of an organization that promotes better health outcomes for consumers through clinical and technological innovations. We accomplish this by leveraging the robust technology foundation and powerful analytic resources that are the core of DST, with industry leading clinical expertise and strategic pharmacy and healthcare solutions. You will join a team that is redefining the value of pharmacy in healthcare through the integration of advanced analytics, clinical insights and transformative digital capabilities.\n<br><br>\nRole Overview\n<br><br>\nThis position is responsible for deep data analysis, for creating efficient algorithms and developing predictive systems at Pharmacy Solutions. It will require strong working relationships with internal business teams, product owners and information technology teams to identify and develop analytic metrics and tools that can complement the Pharmacy Solutions product suite. This position will contribute directly to the features and capabilities deployed in our current and new applications. It will require the presentation and discussion of findings, opportunities or solutions to business teams, product owners and senior leadership.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Building efficient machine learning models to solve or automate various business problems.</li>\n<li>Developing strong relationships with business teams and product owners.</li>\n<li>Extracting, cleansing, mining, analyzing and visualizing healthcare data.</li>\n<li>Clear concise presentation of findings/recommendations to business teams and senior leadership.</li>\n<li>Participating and assisting in business conversations to identify potential use cases and business opportunities for the application of data science and data analysis.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's degree or 2 years of equivalent work-related experience</li>\n<li>Strong in working with stakeholders to both gather requirements and present results</li>\n<li>Strong in data mining and data visualization</li>\n<li>Ability to handle multiple competing priorities in a fast-paced environment</li>\n<li>Experience with various math/statistics methodologies and algorithms</li>\n<li>Strong in at least 2 code bases with 1 being Python</li>\n<li>Healthcare and Population Health knowledge is a preferred</li>\n<li>Experience deploying and maintaining machine learning models in a production environment is a plus</li>\n</ul>\n\n<strong>Location:</strong>\n<br><br>\nKansas City Missouri\n<br><br>\nDST is an equal opportunity employer and values a diverse and inclusive workplace. All qualified candidates will receive consideration for employment without regard to age, race, color, religion, genetic information, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. For more information about Equal Opportunity in the Workplace please click here and here. DST is committed to working with and providing reasonable accommodation to job applicants with disabilities. If you are a qualified individual with a disability and need an accommodation or accessibility assistance to complete the online application, please contact us at PeopleCenter@dstsystems.com for assistance."}