{"job title": "Associate Data Science Consultant", "company": "Duke Energy Corporation", "city state": "– Charlotte, NC", "rating": "3.7", "job description": "More than a career - a chance to make a difference in people's lives.\n<br><br>\nBuild an exciting, rewarding career with us help us make a difference for millions of people every day. Consider joining the Duke Energy team, where you'll find a friendly work environment, opportunities for growth and development, recognition for your work, and competitive pay and benefits.\n<br><br>\n<strong>Position Summary</strong>\n\n\n<ul>\n<li>Help translate data into business insights and valuable actions</li>\n<li>Discover business narratives told by the data and present them to other scientists, business stakeholders, and managers at various levels.</li>\n<li>Develop and test heuristics</li>\n<li>Create and run models</li>\n<li>Perform data exploration and data mining</li>\n<li>Create business intelligence, dashboards, visualizations, and/or other advanced analytics reports to adequately tell the business narrative and offer recommendations that are practiced, actionable, and have material impact, in addition to being well-supported by analytical models and data.</li>\n</ul>\n\n<strong>Responsibilities</strong>\n<br><br>\nPartner with Business Clients, establish professional relationship, and communicate with analytics clients in order to understand business needs.\n<br><br>\nSolve problems for Stakeholder, and under the supervision of senior data scientists, construct problem frames in order to understand the analysis context and scope that will provide timely, useful results.\n<br><br>\nWork in Project Teams and participate in multidisciplinary analytics project teams.\n<br><br>\nInterview Subject Matter Experts, plan and conduct individual interviews with experts to gain valid information and data needed for analysis.\n<br><br>\nElicit Information from Groups, plan and conduct group elicitation sessions with working groups to develop and assess alternatives, uncertainties, and value and risk preferences.\n<br><br>\nCommunicate Results of the analytics process in both written and oral presentation formats.\n<br><br>\nCreate recommendations that are practical, actionable, and have material impact, in addition to being well-supported by analytical models and data.\n<br><br>\n<strong>Employees in this role will also:</strong>\n<br><br>\no Identify unique opportunities to collect new data.\n<br><br>\no Design new processes and build large, complex data sets.\n<br><br>\no Strategize new uses for data and its interaction with data design.\n<br><br>\no Locate new data sources, analyze statistics and implement quality procedures.\n<br><br>\no Perform data studies of new and diverse data sources.\n<br><br>\no Find new uses for existing data sources.\n<br><br>\no Conduct statistical modeling and experiment design.\n<br><br>\no Test and validate predictive models.\n<br><br>\no Build web prototypes and performs data visualization.\n<br><br>\no Conduct scalable data research on and off the cloud.\n<br><br>\no Implement automated processes for efficiently producing scale models.\n<br><br>\no Design, modify and build new data processes.\n<br><br>\no Generate algorithms and create computer models.\n<br><br>\no Collaborate with database engineers and other scientists.\n<br><br>\no Implement new or enhanced software designed to access and handle data more efficiently.\n<br><br>\no Train the data services center team on new or updated procedures\n<br><br>\nBasic/Required Qualifications\n\n\n<ul>\n<li>Bachelor's degree from a four-year college or university with a degree in</li>\n</ul>\n\nstatistics/analytics, economics, physics, mathematics, engineering, computer science, or\n<br><br>\nmanagement of information systems\n\n\n<ul>\n<li>0 to 3 years of experience with statistics, data modeling and reporting</li>\n</ul>\n\nYears of prior equivalent work related experience in addition to a degree\n<br><br>\n<strong>Desired Qualifications</strong>\n\n\n<ul>\n<li>Previous experience working in data mining, natural language processing, and data governance</li>\n<li>Working knowledge of data analytic tools like SAS, SQL (Structured Query Language), R, IBM Cognos, etc.</li>\n<li>Strong knowledge of basic and advanced regression and prediction models</li>\n<li>Mastery of statistics, machine learning, algorithms and advanced mathematics</li>\n<li>Certified Analytics Professional (CAP) from INFORMS, ISM or APICS</li>\n</ul>\n\nTravel Requirements\n<br><br>\n<strong>5-15%</strong>\n<br><br>\nRelocation Assistance Provided (as applicable)Yes\n<br><br>\nRepresented/Union PositionNo\n<br><br>\nVisa Sponsored PositionNo\n<br><br>\nPosting Expiration Date\n<br><br>\nThursday, November 22, 2018\n<br><br>\nAll job postings expire at 12:01 AM on the posting expiration date.\n<br><br>\nPlease note that in order to be considered for this position, you must possess all of the basic/required qualifications."}