{"job title": "Data Scientist", "company": "DuPont™ Danisco®", "city state": "– Johnston, IA", "rating": "3.0", "job description": "<div>\nJob Description<br><br>The Data Scientist will provide decision science leadership to Sales and Marketing in the form of insights, key metrics and predictions drawn from data analysis. Maintain a passion for implementing new techniques to extract insights buried in data and working with colleagues to drive productivity improvements.\n<br><br>\nResponsibilities include, but are not limited to:\n\n<ul>\n\n<li>\n<div>Mine and analyze data from company databases to drive optimization and improvement of marketing techniques and business strategies</div></li>\n<li>\n<div>Use predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes</div></li>\n<li>\n<div>Maintain current predictive models using the following machine learning methods: Logistic Group Lasso, Elastic Network Regression, AIC Stepwise Regression, Random Forest, Neural Network, Support Vector Machine, Gradient Boosting Tree, Partial Least Square Regression</div></li>\n<li>\n<div>Develop new modeling techniques for pattern recognition, prediction, classification, and other complex data science problems in marketing</div></li>\n<li>\n<div>Marketing programs analysis under the observational scenario</div></li>\n<li>\n<div>Share lead responsibility for building cloud-based analytical data pipeline</div></li>\n<li>\n<div>Automate models and dashboards that track business performance</div>\n<br>\n<div>(1) Identify key leading indicators in conjunction with colleagues</div>\n<br>\n<div>(2) Develop and implement business facing dashboards (Power BI, Shiny)</div></li>\n<li>\n<div>Develop processes and tools to monitor and analyze model performance and data accuracy</div></li>\n<li>\n<div>Document methodologies and increase institutional knowledge based on experimental results and operationalized solutions</div></li>\n</ul>\n\nJob Qualifications\n\n\n<ul>\n\n<li>\n<div>Ph.D in Statistics, Data Science or Applied Mathematics highly preferred</div></li>\n<li>5+ years of experience applying predictive and analytic methods within a Sales and Marketing environment</li>\n<li>Expertise in Bayesian statistics</li>\n<li>Experience with modern methods for parallelized processing of large, distributed datasets (e.g. Spark, Hadoop, Map-reduce)</li>\n<li>Experience working with web data (corpus of HTML documents, browse clickstreams, server logs)</li>\n<li>Social media network and sentiment analysis</li>\n<li>Knowledge of basic digital marketing, SEO and NLP</li></ul>\n\n\n<ul>\n\n<li>\n<div>Lifetime learner philosophy – ability to identify and implement new methodology</div></li>\n<li>\n<div>Proficiency with a broad suite of machine learning techniques and expert ability to select the right technique</div></li>\n<li>\n<div>Very strong data mining and transformation skills</div></li>\n<li>\n<div>Ability to deal with data imperfections such as missing values, multi-collinearity, outliers and non-normal distributions</div></li>\n<li>\n<div>Proficiency with a major programming language appropriate for data science (e.g.; R, Python or Java) to manipulate data and draw insights</div></li>\n<li>\n<div>Proficiency with data visualization and dashboard tools</div></li>\n<li>\n<div>Strong ability to communicate insights in both technical and non-technical way</div></li>\n<li>\n<div>Ability to develop a broad technical network while working independently in a business environment</div></li>\n</ul>\n#LI-AB2<br><br>About DowDuPont<br><br>DowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the\n<br>\n intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty\n<br>\n products sectors that will lead their respective industries through productive, science-based innovation to meet the\n<br>\n needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n<br><br>\nThe positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials\n<br>\n Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies.\n<br>\n Information on the division alignment will be provided during the recruitment process.</div>\n<br>"}