{"job title": "LIMS Data Architect/Analyst/Developer", "company": "DuPont", "city state": "– Wilmington, DE", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br><br>\nSpecialty Products is a division, and one of three intended future companies, that make up DowDuPont. Specialty Products Division is a leader in innovation composed of technology-driven specialty businesses. We work with customers across multiple industries to advance their best ideas and deliver real-world products and smart solutions. Our world-class product innovation and application development capabilities help customers solve complex problems in the electronics, transportation, building and construction, health and wellness, food, personal care, safety and consumer goods industries. With a global workforce of more than 30,000, together we aim to empower the world with the essential innovations to thrive.\n<br><br>\nInformation &amp; Data Sciences (IDS) is a team of Information Scientists, Data Scientists, and Research Computing experts who focus on maximizing the power that information can provide to the Innovation, Discovery, and Product Development processes.\n<br><br>\nSupporting R&amp;D Organization - We are seeking an experienced, energetic, and technical expert who will help drive and enable innovational foundational capabilities to maximize the value of information through information and knowledge management.\n<br><br>\nDuPont offers an excellent benefits package that begins on your first day of employment. This includes a generous 401k match, health and dental insurance, 15 days of vacation, a variable bonus plan, and much more!\n<br><br>\n<strong>The responsibilities of this position include:</strong>\n\n\n<ul>\n<li>Maintain or provide enhancements to existing LIMS applications and development of new applications when required.</li>\n<li>Direct and/or implement the development of user interfaces and APIs</li>\n<li>Monitors existing functionality</li>\n<li>Responds to inquiries concerning systems operations</li>\n<li>Provides 2nd level troubleshooting/resolution of system and operator problems</li>\n<li>Coordinate the planning, design, development, and deployment of new LIMS applications</li>\n<li>Partner with and manage vendors on LIMS evaluation and implementation</li>\n<li>Create process models, specifications, diagrams, and charts to provide functional requirements to application developers and IT systems design and support personnel.</li>\n<li>Partner with LIMS administrators to create SOPs, test scripts, and training materials</li>\n<li>Create and maintain necessary LIMS system documentation including user requirement specifications, detailed design specifications, configuration test plans and summary reports, etc.</li>\n<li>Understand and anticipate technology needs and opportunities for R&amp;D and Scientific information management and effectively translate those needs into solutions and business process improvements.</li>\n</ul>\n\nAdditional Technical Skills\n\n\n<ul>\n<li>Experience programming (both high level languages and scripting)</li>\n<li>Experience developing and supporting web front end technologies</li>\n<li>Demonstrated competency using database reporting tools</li>\n<li>Working knowledge of relational databases and SQL</li>\n</ul>\n\nKey Relationships\n\n\n<ul>\n<li>Reports to Information &amp; Data Sciences, Information Science Manager.</li>\n<li>Work directly with Information &amp; Data Sciences Advanced Analytic Team, Research Scientists and DuPont internal business contacts.</li>\n<li>Partner with business LIMS administrators, Emerging Technology Teams and developers.</li>\n<li>Coordinate projects with external contractors, consultants, and partners needed to carry-out Technical Information team objectives.</li>\n</ul>\n\nCritical Skills\n\n\n<ul>\n<li>Hands on experience with at least one LIMS technology</li>\n<li>Familiarity with multiple LIMS solutions</li>\n<li>Capable of effectively communicating complex technical ideas and the business value associated with information management best practices</li>\n<li>Capable of performing requirements gathering for transformation into technical procedural and environment documentation</li>\n<li>Effectively collaborate with colleagues from related functions and 3rd party vendors</li>\n</ul>\n\nJob Qualifications\n<br><br>\nMinimum Job Qualifications\n\n\n<ul>\n<li>BS in Computer Science (or equivalent)</li>\n<li>3+ years developing and/or maintaining Laboratory Information Management System(s)</li>\n<li>3+ years of software development/programming experience</li>\n<li>3+ years developing web solutions</li>\n<li>Comfortable working in a MS Windows environment (LINUX experience is a plus)</li>\n</ul>\n\nPreferred Job Qualifications\n\n\n<ul>\n<li>Experience with implementations of LIMS: Nautilus (LIMS Next), OpenLab</li>\n<li>Experience programming in at least one high level language: C#, C++, .NET, etc.</li>\n<li>Experience with web front end technologies: HTML5, XML, CSS, Bootstrap, AJAX, etc.</li>\n<li>Experience with JavaScript libraries: toastr, underscore, select2, etc.</li>\n<li>Demonstrated competency using database reporting tools: SQL server, Tableau, etc.</li>\n<li>Working knowledge of relational databases and SQL: Oracle, MySQL</li>\n</ul>\n\n<strong>#LI-SH1</strong>\n<br><br>\nAbout DowDuPont\n<br><br>\nDowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty products sectors that will lead their respective industries through productive, science-based innovation to meet the needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n<br><br>\nThe positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies. Information on the division alignment will be provided during the recruitment process.<br><br>SDL2017"}