{"job title": "Software Developer Intern - Data Science &amp; Informatics", "company": "DuPont", "city state": "– Johnston, IA", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br><br>\nJoin our fast-paced Software Engineering organization that is using leading edge technologies and design practices to accelerate Corteva Agriscience Research &amp; Development. As an intern you must be passionate and curious about technology and the desire to exceed. You will have a unique opportunity to learn, grow, and expand your knowledge with leading edge software solutions. You will have a strong drive for excellence, excel in using creative approaches to solving complex problems, and possess an innovative mindset.\n<br><br>\nResponsibilities - WHAT YOU WILL DO\n\n\n<ul>\n<li>Continuously learn and share your technical knowledge</li>\n<li>Work collaboratively on agile software teams to create innovative software solutions for R&amp;D systems</li>\n<li>Design, develop, and support a variety of high-performance software solutions for R&amp;D</li>\n</ul>\n\nJob Qualifications\n<br><br>\nKey Qualifications - WHAT YOU WILL BRING\n\n\n<ul>\n<li>Must be enrolled in a bachelors, masters, or doctoral degree program in computer, information technology or related engineering field with a minimum GPA of 3.0.</li>\n<li>Possess excellent problem-solving skills using creative approaches</li>\n<li>Ability to work effectively with cross-functional engineering teams and business partners</li>\n<li>Hands-on experience with object-oriented languages and web development technologies</li>\n<li>Not required, but preferred technology experiences: Angular, Typescript, C#, .Net, RESTful API Services, AWS, Azure, and SQL</li>\n</ul>\n\nAbout DowDuPont\n<br><br>\nDowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty products sectors that will lead their respective industries through productive, science-based innovation to meet the needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n<br><br>\nThe positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies. Information on the division alignment will be provided during the recruitment process.<br><br>SDL2017"}