{"job title": "Distinguished Data Scientist", "company": "DuPont", "city state": "– Hayward, CA", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br><br>\nCorteva Agrisciences isseeking a Distinguished Data Scientist to join our global Data Science andInformatics group working on predictive analytics for digital agriculture. Ifyou are interested in analyzing one of the largest collections of farm data; inoptimizing management practices for one of the largest farming operations; orin developing simulation strategies that will provide the next generation genetics/crop-protection/farm-management-practicesfor millions of farm-acres across the globe, our opening for a DistinguishedData Scientist is your opportunity.\n<br><br>\nAt Corteva Agriscience, Agriculture Division of DowDuPont, you'll become partof an interdisciplinary, global work environment in which you will operate as a thought leader and visionary thatwill encourage and promote disruptive advances by applying state-of-the-artmethods in data science and artificial intelligence to critical problemsspanning multiple segments of the organization. Your strong and extensivebackground in machine/deep learning, statistical simulations and systemsoptimization will enable you to gain insights from a wide array of structuredand unstructured datasets consisting of global-scale spatio-temporal sources (farm-equipment,UAV, satellite, weather, soils etc.), imagery, sequencing &amp; gene-expressiondata, proximal sensors and IoT streams. Thisis a critical position with strategic impact on our business and you will playa major role by driving innovation in agriculture technology.\n<br><br>\nWorking closely with data scientists, data engineers, researchers andbusiness collaborators across the organization, you will develop and deploy sophisticatedend-to-end solutions on a wide range of problems in digital agriculture. Thiswill require excellent interpersonal communication skills and an aptitude forbuilding networks, within and outside the company Job Qualifications\n\n\n<ul>\n<li>PhD or similar qualification in a quantitativedata science discipline</li>\n<li>6+ years of work experience post-PhD</li>\n<li>Understandingof computational learning theory, graph theory, statistical methods,simulations &amp; optimization.</li>\n<li>Experiencein the design and optimization of ML/DL and AI architectures for patternrecognition, object detection, anomaly detection, regression, causal networkanalysis, unsupervised learning, natural language processing and sequence/gene-expressionanalysis.</li>\n<li>Expertisein numerical methods, mathematical modeling and combinatorial optimizationtechniques in combination with machine learning methods for gaining modelinsights.</li>\n<li>Expertprogramming skills in R, Python and C/C++ programming with the ability toquickly create prototype solutions on Unix / Linux / Cloud platforms using opensource tooling and libraries as necessary.</li>\n<li>Excellentinterpersonal, verbal and communication skills and a can-do attitude with theability to thrive in a fast-paced dynamic environment.</li>\n<li>Excellent analyticaland problem-solving skills with the ability to work as part of a global teamand, at times, independently while appropriately prioritizing tasks</li>\n</ul>"}