{"job title": "Digital Analyst/Data Scientists", "company": "Dupont", "city state": "– Wilmington, DE", "rating": "3.6", "job description": "Job Description<br><br>In DuPont IT, we strongly believe that we can transform the way we work by applying new emerging digital/information technologies to business opportunities and challenges. We are on a journey to further build our capabilities, and we are looking for talent to join us on that journey - to explore and innovate. You will be joining an international IT team of explorers with the primary goal of transforming through digital efforts.\n<br><br>\nRole Description:\n<br><br>\nYour role focuses on harnessing vast amounts of data to optimize business results. You will be innovating through your knowledge of descriptive and multi-variate statistical techniques. You will use or build applications and database analysis tools and techniques to develop strategic insights to drive business goals. This includes the use of new cutting-edge technologies related to artificial intelligence, machine learning and advanced analytics.\n<br><br>\nYou will be responsible for learning new things and applying this to solve problems in our industry. You will identify and deliver new solutions along with your colleagues around the globe, and our world class strategic partners. If you are a curious high-achiever that is interested in leveraging game-changing technologies to solve big challenges in the specialty products industry and contribute to creating high-margin, high-impact products, then DuPont may be the place for you.\n<br><br>\nMain Responsibilities:\n<br><br>\nYou will have the responsibility to work with teams to define metrics, guidelines, and strategies for effective use of algorithms and data. You will work closely with business leaders and other experts to:\n\n<ul>\n<li>Develop algorithms and predictive models to solve critical business problems.</li> \n\n<li>Develop tools and libraries to more efficiently process massive amounts of data.</li>\n<li>Analyze large, noisy datasets to identify meaningful patterns that provide actionable results.</li>\n<li>Create visualizations that intuitively display large amounts of data and/or complex relationships.</li>\n</ul>\n\nJob Qualifications<br><br>Candidate Profile:\n<br><br>\nYou have just finished your bachelor, master or doctorate degree(s) - and you have a background in fields such as Statistics, Mathematics, Business Analytics, Economics, Science and Computer Science and are ready to apply the theory.\n<br><br>\nYou are an independent thinker but still an excellent team player, you are curious and versatile, and eager to tackle today’s and tomorrow’s challenges using disruptive thinking and bleeding edge technologies. You have a strong passion for empirical research and for answering hard questions with data. You have the ability to communicate complex quantitative analysis in a clear, precise, and actionable manner.\n<br><br>\nThe position offers a diverse range of projects and the opportunity to quickly have a direct impact on the organization. You must be comfortable working in an agile development environment with high expectations for rapid delivery of prototypes, changing requirements, and direct feedback from our global business customers.\n<br><br>\nAnalytics Knowledge &amp; Experience\n\n<ul>\n<li>R</li></ul>\n\n\n<ul>\n<li>Decision Trees</li></ul>\n\n\n<ul>\n<li>K-Nearest Neighbor</li></ul>\n\n\n<ul>\n<li>Python</li></ul>\n\n\n<ul>\n<li>Regression Trees</li></ul>\n\n\n<ul>\n<li>Support Vector Mach</li></ul>\n\n\n<ul>\n<li>MATLAB</li></ul>\n\n\n<ul>\n<li>Naïve Bayes</li></ul>\n\n\n<ul>\n<li>Clustering</li></ul>\n\n\n<ul>\n<li>Neural Networks</li></ul>\n\n\n<ul>\n<li>Random Forest</li></ul>\n\n\n<ul>\n<li>Time Series</li></ul>\n\n\n<ul>\n<li>Linear Regression</li></ul>\n\n\n<ul>\n<li>Logistics Regression</li>\n</ul>\nIT Knowledge &amp; Experience\n\n<ul>\n<li>Python</li></ul>\n\n\n<ul>\n<li>Azure Data Science VM</li></ul>\n\n\n<ul>\n<li>Deep Learning</li></ul>\n\n\n<ul>\n<li>PERL</li></ul>\n\n\n<ul>\n<li>HADOOP ECOSystem</li></ul>\n\n\n<ul>\n<li>Agile</li></ul>\n\n\n<ul>\n<li>C, C++</li></ul>\n\n\n<ul>\n<li>Large Data Set Analysis</li></ul>\n\n\n<ul>\n<li>Design Thinking</li></ul>\n\n\n<ul>\n<li>SQL</li> </ul>\n\n\n<ul>\n<li>Windows/Linux</li></ul>\n\n\n<ul>\n<li>Project Management</li></ul>\n\n\n<ul>\n<li>NoSQL</li></ul>\n\n\n<ul>\n<li>Watson</li></ul>\n\n\n<ul>\n<li>Data Privacy Laws</li>\n</ul>\nAdditional areas of knowledge or expertise that are desirable:\n\n<ul>\n<li>Experience with computing solutions in a R&amp;D, Engineering, or Technology areas</li>\n<li>Flexibility to travel - no more than 50%</li>\n<li>Formal Digital/Analytics training</li>\n<li>Security experience and certification</li>\n<li>Project management certification or equivalent experience</li> \n</ul>\n\nAbout DowDuPont<br><br>DowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the\n<br>\n intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty\n<br>\n products sectors that will lead their respective industries through productive, science-based innovation to meet the\n<br>\n needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n<br><br>\nThe positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials\n<br>\n Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies.\n<br>\n Information on the division alignment will be provided during the recruitment process."}