{"job title": "Data Scientist, Digital Ag", "company": "Dupont", "city state": "– Johnston, IA", "rating": "3.6", "job description": "Job Description\n <p></p><p>Corteva Agriscience™ has a rich history of scientific discovery\nthat has enabled countless innovations. We’re looking for more people, in more\nplaces, to collaborate with us to create a market-shaping, agriculture company\nwith leading positions in seed technologies, crop protection and digital\nagriculture.</p>\n\n\n\n<p>We need Data Scientists to collaborate with visionary crop\nscientists, agronomists, plant breeders, and engineers to build digitally enabled\nscience and business capabilities.</p>\n\n\n\n<p>Are you looking for an opportunity to use your data science\nskillset to contribute to our team and help us on our mission!?</p>\n\n\n\n<p>In this role, you will:</p>\n\n<ul><li>Engage with a team of domain scientists, data scientists, engineers,\nand software developers assembled to identify business problems, discover new\ndata opportunities, provide data driven solutions, and deliver production\napplications which enhance value and efficiency for collaborators and\ncustomers.</li><li>Identify, acquire, and engineer feature data sets with potential\nto address customer needs.</li><li>Develop, prototype, and implement data pipeline and software\nsolutions with engineering and production teams.</li><li>Apply machine learning, statistical or mechanistic models and\nother computational approaches to extract insights from datasets in complex\nagronomic systems.</li><li>Collaborate with scientists from multiple domains in\nsolution/experiment design and analyses.</li><li>Conduct and communicate results of research on data science\napproaches to improve decisions, add value to services, extend or improve\nin-house models and algorithms, and contribute to the advancement of these\nideas into the marketplace.</li><li>Uphold\nCorteva Agriscience™ Core Values at all times.</li></ul><p></p>\n Job Qualifications\n <p></p><ul><li>Outstanding problem solving skills and a proven ability to\nindependently deliver analytic solutions by asking the right questions,\nidentifying necessary data sources, building predictive models, and producing\nactionable results.</li><li>Expertise in machine learning, deep learning, data mining,\nstatistical methodology, or simulation modeling and demonstrated experience\nusing these techniques.</li><li>Expert in Python or R in linux environments.</li><li>Comfort in using cloud based systems and services, especially\nAWS.</li><li>Strong skills in building visualizations of scientific data.</li><li>Proven ability to work in a team setting and ability to complete\ncomplex projects on time and in budget.</li><li>Superior communication skills, both verbal and written.</li><li>An M.S. or PhD in Data Science, or Computer Science, Physics,\nMathematics, or Statistics with demonstrated data science applications.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What will generate excitement:</p>\n\n<ul><li>Experience working with and managing geospatial data sets with\nopen source tools</li><li>Experience designing Docker based deployments</li><li>API focused solution capability</li><li>Strength\nwith Database technologies.</li></ul><div><p>We are excited to announce\nthat Corteva Agriscience™ is the name of the new Agriculture Division\nof DowDuPont™. We are bringing together DuPont Crop Protection, DuPont\nPioneer and DowAgroSciences to create a market-shaping, standalone\nagriculture company with leading positions in seed technologies, crop\nprotection and digital agriculture. We will work across the global agriculture\nvalue chain to create a more efficient food system.</p>\n\n\n\n<p>At Corteva Agriscience™,\nwe seek to enrich the lives of those who produce and those who consume. This\nmeans we will help rejuvenate the agricultural ecosystem to support people and\nthe planet and to ensure progress for generations to come.</p></div><p></p>\n <br>\n About DowDuPont\n <p>\n DowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the\n intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty\n products sectors that will lead their respective industries through productive, science-based innovation to meet the\n needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n <br><br>\n The positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials\n Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies.\n Information on the division alignment will be provided during the recruitment process.\n </p>"}