{"job title": "Agronomic Data Scientist", "company": "Dupont", "city state": "– Johnston, IA", "rating": "3.6", "job description": "<strong>Job Description</strong><br>\n\n<div><strong>The Opportunity:</strong></div><div>Corteva Agriscience™ has a rich history of scientific discovery that has enabled countless innovations. We’re looking for more people, in more places, to collaborate with us to create a market-shaping, agriculture company with leading positions in seed technologies, crop protection and digital agriculture.</div> <div>We need Soil or Agronomic Data Scientists to collaborate with visionary crop scientists, agronomists, plant breeders, and engineers to build digitally enabled science and business capabilities.</div><br>\n<div>Are you looking for an opportunity to use your data science skillset to contribute to our team and help us on our mission!?</div><br>\n\n<div><strong>In this role, you will:</strong></div><div>\n\n<ul>\n<li>Drive science focused solutions to create digital ag capabilities and products to enhance value and efficiency for researchers, collaborators and customers.</li><li>Identify, acquire, and engineer feature data sets and pipelines with potential to address customer needs.</li><li>Apply machine learning, statistical or mechanistic models and other computational approaches to extract insights from datasets in complex agronomic systems.</li><li>Develop, prototype, and implement data pipeline and software solutions with engineering and production teams.</li><li>Collaborate with scientists from multiple domains in solution/experiment design and analyses.</li><li>Conduct and communicate results of research on data science approaches to improve decisions, add value to services, extend or improve in-house models and algorithms, and contribute to the advancement of these ideas into the marketplace.</li><li>Uphold Corteva Agriscience™ Core Values at all times.</li></ul></div>\n<br>\nJob Qualifications<br>\n\n<div><strong>About you:</strong></div><div>\n\n<ul>\n<li>Outstanding problem solving skills and a proven ability to independently deliver analytic solutions by asking the right questions, finding or applying the corret domain knowledge, identifying necessary data sources, building predictive models, and producing actionable results.</li><li>Demonstrated experience using machine learning, data mining, statistical methodology, or simulation modeling in agronomic, breeding, environment, or digital ag problems.</li><li>Proficiency in Python or R.</li><li>Experince with geospatial and remote sensing data.</li><li>Strong skills in building visualizations of scientific data.</li><li>Familiarity with cloud based or HPC systems and computation in linux.</li><li>Proven ability to work in a team setting and ability to complete complex projects on time and in budget.</li><li>Superior communication skills, both verbal and written.</li><li>An M.S. or PhD and demonstrated experience with quantitative applications in Soil, Hydrology, Agronomy/Plant Sciences, Geography, Ecology, Climatology or related fields. Or conversely, you have an M.S. or PhD in Computer Science, Physics, Mathematics, or Statistics with demonstrated Data Science applications in Agronomic or Natural sciences.</li></ul></div>\n\n<br><strong><div>Nice to have:</div>\n<br>\n</strong>\n\n<li>Capability with Relational or NoSQL databases.</li>\n<li>Experience using Docker</li><br>\n\n<div>We are excited to announce that Corteva Agriscience™ is the name of the new Agriculture Division of DowDuPont™. We are bringing together DuPont Crop Protection, DuPont Pioneer and DowAgroSciences to create a market-shaping, standalone agriculture company with leading positions in seed technologies, crop protection and digital agriculture. We will work across the global agriculture value chain to create a more efficient food system.</div><div>At Corteva Agriscience™, we seek to enrich the lives of those who produce and those who consume. This means we will help rejuvenate the agricultural ecosystem to support people and the planet and to ensure progress for generations to come.</div>\n<br>About DowDuPont<br><br>DowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the\n<br>\n intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty\n<br>\n products sectors that will lead their respective industries through productive, science-based innovation to meet the\n<br>\n needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n<br><br>\nThe positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials\n<br>\n Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies.\n<br>\n Information on the division alignment will be provided during the recruitment process."}