{"job title": "Business Analyst Intern - Data Science and Informatics", "company": "DuPont", "city state": "– Johnston, IA", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br><br>\nWe are seeking an innovative, driven, personable, and Business Analyst intern who will be an all-star teammate and a strategic leader. You will work with creative and talented team members who will share in your passion to exceed in developing robust and innovative solutions for complex research problems globally for Corteva R&amp;D.\n<br><br>\nResponsibilities - What you will do\n\n\n<ul>\n<li>Work collaboratively and independently on agile software teams to create innovative software systems</li>\n<li>Communicate complex technical information to a variety of audiences in a clear and concise manner</li>\n<li>Drive user centered design process. Create wireframes, interview users, create process flow maps, and develop personas</li>\n<li>Document user stories and acceptance criteria in JIRA and Confluence</li>\n<li>Understand relational databases to extract, summarize, and report data</li>\n</ul>\n\nJob Qualifications\n<br><br>\nKey Qualifications - What you will bring\n\n\n<ul>\n<li>Must be enrolled in a bachelor's degree program or AA certification in computer science, information technology or related field with a minimum GPA of 3.0.</li>\n<li>Ability to be comfortable with the unknown, ask questions, be inquisitive</li>\n<li>Ability to dive in, position yourself for success by building relationships, learning quickly, and trying new things</li>\n<li>Possess excellent requirements gathering and problem-solving skills with attention to detail</li>\n<li>A confident speaker; able to articulate messages well in small to medium size groups</li>\n<li>Ability to handle conflicts and approach negotiations in a diplomatic but confident manner</li>\n<li>Experience prioritizing and breaking down complex requests into small chunk</li>\n<li>Knowledge of plant breeding/ag industry encouraged</li>\n</ul>\n\nAbout DowDuPont\n<br><br>\nDowDuPont (NYSE: DWDP) is a holding company comprised of The Dow Chemical Company and DuPont with the intent to form strong, independent, publicly traded companies in agriculture, materials science and specialty products sectors that will lead their respective industries through productive, science-based innovation to meet the needs of customers and help solve global challenges. For more information, please visit us at www.dow-dupont.com.\n<br><br>\nThe positions represented by this job posting are aligned to one of the three divisions, Agriculture, Materials Science or Specialty Products, which are expected to separate from DowDuPont into stand-alone public companies. Information on the division alignment will be provided during the recruitment process.<br><br>SDL2017"}