{"job title": "Data Scientist", "company": "E. &amp; J. Gallo", "city state": "– Modesto, CA", "rating": "4.2", "job description": "<strong><u>Why E. &amp; J. Gallo Winery?</u></strong>\n<br><br>\nRecognized by Glassdoor as a \"Best Place to Work\" two years in a row, we couldn't be prouder of our employees. We are the largest family-owned winery in the world with over 100 brands. We are committed to driving innovation, sustainability, and fostering a culture of collaboration. We look forward to having you join the team! Your Talent &amp; Gallo | A Perfect Pairing\n<br><br>\nAs a Data Scientist at E. &amp; J. Gallo Winery, you will be responsible for providing statistical support and data analysis to winery functions. Additionally, you will perform research, analysis and modeling on organizational data. You will also, develop and apply models to key business metrics with the goal of improving operations.\n<br><br>\n<strong><u>What You Will Do</u></strong>\n<ul>\n<li>Works cross-functionally with Gallo team to drive analytics across the enterprise</li><li>Researches and develops statistical learning models for data analysis</li><li>Collaborates with product management, engineering, marketing and agriculture departments to understand company needs and devise possible solutions</li><li>Maintains knowledge of latest technology trends</li><li>Communicates statistical results and ideas to key decision makers</li><li>Implements new statistical or other mathematical methodologies as needed for specific models or analysis</li><li>Optimizes joint development efforts through appropriate cloud needs use and project design</li><li>Mines and analyzes complex data sets using advanced statistical methods for use in data driven decision making</li><li>Understands the business areas supported to determine specific output requirements and report format. Supports multiple business areas</li><li>Studies existing data systems to evaluate effectiveness. Develops new and modifies current systems to improve processes by researching new technology and applying it to complex business issues or projects</li><li>Leads one or more medium sized and complex projects which entail overseeing internal IT professionals</li>\n</ul>\n<strong><u>What You Need</u></strong>\n<ul>\n<li>High School Diploma or State-issued equivalency certificate</li><li>Bachelor’s Degree in Statistics, Mathematics, Data Sciences, Economics, Marketing Research, applied/Quantitative Psychology, Marketing, Computer Science or MIS plus 3 years of experience in advanced data analytics; <strong><u>OR</u></strong> Master's degree in Statistics, Mathematics, Data Sciences, Economics, Marketing Research, Applied/Quantitative Psychology, Marketing, Computer Science or MIS plus 1 year of experience in advanced data analytics; <strong><u>OR</u></strong> 7 years of experience in advanced data analytics reflecting increasing levels of responsibility <strong><u>OR</u></strong> Ph.D in Statistics, Mathematics, Data Sciences, Economics, Marketing Research, Applied/Quantitative Psychology, Marketing, Computer Science or MIS</li><li>Experience performing advanced data modeling and machine learning techniques</li><li>Strong technical, oral/written communication and analysis/documentation skills</li><li>Experience using data handling and modeling packages such as Python and R</li>\n</ul>\n<strong><u>What Will Set You Apart</u></strong>\n<ul>\n<li>Master’s degree in Statistics plus 3 years of advanced data analytics</li><li>Experience working with rapidly evolving software</li><li>Experience effectively presenting information to top management, public groups, and boards of directors</li><li>Experience applying machine learnig concpets in an e-commerce environmet</li><li>Familiarity working in an Integrated Development Environment (IDE)</li><li>Experience modeling in a distributed copute envieonment such as AWS, MapR or other cloud suites</li>\n</ul>\nGallo does not sponsor for employment based visas for this position now or in the future\n<br>\nJob Posting ID:&nbsp;57222&nbsp;\n<br>\nTo view a full job description, please click here.\n<br><br>\n#LI-TG1\n<br><br>\nINF001\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nEqual Opportunity Employer"}