{"job title": "Data Scientist", "company": "EagleView Technologies", "city state": "– Bellevue, Washington", "rating": "3.0", "job description": "We are looking for talented Data Scientists to join the Machine Learning &amp; Artificial Intelligence (ML/AI) team. You are a talented data scientist that is tired of applying basic statistical tools to yet another set of KPI's. You are passionate about deriving creative solutions from imagery using cutting edge computer vision techniques and big data pipelines. You are excited about the analytical potential and challenges associated with processing petabytes of time-series imagery. You are intrigued by being a part of a collaborative team, spearheading ML/AI applications for realizing unprecedented, scalable products.\n<br>\n<strong>PRIMARY RESPONSIBLITIES</strong>\n\n\n<ul>\n<li>Help to aggregate, clean, and organize data for machine learning applications</li>\n<li>Collaborate with scientists and engineers to develop/scale Python and similar algorithms to cloud environments</li>\n<li>Process raster and vector data using Python and OpenCV-like libraries for ingestion into neural nets</li>\n<li>Work with the team to develop new techniques and capabilities using machine learning and neural networks</li>\n<li>Research and experiment new technologies that can improve algorithm applications</li>\n<li>Python, R or similar language</li>\n<li>Experience with Amazon AWS or comparable cloud processing</li>\n<li>Experience with Linux-based command line environments</li>\n<li>SQL knowledge</li>\n<li>Experience with Neural Networks &amp; predictive analytics (class projects are fine)</li>\n<li>Ability to work independently &amp; excellent communication skills</li>\n<li>Minimum BA or BS in computer science, engineering or related field or equivalent work experience</li>\n</ul>\n\n<strong>WHAT DOESN'T DESCRIBE YOU:</strong>\n\n\n<ul>\n<li>A desire to only work on things you are most familiar with</li>\n<li>Fear of dynamically changing, uncertain, or unestablished requirements</li>\n<li>A desire for explicit tasking on a daily basis</li>\n</ul>\n\nEagleView Technologies offers competitive pay and robust benefit plans along with the opportunity to grow your career in a fast-paced, fun and casual environment.\n<br><br>\nEagleView and its subsidiaries are committed to leveraging the talent of a diverse workforce to create great opportunities for our business and our people. EOE/AA. Minority/Female/Disability/Veteran.\n<br><br>\nRead Full Job Description\n\n\n<ul>\n<li>****************************************************************** &amp; jid=****** &amp; source=***********</li>\n</ul>"}