{"job title": "Data Scientist", "company": "Eastman Chemical", "city state": "– Kingsport, TN, TN", "rating": "3.8", "job description": "Eastman is a global advanced materials and specialty additives company that produces a broad range of products found in items people use every day. With a portfolio of specialty businesses, Eastman works with customers to deliver innovative products and solutions while maintaining a commitment to safety and sustainability. Its market-driven approaches take advantage of world-class technology platforms and leading positions in attractive end-markets such as transportation, building and construction and consumables. Eastman focuses on creating consistent, superior value for all stakeholders. As a globally diverse company, Eastman serves customers in more than 100 countries and had 2017 revenues of approximately $9.5 billion. The company is headquartered in Kingsport, Tennessee, USA and employs approximately 14,500 people around the world. For more information, visit www.eastman.com.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nEastman’s Data Science organization exists to magnify human insight through data, fostering ideas and improved decision-making across our business, technology and manufacturing operations. The Data Science organization is about 45 people comprising five teams -- Business Analytics Consulting, Business Intelligence, Artificial Intelligence &amp; Machine Learning Technology, Applied Statistics, and Operations Research. This position is on the Business Analytics Consulting team.\n<br><br>\nThe mission of Business Analytics Consulting is to enable Eastman to out-think and out-perform the competition by working with business leaders to apply analytics to the right problems at the right time with the right data. As an Analytics Consultant you will leverage your natural curiosity; understanding of Eastman’s businesses, products, and processes; formal analytical capabilities; and skills in utilizing structured and unstructured data sources to provide well communicated insights to key decision makers across the company. A typical client engagement could include applications data mining, multivariate analysis, forecasting, predictive modeling, or text analytics.\n<br><br>\nAnalytics Consultant is a highly visible position with significant client contact with business and functional leaders. Analytic consultants are assigned business areas to accelerate and improved business decisions through the application of advanced analytics. The centralized nature of Business Analytics Consulting Team and Data Science provides plenty of opportunity for career growth within analytics for those who desire a technical path. For those looking to diversify more, working relationships with client organizations can lead to future roles within a business organization or a corporate function such as supply chain or marketing, to name a few.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Network within assigned businesses to develop a sound understanding of the products, processes, challenges faced by the areas, and key decisions that need advanced analytics</li><li>Actively engage business leadership to identify key opportunities to apply analytics and pursue the most valuable of those opportunities</li><li>Translate business needs into analytics questions, then translate analytics answers into business insight and effectively communicate results to the appropriate stakeholders.</li><li>Develop and support analytics solutions to enable decision-makers to address questions of an ongoing or repetitive nature</li><li>Understand Eastman’s data and relevant data external to Eastman as well as how to bring it to bear to maximize its utility</li><li>Work collaboratively with other members of the Data Science organization as well as analysts residing in client organizations to ensure the analytics needs of Eastman are met</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Requirements</strong>\n<ul>\n<li>Analytics Capabilities: Competency with statistics and mathematics to understand the appropriate techniques to apply to a given analytic problem and then to be able to generate useful results with those techniques is the fundamental requirement of this job. Experience doing this with R, Python, and SAS JMP is highly desirable, although analytic experience with any common platform is valuable. Experience with leading text analytic platforms or toolkits is a plus.</li><li>Programming: Ability to utilize coding in solving problems and deploying results is essential. Scripting experience with R is preferred, although experience with Python is also useful. Skills in accessing data using SQL are critical and ability to use MDX for accessing data from OLAP sources is a plus.</li><li>Data Manipulation: Must be able to access, manipulate and transform data, either as a prerequisite to analysis or as an analytic result in itself. Application of programming skills to do this is expected. Experience with tools such as Tableau or the Microsoft Power BI stack is a plus.</li><li>Business Acumen: A basic understanding of business operations is needed so you can ask the right questions and deliver the right results in a way that is understandable and useable to your clients. More advanced business understanding through education or experience is a plus.</li><li>Consulting Skills: Soft skills in communication, influence, change management, and leadership are important for identifying the right problems, getting engagement to develop the right solutions, and delivering results in a way that maximizes value.</li><li>Relentless Curiosity: A track record of digging in to the tough problems, attacking them from different angles, and bringing innovative approaches to bear is highly desirable. Must be capable of self-teaching new techniques and concepts in this rapidly evolving field.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Education</strong>\n<ul>\n<li>M.S. or Ph.D. in a relevant field such as Business Analytics, Statistics, Mathematics, Computer Science, or Operations Research.</li>\n</ul>\nEastman Chemical Company is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other characteristics protected by law.\n<br><br>\nEastman is committed to creating a powerfully diverse workforce and a broadly inclusive workplace, where everyone can contribute to their fullest potential each day."}