{"job title": "DATA ANALYST", "company": "East Carolina University", "city state": "– Greenville, NC", "rating": "4.1", "job description": "<div>\n<div>\n<div><strong>Classification Title:</strong></div><div>\nInstructional Consultant</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Working Title:</strong></div><div>\nDATA ANALYST</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Campus:</strong></div><div>\nEast Carolina University</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Region:</strong></div><div>\nCoastal</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Job Summary:</strong></div><div>\nReport Compilation, Analysis, and Distribution Program Evaluation: Prepare primary data sets, reports, presentations and other materials for OME, faculty and curriculum committees. Use appropriate quantitative statistical analysis to analyze survey data. Develop methodology to facilitate/automate distribution of reports. Respond to ad hoc requests for evaluation information by creating reports from respective databases (E-Value, ExamSoft, Academic Affairs Database). Coding and analyzing qualitative data. CQI (Continuous Quality Improvement): Identify &amp; investigate significant differences or anomalies in data Collects, analyzes, interprets, and summarizes data in preparation for generation of statistical and analytical reports using data visulization tools. Student Assessment Data: Conduct longitudinal analysis and reports on learner assessment data from courses, clerkships and other longitudinal educational programs Review performance data from faculty generated multiple-choice exams for compliance with guidelines/best practices. Provide primary data analysis to stakeholders. Medical Education Research Analysis: Work collaboratively with faculty, staff, and students to develop, analyze and report data on medical education research projects. Provide educational statistical consults to stakeholders. Database Creation, Maintenance, &amp; Management Database creation, management, and run reports (example: Academic Affairs Database). Present progress and provide insight (example: Academic Affairs Database, ExamSoft, E-Value) Streamline internal and external data collection and management processes for increased accuracy and efficiency. Prepare presentations and documents for distribution to appropriate stakeholders. Download information from systems to generate reports for OME initiatives (example: LCME accreditation). Distribute reports to course and clerkship directors the corresponding documents. Other duties as assigned Example: Maintain accurate records of documents and spreadsheets.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Minimum Qualifications:</strong></div><div>\nMaster?s Degree in Education, Educational Assessment and Evaluation, Educational Measurement, Educational Statistics, or related field ? - or ? - Bachelor?s Degree in Education, Educational Assessment and Evaluation, Educational Measurement, Educational Statistics, or related field and 1 year related experience. Demonstrated skills/experience in appropriate computer, statistical, or database applications. Demonstrated skills/experience in writing reports or technical documents. Demonstrated experience in interacting with a wide range of stakeholders. Demonstrated excellence in communication, both oral and written.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Position Number:</strong></div><div>\n500056</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Posting Date:</strong></div><div>\n04/05/2018</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Closing Date:</strong></div><div>\n04/30/2018</div>\n </div>\n </div><br>\n\n<div>\n<div>\n<strong><div>American Recovery &amp; Reinvestment Act Funded:</div></strong></div><strong>\n </strong></div><strong>\n\n<br></strong><br>\n\n<div>\n<div>\n<div>\nApply Now</div>\n</div>\n </div>\n\n<br>"}