{"job title": "HR Data Scientist", "company": "Eaton", "city state": "– Cleveland, Ohio", "rating": "3.4", "job description": "<div><strong>Eaton Corporation is currently seeking an HR Data Scientist to join our team.</strong> This position will be based at our Cleveland, OH facility or an approved home office.\n<br><br>\nOur human resources team is dedicated to helping the organization embody our leadership attributes as we strive to develop our employees and make work exciting, engaging and meaningful. As an independent, experienced advisor, the HR Data Scientist applies people analytics to broad business issues raised by HR business partners to inspire impactful HR solutions.\n<br><br>\nMaking what matters work at Eaton takes the passion of every employee around the world. We create an environment where creativity, invention and discovery become reality, each and every day. It’s where bold, bright professionals like you can reach your full potential—and where you can help us reach ours.\n<br><br>\nIf the candidate resides within 50 miles of our Cleveland, Ohio facility, the candidate must work at that site. If the candidate resides more than 50 miles away from our Cleveland, Ohio facility, relocation is being offered for this role to Cleveland, OH or the candidate can work remote from an approved home office.\n\n<ul>\n\n<li>You will consult with HR and internal partners across business sectors to identify and analyze business problems using complex data analysis.</li>\n<li>You will proactively provide observations and data sights to Business Sector HR leaders and Centers of Excellence (COE’s).</li>\n<li>You will transform HR’s reporting and analytics into insights for HR partners to ensure their deliverables are met.</li>\n<li>You will design, create and communicate various scenario outputs through business analysis and modeling techniques resulting in actionable recommendations to key stakeholders.</li>\n<li>You will develop people insights and original content through data analysis, complex research and analysis projects.</li>\n<li>You will source, extract and compile data to prepare for hypothesis testing and cause/effect analysis.</li>\n<li>You will contribute to intellectual programming source codes and infrastructure for quantitative people analytics.</li>\n<li>You will manage intellectual repositories of analytics and research outcomes, establishing a foundation of analytics knowledge for the HR organization.</li>\n</ul></div>\n<br>\nQualifications<div><strong>Basic Requirements</strong></div>\n\n\n<ul>\n\n<li>\n<div>Bachelor’s degree from an accredited institution.</div> </li>\n<li>\n<div>Minimum 3 years’ professional work experience in data analytics</div></li>\n</ul>\n\n<div><strong>Preferred Qualifications</strong></div>\n\n\n<ul>\n\n<li>\n<div>Bachelor’s degree in Human Resources, Business, Mathematics, Data Science, Statistics, or I/O Psychology from an accredited institution.</div> </li>\n<li>\n<div>5 or more years’ professional work experience in data analytics with people data</div></li>\n</ul>\n\n<div><strong>Position Criteria</strong></div>\n\n\n<ul>\n\n<li>\n<div><strong>Demonstrates in-depth knowledge in one or more of the following:</strong></div>\n<ul>\n\n<li>\n<div>Visualization, Analysis, ETL and IDE Tools: PowerBI, Power Query, Tableau, Rstudio, Atom/IDLE/Visual Studio Code, SPSS, SAS, Alteryx, Advanced Excel, OBIEE, Waterline Data, Informatica, Collibra, Zaloni, Arcadia Data, Microsoft Azure</div></li>\n<li>\n<div>Data Wrangling: SQL on Stinger, Apache Drill, Spark SQL.</div></li>\n<li>\n<div>Programming Languages: R, Python</div> </li>\n<li>\n<div>Databases: Oracle, SAP BW/BO universe, Hadoop</div> </li>\n<li>\n<div>HR Workforce analytics Tools: Visier, SuccessFactors Workforce Analytics, OneModel</div> </li></ul></li>\n<li>\n<div>Demonstrates in-depth knowledge in business application of statistics and data visualization in the area of HR</div>\n\n\n<ul>\n\n<li>\n<div>Probability and statistics inferences with ability to apply appropriate statistical models based on data and business problems, such as regression analysis, Bayesian inferences, significance tests</div> </li>\n<li>\n<div>Organizational network analysis</div> </li>\n<li>\n<div>Predictive modeling with machine learning algorithms</div> </li>\n<li>\n<div>Natural language processing</div> </li></ul></li>\n<li>\n<div>Ability to work through others, lead and influence in teams</div></li>\n<li>\n<div>High level of initiative and ability to lead in new or rapidly evolving areas with limited direction</div></li>\n<li>\n<div>Ability to advocate for learning of analytics within the HR workforce, develop and conduct training for HR function</div></li>\n<li>\n<div>Comfortable working in ambiguous situations, where detailed business objectives need to be refined via exploration and experimentation</div></li>\n<li>\n<div>Strict adherence and experience with confidentiality associated with the practice of Human Resources</div></li>\n<li>\n<div>Excellent communication skills and the ability to interact with individuals at all levels of the organization</div></li>\n</ul>\nWe make what matters work. Everywhere you look—from the technology and machinery that surrounds us, to the critical services and infrastructure that we depend on every day—you’ll find one thing in common. It all relies on power. That’s why Eaton is dedicated to improving people’s lives and the environment with power management technologies that are more reliable, efficient, safe and sustainable. Because this is what matters.\n<br><br>\nWe are confident we can deliver on this promise because of the attributes that our employees embody. We’re ethical, passionate, accountable, efficient, transparent and we’re committed to learning. These values enable us to tackle some of the toughest challenges on the planet, never losing sight of what matters.\n<br><br>\n<strong>Job: Human Resources</strong>\n<br><br>\n<strong>Region: North America – US/Puerto Rico</strong>\n<br>\n<strong>Organization: Corporate Sector</strong>\n<br><br>\n<strong>Job Level: Individual Contributor</strong>\n<br>\n<strong>Schedule: Full-time</strong>\n<br>\n<strong>Is remote work (i.e. working from home or another Eaton facility) allowed for this position?: Yes</strong>\n<br>\n<strong>Does this position offer relocation?: Relocation from within hiring country only</strong>\n<br>\n<strong>Travel: Yes, 25 % of the Time</strong>"}