{"job title": "Equity Data Scientist", "company": "Eaton Vance", "city state": "– Boston, MA", "rating": "4.2", "job description": "The Equity Data Scientist role will be central to delivering new and actionable insights to our fundamental equity investment teams. The position will be part of a new team formed to analyze external and internal data sets, build machine learning models and provide actionable insights to Eaton Vance equity investment teams. This is an opportunity to be part of a new and important initiative within Eaton Vance Equities.\n<br><br>\nPrimary Responsibilities:\n<br><br>\nJoin and help build a team to drive data driven investment insights from external and internal data sets.\n<br><br>\nDevelop machine learning models based on a wide range of data sets to provide unique and actionable insights to our equity investment teams\n<br><br>\nRigorously evaluate machine learning models for statistical significance and design appropriate validation and testing processes for model selection\n<br><br>\nHelp source and evaluate new internal and external data sets\n<br><br>\nLead data cleaning and data integrity initiatives to support analytics and machine learning model development\n<br><br>\nDistill business requirements to define scope and functionality/capability for equity analytics projects to solve new and existing challenges within the Equities Department.\n<br><br>\nDevelop visualizations to share analysis and insights across a large group of business users\n<br><br>\nHelp develop and work with the IT team to develop next generation data storage and processing architectures to enable agile analytics capabilities within the Equity Group.\n<br><br>\nHelp in developing next generation data governance standards\n<br><br>\nJob Requirements:\n<br><br>\nMasters or PhD in a quantitative discipline (i.e. Statistics, Mathematics, Computer Science, Econometrics, Operations Research)\n<br><br>\n2-4 years of hands-on work experience developing and applying machine learning models and other advanced statistical approaches in an academic, corporate or consulting setting\n<br><br>\nStrong programming skills in Python and R.\n<br><br>\nFinancial services experience preferred.\n<br><br>\nExperience linking multiple data platforms with data visualization tools (e.g., Tableau)\n<br><br>\nExperience with Public Cloud Platforms (AWS, Azure, Google Cloud Platform)\n<br><br>\nAdvanced knowledge of data management tools including SQL/RDBMS, NoSQL (e.g. MongoDB), Hadoop and/or other big data technologies\n<br><br>\nIntellectual curiosity, along with excellent problem-solving and quantitative skills, including the ability to disaggregate issues, identify root causes and recommend solutions\n<br><br>\nStrong communications skills and ability to communicate complex statistical concepts, advanced models capabilities and limitations along with recommended actions in an easy to understand way\n<br><br>\nStrong people skills, team-orientation, and a professional attitude\n<br><br>\nAbility to lead junior team members and provide direction on data cleaning and transformation"}