{"job title": "Sr. Data Engineer", "company": "Ebates", "city state": "– San Mateo, California, United States, Americas", "rating": "3.8", "job description": "<div><div><div><div><div>We're always looking for talented\n<br>\nand creative people to join our team. Ebates offers a casual but fast paced\n<br>\nenvironment where creativity and effective teamwork and collaboration are\n<br>\nrewarded. We are passionate about changing the way people shop online and\n<br>\nproviding the best possible customer experience - not to mention cash back on\n<br>\nevery purchase, with no strings attached. In 2017, members spent over $10\n<br>\nbillion on Ebates' websites and since the inception of the company, have earned\n<br>\nnearly $1 billion in cash back. During the peak days of 2017, over 5% of U.S.\n<br>\nonline shopping went through Ebates!\n<br><br>\nEbates is a profitable, high\n<br>\ngrowth e-commerce company based in the San Francisco Bay Area. We are part of\n<br>\nthe Rakuten family of companies. Rakuten is a very progressive company\n<br>\nproviding Ebates with substantial capital, access to great technology, and\n<br>\naccess to international markets. We're always interested in meeting talented\n<br>\nindividuals interested in helping us change the way the world shops, so if\n<br>\nyou're passionate about helping save people money and improving the shopping\n<br>\nexperience apply now!\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nWe are in search of a <strong>Sr. Engineer/Sr. Data Engineer</strong>, which may be based in our San Mateo or San Diego, CA offices. This is a tremendous opportunity\n<br>\nto join a fast-growing team at a fast-growing company! Ebates is the\n<br>\narchetypical data driven company, and that couldn’t happen without its internal\n<br>\nbusiness intelligence (BI) systems. This role is the perfect opportunity for\n<br>\nthose looking to move into the world of business intelligence and reporting.\n<br>\nYou will get to play a pivotal role in revenue monitoring and problem\n<br>\nresolution, whilst learning the cutting-edge BI technology that Ebates has\n<br>\ndeveloped.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Design and build our Big Data pipeline that can transfer and\n<br>\nprocess several terabytes of data using Apache Spark, Apache Kafka, Hive\n<br>\nand Impala</li><li>Perform ad hoc data analysis, data processing and data\n<br>\nvisualization using SQL and other programming languages</li><li>Design and build data applications that will drives or enhances\n<br>\nour products and customer experience</li><li>Work directly with product stakeholders at the company to help\n<br>\nthem solve their most difficult problems</li>\n</ul>\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>Experience with Apache Spark, Hadoop, Yarn</li><li>Familiarity with SQL and NoSQL technologies</li><li>Excellent programming skills in Scala &amp; Python</li><li>Must have experience in designing and building large-scale data\n<br>\napplications and data pipelines in production</li><li>Experience with tools and technologies like Gradle, Maven,\n<br>\nJenkins, Airflow, git, IntelliJ, Eclipse, Jupyter, Docker to support end to end\n<br>\nsoftware development</li><li>Well versed in software development principles</li><li>Capable of mentoring and managing junior engineers</li><li>Must be self-organized and focused on continues improvements of the\n<br>\nplatform and the team</li><li>Must be a self-starter and a team player with great communication\n<br>\nskills</li><li>Highly motivated to add value to the team and platform using\n<br>\ninnovations around data and data applications</li>\n</ul>\nAny unsolicited resumes/candidate\n<br>\nprofiles submitted through our website or to personal email accounts of\n<br>\nemployees of Ebates are considered property of Ebates and are not subject to\n<br>\npayment of agency fees.</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}