{"job title": "Data Scientist", "company": "Ebates", "city state": "– San Mateo, California, United States, Americas", "rating": "3.7", "job description": "<div><div><div><div><div>We're always looking for\n<br>\ntalented and creative people to join our team. Ebates offers a casual but fast\n<br>\npaced environment where creativity and effective teamwork and collaboration are\n<br>\nrewarded. We are passionate about changing the way people shop online and\n<br>\nproviding the best possible customer experience - not to mention cash back on\n<br>\nevery purchase, with no strings attached. In 2016, members spent over $6\n<br>\nbillion on Ebates' websites and since the inception of the company, have earned\n<br>\nnearly $1 billion in cash back. During the peak days of 2016, over 5% of U.S.\n<br>\nonline shopping went through Ebates!\n<br><br>\nEbates is a profitable, high\n<br>\ngrowth e-commerce company based in the San Francisco Bay Area. We are part of\n<br>\nthe Rakuten family of companies. Rakuten is a very progressive company\n<br>\nproviding Ebates with substantial capital, access to great technology, and\n<br>\naccess to international markets. We're always interested in meeting talented\n<br>\nindividuals interested in helping us change the way the world shops, so if\n<br>\nyou're passionate about helping save people money and improving the shopping\n<br>\nexperience apply now!\n<br><br>\nWe're seeking an exceptional <strong>Data Scientist</strong> with deep expertise in\n<br>\nstatistics, machine learning and optimization to help drive growth on a core\n<br>\npart of our product offering. You should be a team player, with the ability to\n<br>\nwork with wide range of stakeholders and functional teams, and be comfortable\n<br>\non the front lines of the business making a real difference. You will be\n<br>\nresponsible for creating and enhancing data science products, through\n<br>\ninnovative thought processes, all the way from conception to deployment and\n<br>\ntesting. This role is perfect for someone looking to make a real difference by\n<br>\ndeploying their data science skill set at a successful and growing company.\n<br><br>\nPlease note this position may\n<br>\nbe in our San Mateo office but we may have flexibility for another Ebates\n<br>\noffices as appropriate.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Design and develop scalable\n<br>\n algorithms, using large amounts of data, to drive ever smarter products</li></ul>\n\n<ul>\n<li>Use data mining skills to\n<br>\n design and develop tools that can optimize recommendations and user\n<br>\n experience for our website customers</li></ul>\n\n<ul>\n<li>Use internal data to\n<br>\n better understand customer behavior within the business funnel, from\n<br>\n acquisition, through retention to monetization</li></ul>\n\n<ul>\n<li>Deliver\n<br>\n impact on variety of areas like content personalization, customer\n<br>\n communication, payments, product development and merchant relationships</li></ul>\n\n<ul>\n<li>Practice\n<br>\n and recommend latest technology trends and statistical / mathematical\n<br>\n methodologies</li></ul>\n\n<ul>\n<li>Work\n<br>\n closely with a variety of teams to deploy tests, drive deployment and adoption\n<br>\n of data science products</li>\n</ul>\n\n<br>\n<div><strong>Qualifications:</strong></div> <ul>\n<li>MS in\n<br>\n Computer Science, Statistics, Applied Mathematics, or a related field</li></ul>\n\n<ul>\n<li>4+\n<br>\n years experience working as a data scientist at an e-commerce website</li></ul>\n\n<ul>\n<li>Strong\n<br>\n R or Python skills</li></ul>\n\n<ul>\n<li>Strong\n<br>\n SQL skills</li></ul>\n\n<ul>\n<li>Strong\n<br>\n applied machine learning skills of multiple techniques and algorithms,\n<br>\n such as decision trees, regression, k-NN, unsupervised pattern detection\n<br>\n etc.</li></ul>\n\n<ul>\n<li>Experience working with\n<br>\n reporting tools (Tableau preferred)</li></ul>\n\n<ul>\n<li>Experience with Scala a\n<br>\n plus</li></ul>\n\n<ul>\n<li>Experience working as a\n<br>\n data scientist for an e-commerce website</li></ul>\n\n<ul>\n<li>Experience developing\n<br>\n optimization and recommendation algorithms</li></ul>\n\n<ul>\n<li>Experience using\n<br>\n statistics and a variety of models to understand the workings of an\n<br>\n ecommerce business</li></ul>\n\n<ul>\n<li>Experience communicating\n<br>\n analyses and fielding questions from executive team members</li></ul>\n\n<ul>\n<li>Experience with\n<br>\n successfully moving data science products from prototypes to production\n<br>\n release</li></ul>\n\n<ul>\n<li>Experience working in a\n<br>\n fast-paced, entrepreneurial environment</li></ul>\n\n<ul>\n<li>Experience working on\n<br>\n multiple projects at the same time, with short deadlines</li>\n</ul>\nAny unsolicited\n<br>\nresumes/candidate profiles submitted through our website or to personal email\n<br>\naccounts of employees of Ebates are considered property of Ebates and are not\n<br>\nsubject to payment of agency fees.</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}