{"job title": "Sr. Manager, Data Engineering", "company": "Ebates", "city state": "– San Mateo, California, United States, Americas", "rating": "3.8", "job description": "<div><div><div><div><div>We're always looking for talented and creative people to join our team. Ebates offers a casual but fast paced environment where creativity and effective teamwork and collaboration are rewarded. We are passionate about changing the way people shop online and providing the best possible customer experience - not to mention cash back on every purchase, with no strings attached. In 2017, members spent over $10 billion on Ebates' websites and since the inception of the company, have earned nearly $1 billion in cash back. During the peak days of 2017, over 5% of U.S. online shopping went through Ebates!\n<br><br>\nEbates is a profitable, high growth e-commerce company based in the San Francisco Bay Area. We are part of the Rakuten family of companies. Rakuten is a very progressive company providing Ebates with substantial capital, access to great technology, and access to international markets. We're always interested in meeting talented individuals interested in helping us change the way the world shops, so if you're passionate about helping save people money and improving the shopping experience apply now!\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nWe are in search of a <u>hands-on, technical</u> <strong>Sr. Manager, Data Engineering</strong>, which may be based in our San Mateo, CA office. This is a tremendous opportunity to join a fast-growing team at a fast-growing company! Ebates is the archetypical data driven company, and that couldn’t happen without its internal business intelligence (BI) systems. This role is the perfect opportunity for those looking to move into the world of business intelligence and reporting. You will get to play a pivotal role in revenue monitoring and problem resolution, whilst learning the cutting-edge BI technology that Ebates has developed.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Design and build our Big Data pipeline that can transfer and process several terabytes of data using Apache Spark, Apache Kafka, Hive and Impala</li><li>Perform ad hoc data analysis, data processing and data visualization using SQL and other programming languages</li><li>Design and build data applications that will drives or enhances our products and customer experience</li><li>Work directly with product stakeholders at the company to help them solve their most difficult problems</li>\n</ul>\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>Experience with Apache Spark, Hadoop, Yarn</li><li>Familiarity with SQL and NoSQL technologies</li><li>Excellent programming skills in Scala &amp; Python</li><li>Must have experience in designing and building large-scale data applications and data pipelines in production</li><li>Experience with tools and technologies like Gradle, Maven, Jenkins, Airflow, git, IntelliJ, Eclipse, Jupyter, Docker to support end to end software development</li><li>Well versed in software development principles</li><li>Capable of mentoring and managing junior engineers</li><li>Must be self-organized and focused on continues improvements of the platform and the team</li><li>Must be a self-starter and a team player with great communication skills</li><li>Highly motivated to add value to the team and platform using innovations around data and data applications</li>\n</ul>\nAny unsolicited resumes/candidate profiles submitted through our website or to personal email accounts of employees of Ebates are considered property of Ebates and are not subject to payment of agency fees.\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}