{"job title": "Data Scientist", "company": "eBay", "city state": "– Austin, Texas", "rating": "3.6", "job description": "Job Description<br><br>At eBay, you will be part of a purpose driven community dedicated to creating a bold and versatile work environment. In eBay Payments, you will be an integral member of a growing organization that inspires passion, courage and inventiveness - creating the future of global commerce and making an important, positive impact on millions of eBay sellers and shoppers around the world. If you are looking for a special place to take your Payments career to the next level, we want to talk with you!\n<br><br>\nRisk Management is at the core of Payments done well and we are hiring curious, driven, and courageous experts to transform our business unit to enable eBay's next generation Payments strategy. Our focus is to ensure the integrity of our marketplace for buyers and sellers who transact with us every single day. The scope of our charter includes Risk Management Strategy, Policy, Decision Sciences, and Policy Operations.\n<br><br>\nWe are looking for a highly talented and self-motivated data scientist to join our Decision Science team. Decision Science contains both data scientists and software engineers responsible for creating and implementing state of the art machine learning algorithms for fraud detection and risk assessment in support of Risk Management. The primary responsibility of this role is to assist in algorithm development inside of a high throughput, low latency, big data environment.\n<br><br>\n<strong>Primary</strong><strong>Job</strong><strong>Responsibilities</strong>\n<br><br>\nThe data scientist will support the risk department, leveraging big data technologies to aggregate and structure data, perform statistical analysis, and build algorithmic solutions to reduce fraud, monitor our buyers and sellers, and intermediate payments to improve the overall eBay experience. You will mine and analyze massive amount of unique internal and external data to gain deep business knowledge and insight on customer activity and usage behaviors and their relationships with fraud, credit risks, and other types of behaviors. Acts as the technical owner of projects that may require significant customization of existing analytic tools, techniques, processes or development of new ones. Perform statistical data analysis and understanding, ensure data quality, and develop tracking and reporting systems to determine the effectiveness of models, rules, and other risk initiatives and programs. Design and create systems to structure, aggregate, and turn petabytes of messy information into statistically significant features for modeling purposes. Problem sets are focused around fraud and risk management to include models to prevent fraudsters from listing and monetizing on the platform, thwarting registration attacks, and risk scoring our customers.<br><br><br><br><strong>Required</strong><strong>Skills</strong><strong>and</strong><strong>Experience:</strong>\n\n<ul>\n<li>Bachelors degree in a quantitative field, MS/PHD preferred</li><li>Entry to mid level role.</li><li>Experience in SQL, relational databases</li><li>Experience with Big Data technology: Hadoop framework: Hive, Spark, etc. a plus</li><li>Expertise in machine learning packages Python, R,SAS</li><li>Strong knowledge of 1 or more scripting and programming languages (Python, Java, Scala, etc.)</li><li>Background in a variety modeling techniques: GBM, logistic regression, clustering, neural networks, NLP</li><li>Strong analytical skills with good problem solving ability</li>\n</ul>\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\n<br><br>\nView our privacy policy\n<br><br>\nView our <u>accessibility info</u>\n<br><br>\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.\n<br><br>\nFor more information see:\n<br><br>\nEEO is the Law Poster\n<br><br>\nEEO is the Law Poster Supplement"}