{"job title": "Data Engineer", "company": "eBay Inc.", "city state": "– San Francisco, CA", "rating": "3.7", "job description": "REQUIRED SKILLS:\n<br><br>\nProvide technical leadership and contribute to the definition, development, integration, test, documentation, and support across multiple platforms (Unix, Hadoop, Oracle and Informatica utilities)\n<ul>\n<li>Analyze, assimilate and integrate multi-technology data systems by building a unified back-end platform and a web enabled front-end</li><li>Instill best practices for software development and documentation, assure designs meet requirements, and deliver high-quality work on tight schedules</li><li>Involve in all phases of software development from review of functional specification through assisting with test plans and final QA cycle. Actively participates in monitoring and troubleshooting of production platform related issues</li><li>Perform day-to-day tasks that ensure technology platform remains stable and available to users. Closely work with cross functional team to enhance systems, trouble-shoot data issues, etc</li></ul>\n\n<ul>\n<li>Bachelors degree in Computer Engineering or equivalent is desired</li><li>8+ years of post-college working experience with full life cycle of ETL development in Data Warehouse and Data Integration projects using using Informatica or any other similar ETL tool and Big Data</li><li>6+ years Linux/Unix/Perl experience, including scripting and version control with working knowledge of Oracle database</li><li>5+ years of Unix development experience is required</li><li>2+ years of Hadoop using Map Reduce or Hive or Pig or any other Bid Data eco-system tool.</li><li>Expertise in Shell scripting, system/process automation is required</li><li>Expertise in data research/analysis with a focus on data quality and consistency is required</li>\n</ul>\n<strong>Why StubHub?</strong><br><br>StubHub is the world's largest ticket marketplace, enabling fans to buy and sell tickets to tens of thousands of sports, concert, theater and other live entertainment events. StubHub reinvented the ticket resale market in 2000 and continues to lead it through innovation. The company's unique online marketplace, dedicated solely to tickets, provides all fans the choice to buy or sell their tickets in a safe, convenient and highly reliable environment. All transactions are processed and delivered by StubHub and backed by the company's FanProtect Guarantee processing a ticket every second today with billions of ticket sales each year globally. Company partners MLB, AEG, ESPN and many leading teams such as the San Francisco Giants and University of Texas, along with over 60 other teams in MLB, NBA, NHL and NCAA.\n<br><br>\n<strong>Our Values</strong>\n<ul>\n<li>StubHub One We act as one team in pursuit of connecting people through inspiring event experiences.</li><li>At StubHub, we are:</li><li>Driven We strive for excellence constantly improving our game</li><li>Courageous We are bold &amp; not afraid to challenge the status quo</li><li>Inventive We see what others dont &amp; pioneer new paths</li><li>Richly Diverse We recognize &amp; respect everyone as a unique individual</li><li>Brand We experience the world through StubHub.</li>\n</ul>\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies\n<br><br>\nView our privacy policy\n<br><br>\nView our <u>accessibility info</u>\n<br><br>\neBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.\n<br><br>\nFor more information see:\n<br><br>\nEEO is the Law Poster\n<br><br>\nEEO is the Law Poster Supplement"}