{"job title": "Data Scientist", "company": "Edifecs", "city state": "– Bellevue, WA, United States", "rating": "4.0", "job description": "At a time when healthcare reform is on the national agenda, and U.S. healthcare expenditures have reached an all-time high, Edifecs leverages its expertise in business and process automation on behalf of its customers to solve complex data management challenges and automate manual administrative tasks, without incurring the risk, time and cost of replacing existing IT infrastructure. For 20 years, Edifecs has been at the forefront of modernizing healthcare delivery across the nation. Edifecs delivers software solutions that streamline the exchange and processing of healthcare information in real time among payers, providers and employers to help drive down administrative costs, while enabling compliance with current mandates such as HIPAA 5010 and ICD-10.\n<br><br>\nEdifecs Data Science is redefining predictive analytics in the Enterprise healthcare with its unique Machine Learning platform EASH. This Edifecs real-time healthcare intelligence engine integrated witbh the core Edifecs products including Smart Trading provides Payers and Providers with advanced analytic and ML tools, capabilities and a SaaS platform to modernize and improve the insights, decisions and value derived from their current platforms. Our goal is to provide a completely data-driven analytics platform to enrich our customers' existing apps and workloads for a more efficient and productive healthcare ecosystem. We are looking for a Senior Data Scientist to help define and disseminate our Data Science products enabling data driven decision making via advanced Machine Learning, micro-services apps and visualization.\n<br><br>\n<u>\n<br>\nESSENTIAL DUTIES AND RESPONSIBILITIES</u>\n<ul>\n<li>Leads development of high complexity models and training sets</li><li>Provides hands-on execution and implementation of data science models</li><li>Translates business analysis needs into well-defined data science problems, and selecting appropriate models and algorithms and</li><li>Communicates model evaluation, process, assumptions, and implications of results back to a variety of stakeholders</li><li>Recognizes and prioritizes the most important work related to data science models to achieve highest operational impact for analytics in the business</li><li>Balances tradeoffs among analytics value, model development methods and design and technologies used to implement data science models with a bias toward action</li><li>Performs collaborative work on data science problems and mentor junior data scientists</li><li>Creates shared process models to effectively articulate multiple views of the business solutions that support technical architecture for Big Data platform implementation of stabilized ML core</li><li>Manages development of quantitative models and tools</li><li>Collaborates with leaders, other LOBs, and business partners to work on projects</li><li>Develops new or revises complex models to enhance eHealth payer and Provider use cases, and various other metrics to identify potential opportunities</li><li>Assesses business implications associated with modeling assumptions, inputs, methods, technical implementation, analytic procedures and processes, and advanced data analysis</li><li>Partners with leaders to drive high performance in their lines of business</li><li>Develop deep understanding of business drivers and financial levers to provide strategic decision support</li><li>Oversees resolution of complex projects and programs</li><li>Develops and maintains up-to-date detailed project schedules and work plans</li><li>Performs analysis on complex data models requiring customized reports and data and presents recommendations</li>\n</ul>\n<u>\n<br>\nREQUIRED SKILL SET &amp; EXPERIENCE</u>\n<ul>\n<li>M.S. or Ph. D. Degree in Computer Science, Engineering, Mathematics, Applied Sciences, Statistics or job-related discipline or equivalent experience</li><li>Job-related experience, 8 years, OR Master’s Degree and job-related experience, 6 years, OR Doctorate Degree and job-related experience, 3 years</li><li>Experience in data modeling, 5 years</li><li>Experience with Python, R, Scala, SQL</li><li>Experience developing solutions with Pandas/Scikit-learn, Spark or comparable technologies</li><li>Experience data science notebooks (Jupyter, Zeppelin or other)</li><li>Experience with AWS, Azure, cloud computing technologies</li><li>Healthcare industry (Claims Payer/Provider) experience</li><li>Experience designing efficient data science workflows and database architecture for data science purposes</li><li>Experience with forecasting, Bayesian networks, and graph analytics; Strong statistics experience</li><li>Ability to develop reports, models, and simulations as needed to perform at the job level</li><li>Competency in developing and delivering multi-mode communications that convey a clear understanding of the unique needs of different audiences</li>\n</ul>\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, sex, religion, national origin, protected veteran status, disability status, or any other characteristic protected by law.\n<br><br>\nEdifecs will provide reasonable accommodation to individuals with disabilities who need assistance applying for a job. Please contact <strong>careers@edifecs.com</strong> for more information.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}