{"job title": "Data Scientist", "company": "Edj Analytics", "city state": "– Louisville, KY", "rating": "NA", "job description": "Who We Are\n<br><br>\nBased in Louisville, EdjAnalytics is committed to helping clients find edge in competitive markets by leveraging their existing data in evidence-based decision-making processes and complex problem-solving. We find this approach can prove equally powerful across a breadth of domains from commodity traders to professional sports teams, universities to hospitals, and beyond. Our small but highly motivated team is comprised of dedicated individuals from diverse intellectual backgrounds, and each of us is encouraged to challenge each other to innovate and improve in an open, collegial work environment.\n<br><br>\nWho We Want\n<br><br>\nOur Data Scientists study and model client data sets by applying both statistical and machine learning techniques to discover patterns and develop tools that aid client decision making. You will collaborate with other team members to explore new approaches and expand our solution toolbox through rigorous testing and validation. You will also work closely with our data science team to clean and model data. Your primary focus will be working on projects within the healthcare industry. You will be expected to learn and share knowledge on a consistent basis and to improve team outcomes with each new client experience.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Explore, clean, and manipulate data</li>\n\n<li>Build predictive models</li>\n\n<li>Evaluate and validate model performance</li>\n\n<li>Translate concepts and ideas into clearly defined modeling objectives</li>\n\n<li>Create compelling data visualizations to support conclusions and provide recommendations</li>\n\n<li>Provide independent verification and thoughtful critique of team members’ work</li>\n\n<li>Mentor and provide direction to analyst and intern team members</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>Bachelor’s degree in engineering, statistics, mathematics, computer science or a related discipline emphasizing scientific inquiry</li>\n\n<li>Must have experience working within healthcare industry</li>\n\n<li>Three to five years experience working in a field using machine learning or other predictive modeling techniques, and/or graduate study in engineering, statistics, mathematics, computer science or related field</li>\n\n<li>Existing familiarity with tools and technologies used in data analysis and modeling: R, Python, SAS, SQL, etc</li>\n\n<li>Creative problem-solving skills</li>\n\n<li>Self-drive to consistently learn new skills and methodologies</li>\n\n<li>Ability to work independently and be self-sufficient</li>\n\n<li>Willingness to adapt in order to thrive in a collaborative startup environment</li>\n\n<li>Understanding of statistical significance, confidence intervals, uncertainty estimation and diligent application of the scientific method</li>\n\n<li>Proficient written and verbal communication skills</li>\n\n<li>Must be authorized to work in the U.S.</li>\n</ul>\n<strong>Desired Additional Qualifications</strong>\n<br><br>\n<ul>\n<li>Demonstrated computer programming/software development skills</li>\n\n<li>Deep and meaningful experience in any of the following areas: Bayesian statistics including MCMC, Bayesian nonparametric models, spatiotemporal models, time-series models, causal inference, hierarchical models, deep-learning, dynamic programming, reinforcement learning, extreme value statistics or power-law data modeling</li>\n\n<li>Demonstrated experience with data visualization, particularly interactive and/or dynamic visualization</li>\n\n<li>Experience in communicating and presenting data and concepts to clients and audiences with varying backgrounds</li>\n</ul>"}