{"job title": "Data Scientist", "company": "edX", "city state": "– Cambridge, MA", "rating": "4.0", "job description": "<strong>Overview</strong>\n<br><br>\nWe're looking for an exceptional senior-level data scientist to develop data products and drive better decision making across the edX organization and for our partners.\n<br><br>\nThis is an unusual ground floor opportunity to drive tremendous business value as we build a world-class data science team, establish edX as a thought leader in the emerging field of learning science, and most importantly have a major impact on our mission of providing high quality education to everyone, everywhere.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Identify, implement, and drive adoption of analytics-based solutions to business problems.</li>\n<li>Perform quantitative research on large data sets.</li>\n<li>Mentor other data scientists, engineers, and analysts, and provide scientific support across all departments and for end customers.</li>\n<li>Guide and potentially participate in the software implementation of data products.</li>\n<li>Innovate new ways data science can be used to support the organization and its mission.</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n<li>At least 5 years of data science research experience, ideally with at least 3 years in industry and/or a PhD in a quantitative discipline.</li>\n<li>Bonus: Experience with learning science or clickstream data.</li>\n<li>Extensive hands-on experience working with large, real world data.</li>\n<li>Demonstrably strong business orientation.</li>\n<li>Strong programming and algorithm development skills as applied to working with large data sets (e.g. in Python, R, SQL, Spark).</li>\n<li>A propensity toward action, and the mentality to get initial results quickly and iterate.</li>\n<li>Connoisseurship of good science: attention to experimental design, causality, bias, significance, etc.</li>\n<li>Heaploads of scrappiness, big picture thinking, and interest in solving fuzzy business problems.</li>\n<li>Strong attention to detail and motivation to minimize error.</li>\n<li>Excellent communication skills and a team player attitude.</li>\n<li>The desire to have fun while doing all of the above.</li>\n</ul>\n<strong>About edX</strong>\n<br><br>\nAre you ready to join a startup that's transforming education? At edX, our mission is to offer a world-class education to everyone, everywhere, allowing them to gain the in-demand skills and knowledge that will lead to career and lifelong success. Today, edX.org, a nonprofit in Cambridge provides more than 16 million people access to education from the best universities and institutions in the world, including Harvard, MIT, Oxford, and Microsoft. EdX provides inspirational and transformative knowledge to students of all ages, social status, and income who form worldwide communities of learners\n<br><br>\n<em>Applicants must be able to work out of our Cambridge, MA office. Sorry, Visa sponsorship is not available.</em>"}