{"job title": "Engineer/Scientist II - Data Analytics", "company": "Electric Power Research Institute, Inc.", "city state": "– Knoxville, TN", "rating": "3.7", "job description": "<strong>Job Title:</strong>Engineer/Scientist II - Data Analytics<strong>Location:</strong>Knoxville, TN<strong>Job Summary and Description:</strong><br><br>Performs complex engineering/ scientific analysis with moderate direction and supervision. Works directly with EPRI staff and moderate interaction with members and industry.\n<br><br>\n• Conducts technical searches and analyzes information in support of the project team.\n<br><br>\n• May conduct independent research.\n<br><br>\n• Assists Project/Program managers in assessing customer needs, formulating technical approaches, preparing proposals, technical publications/papers, and making presentations.\n<br><br>\nEducation:\n<br><br>\nBachelor’s Degree in a technical field or equivalent experience required\n<br><br>\nKnowledge, Skills, and Abilities:\n<br><br>\n• Must have satisfied requirements of entry level engineer/scientist and have 2-3 years of engineering experience or comparable work/educational experience required.\n<br><br>\n• Intermediate verbal and written communication skills\n<br><br>\n• Present research externally\n<br><br>\n• Understand how work fits across technical area\n<br><br>\n• Requires supervision and guidance to conduct specific research tasks and complete projects\n<br><br>\n• Works closely with contractors or staff to complete project research\n<br><br>\n• May participate in multiple projects\n<br><br>\n• Individual contributor<br><br><strong>Additional Job Information:</strong>\n\n<ul>\n<li>Master's degree preferred</li><li>Experience in the electric utility industry applying data analytics techniques is a plus (power industry experience not required)</li><li>Solid understanding and knowledge of technical basis and application of data analytics techniques</li><li>Ability to transform complex data sets into understandable results</li><li>Strong writing and presentation skills. Solid computer skills and attention to detail are essential</li><li>Excellent verbal and written communication skills</li><li>Knowledge of statistics, advance mathematics and experience using statistical packages for analyzing datasets (R, numpy, etc)</li>\n</ul>\n\nEPRI participates in E-Verify, an online system operated jointly by the Department of Homeland Security and the Social Security Administration (SSA). EPRI uses the system to check the work status of new hires by comparing information from the employee's I-9 form against SSA and Department of Homeland Security databases.Note: To ensure compliance with U.S. export controls, please indicate your U.S. citizenship or (for foreign citizens) your U.S. visa/immigration status in your resume or cover letter.EPRI is an equal opportunity employer. EEO/AA/M/F/VETS/DisabledTogether . . . Shaping the Future of Electricity.www.epri.com"}