{"job title": "Data Scientist", "company": "Electronic Arts", "city state": "– Austin, TX", "rating": "3.8", "job description": "Data Scientist, EA Customer Experience<br><br>#WeAreEA and we exist to inspire the world to play. EA values creativity, pioneering, passion, determination, learning, and teamwork. We mean things like acting with curiosity, speaking up with original ideas, and committing to each other as one team.\n<br><br>\nWere looking for all the best kinds of people to make great experiences for our players. The best people want a job that inspires them, while giving them room to enjoy their lives. And we want to give them that. We celebrate diversity and inclusion by creating a place where you can come to work and be yourself.<br><br>Youre a Data Scientist.<br><br>You know how to pull all types of data from any source, be it Facebook posts, call center chats, video likes or survey results. You understand that you have 2 basic jobs:\n<br><br>\nHelp our studios understand what problems players have with their games and provide insights that help optimize our call center. Both pursue the ultimate goal of providing the Worlds Best Service for the Worlds Best Games.\n<br><br>\nYou use all resources available to you to help solve a problem, be it a new algorithm, programming language or the person sitting next to you.\n<br><br>\nYoure a programmer/statistician/NLP expert who is fanatic about games and Customer Experiences.\n<br><br>\nYoure also a genuinely nice person who brings positive energy to an office. Youre approachable and take the time to listen so that you understand someone elses view.\n<br><br>\nThis role is part of EAs Customer Experience organization. The Customer Experience organization strives to make EA known for taking care of its players. Were players taking care of players and people talking to people whenever, wherever, and however they need us.<br><br>Were the Data Science team, part of the larger Customer Experience Insights team.<br><br>We are surrounded by Production, BI, SEO and Market Research analysts. Were the people who use advanced statistics and modeling to help solve business problems. We surface player problems through our text analytics offerings. We write a lot of code and talk to stakeholders from all teams and all levels. We are great team mates and trusted advisors, who provide insights to facilitate decisions and create models that change experiences.<br><br>A typical day in the life of a Data Scientist:\n\n<ul>\n<li>Come into the office and catch up with your team mates about last nights gaming session or the hottest show on TV (no spoilers until 24hrs have passed after that: anything is fair game!)</li><li>Check on last nights Jenkins script and add some code to a project youre working on</li><li>Talk to one of your coworkers on the Call Center side about how to match the right advisor to the right player this could be your next big project</li><li>Take some time back at your desk to write up any notes and make a project plan proposal</li><li>Attend a JIRA prioritization meeting to update work thats in flight and plan for work to come</li><li>Grab coffee and read up on any stats blogs or tech news youre subscribed to</li><li>Check out the model you deployed into production last month to see if its time to re-train</li><li>Pull the latest changes on an NLP model youre collaborating on from Stash and tinker with the parameters, then chat with your peer about the results of the tweaks and make plans for what to change next</li><li>Spend a couple of hours heads down/headphones on getting series with an analysis.</li><li>Finish the day looking over any code you wrote today, knit any Markdowns and make sure your documentation is up to snuff.</li>\n</ul>\nSo how do Data Scientists make great experiences for players? They:\n<ul>\n<li>Tell stories with data and interpret results for their stakeholders</li><li>Prioritize problems to solve based on the impact to the player experience while keeping overall organizational goals in mind</li><li>Have a basic understanding of EAs games and find time to play whenever they can</li><li>Display confidence in communicating with senior management, or any audience, to ensure what they say is heard and understood</li><li>Identify and lead collaborative efforts both inside and outside of their team; working with key influencers to effect change</li><li>Tailor communications to their audience, providing either in-depth expertise or a high-level summary depending on the situation</li><li>Use models and techniques that win on performance and understandability vs. sophistication</li>\n</ul>\nYoull need to be awesome at wearing these hats:\n<br><br>\n<em>Customer Advocate</em> You care what kind of experience our players are having when their games or services dont work and you want to be an active participant in improving it\n<br><br>\n<em>Programmer</em> Youre an expert at writing functions and identifying the right language for the right situation\n<br><br>\n<em>People Analyst</em> You understand that your work contributes to improving peoples lives not predict when a machine is going to break down\n<br><br>\n<em>Learner</em> You are a regular on Stack Overflow, know how to take apart a Vignette and are always looking for a new project that allows you to put that cutting edge technique to good use you read about last month\n<br><br>\n<em>Documentation Expert</em> you know just the right level of documentation to help yourself and the next person understand what you did, when and why\n<br><br>\n<em>Teacher</em> youre patient and can field questions from the rest of the team around better coding practices\n<br><br>\n<em>Experiment Designer</em> You can create up an A/B test in your sleep, but you dont let a less than ideal A/B test set up stop you from finding some answers\n<br><br>\n<em>NLP fanatic</em> you can turn language into math??? Yeah thats the stuff you love!<br><br>A few last things about how we work, because theyre super important:\n\n<ul>\n<li>We chat to each other in Slack</li><li>We email each other about things that can wait or are just FYI</li><li>We store all our code on Stash, how-tos on Confluence and complete analyses on the Knowledge Repo</li><li>We document our code like were going to win the lottery tomorrow and somebody else has to take over</li><li>We plan and track our work in JIRA so we can avoid duplication with other teams</li><li>We collaborate with Data Science at HQ to share best practices and exchange findings</li></ul>\n<br><br>\nIf youre interested in this role, youll need these skills or experiences:\n\n<ul>\n<li>3 to 5 years experience in Data Science with focus on NLP</li><li>Masters in Computer Science, Statistics, Operations Research or related field (we will consider a Bachelors degree with significant relevant experience)</li><li>Expert in at least one Statistical Programming Language such as R or Python</li><li>Experience with relational and distributed databases</li><li>Experience with any of the following is a big plus: PySpark, Scala, Zepplin Notebooks, Spark and MLlib as well as application development using AWS, Virtual Machines, or Docker</li><li>Gaming industry and customer support experience a plus</li>\n</ul>\nWhats in it for you? Glad you asked!\n<br><br>\nWe love to brag about our great perks like comprehensive health and benefit packages, tuition reimbursement, 401k company match and, of course, many other perks! And since we realize it takes world-class people to make world-class games, we offer competitive compensation packages and a culture that thrives off of creativity and individuality. At EA, we live the work hard/play hard credo every day. More about our location:\n<br><br>\nhttps://www.ea.com/careers/careers-overview/austin\n<br><br>\n#LI-TA1"}