{"job title": "Data Analyst", "company": "Eliassen", "city state": "– Boston, MA", "rating": "4.4", "job description": "Our well-known client is in search of an experienced Data Analyst to come in and hit the ground running on designing and creating new Data Models and help assist in the company-wide migration to AWS.<br><br>As a Data Analyst in this role, you will be responsible for the fundamental organization of a system embodied in its components, their relationships to each other and to the environment, and the principles guiding its design and evolution. Includes functions to create the conceptual, high-level, and detailed design of the software solution. Usually possesses extensive experience with multiple technical disciplines, across multiple platforms.\n<br><br>\n<strong>Requirements</strong>\n<ul>\n <li>Strong Python experience (Data Models are written in Python)</li> <li>AWS (Migrating Data from Teradata to Snowflake)</li> <li>Ability to work both independently and within team</li>\n</ul>\n<strong>Nice to Have</strong>\n<ul>\n <li>Financial experience</li>\n</ul>\nThis opportunity is a contract-to-perm opportunity with optional benefits including Health, Medical, Dental, Vision, 401K, etc.\n<br><br>\nFor those interested in the Data Analyst position in Richmond VA, please feel free to forward an updated copy of your resume to RQuinn@eliassen.com\n<br><br>\nKey Terms: Python, AWS, Teradata, Snowflake, Data Analyst, Data Scientist, Data Architect\n<br><br>\nJob ID: 312314\n<br><br>\n<strong>About Eliassen Group:</strong>\n<br><br>\nEliassen Group provides strategic talent solutions to drive our clients innovation and business results. Leveraging nearly 30 years of success, our expertise in IT staffing, Agile consulting, creative services, managed services, and life sciences enables us to partner with our clients to execute their business strategy and scale effectively. Headquartered in Reading, MA and with offices from coast to coast, Eliassen Group offers local community presence, deep networks, as well as national reach. For more information, visit http://www.eliassen.com.\n<br><br>\nEliassen Group is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br><br>\nDont miss out on our referral program! If we hire a candidate that you refer us to then you can be eligible for a <strong><em>$1,000 referral check!</em></strong>"}