{"job title": "Business Operations Data Analyst", "company": "Eliassen Group", "city state": "– Hopkinton, MA", "rating": "4.4", "job description": "Our client is a leader in enabling businesses and service providers to deliver information technology as a service (ITaaS). Our client helps IT departments to store, manage, protect and analyze their most valuable assets in a more agile, trusted and cost-efficient way. They are currently looking for a Business Operations Data Analyst to join their team.<br><br><em>This position has a great benefit package that includes Medical, Dental and Vision benefits, 401k with company matching, and life insurance for those who qualify.</em>\n<br><br>\n<strong>Responsibilities of the Business Operations Data Analyst:</strong>\n<ul>\n <li>Collaborate with business resources to create product master data to support product launch</li> <li>Use SAP/PLM and AccessDB and Excel data analyses to ensure data is correct across the enterprise</li> <li>Create Master Data Attribute Use Cases related to NPI's</li> <li>Collaborate across teams to ensure appropriate service levels in the NPI process</li> <li>Responsible for Quality of Materials and BOM information and its suitability for downstream processes</li> <li>Monitor and improve data quality through audits and corrective actions</li> <li>Work closely with partners across the organization to support new products/services</li> <li>Thoroughly document processes and create training materials</li>\n</ul>\n<strong>Requirements of the Business Operations Data Analyst:</strong>\n<ul>\n <li>Bachelor's degree preferred</li> <li>Experience with SAP Material Master</li> <li>Experience with Master Data Management</li> <li>Strong Excel and Access analysis skills</li> <li>Strong SQL skills</li> <li>Excellent collaboration skills</li>\n</ul>\nKeywords: Business Operations Data Analyst, SAP Material Master, Master Data Management, MDM, Excel, Access, SQL, NPI\n<br><br>\nJob ID: 313014\n<br><br>\n<strong>About Eliassen Group:</strong>\n<br><br>\nEliassen Group provides strategic talent solutions to drive our clients innovation and business results. Leveraging nearly 30 years of success, our expertise in IT staffing, Agile consulting, creative services, managed services, and life sciences enables us to partner with our clients to execute their business strategy and scale effectively. Headquartered in Reading, MA and with offices from coast to coast, Eliassen Group offers local community presence, deep networks, as well as national reach. For more information, visit http://www.eliassen.com.\n<br><br>\nEliassen Group is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br><br>\nDont miss out on our referral program! If we hire a candidate that you refer us to then you can be eligible for a <strong><em>$1,000 referral check!</em></strong>"}