{"job title": "Data Scientist", "company": "Eliassen Group", "city state": "– Stamford, CT", "rating": "4.5", "job description": "Our industry-leading client is seeking a Data Scientist to join their dedicated team in Stamford.<br><br><strong>Responsibilities of the Data Scientist:</strong>\n<ul>\n <li>Plan and execute the complete analytics life cycle for analytics and modeling projects</li>  <li>Survey varied data sources for analytic relevance, including distributed file systems, relational databases, flat files and external sources</li> <li>Experiment, build, test, and maintain analytic/data science models</li> <li>Drive, measure, and articulate business value</li> <li>Build and enhance organizational capabilities in data science</li> <li>Interpret, synthesize and communicate results of analysis to create action and changes within the organization</li> <li>Collaborate across teams to integrate analytic products with existing production architectures, develop, execute and evaluate courses of action and socialize results</li>\n</ul>\n<strong>Requirements of the Data Scientist:</strong>\n<ul>\n <li>Bachelor's degree in Data Science, Statistics, Engineering, or related required</li> <li>At least 2 years of data science/big data experience</li>  <li>Excellent communication and presentation skills</li> <li>Experience working in Hadoop, particularly Spark/MLlib</li> <li>Expert skills and experience with Python and/or R</li>  <li>Experience with advanced analytics libraries in Python and R such as pandas, NumPy, scikit learn, and relevant R packages</li> <li>Data pre-processing, exploratory data analysis using a variety of techniques</li> <li>Basic understanding of data architecture, data warehouse and data marts</li> <li>Broad experience and solid theoretical foundation on the modeling process using a variety of algorithmic techniques</li>  <li>Expert-level quantitative analysis skills</li>  <li>Experience with relational databases</li> \n</ul>\nKeywords: Data Scientist, Big Data, Python, R, Spark, MLlib, Pandas, NumPy, Scikit Learn\n<br><br>\nJob ID: 309521\n<br><br>\n<strong>About Eliassen Group:</strong>\n<br><br>\nEliassen Group provides strategic talent solutions to drive our clients innovation and business results. Leveraging nearly 30 years of success, our expertise in IT staffing, Agile consulting, creative services, managed services, and life sciences enables us to partner with our clients to execute their business strategy and scale effectively. Headquartered in Reading, MA and with offices from coast to coast, Eliassen Group offers local community presence, deep networks, as well as national reach. For more information, visit http://www.eliassen.com.\n<br><br>\nEliassen Group is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br><br>\nDont miss out on our referral program! If we hire a candidate that you refer us to then you can be eligible for a <strong><em>$1,000 referral check!</em></strong>"}