{"job title": "Data Analytics Specialist", "company": "Eliassen", "city state": "– Durham, NC", "rating": "4.4", "job description": "Our client is one of the oldest independent biotech companies in the world, with a commitment to innovation, excellence, and continual improvement of quality of life for people around the globe. They are currently looking for a Data Analytics Specialist to join their dedicated team.<br><br><em>This position has a great benefit package that includes Medical, Dental and Vision benefits, 401k with company matching, and life insurance for those who qualify.</em>\n<br><br>\n<strong>Responsibilities of the Data Analytics Specialist:</strong>\n<ul>\n <li>Coordinate with scientists to automate data processing and analysis</li> <li>Use Excel-based VBA workbooks to drive efficiency in lab testing</li> <li>Support LIMS/electronic laboratory notebook integrations</li>\n</ul>\n<strong>Requirements of the Data Analytics Specialist:</strong>\n<ul>\n <li>Bachelor's degree and at least 5 years of experience in data analytics</li> <li>Expertise in VBA programming</li> <li>Knowledge of additional programming languages and software like Tableau desired</li> <li>Clear and effective verbal and written communication skills</li>\n</ul>\nKeywords: Data Analytics Specialist, VBA Programming, Tableau, Excel, LIMS, Biotechnology\n<br><br>\nJob ID: 313307\n<br><br>\n<strong>About Eliassen Group:</strong>\n<br><br>\nEliassen Group provides strategic talent solutions to drive our clients innovation and business results. Leveraging nearly 30 years of success, our expertise in IT staffing, Agile consulting, creative services, managed services, and life sciences enables us to partner with our clients to execute their business strategy and scale effectively. Headquartered in Reading, MA and with offices from coast to coast, Eliassen Group offers local community presence, deep networks, as well as national reach. For more information, visit http://www.eliassen.com.\n<br><br>\nEliassen Group is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n<br><br>\nDont miss out on our referral program! If we hire a candidate that you refer us to then you can be eligible for a <strong><em>$1,000 referral check!</em></strong>"}