{"job title": "Data Scientist - Optimization", "company": "Eli Lilly and Company", "city state": "– Indianapolis, Indiana", "rating": "3.8", "job description": "At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We're looking for people who are determined to make life better for people around the world.\n<br><br>\n<strong>Responsibilities</strong>\n<br>\n<strong>Research Scientist - Optimization</strong> \n<br>\nHow would you like a career where you get to use your best analytical skills to make a substantial difference in the well-being of people across the globe? Bring YOUR skills and talents to Lilly and our Advanced Analytical and Data Sciences organization where you'll have the opportunity to make an impact on the lives of patients.\n<br>\nAs an innovation driven company we work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism.\n<br>\nOur Advanced Analytics and Data Sciences organization is growing to support the entire Lilly enterprise, from Discovery to Development to Manufacturing and Commercialization of our medicines. To solve the complex problems of a global business and the ever-evolving data and analytics landscape, the organization generally requires advanced degrees in statistics, mathematics, econometrics, operations research and computer science. We are playing a leading role in transforming the way the company discovers and develops new treatments, identifies personalized treatment regimens, drives efficiency in our operations and optimizes our commercialization of new products. We are doing this with an emphasis in the areas of machine learning and artificial intelligence, natural language processing and other approaches to unstructured data, advanced mathematical and predictive modeling, visual analytics and more. Whether you are intrigued by the research and development of new medicines or optimizing our commercialization/business, or driving efficiency into our operations, we have a position for you. You will be encouraged to identify important business problems and to further your own research interests in these areas including presentations and publications at professional meetings. Come join us on our amazing journey to make life better!\n<br><br>\n<strong>Key responsibilities include:</strong>\n\n<ul>\n<li>Partner with key business partners and work within team to identify, scope, and execute predictive analytic efforts that leverage data to answer business questions, solve business needs, and add business value</li><li>Maintain a broad understanding of the pharmaceutical industry (from discovery to commercialization) and be fully engaged with teams, bringing an objective voice to the table, and facilitating decisions grounded in data</li><li>Collaborate with other analytics team members to review and provide feedback on the analytics work being done, and be willing to seek feedback from other team members about your own work</li><li>Stay current with respect to new analytical methods in the area of optimization, to maintain proficiency in applying new and varied methods, and to be competent in justifying methods selected</li><li>Agility and flexibility to work with very diverse problems and business partners</li><li>Ability to work with diverse data sources and data types</li>\n</ul>\n\n<strong>42071BR</strong>\n<br><br>\n<strong>Basic Qualifications</strong>\n\n<ul>\n<li>Ph.D. in Operations Research, Applied Math, Computer Science or closely related field.</li><li>OR Master in Operations Research, Applied Math, Computer Science or closely related field with at least 5 years of related working experience.</li>\n</ul>\n\n<strong>Additional Skills/Preferences</strong>\n\n<ul>\n<li>Deep and broad knowledge of optimization methods (convex, nonlinear, mixed integer) and tools and best practices</li><li>Strong communication skills</li><li>Strong computational skills</li><li>Fluency in languages like R, SAS, SQL, and optimization software (like GAMS, etc.)</li><li>Make the impossible possible in your quest to make life better.</li><li>Bring Analytics to life by giving it zeal and making it applicable to our business.</li><li>Know, learn, and keep up-to-date on the analytical, computational and scientific advances to maximize your impact.</li><li>Bring an insatiable desire to learn, to innovate, and to challenge yourself for the benefit of patients.</li>\n</ul>\n\n<strong>Additional Information</strong>\n<br>\nLilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status."}