{"job title": "Senior Associate-Real World Data", "company": "Eli Lilly and Company", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "Req ID 45877 Title Senior Associate-Real World Data City Indianapolis State / Province Indiana Country United States Region North America Company Overview At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We're looking for people who are determined to make life better for people around the world.\n<br><br>\nResponsibilities The Lilly Real World Data (RWD) Team in Indianapolis, IN develops healthcare data solutions that deliver meaningful scientific insights to meet patient needs. Our team shares a passion for innovative approaches to discovering and capturing novel data to address gaps in evidence that supports decision-making in drug development and delivery of healthcare. This role is for someone who has curiosity, is innovative, and is driven to create a more holistic view of the patient (e.g. data detective/forensics). The RWD Team leverages their experience to bring an understanding of the healthcare setting that ensures data are used appropriately for insights across Lilly's therapeutic areas. This team applies concepts, theories, and practices to real world data to achieve better health outcomes.\n<br><br>\nPosition Responsibility\n<br><br>\nYou will work with an incredible team culture; a collaborative environment that is learning and evolving every day. You will be working for a company that makes a positive difference in the world. When you work at Lilly, you will enjoy meaningful work, build a successful career, and make important contributions to our patient's lives.\n\n\n<ul>\n<li>Develop and drive real world data strategy for multiple disease states</li>\n<li>Perform in-depth evaluation of RWD sources and make recommendations on which data source will best support business or research needs.</li>\n<li>Lead relationship with various data providers which includes assessing their capabilities and evaluating cost benefit of data sources</li>\n<li>Deliver projects that pioneer new RWD capabilities for Lilly</li>\n</ul>\n\n45877BR Basic Qualifications\n\n\n<ul>\n<li>Bachelor's degree in a health-related field or Bachelor's degree (other) with 3 years of work experience in an external healthcare setting (i.e. Nursing Informatics, Data Scientist in healthcare)</li>\n<li>Qualified candidates must be legally authorized to be employed in the United States. Lilly does not anticipate providing sponsorship for employment visa status (e.g., H-1B or TN status) for this employment position</li>\n</ul>\n\nAdditional Skills/Preferences\n\n\n<ul>\n<li>Demonstrated understanding of the flow of data and information within the healthcare environment.</li>\n<li>Demonstrated ability to understand and apply data flow, data quality, data interchange, data interrogation, and data representation principles.</li>\n<li>Familiarity with RWD tools and technologies. Strong agility in using computer software, including data visualization tools (e.g. Tableau, Spotfire).</li>\n<li>Demonstrated knowledge of drug development across the product lifecycle.</li>\n<li>Proven ability to design and deliver solutions that are customer focused, feasible, and economical.</li>\n<li>Deep therapeutic and clinical knowledge in the specific therapeutic areas supported.</li>\n<li>Vendor or alliance management experience</li>\n</ul>\n\n<strong>Additional Information</strong>\n\n\n<ul>\n<li>Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.<br><br>SDL2017</li>\n\n</ul>"}