{"job title": "Data Engineer", "company": "Elutions", "city state": "– Delafield, United States", "rating": "4.3", "job description": "** Elutions will be unable to sponsor or transfer any additional H-1B visas during the next 5 years**\n<br><br>\nElutions is a global <strong>Enterprise AI &amp; Automation</strong> company, empowering clients to drive continuous efficiency, cost and quality improvements. As the top leader in our industry, world-wide, we are constantly on the lookout for go-getters, people who aren't afraid to work hard, but have fun at the same time. Those who join our team aren't just bright, but who are willing to develop and hone their skills every day, all while making a significant difference in the world.\n<br><br>\n<strong>General Functions:</strong>\n\n<ul>\n<li>Responsible for expanding and optimizing data and data pipeline architecture</li>\n\n<li>Responsible for optimizing data flow and collection for cross-functional teams</li>\n\n<li>Experienced data pipeline builder and data wrangler who enjoys optimizing data systems and building them from the group up</li>\n\n<li>Support software developers, database architects, data analysts and data scientists on data initiatives to ensure optimal data delivery architecture is consistent throughout ongoing projects</li>\n\n<li>Must be self-directed and comfortable supporting the data needs to multiple teams, systems and products</li>\n\n<li>Excited by the prospect of optimizing or even redesigning our companys data architecture to support our next generation of products and data initiatives</li> \n</ul>\n<strong>Responsibilities for Data Engineer:</strong>\n\n<ul>\n<li>Create and maintain optimal data pipeline architecture</li>\n\n<li>Assemble large, complex data sets that meet functional/non-functional business requirements</li>\n\n<li>Identify, design, and implement internal process improvements including automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.</li>\n\n<li>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and big data technologies</li>\n\n<li>Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics</li>\n\n<li>Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs</li>\n\n<li>Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader</li>\n\n<li>Work with data and analytics experts to strive for greater functionality in our applications</li>\n</ul>\n<strong>Qualifications for Data Engineer:</strong>\n\n<ul>\n<li>Advanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases</li>\n\n<li>Experience building and optimizing big data data pipelines, architectures and data sets</li>\n\n<li>Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement</li>\n\n<li>Strong analytic skills related to working with unstructured datasets</li>\n\n<li>Build processes supporting data transformation, data structures, metadata, dependency and workload management</li>\n\n<li>A successful history of manipulating, processing and extracting value from large disconnected datasets</li>\n\n<li>Working knowledge of message queuing, stream processing, and highly scalable big data data stores</li>\n\n\n<li>\nExperience supporting and working with cross-functional teams in a dynamic environment</li>\n<li>Should also have experience using the following software/tools:</li>\n\n<li>Experience with big data tools: Hadoop, Spark, Kafka, etc.</li>\n\n<li>Experience with relational SQL and NoSQL databases, including Postgres and Cassandra</li>\n\n<li>Experience with data pipeline and workflow management tools: Azkaban, Luigi, Airflow, etc.</li>\n\n<li>Experience with stream-processing systems: Storm, Spark-Streaming, etc.\\</li>\n\n<li>Experience with object-oriented/object function scripting languages: Python, Java, C++, Scala, etc.</li>\n</ul>\n<strong>Motivational Fit:</strong>\n\n<ul>\n<li>Good communication skills, especially with teams in other locations</li>\n\n<li>Plans and organizes well</li>\n\n<li>Creative problem solver</li>\n\n<li>Initiates action</li>\n\n<li>Flexible and adaptable</li>\n\n<li>Team oriented</li>\n\n<li>Highly motivated</li>\n\n<li>High integrity</li>\n</ul>\n<strong>FLSA Classification:</strong>Exempt at all levels\n<br><br>\n<strong>Other Duties:</strong>\n<br><br>\nThe above duties are not intended to be all-inclusive or permanent. The requirements of the position may change based on business need or to aide in the employees growth and development. Duties, responsibilities and activities may change at any time with or without notice."}