{"job title": "Data Scientist", "company": "Emailage", "city state": "– Chandler, Arizona", "rating": "3.7", "job description": "<div>\nShare</div>\n<br>Are you an ambitious go-getter who is ready to take the next step in your sales career? If so, this could be the perfect opportunity for you!\n<br><br>\nEmailage ADR’s are a critical part of our marketing department and responsible for filling the sales funnel with high quality leads, qualifying inbound leads to determine sales readiness, and outbound work such as target research and data mining. Account Development Representatives are expected to work both independently and collaboratively within tools such as Salesforce and LinkedIn. Ideal candidates must be driven self-starters who are excited to be a part of something big and are motivated by growth opportunities.\n<br><br>\nThis is a full time, direct hire position in our Headquarters office in Chandler, Arizona that reports directly to the Vice President of Marketing.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n<ul>\n<li>Follow up and qualify leads from marketing campaigns as sales opportunities</li>\n<li>Outbound calls and emails</li>\n<li>Researching and completing missing lead information</li>\n<li>Responding to inbound email inquiries in a timely manner (under 1 hour)</li>\n<li>Set up meetings or calls between (prospective) clients and Account Executives</li>\n<li>Contact potential clients through cold calls and emails</li>\n<li>Present our company to potential clients</li>\n<li>Proactively seek new business opportunities in the market</li>\n<li>Targeted lead list building</li>\n</ul>\n<strong>Experience and Qualifications:</strong>\n\n<ul>\n<li>Experience with CRM software (e.g. Salesforce)</li>\n<li>Track record of achieving sales quotas</li>\n<li>Familiarity with MS Excel (analyzing spreadsheets and charts)</li>\n<li>1-2 years B2B SaaS sales experience a plus</li>\n<li>Marketing or Business degree or equivalent work experience</li>\n</ul>\n<strong>Desired Skills:</strong>\n\n<ul>\n<li>Ability to quickly learn new technologies, including marketing automation and project management tools</li>\n<li>Must be a self-starter and highly ambitious to grow your knowledge, skills and career</li>\n</ul>\n<strong>Company Benefits and Perks:</strong>\n<br><br>\nIt’s no secret that we work hard, but we also strive to create an office environment where the lines between work and play are blurred. This means we offer these great perks to help keep our team healthy, productive and happy:\n\n<ul>\n<li>High-end computer hardware</li>\n<li>Learning and career growth prospects</li>\n<li>Paid holiday and time off</li>\n<li>Referral bonus program</li>\n<li>Opportunities for profit sharing, bonuses and ownership</li>\n<li>Stock options</li>\n<li>Fast paced Startup Culture</li>\n</ul>\n<strong>About Emailage:</strong>\n<br><br>\nEmailage, founded in 2012 and with offices in Phoenix, London and Sao Paulo, is a leader in helping companies significantly reduce online fraud. Through key partnerships, proprietary data, and machine-learning technology, Emailage builds a multi-dimensional profile associated with a customer’s email address and renders a predictive risk score. Customers realize significant savings from identifying and stopping fraudulent transactions.\n<br><br>\nTo learn more, visit: www.emailage.com.<br><br>Apply Now"}