{"job title": "Data Scientist", "company": "EMC Insurance Group Inc.", "city state": "– Des Moines, IA", "rating": "3.4", "job description": "At EMC, you'll put your skills to good use as an important member of our team. You can count on gaining valuable experience while contributing to the company's success. EMC strives to hire and retain the best people by engaging, developing and rewarding employees.\n<br><br>\n<strong>Essential Functions:</strong>\n\n\n<ul>\n<li>Builds models to improve profitability, discover business insights and identify opportunities through the use of statistical, algorithmic, mining and visualization techniques</li>\n<li>Solves problems by integrating customers' past experience, cutting edge analytical techniques, and advanced technology</li>\n<li>Integrates, analyzes and models data across claims, underwriting, actuarial and risk improvement departments</li>\n<li>Performs exploratory data analysis from multi-dimensional datasets to develop innovative solutions</li>\n<li>Analyzes company data to recognize patterns, identify opportunities for efficiency, pose questions, and make recommendations that add value</li>\n<li>Communicates with internal and external customers to obtain business problem clarity and develop appropriate solutions throughout project lifecycles</li>\n<li>Determines data quality activities based on project needs</li>\n</ul>\n\n<strong>Education&amp;Experience:</strong>\n\n\n<ul>\n<li>Graduate degree in actuarial science, mathematics, statistics, economics, computer science, finance or a related field or graduate coursework and equivalent work experience in predictive modeling</li>\n<li>Two years of experience in data science, predictive modeling or analytics research</li>\n<li>Actuarial credentials in Casualty Actuarial Society or Society of Actuaries preferred</li>\n</ul>\n\n<strong>Knowledge, Skills&amp;Abilities:</strong>\n\n\n<ul>\n<li>Working knowledge of big data, statistics/probability and computer programming</li>\n<li>Internet of Things knowledge preferred</li>\n<li>Strong analytical, investigation and problem solving abilities</li>\n<li>Good working knowledge of Excel and Word</li>\n<li>Excellent knowledge of statistical software such as R or SAS and database software, such as Access and SQL</li>\n<li>Self-direction and teamwork skills</li>\n<li>Strong verbal and written communication skills</li>\n<li>Occasional travel required; a valid driver's license with an acceptable motor vehicle report per company standards required if traveling</li>\n</ul>\n\nOur employment practices are in accord with the laws which prohibit discrimination due to race, color, creed, sex, sexual orientation, gender identity, genetic information, religion, age, national origin or ancestry, physical or mental disability, medical condition, veteran status, citizenship status, marital status or any other consideration made unlawful by federal, state, or local laws.\n<br><br>\nAll of our locations are tobacco free including in company vehicles."}