{"job title": "Business Data Analyst, NA", "company": "Emerson Electric Co.", "city state": "– Marshalltown, IA", "rating": "3.6", "job description": "Description\n<br><br>\nThe Business Data Analyst analyzes past, present, and future demand data and collaborates with Emerson Impact Partners to assist in the preparation of forecasts and trends in manufacturing, finance, general business conditions, and other related areas. The Business Data Analyst searches out market information for better definition, conducts analysis with current quantitative techniques, and develops useful data and recommendations to enable Flow Controls to better understand its market place and allow the business to capitalize on both sales and profit gain.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Define product sales forecasts based on market analysis of customer, competitor and company data</li>\n<li>Collect, analyze, and interpret market data using appropriate analytics to develop forecast models of Fisher products</li>\n<li>Partner with key stakeholders to obtain market (Customer, Competitor, and Flow Controls) information</li>\n<li>Provide reports to management of market findings and impact to product sales forecast.</li>\n<li>Support Flow Controls Sales and Operational Planning through monthly participation and updates to product, plant, and \"Kind of Business\" ladder charts</li>\n<li>Integrate market research with current Sales and Operational Planning process through monthly adjustments to product bookings ($ and quantity) using SOP ladder charts</li>\n<li>Actively participate in continuous improvement activities to support business performance</li>\n<li>Devise methods to collect and categorize customer, competitor, and Flow Controls data</li>\n<li>Other duties as assigned by Demand/Supply Manager</li>\n<li>Demonstrate commitment to safety culture</li>\n</ul>\n\n<strong>Requirements</strong>\n<br><br>\n<strong>Education / Experience Required:</strong>\n<br><br>\n<strong>BA or BS Degree:</strong>\n<br><br>\nBachelor's degree in Information Systems, Systems Engineering, Data Management, Data Analysis, Computer Science, Mathematics, Software, Statistics, Accounting/Finance, Economics, other applied Science.\n<br><br>\nExperience Requirements: Two years in a manufacturing environment preferred.\n<br><br>\n<strong>Knowledge / Skills / Abilities:</strong>\n\n\n<ul>\n<li>Position requires Business metric analysis.</li>\n<li>Forecast and track market and sales data, analyzing collected data with product sales to understand trends.</li>\n<li>Self-starter comfortable working independently with limited direction.</li>\n<li>Process improvement and problem-solver mentality.</li>\n<li>Ability to work effectively in teams and interact with all levels of the organization.</li>\n<li>Ability to handle multiple tasks and meet various deadlines.</li>\n<li>Experience with data collection software (Access, Cognos, Noetix,Other)</li>\n<li>Outstanding oral and written communication skills.</li>\n<li>Clearly understand integrated financial systems and the Microsoft Office Suite</li>\n<li>Must possess advanced proficiency in Excel and other analytic tools such as SQL tables to generate graphs and analyze customer segments and preferences.</li>\n<li>Manage and manipulate data using statistical analysis of marketing and product data</li>\n</ul>\n\nWork Authorization\n<br><br>\nNo calls or agencies please. Emerson will only employ those who are legally authorized to work in the United States. This is not a position for which sponsorship will be provided. Individuals with temporary visas such as E, F-1, H-1, H-2, L, B, J, or TN or who need sponsorship for work authorization now or in the future, are not eligible for hire.\n<br><br>\nEqual Opportunity Employer\n<br><br>\nEmerson is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, age, marital status, political affiliation, sexual orientation, gender identity, genetic information, disability or protected veteran status. We are committed to providing a workplace free of any discrimination or harassment.\n<br><br>\nIf you have a disability and are having difficulty accessing or using this website to apply for a position, you can request help by calling 1-314-553-2544 (V/TTY/TDD) or by sending an email to idisability.administrator@emerson.com."}