{"job title": "Senior (Scientist) Manager, Analytical Sciences &amp; Technology (AS &amp; T)", "company": "Emergent BioSolutions", "city state": "– MD-Baltimore, United States", "rating": "3.1", "job description": "<div>Emergent BioSolutions is committed to assisting employees achieve their professional goals. Internal job postings are one of the tools available to employees at Emergent BioSolutions to assist in their career management. This enables current employees who have remained in their current position for a minimum of one year to apply for an open position.\n<br><br>\n<strong>I. Key Responsibilities:</strong>\n<br><br>\nRoutine job responsibilities include but not limited to:\n\n<ul>\n\n\t<li>Oversees and manages the daily Analytical Science and Technology (AS&amp;T) activities involved with transfer of analytical test methods for new product candidates to and from Baltimore Bayview.</li>\n<li>Guide development of transfer protocols and reports.</li>\n<li>Responsible for design, development, execution, statistical analysis of validation protocols for analytical, bioanalytical, and compendial methods used for the analysis of product and process impurities.</li>\n<li>Provides technical expertise for method optimization, development, verification and validation. This includes analyzing and interpreting data, writing protocols and reports, investigating analytical problems and developing approaches to rectify those problems.</li>\n<li>Provides scientific review and approval of protocols, reports, study design and standard operating procedures.</li>\n<li>Performs managerial duties, as assigned, in support of AS&amp;T operations such as resource management and failure investigation review.</li>\n<li>Demonstrated strong organizational and technical writing skills.</li>\n<li>Support and draft proposal for commercial and government clients.</li>\n<li>Act as project lead for client project</li>\n</ul>\n<strong>II. Education, Experience, and Skills</strong>\n\n<ul>\n\n\t<li>Bachelor’s degree in Microbiology, Biochemistry, or closely related scientific discipline with at least 10 years of relevant experience, MS with a minimum of 7 years of relevant experience, or PhD with at least 5 years of relevant experience.</li>\n<li>At least 5 years prior supervisory experience required.</li>\n<li>Expertise in more than one scientific discipline and demonstrated success in applying to a wide variety of practical problems.</li>\n<li>Must possess skills and knowledge within fields such as cellular, immunological, molecular, bioanalytical and chemical test methods; for example: ELISA, qPCR, IEF, viral assays, cell-based assays, SDS-PAGE, Western Blot, DNA sequencing, microbiological methods, Sterility testing, Endotoxin testing, HPLC with multiple modes of detection, CE, and UV and IR spectroscopy.</li>\n<li>Demonstrated success in independent judgment, technical proficiency, scientific creativity, collaboration with others in a cGMP environment</li>\n<li>Advanced knowledge of cGMPs, safety and data integrity.</li>\n<li>Experience in executing phase appropriate cGMP method validations.</li>\n<li>Experience in assay method validation, equipment validation, and analytical investigation for biotherapeutic and vaccine products.</li>\n<li>Support analytical method development, transfer and trending with statistical analysis</li>\n</ul>\nIf the hiring manager expresses an interest in interviewing you for the open position, you must discuss your interest in the open position with your current manager prior to an interview being scheduled.</div>\n<br>"}