{"job title": "Sr. Data Analyst | NTD -SC", "company": "Emory University", "city state": "– Atlanta, GA", "rating": "4.1", "job description": "Description\n<br><br>\nBACKGROUND: The Task Force for Global Health is an Emory University affiliate located in Decatur, GA. Its eight programs focus on building robust public health systems that serve all people. Program areas include neglected tropical diseases, vaccines, and health systems strengthening. The Task Force for Global Health was recognized for its extraordinary contributions to alleviating human suffering with the 2016 Conrad N. Hilton Humanitarian Prize, the world's largest award of its kind. The Task Force is ranked among the largest nonprofits in the United States due to in-kind contributions of medicines and vaccines from major pharmaceutical companies valued at billions of dollars annually.\n<br><br>\nBACKGROUND:The NTD Support Center manages a large portfolio of projects that produce datasets that are valuableto the public. To improve the accessibility of existing and future datasets, an open access portal will becreated. A data manager is needed to support the transition to this open access portal, as well asmanaging data use requests. In addition to the support of the data portal, the data manager will alsoprovide data management and analytic support to an on-going multi-country clinical trial. Close attentionto detail, good oral and written communication skills, and experience with database management arerequired.\n<br><br>\nJOB DESCRIPTION: Supports the acquisition, management and analysis of data from multiple sites or sources. Supports the configuration and management of technology solutions supporting the receipt, transformation, validation and storage of data. Ensures that the uses of data through reports and queries are appropriate. Serves as an organizational consultant on matters relating to databases by providing expertise to assist users in meeting their needs. Develops automated quality control procedures to assess quality of data and provides reports to data owners. Works effectively within a group setting in areas of design of data collection instruments, database management, analysis of data, and creation of reports and dashboards. Develops and performs appropriate analyses. Provides explanations of analysis methods, assumptions made, and assists in interpretation of results and implications therein. Documents methods and results through development and maintenance of standard documentation artifacts including data dictionaries, standard operating procedures and analysis methodology descriptions. Works with onsite or field-based counterparts to coordinate consistent implementation of data quality control measures and provision of access to the central data repositories. Performs related responsibilities as assigned. MINIMUM QUALIFICATIONS: A bachelor's degree in computer science or a related field, and three years of experience in processes and standards related to data, OR an equivalent combination of education, training, and experience. Experience with relational database management systems such as, Oracle, Microsoft SQL Server, MySQL preferred. Experience with statistical packages such as, SAS, SPSS, R preferred.<br><br>SDL2017"}