{"job title": "Informatics Data/Analyst III (LITS)", "company": "Emory University", "city state": "– Atlanta, GA", "rating": "4.1", "job description": "Description\n<br><br>\nThe Informatics Analyst works as a positive team member who ensure that information systems support and advance the research and service quality objectives at Emory. Ideal candidates establish collaborative relationships with subject matter experts, and develops an understanding of the lines of businesses. Develops strategies for managing and maintaining data standards and metadata. Integrates disparate sources of data for improved reporting efficiency and ease of use. Forms tactical strategies to meet client goals. The Informatics Analyst is responsible for data extraction and reporting that helps drive clinical research, process improvement, and service quality. Interacts with clinical staff, researchers and other analysts to address business and data questions.Responsible for extracting, cleaning, transforming, validating and modeling data. Understand business requirements and take the initiative to investigate data, present findings. Candidates should have the following qualifications:\n\n\n<ul>\n<li>Experience working with data from an EMR platform such as Cerner or Epic.</li>\n<li>Experience working with major RDBMS like Oracle, Microsoft SQL Server or MySQL.</li>\n<li>Strong skills in writing and understanding complex SQL queries in a major RDBMS, preferably Oracle.</li>\n<li>Experience working with backend procedural languages like PL/SQL or T-SQL.</li>\n<li>Knowledge of scripting language such as Python.</li>\n<li>Strong ability to optimize scripts, and automate solutions.</li>\n<li>Experience with advanced processing techniques such as natural language processing and machine learning are desirable but not required.</li>\n<li>Strong analytical capabilities, with a high level of attention to detail.</li>\n<li>Ideal candidate should be an excellent team player with positive, can-do attitude who can juggle multiple projects, simultaneously.</li>\n</ul>\n\nThis position will be a part of Emory University's Data Solutions team in the Libraries and Information Technology (LITS) Division and will work with Emory's Department of Gynecology &amp; Obstetrics. The Data Solutions team has grown from a group of 6 to 18 over the past several years. Our mission is to provide customized data-driven solutions that capitalize on Emory's diverse sources of information in a compliant framework that supports many of Emory's important initiatives in research, clinical service, and education.\n<br><br>\nJOB DESCRIPTION: This is a central university office position Works as a positive team member of a project that may consist of Business Analysts, Project Managers, Information Architects, Data Analysts, and/or Database Administrators to deliver quality applications and components within scope, on time, and within budget. Leads efforts to ensure that informatics systems support and advance the research objectives and mission of Emory University. Establishes collaborative relationships with subject matter experts, and develops an understanding of the lines of businesses. Leads and proactively identifies emerging technologies; develops proof-of-concepts, and promotes the usage of these emerging technologies. Leads small to medium size technical teams, and mentors other analysts on regulation adherence. Develops new subject areas in business intelligence tools from physical sources and user requirements. Develops strategies for managing and maintaining data standards and metadata. Applies biomedical informatics technical standards, methodologies, and principles to research-specific program needs, objectives, and outcomes. Integrates disparate sources of data for improved reporting efficiency and ease of use. Forms tactical strategies to meet client goals. Creates architecture documentation related to current and proposed informatic solutions. Performs other duties as required. MINIMUM QUALIFICATIONS: A Bachelor's degree and five years of related experience, OR an equivalent combination of education, training, and experience. Experience working with RDBMS like Oracle, Microsoft SQL server or MySQL database, and understanding of SQL in a major RDBMS. Thorough understanding of SQL extension language such as PL/SQL or T-SQL. Experience with business intelligence reporting/dashboarding and tools. IT experience in a healthcare or university setting is preferred. Technical certification is preferred.<br><br>SDL2017"}