{"job title": "Senior Data Scientist", "company": "Endurance International Group", "city state": "– Burlington, MA", "rating": "3.1", "job description": "The Sr. Data Scientist will be a key member of the Analytics &amp; Data Science department, serving as subject matter expert and energized by tackling big challenges in a complex business environment. You will not only dive deep to find the answers but craft meaningful and articulate recommendations that can be discussed and acted upon with your peers. This role reports into the Director of Analytics and Data Science and will interface with Sr. leaders from the organization on a regular basis. Primarily focused on supporting various critical priorities of the marketing organization, this role will tackle problems such as:\n\n<ul>\n<li>Optimizing customer success</li>\n<li>Customer journey and opportunity analysis</li>\n<li>Customer engagement</li>\n<li>Customer segmentation</li>\n<li>Customer acquisition</li>\n<li>And more</li>\n</ul>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Analyze customer behavior and patterns to drive customer engagement, retention and cross-sell strategies</li>\n<li>Conduct analysis of prospects to identify customer acquisition optimization opportunities</li>\n<li>Design and analyze tests to evaluate business and analytical hypotheses, communicate the results clearly to business owners and integrate the insights into future work.</li>\n<li>Develop and analyze customer segments for various use cases.</li>\n<li>Partner closely with business stakeholders to ensure insights are leading to action and measuring the business impact.</li> \n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>BS in Statistics, Applied Mathematics, Economics, Computer Science or related field. MS or PhD degree preferred</li>\n<li>5+ years of experience in applied analytics or data science roles</li>\n<li>Excellent analytical and problem-solving skills.</li>\n<li>Strong experience with SQL in various database environments (including Big Data/ Distributed systems)</li>\n<li>Experience with Tableau, Power BI or other BI tools.</li> \n\n<li>Experience developing data visualizations to enable data exploration, illustrate an insight or tell a story.</li>\n<li>Experience with Python and/or R (preferably Spark)</li>\n<li>Strong Excel skills</li>\n<li>Practical knowledge applying analytical techniques such as survival and failure analysis, regression, decision trees, segmentation, clustering, and other techniques to describe patterns and make predictions with real-world data.</li>\n<li>Understanding of sampling and testing methodology including A/B splits and multivariate testing.</li>\n<li>Curious, self-motivated thinker; always asks why and drives until the answer is clear.</li>\n<li>Strong communicator with demonstrated experiencing translating analytic findings to business insights and influencing business stakeholders to drive action and improved business performance.</li>\n<li>Strong cross-functional collaboration skills</li>\n<li>Comfortable interacting with senior leadership.</li>\n\n<strong><li>Preferred qualifications:</li>\n\n</strong>\n\n<li>Experience with customer lifecycle marketing or customer journey analytics</li>\n<li>Versed in SaaS / subscription-based businesses</li>\n<li>Strong writing, and presentation skills.</li> \n</ul>"}