{"job title": "Senior Data Analyst", "company": "Endurance International Group", "city state": "– Burlington, MA", "rating": "3.0", "job description": "Endurance International Group is the parent company behind some of the worlds top names in online marketing tools for small business, including Constant Contact, BlueHost, SiteBuilder, HostGator, Domain.com, and others. We help millions of small businesses get online, look professional and compete with the world by making the act of getting online simple. We are an entrepreneurial, fast-paced international team from all backgrounds. We are the reflection of our international customers displaying grit, passion and an enthusiasm to make a mark on the world.\n<br><br>\nWe are seeking a team player who is highly analytical, self-motivated and intellectually curious to join a dynamic and growth-oriented marketing team. The Senior Data Analyst is instrumental in efforts to budget, forecast and report on key performance metrics across a large number of business units, and partners with Finance to align Marketing metrics with financial results and processes. The Senior Data Analyst is a critical contributor to the Marketing team, delivering reliable reports and intelligence to support decisions and provide recommendations.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Build, improve and maintain marketing reports and dashboards, tracking spend and performance across brands and marketing channels. Utilize a variety of systems to collect and compile data. Build automated reports and tools that will maximize accuracy and minimize manual intervention for reporting.</li>\n<li>Build models to project future outcomes for marketing performance. Partner with business and functional leads to ensure accuracy and consensus of reporting and forecasting.</li>\n<li>Identify and communicate emerging trends within the market, the organization and key channels</li>\n<li>Improve the usability of marketing reports through the use of dashboards that allow for deep-dives</li>\n<li>Work closely with Finance to align results, identify drivers for results, detect anomalies and create seamless processes for reporting.</li>\n<li>Leverage methods from diverse disciplines to gain customer insights, draw conclusions and work with business partners to put those insights into action</li>\n<li>Work closely with business partners, technology and modelling teams to evaluate new and alternate data sources as well as analytical tools</li>\n<li>Develop detailed financial models for marketing programs and campaigns</li>\n<li>Drive the development and production of marketing budgets, pacing and recurring forecasts</li>\n<li>Work with other departments including Finance, Accounting and Legal, providing them with marketing information and guidance</li>\n<li>Document historic marketing data in a clear, organized way: manage archives in a way that allows for easy access to data</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>4 to 7+ years of experience in an analytics focused role in finance or marketing</li>\n<li>Deep expertise in MS Excel, with experience building complex recurring dashboards using advanced functionality</li>\n<li>Technical acumen and experience automating data processes</li>\n<li>Experience working with large data sets and Big Data tools</li>\n<li>Proven analytical skills and problem-solving ability paired with meticulous attention to detail</li>\n<li>Self-motivated and proactive team player who takes ownership of and accountability for projects</li>\n<li>Strong project management and organizational skills with an ability to effectively manage competing priorities</li>\n<li>Strong relationship-building skills. Ability to communicate complex issues to a wide array of internal stakeholders</li>\n<li>Desire to work in a fast-paced environment, consistently adhering to strict deadlines and evolving priorities</li>\n<li>Proficient in PowerPoint</li>\n<li>Bachelors/Undergraduate Degree. Engineering or Finance major a plus.</li>\n<li>Background in SQL and advanced usage of Google Apps a big plus</li>\n<li>Excellent problem solving skills and time management skills</li>\n<li>Interest in optimizing digital marketing results</li>\n<li>Passion for helping small businesses use the web to achieve their goals</li>\n<li>Passion for numbers and incessant curiosity</li>\n</ul>\n<strong>We Offer</strong>\n<br><br>\nWe offer an opportunity to work with great people in an innovative environment doing great things. You can expect a salary commensurate with your capabilities, a generous benefits package, and attractive corporate perks that will make you the envy of the neighborhood. If you feel your skills match then please reach out to learn more about this exciting opportunity. We are an Equal Opportunity Employer."}