{"job title": "Data Modeler", "company": "Engility Corporation", "city state": "– Edgewood, MD", "rating": "3.4", "job description": "Engility anticipates hiring a Data Architect / Senior Data Modeler to support\n<br><br>\nthe Joint Program Executive Office for Chemical, Biological Radiological Nuclear Defense (HQ, JPEO-CBRND), in Edgewood, MD. In this role you will perform Data Modeling for their Knowledge Management team.\n<br><br>\n<strong>The Data Modeler will:</strong>\n\n\n<ul>\n<li>Create, implement, validate, maintain, and continually shape a set of aligned standard, enterprise-wide integrated CBDP data model architectures and architectural products for the Joint Enterprise Data Initiative (JEDI) and the associated Enterprise Data Management Plan.</li>\n<li>Develop DODAF data architecture models and reports.</li>\n<li>Independently, or working with the Government lead or functional Government SMEs, analyze CBDP business system projects, products, and programs; producing architectural data products that visualize system, program, operational, capability, and requirement data interfaces which help to expose data gaps and potential data needs.</li>\n<li>prepare and publish formal documents to include JEDI data cataloging documents for the JPEO-CBRND Chief Information Office.</li>\n<li>Independently or working with the Government lead, develop JPEO-CBRND Business Enterprise Data Architecture. (e.g., DODAF views, presentations, etc.), providing early architecture data products to help drive and refine business system data gathering requirements.</li>\n<li>Participate in organizational events in coordination with the Government Leads, for example All Hands and teaming events.</li>\n</ul>\n\nIn addition, the Data Modeler shall perform the following standard reporting requirements:\n\n\n<ul>\n<li>In-person architecture reviews, as needed</li>\n<li>Weekly touch point calls</li>\n<li>Update status tracking systems as required</li>\n<li>Monthly reports, submitted in writing, to discuss the status of deliverables, work plans, and issues</li>\n</ul>\n\nA Minimum of 3-5 years of experience developing and maintaining one or more Department of Defense Acquisition Framework (DODAF) v2.0 data architecture products and/or Data Models within standard data modeling tools (ERStudio, Erwin, etc.).\n<br><br>\nSecret / Interim Secret Clearance"}