{"job title": "Data Scientist", "company": "Engie", "city state": "– United States, Massachusetts , Boston", "rating": "3.2", "job description": "<div><div><div><div><div><div>\n<div>ENGIE Insight, formerly Ecova, partners with multi-site businesses that aim to thrive in a sustainable world. With a foundation of accurate and comprehensive resource data – including energy, water, waste and telecom – we apply technology and people expertise to lower costs, drive efficiencies and reduce environmental impact. More than 1,000 customers, including 25%+ of the Fortune 500, turn to ENGIE Insight to help move their sustainable resource management initiatives forward.\n<br><br>\nENGIE Insight’s people are our greatest strength, bound by our vision to enable a sustainable world where people, organizations and the environment thrive. We are <strong>passionate</strong> about making our company and the world a better place; <strong>responsible</strong> in working with commitment and accountability; <strong>collaborative</strong> with our colleagues and clients, and <strong>agile</strong> enough to work in a dynamic, changing industry.\n<br><br>\nThe wide-ranging expertise of our diverse team fuels the innovation that places us on the leading edge of the energy industry. As such, we nurture a company culture—through training, mentoring and professional development—that encourages all employees to thrive. If this the kind of place you see yourself working, we invite you to join ENGIE Insight.</div></div>\n\n<br><strong>*In order to be considered for the role, your resume must be attached in your application.</strong>\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nThe Data Scientist will be joining an industry-leading R&amp;D team with extensive academic and industry experience in building energy science and physical system based big-data. This team's work will be the foundation for new algorithms used to help solve the world energy problem.\n<br><br>\n<strong>Role Description</strong>\n<br><br>\n•\tMine industrial-size data sets in various states of cleanliness for insights\n\n\n<ul>\n<li>Create, refine, and verify statistical and machine learning algorithms within the R&amp;D team</li>\n<li>Assist energy engineering and building science team in running energy and algorithmic models and interpreting the results</li>\n<li>Act as the liaison between the Software team and business stakeholders for software production of prototype methods</li>\n<li>Evaluate business and technology tradeoffs and report them in a manner that product and business teams can make decisions on final specifications</li>\n<li>Rapidly assess potential of algorithms to be applied to various problems and/or processes at ENGIE Insight in order to estimate the anticipated level of effort as well as the define the metrics of success that could be used</li>\n<li>Understand object-oriented design patterns and appropriate usage of source control systems (e.g., Git, Mercurial, or Subversion)<br>\n<div><strong>Role Competencies</strong>\n<br><br>\n•\tMaster’s degree in Computer Science, Engineering, Mathematics, Statistics, or equivalent field required, PhD desired</div></li>\n<li>Strong mathematical background with teachable knowledge of various analytic methodologies such as signal processing, time series analysis, model selection, model verification, optimization, neural networks, Bayesian, etc..3+ years of experience developing, testing, and evaluating algorithms including statistical and machine learning</li>\n<li>Experience working with large unstructured data sets</li>\n<li>Experience with using modern, cloud-based data storage and processing technology to develop and test algorithms. This includes MS Data Lake, AWS S3, HDFS, or similar</li>\n<li>Experience working with distributed platforms, such as Hadoop Map/Reduce or Spark, to increase velocity of testing on large data sets Proficient in large-scale database queries, with associated statistical analyses including the following areas: non-linear and multi-variate regressions, logistic regression, time series analyses, and probabilistic and classification models.</li>\n<li>Expert level knowledge of statistical tools (e.g., R, MatLab, etc.) and prototyping languages (e.g., Python, Java, C++, etc.)</li>\n<li>Extensive hands-on experience with physical system based data analytics and visualization</li>\n<li>Ability to develop code that can leverage horizontal scalability</li>\n<li>Comfort with working in a fast-paced multidisciplinary environment while maintaining strict customer data privacy requirements</li>\n</ul>\n\nUncompromising integrity and ethical standards<br>\n\n<div>\n<div><strong>ENGIE Insight Information</strong></div>\n<br>\n<div>Our salaries are competitive and commensurate with experience. We are a performance-based culture and have goal-based incentive programs and generous employee benefits. Our comprehensive benefit package includes medical, dental, vision insurance, life, AD&amp;D, short- and long-term disability insurance. We also offer flexible spending accounts and 401(k) with a generous employer match.</div>\n<br>\n<div>ENGIE Insight is an equal opportunity and affirmative action employer. All qualified applicants will be considered without regard to age, race, color, national origin, ancestry, sex, sexual orientation or preference, religion, marital status, citizenship, veteran status, or physical or mental disability.</div>\n<br>\n<div>Connect with ENGIE Insight: Twitter | LinkedIn | Facebook | Blog | Videos | Webinars</div></div>\n</div>\n </div>\n</div>\n </div>\n </div>\n\n<br>"}