{"job title": "Data Scientist", "company": "Enigma", "city state": "– New York, NY", "rating": "4.2", "job description": "As a Data Scientist at Enigma, you will work on a variety of hard problems. You will partner closely with our commercial and engineering teams to identify and tackle important analytical challenges for customers in the Fortune 500 and public sector. In some projects, you will be involved in early stage ideation and the development of high-impact analyses and proofs-of-concept. In others, you will develop and validate machine learning models that form a critical part of a large-scale application. In both cases, you will be focused on using data and your analytical skill set to deliver value to end users. Example topics our data scientists have worked on include detecting money laundering at a top-five credit card issuer; defining disaster risk exposure for a top-three insurer or linking drug safety data for a major pharmaceutical company. You will join Enigma at an exciting growth stage when your contributions will impact the entire company and your professional growth will keep pace with your personal drive.\n<br><br>\nWhat we are looking for:\n\n<ul>\n<li>Strong statistical skills and familiarity with machine learning techniques</li>\n<li>Fluency with analytical programming, including libraries for cleaning, reshaping, exploring and visualizing data (Python pref., Spark a plus)</li>\n<li>The ability to clearly convey complex concepts with plain language</li>\n<li>Demonstrated ability to produce high-quality, product-focused, scalable analysis</li>\n<li>Problem-solving with determination, perseverance, and grit</li>\n<li>Creative and versatile analytical skills</li>\n<li>You are motivated by working on hard problems with smart people</li>\n<li>Ability to prioritize</li>\n</ul>\nOur Story:\n<br><br>\nEnigma is a rapidly growing enterprise technology company based in the Flatiron neighborhood of New York City. We are Series B funded, partnering with some of the best investors in the world: New Enterprise Associates, Two Sigma Ventures, Comcast Ventures, Crosslink Capital, American Express Ventures, and others.\n<br><br>\nFounded in 2012, Enigma was started based on the realization that there was tremendous potential in using public data to understand how the world works, but that it was untapped because the data is highly fragmented and disconnected. Enigma set out to change that by building and organizing one of the largest collections of public data in the world, and our big coming out party was winning TechCrunch Disrupts Battlefield in 2013. Our vision has remained steadfast, we want to empower people to interpret, and improve, the world around them. However, we have expanded our ability to realize this vision by combining our massive public data repository with an ecosystem of software and tools designed to link, resolve, enhance and apply data to help global-scale companies take on some of their hardest problems, ranging from preventing money laundering to ensuring patient safety.\n<br><br>\nWe are proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status."}