{"job title": "Data Scientist", "company": "Enlighten IT Consulting", "city state": "– Maryland, Linthicum Heights", "rating": "5.0", "job description": "<div> 15597: Data Scientist</div>\n<br>\n<div> \n<div> Location: Maryland, Linthicum Heights</div> <div> Clearance: None</div> </div><div> <strong>Description:</strong></div> <div> Enlighten IT Consulting, a MacAulay-Brown, Inc. (MacB) company, is looking for an experienced Data Scientist with strong development skills to join our team. The Data Scientist will establish and implement end-to-end proof of concept for leading edge data mining and analytics systems. They will be responsible for the creation of innovative methodologies for extracting key parameters from big data coming from various sensors. The data scientist will utilize their expertise in machine learning, statistical data analytics, and predictive analytics to help implement analytics tied to cyber security and hunting methodologies and applications.</div> <div> <strong>Requirements:</strong></div> <div><strong>Security Clearance:</strong>\n<ul>\n <li>A current Secret level government security clearance is required and must be able to obtain a background investigation and polygraph for a higher level of security clearance in the future. Must be U.S. Citizen to pursue this opportunity.</li>\n</ul>\n<strong>Required Skills:</strong>\n<br>\n<em>Candidates must have most of the following required skills:</em>\n<ul>\n <li>B.S. degree in Computer Science, Electrical Engineering, Statistics, or equivalent fields</li> <li>Must have 4+ years of Data Scientist experience</li> <li>Conduct data analysis and orchestration of a large volume of security data sources, threat indicators, and customer logs.</li> <li>Apply latest technologies in machine learning, data mining, and predictive analytics to correlate the big datasets and events, and derive dynamic cybersecurity rules.</li> <li>Generate highly accurate and near real-time security alerts based on the dynamic rules.</li> <li>Architect and work closely with other team members to develop a scalable cloud-based cybersecurity data analytics engine.</li> <li>Applied Machine Learning experience (regression analysis, time series, probabilistic models, supervised classification and unsupervised learning).</li> <li>Strong mathematical background (linear algebra, calculus, probability and statistics).</li> <li>Experience with JavaScript and prototyping languages such as Python and R.</li> <li>Familiar with scalable distributed data processing, management, and visualization tools (e.g. Hadoop, ELK, Kafka, Accumulo, graph databases, etc.).</li> <li>Familiar with data mining and analytics methods (e.g., clustering, sequences, networks, time series, deep learning, statistical analytics, etc.).</li> <li>Knowledge of cyber security operations, cyber security data types, cyber security threats, network protocols (SOC tools and methodologies).</li>\n</ul>\n<strong>Desired Skills:</strong>\n<ul>\n <li>Skills with all of the following are highly desired: SQL, R, TensorFlow, Python and strong Cyber experience.</li>\n</ul>\n<em>MacB is committed to a policy of equal employment opportunity to all employees and applicants for employment. MacB recruits, trains, compensates and promotes without regard to race, creed, religion, color, sex, gender identity, age, national origin, citizenship, political affiliation, sexual orientation, genetic information, marital status, source of income, protected veteran status, physical or mental disability, military status, or any other consideration made unlawful under applicable federal, state or local law.</em></div>"}