{"job title": "Data Scientist", "company": "Enterprise Solution inc", "city state": "– Richfield, Idaho", "rating": "NA", "job description": "Data Scientist\n<br>\nRef No.: 18-38732\n<br><br>\nLocation: Richfield, Minnesota\n<br>\nPosition: Data Scientist\n<br>\nLocation: Richfield, MN\n<br>\nDuration: Full-Time (Onsite Position)\n<br><br>\n<strong>Job Description:</strong>\n<br>\nExperience in Statistical Machine Learning, Data Mining solutions to various business problems and generating data visualizations using R, Python and Tableau.\n<br>\nExpertise in transforming business requirements into analytical models, designing algorithms, building models, developing data mining and reporting solutions that scales across massive volume of structured and unstructured data.\n<br>\nEquipped with experience in utilizing statistical techniques which include Correlation, Hypotheses modelling, Inferential Statistics as well as data mining and modelling techniques using Linear and Logistic regression, clustering, decision trees, and k-mean clustering\n<br>\nExpertise in implementing scalable Statistical &amp; Predictive Decision Science Modelsusing Machine Learning platforms like R &amp; Python Data Science Packages (Scikit-Learn, Pandas, NumPy, SparkR &amp; Spark MLib).\n<br>\nExpertise in building Supervised and Unsupervised Machine Learning experiments using cloud , utilizing multiple algorithms to perform detailed predictive analytics and building Web Services models for all types of data: continuous, nominal, and ordinal.\n<br>\nKnowledge in Google Cloud Platform- Preferred or any other cloud platform like Azure or AWS\n<br>\nIn depth knowledge in GCP DataFlow, GCP Dataproc, Data ingestion with GCP Pub/Sub\n<br>\nKnowledge in Visualization tools that have Big Query connectors - Tableau, Google Data studio\n<br>\nNot all of them is mandatory from skillset\n<br>\n<strong>Programming &amp; Scripting:</strong>\n<br><br>\nR Programming &amp; R Studio\n<br>\nPython\n<br>\n<strong>SQL, PL/SQL</strong>\n<br>\n<strong>Development Tools:</strong>\n<br><br>\nAzure or Amazon or Google Machine Learning\n<br>\nTableau,\n<br>\nNotepad++\n<br>\nJupyter, Spyder\n<br>\nHDFS, Hive, Spark, Kafka\n<br>\nMicrosoft Visual ********** 2010, SQL Server 2008\n<br>\n<strong>Techniques &amp; Algorithms:</strong>\n<br><br>\nMachine Learning\n<br>\nRegression\n<br>\nK-Means Clustering\n<br>\nData Mining &amp; Cleaning\n<br>\nStatistics\n<br>\nDecision Trees\n<br>\nRandom Forest\n<br>\n<strong>Databases:</strong>\n<br><br>\nTeradata\n<br>\nOracle\n<br>\nSQL/MySQL"}