{"job title": "Data Scientist", "company": "Envision", "city state": "– Saint Louis, MO", "rating": "3.4", "job description": "<strong>Responsibilities:</strong>\n<ul>\n <li>Collaborate closely with data scientists, breeders, data engineers, and imagery scientists to provide data-driven solutions to business problems.</li> <li>Understand the core scientific questions and develop methodology to best address these questions.</li> <li>Apply machine learning or other computational approaches to develop, improve and scale crop/ environmental models.</li> <li>Quantify and simulate interactions between genotype and biotic &amp; abiotic environmental factors.</li> <li>Build effective relationships and partnerships with internal customers and stakeholders.</li> <li>Quantifications</li>\n</ul>\n<strong>Required Skills:</strong>\n<ul>\n <li>PhD in Computer science, Statistics, Engineering, Physics, Mathematics, or a related field. Or, a PhD and demonstrated experience with quantitative applications in Agronomy/Plant Sciences, Climatology, Geo-informatics, or related fields.</li> <li>Demonstrated experience using machine learning, data mining, simulation modeling, or statistical methodology to solve research problems.</li> <li>Proficiency in Python or R.</li> <li>Ability to rapidly learn new problem domains, and good decision-making and judgement skills.</li> <li>Ability to work in a large team as well as independently.</li>\n</ul>\n<strong>Desired skills:</strong>\n<ul>\n <li>Experience with modeling crop development phases, growth and stress.</li> <li>Experience with geospatial and remote sensing data.</li> <li>Experience with cloud computing and virtualization technology.</li> <li>Strong publication record in leading scientific journals.</li> <li>Proven ability to communicate complex analytical problems in a clear, precise and actionable manner.</li>\n</ul>\n\nAssociated topics: data analytic, data architect, data center, data engineer, data scientist, data warehouse, data warehousing, erp, mongo database administrator, sql"}