{"job title": "Data Scientist", "company": "Epitec Inc.", "city state": "– Dearborn, Michigan", "rating": "2.8", "job description": "JOB TYPE: Long-Term Contract\n<br><br>\nLOCATION: Dearborn, MI\n<br><br>\n<strong>JOB SUMMARY FOR Data Scientist:</strong>\n<br><br>\nOperations Research and Analytics. This is an opportunity to apply the latest tools and methods in Optimization and Data Science to a variety of mobility opportunities. Recent projects in this group have led to the development of applications in the areas of transportation, city solutions, and connected vehicles.\n<br><br>\n<strong>RESPONSIBILITIES FOR Data Scientist:</strong>\n<br><br>\nPerform analytics and optimization work as a member of the Operations Research team in Smart Mobility Analytics.\n<br>\nDevelop optimization models to support Smart Mobility.\n<br>\nKnowledge in vehicle routing and logistics problems is a bonus.\n<br><br>\n<strong>JOB EXPERIENCE FOR Data Scientist:</strong>\n<br><br>\n1+ of years of experience in developing prototype software applications using Java, Scala, C/C++, Python, R, or similar languages and frameworks\n<br><br>\n<strong>BENEFITS FOR Data Scientist:</strong>\n<br><br>\nMedical, Dental, Vacation, Holiday tailored to meet your needs. 401K/Match, $15,000 Life Insurance, Award-Winning Employee Care Program. Established and highly regarded reputation with Green Card and H1 processing.\n<br><br>\nWhy should you choose Epitec?\n<br>\nWe started Epitec with a single focus, Placing People First. Knowing every good endeavor begins with listening and understanding, weve set about challenging every part of the employment process. Bringing the proper connections together for the perfect fit.\n<br><br>\nHow is Epitec different?\n<br>\nEpitec gets to know our prospective employees, using these insights to locate the perfect placement for you. We are there, every step of the way. Providing a best-in-class compensation package combined with the opportunity to grow financially and personally through your work.\n<br><br>\nWhat is the result?\n<br>\nEpitec represents the worlds top companies and works to fill their open jobs with the worlds best talent. Thats led to Epitec servicing an impressive list of Fortune 100 companies. Weve also won many awards, including eleven 101 Best &amp; Brightest awards, four MMSDC A.C.E. Awards, multiple Crains awards and multiple Corp! magazine diversity awards. And thats just the beginning, as we work to innovate the way the world thinks about employment.\n<br><br>\n© 2018 Epitec Inc."}