{"job title": "Data Engineer", "company": "Epsilon", "city state": "– Los Angeles, CA", "rating": "3.3", "job description": "Do you want to work in a fun, smart, and energeticenvironment where you will be challenged, rewarded AND inspired? Come work withtop performers at CJ Affiliate to make a real difference in how top brands runtheir businesses. We are the world's leading affiliate marketing network - wetransform digital marketing with the help of big data and businessintelligence. We help advertisers drive more sales and expand theirreach and we want to hear from you!\n<br><br>\nThe Data Engineer is responsible for maintaining the data infrastructureat CJ. We engineer solutions to give our data analysts and data scientists theright tools to make great things. We get our hands dirty with lots oftechnologies, including Kafka, Spark, Hadoop, Zookeeper, Oracle, AWS, and more.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Maintain all facets of data infrastructure, including backups/disasterrecovery, software deployment/configuration, security best practices,performance tuning, and troubleshooting.</li>\n<li>Collaborate with end-users and other engineering squads to ensure optimaldata shapes for system requirements and maintainable software.</li>\n<li>Create software to drive the organization towards our goal ofsoftware-defined architecture.</li>\n<li>Develop custom ETL/reporting jobs as needed, and be asubject-matter expert for others doing the same.</li>\n<li>Participate in the on-call support rotation for maintaining our production systems</li>\n</ul>\n\nMinimumQualifications\n\n\n<ul>\n<li>2 years of experience in software engineering in a big dataenvironment.</li>\n<li>Practical fluency in SQL and at least one scripting language(shell, python, ruby, perl).</li>\n<li>Solid computer science fundamentals such as data structures,software design, data warehousing concepts.</li>\n</ul>\n\nBS in Computer Science or equivalent practical experience.\n\n\n<ul>\n<li>Excellent written and verbal communication skills</li>\n<li>Working knowledge of Unix/Linux.</li>\n</ul>\n\nPreferredQualifications\n\n\n<ul>\n<li>Experience with JVM languages (Java, Scala, Clojure) and the JVMecosystem (maven, sbt, build/test suites, etc.)</li>\n<li>Experience writing and tuning Spark jobs</li>\n<li>Database administration experience with one of the major RDBMSplatforms (Oracle, Sql Server, MySQL, Postgres).</li>\n<li>Experience with MPP and/or distributed systems.</li>\n<li>Experience with AWS.</li>\n<li>Experience with Agile software development.</li>\n</ul>\n\nWhy CJ Affiliate?\n<br><br>\nWe're a great place to work! CJ Affiliate offers ideal career development and growth opportunities where you will hone skills in strategic planning aand execution, as well as enhance your negotiation and presentation skills. You will develop partnerships and motivate affiliates, learn technical skills applicable to digital marketing and nearly every other industry, and so much more. CJ Affiliate is a leader because our teams have advanced tools, present creative solutions, execute strategically, and drive high performance.\n<br><br>\nWe offer many of the typical benefits like health and dental insurance but we also offer many other great perks like flexible time off, fun activities in our offices, competitive compensation, just to name a few. Our benefits are designed to take care of the whole you and keep you healthy, whether physically, emotionally, financially or socially.\n<br><br>\nCJ Affiliate is a business unit within Conversant and Epsilon which is part of Alliance Data, a top performing Fortune 500 company included in the S&amp;P 500- NYSE: ADS.\n<br><br>\nConditions of Employment\n<br><br>\nAll job offers are contingent upon successful completion of certain background checks which unless prohibited by applicable law may include criminal history checks, employment verification, education verification, drug screens, credit checks, DMV checks (for driving positions only) and fingerprinting.\n<br><br>\nAlliance Data is an Equal Opportunity Employer and participates in E-Verify.\n<br><br>\n#engineering\n<br><br>\n<strong>LI*GG</strong>\n<br><br>\nReady to Work Hard, Play Hard and Make a difference? Apply now!"}