{"job title": "Scientist, Proteomics", "company": "Erasca, Inc.", "city state": "– San Diego, California", "rating": "NA", "job description": "<strong>Position: Scientist, Proteomics</strong>\n<br><br>\n<strong>Reports to: Vice President, Biology</strong>\n<br><br>\nErasca, Inc. is a San Diego based biotechnology company focused on discovering and developing precision medicines for the benefit of patients with cancer. Our programs, currently focused on innovative discovery research, take novel approaches to shutting down certain oncogene drivers of solid tumor malignancies. The name Erasca has an important embedded meaning: It is a contraction of our audacious hope to erase cancer that drives our mission and everything that we do on behalf of patients with cancer.\n<br><br>\n<strong>Position Summary</strong>: Erasca is looking for a highly motivated scientist with experience in protein mass spectrometry/quantitative proteomics to be part of a collaborative biology team to support drug discovery efforts in oncology that address unmet patient need.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Perform LC/MS based proteomics experiments to answer key scientific questions.</li>\n<li>Independently conduct experiments from sample preparation, LC-MS/MS to data analysis &amp; interpretation.</li>\n<li>Interact directly and effectively with team members</li>\n<li>Translate key scientific questions to essential proteomics experiments</li>\n<li>Collaboratively design experiments</li>\n<li>Independently perform the proteomics studies and analyses</li>\n<li>Cogently present experimental results and propose next steps.</li>\n</ul>\n<strong>Minimum Requirements</strong>:\n\n<ul>\n<li>M.S. or Ph.D. degree in biology, analytical chemistry or related field with 2+ years experience in protein mass spectrometry and proteomics including, but not limited to the following key areas: quantitative proteomics (TMT, SILAC, label free), protein post-translational modification analysis and protein-protein-interaction analysis.</li>\n<li>Experience in protein isolation from cells, tissue and biofluids, immuno or chemical affinity enrichment to selectively enrich proteins from complex biological samples.</li>\n<li>Demonstrated expertise in multi-dimensional LC fractionation, LC-MS/MS and analysis and interpretation of LC-MS/MS data using public and commercially available software.</li>\n<li>The ability to translate biologists/project teams scientific questions into analytical strategies and methods. Critical and independent thinking. Strong analytical and problem-solving skills.</li>\n<li>Excellent communication and interpersonal skills to work in a collaborative, matrix environment. Readily speaks up and share results within multi-disciplinary teams.</li>\n<li>Strong technical and organizational skills.</li>\n</ul>\n<strong>Preferred Experience</strong>:\n\n<ul>\n<li>Experience with cell culture, cell line engineering and molecular biology.</li>\n<li>Experience with various affinity purification methods including proximity based labeling technologies such as BioID.</li>\n<li>Knowledge of structural biology and crosslinking technology</li>\n<li>Experience with automation and liquid handling systems is a plus</li>\n<li>Experience with statistical analysis (ANOVA, experimental design) is a plus</li>\n</ul>"}