{"job title": "Data Scientist", "company": "Ericsson-Worldwide", "city state": "– Plano, TX", "rating": "3.4", "job description": "<strong>Ericsson Overview:</strong>\n<br><br>\nEricsson is world’s leading provider of communications technology and services. Our offerings include services, consulting, software and infrastructure within Information and Communications Technology. Using innovation to empower people, business and society, Ericsson is working towards the Networked Society: a world connected in real time that will open up opportunities to create freedom, transform society and drive solutions to some of our planet’s greatest challenges.\n<br><br>\n&nbsp;\n<br><br>\nWe are truly a global company, operating across borders in over 180 countries, offering a diverse, performance-driven culture and an innovative and engaging environment. As an Ericsson employee, you will have freedom to think big and the support to turn ideas into achievements. Continuous learning and growth opportunities allow you to acquire the knowledge and skills necessary to progress and reach your career goals. We invite you to join our team.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nResponsible for developing scientific methods, processes, and systems to extract knowledge or insights to drive the future of applied analytics.\n<br><br>\nProvide thought leadership, perform Advanced Statistical Analytics, and create insights into data to provide to the business actionable insights, identify trends, and measure performance which address business problems.\n<br><br>\nCollaborate with business and process owners to understand business issues, and with engineers to implement and deploy scalable solutions, where applicable.\n<br><br>\nAs a Data Scientist, you will need to have strong programming skills and strong understanding of data science and Machine Learning tools. You will use your knowledge and/or experience in Data Science methodologies to solve challenging business and operational problems\n<br><br>\n&nbsp;\n<br><br>\n<strong> RESPONSIBILITIES&nbsp;&amp; TASKS:</strong>\n<ul>\n<li>Build advanced statistical models, algorithms, and trend analysis to discover predictive insights related to network and business objectives</li><li>Translate data algorithms and complex ideas into actionable management insights and solutions</li><li>Translate business objectives into business intelligence trough regressive data analytics</li><li>Explore and work on Big Data tools and technologies to sustain our continued operational transformation objectives and Industry leadership</li><li>Research and develop approaches on how to improve business processes and customers’ experience by using our vast amounts of data.</li>\n<li>&nbsp;\n<br><br>\n<strong>CORE COMPETENCIES</strong></li>\n<li>Strong skills in Machine Learning especially techniques such as Linear/Logistic Regression, Bagging, Bayesian model, Neural Networks, Random forest, Gradient boosting, Hyperparameter optimization techniques etc.</li><li>Proven skills and record of accomplishment (GitHub, open source etc.) in the use of current state of the art machine learning frameworks such as Kera’s, TensorFlow, Scikit-Learn, H2O, Spark etc. in developing Machine Learning (ML) / Artificial Intelligence (AI) applications</li><li>Experience of data wrangling and data munging, using Big Data technologies</li><li>Strong analytical skills and ability to acquire new knowledge and apply it in the job&nbsp;</li><li>Programming skills in various languages (C++, Scala, Java, R) with proficiency in Python and/or C++</li><li>Good communication skills in written and spoken English</li><li>Creativity and ability to formulate problems and solve them independently&nbsp;</li><li>Ability to develop and drive new ways of working, to produce deliverables in a more efficient way</li><li>Previous experience on a similar job (at least 3 years) with proven results delivery.</li><li>Good knowledge of statistical analysis, theory of probabilities, design of experiments and machine learning.</li><li>Acumen for business flow understanding and expertise in data preparation-data mining and pre-processing.</li><li>Strong Knowledge of SQL, PL/SQL, SQL Server, SPSS, SPAS</li><li>Good command of programming language and software environment for statistical analysis, graphics representation and reporting i.e. R, Python;</li><li>Knowledge of Business Objects</li><li>Distributed computing paradigms such as different distributions of Hadoop, Spark.</li><li>Presenting &amp; communicating information</li><li>Persuading &amp; Influencing<br><br>&nbsp;\n<br><br>\n<strong>MINIMUM QUALIFICATION AND EXPERIENCE REQUIREMENTS</strong></li>\n<li>BSc, or MSc in Computer Science, Machine Learning, Computer Engineering, Mathematics, Physics, or related field (e.g. applied mathematics/statistics)</li><li>Minimum 3 years of real world or research experience in data science.<br><br>&nbsp;</li>\n\n</ul>\nDISCLAIMER: The above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position. Therefore employees assigned may be required to perform additional job tasks required by the manager.\n<br><br>\n&nbsp;\n<br><br>\nWe are proud to be an EEO/AA employer M/F/Disabled/Veterans. We maintain a drug-free workplace and perform pre-employment substance abuse testing.\n<br><br>\n&nbsp;\n<br><br>\nEricsson provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, protected veteran status, union membership or genetics information. Ericsson complies with applicable country, state and all local laws governing nondiscrimination in employment in every location across the world in which the company has facilities. In addition, Ericsson supports the UN Guiding Principles for Business and Human Rights and the United Nations Global Compact.\n<br><br>\n&nbsp;\n<br><br>\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, training and development.\n<br><br>\n&nbsp;\n<br><br>\nEricsson expressly prohibits any form of workplace harassment based on race, color, religion, sex, sexual orientation, gender identity, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, protected veteran status, union membership or genetic information.\n<br><br>\n&nbsp;\n<br><br>\nEricsson will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by Ericsson or (c) consistent with Ericsson’s legal duty to furnish information.\n<br><br>\n&nbsp;\n<br><br>\nEmployee Polygraph Protection Act Notice - Employers are generally prohibited from requiring or requesting any employee or job applicant to take a lie detector test, and from discharging, disciplining, or discriminating against an employee or prospective employee for refusing to take a test or for exercising other rights under the Act. For more information, visit https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf.\n<br><br>\n&nbsp;\n<br><br>\nEricsson is an equal opportunity employer and is committed to providing reasonable accommodation for qualified disabled individuals during the application and hiring process. Ericsson will make modifications or adjustments to the job application or interview process that will enable a qualified applicant to be considered for a position. If you require an accommodation due to a disability, please contact Ericsson at hr.direct.dallas@ericsson.com or (866) 374-2272 (US) or (877) 338-9966 (Canada) for further assistance.\n<br><br>\n&nbsp;\n<br><br>\nPrimary country and city: United States (US)&nbsp;|| || Plano&nbsp;|| IT"}