{"job title": "Data Engineer(s)- ML and AI", "company": "Ericsson", "city state": "– Santa Clara", "rating": "3.4", "job description": "<strong>Global Artificial Intelligence Accelerator</strong>\n<br><br>\n<strong>Ericsson Overview:</strong>\n<br><br>\nEricsson is world’s leading provider of communications technology and services. Our offerings include services, consulting, software and infrastructure within Information and Communications Technology.\n<br><br>\nUsing innovation to empower people, business and society, Ericsson is working towards the Networked Society: a world connected in real time that will open up opportunities to create freedom, transform society and drive solutions to some of our planet’s greatest challenges.\n<br><br>\nWe are truly a global company, operating across borders in over 180 countries, offering a diverse, performance-driven culture and an innovative and engaging environment. As an Ericsson employee, you will have freedom to think big and the support to turn ideas into achievements. Continuous learning and growth opportunities allow you to acquire the knowledge and skills necessary to progress and reach your career goals. We invite you to join our team.\n<br><br>\n<strong>Machine Intelligence at Ericsson</strong>\n<br><br>\nIt will be practically impossible for human brains to understand how to run and optimize a 5G network, Machine Learning (ML) and other Artificial Intelligence (AI) technologies- will be vital for us to handle that complexity. We are setting up a Global AI Accelerator in the US, Sweden and India, with 300 experts, to fast-track our strategy execution\n<br><br>\nMachine Intelligence (MI), the combination of Machine Learning and other Artificial Intelligence technologies is what Ericsson uses to drive thought leadership to automate and transform Ericsson offerings and operations. MI is a key competence to enable new and emerging business. This includes development of models, frameworks and infrastructure that we use to power our 5G networks and services. We engage in both academic and industry collaborations to drive the digitalization of Ericsson and the Industry. Our global group develop state of the art solutions that simplify and automate processes in our products and services and create new value through data insights.\n<br><br>\nEricsson is hiring Experienced Data Engineers to significantly expand its Global AI Accelerator team.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nEricsson is looking for savvy Data Engineers to join our growing team of MI experts. As a team member, you will be evolving and optimizing our data and data pipeline architecture, as well as, optimizing data flow and collection for cross functional teams. You are an expert data pipeline builder and data wrangler who enjoys optimizing data systems and evolving them. The Data Engineer will support our software developers, database architects, data analysts and data scientists on data initiatives and will ensure optimal data and models devOps (dataOps) architecture is consistent throughout ongoing projects. You are self-directed and comfortable supporting the dataOps needs of multiple teams, systems and products. You will also be responsible for integrating them with the architecture used across the company. The right candidate will be excited by the prospect of optimizing or even re-designing our company’s dataOps architecture to support our existing and next generation of MI-driven products and solutions initiatives.\n<br><br>\n<strong>Your Roles and Responsibilities</strong>\n<ul>\n<li>Create and maintain optimal data and model dataOps pipeline architecture</li><li>Assemble large, complex data sets that meet functional / non-functional business requirements.</li><li>Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.</li><li>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and cloud-based ‘big data’ technologies from AWS, Azure and others.</li><li>Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.</li><li>Keep data separated and secure across national boundaries through multiple data centers and strategic customers/partners.</li><li>Create tool-chains for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.</li><li>Work with data and machine learning experts to strive for greater functionality in our data and model life cycle management systems.</li><li>Support dataOps competence build-up in Ericsson Businesses and Customer Serving Units</li>\n</ul>\n<strong>What we would like to see</strong>\n<ul>\n<li>BS, MS or PhD degree in Computer Science, Informatics, Information Systems or another related field.</li><li>3-4 years experience using the following software/tools:\n\n<ul>\n<li>Hadoop, Spark, Kafka, etc.</li><li>Experience with relational SQL and NoSQL databases, including Postgres and Cassandra.</li><li>Experience with Data and Model pipeline and workflow management tools: Azkaban, Luigi, Airflow, Dataiku, etc.</li><li>Experience with stream-processing systems: Storm, Spark-Streaming, etc.</li><li>Experience with object-oriented/object function scripting languages: Python, Java, C++, Scala, etc.</li></ul></li>\n</ul>\n\n\n<ul>\n<li>You have advanced SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of other databases/date-sources.</li><li>You have experience building and optimizing ‘big data’ data pipelines, architectures and data sets.</li><li>Experience performing root cause analysis on internal and external data and processes to answer specific business questions and seek opportunities for improvement.</li><li>You have strong analytic skills related to working with unstructured datasets.</li><li>You have built processes supporting data transformation, data structures, metadata, dependency and workload management.</li><li>Working knowledge of message queuing, stream processing, and highly scalable ‘big data’ data stores.</li><li>Strong project management and interpersonal skills.</li><li>Experience supporting and working with cross-functional teams in a dynamic environment.</li>\n</ul>\n**LI-BF1\n<br><br>\nDISCLAIMER: The above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position. Therefore employees assigned may be required to perform additional job tasks required by the manager.\n<br><br>\n&nbsp;\n<br><br>\nWe are proud to be an EEO/AA employer M/F/Disabled/Veterans. We maintain a drug-free workplace and perform pre-employment substance abuse testing.\n<br><br>\n&nbsp;\n<br><br>\nEricsson provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, protected veteran status, union membership or genetics information. Ericsson complies with applicable country, state and all local laws governing nondiscrimination in employment in every location across the world in which the company has facilities. In addition, Ericsson supports the UN Guiding Principles for Business and Human Rights and the United Nations Global Compact.\n<br><br>\n&nbsp;\n<br><br>\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, training and development.\n<br><br>\n&nbsp;\n<br><br>\nEricsson expressly prohibits any form of workplace harassment based on race, color, religion, sex, sexual orientation, gender identity, marital status, pregnancy, parental status, national origin, ethnic background, age, disability, political opinion, social status, protected veteran status, union membership or genetic information.\n<br><br>\n&nbsp;\n<br><br>\nEricsson will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by Ericsson or (c) consistent with Ericsson’s legal duty to furnish information.\n<br><br>\n&nbsp;\n<br><br>\nEmployee Polygraph Protection Act Notice - Employers are generally prohibited from requiring or requesting any employee or job applicant to take a lie detector test, and from discharging, disciplining, or discriminating against an employee or prospective employee for refusing to take a test or for exercising other rights under the Act. For more information, visit https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf.\n<br><br>\n&nbsp;\n<br><br>\nEricsson is an equal opportunity employer and is committed to providing reasonable accommodation for qualified disabled individuals during the application and hiring process. Ericsson will make modifications or adjustments to the job application or interview process that will enable a qualified applicant to be considered for a position. If you require an accommodation due to a disability, please contact Ericsson at hr.direct.dallas@ericsson.com or (866) 374-2272 (US) or (877) 338-9966 (Canada) for further assistance.\n<br><br>\n&nbsp;\n<br><br>\nPrimary country and city: United States (US)&nbsp;|| || Santa Clara&nbsp;|| R&amp;D<br><br>Apply Now!"}