{"job title": "Talent Data Analyst and Project Manager, Supervising Associate", "company": "Ernst &amp; Young Capital Advisors, LLC", "city state": "– New York, NY", "rating": "NA", "job description": "Join our Core Business Services (CBS) team and you will help support the important business enablement functions that keep our organization running strong. As a CBS professional, you will work across teams to provide the knowledge, resources and tools that help EY deliver exceptional quality service to our clients, win in the marketplace and support EY’s growth and profitability. Major teams within CBS include Finance, Information Technology, Human Resources, Enterprise Support Services, Brand Marketing and Communications, Business Development, Knowledge and Risk Management.\n<br><br>\nWith so many offerings, you have the opportunity to develop your career through a broad scope of engagements, mentoring and formal learning. That’s how we develop outstanding leaders who team to deliver on our promises to all of our stakeholders, and in so doing, play a critical role in building a better working world for our people, for our clients and for our communities. Sound interesting? Well this is just the beginning. Because whenever you join, however long you stay, the exceptional EY experience lasts a lifetime.\n<br>\n<strong>Job Summary:</strong>\n<br><br>\nAs Talent Data Analyst Supervising Associate, youll be responsible for a portfolio of moderate projects or programs. To complete these, youll demonstrate knowledge of operations, process and technology to develop approaches and resolve business problems (such as increasing cost effectiveness, minimizing statutory risks, enhancing quality of services provided, deploying new technology and/or processes, etc.). In this role, you may plan and execute moderate projects and/or programs, and may also have some resource and budget responsibility\n<br><br>\n<strong>Key Responsibilities:</strong>\n<br>\nManage a portfolio of moderate projects, including new technology/process deployments, and continuous improvement initiatives.\n<br>\nCreate and develop the project/program scope and schedules. Plan and assigns resources to associated tasks and deliverables as appropriate. May help develop and manage the budget.\n<br>\nDevelop knowledge of resources, communication and cost management, and apply this to projects/programs.\n<br>\nAnalyze the workflow of operations, and suggest improvements.\n<br>\nBuild working relationships to resolve issues with projects/programs. This may involve identifying technology improvements, establishing efficient processes across multiple groups.\n<br>\nUnderstand and supports project/program measurements. This includes analyzing processes, reporting quality results, and working with operations to drive improvements.\n<br>\nExplain difficult issues to establish consensus. Communicate issues and status reports to supervisor and/or stakeholders.\n<br>\nHelp allocate resources to meet changing project/program needs.\n<br>\nDevelop procedures, and coordinate activities within project/program team, including managing vendors. This may include working directly with internal and external suppliers.\n<br>\nAct as a peer advisor or mentor to other team members.\n<br>\nManage moderate projects, adhering to timelines. Assign tasks and confirm their completion, and manage sponsor/customer expectations.\n<br>\nUnderstand the firms business, organizational structure and operations.\n<br>\nApply strong process and technology enablement knowledge, to analyze issues and resolve moderately complex problems .\n<br>\nMonitor project/program plans, to confirm that activities and deliverables occur as planned. Identify and resolve any missed deadlines.\n<br>\nManage your own portfolio of work, prioritize your own deadlines, and delegates tasks, as needed.\n<br>\nWork independently with minimal guidance.\n<br>\nEscalate complex issues to project sponsors and/or leaders. Recommend how to resolve these issues, and influence the final decision.\n<br>\nMay coach and develop less experienced team members.\n<br>\nMay supervise team members on a daily basis, including setting priorities and providing ongoing feedback.\n<br>\n<strong>To qualify, candidates must have:</strong>\n<br>\nIn-depth experience and knowledge of project management practices and tools.\n<br>\nEnglish language skills - excellent written and verbal communication.\n<br>\nAbility to assert your own ideas, and influence others, to gain support and commitment for shared projects.\n<br>\nProficient in Microsoft Office Suite (Word, Excel, PowerPoint) and Visio.\n<br>\nGood knowledge of change management principles.\n<br>\nStrong presentation skills.\n<br>\nVery good analytical skills, to grasp complexities, and understand inter-relationships between issues.\n<br>\nCompetent at handling multiple demands and competing priorities.\n<br>\nA minimum of 5-7 years progressive work experience.\n<br>\nBachelors degree or equivalent work experience."}