{"job title": "Data Scientist (Bioinformatics)", "company": "ESAC Inc", "city state": "– Rockville, MARYLAND", "rating": "3.7", "job description": "ESAC, Inc., a global provider of data management, informatics research and healthcare IT solutions to government, academic and research institutions is looking for a Software Engineer/ Senior Software Engineer who can contribute to our high-profile projects in the healthcare and bioinformatics domain. This position plays a critical role in supporting ESAC clients at the Department of Health and Human Services and its various divisions. The Software Engineer/ Senior Software Engineer will use cutting-edge technologies in the analyses, interpretation, and graphical presentation of large high throughput biological data sets. The position is based in Rockville, MD and <em>Remote Work is Available.</em>\n<br><br>\nAs a Data Scientist (Bioinformatics), the successful candidate will perform bioinformatics support, data quality assurance and curation activities for our clients at the National Institutes of Health and other scientific organizations. This position will be responsible for the ETL (Extraction, Transformation, and Loading) process within a cancer research team and will assist in interpreting, curating, and harmonizing clinical, genomic, and proteomic data associated with tumor characterization.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n<ul>\n\t<li>Serve as bioinformatics expert for new and existing projects for our clients.</li>\t<li>Be a member of team building software applications and scientific databases for life sciences.</li>\t<li>Provide bioinformatics services to assist scientific problem-solving in a broad range of research topics.</li>\t<li>Typical daily work might include custom data processing, proteomic data processing, genomic sequence, SNP and gene expression analysis.</li>\t<li>Assist with the data curation activities for the scientific databases including working with scientists, publication research, and verification.</li>\t<li>Write custom scripts and develop programs in Perl, Python, R, Java, etc.</li>\t<li>Knowledge of cell biology, pathway analysis, proteogenomics, or cancer biology a plus.</li>\n</ul>\n<strong>Minimum Qualifications:</strong>\n<ul>\n\t<li>Master of Science or equivalent degree (Ph.D. preferred) with combined education and experience in bioinformatics. Applicants with an education background in bioinformatics or related topics (e.g. mathematics and computer science/engineering) plus significant combined education and experience in one or more of biology, biochemistry, genetics, physiology, and/or bioinformatics will be considered.</li>\t<li>3+ years of bioinformatics experience including programming in Perl/Python/R/Java</li>\t<li>Knowledge or experience with high throughput data and data curation activities including proteomics, microarray gene-expression, genotyping, next-generation sequencing, etc</li>\t<li>Experience in translating customer requirements into technical requirements.</li>\t<li>Ability to identify, prioritize, and execute tasks to meet critical project deadlines.</li>\t<li>Knowledge of Unix/Linux, Windows, Scripting (Perl etc)</li>\t<li>Experience with relational databases like Oracle, MySQL, etc.</li>\t<li>Independent problem solver that enjoys collaborative research</li>\t<li>Excellent communication and people skills.</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n\t<li>Familiarity with the challenges of managing large amounts of data and a large number of samples.</li>\t<li>Experience in design and execution of analytical workflows and the display/visualization of results.</li>\t<li>Formal coursework or advanced training in one or more of the following: biology, genomics, proteomics, genetics, biochemistry, bioinformatics, software engineering.</li>\t<li>Familiarity with data visualization, graphing software tools.</li>\t<li>Knowledge in scientific and statistical software development, e.g. implementation of statistical tests and computing algorithms using a mainstream programming language.</li>\n</ul>\n<strong><u>About</u><u> ESAC</u> -</strong> <em>“We improve human health worldwide.”</em>\n<br><br>\nESAC, Inc. located in Rockville, MD, provides innovative information technology solutions to facilitate research data management for life science companies and the federal government. Our mission is to support the global vision of personalized medicine by providing value-added services and products. ESAC employs a dedicated staff with high levels of education and experience, including PhDs with backgrounds in biology, molecular biophysics, biochemistry, genetics, and bioinformatics. ESAC is recognized as a 2015 Great Places to Work in the Washington, DC area by the Washingtonian Magazine; and was also awarded 2016 Top Workplaces honored by the Washington Post.\n<br><br>\nBenefits include Competitive Base and Incentive Compensation; Medical, Dental and Vision Insurance; Life, Short-term, and Long-term Disability Insurance; 401(k) Employee Savings Plan; Generous Paid Time Off Policy; Paid Holidays; Tuition Reimbursement; Training/Certification; Professional Association Memberships; Employee Assistance Program; and other great benefits."}