{"job title": "Data Scientist", "company": "Essence", "city state": "– New York City, New York", "rating": "3.6", "job description": "About Essence\n<br>\nEssence, part of GroupM, is a global data and measurement-driven agency that blends data science, objective media and captivating experiences to build valuable connections between brands and consumers. Clients include Google, FrieslandCampina, and the Financial Times. The agency is more than 1,100 people strong, manages over $3.2B in media spend and deploys campaigns in 71 markets via its global offices throughout North America, EMEA and APAC.\n<br>\nVisit ***************** for more information and follow us on Twitter at @essenceglobal\n<br><br>\nAbout the role\n<br>\nEssence is known for its use of data and rigorous experiment-based best practices to measure and quantify the success of digital media. Over the years, we have run hundreds of studies and led several research and analytics projects to understand what makes digital advertising successful.\n<br>\nAs our Data Scientist, you're a senior member of a team that is in charge of building a predictive planning engine capable of leveraging all the data we've aggregated over the years. Reporting to the director of Analytics, as an analytics supervisor member on this newly created team, you will be instrumental in the creation and evolution of this vital initiative. This role offers the perfect blend of data engineering, data science and deep digital analytics expertise for an experienced analyst with an entrepreneurial spirit.\n<br><br>\nSome of the things we'd like you to do:\n<br><br>\nStatistics &amp; Modeling\n\n\n<ul>\n<li>Solid understanding of basic statistics (significance testing, correlation analysis, confidence intervals, descriptive statistics)</li>\n<li>Experiment Design (sample size*, power*, randomization*, matched market)</li>\n<li>Forecasting, Prediction Models (linear/nonlinear), Nonparametric models</li>\n<li>Large scale multivariate optimization</li>\n</ul>\n\nInsight Generation\n\n\n<ul>\n<li>Methodology writeups, interpretation of results</li>\n<li>Applications and generalization (Use cases, automation and scalability evaluation)</li>\n<li>POVs, 1-pager, vendor evaluation and assessment</li>\n<li>Lead commercialization of tools and techniques</li>\n</ul>\n\nData Manipulation\n\n\n<ul>\n<li>Data prep and cleanup (missing data, outlier detection, duplications) from internet scale digital advertisement/survey response data</li>\n<li>Data Integration (merge*, join*, subset*)</li>\n<li>Data visualization (Tableau, R, Matplotlib, ggPlot etc.)</li>\n</ul>\n\nLearning Techniques\n\n\n<ul>\n<li>Data mining, data reduction*</li>\n<li>Classification (Decision Tree, clustering, bagging, boosting, logit regression)</li>\n<li>Prediction (Neural Network) &amp; validation (cross validation)</li>\n</ul>\n\nTechnical Programming\n\n\n<ul>\n<li>Utilization of statistical programming tools (R,SAS, SciPy), coding languages (Python, Java, C++), and Google tools (BigQuery*, TensorFlow)</li>\n<li>Comfortable with data retrieval and processing with SQL and NoSQL</li>\n<li>Solid understanding of relational and non-relational database technology, cloud based data lake, ETL, data pipeline</li>\n<li>Understanding of code version management system</li>\n</ul>\n\nManagement\n\n\n<ul>\n<li>Some management experience, enjoys mentoring, managing direct reports</li>\n<li>Highly collaborative individual with great communication skill</li>\n<li>Develop communication styles focusing on technical details for non-technical audiences</li>\n</ul>\n\n<strong>A bit about yourself:</strong>\n\n\n<ul>\n<li>Degree / equivalent experiences in applied quantitative field (Statistics, Mathematics, Econometrics, Engineering or CS).</li>\n<li>At least 5 years of industry experience ( or 3 with graduate degree) in a data focused role</li>\n<li>Experience with building end-to-end data products with ability to use the story to create new analytical products or change an existing product in a way that improves company goals and metrics.</li>\n<li>Knowledge of the data science lifecycle - acquiring data from different sources, exploratory data analysis, creating and optimizing modes including validation and interpretation, and finally onward communication of results in a clear and succinct fashion.</li>\n<li>Hands-on Experience with statistical software packages (R, Python SciPy), programming languages (SQL, Python or JAVA)</li>\n<li>Experience with statistical models for multivariate testing, time series analysis, logistic regression and linear/non-linear regression.</li>\n<li>Baseline understanding of all the five core competencies: programming, statistics, machine learning, data munging, and data visualization.</li>\n<li>Ability to communicate your findings effectively to non-technical audiences.</li>\n<li>Preferred: Knowledge of popular ad serving technologies and supporting analytical and research tools (Doubleclick, Atlas, comScore, Compete, etc.)</li>\n<li>Preferred: Experience with machine learning algorithms (random forest, SVM, etc.) and/or Bayesian methods.</li>\n<li>Experience with multi-touch attribution modeling, media mix modeling, and data visualization a big plus.</li>\n</ul>\n\nWhat you can expect from Essence\n<br><br>\nEssence's mission is to make advertising more valuable to the world. We do this by employing the world's very best talent to solve some of the toughest challenges of today's digital marketing landscape. It's important that we hire people whose values reflect those of our own: genuine, results-focused, daring and insightful. As an Essence employee, we promise you a workplace that invests in your career, cares for you and is fun and engaging. We believe these factors create a workplace where you can be yourself and do amazing work."}