{"job title": "Green Chemistry Data Analyst#", "company": "Estee Lauder", "city state": "– Blaine, MN", "rating": "3.9", "job description": "Green Chemistry Data Analyst\n<br><br>\nBrand: Aveda\n<br><br>\nDescription\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nSustainable product design driven by Green Chemistry is a key strategic priority for ELC. To reach our strategic goals, the Company will need to build and broadly deploy new skills, technology, systems, and data analytics. This Sustainability and Green Chemistry position will be responsible for building and implementing these new capabilities across the corporation, and will need to be a passionate advocate. The role will require strong problem-solving skills given the importance in achieving stretching sustainability goals while not compromising on winning product performance.\n<br><br>\nThis position will also be responsible for providing enterprise-wide processes, systems, standards, data analytics and guidance necessary for brands to achieve their goals in serving consumers with specific ingredient concerns or those seeking products based on natural / naturally-derived ingredients and products that are designed without ingredients of concern. In addition, this role will provide leadership in aggregating, analyzing, and reporting the data trends based on the ingredient watch list, and providing recommended actions to proactively address emerging consumer trends and environmental landscape risks.\n<br><br>\n<strong>Job Description:</strong>\n\n\n<ul>\n<li>Manage the Green Design Raw Material and Supplier surveys. Ensure website surveys go out on time and support suppliers to complete it in a timely and complete manner; ensure data integrity.</li>\n<li>Manage distributor/manufacturer contact list for the surveys with input from the R&amp;D Raw Material Administration and Global Supply Chain.</li>\n<li>Communicate with supply chain distributors and manufacturers on data expectations and provide technical support to get complete and correct information entered in the surveys.</li>\n<li>Collaborate with the R&amp;D IS team, ELC Toxicology and external partners to ensure data flows and data quality of the Green Design Tool data sets.</li>\n<li>Lead data integrity and change management systems for the Green Design Tool.</li>\n<li>Support coordination of data sets from the Green Design Tool to the R&amp;D Sustainability Executive Scorecards. Assist in analysis of data sets for trends and improvement opportunities.</li>\n<li>Support core R&amp;D system design updates to track data related to Sustainability initiatives.</li>\n<li>Build enterprise-wide systems to provide reliable %-naturally derived data for all ingredients based on ISO Standard (in partnership with Raw Material Administration), and aggregate %-naturally derived data for finished product formulas.</li>\n<li>Lead projects targeted at improving environmental and ecotox footprint.</li>\n<li>Provide training and updates to others relative to sustainability and progress versus Corporate goals.</li>\n<li>Assess industry standards for best-in-class Sustainability, Green Chemistry, and Responsible Sourcing strategies and stay current on evolving industry regulations and trends</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\nMinimum Education Level: University Degree BS in Sciences\n<br><br>\nMinimum Years of Experience: 1-3 Years\n<br><br>\n<strong>Additional Job Specifications:</strong>\n<br><br>\nRequirements include having expertise and experience in environmental sciences/ sustainability or green chemistry as well as database management &amp; analytics (within Excel and other software), strong collaboration capability, and excellent writing/documentation skills. Demonstrated ability to work in high pace, multi-tasking project-driven environment. Must have excellent communication skills and be able to effectively interact with chemists and other technologists as well as management and external suppliers. Desirable to have experience working in a regulated environment.\n<br><br>\n<strong>Specific Skill Expectations:</strong>\n\n\n<ul>\n<li>Data management systems (MS Access, Oracle, SAP, etc.) and analytics</li>\n<li>Project management and systems (SharePoint, MS Project, etc.)</li>\n<li>1-3 years industry or equivalent experience working with data systems to drive business performance</li>\n<li>Working knowledge and experience with Environmental Metrics</li>\n<li>Has strong communication and collaboration skills and can translate technical data into business relevant information</li>\n<li>Attention to detail and executes with excellence</li>\n</ul>\n\nJob: Research &amp; Development\n<br><br>\nPrimary Location: Americas-US-MN-Blaine\n<br><br>\nJob Type: Standard\n<br><br>\nSchedule: Full-time\n<br><br>\nShift: 1st (Day) Shift\n<br><br>\nTravel: Yes, 5 % of the Time\n<br><br>\nWe are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply.\n<br><br>\nJob Number: 1818203"}