{"job title": "Data Scientist", "company": "Esurance", "city state": "– San Francisco, CA", "rating": "3.3", "job description": "Esurance is looking for a Data Scientist to join a dynamic and award-winning team of individuals who are committed to making insurance smarter, easier, and dare we say- cooler. As part of a growing company that is focused on providing an outstanding customer experience, you’ll have the opportunity to expand your skills and discover your potential.\n<br><br>\nIf you’re looking for a career at a socially conscious company that offers great benefits — including matching 401k and tuition reimbursement — then you may have just found your new home.\n<br><br>\nEsurance combines the spunk of a startup company with the backing of Allstate (the largest publicly held personal lines insurer in the U.S.) to create a unique, energized, and exciting place to work.\n<br><br>\nData scientists in the group develop tangible and actionable recommendations that are then implemented in real-time to improve business operations. Key responsibilities include:\n<ul>\n<li>Working with business stakeholders to deeply understand business problems and pain points</li><li>Developing algorithms and predictive models using large amounts of structured and unstructured data</li><li>Collaborating with internal technology team to deploy solutions for real-time decisions</li><li>Designing experiments to determine efficacy of solutions.</li><li>Providing on-going performance monitoring of decision systems and statistical models</li></ul>\n\n<ul>\n<li>Excellent knowledge of a high-level language for statistical and scientific computing (R, Python or similar)</li><li>Extensive experience in data management and data scrubbing</li><li>Strong aptitude towards math and programming</li><li>Ability to communicate complex information in a way that is clear and easily understood</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nAt Esurance, being committed to our employees is not just something we say, it’s something we do. Our benefits package is designed to help our associates stay healthy, meet their long-term financial goals, and balance the demands of work and personal life. Esurance rewards hard work, dedication, and creativity with competitive salaries and a generous bonus system. We are committed to our employees and we are dedicated to creating a diverse, positive, innovative and team-oriented work environment.\n<br><br>\nHealth &amp; wellness\n<ul>\n<li>Medical, vision, and dental insurance</li> <li>Life insurance (company-paid and supplemental)</li> <li>Accidental death and dismemberment coverage</li> <li>Wellness coaching and incentives</li> <li>Group critical illness coverage</li> <li>Accident indemnity and hospital indemnity plans</li> <li>Group legal</li> \n</ul>\nSavings\n<ul>\n<li>401(k) plan with annual matching contribution</li> <li>Referral bonuses</li> <li>Performance-rewarding bonus system</li> <li>Tuition assistance program (up to $5,250 per year)</li> <li>Health savings and flexible spending accounts</li> <li>Commuter benefits</li> \n</ul>\nFamily &amp; Community\n<ul>\n<li>Adoption assistance</li> <li>Maternity leave</li> <li>Buckle Up Baby program</li> <li>Pet insurance discount</li> <li>Charitable gift matching</li> <li>Give Time, Get Time volunteer program</li> <li>Employee Assistance Program</li> \n</ul>\nTime off\n<ul>\n<li>Short-term disability</li> <li>Long-term disability (employee-paid option)</li> <li>Paid time off (holidays, vacation, etc.)</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}