{"job title": "Senior Data Review Scientist", "company": "Eurofins Lancaster Laboratories", "city state": "– PA, Lancaster", "rating": "2.7", "job description": "<div><div><strong>\n<br>\nSenior Data Review Scientist</strong><br>\n\n<div>\n<div>\nOrganization\n<br><br>\n<strong>\n<br>\nEurofins Lancaster Laboratories Inc.</strong>\n</div><br>\n\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nPA, Lancaster</strong>\n</div><br>\n\n<div>\nJob Code\n<br><br>\n<strong>11129</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div>Eurofins Lancaster Laboratories, a nationally recognized laboratory, is searching for a Senior Data Review Scientist to support our Viral Clearance department in Lancaster, PA.\n<br><br>\n<strong><u>Senior Data Review Scientist responsibilities include, but are not limited to, the following</u></strong><strong> :</strong>\n\n<ul>\n<li>Ensure that the client receives quality reports that meet their expectations by reviewing laboratory data for accuracy, clarity, consistency, and adherence to client requirements</li>\n</ul>\n<strong><u>The ideal candidate would possess</u></strong><strong> :</strong>\n\n<ul>\n<li>Strong computer, scientific, and organizational skills</li>\n\n<li>Excellent communication (oral and written) and attention to detail</li> \n\n<li>Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude</li>\n\n<li>Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies</li>\n\n<li>Laboratory experience with knowledge of regulatory requirements; Some experience in gel electrophoresis, PCR, qPCR,restriction digests, or sequencing <strong>is a plus</strong></li>\n</ul>\n<strong><u>Basic Minimum Qualifications</u></strong><strong> :</strong>\n\n<ul>\n<li>Bachelor's degree in biochemistry, chemistry, or other related degree concentration, or equivalent directly-related experience (two years of directly related industry experience is equivalent to one full-time year of college in related major)</li>\n\n<li>Minimum of 3 years’ experience with QA/QC data review</li>\n\n<li>Authorization to work in the United States indefinitely without restriction or sponsorship</li>\n</ul>\nPosition is full-time, Monday-Friday, 9 am-5 p.m., with overtime as needed. Candidates currently living within a commutable distance of Lancaster, Pennsylvania are encouraged to apply.\n<br><br>\nAs a Eurofins Lancaster Labs employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options.\n<br><br>\nTo learn more about Eurofins, please explore our website www.eurofinsus.com.\n<br><br>\nEurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer.<br>\n<div>\n<div>\n<div><strong>In 1987, Eurofins Scientific was founded in Nantes, France, with four employees to market the SNIF‑NMR technology. During the past 30 years, Eurofins has grown to be a world leader in laboratory testing services with a network of 375 laboratories across 41 countries in Europe, North and South America and Asia-Pacific and over 30,000 staff.</strong>\n<br><br>\n<strong>Eurofins is the world leader in the food, bio/pharmaceutical product testing. It is also number one in the field of environmental laboratory services and one of the global market leaders in agroscience, genomics, discovery pharmacology, and central laboratory services.</strong></div>\n</div>\n</div>\n</div>"}