{"job title": "Scientist", "company": "Eurofins Lancaster Laboratories", "city state": "– IN, Indianapolis", "rating": "2.7", "job description": "<div><div><strong>\n<br>\nScientist</strong><br>\n\n<div>\n<div>\nOrganization\n<br><br>\n<strong>\n<br>\nEurofins Lancaster Laboratories Professional Scientific Services, LLC</strong>\n</div><br>\n\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nIN, Indianapolis</strong>\n</div><br>\n\n<div>\nJob Code\n<br><br>\n<strong>13684</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div>Eurofins Lancaster Laboratories, a nationally recognized laboratory, is searching for a Scientist to support our Professional Scientific Services group in Indianapolis, IN.\n<br><br>\n<u>Scientist responsibilities include, but are not limited to, the following</u>:\n\n<ul>\n<li>Perform evaluations and laboratory testing on primary container-closure components and system, critical secondary packaging, and shipping systems utilizing mechanical testing equipment, dimension measurement instruments, and container closure integrity testing systems.</li>\n\n<li>Execute methods, collect data, and document results in lab notebooks and LIMS.</li>\n</ul>\n<u>The ideal candidate would possess</u>:\n<br><br>\n·Strong computer, scientific, and organizational skills\n<br><br>\n·Excellent communication (oral and written) and attention to detail\n<br><br>\n·Ability to work independently and as part of a team with self‑motivation, adaptability, and a positive attitude\n<br><br>\n·Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies\n<br><br>\n<u>Basic Minimum Qualifications</u>:\n<br><br>\n·Bachelor's in science, engineering, or technology, or equivalent directly-related experience (two years of directly related industry experience is equivalent to one full-time year of college in related major)\n<br><br>\nAt least three months of laboratory experience.\n<br><br>\n·Authorization to work in the United States indefinitely without restriction or sponsorship\n<br><br>\nPosition is full-time, Monday-Friday, 8 a.m.-5 p.m., with overtime as needed. Candidates currently living within a commutable distance of Indianapolis, Indiana are encouraged to apply.\n<br><br>\nAs a Eurofins Lancaster Labs employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options.\n<br><br>\nTo learn more about Eurofins Lancaster Laboratories, please explore our website www.EurofinsUs.com.\n<br><br>\nEurofins Lancaster Laboratories is an Equal Employment Opportunity and Affirmative Action employer.</div>"}