{"job title": "Data Scientist", "company": "Evans &amp; Chambers Technology", "city state": "– Washington, DC", "rating": "4.5", "job description": "Evans &amp; Chambers are currently seeking a Data Scientist to oversee and manage complex, state of the art, new unique programs and projects related to information technology. All candidates must be a U.S. Citizen.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Develop and presents issues, conclusions, and recommendations to senior leadership based on reviews and evaluations.</li>\n<li>Directs and conducts analysis of requirements pertaining to Agency programs and objectives.</li>\n<li>Examines policies to identify those affecting programs and determines approaches to resolving issues</li>\n<li>Identify problem areas, define the nature and scope of the problem and objectives sought.</li>\n<li>Work with a team to design, implement, and maintain new systems.</li>\n<li>Provide guidance to the customer on best-practices.</li>\n<li>Perform other duties as assigned.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Must have an active/current TS/SCI and be able to pass a CI Poly.</li>\n<li>Approximately 10 years of experience in information systems development, focused on processing large volume, near-real time data feeds to meet data analytics and security requirements.</li>\n<li>Experience and knowledge of tools associated with multiple intelligence missions.</li>\n<li>Bachelor's Degree in computer science, information systems management, mathematics, engineering, or other relevant discipline.</li>\n<li>Knowledge of web services feeds</li>\n<li>Demonstrated work experience in architecting new system solutions using current technologies, as well as transitioning existing systems into modern technologies without negatively impacting operational and compliance requirements.</li>\n<li>Demonstrated experience performing data assessment, data engineering, modeling and analytics to enable new methodologies for end user analysts, data scientists, etc.</li>\n<li>Demonstrated experience as a SME to prioritize and meet tactical and strategic requirements for frameworks and systems to process data.</li>\n<li>Demonstrated experience in information systems development across the IT lifecycle, with a focus on systems to perform high volume and velocity data processing on disparate data types/formats.</li>\n<li>Demonstrated experience architecting and delivering automated and scalable data process monitoring and data quality systems and processes.</li>\n<li>Must be a diverse thinker and be able to work in a large group setting.</li>\n<li>Write and edit technical documents and reports;</li>\n<li>Write, edit, and produce contents for contract deliverables: reports, training materials, presentation slides, letters, fact sheets, diagrams, and capability statements.</li>\n<li>Effectively communicate project expectations to team members and stakeholders in a timely and clear fashion.</li>\n<li>Communicate formally and informally through existing forums to stakeholders at all levels, including senior leadership.</li>\n<li>AWS, Atlassian Suite products like Jira/Confluence and AWS Cloud experience desired.</li>\n</ul>\n\n<strong>Travel Requirements:</strong>\n\n\n<ul>\n<li>Travel may be required both inside and outside the Washington National Capital Region (NCR).</li>\n</ul>\n\nWe are an Equal Opportunity employer and do not discriminate on the basis of race, ancestry, color, religion, sex, age, marital status, sexual orientation, national origin, medical condition, disability, veteran status, gender identity, or any other basis protected by law.<br><br>SDL2017"}