{"job title": "Data Scientist", "company": "Everlane", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "<div>\n<div>Everlane is seeking a Data Scientist to join our Data and Analytics team, where you’ll use data to help us build a better understanding of how our product works, who our customer are, and what drives our company’s growth.</div><br>\n\n<div>As a team, we lean on a full-stack set of methodologies and tools to solve these problems, taking a data science problem from an initial open ended question to the eventual business implementation of a model. The subject areas that you will impact span the entire company, from helping our digital product team evaluate new opportunities of improvement on our website, to building models around the purchase preferences of our customers.</div></div><br>\n\n<div>\n<div>\nThe Job\n\n<ul>\n\n\n\n<ul>\n<li>Work with business stakeholders to create metrics and self service reporting around key questions</li>\n<li>Create and deploy custom models to understand a diverse set of business problems including customer preferences, marketing performance, and inventory patterns</li>\n<li>Design and analyze rigorous experiments aimed at understanding customer behavior</li>\n<li>Partner with teams across the company to proactively identify areas of impact for data science</li></ul>\n\n\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>\nThe Qualifications\n\n<ul>\n\n\n\n<ul>\n<li>BA/BS degree in a quantitative or computing focused degree</li>\n<li>4+ years of experience wrangling and analyzing large datasets to solve open ended business problems</li>\n<li>Expertise in R, Python, or another data science suitable language</li>\n<li>Expertise in SQL extending to knowledge of database design and warehousing concepts</li>\n<li>Strong fundamentals in statistics and probability, including formal statistical modeling and experimental design</li>\n<li>Strong communicator, especially when distilling complex concepts for a general audience</li>\n<li>Able to translate qualitative questions into an analytical framework, including recognizing when simplicity is for the best</li>\n<li>Nice to have: working on data problems in a distributed framework, i.e. Spark, Hadoop</li></ul>\n\n\n</ul>\n\n</div>\n</div><br>\n\n<div>\n<div>At Everlane, we’re rethinking the way retail works. We have no middlemen taking their cut and no brand markups. Instead, we design our own luxury basics and sell them exclusively at a fraction of the traditional retail price. Since launching in November 2011, Everlane has attracted over 1,300,000 members and has been featured in The New York Times, New York Magazine, The Economist, Elle, and GQ.</div><br>\n\n<div>Please note before submitting an application: as a company, we take hiring very seriously. Interviewing with Everlane may include video and phone interviews, written projects, and/or on-site interviews. Although we are unable to follow-up with each and every applicant, we do our best to run a thorough process for candidates with whom we identify a potential fit.</div><br>\n\n<div>Everlane provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or gender expression.</div></div>\n<br>"}