{"job title": "Application Scientist II, Technical Services", "company": "Exact Sciences Corporation", "city state": "– Madison, WI", "rating": "3.4", "job description": "The Application Scientist II is responsible for providing outstanding technical support to Exact Sciences customers. This position works individually or in collaboration with others on troubleshooting and resolving customer assay questions or issues in a timely manner. This position will also work on projects to bring enhancements of current products and processes to the customer.\n<ul>\n<li>Receives and documents incoming customer communications.</li><li>Works cooperatively with the Technical Services team and when appropriate internal functional departments to troubleshoot and resolve customer questions or requests in the areas of reagent, consumables and assay related issues.</li><li>Leads troubleshooting of customer issues through root cause investigation, experiment design, study execution, data analysis and reporting.</li><li>When needed conducts bench level experiments within several product areas.</li><li>Prepares technical experiment report with all technical specification and information and presents to supervisor or project team.</li><li>Coordinates with the development and marketing team for proper implementation of new products by providing technical input and participates in decisions affecting project planning and experimental design.</li><li>Clearly and accurately summarizes and documents troubleshooting activities or technical summary.</li><li>Prepares detailed technical protocols.</li><li>Takes feedback from customers regarding their product requirements, communicating their needs to the developmental team for better designing and implementing of new and existing products.</li><li>Assists with metrics tracking to monitor performance of the technical services team and quality of the product delivered to the laboratory customer.</li><li>Drafts and distributes content of customer communications including customer notifications and technical or service bulletins.</li><li>Contributes ideas to improve team process.</li>\n</ul>\n<strong>Mandatory Skills</strong>\n<ul>\n<li>Clear communication with supervisor and team members.</li><li>Ability to provide technical and hands-on support to laboratory customers by phone, email and/or onsite.</li><li>Ability to identify, implement, and report on improvements in processes and products.</li><li>Detail oriented with very strong organizational skills.</li><li>Strong analytical and troubleshooting skills.</li><li>Excellent customer facing abilities.</li><li>Ability to maintain confidentiality of sensitive information.</li><li>Hands-on experience in molecular biology techniques.</li><li>Experience analyzing data with tools such as Microsoft Excel or JMP.</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n<ul>\n<li>Experience in a Medical Device field working in a regulated environment, e.g., ISO 13485, FDA GMP, or USDA.</li><li>Understanding of the Quality System Regulations and Service requirements defined therein.</li>\n</ul>\n<strong>Education and Experience</strong>\n<ul>\n<li>Bachelor’s Degree in Life Sciences or equivalent field plus a minimum of 7 years’ experience.</li><li>Experience working in a technical support function role desired.</li><li>Experience in using basic software applications including Microsoft Office (Word - generate documents and tables, Excel - able to create and modify spreadsheets, create formulas, etc.); Email – preferably Outlook.</li><li>Extensive experience working in a molecular diagnostics/clinical laboratory setting preferred.</li><li>Advanced knowledge of statistical and mathematical methods in biology/genetics, including experience with JMP software.</li>\n</ul>\n<strong>Physical Requirements</strong>\n<ul>\n<li>Ability to use computers daily in an interactive manner for extended periods of time and up to 8 hours per day.</li><li>Ability to frequently and accurately communicate with employees, and customers in person, via the telephone or by email.</li><li>Ability to sit for an extended period of time.</li><li>Ability to stand for extended periods of time and up to 6 hours at a time.</li><li>Ability to follow company safety guidelines.</li><li>Constant walking or motion to coordinate work and interact with co-workers.</li>\n</ul>\n#LI-RM1\n<br><br>\n<strong>Exact Sciences is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. Applicable portions of the Company’s affirmative action program is available to any applicant or employee for inspection upon request.</strong>\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}