{"job title": "Certified Clinical Laboratory Scientist I - Tuesday - Friday, 7:30pm - 6:00am shift - $1,000 sign on bonus!", "company": "Exact Sciences Corporation", "city state": "– Madison, WI", "rating": "3.8", "job description": "The Certified Clinical Laboratory Scientist I provides services of technical nature in the laboratory service areas. Performs complex laboratory tests in the clinical laboratory to provide physicians with rapid and accurate laboratory test results. Duties include; processing of specimens in the laboratory, performance of moderate, and highly complex analytical process, establishing performing and documenting quality assurance, quality control and equipment maintenance, recognizing problems and assisting the Clinical Laboratory Supervisor in identifying causes, confirming and verifying results, principles, and instruments, correlating and interpreting data based on knowledge of factors affecting test results, data handling and input, answering the telephone.\n<br><br>\n<strong>We are offering a $1,000 sign on bonus to new hires for this role.</strong> The hours for this position would be <strong>Tuesday - Friday from 7:30pm - 6:00am (3rd shift).</strong>\n<br><br>\n<strong>Technical Skills:</strong>\n<ul>\n<li>Performs moderate, and/or highly complex analytic processes without direct supervision. Uses routine and specialized automated and non-automated laboratory procedures and/or techniques for which he/she is qualified, trained, and demonstrates competency according to established lab section operating procedures.</li><li>Operates laboratory instruments and ensures proper functioning of laboratory equipment.</li><li>Completes required maintenance activities on equipment, recognizes and elevates potential issues to the team members responsible.</li><li>Reports service needs to supervisor for resolution.</li><li>Maintains records and documentation of maintenance.</li><li>Calibrates laboratory instruments to ensure accuracy of test results. Performs quality control procedures as specified and maintains quality control records and documentation necessary to meet the standards of accrediting agencies.</li><li>Understands appropriate specimen collection, handling and transport procedures.</li><li>Prepares specimens for analysis and determines acceptability of samples within guidelines.</li><li>Assists in developing procedures for specimen collection, handling and transport to maintain specimen integrity and viability.</li><li>Verifies accuracy, and enters data in the laboratory computer system, along with appropriate explanatory or interpretive information. Meets all section turn-around times.</li><li>Validates acceptability of test results by review of quality control and all other test parameters.</li><li>Identifies the technical, instrumental and/or physiologic causes of unexpected test results.</li><li>Evaluates and calculates quality control statistics to assess accuracy, reproducibility and validity of current laboratory methods.</li> <li>Monitors quality assurance and assists in data collection and preparation of QA indicators.</li><li>Performs internal and external proficiency testing. Handles proficiency testing samples in the same manner as patient samples.</li><li>Maintains clean and orderly work area. Cleans bench surfaces and equipment each shift or after contamination or spill.</li><li>Meets work product output expectations.</li>\n</ul>\n<strong>Knowledge Base:</strong>\n<ul>\n<li>Complies with safety and hazard regulations as outlined in the Clinical Laboratory Safety Manual. Failure to follow safety protocols will result in disciplinary action. Understands, maintains and enforces safety guidelines.</li><li>Recognizes and reports abnormal results. Recognizes unexpected results, errors and problems with patient tests.</li><li>Has knowledge of the theory of laboratory procedures. Identifies technical, instrumental and/or physiologic causes of unexpected test results. Assists the supervisor and Clinical Laboratory Supervisor developing solutions to problems based on knowledge of biochemical theory/reactions, patient diagnosis and instrument performance.</li><li>Ensures quality and timeliness of patient test results by investigating problems involving specimen collection, result reporting, and turn-around time. Interprets problems with specimens which meet the rejection criteria for unacceptable samples. Makes the decision to reject a sample and request recollection to ensure validity of results.</li><li>Uses statistical methods to assess laboratory testing.</li><li>Observes principles of data security and patient confidentiality. Maintains ethical standards in the performance of testing and in interactions with patients, co-workers and other health care professionals.</li>\n</ul>\n<strong>Judgment/Analytical Decision Making:</strong>\n<ul>\n<li>Performs analytical and decision making functions without direct supervision.</li><li>Prioritizes order of testing based on priority of request, workload and testing schedules to meet turn-around times. Coordinates general work flow in assigned area.</li><li>Differentiates technical, instrumental and/or physiologic causes for unexpected test results.</li><li>Resolves and documents resolution of all QC results which fail lab criteria and institutes corrective action.</li><li>Evaluates instrument/method failure and determines when back-up methods must be initiated.</li>\n</ul>\n<strong>Teaching/Training:</strong>\n<ul>\n<li>Responds to technical questions consistent with level of training.</li><li>Participates in continuing education and staff meetings. Prepares and presents continuing education programs for department personnel as requested. Responsible for own professional development.</li><li>Assists on training new employees.</li><li>Assists in verifying competency of new employees.</li> <li>Instructs personnel in work team(s) on new methods and/or instruments.</li><li>Teaches laboratory procedures, processes and policies, including methodology and instrument operation.</li><li>May be requested to give lectures or provide demonstrations. May assist the education coordinator in the development of objectives, learning activities and evaluation mechanisms.</li><li>Provides technical information and/or instruction to clients, new employees, medical students, residents, peers and the public as requested and where appropriate.</li><li>Contributes to design, research, review and writing of laboratory manuals. Remains informed of procedure updates and changes.</li>\n</ul>\n<strong>Administration:</strong>\n<ul>\n<li>Maintains adequate inventory of reagents and supplies.</li><li>Discards outdated reagents according to section policy.</li><li>Performs inventory counts as requested.</li><li>Suggests cost-effective laboratory procedures or protocol changes.</li><li>Applies step by step thinking, problem solving and critical thinking patterns.</li><li>Supervises laboratory personnel as assigned.</li><li>Implements changes as assigned in response to new technology and laboratory procedures.</li><li>Reviews daily data reports as requested.</li>\n</ul>\n<strong>Communication:</strong>\n<ul>\n<li>Reports test results through laboratory computer system.</li><li>Maintains open and effective communication with personnel in work team, and with members of other teams throughout the laboratory.</li> <li>Demonstrates willingness to cooperate with team members and with cross-functional groups in the laboratory to accomplish timely and accurate testing.</li><li>Demonstrates professional demeanor, in personal appearance and behavior, in all work-related interactions inside and outside of the laboratory.</li><li>Demonstrates adaptability by embracing changes in the laboratory with a positive attitude.</li><li>Provides constructive criticism for modification of laboratory procedures, policies and test/employee scheduling.</li><li>Interacts with other healthcare workers to solve problems and interprets patient lab results within the framework of medical technology.</li><li>Informs physicians concerning details and limitations of lab procedures.</li>\n</ul>\n<strong>Mandatory Skills &amp; Qualifications:</strong>\n<ul>\n<li>Demonstrated ability to respond to stakeholder requests in a professional and timely manner.</li><li>Exceptional written and verbal English communication skills and strong attention to detail.</li><li>Demonstrated ability to train others on technical concepts and test for understanding.</li>\n</ul>\n<strong>Necessary Education &amp; Experience:</strong>\n<ul>\n<li>B.S. / B.A. degree in Clinical Laboratory Science or Medical Technology or in the chemical or biological sciences. Must satisfy the education requirements of the applicable certifying agency, i.e. ASCP.</li><li>Appropriate certification from one of the nationally recognized certification agencies, i.e. ASCP or state licensure that has been determined to be equivalent.</li>\n</ul>\n<strong>Desired Characteristics:</strong>\n<ul>\n<li>One year relevant experience in a clinical laboratory. Experience in molecular testing desired.</li> \n</ul>\n<strong>Physical Requirements &amp; Working Conditions:</strong>\n<ul>\n<li>Ability to lift and move 20-40 pounds on an occasional basis (up to 25% of time).</li><li>Ability to stand, walk, bend and reach on a regular basis (standing ≈50% of time; sitting ≈50% of time).</li> <li>Ability to grasp with both hands; pinch with thumb and forefinger; turn with hand/arm; reach above shoulder height.</li><li>Ability to listen and speak on the telephone and write simultaneously.</li><li>Ability to operate telephone system and computer keyboard and mouse.</li><li>Position requires work in normal laboratory environment. Special uniform and personal protective equipment is required while working in the laboratory.</li>\n</ul>\n<strong>Visual, hearing, dexterity and mental demands:</strong>\n<ul>\n<li>Vision: Adequate to perform the essential functions of the job such as read and perform lab tests.</li><li>Hearing: Adequate to perform the essential functions of the job such as hear timers go off, etc.</li><li>Speaking: Adequate to perform the essential functions of the job such as communicating with staff, patients, colleagues and providers.</li><li>Dexterity: Adequate to perform the essential functions of the job along with computer work.</li><li>Mental Demands - Adequate to perform the essential functions of the job such as the stress of reporting STAT lab work and performing multiple lab tests simultaneously.</li>\n</ul>\n#LI-MF1\n<br><br>\n<strong>Exact Sciences is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. Applicable portions of the Company’s affirmative action program is available to any applicant or employee for inspection upon request.</strong>"}