{"job title": "Clinical Development Scientist", "company": "Exact Sciences Corporation", "city state": "– Madison, WI", "rating": "3.8", "job description": "The Clinical Development Scientist facilitates and contributes to the development and implementation of new clinical testing within the laboratory. This role serves as a scientific resource and provides up-to-date evidence relevant to test development and implementation. Knowledge of laboratory information management systems, infectious disease, genomics and molecular diagnostics is critical to the success of the Clinical Development Scientist. The ideal candidate must have the ability to clearly communicate complex scientific ideas to a broad audience in order to promote and implement an expanding testing menu at Exact Sciences laboratories. This role will support internal and external collaborations in partnership with the Medical Director, Clinical Laboratory Directors, Technical Transfer and clinical laboratory teams.\n<br><br>\nThe primary responsibility of the Clinical Development Scientist is to coordinate and facilitate the implementation of new testing and methodologies into the clinical laboratory.\n<ul>\n<li>Read and synthesize major scientific data sources (clinical trials, studies, published reports, etc.) and communicate key findings to collaborators</li><li>Oversee and manage the activities involved in the development, optimization and implementation of new test methods and test systems</li><li>Guide development of transfer protocols and reports</li><li>Lead and assist in the development and maintenance of QC programs</li><li>Attend regional and national scientific and clinical meetings</li><li>Comply with regulatory requirements</li><li>Work collaboratively with the Medical Director and Clinical Laboratory Directors on the clinical development plan</li><li>Contribute to development of long-range strategic clinical laboratory planning</li><li>Partner with data management teams and contribute to the development of a data quality plan</li><li>Recruit, develop, and retain a diverse and highly capable clinical scientist team</li><li>Mentor and/or train new clinical scientists</li><li>Manage complex, cross-functional projects with a good knowledge of clinical laboratory regulations and guidelines</li><li>Identify and share best practices with oversight for the implementation of best practices for business processes</li>\n</ul>\n<strong>Qualifications and Experience</strong>\n<ul>\n<li>Advanced clinical/science degree required (PhD and/or MD)</li><li>Four (4) or more years clinical/biotech industry experience</li><li>Five (5) or more years prior supervisory experience with a keen interest in mentoring and developing staff</li><li>Well-versed in CLIA, CAP accreditation, HIPAA</li><li>Strong computer skills</li><li>Demonstrated strong organizational and technical writing skills</li><li>Excellent interpersonal, verbal communication, and influence skills</li> <li>Strong problem-solving skills with the ability to anticipate problems, diagnose root causes, and take corrective action to prevent reoccurrence</li> <li>Ability to embrace diversity of thought to model innovative behaviors (reach across boundaries, empower others, and lead decisively in the midst of ambiguity)</li><li>Self-directed with a strong work ethic coupled with ability to work in a goal-oriented environment</li>\n</ul>\n<strong>Physical Requirements:</strong>\n<ul>\n<li>Ability to use computers daily in an interactive manner for extended periods of time and up to 8 hours per day</li><li>Ability to sit for an extended period of time</li><li>Ability to stand for extended periods of time and up to 6 hours at a time</li><li>Ability to operate telephone system and computer keyboard and printer</li><li>Ability to lift and move up to 40 pounds on an occasional basis</li>\n</ul>\n#LI-MF1\n<br><br>\n<strong>Exact Sciences is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. Applicable portions of the Company’s affirmative action program is available to any applicant or employee for inspection upon request.</strong>"}