{"job title": "Lead Certified Clinical Laboratory Scientist - Tuesday - Friday, 2:30 PM - 1:00 AM - $1000 sign on bonus!", "company": "Exact Sciences Corporation", "city state": "– Madison, WI", "rating": "3.8", "job description": "The Lead Certified Clinical Laboratory Scientist provides leadership support to the technical lab staff. This person is also responsible for being the workflow and troubleshooting point person in the technical lab. This position is primarily responsible for coordinating and conducting day-to-day activities in the laboratory to ensure timely and accurate testing. The Lead works directly with the Clinical Laboratory Supervisor to anticipate and resolve issues related to efficiencies in throughput, staffing, and laboratory processes. This position is also responsible for verifying result release and pending list management and investigation. The Lead is expected to spend at approximately half of their time performing laboratory testing on the bench.\n<br><br>\n<strong>We are offering a $1,000 sign on bonus to new hires for this role. The shift for this position is Tuesday - Friday from 2:30 PM - 1:00 AM.</strong>\n<br><br>\n<strong>Technical Skills</strong>\n<ul>\n<li>Performs highly complex analytic processes without direct supervision. Utilizes routine and specialized automated and non-automated laboratory procedures and/or techniques after completing training, and demonstrating competency according to established lab section operating procedures.</li><li>Operates laboratory instruments, performance maintenance as needed and ensures proper functioning of laboratory equipment.</li><li>Identifies errors and problems, assists in troubleshooting instrument malfunction(s), and may assist service and support in performing preventive and corrective maintenance and repairs on laboratory equipment.</li><li>Completes required maintenance activities on equipment, recognizes and elevates potential issues to the team members responsible.</li><li>Maintains records and documentation of maintenance.</li><li>Calibrates laboratory instruments to ensure accuracy of test results. Performs quality control procedures as specified and maintains quality control records and documentation necessary to meet the standards of accrediting agencies.</li><li>Understands appropriate specimen collection, handling and transport procedures.</li><li>Prepares specimens for analysis and determines acceptability of samples within guidelines.</li><li>Verifies accuracy, and enters data in the laboratory computer system, along with appropriate explanatory or interpretive information.</li><li>Assists the department supervisor in ensuring that all section turn-around times are maintained.</li><li>Validates acceptability of test results by review of quality control and all other test parameters.</li><li>Identifies the technical, instrumental and/or physiologic causes of unexpected test results.</li><li>Evaluates and calculates quality control statistics to assess accuracy, reproducibility and validity of current laboratory methods.</li><li>Monitors quality assurance and assists in data collection and preparation of QA indicators.</li><li>Performs internal and external proficiency testing. Handles proficiency testing samples in the same manner as patient samples.</li><li>Meets work product output expectations.</li><li>Understand and assist with Quality Control Specialist in performing lot to lot and analyzer to analyzer testing.</li><li>Complies with all safety and hazard regulations as outlined in the Clinical Laboratory Safety Manual and ensures that all employees are following laboratory and regulatory guidelines. Understands, maintains and enforces safety guidelines.</li><li>Utilizes statistical methods to assess laboratory testing.</li><li>Observes and demonstrates principles of data security and patient confidentiality.</li><li>Maintains ethical standards in the performance of testing and in interactions with patients, co-workers and other health care professionals.</li>\n</ul>\n<strong>Judgment/Analytical Decision Making</strong>\n<ul>\n<li>Performs analytical and decision making functions without direct supervision.</li><li>Prioritizes order of testing based on priority of request, workload and testing schedules to meet turn-around times. Coordinates general work flow in assigned area daily to ensure workload is satisfied.</li><li>Differentiates technical, instrumental and/or physiologic causes for unexpected test results.</li><li>Resolves and documents resolution of all QC results which fail lab criteria and institutes corrective action.</li><li>Evaluates instrument/method failure and determines when back-up methods must be initiated.</li>\n</ul>\n<strong>Teaching/Training</strong>\n<ul>\n<li>Responds to technical questions of laboratory staff and others in ES Labs.</li><li>Participates in continuing education and staff meetings. Responsible for own professional development.</li><li>Assists with training and competency of employees.</li><li>Assists with knowledge transfer of changes and additions to laboratory procedures, processes and policies, including methodology and instrument operation.</li><li>May be requested to give lectures or provide demonstrations. May assist the education coordinator in the development of objectives, learning activities and evaluation mechanisms.</li><li>Provides technical information and/or instruction to clients, new employees, medical students, residents, peers and the public as requested and where appropriate.</li><li>Contributes to design, research, review and writing of laboratory procedures. Remains informed of procedure updates and changes and ensures employees demonstrate knowledge and competency regarding changes.</li>\n</ul>\n<strong>Administration</strong>\n<ul>\n<li>Primary source of contact for staff in the laboratory area for technical and administrative problem solving.</li><li>Conducts check in meetings with members of their respective shift.</li><li>Participates in year-end reviews of employees by providing input and delivering the review.</li><li>Maintains adequate inventory of reagents and supplies.</li><li>Suggests cost-effective laboratory procedures and protocol changes.</li><li>Applies step by step thinking, problem solving and critical thinking patterns.</li><li>Supervises laboratory personnel as assigned.</li><li>Provide specimen processing leadership as needed.</li><li>Implements changes as assigned in response to new technology and laboratory procedures.</li><li>Reviews daily data reports as requested.</li>\n</ul>\n<strong>Communication</strong>\n<ul>\n<li>Reports test results through ESSS (Exact Sciences Software System).</li><li>Maintains open and effective communication with personnel in work team, and with members of other teams throughout the laboratory.</li><li>Demonstrates willingness to cooperate with team members and with cross-functional groups in the laboratory to accomplish timely and accurate testing.</li><li>Demonstrates professional demeanor, in personal appearance and behavior, in all work-related interactions inside and outside of the laboratory.</li><li>Demonstrates adaptability by embracing changes in the laboratory with a positive attitude.</li><li>Provides constructive criticism for modification of laboratory procedures, policies and test/employee scheduling.</li><li>Interacts with other healthcare workers to solve problems and interprets patient lab results within the framework of medical technology.</li>\n</ul>\n<strong>Necessary Education &amp; Experience</strong>\n<ul>\n<li>Bachelor's of Science or Bachelor's of Art degree in Clinical Laboratory Science or Medical Technology or in the chemical or biological sciences. Must satisfy the education requirements of the applicable certifying agency, (i.e. ASCP).</li><li>Appropriate certification from one of the nationally recognized certification agencies, i.e. ASCP or state licensure that has been determined to be equivalent.</li><li>Six years relevant experience in a clinical laboratory desired for Certified Lead roles responsible for testing New York and California samples.</li><li>Four years of relevant experience in a clinical laboratory desired for the Certified Lead roles that are not responsible for New York or California sample testing.</li><li>Experience in molecular testing desired.</li><li>Demonstrated ability to respond to stakeholder requests in a professional and timely manner.</li><li>Exceptional written and verbal communication skills and strong attention to detail.</li><li>Demonstrated ability to train others on technical concepts and test for understanding.</li>\n</ul>\n<strong>Physical Requirements &amp; Working Conditions:</strong>\n<ul>\n<li>Ability to lift and move 20-40 pounds on an occasional basis (up to 25% of time).</li><li>Ability to stand, walk, bend and reach on a regular basis (standing ≈50% of time; sitting ≈50% of time).</li> <li>Ability to grasp with both hands; pinch with thumb and forefinger; turn with hand/arm; reach above shoulder height.</li><li>Ability to listen and speak on the telephone and write simultaneously.</li><li>Ability to operate telephone system and computer keyboard and mouse.</li><li>Position requires work in normal laboratory environment. Special uniform and personal protective equipment is required while working in the laboratory.</li> \n</ul>\n<strong>Visual, Hearing, Dexterity &amp; Mental Demands:</strong>\n<ul>\n<li>Vision: Adequate to perform the essential functions of the job such as read and perform lab tests.</li><li>Hearing: Adequate to perform the essential functions of the job such as hear timers go off, etc.</li><li>Speaking: Adequate to perform the essential functions of the job such as communicating with staff, patients, colleagues and providers.</li><li>Dexterity: Adequate to perform the essential functions of the job along with computer work.</li><li>Mental Demands: Adequate to perform the essential functions of the job such as the stress of reporting STAT lab work and performing multiple lab tests simultaneously.</li>\n</ul>\n#LI-MF1\n<br><br>\n<strong>Exact Sciences is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. Applicable portions of the Company’s affirmative action program is available to any applicant or employee for inspection upon request.</strong>"}