{"job title": "Temporary Sr. Scientist I (Pre-Formulations)", "company": "Exelixis", "city state": "– Alameda, CA", "rating": "3.2", "job description": "<div>Position Description\n<br><br>\nResponsible for all pre-formulation/formulation activities associated with small molecule lead optimization and subsequent preclinical/clinical/commercial development. Success in this position requires a highly motivated individual who can provide leadership through previous experiences in the lab to coordinate and oversee activities with contract research organizations. The qualified candidate will have proven experience in developing oral and parenteral dosage formulations and possess excellent inter-personal skills to effectively work in a team-based environment.\n<br><br>\nExelixis is located in South San Francisco, CA and will be moving to Alameda, CA in June of 2018.\n<br><br>\nPosition Requirements\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Evaluate the selection of vehicles, excipients and/or new technologies appropriate to prepare formulations of investigational small molecules for in vivo studies.</li>\n<li>Evaluate physical/chemical characteristics of small molecules as they relate to formulation investigations like pH, pKa, solubility, pH-solubility profile, particle size, solid and solution state stability studies, dissolution characteristics and polymorphism.</li>\n<li>Evaluate salt form studies</li>\n<li>Critically evaluate data sets from multiple study designs to establish predictive strategies to rank order small molecules from clinical candidacy and support preclinical/clinical development of the selected candidate.</li>\n<li>Plan &amp; manage the technical and business activities associated with execution of formulation and process development, scale-up and technology transfer activities, via collaboration with multiple disciplines within Exelixis and with external development organizations. Use statistical tools to design and evaluate experimental investigations.</li>\n<li>Responsibilities include managing the preparation, review and approval of a broad spectrum of technical documents, including MBRs, specifications, protocols, reports etc. at contract vendors or Exelixis. Additionally, you will generate appropriate sections of drug product CMC dossier for regulatory submissions (IND/NDA, CTA/MAA).</li>\n<li>Knowledge of basic pharmaceutics principles, an understanding of the role pre-formulation plays in the drug discovery/lead optimization.</li>\n<li>Evaluate the selection of vehicles, excipients and/or new technologies appropriate to prepare formulations of investigational small molecules for in vivo studies.</li>\n<li>Critically evaluate data sets from multiple study designs to establish predictive strategies to rank order small molecules from clinical candidacy and support preclinical/clinical development of the selected candidate.</li>\n<li>Plan &amp; manage the technical and business activities associated with execution of formulation and process development, scale-up and technology transfer activities, via collaboration with multiple disciplines within Exelixis and with external development organizations. Use statistical tools to design and evaluate experimental investigations.</li>\n<li>Responsibilities include managing the preparation, review and approval of a broad spectrum of technical documents, including MBRs, specifications, protocols, reports etc. at contract vendors or Exelixis. Additionally, you will generate appropriate sections of drug product CMC dossier for regulatory submissions (IND/NDA, CTA/MAA).</li>\n</ul>\n\n<strong>SUPERVISORY RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>None</li>\n</ul>\n\n<strong>EDUCATION/EXPERIENCE/SKILLS:</strong>\n<br><br>\n<strong>Education:</strong>\n\n\n<ul>\n<li>BS/BA degree in related discipline and eight years of related experience; or,</li>\n<li>MS/MA degree in related discipline and six years of related experience; or,</li>\n<li>PhD in related discipline and three years of related experience, or;</li>\n<li>Equivalent combination of education and experience.</li>\n<li>May require certification in assigned area.</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>Strong experience with solid-state characterization &amp; analytical instrumentation.</li>\n<li>Knowledge of basic pharmaceutics principles, an understanding of the role pre-formulation plays in the drug discovery/lead optimization.</li>\n<li>Strong knowledge of and experience of the various phases of drug development for oral dosage forms is essential.</li>\n</ul>\n\n<strong>Knowledge/Skills/Abilities:</strong>\n\n\n<ul>\n<li>Strong knowledge of and experience of the various phases of drug development for oral dosage forms is essential.</li>\n<li>Has extensive experience in relevant industry/profession.</li>\n<li>Uses broad expertise or unique knowledge and skills to contribute to development of company objectives and principles and to achieve goals in creative and effective ways.</li>\n<li>Identifies and implements methods, techniques, procedures and evaluation criteria to achieve results.</li>\n<li>Has complete understanding and wide application of technical principles, theories, concepts and techniques.</li>\n<li>Has good general knowledge of other related disciplines.</li>\n<li>Applies strong analytical and business communication skills.</li>\n<li>Proficient with broad use computer applications such as MS Office and specialized applications as needed for job.</li>\n</ul>\n\n<strong>JOB COMPLEXITY:</strong>\n\n\n<ul>\n<li>Works on very complex problems where analysis of situations or data requires an in-depth evaluation of various factors. May work on significant and unique issues where analysis of situations or data requires an evaluation of intangibles.</li>\n<li>Exercises independent judgment in methods, techniques and evaluation of criteria for obtaining results.</li>\n<li>Creates formal networks involving coordination among groups.</li>\n</ul>\n\n<strong>DISCLAIMER</strong>\n<br>\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job.\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</div>\n\n<br>"}