{"job title": "Senior Scientist II", "company": "Exelixis", "city state": "– South San Francisco, CA", "rating": "3.2", "job description": "<div>Position Description\n<br><br>\nThe position’s primary purpose is to perform and interpret pharmacokinetic (PK) and pharmacodynamic (PD) data from preclinical and clinical studies and ensure quality of data. Scientifically contribute to understanding the PK/PD properties of candidate therapeutics in the preclinical and clinical settings. Interface with discovery, preclinical and clinical groups to establish project objectives and ensure they are achieved to support clinical development. The incumbent will collaborate with colleagues within Discovery, Preclinical Development, Clinical Development, Pharm. Sciences, Biometrics, and other departments in a team-oriented environment.\n<br><br>\nPosition Requirements\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Responsible for the scientific/technical aspects of assigned preclinical studies from conception through final report, including protocol development, budget (as appropriate), timelines, sample handling/processing, bioanalysis (through CRO), and PK data analysis/interpretation.</li>\n<li>Responsible for PK and toxicokinetic (TK) sample collection/handling procedures, bioanalysis, and data analyses for PK and toxicology studies.</li>\n<li>Responsible for assessing and recommending doses/regimens for molecules in clinical development in collaborate with clinicians, biostatisticians, and other project team members.</li>\n<li>Responsible for preparing documentation intended for regulatory submissions, including the relevant sections of INDs and NDAs</li>\n</ul>\n\n<strong>SUPERVISORY RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>None</li>\n</ul>\n\n<strong>EDUCATION/EXPERIENCE/SKILLS:</strong>\n<br>\n<strong>Education:</strong>\n\n\n<ul>\n<li>PharmD or PhD in Pharmacokinetics, Pharmaceutical Sciences, Pharmacology, or related discipline</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>Typically requires a minimum of 8 years of direct industry or related experience</li>\n</ul>\n\n<strong> </strong>\n<br>\n<strong>Knowledge/Skills/Abilities:</strong>\n\n\n<ul>\n<li>Experience with PK/PD modelling of preclinical data and clinical data (population PK and exposure-response analysis)</li>\n<li>Hand-on experience with PK/PD software (e.g., Phoenix Winnonlin, Phoenix NLME, S-Adapt, NONMEM, and S-plus/R)</li>\n<li>Experience with SAS and trial simulation software preferred.</li>\n<li>Experience with biologic therapeutics a plus.</li>\n<li>Understanding of bioanalytical guidance and GLP/GxP regulations.</li>\n<li>Ability to work independently.</li>\n<li>Should be able to multi-task and prioritize assignments.</li>\n<li>Able to work well with interdisciplinary teams representing Nonclnical (Clinical Pharmacology and DMPK) effectively on exploratory development project teams.</li>\n</ul>\n\n<strong>JOB COMPLEXITY:</strong>\n\n\n<ul>\n<li>Works on problems of diverse scope where analysis and review of data requires evaluation of identifiable factors. May also work on PK/PD complex issues where analysis of situations or data requires an in-depth evaluation of variable factors.</li>\n<li>Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results.</li>\n<li>Networks with key contacts outside own area of expertise.</li>\n</ul>\n\n<strong>DISCLAIMER</strong>\n<br>\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job.\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</div>\n\n<br>"}