{"job title": "Associate Research Scientist II (Medicinal Chemistry)", "company": "Exelixis", "city state": "– Alameda, CA", "rating": "3.2", "job description": "<div>Position Description\n<br><br>\nSeeking a highly skilled and motivated synthetic chemist to join our medicinal chemistry drug discovery team. The ideal candidate will be experienced in the design and execution of multi-step organic synthesis as well as the purification, analysis and characterization of small molecule target compounds.\n<br><br>\nPosition Requirements\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Design, synthesis, purification and characterization of small molecule lead compounds</li>\n<li>Participation in group, project team and departmental research meetings</li>\n<li>Proper maintenance of laboratory notebooks in accordance with company policies and practices</li>\n<li>Compliance with safe laboratory practices and EH&amp;S guidelines</li>\n<li>Contributes to the writing of technical documents, patents, scientific manuscripts, etc…</li>\n</ul>\n\n<strong>SUPERVISORY RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>None</li>\n</ul>\n\n<strong>EDUCATION/EXPERIENCE/SKILLS:</strong>\n<br>\n<strong>Education:</strong>\n\n\n<ul>\n<li>BS in chemistry with a minimum of 8-10 years of drug discovery experience in the pharmaceutical industry or;</li>\n<li>MS in chemistry or organic/medicinal chemistry with 6-8 years of drug discovery experience in the pharmaceutical industry</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>Designing and executing multi-step synthesis pathways</li>\n<li>Use of chromatographic purification techniques (flash chromatography, preparative HPLC, etc…)</li>\n<li>Use of modern analytical techniques (NMR, LC-MS, etc…)</li>\n</ul>\n\n<strong>Knowledge/Skills/Abilities:</strong>\n\n\n<ul>\n<li>Strong organic and medicinal chemistry bench skills</li>\n<li>Efficient use of scientific literature and chemical/scientific databases</li>\n<li>Good interpersonal skills, flexibility and works well within a team environment</li>\n<li>Excellent written and verbal communication skills</li>\n</ul>\n\n<strong>JOB COMPLEXITY:</strong>\n\n\n<ul>\n<li>Works in a fast-paced/small-team environment that is growing and evolving and which requires regular reprioritization of projects while adhering to timelines and achievement of deliverables.</li>\n<li>Has an in-depth knowledge of the functional area.</li>\n<li>Exercises independent judgment in methods, techniques and evaluation of criteria for obtaining results.</li>\n</ul>\n\n<strong>DISCLAIMER</strong>\n<br>\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job.\n<br><br>\nExelixis is located in Alameda, CA.\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</div>\n\n<br>"}