{"job title": "Senior Scientist I - Tumor Biology", "company": "Exelixis", "city state": "– Alameda, CA", "rating": "3.2", "job description": "<div>Position Description\n<br><br>\nThe senior scientist, tumor biology is responsible for directing cutting-edge oncology research programs that leverage deep insights into cellular and pathway mechanisms to advance programs from concept to clinical proof-of-mechanism; identifying new technologies and advance research programs from discovery to development candidate nomination. This role supports the oncology pipelines by working with group leader on overall research studies, establishing decision-making cascades, aligning on go/no-go milestones, timelines and resourcing required for success.\n<br><br>\nPosition Requirements\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Designs, plans and leads the oncology researches with a deep knowledge of cutting-edge approaches focused on tumor biology for cancer therapy</li>\n<li>Serves as a senior research staffs to provide research guidance and project leadership in identifying, advancing, and supporting the internal and external collaborations in developing therapies as appropriate.</li>\n<li>Develops, evaluates, optimizes and implements new technologies, laboratory protocols, and methodologies for cell-based assays to meet project goals and objectives.</li>\n<li>Keeps up-to-date with relevant scientific advancements, competitive landscape, and new technologies, relevant to the research projects.</li>\n<li>Presents data and reports on project status to department head and at company research meetings. Communicates scientific results to corporate partners and/or collaborators.</li>\n<li>Interacts and collaborates with internal groups and departments to discuss and resolve program and/or department needs.</li>\n<li>Maintains laboratory notebook in a complete, consistent and concise manner in accordance with company intellectual property policies and practices.</li>\n<li>Complies with company health and safety policies and general laboratory practices.</li>\n</ul>\n\n<strong>SUPERVISORY RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Directly supervises employee(s).</li>\n<li>Indirectly supervises employee(s) through a dotted line structure or via other subordinate supervisors.</li>\n<li>Manages activities of two or more sections through subordinate managers who exercise full supervision in terms of costs, methods and employees.</li>\n</ul>\n\n<strong>EDUCATION/EXPERIENCE/KNOWLEDGE:</strong>\n<br>\n<strong>Education:</strong>\n\n\n<ul>\n<li>Ph.D. in biology, Cancer Immunology, or related field with post-doctoral experience and a minimum of 5 years related experience and/or training;</li>\n<li>Or equivalent combination of education and experience.</li>\n</ul>\n\n<strong>EXPERIENCE:</strong>\n\n\n<ul>\n<li>Experience managing projects and/or workgroups in biotechnology or pharmaceutical organizations including experience with budget procedures and management/coaching of employees.</li>\n<li>Established strong publication and track record in the oncology or immuno-oncology drug discovery researches</li>\n<li>Ability to collaborate effectively cross-functionally and in a team setting</li>\n<li>Ability to multi-task in a fast-paced dynamic environment while delivering high quality work</li>\n</ul>\n\n<strong>SPECIFIC KNOWLEDGE:</strong>\n\n\n<ul>\n<li>Experience working with cutting edge of in vitro, ex vivo cell-based assay systems</li>\n<li>Broad understanding of drug discovery and development especially immune oncology therapy</li>\n<li>Experience in human immunology with monocytes, macrophages, or dendritic cells is preferred or cancer immunology with TME remodeling is a plus</li>\n<li>Sets goals with understanding of priority and impact to the program, department and organization.</li>\n<li>Applies advanced scientific and technical principles, theories and concepts. Contributes to the development of new principles and concepts.</li>\n</ul>\n\n<strong>ORAL AND WRITTEN COMMUNICATION:</strong>\n\n\n<ul>\n<li>Ability to read, analyze and interpret common scientific and technical journals, financial reports and legal documents.</li>\n<li>Responds to common inquiries or complaints from customers, regulatory agencies, or members of the business/scientific communities.</li>\n<li>Writes speeches and articles for publication as well as effectively presents information to top management, customers, collaborators and formal groups.</li>\n<li>Excellent interpersonal and written communication skills</li>\n</ul>\n\n<strong>JOB COMPLEXITY:</strong>\n\n\n<ul>\n<li>Works on extremely complex problems where analysis of situations or data requires an evaluation of intangible variables.</li>\n<li>Exercises independent judgment in developing methods, techniques and evaluation criteria for obtaining results.</li>\n<li>Uses professional concepts to contribute to development of company’s concepts and principles and to achieve objectives in creative and effective ways.</li>\n</ul>\n\n<strong>SUPERVISION RECEIVED:</strong>\n\n\n<ul>\n<li>Acts independently to determine methods and procedures on new assignments and may provide guidance and oversee the activities of other lower level personnel</li>\n</ul>\n\n<strong>DISCRETION:</strong>\n\n\n<ul>\n<li>Erroneous decisions or failure to achieve goals may result in additional costs and personnel, and serious delays in overall schedule</li>\n</ul>\n\n<strong>STATUS:</strong>\n\n\n<ul>\n<li>This job is exempt.</li>\n</ul>\n\n<strong>DISCLAIMER</strong>\n<br>\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job.\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</div>\n\n<br>"}