{"job title": "Associate Research Scientist I, High Throughput Screening", "company": "Exelixis", "city state": "– Alameda, CA", "rating": "3.2", "job description": "<div>Position Description\n<br><br>\nThe Associate Research Scientist I, HTS is responsible for assay development, optimization and completion of HTS assays to support the lead validation and lead optimization of our small molecule oncology pipeline.\n<br><br>\nPosition Requirements\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Assist in establishing the HTS lab by testing the laboratory automation equipment to support new assay development and optimization</li>\n<li>Assist in developing, optimizing and performing the HTS assays to support lead validation projects: evaluate preliminary assay hits in primary assay, and develop secondary assays for characterization of compound properties, archive experimental data in ActivityBase, prepares reports documenting the results of HTS campaigns</li>\n<li>Assist in developing, optimizing and performing the follow-up secondary assays to support lead optimization projects: support SAR evaluation, work with project teams to advance the project; provide written protocols, reports and any filing documents</li>\n<li>Design, troubleshoot, perform, and analyze research experiments in microplate format under moderate/close supervision</li>\n<li>May develop new methodologies and laboratory protocols in conducting general research duties within assigned area of responsibility</li>\n<li>Maintain, program, and operate scientific apparatus to perform research experiments</li>\n<li>Prepare and organize data for presentation; present data and reports on project status at individual, group, and departmental research meetings under general supervision</li>\n<li>Use professional concepts and company’s policies and procedures to solve a wide range of difficult problems in imaginative and practical ways</li>\n<li>Maintain familiarity with current scientific literature relevant to the research experiments or program</li>\n<li>Maintain laboratory notebook in a complete, consistent, and concise manner in accordance with company intellectual property policies and practices</li>\n<li>Adherence to good health and safety practices and compliance with applicable EH&amp;S safety rules, and participating in mandatory safety training programs</li>\n</ul>\n\n<strong>QUALIFICATIONS/SKILLS/ABILITIES:</strong>\n<br>\n<strong>Education:</strong>\n\n\n<ul>\n<li>BS in related discipline and 4-8 years of related experience; or,</li>\n<li>MS degree in related discipline and 2-6 years of related experience.</li>\n<li>Or equivalent combination of education and experience.</li>\n</ul>\n\n<strong>Experience:</strong>\n\n\n<ul>\n<li>Experience in an HTS laboratory operating automation equipment (e.g. liquid handlers, dispensers), is highly desirable. Extensive experience in assay development for HTS applications, conducting screening campaigns, led validation, lead optimization is preferred.</li>\n<li>Experience in a variety of kinase, enzymatic and cell-based assays in oncology therapeutics is a plus.</li>\n<li>Excellent data analysis skills and experience with a variety of scientific software applications (e.g. GraphPad Prism, Activity Base, FlowJo) is preferred</li>\n<li>Proficiency with computers including MS Word, MS PowerPoint, and MS Excel is required</li>\n</ul>\n\n<strong>SPECIFIC KNOWLEDGE:</strong>\n\n\n<ul>\n<li>Strong background in automation and experience in an HTS compound Plate Access System is a plus</li>\n<li>Significant knowledge and proficiency in development of HTS assays in biochemistry, enzymology, and cell biology is preferred.</li>\n<li>General understanding of how the individual experiments fit within a larger research program to meet organizational goals</li>\n<li>General understanding and application of scientific principles, theories and concepts in field of specialty and other related disciplines</li>\n<li>Strong communication skills, excellent work ethic, self-motivation, and ability to work effectively in both a team environment and independently</li>\n</ul>\n\n<strong>JOB COMPLEXITY:</strong>\n\n\n<ul>\n<li>Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors.</li>\n<li>Exercises judgment within generally defined practices and policies in selecting methods and techniques for obtaining solutions.</li>\n<li>With guidance, designs, executes, and interprets scientific experiments to drive decisions regarding compound function</li>\n</ul>\n\n<strong>STATUS:</strong>\n\n\n<ul>\n<li>This job is exempt.</li>\n</ul>\n\n<strong>DISCLAIMER</strong>\n<br>\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job.\n<br><br>\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.</div>\n\n<br>"}