{"job title": "Senior Data Architect", "company": "Exeter Finance", "city state": "– Irving, TX", "rating": "3.1", "job description": "At Exeter Finance, we are committed to helping customers find the right financing for their next vehicle purchase. By building strong relationships with our customers and network of dealer partners we are able to give options that make sense, getting customers behind the wheel of their car.\n<br><br>\nEvery team member is integral to our success. Whether you’re at a servicing center helping customers with their loans, in the field building relationships with dealers, or supporting the company from its corporate offices, you'll enjoy a nurturing, invigorating and positive work environment.\n<br><br>\nOur vision is to be a premier finance company and lender of choice known for its People, Performance and Service.\n<br><br>\nDesign and documentation of logical and physical analytical data models for transactional and analytical databases.\n<br><br>\nWorks closely with Data Stewards, Data Governance and developers to create and maintain data dictionary and data lineage. Helps investigate and resolve data anomalies including data quality issues and ambiguous data definitions. Recommends data integrity checks and controls to ensure data quality.\n<br><br>\nObtains new data requirements from the business and business analysts; and coordinates efforts with the developers, dba’s and business analysts. Performs as data SME in guiding both business and IT users of data.\n<br><br>\nSource system analysis, data profiling and creating design documents and Source2Target mappings for the development teams to implement\n<br><br>\nAssists with large-scale data migrations across the enterprise as well as with optimization and scalability efforts.\n<br><br>\nWorks closely with key data consumers (report analysts, data scientists etc.) to understand needs and challenges and come up with strategy and solutions.\n<br><br>\nEnsures compliance with Exeter’s policies &amp; procedures, safety, state and federal laws, regulations and standards.\n<br><br>\nOther duties as assigned.\n<br><br>\nExeter Finance LLC is an Equal Opportunity Employer."}