{"job title": "Senior Data Scientist", "company": "Experian", "city state": "– Indianapolis, Indiana, United States", "rating": "3.6", "job description": "<div><div><div><div><div>Job Description\n<br><br>\nThis role will require you to drive new product innovation by designing and developing innovative, data-driven exploratory analysis as well as predictive and decision models to solve business problems in multiple industries including financial services and telecommunications. Candidate is required to play leadership role in developing new algorithms and/or modifying exiting algorithms to solve complicated business problems. In addition, candidate is required to experiment with different types of algorithms and models, analyzing performance, to identify the best algorithms to employ.\n<br><br>\nKey Responsibilities\n\n\n<ul>\n<li>Leading simultaneously multiple complicated projects.</li>\n<li>Collecting business requirements and mapping complicated business problem into a modeling task.</li>\n<li>Driving innovation in modeling technology and process</li>\n<li>Functioning as the mentor to junior analytic resources on the team</li>\n<li>Plan effectively to set priorities and manage projects, identify roadblocks and work to get them removed, and understand the importance of meeting client/internal deadlines.</li>\n<li>Reviewing project variances against deliverables and possible changes; implement changes at project level as needed; negotiate necessary changes without committing to the impossible, and engage in direct dialogue with client to achieve agreement on project outcomes.</li>\n<li>Delivering superior customer service to internal and external clients.</li>\n<li>Communicating directly with clients as needed.</li>\n<li>Participating in pre-sales support and/or provide post-implementation support.</li>\n<li>Delivering formal presentations of work to clients.</li>\n<li>Participating in authoring white papers, proposals and publications.<br>\n<div>Job Requirements and Qualifications\n<br><br>\n• Minimum 10 years experience with an analytic solutions or consulting company, bank or financial institution for candidates with Master’s degree or Doctoral degree</div></li>\n<li>Expertise in a wide variety of industry and business areas, including credit risk management processes, organization and risk policies. Specific experience in credit loss forecasting would be advantageous</li>\n<li>Proven track record in driving new product development from concept to final delivery</li>\n<li>Strong capability of developing new algorithms and/or modifying existing algorithms to solve challenging business problems with significant business impact.</li>\n<li>Demonstrated ability to manage multiple simultaneous projects of significant complexity; adjust to changes in priorities easily, moving from one type of task to another effectively at short notice.</li>\n<li>Experience analyzing large data set in order to draw conclusions about data integrity, accuracy, and general relationships.</li>\n<li>Proven ability to anticipate, investigate and analyze database and data processing problems to pinpoint cause of problems and recommend possible solutions.</li>\n<li>Must be able to work under tight deadlines and changing priorities.</li>\n<li>Must exhibit effective communication skills at all levels of the organization (internally and externally).</li>\n<li>Verified ability to work both collaboratively and independently</li>\n<li>Strong knowledge of MS Office, SAS, R, SQL or other similar languages preferred\n<br><br>\nExperian is an Equal Opportunity Employer. Anyone needing accommodation to complete the interview process should notify the talent acquisition partner. The word \"Experian\" is a registered trademark in the EU and other countries and is owned by Experian Ltd. and/or its associated companies.\n<br><br>\nEOE including Disability/Veterans</li></ul></div>\n\n\n\n</div>\n</div>\n </div>\n </div>\n\n<br>"}