{"job title": "Senior Big Data Engineer", "company": "Experian", "city state": "– Costa Mesa, California, United States", "rating": "3.6", "job description": "<div><div><div><div><div><b>Responsibilities:</b><br><ul><li>Define technical scope and objectives through research and participation in requirements-gathering and definition of processes</li><li>Ingest and Process data from various sources in raw, structured, semi-structured, and unstructured format into Big Data ecosystem </li><li>Real time data feed processing using Big Data ecosystem</li><li>Design, review, implement and optimize data transformation processes in Big Data ecosystem</li><li>Test and prototype new data integration tools, techniques and methodologies</li><li>Participate in overall test planning for the application integrations, functional areas and projects</li><li>Work with cross functional teams in an Agile/Scrum environment to ensure a quality product is delivered</li></ul>\n \n \n\n \n \n \n \n \n <div>\n <b>Education and Technical Skills:</b><div><ul><li>Technically focused Bachelor’s degree in Computer Science, Engineering, Math, etc.</li><li>Master Degree is a plus</li><li>8-10 years of hands-on experience with enterprise scale applications and systems</li><li>5+ Year of expertise in Big Data technologies in Hadoop ecosystem</li><ul><li>Hive, HDFS, MapReduce, Yarn, Kafka, Pig, Oozie, HBase, Sqoop, Spark, etc.</li><li>Hadoop distributions like Cloudera (preferred)</li></ul><li>Extensive development experience in Java specifically in Spring Framework and related technologies (Springboot, SpringData, SpringCloud, SpringSecurity etc.)</li><li>Experience with Scala is highly desirable</li><li>Strong understanding of data analytics and data visualization</li><li>Experience with Python and Ruby is a plus</li><li>Excellent analytical and problem solving skills</li><li>Excellent one-on-one communication and presentation skills, specifically able to convey technical information in a clear and unambiguous manner</li><li>Working knowledge of Linux operating system</li></ul><div><div><b>Benefits:</b><br><div><b><br></b>Working for a leading FTSE 50 global information services company is just one of the rewards of joining Experian. Our benefits package is designed to reward contribution and loyalty and to attract the kind of talented individuals who have their pick of employers. That is why we offer a highly competitive package which comprises:</div><div><ul><li>Competitive base salary</li><li>Aggressive bonus plan</li><li>Core benefits including: full medical, dental, vision, matching 401K and the opportunity to work with a global leader</li></ul></div><div><b>Experian is listed on the London Stock Exchange (EXPN) and is a constituent of the FTSE 100 Index. Total revenue for the year ended March 31, 2017 was $4.3 billion. Experian employs approximately 17,000 people in over 40 countries.</b></div><div><br>Experian is an Equal Opportunity Employer. Anyone needing accommodation to complete the interview process should notify the talent acquisition partner. The word \"Experian\" is a registered trademark in the EU and other countries and is owned by Experian Ltd. and/or its associated companies.</div></div></div></div>\n </div>\n \n \n \n \n\n <div>\n \n \n\n \n \n \n\n \n \n \n \n \n \n \n </div>\n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}