{"job title": "Data Scientist I", "company": "Expedia", "city state": "– USA - Washington - Bellevue", "rating": "3.8", "job description": "Expedia<br><br>Who we are\n<br><br>\neCP – Expedia eCommerce Platform. The eCP organization was built to power the Expedia, Inc.’s travel revolution with a premier platform of eCommerce technologies and services operating at global scale. We bring product, technology, and operations together to enable our business to grow and drive innovation.\n<br><br>\nPI – Platform Intelligence. Within eCP, PI is a new team set to deliver Artificial Intelligence (AI) Platform, advanced automation and AI solutions. We work in start-up fashion, think deep, and code fast. We innovate incrementally, yet relentlessly. PI collaborates with many teams to automate and build intelligence into our travel platforms, through Standards, Open Source, and expandable technology solutions. Our goal is to improve eCommerce platform availability, and provide the best travel experience through using AI/ML.\n<br><br>\nJob description\n<br><br>\nAre you passionate about the technology needed to drive a multi-billion dollar business? Do you love building creative, highly-scalable and expansible AI frameworks and solutions? Is working on the next gen intelligent travel platforms to revolutionize the travel experience using AI/ML challenging and attractive to you?\n<br><br>\nAs a Data Scientist within PI, you will work with a dynamic teams of product managers and engineers across multiple organizations to deliver sophisticated, next-gen AI Machine Learning solutions. Your vigorous STEM training and problem-solving skills are particularly important for this job function. You will contribute and make our young team become the industry-leading center of excellence for eCommerce AI and Automation.\n<br><br>\nTogether, we will forge our culture, based on respect, inclusion, and transparency, and we will achieve technical excellence in support of our business.\n<br><br>\nResponsibilities\n<ul>\n<li>You will apply solid coding skills, strong analytical and innovative thinking, AI/ML experience, quickly learn and turn new ideas into working solutions, drive proof of concepts and pilots to accelerate the on boarding of new technologies and solutions.</li><li>You will partner with multi-teams for end-to-end transactions, booking, payment, security, operation, data services engineering teams to implement platform intelligence; provide the smart experience for our global travelers; and AI powered supply/demand engine.</li><li>You will grow professionally; expand your skills and curiosity; be creative; also help others become their best.</li>\n</ul>\nSkills/requirements\n<ul>\n<li>Ph.D. in Computer Science or a related quantitative science and engineering fields, such as Artificial Intelligence, Computer Engineering, Mathematics, Operation Research, Statistics, Electrical Engineering, Engineering Science, System Engineering, Physics, Bioengineering and Biomedical Science.</li><li>Understand the concepts and steps involved when working real world big data, from domain specific problem understanding, data preparation, travel related data processing, data integration, data structures for machine learning, data pipelining, data modeling, and AI/ML algorithms; strong software engineering and data science knowledge and skills.</li><li>Strong knowledge and experience in database technologies, including SQL and other relational database, non-SQL, and Time Series database.</li><li>Knowledge on hands on practice in Java, Python, R, XML/JSON.</li><li>Solid knowledge and practice in Deep Learning with various Neural Networks approaches, applied to areas of NLP, Computer Vision, prediction, and optimization.</li><li>Solid knowledge of Machine Learning techniques such as Bayesian methods, clustering, decision trees, random forests, NLP, etc., excellent grasp of statistical concepts and methods.</li><li>Understanding of distributed file systems, scalable datastores, distributed computing and related technologies (Spark, Hadoop, etc.); implementation experience of MapReduce techniques, in-memory data processing, etc.</li><li>Passion in solving problems and finding patterns and insights within structured and unstructured data.</li>\n</ul>\nPluses\n<ul>\n<li>Good industrial internship or academic experience in Data Science.</li>\n</ul>\n*LI-PP1<br><br>Expedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}