{"job title": "Data Scientist", "company": "Experian", "city state": "– San Diego, California, United States", "rating": "3.7", "job description": "<div><div><div><div><div>Experian DataLabs is a R&amp;D unit at Experian formed with the desire to work in collaboration with Experian’s business units to enhance relationships with clients and acquire strategic datasets. Experian® is a global leader in providing information, analytical tools and marketing services to organizations and consumers to help manage the risk and reward of commercial and financial decisions. Using our comprehensive understanding of individuals, markets and economies, we help organizations find, develop and manage customer relationships to make their businesses more profitable.\n<br><br>\nPosition Summary:<div>\nThe person filling this position will be part of Experian North America R&amp;D Data Lab concentrating on research and development of novel analytical solutions, new product prototyping, as well as new data asset evaluation and acquisition. This position requires extensive background and knowledge in machine learning and data mining. Previous experience in analyzing large datasets and developing data driven statistical models is desirable. Experience in text mining and online marketing is a plus.</div> <div>\nThe candidate will need to be able to work on multiple concurrent projects, anticipate obstacles, and make high quality deliveries on an aggressive schedule. The candidate must also be a team player that is self-motivated and has excellent communication skills.\n<br><br>\n<strong>Key job functions include:</strong>\n\n<ul>\n<li>Analyzing, processing, evaluating and documenting large data sets</li><li>Identify/develop appropriate machine learning/data mining/text mining techniques to uncover the value of the data</li><li>Designing data structure and data storage schemes for efficient data manipulation and information retrieval</li><li>Developing tools for data processing and information retrieval</li><li>Developing data driven models to quantify the value of a given data set</li><li>Applying, modifying and inventing algorithms to solve challenging business problems</li> <li>Validating score performance</li> <li>Conducting ROI and benefit analysis</li> <li>Documenting and presenting model process and model performance</li></ul></div><br>\n\n<div>\n\n<ul>\n<li>Advanced degree in Machine Learning, Computer Science, Electrical Engineering, Physics, Statistics, Applied Math or other quantitative fields</li><li>0-3 years of working experience in analytics, data mining, and/or predictive modeling</li><li>Demonstrated ability to lead and execute projects from start to finish</li><li>Ability to independently support existing products</li><li>Proven track record in modifying and applying advanced algorithms to address practical problems</li> <li>Experience with regression, Neural Network, SVM, and/or ensemble methods</li><li>Proven ability to work independently on development of complex models with extremely large and complex data structures</li> <li>Proficient in more than one of Python, R, Java, C++, or C</li><li>Robust knowledge and experience with statistical methods</li><li>Plusses:</li>\n\n<ul>\n<li>Extensive knowledge of MATLAB and SQL</li><li>Experience with Hadoop and NoSQL related technologies such as Map Reduce, Spark, Hive, Pig, HBase, mongoDB, Cassandra, etc.</li><li>Experience with online, mobile marketing analytics</li><li>Experience with GPU programming</li><li>Knowledge of NLP/Text mining techniques and related open source tools</li> <li>Solid knowledge of Bayesian statistical inference and related machine learning methods.</li><li>Experience with Agile methods for software development</li></ul>\n</ul>\n\n<div><strong>EOE\n<br>\nincluding Disability/Veterans</strong></div></div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}