{"job title": "Data Scientist / Cognitive Computing", "company": "Experis", "city state": "– San Jose, Ca, CA", "rating": "3.3", "job description": "Required skills (maximum of 6): Build and evaluate predictive and decision models to be deployed in production systems, or for research Analysis of large amounts of historical data, determining suitability for modeling, data clean-up and filtering, pattern identification and variable creation, selection of sampling criteria, generating performance definitions and variables Conducting experiments with different types of algorithms and models, analyzing performance, to identify the best algorithms to employ. Architect and develop operational models that run at scale thru partnership with data engineer teams Masters degree or higher in statistics/Math/Computer Science or related field Background in applied statistical modeling on large experimental or observational data sets.\n<br><br>\nNice to have skills (maximum of 3): Build and evaluate predictive and decision models to be deployed in production systems, or for research Analysis of large amounts of historical data, determining suitability for modeling, data clean-up and filtering, pattern identification and variable creation, selection of sampling criteria, generating performance definitions and variables Conducting experiments with different types of algorithms and models, analyzing performance, to identify the best algorithms to employ. Architect and develop operational models that run at scale thru partnership with data engineer teams Masters degree or higher in statistics/Math/Computer Science or related field Background in applied statistical modeling on large experimental or observational data sets. Sector: Financial Services Industry: Banking Work location type: Other Work location country/territory: United States Work location state/province: California Work location city: San Jose Work location street address: Client location Work location comments: Work remotely: No Pay travel and lodging: No Rate Cap N/A USD Mandatory Skill : IBM Bluemix Essentials Badge\n<br><br>\nExperis is an Equal Opportunity Employer (EOE/AA) - provided by Dice\n<br><br>\nData scientist, data analyst"}