{"job title": "Scientist", "company": "Exponent", "city state": "– Bellevue, WA", "rating": "3.2", "job description": "<div><div> <p><b>Exponent</b> is a leading engineering and scientific consulting firm. Our multidisciplinary team of scientists, engineers, physicians, and regulatory consultants brings together more than 90 different disciplines to solve complicated problems facing corporations, insurers, government entities, associations and individuals. Our approximately 900 staff members work in 26 offices across the United States and abroad. Exponent has over 700 consultants, including more than 425 that have earned a doctorate in their chosen field of specialization.<br>\n<br>\nExponent's <b>Human Factors</b> Practice is seeking a Scientist for our Bellevue, WA office. The individual in this position will be responsible for analyzing human performance in a variety of settings (e.g., sports, vehicle operation, occupational work, and consumer products), and will apply their expertise in human factors to the analysis of accidents and injuries. Additional responsibilities will include: managing a range of consulting activities that involve human factors in accidents and their prevention, including limitations of human perceptual, cognitive, and response capabilities; developing client contacts; working on multi-disciplinary projects; providing case management, data processing, and other project support; conducting research to obtain and review technical data, scientific literature, and standards; and participating in the design and evaluation of warnings and safety information.<br>\n<br>\nQualifications for this position include:</p>\n\n<ul>\n<li>\n<p>Ph.D. in Cognitive or Experimental Psychology, or Neuroscience</p>\n</li>\n<li>\n<p>Excellent written and verbal communication skills as well as strong interpersonal skills</p>\n</li>\n<li>\n<p>Proficient with Word, Excel, and PowerPoint</p>\n</li>\n<li>\n<p>Must be assertive, a self-starter, and able to work with accuracy under pressure and/or deadlines</p>\n</li>\n<li>\n<p>Willingness to expand present knowledge a plus</p>\n</li>\n<li>\n<p>Strong mathematical aptitude required</p>\n</li>\n</ul>\n\n<p>We are an Affirmative Action, Equal Employment Opportunity, Veterans and Disabled Employer.</p> </div></div><div><div> <br></div></div>"}