{"job title": "Associate Data Scientist", "company": "ExtraHop Networks, Inc.", "city state": "– Seattle, WA, United States", "rating": "4.1", "job description": "The ExtraHop platform is a novel approach to processing vast amounts of wire data in real-time. Want to join a collaborative team that builds solutions which provide deep performance insights, behavioral security analyses, and drive business analytics? Keep reading.<br><br>Do you like open source tools? Do you like assembling arrays of the latest and greatest technologies in networking/security and performance bench marking to solve difficult problems? Do you like to push systems to their limits to improve their quality? We are looking for people who have passion and expertise in these areas and want to aid our development effort to build one of the most performance and secure systems in the industry.\n<br><br>\n<strong>Duties &amp; Responsibilities</strong>\n<ul>\n<li>Work closely with engineers throughout the development cycle to reproduce the small and large customer environments under which the ExtraHop system is run.</li><li>Employ a mix of manual and automated data analysis techniques to collect data and analyze the operational environment of the ExtraHop system.</li><li>Generate gigabits of network traffic on over-the-counter Intel hardware with OSS systems and networking tools for performance benchmarking of the ExtraHop system.</li><li>Install, run, and benchmark emerging products and tools in a lab environment to provide product development and product management strategic data.</li>\n</ul>\n<strong>Required Skills &amp; Experience</strong>\n<ul>\n<li>Bachelors degree or equivalent experience in computer science, engineering, or information technology</li><li>Experience in a Unix-based environment</li><li>Solid knowledge of Linux toolchain, Python, JavaScript, and shell scripting</li><li>Knowledge of building scalable and high-performance systems</li><li>Understanding of various product-development life cycles</li>\n</ul>\n<strong>Desired Skills</strong> <strong>&amp; Experience</strong>\n<ul>\n<li>Solid understanding of the OSI model and excellent working knowledge of the key protocols from Layer 2 through Layer 7 including ARP, IP, TCP, UDP, and HTTP</li><li>TCP/IP networking.</li><li>Experience using Linux networking tools such as tcpdump, tcpreplay, pcap tools, apache bench, etc.</li><li>Experience using and managing virtual infrastructure for VMware, Hyper-V, Xen, and KVM. Experience with OpenStack and related SDN framework a plus.</li><li>Familiarity with embedded systems or other syste-ms-level development.</li> <li>Experience standing up systems using Linux containers, Docker, Puppet, Chef, etc</li>\n</ul>\n\nAbout ExtraHop<br><br><strong>At ExtraHop, we create great products because we give talented employees the freedom to be intellectually curious and creative.</strong> We seek a diversity of perspectives and foster employee quirkiness and spunk to help drive innovation. Every ExtraHop employee knows that were all in this together and that work is an important part of life so it should be fun. A sense of humor is required here, seriously!\n<br><br>\nWe are <strong>the global leader in real-time wire data analytics</strong>, a novel approach to IT Operational Analytics. Our market opportunity is greater than $15B and our solutions span all industries. Pretty neat, huh? If you want to join a fun team that produces award-winning products that provide tremendous business value and delight customers, then ExtraHop is the company for you!\n<br><br>\n<strong>Founded by engineers, ExtraHop is a Seattle-based technology company that delivers elegant solutions for the tech industrys most challenging problems.</strong>\n<br><br>\nAs a privately held fast-growing technology leader in the $20B IT operations management space, ExtraHop Networks is positioned to be the next great systems company. We are known as innovators who take a smart, creative approach to solving problems. Our ExtraHop team and product line have received many awards, including wins in multiple categories of <strong>Best of Interop</strong>, a Gold Medal prize in Puget Sound Business Journals annual list of <strong>Washingtons Best Workplaces</strong>, and several Gold <strong>Stevie American Business Awards</strong>.\n<br><br>\nExtraHop is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, disability, military status, or national origin or any other characteristic protected under federal, state, or applicable local law."}