{"job title": "Senior Data Scientist", "company": "FabFitFun", "city state": "– Los Angeles, CA", "rating": "4.0", "job description": "FabFitFun is seeking a Senior Data Scientist to help build data into every part of the business. In this role, you will use machine learning and statistical models to analyze and solve problems, as well as clean and explore data, test and deploy data services, and tune and optimize existing algorithms. Our ideal candidate will be up to date with modern data science techniques and have experience with subscription business models.\n<br><br>\n<strong>What you'll do:</strong>\n\n<ul>\n<li>Develop statistical models of customer, product, and operations data that will be used for decision-making throughout the company. Current applications include product recommendation, customer segmentation, retention and lifetime value prediction, and more</li>\n<li>Build clear visualizations to convey complex ideas and analyses to executives and business unit leaders</li>\n<li>Perform deep and continuous exploration of high-volume data</li>\n<li>Combine and analyze data from multiple data sources (transactions, surveys, web and mobile events) to build holistic models of our members and products</li>\n<li>Own analytics projects from start to delivery (business requirements, data exploration, model development, deploying models, and maintaining models and data services)</li>\n<li>Help lead and manage best practices on a fast-growing and high-profile team</li>\n</ul>\n<strong>What you'll bring:</strong>\n\n<ul>\n<li>Master's degree (Ph.D. preferred) in statistics, computer science, mathematics, data science, or other quantitative science (psychology, economics, physics, etc.)</li>\n<li>3+ years of relevant work experience in statistics, data science, or machine learning (or Ph.D. in a quantitative field)</li> \n\n<li>Proven ability to tackle business or research problems with data science solutions</li>\n<li>Knowledge of machine learning algorithms (clustering, regression, classification, optimization) and statistical inference</li>\n<li>Experience with: \n\n\n<ul>\n<li>Data manipulation, statistical modeling, and data visualization in Python, R, or both</li>\n<li>Building interactive visualizations with visualization platforms (Looker, Tableau, Shiny, etc.)</li>\n<li>SQL databases and consumer data</li>\n</ul>\n\n</li>\n<li><strong>Bonus points if you have any experience with either recommender systems, natural language processing (NLP), constrained optimization, or hierarchical Bayesian modeling</strong></li>\n</ul>\n<strong>What you'll get:</strong>\n\n<ul>\n<li>Opportunity to work on rich data sets with direct business impact</li>\n<li>A modern data science platform with full ownership over deploying and optimizing models</li>\n<li>Full support from dedicated data engineering and business intelligence teams</li>\n<li>Ability to take the lead on major projects in areas like product recommendation, customer segmentation, lifetime value prediction</li>\n<li>Amazing benefits including medical, dental, vision, FSA, and 401k</li>\n<li>Unlimited PTO</li>\n<li>Catered meals, kitchen stocked with great snacks and drinks</li>\n<li>Free FabFitFun subscription and and quarterly credit in the Add-Ons store</li>\n</ul>"}