{"job title": "Data Scientist, Analytics, Intern", "company": "Facebook", "city state": "– Menlo Park, California", "rating": "4.5", "job description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.Are you passionate about Facebooks product, analytics and technology? The Analytics team is looking for fast-moving analytics candidates and data junkies who want to make an impact. Candidates will help own analytics for a particular product or business at Facebook and work with product managers and engineers to translate the analysis into meaningful impact to the business. Please note that candidates will have a general interview and then we will make a determination of actual team assignments.\n<br><br>\n<strong>Responsibilities:\n<br>\n</strong>\n\n<ul>\n<li>Mine massive amounts and perform large-scale data analysis to extract useful business insights</li><li>Design and implement reporting dashboards that track key business metrics and provide actionable insights</li><li>Identify actionable insights, suggest recommendations and influence the direction of the business by effectively communicating results to cross functional groups</li><li>Work closely with a Product Manager and Engineering team to proactively create rule and manage decisions</li><li>Backend software engineering to build scalable solutions and help automate data processing challenges</li><li>Prioritize leads so that the teams work on the most valuable cases</li><li>Suggest improvements in the tools and techniques to help scale the team</li>\n</ul>\n\n<strong>Mininum Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Pursuing a BS, MS or PhD degree in Computer Science, Applied Mathematics, Statistics, Operations Research, or related technical field from an academic institution</li><li>Experience in solving analytical problems using quantitative approaches (or equivalent)</li><li>Experience with SQL or other programming languages (Python, Java, and/or C++)</li><li>Development experience in at least one scripting language (PHP, Perl, Python, etc.)</li>\n</ul>\n\n<strong>Preferred Qualifications:\n<br>\n</strong>\n\n<ul>\n<li>Experience with statistical analysis, experience with packages such as R, MATLAB, Excel, etc. preferred</li>\n</ul>"}