{"job title": "Junior Data Scientist", "company": "Fama (CA)", "city state": "– Playa Vista, California", "rating": "5.0", "job description": "<div>WHO WE ARE AS A COMPANY<br><br>Fama is an AI based solution that helps companies limit the incidence of sexual harassment in the workplace, and similar, crippling issues such as abusive behavior and insider threats. We do this by applying machine learning to publicly available online information and internal HR data.\n<br><br>\nWe help companies align their teams around the mission and values of the organization itself. We have seen first-hand how sexual harassment, abusive behavior, and insider threats can create a toxic workplace and damage the bottom line. We can solve this by applying AI to massive, unstructured data sets. Our mission is to create a more productive, safer, welcoming workplace while ensuring that businesses are not exposed to unnecessary brand and people risks.\n<br><br>\nFama's cloud-based software solutions are deployed globally, with enterprise customers in the Americas, EMEA and Asia. We are a venture backed startup in high-growth mode and are headquartered in Playa Vista, CA.<br><br>WHO WE ARE AS A TEAM<br><br>At Fama, we are a team of doers. We’ve adopted a “One Fama” mentality, emphasizing our strong belief in our company’s mission and values, and our commitment to eliminating paralyzing company risks that ultimately create toxic work environments for all parties involved. We firmly believe that any challenge is possible given the right mindset and resources. We also respect the power of technology and carefully consider the impact of our decisions. As a team, we value candor, empathy and communication which allows for a fast-paced and open working environment in which opinions are quickly voiced and mistakes are openly discussed without judgement.<br><br>What you'll need to be successful<br><br>We are looking for an exceptional individual to join our team as a Junior Data Scientist. This team member is excited about getting their hands on all aspects of ML and data science within our company and has an eagerness to contribute to our groundbreaking AI-based product.\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>Undergraduate degree in Data Science or another quantitative field OR data/computer science bootcamp along with personal DS experience</li><li>Some background in software development(java, angular)</li><li>Work experience with Python and/or R</li><li>Experience with Agile, TDD, and VCS (we use git)</li><li>Independent personal projects</li>\n</ul>\n<strong>Big plus if you have experience with:</strong>\n<ul>\n<li>Scala</li><li>Spark</li><li>Kafka</li><li>Deep learning</li>\n</ul>\nThe ideal candidate would have development experience and is looking to jumpstart their career in data science.<br><br>Perks\n\n<ul>\n<li>Competitive salary and equity packages.</li> <li>Best-in-class benefits, including medical, vision, dental.</li> <li>Free, yummy food. Think Intelligentsia coffee. Regularly stocked fridge and pantry featuring our employee's favorites snacks and daily meal staples as well as weekly catered meals</li><li>Unlimited Education. We offer our employees an unlimited spend on resources - be they books, bootcamps, or classes - to help improve our professional selves.</li> \n</ul>\n\nVisa Sponsorship\n\n<ul>\n<li>Available</li></ul></div>\n<br>"}