{"job title": "Sr. Customer Data Analyst", "company": "Farmer Insurance", "city state": "– Woodland Hills, California", "rating": "3.9", "job description": "Sr. Customer Data Analyst\n\n\n<ul>\n<li>*****M2</li>\n</ul>\n\nWe are Farmers!\n<br><br>\nJoin a team of diverse professionals at Farmers to acquire skills on the job and apply your learned knowledge to future roles at Farmers. Farmers Insurance also offers extensive training opportunities through the award winning University of Farmers named by Training magazine amongst top 10 corporate training units in the world. Start your career at Farmers today!\n<br><br>\nThis is an exciting time to join the Data Team in the Farmers CDO (Chief Data Officer) Organization, where we work on high-profile and high-impact cross-functional projects that are very rewarding. The ideal candidate will serve as a Senior Data Analyst for our various Customer Data Assets, helping the deployment and use of new data-driven capabilities that support our enterprise strategy.\n<br><br>\nConsider joining our team if you are passionate about Data, enjoy problem solving, and working with like-minded IT and business professionals.\n<br><br>\nEssential Job Functions\n\n\n<ul>\n<li>Analyze and interpret Customer insights from multiple data sources using statistical techniques.</li>\n<li>Support the deployment and business activation of new Customer data assets to drive operational efficiencies, improve customer experience, and drive growth.</li>\n<li>Combine data from structured &amp; unstructured sources to discover and interpret new trends/patterns.</li>\n<li>Compare and contrast data across trusted sources to surface potential data quality issues.</li>\n<li>Liaise, collaborate, and support cross-functional stakeholders with their customer data needs.</li>\n<li>Propose data-driven solutions and strategies to business challenges.</li>\n<li>Present information using data visualization techniques.</li>\n<li>Support experimentation and deployment of predictive models that leverage customer data.</li>\n<li>Identify process improvement and efficiency opportunities.</li>\n</ul>\n\nEducation Requirements: BS/BA in Computer Science, Mathematics, Statistics, Engineering or equivalent field.\n<br><br>\nExperience Requirements\n\n\n<ul>\n<li>Recent 3-4 years of hands-on experience in a Data Analyst / Data Scientist role.</li>\n<li>Recent 3-4 years of hands-on experience performing advanced data analysis using Python.</li>\n<li>Experience independently leading analysis from concept to final outcome.</li>\n<li>Experience facilitating in-person and remote meetings and working sessions.</li>\n<li>BS/BA in Computer Science, Mathematics, Statistics, Engineering or equivalent field.</li>\n<li>Technical expertise with data models, database design, data access, data mining, and data segmentation techniques.</li>\n<li>Advanced level knowledge and experience using Python in a Hadoop (HBase, Hive) environment.</li>\n<li>Advanced level experience using statistical packages for analyzing datasets &amp; interpreting results.</li>\n<li>Strong analytical skills with the ability to combine, organize, and analyze large amounts of data and to tease-out and disseminate key information with attention to detail and accuracy.</li>\n<li>Analytical problem solver with strong business acumen.</li>\n<li>Ability to effectively and independently manage competing priorities.</li>\n<li>Excellent communication and presentation skills.</li>\n</ul>\n\nSpecial Skill Requirement\n\n\n<ul>\n<li>Good written and oral skills in local language.</li>\n<li>Graduate degree in Data Science or other quantitative field, preferred.</li>\n<li>Experience with P &amp; C insurance and/or customer data. preferred.</li>\n<li>Experience with data mining and/or machine learning (ML), preferred.</li>\n<li>Experience with SQL, Tableau, Alteryx, preferred.</li>\n<li>Experience developing Big Data capability job-aids for technical / non-technical end users, preferred.</li>\n</ul>\n\nFarmers is an equal opportunity employer, committed to the strength of a diverse workforce.\n<br><br>\nUnited States-California-Woodland Hills\n<br><br>\nFarmers Insurance\n<br><br>\nPredictive Analytics/Modeling\n<br><br>\nFull-time\n<br><br>\n<strong>11/16/18</strong>"}