{"job title": "Data Scientist", "company": "Farmer's Business Network, Inc.", "city state": "– San Carlos, CA", "rating": "3.7", "job description": "<strong>THE COMPANY</strong>\n<br><br>\nWhat do you get when you cross the best of Silicon Valley innovation with the agriculture economy? Farmers Business Network, Inc.!\n<br><br>\nWe are proudly Farmers First . Created by farmers, for farmers, Farmers Business Network (FBN ) is an independent and unbiased farmer-to-farmer network of thousands of American farms. By enabling thousands of farmers to work together, anonymously and securely to democratize information, the FBN network is helping farmers level the playing field and put power back in farmers hands.\n<br><br>\nFarmers Business Network counts top VCs including Google Ventures, Kleiner Perkins, DBL Partners, and Acre Venture Partners, T Rowe Price and Temasek among its investors. We are a dynamic, and innovative company in AgTech that offers competitive compensation and benefits.\n<br><br>\n<strong>THE ROLE</strong>\n<br><br>\nHow can we sustainably feed the world? With the population set to reach nine billion by 2050 and available farmland decreasing, the odds are stacked against us. This problem falls squarely on the shoulders of farmers, who are increasingly working harder for less. FBN helps farmers to solve these problems.\n<br><br>\nFarmers are often forced to make key decisions in the face of significant uncertainty about their impact. FBN applies technology and data science to this challenge. We're building the world's largest agronomic dataset - made up of billions of datapoints, gathered from sophisticated sensors on farm equipment. The network effect of farmers sharing their data allows us to deliver unprecedented analyses that help farmers make data-driven decisions - we're not just building new technology, we're also making new agricultural scientific discoveries.\n<br><br>\nWe're looking for data scientists who are enthusiastic about applying big data to help farmers!\n<br><br>\nData science underlies every product that we build at FBN, so you'll see your work directly translate into new products for our farmers. The data science team at FBN:\n\n<ul>\n<li>Explores one of the world's most unique, interesting, and diverse datasets.</li>\n<li>Furthers scientific understanding about what affects agricultural production.</li>\n<li>Uncovers insights that help farmers efficiently support a growing population.</li>\n<li>Makes meaningful improvements in the world by translating data science into products that help farmers increase yield and efficiency.</li>\n</ul>\nRequired Skills\n\n<ul>\n<li>Deep understanding of statistical modeling concepts.</li> \n\n<li>Familiarity with machine learning algorithms.</li> \n\n<li>Excellent programming skills (R or Python preferred).</li>\n<li>Preferred: understanding of agricultural systems (soil chemistry, plant physiology, entomology, etc).</li> \n</ul>\n<strong></strong>Required Experience\n\n<ul>\n<li>MS or greater in statistics or related discipline, OR MS or greater in agronomy or related discipline with strong data analysis skills.</li>\n</ul>\nFarmers Business Network, Inc. is an equal opportunity employer and participates in U.S. Citizenship and Immigrations E-Verify program."}