{"job title": "Data Scientist", "company": "Farm Credit ", "city state": "– Fargo, North Dakota", "rating": "3.6", "job description": "<strong>PRIMARY JOB DUTIES</strong>\n<ul>\n<li>Develop data structures to support the generation of business insights and strategy.</li>\n<li>Organize and analyze large, diverse and imperfect data sets using association reporting and analysis tools; interpret raw data sets, perform statistical analysis, and share results through a variety of reports, dashboards, and other data visualization tools.</li> \n\n<li>Translate data findings into actionable recommendations and improvements.</li>\n<li>Continuously evaluate industry trends for opportunities to utilize new technologies and data sources, and recommend strategies to implement these enhancements in the data environment.</li>\n<li>Data governance and Data Stewardship- work to design and maintain programs that support the Association’s data quality, lineage and certification</li>\n<li>Work with other departments to fully utilize Predictive Analytics to design, develop and run statistical analyses to enhance and support stress testing, portfolio management and risk management.</li>\n<li>Interact and proactively communicate with Business Intelligence team and data owners regarding data quality issues and to generate new ideas for data management and analysis.</li>\n<li>Provide feedback to further refine internal processes and advance company’s Business Intelligence discipline.</li>\n</ul>\n<strong>REQUIRED KNOWLEDGE &amp; EXPERIENCE</strong>\n<ul>\n<li>Bachelor’s degree in Computer Science, Information Systems, Mathematics, Statistics, or related field.</li>\n<li>6+ years' experience with complex data architecture and data management assignments, including data analysis and design, master data management, database administration, data security management, data mining and statistical analysis, metadata management, data warehousing, business intelligence, and data quality improvement.</li> \n\n<li>Knowledge of data management/data transformation and data architecture functions, including physical database design, data migration, and relational database management system; data modeling, and metadata management, tools, and processes.</li>\n<li>Ability to effectively take data and develop conclusions that are easily understood and actionable.</li>\n<li>Ability to bring others along and change minds in ways that are positive and supportive.</li>\n<li>Effective verbal and written communication skills.</li>\n<li>Ability to organize work and prioritize in order to balance competing demands for time and attention.</li>\n<li> Knowledge of Microsoft BI Platform (SSIS, SSAS, SSRS, Power BI), Crystal Reports, SQL Server and R statistical software</li>\n</ul>"}