{"job title": "Data Scientist /Engineer in Bloomfield, CT at Fast Switch", "company": "Fast Switch", "city state": "– Bloomfield, CT", "rating": "4.1", "job description": "<div>\n <div>\n Job Description\n <b>Job ID: 50061 </b><br><br><p>Data Scientist /Engineer&nbsp;<br><br>Position Description&nbsp;<br>Our client&nbsp;is looking for a Data Scientist/Engineer to join the team in Bloomfield, CT. or Lafayette, LA.&nbsp;<br><br>You’ll be a part of the team that supports the organization by embedding deep analytic insights into key decision processes and focusing on the biggest, most complex problems. We are looking for team players with excellent analytic and technical skills and insatiable curiosity about data to support our Data Quality and Data Management efforts in the Big Data space.&nbsp;<br><br>Your future duties and responsibilities&nbsp;<br>• Support the development and maintenance of the Enterprise Data Management Framework and data metrics, with a focus on Metadata Management.&nbsp;<br><br>• Use modeling, machine learning and programming skills to generate insights by leveraging large amounts of health care data&nbsp;<br><br>• Leverage big-data technology to design, prototype, develop and optimize production algorithms&nbsp;<br><br>• Partner with key stakeholders to understand their needs and build new automated solutions for data identification, data quality, metadata management, data retention&nbsp;<br><br>• Demonstrate how analytical results are connected to a business problem or objective&nbsp;<br><br>• Present and provide recommendations to internal teams and stakeholders&nbsp;<br><br>• Analyzing/measuring the quality of data ingested into the Data Lake and other authoritative data sources&nbsp;<br><br>What you’ll need:&nbsp;<br><br>• Strong programming and data manipulation skills&nbsp;<br><br>• Proficiency in most areas of mathematical and statistical analyses, machine learning, predictive modeling, and data visualization.&nbsp;<br><br>• A strong ability to communicate technical concepts and insights to business partners&nbsp;<br><br>• Excellent problem solving skills as well as critical thinking and conceptual thinking abilities&nbsp;<br><br>• Collaborate with source systems and downstream data consumers to remediate issues and put in place processes to monitor data quality risks&nbsp;<br><br>• Support and contribute to the Cigna Enterprise Data Management team’s overall goals: high quality data, effective data stewardship, robust and reliable metadata, compliance with data governance policy&nbsp;<br><br>Deliverables will include reports, detailed and summary analyses, root cause analyses, and improvement proposals.&nbsp;<br><br>Required qualifications to be successful in this role&nbsp;<br>• Excellent problem solving skills with the ability to design algorithms including data profiling, clustering, anomaly detection, text analytics, and predictive modeling&nbsp;<br><br>• Strong skills in statistical analyses with abilities in advanced data management and statistical programming using python, R, Java, and/or other languages&nbsp;<br><br>• Experience with the Hadoop ecosystem, Spark&nbsp;<br><br>• Familiarity with Agile methodologies&nbsp;<br><br>• Understanding of cloud platforms like AWS is preferred&nbsp;<br><br>Desirable Qualifications&nbsp;<br><br>• Advanced degree in computer science, statistics, physics, or related quantitative field preferred.&nbsp;<br><br>• 4+ years relevant data science experience&nbsp;<br>&nbsp;</p>\n</div>\n\n </div>\n \n\n <div>\n \n </div>"}