{"job title": "Data Scientist Modeling 49981 (SV1) (LJ4) (RS2)", "company": "Fast Switch", "city state": "– Dearborn, MI", "rating": "4.1", "job description": "<div>\n Job Description\n \n <div>\n \n <b>Job ID: 49981 </b><br><br><p><b>Position Description:</b></p><ul><li>The Global Data, Insight, and Analytics (GDI&amp;A) organization is looking for motivated and talented individuals with a background in advanced analytics such as Optimization, Machine Learning, and Statistics.&nbsp;</li><li>This is an opportunity to learn and apply the latest tools and methods in data science to a variety of interesting and challenging business problems.&nbsp;</li><li>Recent projects in this group have led to the development of applications in the areas of product complexity management, capacity planning, production scheduling, and other business opportunities in Manufacturing and Supply Chain Management.&nbsp;</li><li>The successful candidate will work as a member of the Order-to- Delivery Analytics team and develop advanced analytics models to support activities in inventory strategy, demand forecast, order generation, scheduling, logistics, supply chain, optimization, and more.</li></ul><p><b>Skills Required:</b></p><ul><li>Optimization, statistics, and/or machine learning to time series, forecasting, scheduling, supply chain, or other related business areas programming languages such as R, Python, Java or TensorFlow</li></ul><p><b>Skills Preferred:</b></p><ul><li>Knowledge and experience in Supply Chain Management especially in Order To Delivery processes and systems&nbsp;</li><li>Proficiency in developing prototype software applications using Java (preferred), C/C++, or similar languages and frameworks&nbsp;</li><li>Project management experience&nbsp;</li><li>Comfortable working in an environment where problems are not always well-defined&nbsp;</li><li>Inquisitive, proactive, and interested in learning new tools and techniques</li><li>Strong oral, written and interpersonal communication skills&nbsp;</li><li>Well-organized, independent and ready to work with minimal supervision&nbsp;</li><li>Knowledge and experience in Supply Chain Management especially in Order To Delivery processes and systems&nbsp;</li><li>Proficiency in developing prototype software applications using Java (preferred), C/C++, or similar languages and frameworks&nbsp;</li><li>Project management experience</li></ul><p><b>Experience Required:</b></p><ul><li>2+ years of experience in applications of optimization, statistics, and/or machine learning to time series, forecasting, scheduling, supply chain, or other related business areas&nbsp;</li><li>1+ years of experience with database queries such as Hadoop or SQL&nbsp;</li><li>1+ years of experience with programming languages such as R, Python, Java or TensorFlow&nbsp;</li><li>1+ years of experience with data visualization tools such as QlickVIew or Tableau</li></ul><p><b>Education Required:</b></p><ul><li>Master in Mathematics, Statistics, Computer Science, Operations Research, Industrial Engineering, Physics or other related</li></ul><p><b>Education Preferred:</b></p><ul><li>PhD in Mathematics, Statistics, Computer Science, Operations Research, Industrial Engineering, or other related technical areas</li></ul><p></p><p>Fast Switch, Ltd., delivering the <b>Right Talent</b> at the <b>Right Time</b> for over 21 years. We are an IT Consulting company with offices in Detroit, MI, Columbus, OH, Cleveland, OH, Cincinnati, OH, New York, Hartford, CT, Massachusetts, Minneapolis, MN, Los Angeles, CA, San Francisco, CA, and Tucson, AZ. We’re doing business in almost half the states in the union.</p><p>We're a financially strong, privately-held company that is <b>100% consultant</b> and <b>client focused</b>. You are our most important asset! </p><p>We've differentiated ourselves by being <b>creative</b>, <b>flexible</b>, and <b>fast</b>. Throw out everything you've heard, seen, or felt about every other IT Consulting company.</p><p>We're different. Our consultants and clients tell us so, and it's our great people who make the difference! We do unique things, and we do them for Fortune 10 companies, Inc. 500 companies, and technology start-ups. We also have a strong belief in giving back to the communities we serve.</p><p>Our benefits are second to none and thanks to our flexible benefits options you can choose just the benefits that you need or want, options include:</p><p>• Medical and Dental (Fast Switch pays majority of the medical program)</p><p>• Vision</p><p>• Personal Time Off (PTO) Program</p><p>• Long Term Disability (100% paid)</p><p>• Life Insurance (100% paid)</p><p>• 401(k) with immediate vesting and 3% (of salary) dollar-for-dollar match</p><p>Plus, we have a lucrative employee referral program and an employee recognition culture.</p><p>In 2013, 2014, 2015, 2016 and 2017, Fast Switch was named one of the&nbsp;<b>Top Work Places in Michigan</b>&nbsp;by the Detroit Free Press and one of the <b>Best Staffing Firms</b> in 2016 and 2017. We have won the Columbus Business First&nbsp;<b>“Fast 50”</b>&nbsp;award 9 times in 12 years because of our strong growth which translates into more and better opportunities for our consulting staff members.</p><p>To view all of our open positions, please go to: www.fastswitch.com and at the bottom of the page click Job Opportunities, or get there directly at: http://tinyurl.com/z6r74up</p><p>You can also follow us on Twitter at: www.twitter.com/fastswitch</p><p>And you can become a fan of Fast Switch on Facebook at: http://tinyurl.com/y9y3gdp</p>\n \n </div>\n </div>"}