{"job title": "Quantitative Analyst", "company": "Federal Reserve Bank of Richmond", "city state": "– VA-Richmond", "rating": "3.4", "job description": "<p>The Supervision, Regulation, and Credit (SRC) Department, Community &amp; Regional Supervision unit has an immediate opening for a Quantitative Analyst (Intermediate or Senior). In this role, the Quantitative Analyst conducts financial and quantitative analysis and research in support of risk assessments and supervisory events at community and regional financial institutions. Advises senior management on policy issues related to the regulation of banks and financial markets, prepares reports on current and emerging supervisory issues, manages large and complex databases and builds examination tools to help address issues, participates in the SRC Department`s Risk Council program and conducts examiner training. </p>\n<p> </p>\n<p>Essential Job Responsibilities include but are not limited to the following:</p>\n<ul>\n<li>Participates in bank supervisory process by providing comprehensive data expertise, database management, and complex analysis on emerging risk management practices in industry, conducts targeted reviews of banks` application of tools utilized to monitor and mitigate risk</li>\n<li>Performs comprehensive analysis on historical and supervisory data of financial institutions in support of ongoing examinations, initiatives, and projects</li>\n<li>Provides regular verbal and written briefings of current issues to all levels of management, interacts with stakeholders of community and regional banks, other regulatory agencies, and industry</li>\n<li>Active contributor, thought leader and technical resource in support of activities such as technical workgroups and the SRC Critical Issues process, providing content, analysis, and project leadership</li>\n<li>Contributes to, and may lead, activities and approaches to risk model evaluation within the System and other regulatory bodies</li></ul>\n<p> </p>\n<p>***The Quantitative Analyst - Intermediate hiring range is $97,000 - $121,300, annually.<br>***The Quantitative Analyst - Senior hiring range is $113,200 - $141,500, annually.<br>***The deadline for applying is September 4, 2018.<br>***Job title (Quantitative Analyst - Intermediate or Quantitative Analyst – Senior) and salary offered will be based on job responsibilities and individual’s knowledge, skills and experience as defined in the job qualifications/experience.</p>\n<p>Qualifications/Experience:</p>\n<ul>\n<li>Experienced professional with a minimum of 3 to 5 years of relevant work experience with moderate experience leading large projects in a team setting; 5 to 9 years of relevant work experience required at the Senior level.</li>\n<li>Bachelor’s degree in Finance, Economics, Mathematics, Statistics or related field is required. Master’s degree, MBA or ABD in relevant discipline at the Senior level. </li>\n<li>SAS certification is a plus.</li>\n<li>Must be willing and able to travel; position requires approximately 10\" travel.</li></ul>\n<p> </p>\n<p>Knowledge and Skills: </p>\n<ul>\n<li>Strong research skills, as shown by record of conducting moderately complex research and analysis that supports supervisory efforts and informs regulatory policy</li>\n<li>Developing record of translating analysis and research into clear, concise and effective actionable content like guidelines, proposals, and professional publications</li>\n<li>Ability to design and deliver training content on econometric, quantitative, or technical concepts to FRB Richmond or System examiners</li>\n<li>Strong interpersonal skills and successful participation in a team environment, success as technical resource to work groups</li>\n<li>Proficient experience with multiple specialty software program including SAS, Tableau, Stata , or equivalent</li>\n<li>Thorough knowledge regarding the analysis and quantification of credit, market, and operational risk at banking organizations</li>\n<li>Thorough (graduate level) econometric modeling training and experience, comprehensive knowledge of quantitatively-based or technical supervisory policy issues and emerging risks in banking and financial markets</li></ul>\n<p> </p>\n<p><em>Special Considerations:</em></p>\n<ul>\n<li><em>An applicant posting for employment as a Federal Reserve examiner/analyst must be a U.S. citizen or hold a permanent residence visa/Green Card and be an intending citizen.</em></li>\n<li><em>Under conflict of interest guidelines administered by the Board of Governors of the Federal Reserve System, examining personnel may not participate on an examination of a financial institution or affiliate if the examiner was employed by the financial institution or affiliate within the past 12 months. </em></li>\n<li><em>Please review the FRB Employee Code of Conduct to ensure there are no major issues related to your previous employment and current financial interests. (The Code is available on the About Us, Careers webpage at </em><em>www.richmondfed.org</em><em>.; the relevant sections are 5.3 and Appendix B, Parts I, II and III). </em></li></ul>\n<p><em>FRB ethics rules generally prohibit employees and their immediate families from owning investments in banks, savings associations or their holding companies (Section 5.3). Additionally, employees engaged in Supervision and Regulation may be subject to borrowing and deposit restrictions. These employees may need to recuse themselves from certain supervisory work based on:</em></p>\n<ul>\n<ul>\n<li><em>their borrowing relationships (Appendix B Parts I.1, II.1 and II.2), </em></li>\n<li><em>if a financial institution employs a member of the employee’s immediate family (i.e. spouse, child, parent, or sibling) (Appendix B Part I.3 and Part II.3),</em></li>\n<li><em>if the individual was employed by the financial institution or affiliate within the past 12 months (Appendix B Part I.3 and II.3).</em></li></ul></ul>\n<p><em>In certain cases, the recusal may be so extensive it could materially reduce the effectiveness of the prospective employee.</em></p>\n<p> </p>\n<p>This is not necessarily an exhaustive list of all responsibilities, duties, performance standards or requirements, efforts, skills or working conditions associated with the job. While this is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require that other or different tasks be performed when circumstances change (e.g. emergencies, rush jobs, change in workload or technological developments).</p>\n<p> </p>\n<p>The preferred location is Richmond, VA; however, Charlotte, NC or Baltimore, MD can be considered in limited circumstances.</p>"}