{"job title": "Big Data Engineer", "company": "Federal Reserve Bank of San Francisco", "city state": "– CA-San Francisco", "rating": "3.8", "job description": "<div>The Federal Reserve Bank of San Francisco is in search of a <strong>Big</strong> <strong>Data</strong> <strong>Engineer</strong> to join the Advanced Data and Analytics Capabilities group. If you are have a real passion for technology and data, are a strong critical thinker and problem solver, we are the team for you!</div>\n<br>\n<div>The Advanced Data and Analytics Capabilities group lead and develop solutions for various business lines in the Fed system and employ state of the art technologies that are part of the Hadoop ecosystem, which includes tools used for data integration, data modeling, and data analytics. Our units partners with other business lines, our National IT team and IT groups from other Federal Reserve districts. You will have an opportunity to employ your critical thinking and technical skills across many disciplines.</div>\n<br>\n<div>As a <strong>Big</strong> <strong>Data</strong> <strong>Engineer,</strong> you will contribute to high quality technology solutions that address business needs by developing data applications for the customer business lines. You will contribute to the development and ongoing maintenance of a number of strategic data initiatives and data analytic applications. You are an exceptional communicator as you will work closely with other groups, including development and testing efforts of your assigned applications components to ensure successful delivery of the product.</div> \n<br>\n<strong><div>Essential duties and responsibilities:</div>\n\n<br></strong>\n\n\n<ul>\n<li>Design and implement data solutions in alignment with the project schedule</li> \n\n<li>Design and develop code for custom solutions and common utilities in Hadoop environments using Scala/Python/Java/Spark/Scripting etc.</li>\n<li>Design and implement ingestion pipelines and workflows</li> \n\n<li>Implement security and recovery tools and techniques as required</li>\n<li>Test and implement business applications running in Hadoop environment, solve production issues and provide solutions</li> \n\n<li>Work with business customers to define requirements for data systems</li>\n<li>Document business use cases and technical design documents for data solutions</li> \n\n<li>Craft design documents and data flow diagrams for data custom solutions and present them to the architecture team</li>\n<li>Write user documentation, prepare and deliver presentations on big data solutions</li>\n<li>Expand and grow data platform capabilities to solve new data problems and challenges</li>\n<li>Research and evaluate new data tools and technologies, provide recommendations on their adoption and utilization</li>\n<li>Contribute to initiatives such as mining new data sources, developing data tools, evaluating data visualization software tools, or developing documentation</li>\n<li>Explore data to derive business insight</li>\n<li>Be open to cross-training and assignments with other division groups</li> \n</ul>\n\n<div></div>\n<br>\n<strong><div>Requirements:</div>\n\n<br></strong>\n\n\n<ul>\n<li>Bachelor’s degree, Master’s degree preferred, in computer science, MIS, engineering, statistics, data science or related field or equivalent combination of education and experience</li>\n<li>Strong quantitative and analytical skills</li>\n<li>10 years programming skills in Java or Python or Scala or other scripting language etc.</li>\n<li>Experience with Hive, Pig, Spark and Spark SQL</li>\n<li>Knowledge of shell scripts and commands</li>\n<li>Knowledge of Hadoop ecosystem, machine learning algorithm/ text analytics</li>\n<li>Ability to communicate effectively (both verbal and written) and work in a team environment</li>\n<li>Ability to balance multiple assignments and shift gears when new priorities arise</li>\n<li>Experience in MS Word, Excel, and PPT</li>\n<li>Preferred knowledge with statistical analysis or econometric modeling; experiencing using statistical software such as SAS or Stata</li>\n<li>Advanced Excel knowledge and programming</li>\n<li>Experience eliciting and documenting use cases</li>\n<li>Familiar with Agile methodologies</li> \n\n<li>Ability to travel up to 10&gt;</li>\n</ul>\n\n<div><strong>At the Federal Reserve Bank of San Francisco, we offer a wonderful benefits package including:</strong></div><div>Medical, Dental, Vision, Pretax Flexible Spending Account, Backup Child Care Program, Pretax Day Care Flexible Spending Account, Vacation Days, Sick Days, Paid Holiday’s, Pet Insurance, Matching 401(k), and an unheard-of Retirement/Pension!</div>\n<br>\n<div>At the Federal Reserve Bank of San Francisco we believe in the diversity of our people, ideas, and experiences and are committed to building an inclusive culture that is representative of the communities we serve. The Federal Reserve Bank of San Francisco is an Equal Opportunity Employer.</div>"}