{"job title": "Workforce Data Scientist", "company": "Federal Reserve Bank", "city state": "– Saint Louis, MO", "rating": "3.4", "job description": "The St Louis Fed is one of 12 Reserve Banks serving all orparts of Missouri, Illinois, Indiana, Kentucky, Tennessee, Mississippi andArkansas with branches in Little Rock, Louisville and Memphis. The St. LouisFed's most critical functions include: promoting stable prices and economicgrowth, fostering a sound financial system, providing payment services tofinancial institutions, supporting the U.S. Treasury's financial operations,and advancing economic education, community development and fair access tocredit.\n<br><br>\nOverview\n<br><br>\nThe Federal Reserve Bank of St. Louis is seeking anexperienced Workforce Data Scientistto lead the design, development, and implementation of HR analytics efforts. Thisposition will be responsible for day-to-day analytics processes including dataidentification and collection, analytics design, and interpretation offindings.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Act as a change agent and workforce analyticschampion.</li>\n<li>Design and implement analytics and reportingtools to support informed decision-making and business initiatives.</li>\n<li>Partner with cross-functional teams to identify,frame, prioritize, and answer business questions where analytics can be mostimpactful; may participate and/or lead cross-functional teams responsible forkey initiatives. Provide actionable data insights that make meaningfuldifferences.</li>\n<li>Proactively assess needs of internal customersand determines how HR can best leverage and provide services.</li>\n<li>Assist in development of analytical roadmapsthat obtain both short-term and long-term objectives.</li>\n<li>Transform analytical results into easy tounderstand visual narratives that clearly articulate the strategy, originatesnew solutions, or communicates value to stakeholders.</li>\n<li>Analyze trends and makes recommendations tomanagement in support of the aforementioned areas, including metrics, employeecommunications and HR technology strategies.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's degree in Human Resources, Data Analytics, or related field or commensurate experience.</li>\n<li>3-5 years relevant analytics experience. Experience in People Analytics strongly preferred.</li>\n<li>Experience working with analytical tools to support data analysis, reporting, and visualization, such as Tableau. Advanced knowledge of Microsoft PowerPoint, Word and Excel.</li>\n<li>Experience using statistical methods and predictive analytics.</li>\n<li>Exceptional decision making and problem solving ability that leads to ideal and practical solutions. Fact finding skills and the ability to use appropriate questions to gain relevant information in order to quickly assess and identify key issues or underlying issues. Ability to use this information to draw conclusions and provide solutions.</li>\n<li>Ability to effectively communicate with and present to all levels of management and staff, clearly expressing ideas and concepts both verbally and in writing to successfully handle sensitive issues and facilitate critical interactions.</li>\n<li>Ability to maintain a high degree of confidentiality with the ability to be discreet and professional with all levels of the organization.</li>\n<li>Ability to work independently, as well as collaborate with others.</li>\n<li>Travel (5%)</li>\n</ul>\n\nRanked as a Top Workplace, the Federal Reserve Bank of St Louis is committed to building an inclusive workplace, where employees' diversityin age, gender, race and ethnicity, sexual orientation, gender identity or expression, disability, as well as cultural traditions, religion, life experiences, education and socioeconomic backgroundsare recognized as a strength. Embracing our diversity encourages employees to bring their valued perspectives to the table when generating ideas and solving problems, and promotes an environment where innovation and excellence thrive. Learn more about the Bank and its culture; check out our Careers Site.\n<br><br>\nThe Federal Reserve Bank of St Louis is an Equal Opportunity Employer.<br><br>SDL2017"}