{"job title": "Data Science Specialist", "company": "Federal Reserve Bank of San Francisco", "city state": "– CA-San Francisco", "rating": "3.8", "job description": "<strong><div>Job Summary:</div> \n<br>\n</strong>\n<br>\n<div>The Federal Reserve Bank of San Francisco’s Division of Financial Institution Supervision and Credit seeks an upbeat, collaborative individual to work as a supervisory/quantitative analyst in the Data Analytics Group with an emphasis in data manipulation, visualization and general programming.</div>\n<br>\n<strong><div>Group Description:</div>\n<br>\n</strong>\n<br>\n<div>Data Analytics is a multidisciplinary group that works with various business lines within FISC to support and improve processes within bank supervision. Leveraging our skills in text mining, Tableau, financial analysis, and statistical analysis we develop a broad range of reports and tools which are designed to identify emerging risks, visualize data, and develop/maintain quantitative models for the Division and occasionally the Board.</div>\n<br>\n<div><strong>Responsibilities:</strong> </div>\n\n\n<ul>\n<li>Developing, documenting &amp; maintaining statistical, financial and/or econometric models to analyze capital, asset quality, earnings, liquidity risk exposure, or other sophisticated concepts, at banking institutions.</li> \n\n<li>Providing modeling and analytical assistance to a line of business or product area, functioning as day-to-day technical expert.</li> \n\n<li>Developing methods for applying data mining, NLP, and machine learning to improve the Division’s analytical and supervisory capabilities.</li>\n<li>Interpreting and manipulating large financial data sets to extract data stories, and use visualization techniques to communicate insight.</li> \n\n<li>Preparing, enhancing, and maintaining technical documentation.</li> \n\n<li>Presenting results to both technical and non-technical audiences, and visualizing data to communicate complex ideas.</li>\n</ul>\n\n<strong><div>Essential Skills and Experience:</div>\n\n<br></strong>\n\n\n<ul>\n<li>An applicant for employment must be a U.S. Citizen, U.S. National, or hold a permanent resident/green card with intent to become a U.S. Citizen.</li> \n\n<li>You should have 5-7 years of data analytics experience, with some experience in banking, finance, or banking supervision.</li>\n<li>Advanced degree in a quantitative discipline (data science, statistics, computer science, economics/econometrics, finance, applied mathematics, operational research, physics, bioinformatics, engineering, etc.) is preferred.</li> \n\n<li>Strong written, verbal, and data analysis skills with the ability to balance multiple assignments and shift gears when new priorities arise. Prior project management experience is a plus.</li>\n<li>Expertise in modern advanced analytical tools and programming languages such as Python, Scala, Java, SAS and/or R. Efficient in SQL, Visual Basic, etc. Some experience working in cluster computing environments and a familiarity with Tableau would also be helpful.</li> \n\n<li>Knowledge of and experience with the interpretation and visualization of Financial and Economic data to develop customized data reporting.</li> \n\n<li>Deep understanding of statistical and econometric theory and ability to practically apply these theories towards data analysis.</li> \n\n<li>Experience with data mining and computational algorithms and statistical modeling techniques such as clustering, classification, regression analysis, decision trees, neural nets, support vector machines, anomaly detection, sequential pattern discovery, and/or text mining for predictive analytics.</li> \n</ul>\n\n<div>The Federal Reserve Bank of San Francisco is an Equal Opportunity Employer. Our people proudly reflect the diversity and the ideas of the community we serve. If this role interests you, please submit your current resume via the 12L Portal.</div>"}