{"job title": "Senior Quantitative Analyst / Quantitative Analyst III", "company": "Federal Reserve Bank of Philadelphia", "city state": "– PA-Philadelphia", "rating": "3.6", "job description": "The Federal Reserve Bank of Philadelphia is one of the 12 regional Reserve Banks that, together with the Board of Governors in Washington, D.C., make up the Federal Reserve System. It helps formulate and implement monetary policy, supervises banks and bank and savings and loan holding companies, and provides financial services to depository institutions and the federal government. The Federal Reserve Bank of Philadelphia serves eastern and central Pennsylvania, southern New Jersey, and Delaware.\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nThis Job Description is within Quantitative Analytics Job Family and is aimed primarily for positions within the Financial Monitoring Group (FMG), Retail Risk Analysis (RRA), and Risk Assessment, Data Analysis and Research (RADAR) business lines; but could include anyone within the Supervision Regulation and Credit (SRC) department that performs these tasks. An ideal candidate must have knowledge of and be able to perform actions that are related to activities in the designated business line.\n<br><br>\nThe Senior Quantitative Analyst has a strong interest in supervisory processes, banking products and applicable laws and regulations, in addition to an advanced understanding of banking risks and risk management strategies. The Senior Quantitative Analyst serves as an advanced technical SME within an assigned risk area, with responsibilities that may include: evaluating trends in the banking industry, identifying factors that pose risk to the financial system, and communicating relevant findings to internal stakeholders.\n<br><br>\nHe/she may support senior staff on system-wide analytical initiatives related to consumer credit, bank risk, or regulatory policies pertaining to these matters that may include: horizontal studies on bank safety and soundness, research projects, implementation of the models used for the annual Dodd Frank Act (DFAST) and Comprehensive Capital Analysis and Review (CCAR) stress tests, among others.\n<br><br>\n<strong>Principal Duties and Responsibilities:</strong>\n<br><br>\nThe Analyst will be an integral part of RADAR SES evaluating fixed income securities and investment portfolios for bank examinations and macroprudential purpose. He/she will assist in the ongoing surveillance of the Fixed Income markets to monitor industry trends and identify emerging issues and risks. He/she will participate in System initiatives such as DFAST and CCAR Program with respective investment securities. He/she also assists FR staff on longer-term research projects involving fixed income investment securities or whole loan products. Some working knowledge of SQL and Excel VBA is preferred; knowledge in Bloomberg, Intex and other fixed income software is a plus; progress towards CFA, FRM or other risk management certification is a plus; and programming skill within R, Python, or Tableau is a plus.\n<br><br>\nSupporting the development or implementation of supervisory retail loss models, the data related to those models, or the qualitative evaluation of industry models through participation in the DFAST and CCAR exercises.\n<br><br>\nAnalyzing consumer credit or fixed income securities such as tracking the performance of key variables to identify possible sources of emerging risks for bank examiners, subject matter experts, CCAR modelers or other System personnel.\n<br><br>\nLeading or collaborating with senior staff on statistical and econometric research projects, including collecting and analyzing data, reviewing prior research, writing research reports, and presenting results to officers and staff.\n<br><br>\nMay participate on bank, department, or system projects. Fulfills job duties and responsibilities in conformance with sound safety practices. Demonstrates effective SRC Core Competency skills for grade and position. Performs other related duties as assigned.\n<br><br>\n<strong>Subordinates:</strong>\n<br><br>\nNone\n<br><br>\n<strong>Scope Measurements:</strong>\n<br><br>\nNone\n<br><br>\n<strong>Education and Experience:</strong>\n<br><br>\nBachelor's degree in a business or quantitative discipline, such as economics, finance, or statistics is required, with a minimum of five to eight years of industry experience. An advanced degree in a business or quantitative discipline is strongly preferred.\n<br><br>\n<strong>Knowledge and Skills:</strong>\n<br><br>\nStrong written and oral communications skills. Independently presents findings and assessments concerning highly complex supervisory matters or institutions; demonstrates ability to discuss the most complex issues with any stakeholder either within or outside the Division; assists others in their communication to achieve a consistent message, tone, style and format; diffuses conflict and builds consensus; actively engages in transferring technical knowledge; demonstrates effective use of listening skills and the ability to manage the communication process.\n<br><br>\nStrong analytical and problem solving skills. Demonstrates strong analytical skills; uses appropriate complex to high complex diagnostic- and root-cause analysis skills to identify direct and indirect causes of problems of unknown origin; gathers tangible and factual evidence from many sources; recognizes symptoms that may indicate severe problems or issues; organizes data and information in a manner that effectively communicates issues and underlying causes. Ability to collect and analyze data to track performance of key variables and identify possible sources of emerging risks within the financial sector. Experience working with large datasets using statistical software, such as SAS or Stata, is required.\n<br><br>\nStrong interpersonal skills. Demonstrates the ability to effectively lead a team; draws on experience to resolve complex issues; leads complex and diverse team efforts through technical expertise and leadership/skills of influence; leverages relationships and networks to accomplish goals and objectives; encourages and supports other team members to develop productive work relationships.\n<br><br>\nStrong time management skills. Identifies and assesses highly complex supervisory issues; able to effectively manage highly complex supervisory issues to achieve supervisory or organizational goals.\n<br><br>\nSubject to little to no oversight in work performed; may serve as mentor/coach; may coordinate and/or supervise activities of others; applies specific experience and expertise in business line and recommends preferred courses of action to guide management in highly complex matters. Senior Quantitative Analysts are highly motivated individuals who are able to work under moderate supervision and interested in consumer credit or bank risk.\n<br><br>\n<strong>Other Requirements:</strong>\n<br><br>\nApplicants must be able to provide work authorization to prove their eligibility to work in the United States.\n<br><br>\nAn applicant for employment also must be a U.S. Citizen, U.S. National, or hold a permanent resident/green card with intent to become a U.S. Citizen.\n<br><br>\n<strong>Physical Requirements:</strong>\n<br><br>\nNone\n<br><br>\n<strong>Note:</strong> This document indicates the general nature and level of work performed by employees within this position. It is not a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. An employee's responsibilities, tasks, and duties might differ from those outlined in the job description, and other duties, as assigned, are a part of the job. The Federal Reserve Bank of Philadelphia reserves the right to modify the elements of this job description, as business needs require.\n<br><br>\nThe Federal Reserve Bank of Philadelphia believes that diversity and inclusion among our employees is critical to our success as an organization, and we seek to recruit, develop, and retain the most talented people from a diverse candidate pool. The Federal Reserve Bank of Philadelphia is proud to be an equal opportunity workplace."}