{"job title": "Data Marketing Intern", "company": "Feedvisor", "city state": "– New York", "rating": "4.3", "job description": "At Feedvisor, were just as proud of our products as we are of our people. We work hard to assemble the best teams in the industry to create, manage, and sell cloud-based Algorithmic Repricing and Revenue Intelligence tools that are shaping the future of e-commerce. Our New York office is growing rapidly, and were looking forward to starting a conversation with you.\n<br><br>\nFeedvisor is the only marketplace intelligence and dynamic pricing platform using artificial intelligence to help sellers decipher data and provide actionable insights to fuel sales growth and increase profit margin. We are a team of mathematicians, data scientists and commerce experts dedicated to make our clients the smartest sellers in the room.\n<br><br>\nFeedvisors technology makes a real and lasting impact on our customers businesses and we are looking for an experienced and passionate Marketing Intern for the Summer/Fall of 2018. This internship will expose you to a wide range of marketing but will focus on data and analytics.<br><br>Requirements:<br><br>Responsibilities:\n<ul>\n<li>Analyze datasets for insights into business critical metrics</li><li>Manage weekly reporting to enable the executive and marketing team in decision making</li><li>Import discovered net new leads into database</li><li>Maintain data cleanliness for database health and process improvements</li><li>Discover contacts/leads and enrich contacts/leads with information</li><li>Assist with landing page and email layout</li><li>Lead vendor research and evaluations</li><li>Monitor communication channels for responses</li><li>Strategize and develop video marketing efforts</li><li>Provide support for all other marketing efforts as needed</li>\n</ul>\nRequirement:\n<ul>\n<li>You currently enrolled in a full-time undergraduate or MBA program in or near NYC</li><li>You're available to work approximately 35 hours per week over the summer in Feedvisors SoHo office</li><li>Required 3 month commitment</li><li>Ability to analyze data with extreme attention to detail</li><li>You're proficient in Microsoft Office and Google Apps</li><li>Strong plus if you have experience with CRM and marketing automation platforms</li><li>A positive and can-do attitude with a strong ability to learn</li><li>You have a proven interest in marketing or relevant work experience (B2B SaaS environment preferred)</li>\n</ul>"}