{"job title": "Data Scientist", "company": "Feedzai", "city state": "– San Mateo, CA", "rating": "3.6", "job description": "<div>\n<div>Feedzai is AI. We're coding the future of commerce with a leading platform powered by artificial intelligence and big data. Founded and developed by data scientists and aerospace engineers, Feedzai has one critical mission: make commerce safe. The world's largest banks, payment providers and retailers use Feedzai's machine learning technology to manage risks associated with banking and shopping, whether it's in person, online or via mobile devices.</div>\n<br><strong>You</strong>\n<br><br>\nWe want your incredible talent to drive growth and help our customers be successful. You are a curious person, driven by the willing of wanting to learn and looking for answers for challenging problems. You are a good-humored team player, someone who's reliable and accountable. You care for the quality of your work and for the success of the product you help developing.\n<br><br>\n<strong>Your daytoday</strong>\n\n<ul>\n<li>As a Data Scientist, your main role is to do Data Science work on projects for our clients. Occasionally this can be done from our offices, but often this will be done at clients' premises for security reasons, so there is a significant travel component involved (in some cases more than 30%)</li>\n<li>Understanding the data which our clients provide to us</li>\n<li>Cleaning that data and validating that it is correct</li>\n<li>Preprocessing the data, usually by using a mixture of shell scripts and a programming language such as Python, Java, Scala, etc</li>\n<li>Iteratively computing features and tuning parameters to improve the quality of the model</li>\n<li>Communicating your findings to the project manager and assisting him/her in decision making on the Data Science part of the project</li>\n<li>Work together with the data scientists and engineers from our clients</li>\n</ul>\n<strong>You know how:</strong>\n\n<ul>\n<li>A PhD degree is valued but it's not mandatory</li>\n<li>PhDs from Machine Learning, Natural Language Processing, Image Processing, Signal Processing, Speech Processing, Optimization, etc are encouraged to apply. We speak your language. :)</li>\n<li>MScs from Computer Science, Electrical Engineering, Physics, Biomedical Engineering, etc, are also encouraged to apply</li>\n<li>You should be proficient in some language, enough that you can handle data processing and algorithm implementation in that language. Most of us use Python, Java, Scala or C++. Any of those is fine, among others</li>\n<li>Your main task will be researching new algorithms for fraud detection with Machine Learning methods</li>\n<li>Occasionally, you will have the opportunity to travel to our clients to help implement the algorithms you developed and/or to help set up our existing ML solutions</li>\n<li>\"Publish or perish\" doesn't exist here. If you develop something novel, a publication is allowed and encouraged. If it's not novel but solves the problem, that's fine too</li>\n</ul>\n<strong>Feedzai is an Equal Opportunity Employer.</strong>\n<br><br>\n<strong>Feedzai does not accept unsolicited resumes from recruiters or employment agencies.</strong></div>\n<br>"}