{"job title": "Senior Business Intelligence Analyst", "company": "Field Nation", "city state": "– Minneapolis, MN", "rating": "4.4", "job description": "Why is this role important to Field Nation?\n<br><br>\nThe Senior Business Intelligence Analyst will have the opportunity to work collaboratively as part of the Data Science team and with other internal teams to enable further understanding and utilization of our data. This position offers the opportunity to be in a fast-paced, high growth environment where new ideas are encouraged and collaboration is a must. This position is located in Minneapolis, MN.\n<br><br>\n<strong>What you'll do:</strong>\n\n\n<ul>\n<li>Design elegant reports and dashboards to inform business decisions throughout the company</li>\n<li>Partner with individuals and teams to understand the underlying questions or requests and how to best use the data to solve the intent of the request</li>\n<li>Query data from various sources and integrate into a single data set</li>\n<li>Assist in analysis by finding patterns and relationships in the data</li>\n<li>Administer content, data connections and user permissions on Tableau server</li>\n<li>Work with a variety of data sets from finance, sales, web traffic and more</li>\n<li>Train users to self-service their data needs in Tableau and Excel</li>\n</ul>\n\n<strong>What you'll need:</strong>\n\n\n<ul>\n<li>5+ years of experience in similar role or relevant experience</li>\n<li>Bachelor's Degree required or equivalent professional experience (Degree in math, statistics economics, or related field preferred)</li>\n<li>Proficient working with complex business data sets</li>\n<li>Experience creating reports with Tableau or other reporting tool</li>\n<li>Strong querying skills using SQL</li>\n<li>Proficient in Excel</li>\n<li>Effective interacting with wide variety of business users</li>\n<li>Ability and comfort with presenting in front of others</li>\n</ul>\n\nWhy Field Nation\n<br><br>\nAt Field Nation we are breaking the barriers to work. We're a tech company that offers a web-based marketplace solution for buyers and sellers of contract services to simply connect, work, and manage their business. We look for collaborators, innovators, and problem solvers to join us in our common purpose of changing the way work gets done. We were named a 2017 Top 150 Workplace by the Star Tribune and we look to hire extraordinary people and provide them extraordinary benefits.\n<br><br>\nA snapshot of our perks and benefits:\n\n\n<ul>\n<li>Unlimited/Flexible paid time off</li>\n<li>Annual vacation bonus yes, we'll pay you a bonus to take paid time off!</li>\n<li>Individualized growth and development plans to help you develop a deeper skillset and wider responsibility in your career</li>\n<li>Exposure to and experience with cutting edge technologies to solve meaningful problems in an entrepreneurial, startup environment</li>\n<li>Company paid short-term and long-term disability and life insurance</li>\n<li>Medical, dental, and vision benefits with HSA option (to include a competitive employer contribution)</li>\n<li>Paid parental leave</li>\n<li>Monthly birthday/anniversary celebrations with everything from a nacho bar to a build your own waffle station</li>\n<li>Great work/life balance with a flexible, come-as-you-are environment</li>\n<li>Competitive 401k employer match and vesting schedule</li>\n<li>Open office space with tons of natural light in beautiful downtown Minneapolis, connected to the Minneapolis skyway system, close to public transportation hubs, and many popular food options.</li>\n</ul>"}