{"job title": "Data Scientist", "company": "Figure", "city state": "– San Francisco, CA", "rating": "NA", "job description": "<strong>About the Role</strong>\n<br><br>\nFigure is a financial technology company with the mission of leveraging blockchain, AI and advanced analytics to unlock new access points for consumer credit products that can transform the financial lives of our customers. We provide home equity release solutions, including home equity lines of credit, home improvement loans and home buy-lease back offering for retirement. Concurrently, we are building a blockchain protocol for the origination, custody, trading and securitization of whole loans and other assets.\n<br><br>\nWe are a group of passionate innovators and serial entrepreneurs with a proven track record of creating billions of dollars in value in the FinTech space. We are targeting significant growth and milestones in the next few years, and are looking to hire exceptional talent.\n<br><br>\nWe're looking for a rockstar Data Scientist to join our growing team. This team has an incredible engineering challenge: integrate a variety of very large datasets that outline intricate details about consumer's credit profile. This expansive dataset is the foundation for our AI and machine learning processes that will power everything from prospecting, to operations, to servicing of our clients. Innovations here tie directly to the extensibility of our infrastructure, the capabilities of our machine learning, and success in our mission.\n<br><br>\n<strong>What You'll Do</strong>\n\n<ul>\n<li>Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.</li>\n<li>Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.</li>\n<li>Assess the effectiveness and accuracy of new data sources and data gathering techniques.</li>\n<li>Develop custom data models and algorithms to apply to data sets.</li>\n<li>Use predictive modeling and machine learning to increase and optimize customer experiences, revenue generation, and underwriting, as well as other business outcomes.</li>\n<li>Develop company A/B testing framework and test model quality.</li>\n<li>Coordinate with different functional teams to implement models and monitor outcomes.</li>\n<li>Develop processes and tools to monitor and analyze model performance and data accuracy.</li>\n</ul>\n<strong>What We Look For</strong>\n\n<ul>\n<li>We're looking for someone with 5+ years of experience manipulating data sets and building statistical models, and has a Master's or PHD in Statistics, Mathematics, Computer Science or another quantitative field.</li>\n<li>Strong problem solving skills with an emphasis on product development.</li>\n<li>Experience using TensorFlow (a big plus) or Python to manipulate data and draw insights from large data sets.</li>\n<li>Experience in a variety of machine learning techniques clustering, trees, deep learning (especially GAN), etc. and their real-world advantages/drawbacks.</li>\n<li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</li>\n<li>Experience using web services: Redshift, S3, GCP (a plus).</li>\n<li>Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MemSQL, etc.</li>\n<li>Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.</li>\n<li>A successful history of manipulating, processing and extracting value from large disconnected datasets.</li>\n<li>Excellent written and verbal communication skills for coordinating across teams.</li>\n<li>Ability to thrive in a fast-paced growing company.</li>\n</ul>\n<strong>Benefits to You</strong>\n\n<ul>\n<li>Competitive salary based on experience and skills</li>\n<li>Firm-wide 25% bonus target</li>\n<li>Competitive stock options package as an early member of the team</li>\n<li>A flexible paid time off and vacation policy</li>\n<li>Comprehensive health, vision, dental insurance</li>\n<li>Company FSA</li>\n<li>Commuter benefits</li>\n<li>Gym membership and other company programs</li>\n<li>And much more to come!</li>\n</ul>\nFigure will not sponsor work visas for this position. In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire."}