{"job title": "Lead Data Scientist, Technology - New York, NY or Rockville, MD", "company": "FINRA", "city state": "– New York, NY", "rating": "3.2", "job description": "<strong>We Work to Protect Investors. Join our Team.</strong>\n<br><br>\nThe Financial Industry Regulatory Authority (FINRA) is seeking a well-qualified individual for our <strong>Lead Data Scientist</strong> openings in <strong>New York, NY or</strong> <strong>Rockville, MD.</strong> To be considered for this position, please submit your resume through our career site at www.finra.org/careers no phone calls, please.\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nThe Lead Data Scientist for Market Regulation Technology will work to establish and institutionalize data science and machine learning best practices as FINRA moves to ML based pattern development. The development product for this move will be the creation of the Dynamic Surveillance Platform. The lead data scientist will have primary responsibility of the development of the Machine Learning (ML) Framework portion of the Platform.\n<br><br>\n<strong>Essential Job Functions:</strong>\n<ul>\n<li> Lead development of the ML Framework within the Dynamic Surveillance Platform.</li>\n<li> Work closely with multiple FINRA businesses to specify, design and build the ML Framework.</li>\n<li> Collaborate with Data Engineers to specify and design the Data Framework.</li>\n<li> Strong and disciplined coding skills with a history of creating and supporting reusable packages (Scala, R or Python).</li>\n<li> Analyze experimental data with statistical rigor.</li>\n<li> Ensure accurate interpretation by combining business acumen with detailed data knowledge and statistical expertise.</li>\n<li> Build machine learning base surveillance models to monitor markets and protect investors.</li>\n<li> Translate analytic insights into concrete, actionable recommendations for new models and communicate these findings.</li>\n<li> Drive efforts to enable independent interpretation of results through education, improved tools, and data visualization.</li>\n</ul>\n<strong>Other Responsibilities:</strong>\n<ul>\n<li> Mentor other Data Scientists on the team and within FINRA on methodologies and best practices</li>\n</ul>"}