{"job title": "Data Scientist", "company": "First American", "city state": "– USA, California, Santa Ana", "rating": "3.6", "job description": "<u><strong>Company Summary</strong></u>First American Financial Corporation (NYSE: FAF) operates through its family of companies to help people achieve and protect their dream of homeownership. First American was named one of FORTUNE's 100 Best Companies to Work For® in 2016 and 2017. With experience dating back to 1889, First American is a leading provider of title insurance protection and settlement services to the real estate and mortgage industries. More information about the company can be found at www.firstam.com<u><strong>Job Summary</strong></u><br><br>Identifies business trends and problems through complex data analysis. Interprets results from multiple sources using a variety of techniques, ranging from simple data aggregation via statistical analysis to complex data mining independently. Designs, develops and implements the most valuable business solutions for the organization.\n<br><br>\n<strong><strong>Essentials Functions</strong></strong>\n<ul>\n<li>Leverage skills in handling very large datasets to perform exploratory analysis, construct relevant variables, and perform sample design</li><li>Build complex predictive models to substantially improve business operations</li><li>Act as technical expert to recommend and develop innovative analytic solutions</li><li>Communicate and present results to internal audiences, prepare presentations and documentation of models and analytical solutions</li>\n</ul>\n<strong><strong>Knowledge and Skills/Technology Used</strong></strong>\n<ul>\n<li>Some experience with large datasets</li><li>Knowledge and experience with diverse statistical and data mining methods (e.g. - GLM/Regression, Trees, Clustering, PCA, SVM, Time Series analysis etc.)</li><li>Demonstrated proficiency with statistical packages such as SAS or R</li><li>Understanding of RDBs and interactive SQL programming skills</li><li>Aptitude for picking up new technologies</li><li>Excellent verbal and written communication skills</li>\n</ul>\n<strong><strong>Typical Education</strong></strong>\n<ul>\n<li>MS/MA in a related quantitative field or BA/BS with at least 2-3 years of related work experience</li>\n</ul>\n\nFirst American invests in its employee’s development and well-being, empowers them to provide superior customer service and encourages them to serve the communities where they live and work. First American is committed to diversity and inclusion. We are an equal opportunity employer. For more information about our Company and our dedication to putting People First, check out firstam.com/careers."}