{"job title": "Data/Modeler Scientist III", "company": "First Solar", "city state": "– Perrysburg", "rating": "3.7", "job description": "Our high growth and leadership position in the renewable energy business offers outstanding opportunities to individuals seeking an exciting work environment in one of the most important industries for the 21st century. First Solar is a leader in the development and manufacturing of thin film solar modules used in grid-connected solar power plants, as well as a provider of complete solar generation solutions for U.S. utilities. Our culture is one where teamwork, continuous improvement, achievement of results, and environmental responsibility are core values. We are seeking new associates who are motivated to contribute their talents to making cost-effective solar energy an important part of the world’s energy mix.\n<br><br>\n-\n<br><br>\n<strong><u>Primary Job Functions:</u></strong>\n<br><br>\nWe’re changing the world. Let us start with yours.\n<br><br>\nFirst Solar’s information technology (IT) department seeks candidates who believe in our mission of providing cost-advantaged solar technology through innovation, customer engagement, industry leadership and operational excellence.\n<br><br>\nAt First Solar, the IT organization is an innovation driver, continuously finding new ways to improve and automate processes that connect people and technology. They are the foundation of every business function, enabling the company to efficiently scale and make data-driven decisions to further our mission. People are IT’s most important asset, and this incredibly talented team supports our manufacturing systems, business applications, productivity tools, hardware, networks, and information security.\n<br><br>\nThe IT organization seeks individuals who enjoy contributing to an innovative, fast-paced, forward-thinking team. They should be effective problem solvers, data driven, results oriented, and motivated to improve processes that help First Solar lead the world’s sustainable energy future.\n<br><br>\n<u><strong>Basic Job Functions:</strong> </u>\n<br><br>\nThis position supports organizational strategy and operations through design and statistical analysis of business initiatives and experiments. Works with business partners to understand what the business needs and issues are to address. Applies advanced knowledge of statistics and data mining (e.g., predictive modeling, simulation) or other mathematical techniques to recognize patterns and create insights from business data. Designs, develops, and evaluates statistical and predictive models that lead to business solutions. Serves as lead statistician for the unit, providing expertise, oversight and guidance on statistical analysis efforts. Communicates findings and recommendations to management across different departments. Supports implementation efforts.\n<br><br>\n<u><strong>Experience:</strong></u><ul>\n<li>Advanced experience (5 years) with experimental design.</li>\n</ul>\n<u><strong>Education:</strong></u>\n<ul>\n<li>Preferred candidates will have a Masters level degree in Statistics, Mathematics, Physics, Computer Sciences, Actuarial Science, or Engineering, or related field or equivalent designation, such as Fellowship of the Casualty Actuarial Society.</li>\n</ul>\n<u><strong>Required Skills/Competencies:</strong></u>\n<ul>\n<li>Strong communication skills to lead groups, and advanced experience with experimental design.</li><li>Achieve Results</li><li>Be Accountable</li><li>Maximize Customer Experience</li><li>Business Acumen</li><li>Communication</li><li>Quantitative Analysis</li><li>Technical Expertise</li><li>Demonstrated experience building predictive models utilizing advanced statistical analysis, including generalized linear models, decision trees, logistic and multivariate regression.</li><li>Demonstrated experience communicating business implications of complex data relationships and results of statistical models to multiple business partners.</li><li>Demonstrated experience utilizing advanced descriptive statistics and analysis techniques (such as forecasting, analysis of variance, t-tests, categorical data analysis, nonparametric data analysis, cluster analysis, factor analysis and multivariate statistical analysis) design business experiments and measure the impact of business actions.</li><li>Demonstrated experience with statistical and modeling software tools, such as SAS, SPSS or R.</li><li>Demonstrated experience working with various business partners to scope and design the statistical framework for business experiments, and socialize and help integrate results of analysis of ex</li>\n</ul>\n<u><strong>Essential Responsibilities:</strong></u>\n<ul>\n<li><strong>Statistical Research &amp; Model Development (55%)</strong>\n\n<ul>\n<li>Works with business partners to identify and scope new opportunities for statistical analysis applications to evaluate business performance and to support business decisions.</li><li>Works internally and with I/S and Enterprise Data Management to define, secure and prepare datasets for statistical modeling.</li><li>Explores data using a variety of statistical (e.g., data mining, regression, cluster analysis) techniques to answer business questions or guide future model development.</li><li>Builds programs for running statistical tests on data and for understanding correlation of various attributes.</li><li>Builds hypotheses, identifies research data attributes and determines best approach to address business issues.</li><li>Working with business partners, leads development of experimental design for business initiatives.</li><li>Applies advanced statistical techniques, including analysis of variance, t-tests, factor analysis, regression and multivariate analyses or simulation, to analyze the effects of business initiatives.</li><li>Builds predictive models (e.g., logistic regression, generalized linear models) as appropriate to support business partner objectives and business needs.</li><li>Incorporates findings and provides industry and competitor insights as part of model development and enhancement.</li><li>Prepares testing scenarios and tests model performance.</li><li>Provides guidance and direction related to statistical analysis to less experienced Strategic Data &amp; Analytics staff as needed. Provides peer review related to analytics methods and results.</li><li>Responsible for advanced analytics, including experimental design and analysis, for the most complex business experiments.</li></ul></li>\n</ul>\n\n\n<ul>\n<li><strong>Model Consultation, Implementation, &amp; Communication (30%)</strong>\n\n<ul>\n<li>Serves as statistical expert within the unit as well as in consultation to various areas of the business, to support design and analysis of business experiments.</li><li>Leads analytics projects or components related to large, complex business initiatives.</li><li>Prepare recommendations and findings for business partners.</li><li>Works with research and analytics staff and other areas of the business on model application and implementation.</li><li>Effectively communicates and delivers statistical and predictive model results to business partners, supporting socialization and adoption of analysis results into business activities and decisions.</li><li>Assists with knowledge transfer and training to business areas regarding new analytics applications as part of implementation process.</li><li>Works closely with business stakeholders to identify and answer critical questions.</li><li>Assists in development of standard analytical approaches and methodologies for the department. Provides knowledge transfer and training on new modeling and statistical analysis tools and methodologies to less experienced staff.</li></ul></li>\n</ul>\n\n\n<ul>\n<li><strong>Industry Research (15%)</strong>\n\n<ul>\n<li>Researches and maintains awareness of industry best practices and business strategies.</li><li>Proactively brings in new and innovative ideas and approaches to develop business solutions.</li><li>Researches and leverages new statistical techniques and technologies to apply in their statistical research work.</li></ul></li>\n</ul>\n<strong>Office Physical Requirements:</strong>\n<br><br>\nAll positions in our office require interaction with people and technology while either standing or sitting. In order to best service our customers, internal and external, all associates must be able to communicate face-to-face and on the phone with or without reasonable accommodation. First Solar is committed to compliance with its obligations under all applicable state and federal laws prohibiting employment discrimination. In keeping with this commitment, it attempts to reasonably accommodate applicants and employees in accordance with the requirements of the disability discrimination laws. It also invites individuals with disabilities to participate in a good faith, interactive process to identify reasonable accommodations that can be made without imposing an undue hardship.\n<br><br>\n-\n<br><br>\n<u><strong>Language Requirements</strong></u>\n<br><br>\n-\n<br><br>\n<u><strong>Experience</strong></u><br><br>Experimental Design<br><br>-\n<br><br>\n<u><strong>Education</strong></u><br><br>Bachelors: Related Field (Required), Masters<br><br>-\n<br><br>\nPotential candidates will meet the education and experience requirements provided on the above job description and excel in completing the listed responsibilities for this role. All candidates receiving an offer of employment must successfully complete a background check, pre-employment drug screen, and any other test that may be required for the role."}