{"job title": "Business Data Analyst-Gov't Programs", "company": "FirstCare Health Plans", "city state": "– Austin, TX", "rating": "2.6", "job description": "SUMMARY: This role is responsible for collecting, organizing, interpreting and analyzing regulatory data deliverables, for submission to TDI, HHSC or other regulatory entities in accordance with strict timelines established both internally and externally.\n<br><br>\n<strong>ESSENTIAL DUTIES and RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Responsible for collecting, organizing, interpreting and analyzing healthcare data from a wide range of existing data sources for key stakeholders</li>\n<li>Gathers and evaluates reporting requirements to support business and regulatory reporting needs</li>\n<li>Works directly with functional areas to identify analytical requirements, ensure data completeness, data accuracy, and data availability</li>\n<li>Ability to work with users to refine requirements, develop specifications, coding, unit testing, user acceptance testing, documentation, and implementation on behalf of the Government Programs department</li>\n<li>Ability to effectively communicate results to all levels of the enterprise</li>\n<li>Provides explanations and information to others on topics within area of expertise</li>\n<li>Ability to manage multiple priorities and meet non-negotiable deadlines</li>\n<li>Works in conjunction with departmental leadership to address the needs of the department</li>\n<li>Meets periodically with business owners to discuss metrics and analysis</li>\n<li>Follow FirstCare’s policies and procedures regarding Information Technology Infrastructure Library (ITIL) and Systems Development Life Cycle (SDLC)</li>\n<li>Other duties as assigned</li>\n</ul>\n\n<strong>EDUCATION AND EXPERIENCE, SKILLS, CERTIFICATES, LICENSES, AND/OR REGISTRATIONS:</strong>\n\n\n<ul>\n<li>BA/BS degree in Mathematics, Healthcare Informatics, Health Administration, Statistics or related major preferred</li>\n<li>Minimum 4-6 years of increasingly responsible data analysis/reporting experience in a Medicaid, regulatory or other healthcare setting with an understanding of data terminology required</li>\n<li>4+ years of analytical reporting deployment, design, development and architecture experience</li>\n<li>4+ years of query writing to include stored procedures, functions, and views</li>\n<li>4+ years of experience with SQL Server 2005 or later</li>\n<li>Familiarity with industry reporting tools, Information Builders, Tableau, Microstrategy, etc. preferred</li>\n<li>Knowledge of data quality management best practices preferred</li>\n<li>Knowledge of dimensional data warehouse design</li>\n<li>Proficient in all Microsoft Office Tools</li>\n<li>Effective oral, written, and interpersonal communication skills required.</li>\n<li>Ability to research regulatory requirements and define business rules in accordance with regulatory requirements</li>\n<li>Demonstrated ability to communicate complex technical information to non-technical personnel both verbally and in writing</li>\n<li>Ability to take initiative, work flexibly, and adhere to priorities with minimal direct supervision.</li>\n<li>Ability to work independently as well as in a cross-functional team environment by collaborating with others and sharing tools, skills, and knowledge</li>\n<li>Solid problem-solving and analysis skills that demonstrate resourcefulness and attention to detail</li>\n<li>Project management skills in coordinating multiple projects</li>\n<li>Strong customer service orientation</li>\n<li>Strong organizational and time management skills</li>\n</ul>\n\nFirstCare Health Plans is an Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, genetics or any other basis prohibited by law."}