{"job title": "Quantitative Analyst", "company": "First Republic Bank", "city state": "– US-CA-Palo Alto", "rating": "3.8", "job description": "Overview\n<p>First Republic and its subsidiaries offer private banking, private business banking and private wealth management, including investment, trust and brokerage services. First Republic specializes in delivering exceptional, relationship-based service, with a solid commitment to responsiveness and action. Services are offered through preferred banking or wealth management offices primarily in San Francisco, Palo Alto, Los Angeles, Santa Barbara, Newport Beach, San Diego, Portland, Boston, Palm Beach, Greenwich, and New York City. First Republic offers a complete line of banking products for individuals and businesses, including deposit services, as well as residential, commercial and personal loans.</p>\n<p> </p>\n<p>As a strategic service offering, First Republic’s “Enterprise Data and Client Insight” (EDCI) office works collaboratively with business and Information Technology to manage engagements and lead teams of data analysis resources in and assists the bank to leverage data as an asset throughout its business processes by offering information solutions to develop enterprise view of data - including Analytics, Business Intelligence, Data Management and Data Quality and Governance. This individual will be at the nexus of helping the bank’s leadership maximize the value of our data to make more informed decisions, service clients and capitalize on competitive opportunities in increasingly sophisticated ways.</p>\n<p> </p>\n<p>Over the years, First Republic’s focus on exceptional, relationship-based service and consistent leadership has led to continuous growth and profitability. At First Republic, it’s all about embrace change and every person has the opportunity to grow and contribute. First Republic is in fast-moving, high-growth area with huge potential. It offers variety, challenge, responsibility and the opportunity to realize your leadership potential. Being a member of First republic team means you will specialize in a particular competency - Risk, Banking and Capital Investments, or Information Technology Services.</p>\nResponsibilities\n<p>As a Quantitative Analyst, this person will work on a number of initiatives to improve and develop the analytics infrastructure in all areas of the bank. This person will work on cross divisional project teams with members of EDCI, Enterprise Risk, Treasury, Financial Planning &amp; Analysis teams, Information Services, and Data Management teams. Possible projects include deriving customer insights through predictive modeling; addressing business needs and recommend solutions; determining the most effective means of meeting our risk, regulatory reporting and financial planning requirements; determining quantitative strategies for social media and marketing.</p>\n<p> </p>\n<p>Key Responsibilities include assisting the Chief Data Officer and Head of Analytics in envisioning, designing, planning, building and deploying (release, maintenance, monitoring) information and analytics solutions. From time to time, the analyst will participate in related activities including various data governance and data profiling initiatives, application development and vendor evaluation, Executive Management Reports and other analytic activities as needed.</p>\n<p> </p>\n<p>The ideal candidate has a broad skillset in areas like statistics, math, computing, and quantitative modeling. Background or experience in finance, business analysis, or financial engineering is a plus, but not required as long as the candidate possesses a strong curiosity for and ability to quickly learn and assimilate new skills as needed. Candidates must have an attitude of getting things done and delivering results while keeping long terms goals and objectives in mind. To supplement these sophisticated analytical capabilities, candidates need to have solid business acumen and executive-level communication.</p>\nQualifications\n<p>To qualify, candidates must have the following:</p>\n<ul>\n <li>a bachelor's degree and 2-5 years of related work experience; or a graduate degree and approximately 3 years of related work experience</li>\n <li>a degree in computer science, engineering, mathematics with a minor in economics, finance or a related field; MBA or MS degree preferred</li>\n</ul>\n<ul>\n <li>a minimum 2+ years of relevant corporate work experience working on programming, data analytics, quantitative modeling</li>\n <li>banking experience is a plus but a candidate that can clearly articulate the transferability of out of industry skills will be considered</li>\n <li>Ability to work effectively in both a team environment and independently, both with internal and external (partner) resources</li>\n <li>Excellent communication skills, both verbal and written</li>\n <li>Programming skills in prototyping languages like python</li>\n <li>Statistical skills and experience with languages like R</li>\n <li>Ability to work with large databases and devising queries using SQL</li>\n <li>An understanding of the data used and the associated inherent issues in Commercial Banking, Retail Banking, or Asset Management would be a plus</li>\n <li>Strong knowledge of and experience in executing all phases of the technology life cycle, based on proven project management and testing methodologies.</li>\n</ul>"}