{"job title": "Business Intelligence Data Analyst", "company": "Fisher Investments", "city state": "– Camas, Washington", "rating": "3.6", "job description": "Job Description Overview The Opportunity: The 401k Solutions Team (4S) is a seeking a Business Intelligence Data Analyst to support their analysis needs and the use of the group s business intelligence tool, Domo. This includes data visualization, system administration, and creation of new data flows and data sets (I.e. ETL layer) to support our growing business needs. You will also guide and support the evaluation of system enhancements and new data sources. Your day will vary depending on team priorities and projects, but will generally be a mix of longer-term projects, research efforts, and ongoing daily responsibilities tied to the work of the team. The Day-to-Day: Assist in the data architecture, the creation of flows, and the evaluation of new functionality to support the use of Domo Oversee the calculation, creation, and internal certification of visualizations and dashboards related to key performance indicators Turn business ideas and questions into sound and repeatable analysis to understand team operations and support the future growth of the business Analyze built graphs and dashboards and help articulate the meaning to 4S management Provide internal Domo analytics and calculation logic assistance to the rest of 4S Oversee 3rd party analytics vendors tasked with special projects Your Qualifications: Bachelor s degree from a four-year college or university or equivalent combination of education/experience Minimum of five years of professional work experience, with at least three years in a data analytics capacity Experience working with business intelligence tools (Domo is preferred, but others acceptable as well) Strong quantitative, data visualization, data analysis, and analytical thinking skills is required Good communicator and comfortable working with senior leadership within the group Demonstrated excellence at presenting complex development topics to both executive and technical personnel Ability to work independently and manage multiple task assignments Strong knowledge and application of data literacy Strong problem solving and troubleshooting skills with the ability to exercise mature judgment Experience in recognizing business problems and recommending/developing solutions Why Fisher Investments: Fisher Investments is a different kind of investment firm. We don t come from Wall Street, nor do we believe we fit in with most of the finance industry, and we re proud of that. We work for a bigger purpose: bettering the investment universe. From unmatched service to innovative perspectives on investing, it s the people that make the Fisher purpose possible. After all, it s our people that enable us to offer the level of service that we do. And we invest in them accordingly, offering exceptional benefits like: 100% coverage of premiums for health, vision and dental insurance A 50% 401(k) match, up to the IRS maximum 20 days of PTO*, plus 9 paid holidays And much, much more We also provide a cumulative, continuous learning and development framework customized for every employee. This emphasis on personal and professional growth has yielded an award-winning work environment; we re Great Place to Work Certified, and The Oregonian named us as a 2017 and 2018 Top Workplace. But in the end, it s not the perks that keep people here. They stay because they believe in our mission of service our employees want to make a difference in an industry that can do better. * California employees accrue up to 17 days of PTO and 3 days of sick time per year. FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER #LI-FI1 *****************************"}