{"job title": "Data Scientist", "company": "Flexport", "city state": "– San Francisco, CA", "rating": "3.9", "job description": "Global problems. Global impact.<br><br>Flexport's mission is to make global trade easy for everyone. We are re-making a trillion dollar industry that touches every person on Earth, which means solving some of the global community's most complex challenges. We are looking for makers who love learning, are passionate about collaborating, and desire to build solutions with a global impact.\n<br><br>\nFast, accurate insights are integral in allowing us to fulfill our mission of fixing the user experience in global trade. At Flexport you'll conduct analyses that are at the forefront of reshaping the entire logistics &amp; supply chain industries. You'll work alongside self-starters interested in solving real-world problems and streamlining the inefficiencies in the complex global trade industry. You'll have the opportunity to improve an industry by analyzing the new operating system for global trade.<br><br>What you'll do\n\n\n<ul>\n<li>Own the analytic lifecycle for product development - consult with product managers on the best metrics to use for measuring new feature success, how to instrument them, and finally how to run experiments to get feedback on those initiatives</li>\n<li>Move the needle by making Flexport more productive your output will help shape the path of decisions at every level, every day, across the entire organization</li>\n<li>Do research on our own data to discover trends in the global freight market and help turn those insights into impact</li> \n\n<li>Contribute and grow the culture of excellence on our team by bringing processes and best practices to our group</li>\n</ul>\n\nWhat you'll need\n\n\n<ul>\n<li>3-5 years experience in a Data Scientist, Data Analyst or similar role doing A/B testing for Product Development</li>\n<li>Exceptional analytic ability intrinsic understanding of how to craft a metric and the inherit trade-offs to different approaches</li>\n<li>Bias for value-creation; making due with the data available to give the best recommendation to the business</li>\n<li>Next level communication skills and empathy to understand and discover business pain points, specify solutions, and build analyses towards understandable results</li>\n<li>Ability to think organizationally we are growing fast and always need to understand where our data came from, where it will be going, and the processes required to interpret, understand, improve and action it</li> \n\n<li>Experience in a fast-paced work environment &amp; a bias for action. You can quickly create insight with impeccable accuracy</li>\n<li>A value-first approach to doing analytics. You care about the actionable nature of your analyses.</li>\n</ul>\n\nWhat you'll get\n\n\n<ul>\n<li>The opportunity to define the culture on a small team but growing engineering team</li>\n<li>To be a thought leader on an impactful &amp; innovative data science team</li>\n<li>Meaningful equity in a startup growing their business 20% every month</li>\n<li>Analytic ownership discover the highest value-add projects and see them through from ideation to impact</li>\n</ul>\n\nCulture &amp; Values\n\n\n<ul>\n<li>Learn more at www.keyvalues.com/flexport</li>\n</ul>"}