{"job title": "Data Scientist", "company": "Fluke Networks", "city state": "– Pittsburgh, Pennsylvania", "rating": "3.0", "job description": "Data Scientist\n<br><br>\n<strong>FOR******</strong>\n<br><br>\nFortive is a global family of more than 20 industry-leading industrial growth and technology companies, united by a shared purpose: to make the world stronger, safer and more effective by providing essential technology for the people who accelerate progress. We take on big challenges that have real impact in fast-moving fields like software development, robotics, transportation, energy and healthcare.\n<br>\nWith more than $6.7 billion in annual revenues and a culture rooted in Kaizen, or continuous improvement, Fortive is well positioned to create essential, technology-based solutions to solve the world's most critical challenges. Our strong capability comes from a team of smart, motivated people who proudly deliver excellence in each of our outstanding brands in the areas of field instrumentation, transportation, sensing, product realization, automation and specialty, and franchise distribution.\n<br>\nFortive is headquartered in Everett, Washington and employs a team of more than 26,000 research and development, sales, marketing, product development, innovation, and service employees in more than 50 countries around the world.This is a place where people who share a drive and passion to make a personal difference can learn, grow, and achieve. And that's good... for you, for us, for growth.\n<br>\nFor more information, please visit: ***************.\n<br><br>\nThe Fort is the new hub for innovation and incubation at Fortive. We have the backing of a large company and the soul of a startup (a Fortune 500 startup, that is), and this is the place where that flame burns brightest.\n<br><br>\nIn The Fort, we combine forces to deploy disruptive technologies and explore new ways of thinking and working. We get out of the office and into the wild to observe first-hand what our customers most need to accelerate progress for the world. We observe, listen, prototype, experiment, analyze, learn, and iterate with passion and speed to fuel Fortive's growth and build the future. We scout breakthrough ideas and emerging trends from an expansive network stretching from Seattle to Silicon Valley to Shanghai and beyond.\n<br><br>\nThe Fort is built to make growth happen. We start up, we scale up, we shake things up. We face uncertainty head-on and wrestle it to the ground. We fail fast to move our customers forward. We move the needle so much it needs a new gauge. We turn What-if? into What's next? and How might we? into Wow, we did that! If building a data-driven app in a matter of hours or pushing the frontiers of AI or IoT before lunch sounds like your kind of thing, The Fort just might be your kind of place.\n<br><br>\nYour Impact\n<br>\nYou are collaborative, proactive, adaptable, and gritty. You excel at facilitating and reconciling inputs across teams. You balance a passion for deep understanding of innovation with the ability to deliver extraordinary results.\n<br><br>\n<strong>These are the traits we value:</strong>\n<br><br>\nAbility to Deliver Results: A track record for being able to set a vision and strategy, organize and lead a team, and implement to meet and exceed expectations.\n<br>\nEntrepreneurial Attitude: A proactive outlook that provides the chutzpah needed to overcome barriers, creatively problem solve, and challenge conventional thinking.\n<br>\nComfort with Ambiguity: A willingness and aptitude for spending time in and thriving with deep uncertainty and environments where there is no clear right answer.\n<br>\nPassion for Innovation: A demonstrated interest and desire to participate in innovation through personal study, on-the-job initiative, or other endeavors.\n<br>\nPositive Outlook: A desire to look past the challenged in search of the opportunity.\n<br>\nEmpathy &amp; a Teacher's Mindset: The ability to teach and mentor effectively, successfully facilitate teams and different personalities in training sessions, and to care deeply about his/her colleague's growth, understanding, and experience.\n<br>\nBias for Action: A need for speed; demonstrated ability to make decisions quickly and to act upon them.Alongside a team of entrepreneurial, high-performing, curious people, you'll deliver breakthrough solutions to drive sustainable growth for Fortive. As a Data Scientist, you'll drive execution and play a vital role in building a culture of innovation at Fortive. You will build, manage, and inspire alongside a multi-functional team, that solves for our toughest growth challenges.\n<br><br>\n<strong>Data Scientist Responsibilities:</strong>\n<br><br>\nCollaborate with cross-functional stakeholders to understand their business needs, formulate and complete end-to-end analysis that include: data gathering, analysis, scaled deliverables, recommendations and presentations to stakeholders.\n<br>\nContribute to a wide variety of research projects using statistical analysis and modeling.\n<br>\nDevelop and automate reports, iteratively build and prototype dashboards to provide insights at scale, solving for analytical needs.\n<br><br>\n<strong>Required Qualifications:</strong>\n<br>\nBachelor's degree or equivalent practical experience.\n<br>\nWork experience with an emphasis on quantitative research methods (Mathematics, Computer Science, Statistics, Economics or related fields). Experience in statistics and Machine Learning Models, working with statistical packages (R, SAS, Stata, MATLAB, etc.).\n<br>\nExperience in translating analysis results into business recommendations and business questions into an analysis framework.\n<br>\nExperience with creating complex data sets (SQL), data modeling and reporting.\n<br>\n<strong>Preferred Qualifications:</strong>\n<br>\nMaster's or PhD degree.\n<br>\nCoding experience with Java, C++, Python, PHP or similar language.\n<br>\nDeep interest and aptitude in data, metrics, analysis and trends.\n<br>\nApplied knowledge of measurement, statistics and program evaluation.\n<br>\nDistinctive analysis skills and impeccable business judgment.\n<br>\nStrong written and verbal communication skills.\n<br>\nExcellent problem-solving capabilities and critical thinking skills, while demonstrated independence.\n<br><br>\nFortive is a diversified industrial growth company comprised of Professional Instrumentation and Industrial Technologies businesses that are recognized leaders in attractive markets. With 2017 revenues of $6.7 billion, Fortive's well-known brands hold leading positions in field instrumentation, transportation, sensing, product realization, automation and specialty, and franchise distribution.\n<br>\nFortive is headquartered in Everett, Washington and employs a team of more than 26,000 research and development, manufacturing, sales, distribution, service and administrative employees in more than 50 countries around the world. With a culture rooted in continuous improvement, the core of our company's operating model is the Fortive Business System.\n<br>\nFor more information please visit: ***************.\n<br><br>\nFortive Corporate\n<br><br>\nResearch and Development / Scientific\n<br><br>\nNorth America-United States-PA-Pittsburgh\n<br><br>\nFull-time\n<br><br>\n\"The company in which you have expressed employment interest is a subsidiary or affiliate of Fortive Corporation. The subsidiary or affiliate is referred to as a \"\"Fortive Company.\"\" Fortive Corporation and all Fortive Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity or expression, or other characteristics protected by law. The \"\"EEO is the Law\"\" poster is available at: ***************************************************************** Individuals who need a reasonable accommodation because of a disability for any part of the employment process should call 1-************ or e-mail *************************** to request accommodation.\""}