{"job title": "Data Scientist", "company": "FM Global", "city state": "– Norwood, MA", "rating": "3.5", "job description": "FM Global is a leading property insurer of the world's largest businesses, providing more than one-third of FORTUNE 1000-size companies with engineering-based risk management and property insurance solutions. FM Global helps clients maintain continuity in their business operations by drawing upon state-of-the-art loss-prevention engineering and research; risk management skills and support services; tailored risk transfer capabilities; and superior financial strength. To do so, we rely on a dynamic, culturally diverse group of employees, working in more than 100 countries, in a variety of challenging roles.\n<br><br>\nAs a Senior Data Scientist you will work in a high powered environment with a team of creative and innovative individuals to identify, solve and support implementation of current and future business and client needs, as well as research new methodologies and data sets to further the Company’s technical analytics ability.\n<br><br>\nYou will be working on cutting edge issues using unique data only available to FM Global in a very dynamic, exciting and evolving research area. You work will change our business.\n<br><br>\nYou will plan, conduct, and direct the development and evaluation of approved analytics projects or tasks within projects, with minimal or limited supervision. You will work on business critical projects, interact with internal customers and have responsibility for delivering and communicating status and results of your projects.\n<br><br>\nOur projects range from financial decision support and advanced risk analytics to engineering based analytics. We work on short term business critical problems and develop long-term opportunities for FM Global.\n<br><br>\nRequired\n<ul>\n<li>Ph.D. or Master’s degree in Data Science, Statistics, Economics, Econometrics, Operations Research, or other relevant analytics fields</li><li>Deep knowledge in descriptive, predictive and prescriptive analytics</li><li>Experience working with statistical software packages like R, SAS, Python, JMP or SPSS</li><li>Experience with Visualization tools like Tableau or Power BI</li><li>Experience in applying statistical techniques such as regression and classification models, cluster analysis, neural networks, ensembles, random forests</li><li>Highly analytical with strong problem-solving skills</li><li>Strong attention to detail</li><li>Strong verbal and written communication skills</li><li>Desire and ability to work well with others in a team environment</li></ul>\n\n<ul>\n<li>Strongly preferred\n\n<ul>\n<li>Some business experience in analytics</li><li>Experience working across disciplines</li></ul></li>\n<li>A plus\n\n<ul>\n<li>Familiarity with next-generation capabilities, such as artificial intelligence, machine learning, text mining and other technology that will be used to support best-in-class analytics</li><li>General business knowledge related to risk management and/or insurance</li></ul></li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}