{"job title": "Research Scientist", "company": "Food Safety Net Services", "city state": "– San Antonio, TX", "rating": "2.6", "job description": "<strong>JOB SUMMARY</strong>\n<br><br>\nResponsible for supporting analytical laboratory processes including technology, methodology, laboratory proficiency measurements, research, and scientific processes. This position will have routine contact with the company?s client base and will assist with all aspects of the company?s special projects and research initiatives.\n<br><br>\n<strong>ESSENTIAL RESPONSIBILITIES</strong>\n\n<ul>\n\n\t<li>Assist the Special Project Team to deliver high quality and timely research projects including:</li>\n\n<li>Timely customer contact.</li>\n\n<li>Proposal design.</li>\n\n<li>Data analysis and presentation.</li>\n\n<li>Scientific report writing.</li>\n\n<li>Excellent customer service skills and the ability to understand and resolve scientific issues, answer questions and gain customer confidence.</li>\n\n<li>Ability to write scientific and technical proposals, reports, articles and presentations.</li>\n\n<li>Interpret a wide variety of research methods for different food and non-food matrixes to assist with developing projects for customers and internal methods.</li>\n\n<li>Compile data in various analytical formats.</li>\n\n<li>Interpret data and present findings with appropriate documentation, references, and supporting material to the food and other associated industries.</li>\n\n<li>Maintain a high degree of technical competence by reading scientific journals, attending professional workshops, and being aware of food and associated industries regulations, issues and trends.</li>\n\n<li>Assist with the design and implementation of proficiency programs within the laboratory network.</li>\n\n<li>Identify and evaluate new technology to ensure the company offers the latest testing to its customer base.</li>\n\n<li>Assist technical team to coordinate and prepare scientific reports and technical articles.</li>\n\n<li>Work on developing proficient and manageable programs for new business resulting in company growth and profitability.</li>\n\n<li>Willing to support all other departments in the lab as needed based on business demand.</li>\n</ul>\n<strong>SUPERVISORY RESPONSIBILITIES</strong>\n\n<ul>\n\n\t<li>May take the lead role with two or more employees in the department.</li>\n\n<li>Carries out responsibilities in accordance with organization's policies and applicable laws.</li>\n\n<li>Responsibilities may include interviewing, training, directing work, and appraising performance.</li>\n</ul>\n<strong>MINIMUM QUALIFICATIONS</strong>\n<ul>\n\t<li>PhD in Food Microbiology or related field preferred.</li>\t<li>Minimal educational requirement is a Masters in Microbiology/Food Microbiology.</li>\t<li>Working knowledge of aseptic sampling technique, automated lab equipment, and acceptable methods and procedures.</li>\t<li> Familiarity with GMP, AOAC, FDA, BAM, APHA, and Compendium methods and procedures.</li>\t<li>Broad knowledge of concepts, practices, and procedures of a food testing laboratory.</li>\t<li>Or equivalent combination of education and experience.</li>\n</ul>\n<strong>PHYSICAL DEMANDS</strong>\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<ul>\n\t<li>Regularly required to stand, sit, walk, use hands and arms, talk and hear.</li>\t<li>Occasionally lift up to 25 pounds.</li>\t<li>Color vision and depth perception.</li>\n</ul>"}