{"job title": "Data Scientist", "company": "Ford Motor Company", "city state": "– Dearborn, MI", "rating": "3.9", "job description": "Job Description<br><p><strong>Position Overview/Description:</strong><br><br>Data Scientist positions discover and curate new and existing data sources to create solutions for the business. These key positions help bring data to life to solve business problems. At times, the problem is identified by a business unit, frequently wishing to optimize cost, revenue, or improve quality, and at times problems are formulated by the Data Scientists. Solutions are then envisioned that harness internal and external data and through visualizations, predictive analytics, and at time prescriptive methods, provide the ability for users to answer their key questions.<br><br><strong>Responsibilities:</strong> <br> </p><ul><li>Team supports all enterprise units including Business Units and Skill Teams</li><li>Designing visual interface for users to interact with the data; Building visualizations</li><li>Problem formulation and design of solution</li><li>Harvesting of data from multiple systems globally</li><li>Collaborating with Analytics and IT teams to transforming the data for use in modeling and visualizations</li><li>Identify relationships in data to assist in providing insights</li><li>Evaluation of data accuracy, completeness, timeliness and stability to establish repeatable, sustainable processes to maintain</li><li>Working with business on change management, including new process implementations </li></ul> <br><strong>Job Requirements</strong><br><strong>Basic Qualifications</strong>:<br> <ul><li>Bachelors degree</li><li>1+ years of experience with one or more of the following tools: Data Gathering skills/tools (e.g. SQL, Hadoop, Teradata, SAS, Business Objects, etc.) OR Visualization skills/tools (e.g. QlikView, Tableau, WebFocus, etc.)</li></ul> <br><strong>Preferred Qualifications:</strong><br> <ul><li>Masters degree with a strong background in data science</li><li>Strong collaboration and communications skills</li><li>Strong problem formulation and problem solving skills</li><li>Experience communicating findings to make data analysis actionable and understandable by business partners</li><li>Ability to take complex problems and break them down to create an implement an action plan</li><li>Strong understanding of analysis and computational complexity and ability to programmatically solve problems</li><li>Strong capabilities at designing visual interface for data interaction</li></ul><p> <br>The distance between imagination and creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities youd expect from a diverse global leader. Youll become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always to go further.<br><br>Candidates for this position must be legally authorized to work in the United States. Verification of employment eligibility will be required at time of hire. Visa Sponsorship is not available for this position.<br> <br>Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.<br> </p><br><br>"}