{"job title": "Staff Data Scientist", "company": "Foursquare", "city state": "– San Francisco", "rating": "4.3", "job description": "<div>\n<div>\n<div>\n<div>\n<div>\n<div><strong>About Foursquare:</strong>\n<br><br>\nSince our inception in 2009, Foursquare has been a leading force in changing how location information enriches our real-world and digital lives. As a location intelligence company, Foursquare is comprised of two well-known consumer apps, Foursquare and Swarm, as well as thriving media and enterprise products. Our B2B offerings include Places (for developers), Pinpoint and Attribution (for marketers), and Place Insights (for analysts, based on the world's largest foot traffic panel). With more than 200 people across our offices in New York, San Francisco, and in sales offices around the globe, we’re dedicated to our trailblazing mission—enriching consumer experiences and informing business decisions with location intelligence.\n<br><br>\n<strong>About our Engineering Team:</strong>\n<br><br>\nAs a member of Foursquare’s engineering team, we want you to bring experience building real products from the ground up. We're passionate about tackling tough challenges in the location space and look for others who like to dive deep into code and help solve hard problems. You should be comfortable running with your own ideas and eager to learn new skills on a bleeding edge platform. We use a variety of tools, technologies, and languages to build software (Scala, Thrift, MongoDB, Memcached, JS/jQuery, Kafka, Pants, Hadoop, MR, Spark) but experience with equivalent ones will do just fine.\n<br><br>\nJoin us and help bring our feature ideas (and your own!) off the whiteboard and into reality. Here are some high level areas you could help within our NY or SF office:\n<br><br>\n- Improve the accuracy and efficiency of one of the premier Place search APIs in existence. Our API powers Foursquare City Guide and Swarm as well as apps from Microsoft, Uber, Samsung, Twitter and more\n<br><br>\n- Leverage machine learning techniques to build systems which process and derive insights from billions of location data points every day\n<br><br>\n- Launch features that make cities easier to explore and continue to push the Foursquare City Guide and Swarm apps forward\n<br><br>\n- Build resilient services and tooling which drive all of our offline processing of petabytes of data\n<br><br>\n<strong>About the Role:</strong>\n<br><br>\nThe Pilgrim team is responsible for building and maintaining the models that form the foundation of Foursquare’s location intelligence. As a member of this team, you get a chance to enjoy end-to-end ownership of the company’s core location signals and models. You will be responsible for everything from data exploration and initial prototyping to deployment of data driven production code. Our team focuses on delivering both research and results in a collaborative and supportive environment.\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>Masters (preferred PhD degree) in Computer Science or related technical field or equivalent practical experience</li>\n<li>5 years of work or educational experience in Data Science / Machine Learning.</li>\n<li>Proven track record of building and shipping ML pipelines using both supervised and unsupervised learning techniques, classification, and optimization</li>\n<li>Proficiency in statistics</li>\n<li>Experience working with large, complex and diverse data sets from a variety of sources</li>\n<li>Ability to collaborate with a diverse set of engineers and data scientists</li>\n<li>Experience with one or more general purpose programming languages including but not limited to: Java, C/C++, or Scala</li>\n<li>Experience with hadoop, scalding, spark, or similar framework a plus</li>\n</ul>\nFoursquare is proud to foster an inclusive environment that is free from discrimination. We strongly believe in order to build the best products, we need a diversity of perspectives and backgrounds. This leads to a more delightful experience for our users and team members. We value listening to every voice and we encourage everyone to come be a part of building a company and products we love.\n<br><br>\nFoursquare is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected Veteran status, or any other characteristic protected by law.</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<br>"}