{"job title": "Data Analytics Engineer", "company": "Fractal Industries", "city state": "– Reston, VA, United States", "rating": "4.0", "job description": "The <strong>Data Analytics Engineer</strong> designs and develops analytic code, predominantly in Scala (and Spark), Python and/or R as part of a growing multi-disciplinary team of Data Scientists, Engineers, and Solutions Experts with deep domain knowledge working to develop new capabilities and workflows. Responsibilities include:\n<ul>\n<li>Developing analytics for customer applications (ad hoc analysis to production-grade pipelines and workflows)</li><li>Providing mathematical algorithms and implementations to serve the needs of data analysis workflows</li><li>Understanding customer business challenges and sourcing the most appropriate data sets, algorithms, and architectures to solve them quickly and cost-effectively</li><li>Refactor algorithms into production-quality and operational code</li><li>Working collaboratively and interact with client project team members and operational staff to support live customer deployments</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>2+ years of data analytics experience</li><li>Expert knowledge of Scala or Python</li><li>Expert knowledge of SQL</li><li>Experience with agile development</li><li>Adept at learning and applying new technologies and solving new problems</li><li>Interest in data analytic technologies such as Apache Spark, Apache Pig, AWS Pipelines, Google Dataflow and/or MapReduce</li><li>Experience blending analytic and simulation modeling approaches to problem solving</li>\n</ul>\n<strong>Desirable</strong>\n<ul>\n<li>Experience with other functional programming languages including Erlang</li><li>Advanced mathematical modeling skills</li>\n</ul>\n<strong>About Fractal</strong>\n<br><br>\nFractal Industries applies artificial intelligence to solve complex, real-world problems at scale. Our Human+AI operating system, Fractal | OS, blends capabilities ranging from data handling, analytics, and reporting to advanced algorithms, simulations, and machine learning, enabling decisions that are just-in-time, just-in-place, and just-in-context. If this type of environment sounds exciting reach out to us directly via application at https://www.fractalindustries.com/careers with a resume and cover letter.\n<br><br>\nFractal Industries offers a competitive salary, incentive stock options, a full range of benefits starting day one, including 401(k) and medical, dental &amp; vision coverage, flexible Personal Time Off (PTO) plan and 10+ paid holiday days per year\n<br><br>\nInternal Job Title: Data Analytics Engineer"}