{"job title": "Sr. Oncology Scientist", "company": "Frederick National Laboratory for Cancer Research", "city state": "– Bethesda, Maryland", "rating": "NA", "job description": "The Advanced Biomedical Computational Science(ABCS) is a part of the Biomedical Informatics and Data Science Program at Leidos Biomedical Research, Inc. The ABCS provides technology development, scientific consultation, collaboration and training, and high-performance computing support to the NCI and NIH scientists and staff. This position will reside within the Laboratory of Pathology (LP) at the National Cancer Institute (NCI), an integral component of the research and clinical community at the National Institutes of Health (NIH). The mission of the Laboratory of Pathology is to achieve the highest level of quality in research, diagnostics, and education. The LP is building a program to provide genomic sequencing to investigators with clinical samples in a Clinical Laboratory Improvement Amendments (CLIA) certified environment. The program is designed to provide multiple levels of clinical and research Omics analyses to study patient tumors.\n<br><br>\n<strong>KEY ROLES/RESPONSIBILITIES</strong>\n<br><br>\nSr. Principal Scientist\n\n<ul>\n <li>Help define research priorities regarding the discovery of biomarkers of cancer</li> <li>Develop, implement and lead experimental and clinical study designs and patient stratification strategies</li> <li>Optimize DNA, RNA extraction methods from tumor and normal tissues</li> <li>Optimize Next Generation Sequencing techniques; develop and troubleshoot novel analytical methods</li> <li>Analyze and interpret clinical and genomic data generated within the laboratory, and in the literature, and develop follow-on testable hypotheses</li> <li>Keep detailed documentation of scientific plans, experiment data and follow-on analyses and interpretation, according to CLIA standards</li> <li>Track clinical specimens, verify presence of correct content and associated paperwork, and enter specimen-tracking information in a Laboratory Information Management System (LIMS) that is maintained in the laboratory</li> <li>Provide regular presentations to laboratory supervisor and team on progress, plans and issues; participate in weekly laboratory meetings</li> <li>Lead, coordinate and contribute to the publication of findings in peer-reviewed journals</li> <li>Be able to represent the clinomics project in external collaborations and scientific conferences</li> <li>Evaluate and make recommendations on technology platforms, software and vendors in the area of clinical genomics</li> <li>Supervise and mentor junior team members</li> <li>Work collaboratively with team members, especially in ensuring seamless hand-over of responsibilities when planning to be away</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS</strong>\n\n<ul>\n <li>Possession of a PhD degree from an accredited college or university according to the Council for Higher Education Accreditation in a scientific discipline such as oncology or biology or similar field. (Additional qualifying experience may be substituted for the required education). Foreign degrees must be evaluated for U.S. equivalency.</li> <li>In addition to the education requirements, a minimum of ten (10) years of experience in a molecular diagnostic laboratory in an academic, commercial or government setting including five (5) years of independent, competent and innovative research in a field of specialty.</li> <li>Five (5) or more years of managerial experience.</li> <li>Experience and understanding of cancer biology and genomic analysis of tumors using NGS technologies</li> <li>At least four years of experience in next-generation sequencing knowledge and experience</li> <li>Experience in molecular biology techniques: DNA, RNA isolation and quantification, electrophoresis, spectrophotometry, PCR, real-time PCR, DNA cloning techniques</li> <li>Ability to operate, calibrate and maintain sophisticated laboratory equipment such as NGS sequencers and associated equipment</li> <li>Ability to use LIMS and web-based databases; knowledge of Excel</li> <li>Ability to be organized and keep detailed and accurate documentation</li> <li>Ability to communicate (oral and written) effectively within a multidisciplinary team</li> <li>Must be able to obtain and maintain a clearance.</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS</strong>\n\n<ul>\n <li>Prior work in a CLIA/clinical setting</li> <li>Management or team supervisory experience</li>\n</ul>\n\nEqual Opportunity Employer (EOE)\n<br>\nMinority/Female/Disabled/Veteran (M/F/D/V)\n<br>\nDrug Free Workplace (DFW)"}