{"job title": "Data Scientist - Quantitative Analytics Professional", "company": "Freddie Mac", "city state": "– Mclean, VA", "rating": "3.8", "job description": "The Model Audit and Data Analytics (MDA) team in Internal Audit is seeking a Data Scientist/Quantitative Analytics Professional. The position is responsible for supporting the Internal Audit Division in identifying key risks and performing data analysis using data mining and visualization techniques that allow for an in-depth review of business processes, performance, and risk metrics. This role will also contribute to ad hoc data analysis to support business analytics in audits designed to determine whether risk management processes related to critical business processes and corporate quantitative models are adequate and functioning effectively.\n<br><br>\nWe are looking for a Data Scientist/Quantitative Analytics Professional who will focus on identifying key risks and performing data analysis using data mining and visualization techniques that allow for an in-depth review of business processes, performance, and risk metrics.\n<br><br>\nWe are looking for a Data Scientist/Quantitative Analytics Professional who will focus on identifying key risks and performing data analysis using data mining and visualization techniques that allow for an in-depth review of business processes, performance, and risk metrics.\n<br><br>\nYour Work Falls Into These Primary Categories:\n<br><br>\nAudit\n\n\n<ul>\n<li>Conducting audit reviews of the organization's financial and operational processes</li>\n<li>Meeting with process owners for understanding key risks, controls, systems, and data sources</li>\n<li>Supporting team in defining potential audit procedures</li>\n<li>Performing data analysis in support of internal audit procedures</li>\n</ul>\n\nData Mining\n\n\n<ul>\n<li>Extract, combine and validate structured and unstructured data from various sources, such as RDBMS (Oracle, DB2, Postgres), flat files, SAS data sets, XML, MS Office files and Hadoop</li>\n<li>Apply quantitative methods to investigate and answer business questions related to risk management</li>\n<li>Apply statistics and machine learning methods to uncover meaningful patterns and insights in data</li>\n<li>Develop and maintain reproducible code for business analytics in R and Python</li>\n<li>Communicate business analytics findings with interactive data visualizations</li>\n</ul>\n\nAnalytic Procedures and Documentation\n\n\n<ul>\n<li>Documenting the results of analytic procedures in a narrative format that is easy to understand for non-technical consumers</li>\n<li>Preparing well written and convincing documentation and audit reports</li>\n<li>Coaching team members in both technical analytic skills and general audit execution</li>\n<li>Bachelor's degree in Data Analytics (Data Science), Computer Science, Finance, Accounting or related study; Advanced degree is preferred</li>\n<li>Typically has 2 to 4+ years of experience performing data analysis using data analytics tools like SAS, SQL, R, Python and/or Matlab</li>\n<li>Coursework or work experience applying predictive modeling techniques from finance, statistics, mathematics, data science, and computer programming to large data sets. Qualifying coursework may include--but is not limited to-statistics, mathematical programming, optimization, machine learning, computational methods, design and analysis of algorithms, Bayesian methods, derivatives, and Monte Carlo methods/modeling.</li>\n<li>Experience using version control solutions for collaborative code development (e.g., github)</li>\n<li>Experience telling stories with advanced interactive data visualizations (ggplot, matplotlib, seaborn, bokeh, plotly, d3.js, etc.)</li>\n</ul>\n\nTop 3 Personal Competencies to Possess\n\n\n<ul>\n<li>Leadership - Primary focus of building something of significance. Willingness to roll up sleeves and do whatever it takes.</li>\n<li>Seek and Embrace Change - Continuously improve work processes rather than accepting the status quo</li>\n<li>Growth and Development - Know or learn what is needed to deliver results</li>\n<li>An analytical mind that enjoys working and reasoning with data.</li>\n<li>Good programming skills in Python, SQL, R, SAS. Additional experience with Unix scripts, Java, C++, MATLAB a plus.</li>\n<li>A spirit that enjoys applying innovation to business problems, combined with strong execution (owns assignments and delivers in a cross-functional setting.)</li>\n<li>Solid oral and written communication skills. Ability to pitch and storyboard a project.</li>\n<li>CIA, CPA, CISA certifications or interest in obtaining a certification in one of these disciplines</li>\n</ul>\n\nToday, Freddie Mac makes home possible for one in four home borrowers and is one of the largest sources of financing for multifamily housing. Join our smart, creative and dedicated team and you'll do important work for the housing finance system and make a difference in the lives of others. Freddie Mac is an equal opportunity and top diversity employer. EOE, M/F/D/V."}