{"job title": "Senior Data Scientist", "company": "Freddie Mac", "city state": "– Mc Lean, VA", "rating": "3.8", "job description": "<div>The Model Audit and Data Analytics (MDA) team in Internal Audit is seeking a Data Scientist/Quantitative Analytics Senior. The position is responsible for supporting the Internal Audit Division in developing business analytics tools and data products that enable audit teams to efficiently plan and execute risk based projects that require advanced analytics. The position will also provide ad hoc data analysis to support business analytics in audits designed to determine whether risk management processes related to critical business processes and corporate quantitative models are adequate and functioning effectively.\n<br><br>\nThe MDA team is seeking a Data Scientist/Quantitative Analytics Senior who has a diverse skillset to be able to conduct projects that are both model-oriented and data-oriented. Model audits are chosen by risks (high or emerging) and require in-depth knowledge of the methodology and limitations. Data-oriented projects require expertise in translating business requirements into production level data products which provide users with value adding features and functionality to support business analytics. This role will work with a team responsible for generating reports and data products that tell the story of the data concisely for senior level management to consume.\n<br><br>\nYour Work Falls into These Primary Categories:\n<br><br>\nDevelopment of Business Analytics\n<br><br>\n? Develops business analytics workflows in R and Python\n<br>\n? Collaborate with Internal Audit Business Audit teams to scope out data product details\n<br>\n? Contribute to building business analytics tools and data products using R Shiny or Python Dash frameworks\n<br>\n? Research and implement machine learning algorithms applicable for advanced business analytics in a risk management context\n<br>\n? Share new methods and advanced analytics processes for risk management in open forums within the organization (e.g., wiki posts, internal presentations, and seminars)\n<br><br>\nArticulate Findings\n<br><br>\n? Works with a team of quants, economists, data analysts and external consultants to execute audit programs and to document work papers and reports consistent with industry practices.\n<br>\n? Documents audit work papers, conducts fieldwork, and supports the Supervisor, Manager, or Director in drafting audit and advisory reports.\n<br>\n? Challenges data quality assessments and suggests more efficient alternatives.\n<br>\n? Evaluates management?s compliance with model policies, standards, and model development procedures.\n<br>\n? Executes audits, audit finding follow-up activities, or advisory projects on demand</div><br>\n<div>? Doctorate degree (or Master's degree with equivalent work experience) in quantitative finance, statistics, economics, computer science, data science, or a related quantitative field.\n<br>\n? Coursework or work experience applying predictive modeling techniques from finance, statistics, mathematics, data science, and computer programming to large data sets. Qualifying coursework may include--but is not limited to?statistics, mathematical programming, optimization, machine learning, computational methods, design and analysis of algorithms, Bayesian methods, derivatives, and Monte Carlo methods/modeling.\n<br>\n? Experience developing production-grade data oriented applications in R Shiny, Python Dash, or Javascript\n<br>\n? Experience using version control solutions for collaborative code development (e.g., github)\n<br>\n? Experience telling stories with advanced interactive data visualizations (ggplot, matplotlib, seaborn, bokeh, plotly, d3.js, etc.)\n<br>\n? Coursework or work experience writing statistical and/or optimization programs to develop models and algorithms. Programming languages may include--but are not limited to--Python, R, SQL, Java, SAS, and MATLAB.\n<br><br>\nKey to Success in This Role\n<br><br>\n? Ability to communicate and convey the insights of data analysis to both technical and non-technical audiences is pivotal for this role.\n<br>\n? Solid oral and written communication skills. Ability to pitch and storyboard a project.\n<br>\n? Exceptional quantitative, empirical analysis, and research skills\n<br><br>\nTop 3 Personal Competencies to Possess\n<br><br>\n? Leadership - Primary focus of building something of significance. Willingness to roll up sleeves.\n<br>\n? Seek and Embrace Change ? Continuously improve work processes rather than accepting the status quo\n<br>\n? Growth and Development ? Know or learn what is needed to deliver results and successfully compete</div><br>\n<div>? Experience working with large data sets and distributed computing frameworks (Spark, H20)\n<br>\n? Strong knowledge of econometric models, tools and techniques\n<br>\n? Familiarity with a range of machine learning techniques and capabilities\n<br>\n? Good communication, interpersonal, and leadership skills\n<br>\n? Familiarity with the Agile product development methodology\n<br>\n? CIA, CPA, CISA certifications or interest in obtaining a certification in one of these disciplines</div><br>\n<div>Today, Freddie Mac makes home possible for one in four home borrowers and is one of the largest sources of financing for multifamily housing. Join our smart, creative and dedicated team and you?ll do important work for the housing finance system and make a difference in the lives of others. Freddie Mac is an equal opportunity and top diversity employer. EOE, M/F/D/V.</div>"}