{"job title": "ASSOCIATE SCIENTIST", "company": "Fresenius Kabi USA", "city state": "– Melrose Park", "rating": "2.4", "job description": "<strong>ASSOCIATE SCIENTIST (MP01243)</strong><br>\n\n<div>\n<div>\nJob Number\n<br>\nMELROSE PARK01243</div><br>\n\n<div>\nArea of Interest\n<br>\nMANUFACTURING OPERATIONS</div><br>\n\n<div>\nCountry\n<br>\nUnited States</div><br>\n\n<div>\nState/Province\n<br>\nIllinois</div><br>\n\n<div>\nCity\n<br>\nMelrose Park</div>\n</div><br>\n\n<div>\n<div>\nCompany Overview<br><br><strong>About Fresenius Kabi</strong>\n<br><br>\nFresenius Kabi is a global health care company that specializes in lifesaving medicines and medical technologies for infusion, transfusion and clinical nutrition. Our expansive portfolio of products and global network of science and manufacturing centers provide essential support for the care of critical and chronically ill patients. We are part of Fresenius SE, a health care group with more than 100 years of experience in pharmaceuticals, medical devices and life sciences. Our employees – more than 30,000 worldwide – develop and deliver injectable pharmaceuticals and infusion systems; blood collection, transfusion and cell technologies; and essential nutrients for parenteral nutrition.\n<br><br>\nWhether you work for us, buy from us, partner with us, or invest in us, you will come to know that caring is at the core of everything we do. Our purpose is to put lifesaving medicines and technologies in the hands of people who care for patients, and to find answers to the challenges they face every day.</div><br>\n\n<div>\nJob Summary\n<br>\nResponsible for performing routine testing of in-process and finished product samples. Monitors environmental conditions in the production and lab areas. Summarizes environmental monitoring and product test results. Provides project support to Scientist and Lead Scientist. Prepares media and reagents and equipment.</div><br>\n\n<div>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Generates new standard operating procedures for microbiology test procedures. Keeps others current as assigned.</li>\n<li>Performs environmental monitoring for Skan isolators and routine testing of in-process and finished products.</li>\n<li>Assists Scientist / Lead Scientist with test method validations and special projects. Carries out special projects independently as required and assigned by supervision.</li>\n<li>Assists with plant equipment requalifications as directed.</li> \n\n<li>Monitors and tracks microbiological test results. Must be able to understand and follow company’s good documentation requirements.</li> \n\n<li>Conducts weekly summaries of test results for trend analysis.</li>\n<li>Promptly reports data discrepancies and out of limits conditions to supervision. Carries out documentation, investigation, author incident reports, and conducts corrective actions as assigned.</li>\n<li>Assists in training new departmental personnel in standard operating procedures.</li> \n\n<li>Keeps supervisory personnel informed of all relevant events impacting the operations and performance of the department.</li>\n<li>Maintains knowledge of cGMP’s and GLP’s.</li>\n<li>Follow safety requirements, maintain good housekeeping of lab areas, order lab supplies to maintain inventory and prepare test media and reagents as assigned.</li>\n</ul>\n\n</div><br>\n\n<div>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor of Science degree in biological sciences with 1-2 years of progressive pharmaceutical lab experience preferred or equivalent education and experience.</li> \n\n<li>Excellent verbal and written communication skills are essential.</li>\n<li>Planning and organizational skills necessary for primary responsibilities.</li>\n<li>Must successfully execute requirements to achieve ISO 5 environment gown certification as required by supervision.</li>\n</ul>\n\n</div><br>\n\n<div>\nAdditional Information<br><br>We offer an excellent salary and benefits package including medical, dental and vision coverage, as well as life insurance, disability, and 401K with company match.\n<br><br>\nFresenius Kabi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disabilities, or protected veteran status.</div>\n</div>\n\n<br>"}