{"job title": "Senior Data Scientist, Customer Analytics", "company": "Funding Circle US", "city state": "– San Francisco, CA, United States", "rating": "3.8", "job description": "Funding Circles US Customer Analytics team is looking to add an enthusiastic, analytical problem solver and visionary to support the exponential growth in Small Business Lending at an exciting time for our company. This is a strategic role that sits at the heart of value creation utilizing leading edge analytics and turning data into long term competitive advantages. If working in a rigid and slow business is not interesting to you then this role could be great for you.\n<br><br>\nOur Analysts/Data Scientists obsess over complex data, extract meaningful consumer and business insights as well as demonstrating advanced modelling techniques build actionable strategies that will elevate business performance. Partners with cross functional teams including but not limited to Marketing, Risk, Investor Management, Operations and product/technology to achieve business goals. This role provides the opportunity to craft the business direction in various aspects like acquisition analytics, customer engagement, funnel optimization, pricing, investor analytics, etc.\n<br><br>\nThe position will be based out of San Francisco CA and will present opportunity to work on portfolios across geographies UK, US and Continental Europe.<br><br><strong>Birds-eye view of the role:</strong>\n\n<ul>\n<li>Understands business needs and defines analytical frameworks to facilitate problem-solving, while setting best practices that can be translated globally</li><li>Recommends optimal business strategies based on historical performance, predictive analytics and scenario analysis</li><li>Understands customer motivations and develops actionable segmentation models</li><li>Can find and apply the robust statistical techniques to improve A/B testing from test design to analyzing results. Comfortable working with limited data at times and using judgement</li><li>Can identify the best modelling techniques (such as machine learning, regression, tree-based) to solve business problems and can partner with tech team to implement these algorithms into production environments</li><li>Effective in working with partners outside of the team to identify hypotheses, structure analysis, recommend solutions and communicate results</li><li>Desire to learn from others and a desire to bring something new to the team so we can learn from you too!</li>\n</ul>\n\n<strong>Qualifications &amp; Skills:\n<br>\n</strong>\n\n<ul>\n<li>Bachelors degree in quantitative/finance related field required</li><li>2-5 years* of experience in business optimization driven through data</li><li>Proficient with analytical tools like R, SQL, Python</li><li>Proven problem-solving skills using logical reasoning and analytical methods</li><li>Excellent ability to translate complex problems into clear and simple stories</li><li>Open minded, collaborative, great to interact with</li><li>Identification with our Mission, To build a better financial world</li><li>Alignment with our Core Values: Think Smart, Make It Happen, Be Open, Stand Together, Live The Adventure</li><li>The stated experience level is a guide and does not preclude applications from people with more or less experience, provided the requisite skills can be demonstrated</li>\n</ul>\n\n<strong>Bonus points for:\n<br>\n</strong>\n\n<ul>\n<li>Digital marketing analytics and funnel optimization experience</li><li>Consumer/Commercial Lending experience</li>\n</ul>\n<strong>Why Join Us?</strong>\n<br><br>\nHappy employees are productive employees, thats why we offer a hearty benefits package. From learning and development and commuter stipends, to a competitive salary, equity, and health benefits, weve got you covered! That being said, have you heard about what we're doing?! Our mission is what really motivates us to come to work each day:\n<ul>\n<li>We're supporting small business, the engine of economic growth.</li><li>We're helping facilitate higher yields for investors and lower interest rates for borrowers.</li><li>We can fund loans extremely quickly, all online!</li><li>We have a clear competitive advantage globally in areas like domain expertise and regulatory processes.</li>\n</ul>\nTo learn more about our work environment, culture, and perks, visit:\n<ul>\n<li><strong>https://www.fundingcircle.com/us/careers</strong></li>\n</ul>\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Funding Circle provides equal employment opportunity to all individuals regardless of their race, age, creed, color, religion, national origin or ancestry, sex, gender, disability, veteran status, genetic information, sexual orientation, gender identity or expression, pregnancy, or any other characteristic protected by state, federal or local law.\n<br><br>\n#LI-SC1\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}