{"job title": "Data Science", "company": "Fuscoe Engineering", "city state": "– Irvine, CA", "rating": "4.8", "job description": "<p><strong>Fuscoe Engineering, Inc. </strong>provides its employees with opportunities for growth and advancement in an environment that inspires team spirit and lifelong learning. As an employee of Fuscoe you will enjoy the transparent management philosophy and the culture we have developed. We recognize our employees for outstanding efforts, professional and personal achievements. Do you embody our <strong>core values of</strong> <strong><em>trust, respect, quality, service and innovation</em></strong>? If you share our values and ideals and you are motivated to make remarkable places for people to live, work and play, then look no further!</p>\n<p><strong>Fuscoe Engineering, Inc.</strong> specializes in civil engineering, water quality management and land surveying. We strive to develop cutting edge tools and practices in order to provide excellent service to our amazing clients.</p>\n<p>We are proud to say that Fuscoe has earned the distinction of being ranked as of one of the <em>OC Register’s Top Workplaces in Orange County</em>. We have also been named one of the <em>Best Places to Work by CE News Magazine</em>.</p>\n<p>We are currently seeking a <strong>Data Science Technician</strong> for our <strong>Irvine</strong> office. Put your passion for technology and Artificial Intelligence to work by joining a cutting-edge engineering firm with a wide variety of exciting projects.</p>\n<p><strong>KEY RESPONSIBILITIES</strong></p>\n<ul>\n<li>Learn, understand and select A.I. resources for company use including Microsoft, Google Cloud, Apple Core ML, Amazon AWS and IBM Watson.</li>\n<li>Collaborate with Technology Group to identify, adopt and develop useful A.I. tools and outcomes.</li>\n<li>Apply Machine Learning in practical applications plus refine and expand A.I. tools and outcomes to client and project needs.</li>\n</ul>\n<p><strong>EDUCATION, EXPERIENCE &amp; KNOWLEDGE</strong></p>\n<p>Bachelor's degree in Computer Science or equivalent plus a minimum of two years of experience with Artificial Intelligence such as DevOps engineering, big data processing or multiple program languages/technologies. Experience working with machine learning (particularly Tensorflow machine learning), information retrieval, image recognition and analytics and familiarity with C++, Python, C# and other programming languages. Willingness to help the team explore, screen, adapt, deploy and refine A.I. tools for clients and projects.</p>\n<p><strong>BENEFITS</strong></p>\n<ul>\n<li>ESOP</li>\n<li>401(k) with match</li>\n<li>Discretionary Bonus Program</li>\n<li>Medical, dental, vision &amp; chiropractic</li>\n<li>Life/AD&amp;D coverage</li>\n<li>Long Term Disability</li>\n<li>Medical/Dependent Care FSA</li>\n<li>AFLAC</li>\n<li>Legal Shield</li>\n<li>Professional Development support</li>\n<li>Volunteer opportunities</li>\n<li>Vacation, sick and holidays</li>\n</ul>\n<p>For more information about our firm, please visit our website at: www.fuscoe.com/team/#jobs</p>\n<br>"}