{"job title": "Principal Scientist", "company": "GAF Buildings Materials Corp. of America", "city state": "– Parsippany, NJ", "rating": "3.4", "job description": "Come Build Your Career Under OUR Roof\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nWe are looking for a Principal Scientist to join our R&amp;D team in Parsippany, NJ. The person in this role will have the challenging opportunity to develop new products for the residential roofing market. The successful candidate will be a productive hands-on, self-directed scientist with exceptional capabilities to deliver on technical and commercial requirements.\n<br><br>\nSpecific responsibilities and competencies include, but are not limited to:\n\n\n<ul>\n<li>Work with various functional groups including Marketing, Sales, Manufacturing, Purchasing as well as other R&amp;D scientists to drive innovation and guide research project activities.</li>\n<li>Lead the organizations' development of key residential roofing product initiatives from concept, design, testing, manufacturing and codes approvals to product launch.</li>\n<li>Work closely with partner companies and key raw material suppliers to advance the development of products or processes.</li>\n<li>Successfully use advanced material characterization techniques to establish structure property relationships of materials and final product performance. This includes the use of techniques such as FTIR, ICP, Chromotagraphy, DMA, DSC and Rheometry.</li>\n<li>Establish correlations with the analytical data to the performance and durability of the finished product in order to reduce development time, establish quantitative performance benchmarks, and assure that products &amp; systems will meet building code body and internal performance standards.</li>\n<li>Ability to represent GAF and lead technical committees at key industry meetings and technical conferences.</li>\n<li>Manage technical business support for current products including raw material qualification, benchmarking of competitive materials and product/system testing at external laboratories.</li>\n<li>Publish technical reports and conduct presentations on key projects regularly.</li>\n<li>Effectively coordinate and manage technicians in support of several simultaneous research programs.</li>\n<li>Excellent planning, organizational and documentation skills coupled with effective teamwork and communication skills.</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>A minimum of a Masters in Polymer/Material Science or Engineering discipline is strongly preferred as well as 7-10 year's industrial product development experience skills.</li>\n<li>The incumbent is recognized within the company as a key and critical contributor providing strategic technical direction for major projects in their area. They are expected to provide some guidance to other technical areas beyond Steep Slope. The individual is the company expert for a key product/process, making major product line extensions or major process changes. Develops significant new products to provide for long term business impact and growth.</li>\n<li>Identifies and takes initiative to lead continuous improvement efforts.</li>\n<li>Adds new product lines to existing platforms.</li>\n<li>Contributions are patentable/trade secrets. Develops and utilizes new to the company materials and processes.</li>\n<li>Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results.</li>\n<li>Provides technical direction for major projects and programs that impact a key product area and technology advancement.</li>\n<li>Required to work with key operations and marketing people to determine tactical objectives.</li>\n<li>Self-directed within broad parameters; initiates projects within area of expertise, with approvals from other functional areas Required to present project justifications to senior R&amp;D management and to other functions.</li>\n<li>May participate and present in external organizations and represent GAF.</li>\n</ul>\n\nGAF is proud to be an Equal Opportunity Employer.\n<br><br>\nWe believe our employees are our greatest resource. We offer competitive salary, benefits, 401k, and vacation packages for all full time permanent positions. We are proud to be an equal opportunity workplace and GAF, SGI, and Siplast are proud to be affirmative action employers. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need that requires accommodation, please let us know. If applying for positions in the U.S., must be eligible to work in the U.S. without need for employer sponsored visa (work permit)."}