{"job title": "Data Science Analyst", "company": "Gaia, Inc.", "city state": "– Denver, CO", "rating": "3.1", "job description": "As a data science analyst your role is critical in leveraging the potential of our data in order to address the important questions in the business. You will use data to uncover insights, make recommendations, validate hypotheses, and tell compelling stories. You will work closely with domain experts across the company to apply data analytics across all areas of the business. You will also collaborate with the other data scientists, data engineers, and data analysts to form best practices, brainstorm methodologies, and share learnings. You are self-motivated, ambitious and come to work with a great attitude every day. You live to make information accessible, understandable and beautiful for those who need it!\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nAnalyze our rich supply of user engagement and acquisition data in order to: form, prioritize, and validate business impacting hypotheses\n<br><br>\nPerform the statistical analysis needed to conduct A/B tests on new product features and user communications\n<br><br>\nDesign and build interactive dashboards and executive reports for non-technical stakeholders across the company\n<br><br>\nBuild predictive models to help understand and impact the business biggest problems, such as:\n<br><br>\n? User retention (Churn)\n<br><br>\n? User lifetime value (LTV)\n<br><br>\n? User acquisition cost (CPA/CAC)\n<br><br>\nEvangelize the proper use of data and data-driven decisions across the company\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelors degree in statistics, math, a quantitative-focused social science, or other related discipline</li>\n<li>2+ years of experience munging data, conducting statistical analysis, and training predictive models</li>\n<li>Proficiency with a statistical programming language, preferably Python or R</li>\n<li>Familiarity with both parametric and non-parametric hypothesis testing</li>\n<li>Excellent analytical, problem-solving, and communication skills</li>\n<li>The ability to gather stakeholder requirements and translate them into tangible next steps</li>\n<li>Must be able to work in our office in Louisville, Colorado</li>\n<li>US citizenship or an existing work visa is required</li>\n<li>Non-smoker</li>\n</ul>\n\n<strong>Nice to haves:</strong>\n<br><br>\n? Experience with experimental design and causal inference\n<br><br>\n? Experience using distributed big data tools like Hive, Presto and Spark\n<br><br>\n? Experience with BI tools like Domo, Tableau, or Looker\n<br><br>\n? Comfort communicating technical topics to executive audiences\n<br><br>\n? Familiarity with Gaias content\n<br><br>\nAbout Gaia\n<br><br>\nGaia exists as a transformational network to support a conscious global community. If we can connect our members to stories, people, and ideas that educate, inspire, and empower them to live mindfully, we believe collective consciousness will evolve.\n<br><br>\nGaia (Nasdaq: GAIA) is a publicly traded company in Louisville, Colorado. We offer global video streaming of over 8,000 original shows, films, documentaries, and practices for conscious living. Our vast video library serves as a vessel for the community we seek to empower. We are not a subscription service that streams whatever pays our bills. Our content goes deep into select niches of Transformation, Seeking Truth, and Yoga channels you see on Gaia.com. We love to embrace and fearlessly cover subjects that other media companies wont touch.\n<br><br>\nBefore you apply, we encourage you to sign up and explore conscious living with Gaia's library of original shows, documentaries, and films. Feed your curiosity with ancient wisdom, coverups, and the paranormal, or discover new alternative health, yoga, and meditation practices. If our work resonates, you might just be a good fit for Gaia.\n<br><br>\nWe seek to hire and inspire employees who embrace our mission for a global conscious community, who hope their work empowers our community of inspired members to be catalysts of transformation. The best work we do every day is to remember our vision is to empower the evolution of consciousness.\n<br><br>\nThe perks of working collaboratively with a team dedicated to sharing this mission include an on-site gym and complimentary yoga and fitness classes; a beautiful solar-powered campus, complete with hiking and running trails, community garden, and a labyrinth; and an on-site, mostly organic café that serves breakfast and lunch daily including a full-service espresso bar featuring locally roasted coffee.\n<br><br>\nFull-time employees are offered alternative and traditional medical benefits including preventative coverage; as well as dental, vision, 401K, and life insurance."}