{"job title": "Data Scientist", "company": "Gannett", "city state": "– McLean, VA", "rating": "2.6", "job description": "<div><div><div><div><div>Do you want to use data to transform a media organization? Gannett is seeking a Data Scientist with a strong blend of analytical and technical skills to develop data-driven insights that will guide strategies and decisions within Gannett’s B2B businesses, which include over 80 community newspapers and websites.\n<br><br>\nYou will help build a holistic understanding of our customers by integrating both structured and unstructured data ranging from ad logs to content. You understand the technicalities of data but can also explain your findings in layman’s terms. You understand that business questions are often not well-defined but will proactively help stakeholders get to a data solution. You have an inquisitive mind and sound judgement when it comes to distinguishing signal from noise. You can talk to data but also gets along well with people.\n<br><br>\n<strong>The ideal candidate:</strong>\n<br><br>\nHas a passion for understanding data, with strong knowledge in at least one of the following: machine learning, data mining, statistical modeling, data visualization.\n<br><br>\nIs able to generate actionable insights by quickly formulating and testing hypotheses in large datasets using techniques like regression, ensembling, classification etc.\n<br><br>\nIs solution oriented, with an ability to collaborate cross functionally and with regional and national sales and marketing teams to identify and address their pain points.\n<br><br>\nCan work autonomously and deliver timely results in a highly-organized manner.\n<br><br>\nProactively innovates in both presentation and approach to make end products engaging and user-friendly.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n\n\t\n<li>\n Maintain and enhance current models and tools for Sales and Marketing teams.</li>\n\n<li>\n Evaluate, understand and process large data sets from multiple internal and 3rd party data sources.</li>\n\n<li>\n Consult with regional and nationwide teams to understand business needs.</li>\n\n<li>\n Utilize analytics to develop new insights and identify new Sales and Marketing opportunities.</li>\n\n<li>\n Measure, test and learn to deliver increasingly valuable, repeatable and scalable analytic solutions.</li> \n\n\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n\n\t\n<li>\n BA/BS in a quantitative field (computer science, economics, math, statistics, engineering) degree is required.</li>\n\n<li>\n MA/PhD with emphasis on data mining, or Bachelors plus 3-5 years of relevant experience preferred.</li>\n\n<li>\n Excellent analytical, quantitative and statistical problem solving skills.</li>\n\n<li>\n Excellent oral and written communication skills.</li>\n\n<li>\n Experience using tools such as Python, R, and/or SAS. Extensive experience with SQL a plus.</li>\n\n<li>\n Familiarity with Hadoop, Hive, Spark and AWS a plus.</li> \n\n\n</ul>\n\n</div>\n</div><br>\n\n <div>\n<div>\n<div>Data Strategy</div>\n<br>\n\t<div>Strategy</div>\n<br>\n\t<div>Salary</div>\n<br>\n\t<div>Monday, July 16, 2018</div><br>\n\n\t<div>McLean, VA, USA</div></div>\n </div><br>\n\n<div>\nApply Now\n<br>\n See all jobs</div>\n </div>\n</div>\n</div>\n\n<br>"}