{"job title": "Operations Research Scientist", "company": "GE Aviation", "city state": "– Austin, TX, US", "rating": "3.7", "job description": "<strong>Role Summary:</strong> \n<br>\nOperations Research position working in dynamic, multi-disciplinary team to develop optimization solutions for the aviation industry. The position requires innovative and resourceful individuals to collaborate on the conception, design, implementation and maintenance of optimization algorithms. Applicant should have demonstrable expertise in data modeling and analysis, large-scale linear and integer programming, meta-heuristic solution design, and developing efficient optimization algorithms\n<br><br>\n<strong>Essential Responsibilities:</strong>\n<li>Provide expertise within multi-disciplinary team of professionals to solve difficult industrial problems\n\n</li><li> Interface with stakeholders to identify relevant industry problems\n\n</li><li> Analyze industry problems\n\n</li><li> Evaluate available data and existing methodologies\n\n</li><li> Propose efficient solution methodologies\n\n</li><li> Participate in implementation, test and evaluation of solution methodologies\n\n</li><li> Support and lead in the ongoing evolution and maintenance of solution methodologies\n<br><br>\n<strong>Qualifications/Requirements:</strong><br><br>Basic Qualifications:\n\n</li><li>Bachelors degree in a quantitative field such as Operations Research, Industrial Engineering, Applied Mathematics, Computer Science or related Engineering degree\n\n</li><li> Minimum of 5 years of experience in Software Development OR Masters with 3 years of experience in Software Development OR PhD with 0 - 3 years experience<br><br>Eligibility Requirements:\n\n</li><li> Legal authorization to work in the U.S. is required. We will not sponsor individuals for employment visas, now or in the future, for this job\n<br><br>\n<strong>Desired Characteristics:</strong>\n</li><li> Advanced degree in a quantitative field such as Operations Research, Industrial Engineering, Applied Mathematics, Computer Science or related Engineering degree\n<br>\nAirline operations experience.\n\n</li><li> 3 years building models and developing algorithms for mathematical programming\n\n</li><li> 3 years researching and building optimization-based solutions\n\n</li><li> 1 - 2 years object-oriented programming (C++ preferred, including STL)\n\n</li><li> 2+ years utilizing Microsoft Visual Studio, IBM CPLEX and/or FICO DASH EXPRESS, and software engineering profiling and memory management tools\n\n</li><li> Some experience in multi-process, multi-threaded optimization implementations<br><br>#DTR<br><br>#LI-PB1\n<br><br>\n<strong>About Us:</strong><br><br>GE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry.\n<br>\nGE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n<br><br>\n<strong>Locations:</strong>  United States; Texas; Austin<br><br>GE will only employ those who are legally authorized to work in the United States for this opening.</li>"}