{"job title": "Staff Data Engineer", "company": "GE Healthcare", "city state": "– San Ramon", "rating": "3.6", "job description": "<strong>Role Summary:</strong> \n<br>\nWe are looking for a Staff Data Engineer to assist build deep learning algorithms using imaging and non-imaging data. This individual will interface with internal GE software and data science teams to deliver high quality software in a fast paced, challenging, and creative environment.\n<br><br>\n<strong>Essential Responsibilities:</strong> \n<br>\n<strong>In this role, you will:</strong>\n\n<li>Be a resourceful problem solver with a can-do attitude\n\n</li><li> Be a thought leader and guide clinical data science at key customer partnerships data strategy, labeling techniques, annotation, curation, and validation methodologies.\n\n</li><li>Be familiar with AI terminologies, AI technologies and techniques (tools, processes, best practices)\n\n</li><li>Provide guidance to data collection teams on test protocols including design of experiments, sample size, and statistical distributions.\n\n</li><li> Design and implement image preprocessing and/or computer vision algorithms for preprocessing and cleaning data.\n\n</li><li> Demonstrate algorithms meet accuracy requirements on general subject population through statistical analyses and error estimation.\n\n</li><li>Be part of a cross-disciplinary team on commercially-facing development projects, typically involving large, complex data sets. These teams typically include statisticians, computer scientists, software developers, engineers, product managers, and end users.\n\n</li><li>Contribute to technical teams (customer and GE) in development, deployment and application of applied analytics, predictive analytics and prescriptive analytics capabilities.\n\n</li><li> Be an expert in industry wide available best in class open source tool stacks and integrate work done at a customer site into GE environment\n\n</li><li>Assist in building learning systems that can assist in medical diagnosis and move to predictive results based on multi parametric data sets (imaging, non-imaging like EMR and wave form).\n\n</li><li>Work with the engineering team to incorporate your analyses and solutions, including working with the visualization team to create intuitive UI and rich UX stories. Partner with data engineers on data quality assessment, data cleansing and data analytics efforts.\n\n</li><li>Write technical reports summarizing development, analysis, training, validation, and testing of the algorithms.\n\n</li><li> Stay up-to-date in the field of machine learning and deep learning. Apply new technologies in development of product.\n<br><br>\n<strong>Qualifications/Requirements:</strong><br><br>Basic Qualifications:\n\n</li><li>Masters Degree in a STEM major (Science, Technology, Engineering, Mathematics) plus 5 years analytics development for industrial applications in a commercial/industrial setting OR Ph.D. in a STEM major (Science, Technology, Engineering, Mathematics) plus 2 year analytics development for industrial applications in a commercial/industrial setting<br><br>Eligibility Requirements\n\n</li><li> Legal authorization to work in the U.S. is required. GE may agree to sponsor an individual for an employment visa now or in the future if there is a shortage of individuals with particular skills\n\n</li><li> Must be willing to work out of an office located in San Ramon, CA\n<br><br>\n<strong>Desired Characteristics:</strong><br><br>Technical Expertise:\n\n</li><li>Have completed graduate-level coursework in statistics\n\n</li><li>Experimental design experience\n\n</li><li>Technical proficiency in languages such as Python, Java, etc.\n\n</li><li>Expertise in image preprocessing and/or computer vision algorithms for preprocessing and cleaning data.\n\n</li><li>Experience with medical imaging analysis leveraging methodologies using GPUs\n\n</li><li>Hands-on advanced proficiency in handling and analyzing large data sets such as medical imaging data\n\n</li><li>Expertise in broader machine techniques\n\n</li><li>Excellent written communication, verbal communication and presentation skills are required.\n\n</li><li>Experienced with the information technology aspects of data collection, organization, and integration\n\n</li><li>Knowledge in optimal computational environment required for data processing, data mining and machine\n\n</li><li>Software applications development experience\n\n</li><li> Experience working with biomedical non-imaging data<br><br>Domain Knowledge:\n\n</li><li> Understands the competitive landscape, regulatory marketing, etc.\n\n</li><li>Articulates clearly the main industry dynamics. Demonstrates awareness of important current trends (economic, political, environmental, regulatory, etc.) affecting the industry.<br><br>Leadership:\n\n</li><li>Have participated in competitions (e.g., Kaggle)\n\n</li><li>Experienced in writing peer-reviewed scientific manuscripts\n\n</li><li>Uses teamwork skills to achieve goals, solve problems, and manage conflict. Understands individual differences.\n\n</li><li>Systematically breaks problems into component parts. Identifies a successful solution and quantifies the associated risks/outcomes of the solution.<br><br>Personal Attributes:\n\n</li><li>Can ask appropriate questions needed to translate an abstract problem into a quantifiable analysis for identifying solutions. Seeks out processes and ideas that are out of the norm.\n\n</li><li> Identifies when additional information is needed from customer/manager and ask cogent and relevant questions to obtain it<br><br>#DTR\n<br><br>\n<strong>About Us:</strong> \n<br>\nGE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry.\n<br>\nGE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n<br><br>\n<strong>Locations:</strong>  United States; California; San Ramon<br><br>GE will only employ those who are legally authorized to work in the United States for this opening.</li>"}