{"job title": "Senior Machine Learning Scientist", "company": "GenapSys, Inc.", "city state": "– Redwood City, CA", "rating": "3.5", "job description": "At GenapSys we are working to change the world of healthcare and diagnostics. At GenapSys, we are developing a DNA-sequencing technology that will revolutionize the world of healthcare. Our system will enable fast, accurate, and ultra-low cost genetic tests in order to better understand (and ultimately treat) genetic diseases such as Cancer, Parkinson's, Diabetes, and Alzheimer's, just to name a few. GenapSys was founded by Dr. Hesaam Esfandyarpour and incubated over 6 years (2004-2010) at Stanford University.\n<br><br>\nOur team brings together an incredibly diverse and multidisciplinary set of backgrounds and skills from electrical and mechanical engineers to physicists, chemists, microfluidic engineers, molecular biologists, bioinformaticians, mathematicians and more. Together we will advance scientific and medical knowledge and improve human health through cheaper, faster, and more accurate DNA sequencing technologies. We are working cross-functionally to make a great impact in the world join us on that mission!\n<br><br>\nWe're currently looking for a talented Senior Machine Learning Scientist who is eager and enthusiastic.The candidate would love challenging problems and if challenges seem exciting and you fit the requirement outlined below - please apply!\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Actively participate in design and modification of models for machine learning</li>\n<li>Analyze prediction data and revise existing machine learning models and efforts</li>\n<li>Provide feedback to signal processing and algorithm teams for further improvement</li>\n<li>Monitor data integrity and quality and alert team members when inconsistencies arise and help troubleshoot the problem</li>\n</ul>\n<strong>Required Qualifications</strong>\n\n<ul>\n<li>Hands-on experience with development of Deep Learning models, various Neural Network concepts, classification algorithms</li>\n<li>Demonstrated experience in one or more Deep Learning platforms: TensorFlow, Theano, Torch, DL4J</li>\n<li>Strong mathematical skills. Working experience in Statistics is a plus</li>\n<li>Experience with open source ML tools</li>\n<li>Strong familiarity with Linux environment</li>\n<li>Prior experience in developing Next-Gen Sequencing related solutions is a plus</li>\n<li>Demonstrated experience in one or more programming languages: Python, Java, Matlab, R</li>\n<li>PhD or MS in Computer Science, Computational Biology, Math, Physics or a related field with &gt; 2 years' experience</li>\n<li>Ability to work collaboratively with primary analysis team, software developers, and the life science team</li>\n<li>Strong communication skills</li>\n</ul>\n<strong>What we offer:</strong>\n\n<ul>\n<li>An amazing mission: Enabling everyone to decode the living world!</li>\n<li>Competitive compensation and stock options</li>\n<li>Competitive benefits: medical, dental and vision benefits for employees and dependents, fully sponsored life, short and long-term disability insurance, and 401(k) retirement savings plan.</li>\n<li>Free daily catered gourmet lunches and snacks</li>\n<li>Weekly fancy High Tea and happy hours</li> \n\n<li>Free complex onsite gym membership</li>\n<li>Casual, but high-performing work environment</li>\n</ul>\n<em>A diverse and inclusive workplace where we learn from each other is an integral part of GenapSys' culture. We actively welcome people of different backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer and a great place to work. Join us and help us achieve our mission!</em>\n<br><br>\n<strong>Note to Recruiters and Placement Agencies:</strong>\n<br><br>\nGenapsys does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Genapsys employee. Genapsys will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered the property of Genapsys."}