{"job title": "Sr Principal Scientist", "company": "General Dynamics Information Technology", "city state": "– USA-VA-Springfield", "rating": "3.4", "job description": "<div><div>\n<div>Initiates and executes scientific research and/or development studies; Analyzes problems and applies theoretical techniques to develop solutions.\n<br><br>\n1. Plans and performs advanced scientific studies on new and varied problems where only general objectives are stated.\n<br><br>\n2. Acts as technical liaison with customers and sponsors, to include the preparation and presentation of high-level technical information.\n<br><br>\n3. Interprets, organizes, and coordinates overall project assignments within an assigned scientific functional area.\n<br><br>\n4. Plans and executes laboratory research.\n<br><br>\n5. Analyzes, evaluates, and plans methods of approach for projects and organizes means to achieve the solution of problems.\n<br><br>\n6. Establishes and defines the theoretical bases and principles which should apply and the empirical test procedures to be used.\n<br><br>\n7. Conducts complex investigations or tests pertaining to the development of new designs, methods, materials, or processes and investigates possible applications of results.\n<br><br>\n8. Interprets and evaluates test data and results of investigations and develops recommendations.\n<br><br>\n9. Recommends necessary corrections in technical analyses and design to ensure successful project completion.\n<br><br>\n10. Specifies equipment, materials and suppliers required for completion and implementation of projects.\n<br><br>\n11. Evaluates vendor capabilities to provide or build required services, supplies, or equipment.\n<br><br>\n12. Supervises assigned staff.\n<br><br>\n13. May serve as technical team or task leader.\n<br><br>\n14. Demonstrates creative ability through patent disclosures, problem solving, scientific reports or technical papers and articles.\n<br><br>\n15. Maintains current knowledge of relevant technologies as assigned.\n<br><br>\n16. Participates in special projects as required.</div>\n</div>\n</div>\n\n<br>Education<br>\n\n<div>\n<div>\n<div>Masters Degree in a scientific discipline.</div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>10-15 years of related experience in scientific research, analysis and/or engineering.\n<br><br>\nAs a trusted systems integrator for more than 50 years, General Dynamics Information Technology provides information technology (IT), systems engineering, professional services and simulation and training to customers in the defense, federal civilian government, health, homeland security, intelligence, state and local government and commercial sectors.With approximately 32,000 professionals worldwide, the company delivers IT enterprise solutions, manages large-scale, mission-critical IT programs and provides mission support services.GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class.</div>\n</div>\n</div>\n<br>"}