{"job title": "Data Scientist", "company": "Genentech", "city state": "– South San Francisco, California", "rating": "4.1", "job description": "<div><div>Data Scientist<br><br>South San Francisco\n<br>\nCalifornia,\n<br>\n United States of America<br>\n<div>\n<div>Job ID: 201807-115184<br><br>Download PDF</div><br>\n\n<div>\n<div>\nApply For This Job</div>\n </div>\n </div>\n\n<br>Return to Search Results\n<br><br>\nThe Position<br><br>The Data Scientist of Technical Institute (TI) is a member of the US Medical Affairs Evidence for Access (E4A) Medical Unit. He/she assists senior TI team members to design and execute retrospective observational research using in-house real-world data (RWD). As a subject expert, he/she may also review and design observational studies that are conducted by external vendors.\n<br><br>\n<strong>Key responsibilities include:</strong>\n<ul>\n<li>Support principal/senior TI data scientists to design and execute retrospective observational studies for Health Economics and Outcomes Research (HEOR) and Health Policy and System Research (HPSR) using in-house RWD</li><li>Analyze secondary data, including insurance claims, electronic medical record, patient survey, and disease registry.</li><li>Design, develop, test, implement, validate, document, and maintain effective and efficient SAS or R programs for conducting, analyzing and reporting observational database studies.</li><li>Contribute to program library and web-based tool development and maintenance.</li><li>Provide quality check of peer analyst’s programs.</li><li>Evaluate new data sources and research method</li>\n</ul>\n<strong>Qualification:</strong>\n<br><br>\nCandidates for this position should hold the following qualifications, have the following experience, and be able to demonstrate the following knowledge, skills and abilities to be considered as a suitable applicant. Please note that except where specified as “preferred,” or as a “plus,” all points listed below are considered minimum requirements. Years of experience listed below can be substituted with equivalent, relevant competency levels.\n<br><br>\n<u>Education and experience</u>\n<br><br>\nMaster and/or doctorate degree in data science, economics, epidemiology, public health, psychology, statistics, or other health services research related disciplines.\n<br><br>\nA minimal of 4 years' previous work experience in consulting, academic/research institute, and/or pharmaceutical industry experience in functions such as health economic outcomes research, epidemiology, statistical analysis, marketing, etc.\n<br><br>\n<u>Skills and ability</u>\n<ul>\n<li>PhD degree in a relevant discipline is preferred</li><li>Demonstrated experience in observational research study analysis\n<br>\nWorking knowledge of relevant national healthcare systems, specifically with large observational and insurance claims databases, experienced with diagnostic, procedure, and pharmaceutical coding systems</li><li>Broad and integrated knowledge of all aspects of the programming discipline</li><li>SAS Base, SAS/STAT, SAS/GRAPH, SQL and macro programming experience</li><li>Programming experience in R is a plus</li><li>Strong analytical and problem-solving capabilities. Advanced statistics and health economics concepts are a plus.</li><li>Experience in publication in peer-reviewed journal is preferred</li></ul>\n\n<ul>\n<li>Strong attention-to-detail</li><li>Excellent communication skills, both written and verbal</li><li>Ability to work collaboratively in a dynamic, team-based environment</li><li>Ability to work independently on all assigned tasks and projects</li><li>Ability to prioritize and adjust project plans appropriately</li><li>Demonstrated ability to learn and embrace new technologies, applications and solutions</li>\n</ul>\n\nWho We Are<br><br>A member of the Roche Group, Genentech has been at the forefront of the biotechnology industry\n<br>\n for more than 40 years, using human genetic information to develop novel medicines for serious and\n<br>\n life-threatening diseases. Genentech has multiple therapies on the market for cancer &amp; other serious\n<br>\n illnesses. Please take this opportunity to learn about Genentech where we believe that our employees\n<br>\n are our most important asset &amp; are dedicated to remaining a great place to work.\n<br><br>\nThe next step is yours. To apply today, click on the \"Apply online\" button.\n<br><br>\nGenentech is an equal opportunity employer &amp; prohibits unlawful discrimination based on race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, disability, marital &amp; veteran status. For more information about equal employment opportunity, visit our Genentech Careers page.\n<br><br>\nAt Genentech, we share salary ranges with applicants during the recruiting process, if requested. Third party salary estimates may not be accurate or up-to-date.</div>\n </div>"}