{"job title": "Research Scientist II", "company": "General Dynamics Information Technology", "city state": "– USA--TX-Ft Sam Houston", "rating": "3.4", "job description": "Job Description<br><br>General Dynamics IT is currently looking for a Research Scientist II to join our team to support the Naval Medical Research Unite at Ft. Sam Houston, San Antonio,Texas.\n<li>Develops, leads and conducts protocol-driven scientific research addressing various aspects of military medicine, including, but not limited to: hemorrhage and resuscitation, immunomodulation, biomedical systems, bioassay development craniofacial, infectious diseases and directed energy bioeffects.</li>\n<li>Provides support in writing protocol-driven research proposals, animal use protocols, human use protocols, technical reports, final reports, and peer-reviewed manuscripts.</li>\n<li>Evaluates data sets (provided by the government and collected by the contractor).</li>\n<li>Develops presentation materials, research Standard Operating Procedures, and present findings at technical and professional meetings.</li>\n<li>Prepares experimental subjects, set up experimental equipment, and aid in training and development of experimental subjects for experimental procedures in accordance with approved animal or human use protocols.</li>\n<li>Provides support in development of establishment of in vivo and in vitro model systems, data acquisition, and data analysis.</li>\n<li>Oversees personnel associated with the projects and manage data. Perform surgical procedures on animal models for both survival and non-survival.</li>\n\nEducation<br><br>Masters Degree in a scientific discipline. PhD preferred.<br><br>Qualifications<br><br>8-10 years of related experience in scientific research, analysis and/or engineering.\n<br><br>\nAs a trusted systems integrator for more than 50 years, General Dynamics Information Technology provides information technology (IT), systems engineering, professional services and simulation and training to customers in the defense, federal civilian government, health, homeland security, intelligence, state and local government and commercial sectors.With approximately 32,000 professionals worldwide, the company delivers IT enterprise solutions, manages large-scale, mission-critical IT programs and provides mission support services.GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class.\n<br><br>\n#DICE\n<br><br>\n#HCSDCJ"}