{"job title": "Research Scientist III", "company": "General Dynamics Information Technology", "city state": "– San Diego, CA", "rating": "3.4", "job description": "<div><div>\n<div>\n<p>GDIT is hiring a Research Scientist III in support of a contract which provides research and development support services for projects related to novel technologies and therapies for our wounded warrior population. This involves planning, coordinating, and executing experimental protocols that meet with the overall mission of the research objectives. This work effort involves: the development and testing of technologies incorporating audio, visual, and other sensory components to provide feedback to providers and patients that have common warfighter injuries such as concussion or insomnia and the evaluation of the efficacy of using novel technologies for patients undergoing therapy.</p><p> </p><p> </p><p> </p><p>Initiates and executes scientific research and/or development studies; Analyzes problems and applies theoretical techniques to develop solutions.</p><div><ul><li>Analyzes problems and develops experimental or theoretical techniques for formalized engineering or scientific studies.</li><li>Carries out development and testing of programs on systems, components and materials concurrent with design, fabrication or testing to better evaluate and minimize future problems.</li><li>Plans and executes laboratory research.</li><li>Develops alternative solutions to existing problems.</li><li>Uses specialized techniques and ingenuity to select and evaluate approaches to unforeseen or unique problems.</li><li>Performs or delegates all detail work necessary to determine optimum solutions.</li><li>Evaluates proposals and makes recommendations based on sound scientific principles and practical considerations.</li><li>May provide guidance and work leadership to less experienced Scientists and/or Technicians.</li><li>Prepares cost and schedule estimates and technical documents on proposed projects in assigned area.</li><li>Demonstrates creative ability through patent disclosures, problem solving, scientific reports or technical papers and articles.</li><li> Maintains current knowledge of relevant technologies as assigned.</li><li>Participates in special projects as required.</li></ul></div>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nEducation\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Bachelors Degree in a scientific discipline.</li><li>PhD or Master’s in a relevant field (In neurophysiology) or equivalent experience preferred</li></ul><div> </div><p> </p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nQualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>5-8 years of related experience in scientific research, analysis and/or engineering</li><li>6+ years of knowledge and work experience in a relevant field related to neurophysiology of military populations</li></ul><p> </p><div> </div><div> </div><p>For more than 50 years, General Dynamics Information Technology has served as a trusted provider of information technology, systems engineering, training and professional services to customers across federal, state, and local governments, and in the commercial sector. Over 40,000 GDIT professionals deliver enterprise solutions, manage mission-critical IT programs and provide mission support services worldwide. GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class.</p><p> </p><p>#HCSDCJ</p>\n\n</div>\n</div>\n</div><b></b>"}