{"job title": "Senior Data Scientist", "company": "General Dynamics Mission Systems", "city state": "– Scottsdale, AZ", "rating": "3.6", "job description": "Bachelor's degree in software engineering or a related technical field is required (or equivalent experience), plus a minimum of 8 years of relevant experience; or Master's degree plus a minimum of 6 years of relevant experience. Agile experience preferred.\n<br><br>\n<strong>CLEARANCE REQUIREMENTS:</strong>\n<br><br>\nDepartment of Defense TS/SCI security clearance is preferred at time of hire. Candidates must be able to obtain a TS/SCI clearance within a reasonable amount of time from date of hire. Applicants selected will be subject to a U.S. Government security investigation and must meet eligibility requirements for access to classified information. Due to the nature of work performed within our facilities, U.S. citizenship is required.\n<br><br>\nGeneral Dynamics Mission Systems has an immediate opening for a Senior Data Scientist. A Senior Data Scientist will help us expand our business intelligence services to include more predictive analytics and data science capabilities. The successful candidate will help define the shape of this endeavor while working with our internal business partners to provide improved business insight of our customers, markets, vendors, and internal processes. The data scientist will identify data sources, perform exploratory data analysis, develop data models and improve the visualization of data sets to provide new business insight.\n<br><br>\nThis position provides an opportunity to further advance the cutting-edge technology that supports some of our nation’s core defense/intelligence services and systems. General Dynamics Mission Systems employees work closely with esteemed customers to develop solutions that allow them to carry out high-stakes national security missions.\n<br><br>\n<strong>REPRESENTATIVE DUTIES AND TASKS:</strong>\n<br><br>\nThe Senior Data Scientist will be part of a team, forward deployed within the customer space in support of the system. The candidate will have hybrid experience in software development and data science. The Senior Data Scientist's role would be to insert data science expertise into our team leveraging machine learning to solve problems.\n<br><br>\n<strong>RESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO:</strong>\n<ul>\n<li>Participates as a Subject Matter Expert in internal review of software components and systems utilizing machine learning</li> <li>Provides leadership and/or direction and/or supervision to lower level employees and teams</li> <li>Leads small technical proposals and contributes to medium sized proposals</li> <li>Frequently responsible to lead collaboration activities with senior management and leadership within the company</li> <li>Frequently responsible to lead collaboration with organizations outside engineering or with external customers and vendors/suppliers</li><li>Mentor less experienced team members</li> <li>Occasional contact with Business Development</li> <li>Travel may be required</li> <li>Security clearance may be required</li> <li>Networks with key contacts outside own area of expertise as well as with senior internal and external personnel</li> \n</ul>\n<strong>KNOWLEDGE SKILLS AND ABILITIES:</strong>\n<ul>\n<li>5+ years of experience with machine learning</li><li>5+ years of experience with standard data science tool-sets</li><li>A strong computational mathematics background</li><li>Capable of working on complex problems of diverse scope or situations or data that requires in-depth evaluation of variable factors</li><li>Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results</li><li>Detailed and very strong knowledge of technology trends and champions new ideas and product and process improvements</li><li>Very strong ability to excel at the development of new theories and methods</li><li>Very strong awareness of business objectives and Engineering's role in achieving</li><li>Very strong ability to be creative, innovative and responsible, and able to master advanced decision-making skills</li><li>Very strong ability to grasp and apply new information quickly</li><li>Shows initiative on assignments, and professionally executes projects as a technical lead with little or no direction, frequently provides direction and leadership to technical teams and determines methods and procedures</li><li>Very strong ability to handle significant responsibility, leadership and accountability while executing very complex assignments</li><li>Very strong ability to be a team player who thrives in collaborative environments and revels in team success, meeting and exceeding personal and team commitments</li><li>Very strong written and verbal communications skills</li> <li>Very strong ability to recognize and clearly report relevant information</li>\n</ul>\nGeneral Dynamics Mission Systems (GDMS) engineers a diverse portfolio of high technology solutions, products and services that enable customers to successfully execute missions across all domains of operation. With a global team of 13,000+ top professionals, we partner with the best in industry to expand the bounds of innovation in the defense and scientific arenas. Given the nature of our work and who we are, we value trust, honesty, alignment and transparency. We offer highly competitive benefits and pride ourselves in being a great place to work with a shared sense of purpose. You will also enjoy a flexible work environment where contributions are recognized and rewarded. If who we are and what we do resonates with you, we invite you to join our high performance team!\n<br><br>\nGeneral Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran"}