{"job title": "Data Analyst", "company": "Getty Images", "city state": "– New York, NY", "rating": "3.6", "job description": "<strong>Who You Are:</strong>\n<br><br>\nGetty Images is looking for individuals that enjoy applying quantitative methods to help surface business metrics to stakeholders and turn business data into actionable insights. This role is responsible for the analysis and visualization of both large and small data across Getty Images, and for using that work to help us make better decisions and build better products.\n<br><br>\n<strong>Your Next Challenge:</strong>\n<br><br>\nYou will join a growing team of highly-collaborative and curious Data Scientists, Data Engineers and other quantitative-minded individuals. As a member of the team, you will have the chance to interact with key business stakeholders to help them identify, analyze and interpret the results of statistical tests and analytical reports.\n<br><br>\nYour primary goal will be to help extract insights and unlock value from customer data by turning data into information, information into insight, and insight into business actions. You will also be responsible for building and maintaining ongoing reports, and will work with stakeholders to prioritize business and information needs.\n<br><br>\nYou will also interact with the entirety of Getty Images data and technology stack to acquire new data sources, define data schemas and build new data pipelines that can support analytical reporting and feature extraction for Data Science models. You also go out of your way to find new opportunities to speed up and automate the generation of analytical reports.\n<br><br>\nWe value learning and development, and you will be given every opportunity to <strong>work on projects that excite you and help you grow</strong>. You will have the opportunity to sit at the intersection of Engineering, Marketing, Sales and Product to inform, influence, support, and execute on key decisions, all while collaborating closely with fellow Data Engineers and Data Scientists.\n<br><br>\n<strong>What You'll Need:</strong>\n<ul>\n<li>A BS or MS in computer science, statistics, economics/econometrics, mathematics or any other equivalent quantitative project is preferred. If you are self-taught and believe you are a good fit for this role, or have significant work experience, we would love to hear from you as well.</li><li>Proven experience of having worked hands-on as a Data Analyst or Business Analyst.</li><li>Strong working knowledge of SQL and Excel. We are looking for people that aim to optimize workflows and automate repetitive processes, so knowledge of Python and/or R is a big plus, or at least the desire to learn these new skills is required.</li><li>Knowledge of statistical testing, data visualization best practices, data mining, and a good understanding of database design and management. Knowledge of BI and CRM tools such as Tableau, Looker, Salesforce is also be a big plus.</li><li>Strong communication skills (both written and orally) and an ability to comfortably produce written reports and presenting findings.</li><li>Ability to independently execute on a project, from ideation to delivery to stakeholders, and can pro-actively interact with other engineers at Getty Images to access necessary resources or data.</li>\n</ul>\n<em>#LI-MM1</em><strong>\n<br><br>\nWho We Are:</strong>\n<br><br>\nGetty Images is the world’s leader in visual communication, with over 170 million assets available through its premium content site www.gettyimages.com and its leading stock content site www.istock.com. With its advanced search and image recognition technology, Getty Images serves business customers in more than 100 countries and is the first place creative and media professionals turn to discover, purchase and manage images and other digital content. Its award-winning photographers and content creators help customers produce inspiring work which appears every day in the world’s most influential newspapers, magazines, advertising campaigns, films, television programs, books and online media.\n<br><br>\nVisit Getty Images at www.gettyimages.com to learn more about how the company is advancing the unique role of digital media in communications and business, and enabling creative ideas to come to life. For company news and announcements, visit press.gettyimages.com, and for the stories, innovation and inspiration behind our content, visit Stories &amp; Trends http://stories.gettyimages.com. Find us on Facebook at www.facebook.com/gettyimages and Twitter at https://twitter.com/GettyImages.\n<br><br>\n<strong>Getty Images is an equal opportunity employer and strongly supports diversity in the workplace.</strong>"}