{"job title": "Research Scientist I, Structural Chemistry", "company": "Gilead Sciences", "city state": "– Foster City, CA (US)", "rating": "3.2", "job description": "For Current Gilead Employees and Contractors:<br><br>Please log onto your Internal Career Site to apply for this job.<br><br>Job Description<br><br><strong>Specific Responsibilities:</strong>\n<br><br>\nSignificant experience and skill in protein crystallization, including initial screening, crystal optimization, cryoprotection, and enhancement of diffraction. Candidates should be proficient in both well-established and novel methods, and have successfully crystallized a number of proteins.\n<br><br>\nExpertise in X-ray data collection using both home lab and synchrotron sources, including screening for best samples, strategic data collection, diffraction extension techniques, and data processing is required. The successful candidate will be skilled in structure determination, refinement, and analysis.\n<br><br>\nAssessment of protein purity and suitability for crystallization will be needed, as will experience in design of protein constructs for crystallography.\n<br><br>\n<strong>Essential Functions:</strong>\n<br><br>\nStrong organization and communication skills, and solid experience with lab crystallization automation are essential.\n<br><br>\n<strong>Knowledge, Experience, and Skills:</strong>\n<br><br>\nCandidate must have a PhD (or BS/MS degree with 6 years of experience) and a proven track record of success in obtaining diffraction-quality crystals for a number of proteins.<br><br>For jobs in the United States:<br><br>As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.\n<br><br>\nFor more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.\n<br><br>\nNOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT\n<br>\n<strong>YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT</strong>\n<br>\nPAY TRANSPARENCY NONDISCRIMINATION PROVISION\n<br><br>\nOur environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.\n<br><br>\nGilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.<br><br>For jobs in France:<br><br>Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.com<br><br>For Current Gilead Employees and Contractors:<br><br>Please log onto your Internal Career Site to apply for this job."}