{"job title": "Data Scientist", "company": "Gladly", "city state": "– San Francisco, CA", "rating": "5.0", "job description": "How do you contact companies you do business with? Voice, chat, email, SMS, social media? Gladly was built to rethink how the worlds top brands communicate with their customers.\n<br><br>\nHelp us <strong>develop data and machine learning products</strong> that will empower companies to truly serve their customers better and facilitate effective conversations across any channel from text to tweet.\n<br><br>\n<strong>About the Role</strong>\n<br><br>\nWe're in search of a data scientist with experience in machine learning to use Gladly's unique dataset and to develop high-impact products. You will collaborate with a cross-functional team of engineers, product managers and designers to identify opportunities and build data products. This is a greenfield opportunity where you will influence the direction of our product and data infrastructure.\n<br><br>\n<strong>What You'll Do</strong>\n\n<ul>\n<li>Perform exploratory data analysis to derive insights from large, complex data sets, including real-world conversational data.</li>\n<li>Communicate findings to the team to influence product decisions.</li>\n<li>Apply coding skills to build machine learning models and evaluate their performance.</li>\n<li>Work with engineers, product and design to integrate your models directly into the product.</li>\n<li>Design and interpret A/B tests to measure the impact and performance of product features.</li>\n</ul>\n<strong>Some example projects include:</strong>\n\n<ul>\n<li>Apply deep learning techniques to automatically classify customer inquiries.</li>\n<li>Evaluate speech-to-text APIs for voicemail transcription.</li>\n<li>Design a routing algorithm to prioritize and match customers with agents best suited to handle their issues.</li>\n</ul>\n<strong>We are looking for a candidate who:</strong>\n\n<ul>\n<li>Is highly inquisitive and can derive patterns and insights from large structured and unstructured datasets.</li>\n<li>Has a keen desire to solve business problems through data science and machine learning techniques. Can see the big picture and understand requirements from other points of view, beyond just the spec.</li>\n<li>Excels at making complex concepts simple and easy to understand by those around you. Able to communicate both high level principles and nuances of machine learning methods to product managers and engineers.</li>\n<li>Has a deep understanding of statistical and predictive modeling, feature selection and dimensionality reduction, and classification, ranking and recommendation techniques.</li>\n<li>Has solid coding ability in a high level language (we primarily use Python and Go) and fluency with data science and machine learning libraries (e.g. Keras, Tensorflow, sklearn, pandas).</li></ul>\n\n\n<ul>\n<li>Bonus: Has production experience with deep learning or NLP.</li>\n</ul>\nThe ideal candidate is a data scientist or engineer with a track record of successfully applying machine learning techniques in a production environment.\n<br><br>\n<strong>Just to highlight why you'll love working here at Gladly:</strong>\n\n<ul>\n<li>We're a small and bureaucracy-free company, so you'll be able to see projects from concept to production.</li>\n<li>We have a collaborative culture of mutual respect - many of us are working together for a second and even a third time.</li>\n<li>We believe in open communication and in sharing opinions, not in micromanagement.</li>\n<li>We have a strong work ethic, but value life outside of work, so we don't spend our entire lives in the office.</li>\n</ul>\nGladly offers competitive salaries, stock options, and generous paid time off as well as:\n\n<ul>\n<li>Medical, Dental, Vision and Life insurance</li>\n<li>Paid Parental Leave</li>\n<li>401K</li>\n<li>Flexible Spending Accounts</li>\n<li>Fitness Stipend</li>\n<li>Equipment of your choice</li>\n<li>Commuter Benefits</li>\n</ul>\nGladly is based in San Francisco and funded by Greylock Partners, NEA and GGV Capital. Learn more about the company and our team here."}