{"job title": "thinkThin - Marketing Analytics Manager", "company": "Glanbia Performance Nutrition", "city state": "– Los Angeles", "rating": "3.0", "job description": "<strong>Essential Functions:</strong>\n<ul>\n<li>Develop a deep understanding of the market and competitive landscape</li><li>Pull and consolidate syndicated consumption data (SPINS, IRI) on a monthly basis, providing an analysis of key findings and commentary on causality</li><li>Based on competitive landscape understanding, observation of trends, and data analysis, develop hypotheses and / or recommendations around how sales and marketing teams can modify and / or adjust pricing, promotion, and product development strategies to drive growth.</li><li>Successful candidate should be a student of how our category is merchandised in different retail channels and partner with the marketing team in identifying new category entrants and evaluating their market success.</li><li>Similarly, he / she will develop new item trackers to keep internal teams informed of the progress of new item launches.</li><li>Communicate key market and consumption trends and recommendations to management via reports and presentation materials including monthly summary to inform Sales &amp; Operations Planning process</li><li>Lead ad hoc projects as needed and partner with marketing team to develop situational analysis for marketing planning process</li><li>Develop solid post-promotional analyses on key promotions or in-store programs to identify results and implications for future programs</li><li>Additional duties, responsibilities and qualifications, beyond those listed herein, may be required or assigned as necessary</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Knowledge, Skills and Abilities:</strong>\n<ul>\n<li>Results oriented with high level of initiative and assertiveness</li><li>Excellent analytical and problem solving skills, supported by Excel fluency</li><li>Strong written and verbal communication skills</li><li>Team player in a collaborative environment</li><li>Detail-oriented. Comfortable working with numerical data and information</li><li>Deadline oriented. Ability to anticipate and address conflicts, skillfully negotiate, and deliver great outcomes</li><li>Proficient in Outlook, Powerpoint and Access in addition to having excellent Excel skills</li>\n</ul>\n<strong>Education/Experience:</strong>\n<ul>\n<li>Bachelors&nbsp;degree required</li><li>5+ years’ experience in a role analyzing IRI, SPINS, or Nielsen data</li><li>Proven success and analytical abilities</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Equal Opportunity Employer:</strong> Disability/Veteran. We are an equal opportunity and affirmative action employer that does not discriminate and considers all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status"}