{"job title": "Senior Machine Learning Engineer", "company": "Glassdoor", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "Our mission is to help people everywhere find a job and company they love. We are disrupting an industry by changing how people search for jobs and how companies recruit top talent.\n<br><br>\nGlassdoor is leading the industry in how jobs seekers are matched to a job and we are building state of the art algorithms to power personalized jobs search experience for 55+ Million unique users per month and growing.\n<br><br>\nYou will be part of a highly talented team of machine learning engineers and data scientists using the latest open source technologies and frameworks such as Apache Solr, Spark, Tensor Flow, Cassandra to build our personalized Jobs search experience and provide unique insights optimized for scale and performance.\n<br><br>\nJoin us if you have a deep understanding of machine learning techniques and experience implementing those models at large scale in real-world applications.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Work with the team of engineers and data scientists to improve relevance ranking for job listings within search</li>\n<li>Define, research and implement entity recognition and query understanding features to optimize the search experience</li>\n<li>Create models to personalize users job search experience</li>\n<li>Define and implement entity extraction from our multi-lingual job description data-set</li>\n<li>Be the thought-leader for how we could use data and predictive algorithms to increase user engagement and search revenue</li>\n</ul>\n<strong>Key Qualifications:</strong>\n\n<ul>\n<li>3+ years of experience applying machine learning solutions to solve business problems.</li>\n<li>Hands-on experience with supervised and unsupervised machine learning algorithms for regression, classification, and clustering</li>\n<li>Hands-on experience using structured and unstructured data</li>\n<li>Strong engineering experience in Java</li>\n<li>Excellent problem solving and analytical skills</li>\n<li>Familiarity with search domain (Information retrieval, NLP, Solr/ Lucene or related tech)</li>\n<li>Experience working with NoSQL solutions such as Cassandra, Redis is a big plus</li>\n<li>Experience with analyzing large data sets, using Hadoop, Spark or related technologies a plus</li>\n<li>Familiar with classical statistics and time series analysis</li>\n<li>Excellent written and verbal communication skills</li>\n<li>M.S. or above in Computer Science or a related field</li>\n</ul>\n<strong>Why Glassdoor?</strong>\n\n<ul>\n<li>Work with purpose join us in creating transparency for job seekers everywhere</li>\n<li>Glassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year</li>\n<li>100% company paid medical/dental/vision/life coverage, with 80% dependent coverage</li>\n<li>Long-Term Incentive Plan</li>\n<li>Conveniently located office in the heart of downtown San Francisco (Embarcadero)</li>\n<li>Fully-stocked break rooms with complimentary food and drinks</li>\n<li>Paid holidays and flexible paid time off</li>\n<li>Your choice between Mac or PC</li>\n</ul>\nGlassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}