{"job title": "Manager, Data Science - Decision Science", "company": "Glassdoor", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "At Glassdoor, our mission is to help people everywhere find a job and company they love. We do that by matching people with the best jobs for them. This is a hard problem and we are looking for curious and brilliant individuals who are up for revolutionizing the way people find and choose jobs. Each month, around 50M users visit Glassdoor, but our aspiration is to enable every person in the world with deep content &amp; jobs information. We need your help to accelerate this growth further... Come join us!\n<br><br>\nPosition based in beautiful Bay Area! We have offices both in San Francisco and Mill Valley!\n<br><br>\n<strong>Decision Science @ Glassdoor:</strong>\n<br><br>\nThe Decision Science team drives data-driven strategy and decision making across the company through predictive analytics, testing and optimization. We work on a wide variety of problems by proactively identifying opportunities. We drive product prioritization and inform business strategy by developing a deep understanding of our users and clients. The Decision Science team is partner to our department leaders and executive team to drive sound data-based decision making across Product, Marketing, and Sales teams. We define data-driven cross-functional initiatives, and drive execution.\n<br><br>\n<strong>This Role:</strong>\n<br><br>\nThe ideal candidate will be extremely results driven and passionate about winning. You exercise very sound judgment and have the ability to balance sophistication with simplicity, scientific rigor with pragmatism and agility with quality. You will drive deep and holistic understanding of our jobs marketplace and job seekers through applying a mix of machine learning, statistics and analytics skills. For example: What makes a job seeker more likely to apply for a job? What in our marketplace drives business customers retention? How should we price different type of clicks? What drives different amount of applications to similar jobs? Do we have market inefficiencies and how should we solve those? What drives job seekers repeat visits? Explain and predict whether prospect will become a customer, a customer to renew his subscription, a customer to grow his spend and more.\n<br><br>\n<strong>Requirements:</strong>\n\n<ul>\n<li>Degree in a quantitative field (statistics, operations research, math, etc.) with strong experience in data &amp; business analysis</li>\n<li>4+ years of quantitative experience, ideally in an Internet company\n<br>\nNo less than expert level usage of SQL or Hive</li>\n<li>Experienced with coding and running machine learning and regression models in R, Python or Pyspark</li>\n<li>Thorough knowledge of statistics and some A/B test experience</li>\n<li>Strong visualization skills and experience with BI tools (ex. Tableau)</li>\n<li>Strong presentation skills. You are able to confidently distill and present insights to senior management</li>\n<li>Some experience with analyzing logs; experience with Hive / Pig is a big plus</li>\n<li>Proven experience in managing / mentoring junior team members</li>\n</ul>\n<strong>Why Glassdoor?</strong>\n\n<ul>\n<li>Work with purpose join us in creating transparency for job seekers everywhere</li>\n<li>Glassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year</li>\n<li>100% company paid medical/dental/vision/life coverage, with 80% dependent coverage</li>\n<li>Long Term Incentive Plan</li>\n<li>Conveniently located office in the heart of downtown San Francisco (Embarcadero)</li>\n<li>Fully-stocked break rooms with complimentary food and drinks</li>\n<li>Paid holidays and flexible paid time off</li>\n<li>Your choice between Mac or PC</li>\n</ul>\nGlassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}