{"job title": "Lead Data Engineer", "company": "Glassdoor", "city state": "– Mill Valley, CA", "rating": "4.0", "job description": "Our mission is to help people everywhere find a job and company they love. We are disrupting an industry by changing how people search for jobs and how companies recruit top talent.\n<br><br>\nWe are looking for a talented engineer to join our growing data engineering team. The ideal candidate has significant experience in building scalable data platforms that enable business intelligence, analytics, data science and data products. You must have strong, hands-on technical expertise in a variety of technologies and the proven ability to fashion robust, scalable solutions. You should have a passion for continuous improvement quality.\n<br><br>\nWe embrace a wide variety of technologies and work very closely with data scientists and business stakeholders to deliver end to end solutions. If you are interested in a fast-paced environment, the latest technologies, and fun data problems come join us!\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Design and develop big data applications using a variety of different technologies.</li>\n<li>Develop logical and physical data models for big data platforms.</li>\n<li>Automate workflows using Apache Airflow.</li>\n<li>Write data pipelines using Apache Hive, Apache Spark, Apache Kafka.</li>\n<li>Create solutions on AWS using services such as Kinesis, Lambda, and API Gateway.</li>\n<li>Provide ongoing maintenance and enhancements to existing systems, and participate in rotational on-call support.</li>\n<li>Learn our business domain and technology infrastructure quickly and share your knowledge freely and proactively with others in the team.</li>\n<li>Mentor junior engineers on the team</li>\n<li>Lead daily standups and design reviews</li>\n<li>Groom and prioritize backlog using JIRA</li>\n<li>Act as the point of contact for your assigned business domain</li>\n</ul>\n<strong>Key Qualifications</strong>\n\n<ul>\n<li>7+ years of hands-on experience with developing data warehouse solutions and data products.</li>\n<li>4+ years of hands-on experience developing a distributed data processing platform with Hadoop, Hive, Spark, Airflow, Kafka, etc.</li>\n<li>2+ years of hands-on experience in modeling and designing schema for data lakes or for RDBMS platforms.</li>\n<li>Experience managing a small team of engineers</li>\n<li>Experience with programming languages: Python, Java, Scala, etc.</li>\n<li>Experience with scripting languages: Perl, Shell, etc.</li>\n<li>Practice working with, processing, and managing large data sets (multi TB/PB scale).</li>\n<li>Exposure to test-driven development and automated testing frameworks.</li>\n<li>Background in Scrum/Agile development methodologies.</li>\n<li>Capable of delivering on multiple competing priorities with little supervision.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Bachelor's Degree in computer science or equivalent experience.</li>\n</ul>\n<strong>Nice To Have</strong>\n\n<ul>\n<li>Experience building machine learning pipelines or data products.</li>\n<li>Familiarity with AWS or GCS technologies.</li>\n<li>Be passionate about or have contributed to open sourced engineering projects in the past.</li>\n</ul>\n<strong>Why Glassdoor?</strong>\n\n<ul>\n<li>Work with purpose join us in creating transparency for job seekers everywhere</li>\n<li>Glassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year</li>\n<li>100% company paid medical/dental/vision/life coverage; 80% dependent coverage</li>\n<li>Long-Term Incentive Plan</li> \n\n<li>Sunny &amp; peaceful Mill Valley offices located right on the water</li>\n<li>Walking, running and biking trails steps away from the office</li>\n<li>Onsite gym and fitness classes</li>\n<li>Free catered lunch; new menu daily</li>\n<li>Paid holidays and flexible paid time off</li>\n<li>Your choice between Mac or PC</li>\n<li>Dog-friendly office (with dog-free zones if you are so inclined)</li>\n<li>Free parking</li>\n</ul>\nGlassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}