{"job title": "Data Scientist", "company": "Globant", "city state": "– Stamford, CT", "rating": "3.7", "job description": "At Globant we boost our client's digital experience by ideating and creating the most innovative software products leveraging emerging technologies and trends. We are the place where innovation, design and engineering meet scale. The most cutting-edge practices and technologies plus a unique team result in 19 studios where engineering and design meet scale to create digital journeys.\n<br><br>\nWe do that by leveraging engineering, design and innovation with our own industry-leading practices, like our Agile PODs and specialized Studios.\n<br><br>\nWe want you to join us in creating these journeys for the biggest clients in tech, retail, travel, banking, ecommerce and media, revolutionizing and growing their core businesses while helping them (and you!) stay ahead of the curve.\n<br><br>\nWHAT ARE WE LOOKING FOR?\n<br><br>\nIf you are Data Scientist you know your way with pythonand you have a <strong>solid understanding of NoSQL Databases</strong>, we want to meet you.\n<br><br>\nYOU'LL GET THE CHANCE TO:\n<br><br>\nAs a data scientist you will be working on building out a new technology platform that will be used by Firm's data scientists and analysts. You are expected to work on a fast-paced and highly visible project that has significant business impact. You will be responsible for: Writing efficient, modular, and dependable code, packages, libraries, and scripts Work closely with team's data engineer/systems developer and platform customers to design research (e.g., backtesting software) and production (e.g., model serving API) processes Documenting all work extensively and train teammates on use of work products (e.g., custom Python libraries or R packages) Collaborating regularly with firm's Big Data group and other firm resources Facilitate building research hypotheses and assumptions of portfolio manager and investment analysts by designing methodology and writing necessary code to perform backtesting, cross-validation, event studies, data analysis, etc., Function as an extension of data engineering team to build out data science use cases of the platform\n<br><br>\nWHAT WILL HELP YOU SUCCEED:\n<br><br>\nBachelor's degree in Computer Science or relevant Engineering discipline An expert in Python or R with 5 years of programming experience Strong programming skills in Relational SQL/NoSQL databases Strong written and verbal communication skills Conversant with advanced statistical analysis\n<br><br>\nWe are interested in hard-working, fast-learning talents and we have the know-how and scale to help you make your own career path. If you seek an entrepreneurial, flexible and team-oriented culture, come join us.\n<br><br>\n<strong>We are ready.</strong>"}