{"job title": "Senior Data Engineer", "company": "Glu Mobile", "city state": "– San Francisco, CA, United States", "rating": "3.6", "job description": "The ideal candidate has a strong engineering background and has built robust data platforms and pipelines and takes complete ownership of their area of expertise. We are passionate about maximizing the value that data and analytics can provide to our business. This is a fantastic opportunity to use your engineering skills to make a material impact on a highly valued analytics platform.\n<br><br>\n<strong>You'll most often be:</strong>\n<ul>\n<li> Take ownership of and develop critical new features for our next-generation analytics platform, supporting Glu's worldwide studios and central functions such as marketing and finance.</li><li> Maintaining, streamlining and hardening existing data pipelines, from ingestion, through ETL and batch processing in order to reliably process billions of records per day.</li><li> Build scalable, accurate and extensible stream processing applications using cutting-edge technology such as Spark Streaming and Apache Flink.</li><li> Working with Analytics and Product Management to ensure optimal data design and efficiency.</li>\n</ul>\n<strong>And your skills and experience include:</strong>\n<ul>\n<li> Bachelor's degree in computer science/mathematics/engineering, or other fields with proven engineering experience.</li><li> 5-7 years software engineering experience, especially working on back-end data infrastructure.</li><li> Proficiency with at least one of the following languages: Java, Python, Scala.</li><li> Experience with distributed stream processing technologies such as Flink, Spark Streaming and/or Kafka Streams.</li><li> Experience with SQL and SQL-like languages, especially Hive.</li><li> Experience with AWS Ecosystem, especially Kinesis, EMR, Lambda and Glue.</li>\n</ul>\n<strong>Bonus Points</strong>\n<ul>\n<li> Knowledge of Hadoop environment and comfortable with Linux operating system.</li><li> Knowledge of NoSQL application data stores i.e. HBase, Cassandra, DynamoDB, Redis.</li><li> Experience Building data-rich web applications, especially with technologies like Angular.js and Node.js.</li>\n</ul>"}