{"job title": "Data Scientist", "company": "GOAT", "city state": "– Los Angeles, CA", "rating": "4.2", "job description": "<div>With 7 million members and more than 400,000 listings, GOAT is the largest marketplace for authentic sneakers. Our Data Science team supports many vital tasks around the company including authentication, personalization, fraud detection, business development, operations, and much more.</div>In this role you will:\n\n<ul>\n<li>Build machine learning models for predictive APIs</li><li>Enrich the product discovery journey with recommendation streams</li><li>Solve complex logistics optimization problems</li><li>Work in cross functional teams to develop novel features and strategies</li><li>Identify and validate new features to be used across our machine learning services</li><li>Communicate the results and methodology effectively within the team and to external stakeholders</li><li>Design and run company wide experiments to provide statically validated insight</li>\n</ul>\n\n<strong>We are looking for:</strong>\n\n<ul>\n<li>Educational background in relevant field (Computer Science, Applied Mathematics, Statistics, Operations Research, Physics, Electrical &amp; Computer Engineering, or other quantitative fields)</li><li>1+ years of professional experience</li><li>Proficiency in statistical analytics and machine learning algorithms</li><li>Proficiency in at least one mathematical programming tool such as Python or R</li><li>A quick learner, a self-starter, able to work independently, and you're willing (and able) to handle the pressures of an increasing level of responsibility</li>\n</ul>\n\n<strong>Benefits and Perks:</strong>\n\n<ul>\n<li>Medical, dental and vision coverage</li><li>Competitive salary and equity grants</li><li>Daily catered lunches from LAs best restaurants</li><li>Unlimited vacation and sick days</li>\n</ul>\n\n<div>Founded in 2015 and based in Los Angeles, California, GOAT is the safest way to buy and sell sneakers. Whether youre looking to buy rare sneakers, discover new ones, or earn money by listing sneakers you already own, GOAT is your destination. And with an authentication service, buyer protection guarantee and great customer service, its the safest option in the industry.</div><br>\n<div>We are backed by some of the leading names in venture capital, including Andreessen Horowitz, Ashton Kutcher, Guy Oseary, Matrix Partners, NEA, SV Angel, Upfront Ventures and Y Combinator.</div><br>\n<div>GOAT will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, if applicable.</div>"}