{"job title": "CCBD Technology - Consumer Banking Technology - Data Engineer", "company": "Goldman Sachs", "city state": "– US-NY-New York", "rating": "3.9", "job description": "MORE ABOUT THIS JOB\n<p>What We DoAt Goldman Sachs, our Engineers don’t just make things – we make things possible. Change the world by connecting people and capital with ideas. Solve the most challenging and pressing engineering problems for our clients. Join our engineering teams that build massively scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Create new businesses, transform finance, and explore a world of opportunity at the speed of markets.Engineering, which is comprised of our Technology Division and global strategists groups, is at the critical center of our business, and our dynamic environment requires innovative strategic thinking and immediate, real solutions. Want to push the limit of digital possibilities? Start here.Who We Look ForGoldman Sachs Engineers are innovators and problem-solvers, building solutions in risk management, big data, mobile and more. We look for creative collaborators who evolve, adapt to change and thrive in a fast-paced global environment.Consumer and Commercial Banking (CCBD) Consumer and Commercial Banking brings innovative solutions to traditional banking activities. We are a global team of lenders, investors, risk managers, skilled marketers, web experts and banking specialists. We provide a suite of solutions to help our customers meet their personal financial goals. We make direct investments in, and risk manage, a portfolio of corporate loans and securities. And we help transform distressed communities through investments and loans of private capital. Digital Finance Digital Finance, a business unit within CCBD, is comprised of the firm’s digitally-led consumer businesses, which include the Marcus deposits and lending businesses, as well as the personal financial management app, Clarity Money. Digital Finance combines the strength and heritage of a 148-year-old financial institution with the agility and entrepreneurial spirit of a tech start-up. Through the use of machine learning and intuitive design, we provide customers with powerful tools that are grounded in value, transparency and simplicity to help them make smarter decisions about their money.</p>\nRESPONSIBILITIES AND QUALIFICATIONS\n<p><strong>HOW YOU FULFILL YOUR POTENTIAL</strong></p>\n<p>As a senior developer, </p>\n<ul>\n <li> You will contribute to the Marcus Lending data warehouse platform</li>\n <li> Product Managing and working with the various business stakeholders</li>\n <li> Establish trusted partnerships with peers, product heads, and executive level stakeholders</li>\n</ul>\n<p><strong>SKILLS</strong></p>\n<ul>\n <li> Bachelor’s degree with a minimum of 8 years of relevant professional experience</li>\n <li> Proficient at Python, Spark and the Hadoop ecosystem</li>\n <li> Experience with SQL and relational databases</li>\n <li> Comfort with Agile operating models• Self-starter, motivated, and good communication skills </li>\n <li> Strong sense of ownership and driven to manage tasks to completion</li>\n <li> Ability to work quickly and under tight delivery deadlines with a strong attention to details</li>\n</ul>\n<p> </p>\n<p><strong>Preferred Qualifications</strong></p>\n<ul>\n <li> Experience with Kafka, MongoDB, Cassandra</li>\n <li> Familiarity with data modelling with Erwin or similar tool (PURE modelling knowledge is a plus)</li>\n <li> Familiarity with Amazon Web Services (AWS)</li>\n <li> Familiarity with Datalake / Pure</li>\n <li> Familiarity with SecDb/Slang</li>\n</ul>\nABOUT GOLDMAN SACHS\n<p>The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world. Â© The Goldman Sachs Group, Inc., 2018. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet.</p>"}