{"job title": "Personal Financial Management - Decision and Data Scientist", "company": "Goldman Sachs", "city state": "– US-NY-New York", "rating": "3.9", "job description": "MORE ABOUT THIS JOB\n<p><strong>Consumer and Commercial Banking (CCBD)</strong></p>\n<p>Consumer and Commercial Banking brings innovative solutions to traditional banking activities. We are a global team of lenders, investors, risk managers, skilled marketers, web experts and banking specialists. We provide a suite of solutions to help our customers meet their personal financial goals. We make direct investments in, and risk manage, a portfolio of corporate loans and securities. And we help transform distressed communities through investments and loans of private capital.</p>\n<p> </p>\n<p><strong>Digital Finance Description</strong></p>\n<p>Digital Finance, a business unit within CCBD, is comprised of the firm’s digitally-led consumer businesses, which include the Marcus deposits and lending businesses, as well as the personal financial management app, Clarity Money. Digital Finance combines the strength and heritage of a 148-year-old financial institution with the agility and entrepreneurial spirit of a tech start-up. Through the use of machine learning and intuitive design, we provide customers with powerful tools that are grounded in value, transparency and simplicity to help them make smarter decisions about their money.</p>\n<p><strong> </strong></p>\n<p><strong>Your Impact</strong></p>\n<p>Clarity Money is a business recently acquired by Goldman Sachs that offers a revolutionary AI- and machine learning-based product for consumers to improve their financial health. Ushering in a new era of mobile personal finance management apps, Clarity Money uses artificial intelligence and data science to help consumers make smarter financial decisions and get the most from their money. The revolutionary features allow users to cancel bills, get a better credit card and create a savings account, all from within the app, and all at the push of a button.</p>\n<p> </p>\n<p>The Clarity Money team is actively seeking a motivated Data Scientist with proven industry experience in machine learning, data analysis and algorithm optimization. The ideal candidate is a strong individual contributor, positive team player and willing to get things done. Strong computer science fundamentals are key to success in this role.</p>\nRESPONSIBILITIES AND QUALIFICATIONS\n<p><strong><em>Required Qualifications:</em></strong></p>\n<ul>\n <li>5+ years of relevant industry experience.</li>\n <li>Solid engineering and programming skills. Ability to write high performance production quality code with Python and/or Scala.</li>\n <li>Proficiency in probability, statistics, feature engineering and exploratory data analysis and extracting insights using R or similar tools.</li>\n <li>Experience with developing, maintaining and iterating over large-scale machine learning systems to drive improvement of current products and the development of novel features and products within the company’s vision.</li>\n <li>Experience with Python libraries like NumPy, SciPy, NLTK, scikit-learn and SQLalchemy.</li>\n <li>Experience with technologies like Relational, NoSQL, Streams, Spark/YARN (AWS is plus).</li>\n</ul>\n<p><strong><em> </em></strong></p>\n<p><strong><em>Preferred Qualifications:</em></strong></p>\n<ul>\n <li>Passionate about staying up-to-date with advances in deep learning across various fields.</li>\n <li>Strong command in machine learning frameworks like TensorFlow or PyTorch.</li>\n <li>Drive, collaborate and align with various business divisions to ideate and build data-driven solutions.</li>\n <li>Self-starter and curious.</li>\n <li>Ability to engage with other teams to design the optimal data architecture for a new scale platform and infrastructure to support data and analytics based product innovation.</li>\n <li>Experience with consumer products/services (including but not limited to: consumer lending, mobile banking applications, deposits etc.).</li>\n</ul>\nABOUT GOLDMAN SACHS\n<p>The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.© The Goldman Sachs Group, Inc., 2018. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet.</p>"}