{"job title": "Technology Risk - Measurement - Data Modeling Engineer", "company": "Goldman Sachs", "city state": "– US-NY-New York", "rating": "3.9", "job description": "MORE ABOUT THIS JOB\n<p>What We DoAt Goldman Sachs, our Engineers don’t just make things – we make things possible. Change the world by connecting people and capital with ideas. Solve the most challenging and pressing engineering problems for our clients. Join our engineering teams that build massively scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Create new businesses, transform finance, and explore a world of opportunity at the speed of markets.Engineering, which is comprised of our Technology Division and global strategists groups, is at the critical center of our business, and our dynamic environment requires innovative strategic thinking and immediate, real solutions. Want to push the limit of digital possibilities? Start here.Who We Look ForGoldman Sachs Engineers are innovators and problem-solvers, building solutions in risk management, big data, mobile and more. We look for creative collaborators who evolve, adapt to change and thrive in a fast-paced global environment.Goldman Sachs Technology Risk is leading threat, risk analysis and data science initiativesthat are helping to protect the firm and our clients from information and cyber security risks. Our team equips the firm with the knowledge and tools to measure risk, identify and mitigate threats and protect against unauthorized disclosure of confidential information for our clients, internal business functions, and our extended supply chain.GLOBAL RISK MEASUREMENT &amp; ANALYTICS identifies control weakness, adherence to regulatory requirements, and allows for the continuous control monitoring of individual key performance indicators that demonstrate the value of information security. This programleverages tools and modeling to ensure technology policies and standards address critical risks and adequately address regulatory expectations throughout the Firm.The Goldman Sachs Group, Inc. is a leading global financial services firm providing investment banking, securities and investment management services to a substantial and diversified client base that includes corporations, financial institutions, governments and high-net-worth individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in London, Frankfurt, Tokyo, Hong Kong and other major financial centers around the world. The Goldman Sachs Technology Risk organization is a key part of the Goldman Sachs technology organization, and encompasses Information Security, Risk Advisory, Measurement and Governance functions. The measurement and analytics team within Technology Risk is tasked with building and managing technology solutions that help the Firm protect its information assets, while measuring and managing risk. Establishing a sound set of security solutions is a key mission for the measurement and analytics team; and is central to the success of the Technology Risk organization. We are looking for a highly motivated and technically savvy data modeling engineer for our Technology Risk measurement and analytics team. This position will be based in New York, NY.</p>\nRESPONSIBILITIES AND QUALIFICATIONS\n<p><b>HOW YOU WILL FULFILL YOUR POTENTIAL</b>• Design, implement and maintain data models for risk and technology for use in measurement and analytics.• Ensure data models adhere to enterprise data architecture standards.• Design, implement and maintain refiners to transform raw data in our Data Lake into generalized risk and technology data models• Ensure data transforms/refinement adhere to enterprise software development standards and testing methodology.• Contribute to architectural discussions and drive continuous improvement of the data platforms supporting Technology Risk.• Drive the adoption of enterprise data technologies to improve the reliability and scalability of implemented solutions.• Work closely with technology partners to leverage distributed computing systems, adhere to development best practices and standards, and build reusable and extendable solutions.• Keep up to date with emerging technologies, tools, and techniques in the areas data collection and analysis.<b>SKILLS AND EXPERIENCE WE ARE LOOKING FOR</b>• Strong scripting ability in one or more languages (e.g. python, scala, bash).• Strong knowledge of DDL and DML for relational database technologies such as DB2, Oracle, SQL Server, and Sybase• Experience with big data technologies such as Hadoop, Spark, Hive and Pig.• Experience with test-driven development and unit testing.• Knowledge of data warehousing, and the development of physical and logical models.• Familiarity with SCRUM or similar agile discipline is preferred.<b>Preferred Qualifications</b>• Experience designing, implementing, and maintaining ETL and data flow processes in an enterprise environment.• Bachelor’s degree or higher preferred or other professional qualifications.• 5+ years of related Information Technology experience.• Small-medium scale project management skills• Clear communication skills, both verbally and in writing.• Excellent organization and interpersonal skills.• Strong attention to detail, organization, and analytical ability.• The ability to work both individually, and as part of a global team.</p>\nABOUT GOLDMAN SACHS\n<p>The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world. Â© The Goldman Sachs Group, Inc., 2018. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet.</p>"}