{"job title": "GSAM Technology - Data Science and Machine Learning Engineer", "company": "Goldman Sachs", "city state": "– US-NY-New York", "rating": "3.9", "job description": "MORE ABOUT THIS JOB<br><br><strong>What We Do</strong>\n<br><br>\nAt Goldman Sachs, our Engineers don’t just make things – we make things possible. Change the world by connecting people and capital with ideas. Solve the most challenging and pressing engineering problems for our clients. Join our engineering teams that build massively scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Create new businesses, transform finance, and explore a world of opportunity at the speed of markets<strong>.</strong>\n<br><br>\nEngineering, which is comprised of our Technology Division and global strategists groups, is at the critical center of our business, and our dynamic environment requires innovative strategic thinking and immediate, real solutions. Want to push the limit of digital possibilities? Start here.\n<br><br>\n<strong>Who We Look For</strong>\n<br><br>\nGoldman Sachs Engineers are innovators and problem-solvers, building solutions in risk management, big data, mobile and more. We look for creative collaborators who evolve, adapt to change and thrive in a fast-paced global environment.\n<br><br>\nGoldman Sachs Investment Management Division delivers innovative investment solutions through a global, multi-product platform that offers clients the advantages that come with working with a large firm, while maintaining the benefits of a boutique. IMD is one of the pre-eminent investment management organizations globally. Critical to the success of IMD is our ability to leverage a global team of talented professionals to define solutions and lead change across the operational infrastructure.\n<br><br>\nIMD Knowledge Management team is looking to expand its presence in New York with the addition of a senior data scientist and machine learning engineer. The team is responsible for building and deploying a world-class information management platform. This role will offer challenging opportunities for performance-driven growth in a team oriented environment and includes direct exposure to multiple businesses.<br><br>RESPONSIBILITIES AND QUALIFICATIONS<br><br><strong>Job Responsibilities</strong>\n\n<ul>\n\n <li>Leverage machine learning and natural language processing to provide semantic intelligence to our software platforms</li>\n<li>Actively participate in all phases of software development lifecycle: analysis, technical design, planning, development, testing, release, production support</li>\n<li>Build partnerships with research analysts and portfolio managers to drive efficiency in their use of our research technology platform</li>\n<li>Work closely with technology and strategy teams across the firm to build high quality, secure, and maintainable systems using approved tools and software development practices</li>\n<li>Develop deep Investment Management business knowledge; interact with business functions and technology teams across IMD and the wider Goldman Sachs group, Goldman Sachs Asset Management is one of the world's leading asset management institutions. GSAM delivers innovative investment solutions on a global, multi-product platform. Our products include Hedge Funds, Private Equity, Fund of Funds, Quantitative Strategies, Fixed Income, Fundamental Equity and a Global Portfolio Solutions Business. GSAM Technology is directly aligned to the business. Software is engineered in a fast-paced, dynamic environment, adapting to market and customer needs to deliver robust solutions in an ever-changing business environment. GSAM Technology builds on top of cutting edge in-house platforms complimented with a strong focus on leveraging open source solutions, Engineer tools and services that bring unification and scale to Asset Management division, providing solutions that span Sales, Client Servicing, Research, Portfolio Management and Trading.</li>\n</ul>\n<strong>Basic Qualifications</strong>\n\n<ul>\n\n <li>Extensive knowledge of natural language processing and machine learning techniques and ability to apply them at a professional level</li>\n<li>Proficiency in multiple programming languages including Java and Python, willing to learn new languages as needed</li>\n<li>High degree of proficiency in data analysis and preparation techniques</li>\n<li>Strong quantitative skills with the ability to apply both simple and complex statistical methods</li>\n<li>Extensive knowledge of natural language processing and machine learning techniques and ability to apply them at a professional level</li>\n<li>Experienced in imperative, functional and object-oriented programming paradigms and know when to use which</li>\n<li>Focused on developing scalable solutions that solve a particular problem, but are generalized to the right level such that the same solution can be applied to other problems</li>\n<li>Embrace test-driven development and other agile techniques in order to produce quality software. Constantly try to improve existing systems / architecture</li>\n<li>Keep on top of the latest advancements in software development</li>\n<li>Willingness to join a small team of like-minded, quality focused professionals in a fast-paced environment with high focus on product delivery and constant innovation where you will be able to make a significant impact to the overall platform</li>\n</ul>\n\nABOUT GOLDMAN SACHS<br><br>The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.© The Goldman Sachs Group, Inc., 2018. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet."}