{"job title": "Personal Financial Management - Chief Data Scientist - Vice President", "company": "Goldman Sachs", "city state": "– US-NY-New York", "rating": "3.9", "job description": "MORE ABOUT THIS JOB<br><br><strong>Consumer and Commercial Banking (CCBD)</strong>\n<br><br>\nConsumer and Commercial Banking brings innovative solutions to traditional banking activities. We are a global team of lenders, investors, risk managers, skilled marketers, web experts and banking specialists. We provide a suite of solutions to help our customers meet their personal financial goals. We make direct investments in, and risk manage, a portfolio of corporate loans and securities. And we help transform distressed communities through investments and loans of private capital.\n<br><br>\n<strong>Digital Finance Description</strong>\n<br><br>\nDigital Finance, a business unit within CCBD, is comprised of the firm’s digitally-led consumer businesses, which include the Marcus deposits and lending businesses, as well as the personal financial management app, Clarity Money. Digital Finance combines the strength and heritage of a 148-year-old financial institution with the agility and entrepreneurial spirit of a tech start-up. Through the use of machine learning and intuitive design, we provide customers with powerful tools that are grounded in value, transparency and simplicity to help them make smarter decisions about their money.<br><br>RESPONSIBILITIES AND QUALIFICATIONS<br><br><strong>Your Impact</strong>\n<br><br>\nClarity Money is a business recently acquired by Goldman Sachs that offers a revolutionary AI- and machine learning-based product for consumers to improve their financial health. Ushering in a new era of mobile personal finance management apps, Clarity Money uses artificial intelligence and data science to help consumers make smarter financial decisions and get the most from their money. The revolutionary features allow users to cancel bills, get a better credit card and create a savings account, all from within the app, and all at the push of a button.\n<br><br>\n<strong>EXPERIENCE</strong>\n\n<ul>\n\n <li>Advanced Degree (ideally PhD) in Statistics, Mathematics, Operations Econometrics or related field</li>\n<li>5+ years of experience in analyzing large data sets to drive significant business decisions</li>\n<li>Strong statistical background, especially in experimentation and modelling</li>\n<li>Track record in establishing clear, impactful AI architecture in complex, data-driven organization (not necessarily in financial services)</li>\n<li>Strong people leadership skills</li>\n<li>Proficiency in a statistics tools like R and Big Data</li>\n<li>Exceptional presentation skills and ability to communicate methodologies and results clearly and concisely</li>\n<li>Lead strategic analyses to understand customer behavior and develop business success metrics</li>\n<li>Strong interpersonal skills and ability to work with cross-functional teams</li>\n<li>Ability to drive research projects</li>\n<li>Experience with experimentation methodologies - post-stratification, quasi-experimental research designs, sequential testing</li>\n<li>Experience with Bayesian techniques, Multi-armed bandit algorithm</li>\n</ul>\n<strong>RESPONSIBILITIES</strong>\n<br><br>\nData Collection/ Analysis:\n\n<ul>\n\n <li>Program and analyze dashboards for relevant information, including historical trends</li>\n<li>Manage dashboards to track what users are doing</li>\n<li>Extract data to run through analytics platforms and visualize data</li>\n</ul>\nData Cleanup:\n\n<ul>\n\n <li>Extract signal from noise</li>\n<li>Convert to information and generate insights</li>\n<li>Information extraction</li>\n</ul>\nStatistical Modeling:\n\n<ul>\n\n <li>Create algorithms that easily scale with amount of data and users</li> <li>“Machine learning” – constructing algorithms so teams can learn from and make predictions on data</li>\n<li>Natural language processes (NLP)</li>\n</ul>\nCreating &amp; Developing:\n\n<ul>\n\n <li>New software applications</li>\n<li>File patents for inventions on behalf of the company</li>\n<li>Developing commercial solutions using Big Data technologies such as Hadoop, Spark, Pig, Hive, Kafka, Storm, Cassandra, Neo4j, etc.</li>\n<li>Develop production quality code to run in our data processing centers</li>\n</ul>\nResearch &amp; Reporting:\n\n<ul>\n\n <li>Coordinate and execute all phases of market research</li>\n<li>Deliver current and relevant customer and market insights</li>\n<li>Develop longitudinal survey studies to provide insights on emerging consumer needs and industry gaps</li>\n<li>Design and conduct exploratory user studies, including surveys, market studies, attitude, usage and brand tracking studies</li>\n<li>Create dynamic and actionable reports that bring the data to life</li>\n<li>Track and summarize consumer trends to help keep internal stakeholders informed</li> \n</ul>\nAnalysis:\n\n<ul>\n\n <li>Competitive analysis, industry analysis, scenario modeling</li>\n<li>Maintain understanding of financial, strategic and marketing imperatives, product and service roadmap and competitive dynamics in the marketplace</li>\n<li>Understand how business interacts with brands and customers, with deep knowledge of the role that technology plays in this relationship</li>\n</ul>\nStrategy:\n\n<ul>\n\n <li>Develop and initiate digital strategies that can be applied across multiple business lines and channels</li>\n<li>Interact with global marketing and product development teams across all stages to support their design and implementation of impactful market research activities, including synthesis and communication of results and findings</li>\n<li>Build relationships with the internal and client teams to foster relationships and drive adoption of our strategies</li>\n</ul>\n\nABOUT GOLDMAN SACHS<br><br>The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.© The Goldman Sachs Group, Inc., 2018. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet."}