{"job title": "Commercial Banking Engineering – Data Engineering - Software Engineer", "company": "Goldman Sachs", "city state": "– US-NY-New York", "rating": "3.9", "job description": "MORE ABOUT THIS JOB\n<p>What We DoAt Goldman Sachs, our Engineers don’t just make things – we make things possible. Change the world by connecting people and capital with ideas. Solve the most challenging and pressing engineering problems for our clients. Join our engineering teams that build massively scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Create new businesses, transform finance, and explore a world of opportunity at the speed of markets.Engineering, which is comprised of our Technology Division and global strategists groups, is at the critical center of our business, and our dynamic environment requires innovative strategic thinking and immediate, real solutions. Want to push the limit of digital possibilities? Start here.Who We Look ForGoldman Sachs Engineers are innovators and problem-solvers, building solutions in risk management, big data, mobile and more. We look for creative collaborators who evolve, adapt to change and thrive in a fast-paced global environment.What We Do At Goldman Sachs, our Engineers don’t just make things – we make things possible. We change the world by connecting people and capital with ideas and solve the most challenging and pressing engineering problems for our clients. Our engineering teams build scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Engineering, which is comprised of our Technology Division and global strategist groups, is at the critical center of our business. Our dynamic environment requires innovative strategic thinking. Want to push the limit of digital possibilities? Start here. Who We Look For Goldman Sachs Engineers are innovators and problem-solvers, building solutions in risk management, big data, mobile and more. We look for creative collaborators who evolve, adapt to change and thrive in a fast-paced global environment. The Consumer and Commercial Banking Division(CCBD) brings innovative solutions to traditional banking activities. We are a global team of lenders, investors, risk managers, skilled marketers, web experts and banking specialists. We provide a suite of solutions to help our customers meet their financial goals. We make direct investments in and manage risk for a portfolio of corporate loans and securities. We help transform distressed communities through investments and loans of private capital. Commercial Banking Commercial Banking, a business unit within CCBD, aims to provide comprehensive cash management solutions for corporations. CCBD Commercial Banking combines the strength and heritage of a 148-year-old financial institution with the agility and entrepreneurial spirit of a tech start-up. Our goal is to provide the best client experience. Through the use of modern technologies centered on data and analytics, we provide customers with powerful tools that are grounded in value, transparency and simplicity to improve cash flow management efficiency.</p>\nRESPONSIBILITIES AND QUALIFICATIONS\n<p><strong>HOW YOU WILL FULFILL YOUR POTENTIAL</strong>• Data and Liquidity Analytics is a global team (NewYork/London/Bengaluru) responsible for building the data platform for the Commercial Banking suite of applications. The data platform will power all our tools, reports and analytics including our liquidity analytics. These models and tools allow efficient cash flow analysis and are of primary importance for our clients.• As part of our global team, you will drive the development and the delivery of our data platform. This is a leadership role with the expectation that you will understand our product roadmap, foster an engineering culture, hire and grow talent and deliver a high quality data platform for our clients. This initiative is of critical important to the success of the organization and our roadmap. Services like liquidity analytics, billing, client onboarding, reporting and others will rely on the data platform. Accurate, granular, complete and timely data will be our key differentiating factor and competitive advantage in the market place. We expect the successful candidate to deliver in lock step with rest of the application development teams and to establish strong partnerships with peers.• Manage multiple tasks and use sound judgment when prioritizing</p>\n<p>• Collaborate with global cross functional team in building customer-centric products</p>\n<p>• Analyze existing software implementations to identify areas of improvement and provide deadline estimates for implementing new features</p>\n<p>• Update and maintain documentation for team processes, best practices and software runbooks</p>\n<p>• Establish trusted partnerships with peers, product heads, and executive level stakeholders</p>\n<p>• Must be passionate about technology and engineering</p>\n<p>• Exceptional analytical skills and ability to apply knowledge and experience in decision-making to arrive at creative and commercial solutions</p>\n<p>• Ability to leverage technology to deliver business value</p>\n<p>• Must be independent and comfortable in a fast paced, ambiguous and often multi-directional work environment<strong>SKILLS AND EXPERIENCE WE ARE LOOKING FOR</strong>• Minimum 2 years of relevant professional experience using a modern programming language (preferably Java/Scala)• B.S. or higher in Computer Science (or equivalent work experience)• Experience leveraging test driven development technics• Comfort with Agile operating models• Team oriented• Strong interpersonal and communication skills• Energetic, self-directed, and self-motivated<strong>Preferred Qualifications</strong>• Experience with microservice architecture• Experience with Kafka, MongoDB, Hadoop, Cassandra• Experience with AWS• Experience in Financial Services or Fintech</p>\nABOUT GOLDMAN SACHS\n<p>The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world. Â© The Goldman Sachs Group, Inc., 2018. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet.</p>"}