{"job title": "Technology Risk - Security Incident Response Team - SIRT TMC Snr Sec Data Scientist", "company": "Goldman Sachs", "city state": "– US-TX-Dallas", "rating": "3.9", "job description": "MORE ABOUT THIS JOB\n<p>What We DoAt Goldman Sachs, our Engineers don’t just make things – we make things possible. Change the world by connecting people and capital with ideas. Solve the most challenging and pressing engineering problems for our clients. Join our engineering teams that build massively scalable software and systems, architect low latency infrastructure solutions, proactively guard against cyber threats, and leverage machine learning alongside financial engineering to continuously turn data into action. Create new businesses, transform finance, and explore a world of opportunity at the speed of markets.Engineering, which is comprised of our Technology Division and global strategists groups, is at the critical center of our business, and our dynamic environment requires innovative strategic thinking and immediate, real solutions. Want to push the limit of digital possibilities? Start here.Who We Look ForGoldman Sachs Engineers are innovators and problem-solvers, building solutions in risk management, big data, mobile and more. We look for creative collaborators who evolve, adapt to change and thrive in a fast-paced global environment.Goldman Sachs Technology Risk is leading threat, risk analysis and data science initiativesthat are helping to protect the firm and our clients from information and cyber security risks. Our team equips the firm with the knowledge and tools to measure risk, identify and mitigate threats and protect against unauthorized disclosure of confidential information for our clients, internal business functions, and our extended supply chain.SECURITY INCIDENT RESPONSE TEAM (SIRT) supports and enables a comprehensive technical Cyber Defense program for the firm while increasing awareness of current and potential Cyber Threats. Works across the organization to operate efficiently, provide technicalinvestigative support and mitigate threats to the firm.Do you enjoy solving challenging puzzles? Protecting critical networks from cyber-attacks? Designing and integrating state-of-the-art technical solutions? A position as a Security Analyst on Goldman Sachs’ Threat Management Center lets you do all this and more:</p>\nRESPONSIBILITIES AND QUALIFICATIONS\n<p><strong>HOW YOU WILL FULFILL YOUR POTENTIAL</strong>• Do you enjoy solving challenging puzzles? Protecting critical networks from cyber-attacks? Designing and integrating state-of-the-art technical solutions? A position as a Security Analyst on Goldman Sachs’ Threat Management Center lets you do all this and more: • Apply statistical methodology, machine learning, and Big Data analytics for network modelling, anomaly detection, forensics, and risk management. • Responsible for the creation of innovative methodologies for extracting key parameters from big data coming from various sensors. • Utilize expertise in machine learning, statistical data analytics, and predictive analytics to help implement analytics tied to cyber security and hunting methodologies and applications • Design, develop, test and deliver complex analytics in a range of programming environments on large data sets • Apply latest technologies in machine learning, data mining, and predictive analytics to correlate the big datasets and events, and derive dynamic cybersecurity rules. • Generate highly accurate and near real-time security alerts based on the dynamic rules. • Collaborate with a global team to continually operate and improve a world-class cyber program by driving the uplift of sensory tools, detection tuning, and access to data sources to increase detection effectiveness by applying data analytics. • Experience in statistics, visual analytics, machine learning algorithms, data mining, text mining, customer analytics, optimization and risk analytics. • Experience in setting up Hadoop Clusters, and working on large data sets in a distributed computing environment. • Experience with programming languages including Java, Python, R,&amp; SQL • Convey complicated technical analysis to senior management via investigation synopses, graphical depictions of attacks, and comprehensive presentations. • Participate in a 24x7 coverage model to prevent and remediate security threats against Goldman Sachs’ global business network.• Responsible for the creation of innovative methodologies for extracting key parameters from big data coming from various sensors.• Utilize expertise in machine learning, statistical data analytics, and predictive analytics to help implement analytics tied to cyber security and hunting methodologies and applications• Design, develop, test and deliver complex analytics in a range of programming environments on large data sets• Design, develop, test and deliver complex analytics in a range of programming environments on large data sets• Apply latest technologies in machine learning, data mining, and predictive analytics to correlate the big datasets and events, and derive dynamic cybersecurity rules.• Generate highly accurate and near real-time security alerts based on the dynamic rules.• Collaborate with a global team to continually operate and improve a world-class cyber program by driving the uplift of sensory tools, detection tuning, and access to data sources to increase detection effectiveness by applying data analytics.• Experience in statistics, visual analytics, machine learning algorithms, data mining, text mining, customer analytics, optimization and risk analytics.• Experience in setting up Hadoop Clusters, and working on large data sets in a distributed computing environment.• Experience with programming languages including Java, Python, R,&amp; SQL• Convey complicated technical analysis to senior management via investigation synopses, graphical depictions of attacks, and comprehensive presentations.• Participate in a 24x7 coverage model to prevent and remediate security threats against Goldman Sachs’ global business network.<strong>SKILLS AND EXPERIENCE WE ARE LOOKING FOR</strong>• Strong English verbal and written communication skills.• Ability to multi-task and prioritize work effectively.• Highly motivated self-starter who can provide thought leadership in big data analytics.• Responsive to challenging tasking.• Ability to document and explain technical details in a concise and understandable manner.• Strong sense of ownership and driven to manage tasks to completion.• Minimum 7 years full time work post graduate work experience with minimum 2 years work experience leading small teams of less than 10 employees.• 3 - 5 years of big data analytics techniques and methods for identifying uncovered information and ability to communicate effectively through visualization and multivariate statistics.• 3 - 5 years experience with scalable distributed data processing, management, and visualization tools (e.g. Hadoop, Apache Spark, Accumulo, graph databases, etc.).• Proven knowledge of industry leading scripting tools such as Python, Powershell, R and SQL<strong>Preferred Qualifications</strong>• Bachelor of Science in Computer Science, System/Computer Engineering, Cyber-Security, or Information Security is preferred. Four (4) years of additional work experience may be substituted in lieu of a Bachelor’s Degree. Bachelors of Science/Arts in Forensic Computing, System/Computer Engineering, Data Science, Engineering, Operations Research, or Decision Science will be considered.• Strong mathematical background (linear algebra, calculus, probability and statistics).• Previous work experience in Cyber Security field is a plus.• Excellent oral, written, and presentation communication skills required.• Experience with cloud based big data platforms such as AWS or Google a plus</p>\nABOUT GOLDMAN SACHS\n<p>The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world. Â© The Goldman Sachs Group, Inc., 2018. All rights reserved Goldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Vet.</p>"}