{"job title": "(USA-CA-Mountain View) Director, Applied Data Science", "company": "Google Inc.", "city state": "– Mountain View, CA", "rating": "4.4", "job description": "The gTech Professional Services team is looking for someone to lead our global data science team. You have a track record of leading services teams that span multiple products and regions, delighting customers and succeeding in supporting growing product adoption. You have experience working closely with our largest clients, and produce innovative and actionable quantitative models and analyses to address the challenges of marketing effectiveness and business growth.\n<br><br>\nGoogle creates products and services that make the world a better place, and gTechs role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.\n<br><br>\nTo learn more about gTech, check out our video.\n<br><br>\n## Responsibilities\n\n\n<ul>\n<li>Deliver effective presentations of findings and recommendations to multiple levels of stakeholders, creating visual displays of quantitative information.</li>\n<li>Lead multi-country and region projects and large-scale programs across many Google teams, including the different data science teams.</li>\n<li>Field challenges, concerns and/or opportunities from projects related to scope, ongoing maintenance, complexity and contacts. Challenge and improve internal processes constructively and potentially influence changes in external business partner or client processes.</li>\n<li>Collaborate with clients to build an end-to-end machine learning framework. Engage various stakeholders, assess data readiness. Be able to scale a proof of concept to a larger solution.</li>\n<li>Develop comprehensive understanding of Google data structures and metrics, advocating for product changes where needed.</li>\n</ul>\n\n## Qualifications\n<br><br>\n<strong>Minimum qualifications:</strong>\n\n\n<ul>\n<li>Master's degree in Statistics, Mathematics, Economics, Electrical Engineering, Physics, Industrial Engineering, Chemistry or Applied Science or equivalent practical experience with an emphasis on work of a quantitative nature.</li>\n<li>10 years of experience in quantitative analytics with a focus on marketing analytics, statistical modeling, machine learning, digital attribution, forecasting, optimization and/or predictive analytics.</li>\n<li>Experience programming with TensorFlow, Python and/or R, and experience working with advertising media and experience in translating analysis results into business recommendations and business questions into an analysis framework.</li>\n</ul>\n\n<strong>Preferred qualifications:</strong>\n\n\n<ul>\n<li>PhD degree in Statistics, Mathematics, Economics or a similar technical/quantitative field.</li>\n<li>Experience delivering bespoke analytics to stakeholders (problem scoping/definition, modeling, interpretation, presentation).</li>\n<li>Consulting / services background in BI/Analytics, with the ability to engage at various levels and a diverse mix of client vertical experience, including: retail, financial services/retail banking, insurance, telecommunications, automotive and CPG.</li>\n<li>Advanced proficiency with analytic software tools such as SQL, R, SAS, SPLUS, Eviews and a good understanding of the statistical algorithms typically used in Marketing Analytics and experience using and/or deploying digital analytics and measurement solutions, and experience in SQL and big data.</li>\n<li>A strong understanding of media (paid, owned and earned) as well as quantitative analytics experience (with strong focus on marketing analytics, market mix modeling and/or digital attribution).</li>\n<li>High EQ that enables close working relationships with key leaders at top companies worldwide and ability to select, attract, motivate, retain, and develop leaders and team members. Ability to accurately appraise the strengths and weaknesses of team members and build a strong, diverse team that complements each other to achieve outstanding results. Ability to visualize models and results, with the ability to debug and troubleshoot code and models.</li>\n<li>* *</li>\n</ul>\n\nAt Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.\n<br><br>\nTo all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}