{"job title": "(USA-CA-Mountain View) Computational Biologist, X", "company": "Google Inc.", "city state": "– Mountain View, CA", "rating": "4.4", "job description": "Computational Biologist, X\n<br><br>\nHardware Engineering\n<br><br>\nMountain View, CA (HQ)\n<br><br>\n<strong>Team:</strong>\n<br><br>\nThis role is for a confidential, early-stage moonshot technology.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n+ Design statistical decision-making agronomic tools (e.g. yield estimation, genetic prediction, drivers of stress) for real-world users\n<br><br>\n+ Collaborate with hardware team and ML experts to define precision, accuracy, sensor type and environmental measurement needed to capture plant traits of interest.\n<br><br>\n+ Conduct academic literature review (e.g. phenotyping, crop modeling) and stay abreast of relevant work in the research community. Summarize findings to the team on a monthly basis and lead internal investigations into areas of interest.\n<br><br>\n+ Build relationships with leading public ag research organizations in appropriate domains and be the agronomy expert representing the teams capabilities to partners and customers.\n<br><br>\n+ Represent the voice of the breeder and voice of the farmer on the team and lead experimental design development for each project.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<br><br>\n+ Bachelors degree in biostatistics, bioinformatics, crop modelling, or agronomy\n<br><br>\n+ 3 years work or research experience in applied agricultural technology\n<br><br>\n+ Programming experience in R, Python.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\n+ Familiarity with a breadth of crops.\n<br><br>\n+ Able to explain complex concepts to a non-ag audience\n<br><br>\n+ Familiarity with farming and/or precision agriculture strongly preferred\n<br><br>\nAbout X, the moonshot factory\n<br><br>\nX creates radical new technologies to solve some of the worlds biggest problems. We developuncomfortably ambitious, potentially world-changing new ideas such as self-driving cars, balloon-powered Internet and smart contact lenses. Were a team of makers, entrepreneurs, engineers, designers and scientists with deep technical expertise who love the challenge of the seemingly impossible. X was formerly known as Google[x] and is part ofAlphabet.\n<br><br>\nAt X, we don't just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. We are proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\n<br><br>\nIf you have a disability or special need that requires accommodation, please contact us at:x-accommodation-request@x.team.\n<br><br>\nReasonable Accommodation Notice"}