{"job title": "Data Scientist", "company": "Grammarly", "city state": "– San Francisco, CA", "rating": "4.7", "job description": "<strong>The Opportunity</strong>\n<br><br>\nEffective communication is hard. It requires talent, skill, and a lot of effort. Enter Grammarly, the first widely adopted AI communication assistant helping people with the substance and impact of their writing. Grammarly helps millions of people make their written communication clear, mistake-free, and effective. With a $110 million growth equity investment, Grammarly is changing the way the world communicatesenabling people to write exactly what they mean, and be fully understood.\n<br><br>\nTo help us reach that goal, Grammarly is looking for a hands-on Data Scientist. As a consumer Internet company, we produce huge amounts of data, and you will find the insights to make it actionable. You will have broad impact and exposure across Grammarly, working with team members from our product, research, marketing, engineering, and finance teams.\n<br><br>\nAt Grammarly, our impact comes from a strong culture with highly engaged, highly motivated team members. We hire exceptional people and reward them with trust, autonomy, mentorship, and the freedom to grow into their roles. We're a passionate, growing team on a mission to improve lives by improving communication. If you're up for the challenge, we would love to meet you!\n<br><br>\n<strong>What You Will Accomplish</strong>\n\n<ul>\n<li>Within your first month, you will start developing a good understanding of the overall data processing pipeline, understand a subset of Grammarly's key metrics, and complete at least two small data reports and present to relevant business owners.</li>\n<li>By month three, you will become an expert user of our analytical tools, start contributing to the Data Science team's projects, understand all of Grammarly's key metrics, and independently work on small to medium complexity data projects (including A/B tests, channel analysis, and user engagement).</li>\n<li>By month six, you will start working independently on complex data projects, such as user segmentation, short- and long-term user engagement analysis, and lifetime value projections.</li> \n\n<li>By year one, you will become the go-to person and subject-matter expert for a few of Grammarly's key metrics, own and drive projects independently with minimal supervision, and along with our other Data Scientist, ensure \"data science excellence\" at Grammarly (dashboards, high quality reports, empowered teams, etc.).</li>\n</ul>\n<strong>Talents You Bring to the Team</strong>\n\n<ul>\n<li>A PhD in a quantitative field, or a Masters in a quantitative field + 2 years of experience working as a Data Scientist</li>\n<li>Experience in data analysis, A/B testing, retention tracking, etc. (consumer product experience preferred)</li>\n<li>Proficient in data mining and statistics</li>\n<li>Experience with SQL, and programming in Python, R, Scala or equivalent language</li>\n<li>Strong analytical and critical thinking skills and a strong bias toward actionable insights; love of finding insights and getting others to act on them</li>\n<li>You embody our E.A.G.E.R. values (Ethical, Adaptable, Gritty, Empathetic, Remarkable)</li>\n<li>You are a self-starter with superior organizational and prioritization skills</li>\n</ul>\n<strong>What Grammarly Offers You</strong>\n\n<ul>\n<li>Big goals, challenging work, fast learning cycles, practical training, and meaningful feedback.</li>\n<li>Project exposure and ownership that impacts our world, users, product, colleagues, and business.</li>\n<li>Health care, 401K, communication coaching, and great coworkers!</li>\n</ul>\n<strong>About Grammarly</strong>\n<br><br>\nGrammarly's AI-powered products help people communicate more effectively. Grammarly is available in a variety of writing interfaces, including browser and desktop integrations to help users in both their personal and professional lives, whether they are communicating through email or social media, applying for jobs, or even filling out online dating profiles. It also increases productivity and efficiency for professionals in a wide range of fields, including marketing, sales, engineering, customer support, and education. Grammarly is headquartered in San Francisco with offices in New York and Kyiv.\n<br><br>\nThe diverse experiences, ideas, and identities of Grammarly's team members help us make better decisions and drive great results for our users. We foster an inclusive work environment that welcomes team members of all backgrounds and perspectives. As an equal opportunity employer, we evaluate candidates based solely on talents, skills, and knowledge. Grammarly participates in E-Verify."}