{"job title": "Data Scientist, AcreValue", "company": "Granular", "city state": "– San Francisco, CA", "rating": "4.4", "job description": "More than 7 billion people depend on farms for healthy and affordable food. By 2050, the global population will reach 9.4 billion and farmers will need new ways to deliver on this demand. They'll be seeking options that are economically viable and that will help them remain environmentally sustainable. Granular's software meets this need, making farmers more efficient.\n<br><br>\nWe're looking for a <strong>Data Scientist</strong> to join our AcreValue team. You'll work on a number of projects related to agricultural land: our valuation model (which estimates the value of farmland); land cover models that use satellite imagery to classify land as e.g. corn, soy, or forest; and building detection using CNNs / deep learning. You'll be working with a team of AcreValue data scientists based in San Francisco, and collaborating closely with AcreValue engineering and product management. Come join our team!. This role is integral to Granular's success and is a unique opportunity to join a mission focused, fast-paced, smart and fun team.\n<br><br>\n<strong>What You'll Get To Do</strong>:\n\n<ul>\n<li>Learn our existing codebase and find projects that motivate you (for example, increase the accuracy of our land valuation model, or train a CNN to detect a new type of land improvement in satellite imagery)</li>\n<li>Refine models, evaluate their test accuracy, and predict at scale</li>\n<li>Evaluate new data sources to incorporate into our models and build processing pipelines for them when needed</li>\n<li>Work closely with product management, engineering and design teams to understand how users will interact with our product and models</li>\n<li>Work with Marketing team to ensure our marketing website and promotional landing pages are optimized for conversion</li>\n<li>Create tight alignment with Product and Sales on marketing plans and targets</li>\n</ul>\n<strong>Our Ideal Candidate:</strong>\n\n<ul>\n<li>Strong understanding of machine learning (including gradient boosting for regression and classification, and model validation)</li>\n<li>Experience with CNNs / deep learning is a plus</li>\n<li>Ability to build models and analyze data in Python (experience with Python would be ideal, but you could learn it on the job if you are in expert in other statistical programming languages like R)</li>\n<li>Experience with spatial data analysis a huge plus (rasters, shapefiles, projections)</li>\n<li>Self-guided and independent, able to manage project timelines</li>\n<li>Creative problem solving skills</li>\n<li>Excellent writing, communication and collaboration skills</li>\n<li>Familiarity with agriculture / farming practices a plus, but not required</li>\n<li>MS or PhD in relevant technical field</li>\n</ul>\n<strong>Perks and Benefits:</strong>\n\n<ul>\n<li>Upward mobility. We are growing quickly and need talent who can take on increasingly challenging and rewarding roles</li>\n<li>Generous Vacation</li>\n<li>401k Matching Program</li> \n\n<li>Commuter Benefit Program and Stipend</li> \n\n<li>Employer sponsored Medical, Dental, and Vision</li>\n<li>Vision and Dental FSA and Dependent Care FSA</li>\n<li>Family, Maternity and Paternity Leave</li>\n<li>Paid Adoption Leave and Adoption Assistance</li>\n<li>Dependent care for business travel</li>\n<li>Learning and Development Programs</li>\n<li>Tuition Reimbursement Programs</li> \n\n<li>Open floor plan, dog-friendly offices</li>\n</ul>\n<strong>Who We Are:</strong>\n<br><br>\nGranular combines the leadership and innovation of experienced entrepreneurs, advisors, and investors with the meaningful insights of farmers, agronomists, data scientists and engineers.\n<br><br>\nOur internal team has the rebellious, innovative business and technical acumen that defines Silicon Valley; this expertise that has produced products including Granular Business, Granular Agronomy, AcreValue, and AgStudio.\n<br><br>\nFounded in February 2014, and backed by leading VC's like Andreessen Horowitz and Google Ventures, Granular is an independent subsidiary of Corteva, a spin off of DowDuPont. We currently have offices in San Francisco, CA, Champaign, IL, Des Moines, IA and Cumming, GA."}