{"job title": "Data Scientist", "company": "Grand Rounds", "city state": "– San Francisco, CA", "rating": "4.8", "job description": "<div><div><strong>The Role:</strong> </div><br>\n<div>Data Scientists at Grand Rounds work on problems that are core to the company’s mission. Major challenges include developing systems and models to identify the highest quality doctors in the country as well as methodologies to uncover the subtle differences between each physician’s clinical expertise. Additionally, patient-level modeling allows us to understand the specific healthcare needs of every person. With a high fidelity understanding of both patients and physicians we are able to route patients to both appropriate and high quality care.</div> <br>\n<div>In addition to developing the company’s core technologies, data scientists provide decision support analysis for many teams across the organization including product development, sales, marketing, and strategy. Data scale ranges from small data sets to large multi-terabyte clinical information in distributed database systems.</div><br>\n<div><strong>About Us:</strong></div><br>\n<div>Grand Rounds’ vision is to create a path to great health and health care, for everyone, everywhere. Founded in 2011, the company provides an employer-based platform that delivers improved outcomes for patients and their families. It does this through an end-to-end solution that connects patients with care informed by the latest and best practices—preventing and correcting misdiagnoses and unnecessary or failed treatments. Named second among Glassdoor’s 2016 Best Places to Work, Grand Rounds helps restore individual health and quality of life, and offers employers lower health care spend and higher employee productivity.</div></div><div><div>In your first 30 days, you will:\n\n<ul>\n\n\n<ul>\n<li>Onboard with the Grand Rounds team in San Francisco, setup your dev environment, get access to data systems, and become familiar with the tech stack</li><li>Learn about on-going initiatives involving data scientists, product managers, and engineers</li><li>Spend time with members of the Analytics, Medical, and Patient Care teams and learn how our teams collaborate</li><li>Become familiar with the data landscape and hit the ground running by joining a project team</li></ul>\n</ul>\n\n</div>\n</div><div><div>In your first 60 days, you will:\n\n<ul>\n\n\n<ul>\n<li>Get familiarized with clinical data.</li> <li>Master the ins and outs of claims data: ICDs, CPTs, etc.</li><li>Learn how to use and navigate our various databases and write scripts using our data for various analyses</li><li>Learn about our existing code-base and best practices</li><li>Collaborate with other data scientists to help build our patient-physician matching products</li></ul>\n</ul>\n\n</div>\n</div><div><div>In your first 90 days, you will:\n\n<ul>\n\n\n<ul>\n<li>Integrate into long-term multi-data-scientist ventures and deliver on one or several short-term individual projects</li><li>Perform analyses that help us better understand patients and/or physicians, while helping you get familiarized with our data</li><li>Spend time with Staff Physicians and other medical domain experts to learn about the world of healthcare</li><li>Develop an understanding of both immediate business objectives as well as longer term company aspirations to develop intuition around prioritization and trade-offs between short-term deliverables and longer term R&amp;D efforts</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Responsibilities:\n\n<ul>\n\n\n<ul>\n<li>Develop creative solutions to diverse problems including engineering challenges, unstructured data messes, ontology development, and machine learning applications</li><li>Lead and develop major projects from end-to-end encompassing planning, design, technical implementation, debugging, roll-out to Product &amp; Engineering, testing, and iteration</li><li>Operate at level of sophistication in statistics, machine learning, or computer science that is publication-worthy</li><li>Regularly monitor pull requests, perform code reviews, and produce excellent peer reviews on projects prior to shipping to Product &amp; Engineering</li><li>Evaluate and experiment with new technologies and tools prior to wider adoption by the team</li><li>Work closely with analysts, data scientists, product managers, and engineers</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Qualifications:\n\n<ul>\n\n\n<ul>\n<li>Minimum 2 years of industry production experience as a Data Scientist or Engineer</li><li>Excellent verbal communications, including the ability to clearly and concisely articulate complex concepts to both technical and non-technical collaborators</li><li>Degree(s) should be in a technical discipline such as Computer Science, Computational Biology, Engineering, Statistics, Physics, Math, quantitative social science</li><li>Experience with SQL relational databases as well as big data: the Hadoop ecosystem, Hive, Spark, Presto, Vertica, Greenplum, etc</li><li>Required: SQL, Python, R, linux shell scripting</li><li>Desired: Scala, Java, or Ruby</li><li>Experience with machine learning and computational statistics packages</li> <li>Experience with visualization tools</li> <li>Frequent user of cloud computing platforms such as Amazon Web Services, Microsoft Azure, or Google Cloud Platform</li><li>Bonus Points: previous work on medical applications and/or with claims data</li></ul>\n</ul>\n\n</div>\n</div><div><div>This is a full time position located in San Francisco, CA.</div> \n\n<li>----</li>\n\n<div>Grand Rounds is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law. Grand Rounds considers all qualified applicants in accordance with the San Francisco Fair Chance Ordinance.</div></div></div></div>"}