{"job title": "Data Scientist", "company": "Grant Thornton", "city state": "– US-District of Columbia-Washington", "rating": "3.6", "job description": "Grant Thornton is seeking a Senior Associate to join its IT Advisory service line and take an active role in engagement execution, project management and key business development activities.\n<br><br>\nGrant Thornton’s Public Sector helps executives and managers at all levels of government maximize performance and efficiency in the face of ever tightening budgets and increased demand for services. Our public sector team members find solutions that help government leaders with issues including acquisitions, financial management, human capital, information technology and performance management in federal, state, local and international governments.\n<br><br>\nAt Grant Thornton, our professional staff applies traditional and cutting-edge IT approaches and methods to a variety of solutions. As part of our team, the Senior Associate will utilize various IT methodologies and models to execute client projects.\n<br><br>\nESSENTIAL DUTIES: <div>\n\n<ul>\n<li>Build advanced analytic solutions</li> <li>Query and mine large data sets to discover patterns, examine data and filter for targeted information using traditional/exploratory, as well as advanced analytic techniques</li> <li>Use advanced business analysis and appropriate analytic tools to support advanced analytic development and presentation of results through visualization and scenario generators</li> <li>Work with and within cross-functional teams to identify appropriate business solutions to client challenges</li> <li>Help establish standards in advanced analytics to ensure consistency in quality across projects and teams and identify relevant work processes</li> <li>Maintain good working relationships with clients to enhance customer satisfaction and work with client management and staff to perform engagement services.</li> <li>Assist with business development activities, such as proposals, capture, whitepapers, and/or other thought leadership materials.</li> <li>3 to 5 years’ experience manipulating large datasets and applying advanced analytic techniques, for example: applied math, econometrics, data mining, optimization, predictive modeling, simulation, statistics (including sample design), text mining</li> <li>Experience using advanced analytic techniques to conduct analyses such as economic impact analysis/event studies, fraud detection/prevention, supply chain analytics, retail analytics</li> <li>Excellent problem-solving, communications and presentation skills.</li> <li>Strong customer focus with the ability to work with technical teams and business users.</li> <li>Meet or exceed targeted billing hours (utilization).</li> <li>Assist with business development activities, such as proposals, capture, account teams, whitepapers, conferences, and/or other thought leadership materials.</li></ul></div><br>\n\n<div> <div>\n\n<ul>\n<li>TS/SCI Required.</li><li>Experience using statistical packages, such as MATLAB, SAS, R, SPSS, SQL, or python.</li> <li>Knowledgeable in big data search technologies, including Hadoop 2.x, Elastic Search 1.4x, Sqoop, and Pig</li> <li>Knowledge of data visualization tools such as Qlik, Tableau, or Microsoft Power BI</li> <li>Knowledge of one or more package-based prescriptive analytics platforms</li> <li>Educational background in quantitative field such as economics, statistics, mathematics, operations research, data science preferred</li> <li>Ability to obtain and maintain certain job-related certifications if no job-related advanced degrees.</li><li>U.S. citizenship may be required. Ability to work in the United States indefinitely required.</li><li>Travel may be required.</li><li>Ability to work overtime required on occasion.</li><li>Ability to sit in an office environment for long periods of time.</li><li>Ability to obtain and maintain a security clearance.</li><li>Ability to communicate clearly in writing and verbally.</li><li>Ability to obtain and maintain firm independence and abide by firm ethics requirements.</li><li>Meet or exceed continuing professional education (CPE) requirements.</li></ul></div>\n</div> <div>Grant Thornton LLP is the U.S. member firm of Grant Thornton International, one of the six global accounting, tax and business advisory organizations. Grant Thornton’s Global Public Sector, based in Alexandria, VA, is a global management consulting business with the mission of providing responsive and innovative financial, performance management and systems solutions to governments and international organizations. Visit Grant Thornton’s Global Public Sector at www.grantthornton.com/publicsector.</div>  It is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability, or any other characteristic protected by applicable federal, state, or local law."}