{"job title": "FinTech Senior Associate - Data Scientist", "company": "Grant Thornton", "city state": "– New York - Manhattan(641) (641) 757 3rd Avenue #9 New York, 10017 Charlotte(131) (131) 201 South College Street Sui", "rating": "3.7", "job description": "<p>Grant Thornton is collaborative, entrepreneurial and on the move. As part of a dynamic global organization of 47,000 people serving clients in more than 140 countries, we have the agility and focus it takes to be a leader. </p><p> <br></p><p>Data Scientist - Quantitative Analyst Sr. Associate for AML Innovation Lab</p><p> <br></p><p>Position Summary:</p><p> <br></p><p>Grant Thornton’s Advisory professionals are progressive thinkers who create, protect, and transform value today, so our clients have the opportunity to thrive and grow. Our advisory practice creates holistic solutions delivered by innovative, curious professionals who bring technical depth and industry insight to our clients. The Advisory Practice includes Business Consulting (BC), Business Risk Services (BRS), Transaction Services (TS), Enterprise Technology, Strategy &amp; Innovation (ETSI) and Financial Services (FS and FinTech).</p><p> </p><p>Become a member of GT’s FinTech Innovation Lab providing data-driven, action-oriented solutions to Anti-Money Laundering and Financial Crime problems. We desired a business-minded data scientist with a demonstrated ability to develop Machine Learning models that deliver valuable insights via data analytics and advanced data-driven methods. If you career goal to be relied on as a key member in driving innovative AI/Machine Learning solutions in the Financial Services industry, we invite you to join our team</p><p><br></p><p>Essential Duties and Responsibilities</p><p> </p><ul><li><div>Data and Quantitative Analysis</div></li><li><p>Decision Analytics</p></li><li><p>Predictive Modeling</p></li><li><p>Data-Driven Personalization</p></li><li><p>R, Jupiter Notebooks, Python, SQL </p></li><li><p>Big Data Queries and Interpretation</p></li><li><p>Data Mining and Visualization Tools</p></li><li><p>Machine Learning Algorithms</p></li><li><p>Business Intelligence (BI)</p></li><li><p>MS Azure environment experience</p></li><li><p>Other duties as assigned.</p></li></ul><p><br></p><p><br></p><p><br></p><p><br></p>\n<p> </p><p><br></p><p>Required Skills and Experience: </p><p> </p><ul><li><p>Bachelors’ degree in Financial Services or Technology related field required. Masters’ degree a plus. </p></li><li><p>Experience with popular machine learning algorithms (Classification and regression tress, GAMs, splines, SVMs, KNN and more). Experience with Linear and Logistic regression models</p></li><li><p>Developed intricate algorithms based on deep-dive statistical analysis and predictive data modeling that were used to deepen relationships, strengthen longevity and personalize interactions with customers.</p></li><li><p>Analyzed and processed complex data sets using advanced querying, visualization and analytics tools.</p></li><li><p>Good understanding of model validation methodologies</p></li><li><p>Ability to work additional hours and travel domestically as needed.</p></li></ul><p> </p><p> </p><p> </p><p>Benefits:</p><p> </p><p> </p><p> </p><p>Grant Thornton LLP promotes a nationally recognized culture of health and offers an extensive array of benefits to meet individual lifestyles. For a complete list of benefits, please visit www.gt.com.</p><p> </p><p> </p><p> </p><p>Founded in Chicago in 1924, Grant Thornton LLP (Grant Thornton) is the U.S. member firm of Grant Thornton International Ltd., one of the world’s leading organizations of independent audit, tax and advisory firms. Grant Thornton has revenues in excess of $1.7 billion and operates 59 offices across the U.S., with more than 590 partners and 8,500 employees in the United States and at our Shared Services Center in Bangalore, India.</p><p> </p><p> </p><p> </p><p>Grant Thornton works with a broad range of publicly- and privately-held companies, government agencies, financial institutions, and civic and religious organizations. Core industries served include consumer and industrial products, financial services, not-for-profit, private equity, and technology. Grant Thornton focuses on serving dynamic organizations that pursue growth holistically — whether through revenue improvement, leadership, mission fulfillment or innovation.</p><p> </p><p> </p><p> </p><p>It is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability or any other characteristic protected by applicable federal, state or local law.</p><p> </p><p> </p><p> </p><p> </p><p> </p><p> </p><p> </p><p> </p><p> </p><p><br></p><p><br></p>"}