{"job title": "Nursing Administration Coordinator and Data Analyst", "company": "Greater Baltimore Medical Center", "city state": "– Baltimore, MD", "rating": "3.6", "job description": "# JOB DESCRIPTION SUMMARY: # Under limited supervision of the department chair and according to general directions, performs varied secretarial and administrative duties such as composing and typing complex correspondence, relaying confidential information, gathering and interpreting information to develop complex reports and maintaining department files. Uses discretion and judgment in screening important visitors and telephone calls and in planning and organizing own work as well as department chair#s in meeting established priorities.# Provides analytical and technical support to department chair by identifying and evaluating benefits and non-financial implications of existing or new programs. Reports on organization and operational information. Completes special projects as needed. # Education Bachelors in Business Administration, Healthcare Administration or another related field. Masters Degree preferred # Experience # 1 year progressive experience preferably in finance, healthcare operations, or accounting, or an internship in a healthcare setting # Skills General knowledge of office practices, procedures, and equipment; of business English, spelling, punctuation grammar and arithmetic Skill in Data analysis and interpretation Skill in using computers and a variety of personal productivity applications, specifically Microsoft Excel, Microsoft PowerPoint, and Epic Skill in understanding and following oral and written instructions and in communicating effectively both orally and in writing Skill in proofing office correspondence, forms, and other work product for typographical errors, spelling, grammar, and punctuation Ability to read and write well enough to proof and edit non-routine reports, correspondence and charts for sentence structure, grammar and readability.# Ability to compose and type routine responses to requests for information for supervisor#s signature Timely production of accurate work in deadline-oriented environment Ability to successfully work independently and in a team to produce quality deliverables Exhibit sense of urgency when responding to requests and the ability to prioritize multiple projects Licensures, Certifications # Physical Requirements # Ability to concentrate and pay close attention to detail up to 75% of work time, in composing, typing and proof reading materials in meeting established deadlines and priorities # Working Conditions # Normal office environment with little exposure to excessive noise, dust and temperature\n<br><br>\n<strong>\n<ul>\n<li>JOB DESCRIPTION SUMMARY:</li>\n</ul>\n\n</strong>\n<br>\nUnder limited supervision of the department chair and according to general directions, performs varied secretarial and administrative duties\n<br><br>\nsuch as composing and typing complex correspondence, relaying confidential information, gathering and interpreting information to develop complex reports and maintaining department files. Uses discretion and judgment in screening important visitors and telephone calls and in\n<br><br>\nplanning and organizing own work as well as department chair's in meeting established priorities. Provides analytical and technical support\n<br><br>\nto department chair by identifying and evaluating benefits and non-financial implications of existing or new programs. Reports on organization\n<br><br>\nand operational information. Completes special projects as needed.\n<br><br>\nEducationBachelors in Business Administration, Healthcare Administration or another related field.\n<br><br>\nMasters Degree preferred\n<br><br>\nExperience\n<br><br>\n1 year progressive experience preferably in finance, healthcare operations, or accounting, or an internship in a healthcare setting\n<br><br>\n<strong>Skills</strong>\n\n\n<ul>\n<li>General knowledge of office practices, procedures, and equipment; of business English, spelling, punctuation grammar and arithmetic</li>\n<li>Skill in Data analysis and interpretation</li>\n<li>Skill in using computers and a variety of personal productivity applications, specifically Microsoft Excel, Microsoft PowerPoint, and Epic</li>\n<li>Skill in understanding and following oral and written instructions and in communicating effectively both orally and in writing</li>\n<li>Skill in proofing office correspondence, forms, and other work product for typographical errors, spelling, grammar, and punctuation</li>\n<li>Ability to read and write well enough to proof and edit non-routine reports, correspondence and charts for sentence structure, grammar and readability. Ability to compose and type routine responses to requests for information for supervisor's signature</li>\n<li>Timely production of accurate work in deadline-oriented environment</li>\n<li>Ability to successfully work independently and in a team to produce quality deliverables</li>\n<li>Exhibit sense of urgency when responding to requests and the ability to prioritize multiple projects</li>\n</ul>\n\nLicensures, Certifications Physical Requirements\n<br><br>\nAbility to concentrate and pay close attention to detail up to 75% of work time, in composing, typing and proof reading materials in meeting established deadlines and priorities\n<br><br>\nWorking Conditions\n<br><br>\nNormal office environment with little exposure to excessive noise, dust and temperature"}