{"job title": "Principal Big Data Engineer/Durham, NC 12mth+ Contract", "company": "Greenlight Staffing Group", "city state": "– Durham, NC", "rating": "4.1", "job description": "Job Description NO OPT/CPT and H1'sLocation: Durham, NC\n<br>\nDuration:12+ Months\n<br><br>\nPrimary Responsibility\n\n\n<ul>\n<li>As a Principal Data Engineer, you must be an expert with Big Data technologies like Hadoop, Hive, Hbase, Spark, and various AWS technologies.</li>\n<li>You will architect and drive the build out of next generation data platform.</li>\n<li>As a hands-on engineer, you will influence all architecture decisions.</li>\n<li>You will build reusable code, with the ability to scale with very large data volumes.</li>\n<li>Everything you build will need to scale and perform.</li>\n<li>As a Principal member on the team you will also mentor junior/senior engineers on the team.</li>\n<li>Define and lead the frameworks for compliance with data management standards for emerging technologies (streaming platforms, cloud integration, etc.)</li>\n<li>You will architect and drive the build out of next generation data platform.</li>\n</ul>\n\nGeneral Responsibilities\n\n\n<ul>\n<li>Build and lead high-performing, agile teams focused on Data Engineering.</li>\n<li>Be part of a core team leading migration to new data technologies for unstructured, streaming and high volume data.</li>\n<li>Overall accountability for ensuring teams adopt established data management frameworks to prevent data lakes from becoming data swamps.</li>\n<li>Provide senior level technical consulting to application development teams during application design and development for highly complex or critical projects</li>\n<li>As a hands-on engineer, you will influence all architecture decisions.</li>\n<li>As a Principal member on the team you will also mentor junior/senior engineers on the team Job Functions:</li>\n<li>Provide technical leadership to build and implement data and big data solutions Articulate pros and cons of various technologies, platforms and tools.</li>\n<li>Demonstrated work experience with distributed, scalable Big Data programming model and technologies such as Hadoop, Hive, Pig, etc.</li>\n<li>Demonstrated hands-on experience with at-least one of the major Hadoop distributions (Preferably Cloudera).</li>\n<li>Deep technical Expertise in Hadoop eco system components.</li>\n<li>Experience designing, developing and implementing online-machine learning libraries.</li>\n</ul>\n\n<strong>Minimum Experience:</strong>\n\n\n<ul>\n<li>10+ years of Data Engineering experience</li>\n<li>8+ years experience in dimensional data modeling, ETL development,</li>\n<li>8+ and Data Warehousing</li>\n<li>5+ years of experience in Hadoop MapReduce, Hive, Pig, Spark, and Yarn</li>\n<li>4 years of business experience leading analyses and initiatives with track record of business impact Cloud Dev and Migration-AWS-Analytics/DW/Redshift : 1+ year Â</li>\n</ul>\n\nDegree: Bachelors in Computer Science or equivalent work experience Â Desirable Skills:\n\n\n<ul>\n<li>Hadoop/Cloud Developer Certification</li>\n<li>Experience deploying applications in a cloud environment; ability to architect, design, deploy and manage cloud based Hadoop clusters</li>\n<li>Exposure to cloud infrastructure</li>\n</ul>"}