{"job title": "Data Scientist", "company": "GreenZone Solutions, Inc.", "city state": "– Houston, TX", "rating": "4.8", "job description": "<strong>GreenZone Solutions, Inc.</strong> is seeking a <strong>Data Scientist</strong> who possesses intellectual curiosity and passion for solving problems with an eye for optimization and efficiency.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n <li>Meet with vital agency leaders and backers, collaborating with other consultants and advising agency personnel regarding the development of innovative data analysis techniques.</li> <li>Build data ingestion and pipeline processes for innovative analytics platforms using best practices and open source tools such as, NiFi and Python.</li> <li>Develop and apply quantitative and qualitative analytic methods to identify, collect, process and analyze large data sets for specified purposes.</li> <li>Develop analytical solutions that are scalable, repeatable, effective, and meet the expectations of the decision-makers and stakeholders.</li> <li>Conduct analysis and make recommendations that significantly affect the content, interpretation, or development of major programs and policies.</li> <li>Develop polished, high-impact persuasive reports and presentations that enable strategic decision-making supporting the project’s mission.</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>Bachelor’s Degree in Information Technology, Computer Science, quantitatively-focused social sciences, or other quantitative fields.</li> <li>1 to 4 years of experience working with large and varying data sets, applying qualitative and quantitative analysis to interpret the data.</li> <li>Knowledge and experience utilizing open source and business intelligence tools such as Python, R, Java, and SQL.</li> <li>Preferred Experience with Tableau, AWS, Apache, Hadoop, NiFi, OrientDB, HBase, ElasticSearch, and JIRA.</li> <li>Understanding of and experience with building canned and ad-hoc reports based on user requirements.</li> <li>Proficient in MS Office with advanced skills in Excel, Access, PowerPoint, Projects, and Visio.</li> <li>Strong writing skills and experience conveying highly technical material to non-technical audiences.</li>  <li>Strong analytical skills with the ability to analyze data sets to determine trends, establish strategies, and make decisions.</li> <li>Outstanding interpersonal and communication skills with the ability to effectively communicate with diverse audiences and influence cross functionally.</li> <li>Experience working in the federal contracting space is highly desired.</li> <li>Must be a U.S. Citizen with the ability to obtain and maintain a government suitability clearance.</li>\n</ul>\nWe are an equal employment opportunity and E-Verify employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other characteristic protected by law.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nAt <strong>GreenZone</strong>, we are dedicated to obtaining and maintaining the highest level of employee satisfaction by offering a competitive benefits package that includes medical, dental and vision, short and long term disability, retirement plan and company match, a generous annual leave plan, and a commitment to providing a work/life balance for all employees."}