{"job title": "Data Scientist", "company": "Gridwise", "city state": "– Pittsburgh, PA", "rating": "3.5", "job description": "Gridwise, a mobility solutions startup headquartered in Pittsburgh, PA, is looking for a highly motivated individual to join our team as a Data Scientist.\n<br><br>\nGridwise (Techstars Mobility '17) is a mobility startup that is creating solutions to improve the efficiency of on-demand rideshare fleets. As mobility is rapidly changing, Gridwise is looking to improve the ecosystem through its data-driven solutions created to help human &amp; autonomous rideshare drivers best know when and where to drive. We are seeking motivated individuals to help us capture this massive opportunity as a leading provider of on-demand mobility solutions. We encourage you to join us for the ride if you value the opportunity to make a huge impact on the mobility ecosystem of the future!\n<br><br>\nAs an early member of the Data team at Gridwise, you will have an opportunity to contribute significantly to our success by helping us shape our data strategy, processes, and infrastructure as we continue to scale our technology. The ideal candidate for this position thrives at the intersection of Data Science, Machine Learning, and Software Engineering.\n<br><br>\nAs a Data Scientist at Gridwise, you will:\n\n<ul>\n<li>Perform analyses on Gridwise datasets to extract insights around rideshare supply &amp; demand</li> \n\n<li>Develop machine learning models and methods to support new ML-based product features</li> \n\n<li>Produce front-end visualizations for geospatial datasets for use by various business functions</li>\n<li>Coordinate with engineers to design and deploy data systems necessary to implement your models and/or processes into production systems</li>\n<li>Develop processes/algorithms to clean and refine imperfect datasets</li>\n<li>Take on a leadership and mentorship role within the Data team as the organization continues to grow</li> \n</ul>\nRequired Experience/Skills/Traits:\n\n<ul>\n<li>Graduate degree in a data science, machine learning, or another quantitative field</li>\n<li>3+ years industry experience in applying statistics, data mining, and machine learning methods to explore data patterns, build data-driven product features, and/or glean business insights</li>\n<li>Excellent statistical programming skills (Python preferred)</li>\n<li>Skilled in working with imperfect, real-world datasets</li>\n<li>Proficient in data science tools/libraries such as numpy, pandas, scikit-learn, etc.</li>\n<li>Familiarity with Big Data &amp; ML infrastructure/frameworks, such as Hadoop, Spark, TensorFlow, etc.</li>\n<li>Passionate about entrepreneurship and the mobility industry</li>\n</ul>\nExceptional Candidates will have one or more of:\n\n<ul>\n<li>Ph.D. in machine learning, AI, or related field</li>\n<li>Experience implementing production software and infrastructure for machine learning systems</li>\n<li>Experience storing, querying, and working with geospatial databases and time-series datasets</li>\n<li>Experience building data pipelines, ETL processes, and/or working with distributed systems</li>\n</ul>\nThis position is full-time and is located in Pittsburgh, PA. Remote work is unfortunately not an option at this time.\n<br><br>\nCompensation &amp; Benefits include:\n\n<ul>\n<li>Competitive salary</li>\n<li>Stock options</li>\n<li>Medical, dental, &amp; vision insurance</li>\n<li>Unlimited vacation days</li>\n<li>Maternity/paternity leave</li>\n<li>Relocation if applicable</li>\n</ul>\nIf youre interested in this opportunity and feel that youd be a great fit for our team, please apply and tell us why.\n<br><br>\nWe look forward to hearing from you soon!"}