{"job title": "Data Scientist", "company": "Grid Dynamics", "city state": "– Atlanta, GA, United States", "rating": "4.2", "job description": "<div><p>As part of the Enterprise Data team, the Data Scientist will support the development of next-generation data platforms by employing data analytics and various data science capabilities (i.e. machine learning). Incumbents will be part of an innovative and energetic team that develops capabilities which will influence our business model and help our customer build the next generation data platform. The Data Scientist will have access to the vast amount of data stored in heterogeneous formats. This person is supposed to handle complex problems independently and demonstrate analytical thinking. The Data Scientist should be able to make judgments and recommendations based on the analysis and interpretation of data.</p><p><strong>Responsibilities:</strong></p><ul><li>Analyze and understand the business model, profile/analyze the data stored in various heterogeneous formats, and help develop data insights</li><li>Identify patterns in the data and prepare an inventory of items which could be developed/trained using data science capabilities like machine learning</li><li>Utilize appropriate pre-built models or help develop new models to predict and derive insights from heterogeneous data stores</li><li>Ability to explore and implement advanced technology solutions such as machine learning</li><li>Ability to identify unique data sets and information that may be useful for model development and analysis</li><li>Under limited direction, seeks to understand what moves the needle for our financial advisors and our overall business model and explores data that could be helpful </li><li>Performs other duties and responsibilities as assigned</li></ul><p><strong>Requirements:</strong></p><ul><li>Strong practical experience working with Tensorflow</li><li>Image processing techniques (attribution, similarity, etc.)</li><li>Experience with various Machine Learning techniques</li><li>Working knowledge of skills such as Python, SQL, and Java</li><li>Working knowledge of Big Data Technologies is preferred</li><li>Good communication and presentation skills and the ability to explain technical concepts to a non-technical audience</li></ul><p><strong>Educational/Previous Experience Requirements:</strong></p><ul><li>Minimum of a Bachelor’s degree in Statistics, Mathematics, Computer Science, MIS or related degree and five (5) years of relevant experience or combination of education, training, and experience</li><li>Master’s degree or Ph.D. in Statistic, Mathematics, or Computer Science and seven (7) years of experience highly preferred</li><li>An equivalent combination of education, experience, and training</li></ul><p><strong>Competencies and Behaviors: </strong></p><ul><li>Analysis: identify and understand issues, problems, and opportunities; compare data from different sources to draw conclusions</li><li>Communication: clearly convey information and ideas through a variety of media to individuals or groups in a manner that engages the audience and helps them understand and retain the message</li><li>Exercising judgment and decision making: use effective approaches for choosing a course of action or developing appropriate solutions; recommend or take action that is consistent with available facts, constraints and probable consequences</li><li>Technical and professional knowledge: demonstrate a satisfactory level of technical and professional skill or knowledge in position-related areas; remain current with developments and trends in areas of expertise</li><li>Building effective relationships: develop and use collaborative relationships to facilitate the accomplishment of work goals</li><li>Client Focus: make internal and external clients and their needs a primary focus of actions; develop and sustain productive client relationships.</li></ul><p><strong>We Offer:</strong></p><ul><li>Opportunity to work on bleeding-edge projects</li><li>Work with a highly motivated and dedicated team</li><li>Competitive salary</li><li>Flexible schedule</li><li>Medical insurance</li><li>Benefits program</li><li>Corporate social events</li><li>Professional development opportunities</li></ul><p><strong>About Us:</strong></p><p>Grid Dynamics is an engineering services company known for transformative, mission-critical cloud solutions for the retail, finance and technology sectors. We have architected some of the busiest e-commerce services on the Internet, and have never had an outage during the peak season. Founded in 2006 and headquartered in San Ramon, California with offices throughout the US and Eastern Europe, we focus on big data analytics, scalable omnichannel services, DevOps, and cloud enablement.</p></div><p><b>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</b></p>"}