{"job title": "Chief Data Scientist", "company": "GroundTruth", "city state": "– Mountain View, CA, United States", "rating": "3.3", "job description": "<strong>Chief Data Scientist</strong>\n<br>\nMountain View, CA\n<br><br>\nGroundTruth, is a global location technology company that drives results with real data. We believe in the power of place. Build your brand, increase sales and more by building off what real people are doing in the real world, mapped using our proprietary Blueprints technology. GroundTruth delivers superior consumer insights by seeing more people and places than anyone else, with an unrivaled first-party database of 150 million active monthly users, across 100 million places and points of interest. GroundTruth currently serves 21 countries globally. Learn more: <strong>www.GroundTruth.com</strong>\n<br><br>\nWe are looking for a dynamic and proven Chief Data Scientist to head our Data Science team. The person will lead and grow a team of smart researchers and engineers to address challenging data problems in the exciting location domain. Additionally, the Chief Data Scientist is a machine learning expert who is knowledgeable in advertising industry and is interested in leading research on the new area of location based performance delivering.\n<br><br>\n<strong>You will:</strong>\n<ul>\n<li>Be responsible for the development strategy, technical path, and key technology direction.</li><li>Work with engineering and platform teams on strategies for integrating machine learning products with distributed high frequency low latency systems.</li><li>Represent the company as the scientific expert for patent applications, litigations, and industrial standard committees.</li><li>Be a hands-on leader who is willing to roll up your sleeves and discussing technical details with your team members.</li><li>Be an expert in machine learning and data mining algorithms and systems. Additionally, you will mentor team members and provide technical guidance.</li><li>Recruit, manage, and grow a team of 10+ data scientists and engineers.</li><li>Work with product and business team to drive production innovations and deliver science algorithms into productions.</li>\n</ul>\n<strong>You are:</strong>\n<ul>\n<li>An expertise: Expert in machine learning and Data Science with an ability to recognize the limitations of approaches or dead-ends early on.</li><li>Well organized: Ability to prioritize and deliver results timely.</li><li>An excellent communicator: Strong written and verbal communication skills, comfortable in engaging conversation with all levels.</li><li>A problem solver: Take initiatives and drive them to conclusions.</li><li>Eager to learn and implement new technologies.</li>\n</ul>\n<strong>You have:</strong>\n<ul>\n<li>Ph. D in Engineering, Computer Science, Statistics, Operations Research, Math, Physics, Economics or another quantitative field.</li><li>10+ years of software engineering and scientific experience.</li><li>5+ years of experience in people management.</li><li>Extensive experience in hands-on coding using Python, and C++ or Java.</li><li>Experience in and broad knowledge on relational databases and the ‘big data’ ecosystem and tools.</li><li>Experience in advertising domain, and geo-spatial technologies (highly preferable).</li>\n</ul>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}