{"job title": "Sr. Data Engineer", "company": "GrubHub", "city state": "– US-IL-Chicago", "rating": "3.5", "job description": "About The Opportunity<br><br><strong>Got a taste for something new?</strong>\n<br><br>\nWe’re Grubhub, the nation’s leading online and mobile food ordering company. Since 2004 we’ve been connecting hungry diners to the local restaurants they love. We’re moving eating forward with no signs of slowing down.\n<br><br>\nWith more than 85,000 restaurants and over 15.6 million diners across 1,600 U.S. cities and London, we’re delivering like never before. Incredible tech is our bread and butter, but amazing people are our secret ingredient. Rigorously analytical and customer-obsessed, our employees develop the fresh ideas and brilliant programs that keep our brands going and growing.\n<br><br>\nLong story short, keeping our people happy, challenged and well-fed is priority one. Interested? Let’s talk. We’re eager to show you what we bring to the table.<br><br>Some Challenges You’ll Tackle\n\n\n<ul>\n\n <li>Working with high volumes of data to efficiently process and expose for analysis</li> \n\n<li>Collaborating with other engineering teams on strategies for data</li>\n<li>Work with cutting edge data processing technologies</li>\n<li>Understand our stakeholder (Finance, Marketing, Product) requirements and write complex and efficient code to transform raw data into an easy to approach data marts.</li>\n<li>Doing deep dives on business verticals where you become one of the foremost experts on that vertical in the company</li>\n<li>Analyze data to measure impacts of data schemas and use it to iterate on improvements</li>\n<li>Translate from technical to business, and vice versa. You need to be able to speak with the least technically-minded client (internal or external) and make technology make sense to them. Then turn around and do it the other way</li>\n</ul>\n\nYou Should Have\n\n\n<ul>\n\n <li>Excellent knowledge on SQL, data modelling and patterns.</li>\n<li>5-7 years experience with Python or another general purpose programming language</li>\n<li>Background in writing ETL jobs within a Business Intelligence context</li>\n<li>A bachelor's degree, preferably in a computer-related discipline.</li>\n<li>Enthusiasm for the job. Are you excited about data? Do you love your users? Good, the same goes for us</li>\n</ul>\n<strong>Got These? Even Better:</strong>\n\n<ul>\n\n <li>Experience big data processing with Spark and other big data tools a plus</li>\n<li>Excellent communication skills, including the ability to crystallize and broadly socialize insights</li>\n<li>Problem analysis and problem-solving skills</li>\n<li>Rigorous attention to detail and accuracy</li>\n<li>Exposure to Amazon AWS or another cloud provider</li>\n<li>Adaptability and collaborative skills</li>\n</ul>\n\nAnd Of Course, Perks!\n\n\n<ul>\n\n <li>Unlimited paid vacation days. Choose how your time is spent.</li>\n<li>Never go hungry! We provide weekly GrubHub/Seamless credit.</li>\n<li>Regular in-office social events, including happy hours, wine tastings, karaoke, bingo with prizes and more.</li>\n<li>Company-Wide Initiatives encouraging innovation, continuous learning and cross-department connections.</li>\n</ul>\nWe deliver favorites every day. Join us as we move eating forward.\n<br><br>\n<strong>Grubhub is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: DOL Poster. Grubhub is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to TalentAcquisition@grubhub.com and let us know the nature of your request and your contact information.</strong>"}