{"job title": "Product Master Data Engineer", "company": "Grundfos", "city state": "– Brookshire Texas United States", "rating": "3.6", "job description": "<ul>\n\n \n<li>\n<br>\n <strong>Deadline:</strong> 2018-12-31</li>\n\n<li>\n<br>\n <strong>Location:</strong> Brookshire, Texas, United States</li>\n\n<li>\n<br>\n <strong>Employment type:</strong> Regular</li>\n\n<li>\n<br>\n <strong>Hierarchy level:</strong> Professional Level (some years of experience)</li>\n\n<li>\n<br>\n <strong>Job category:</strong> Research &amp; Development</li>\n</ul>\n<u><strong><em>What do we offer?</em></strong></u>\n<br><br>\nWould you like to work in depth with our core master data and systems to ensure high quality data for both customers and colleagues? In this job, you will gain a thorough understanding of our data impact on the supply chain and knowledge of how our different systems work together as you align data across products and platforms. You become part of a global organization and a global team where you get the opportunity to travel and collaborate with different cultures across the organization.\n<br><br>\nWithin Global Technology Services, you will meet the Product Data Management department, responsible for aligning data across Grundfos, ensuring high data quality and carrying out data analysis. Moreover, we make recommendations for how to effectively handle data, and we train colleagues globally. You refer to Manager Mikkel Børlum Petersen.\n<br><br>\n“We work with complex systems and data structures, so it is not unusual to find us being quiet. We still do enjoy a great social environment where we work actively to ensure that employee satisfaction stays at the top of the agenda. You join a global team with colleagues in US, Denmark, China and Hungary so you can expect to primarily work online and travel up to 40 days per year,” Mikkel explains.\n<br><br>\n<u><strong><em>What is the job about?</em></strong></u>\n<br><br>\nThe entire value chain in Grundfos from creation of the product in business development to sales and service is highly dependent on product information.\n<br><br>\nAnything related to the product, i.e. images, drawings, relationships between products or features (e.g. configurations),prices etc. is considered product and material master data.\n<br><br>\nWith focus on analyzing impact on several different areas of our master data, your job will be to understand and create the structures of our data and how to improve the usage and quality. Thus, you have the role as data engineer and global data maintainer, working together with other data colleagues to design changes and resolve process or data issues. This involves guiding projects or business areas in the structure, use and analysis of data to make sure each structure is optimized for Grundfos and our customers.\n<br><br>\nYou will be responsible for coordinating local and regional data requirements in a global perspective. This also entails aligning interactions, following up on data quality reports, assisting in formulating and prioritizing new initiatives to improve data processes and acting as change manager when new initiatives are implemented.\n<br><br>\n<u><strong><em>What do you need to apply?</em></strong></u>\n<br><br>\n- You have obtained great technical skills through your education as a Technical Designer, Data Base Manager or Engineer.\n<br><br>\n- You have 4+ years of experience from a development department in a global organization where you have been able to roll out data findings and drive change\n<br><br>\n- You work well in an online environment while supporting agile practices and activities.\n<br><br>\n- You have experience with classification of product data and an advantage if you know SAP\n<br><br>\n- You have an understanding of product implementation and change management processes\n<br><br>\n“You are a self-starter with excellent communication and organizational skills, and you master handling several tasks and multiple priorities as we have many tasks at hand across the organization. Being detail-oriented is also very important, and you have to be persistent to find solutions in a complex setup - and convince your colleagues of possible changes.\n<br><br>\nThis will also entail carrying out support, so you have to be good at maintaining customer relationships. Finally, you take data quality very seriously,” Mikkel finishes.\n<br><br>\n<u><strong><em>Additional information</em></strong></u>\n<br><br>\nIf you want to dig deeper into the Grundfos universe, please visit us on LinkedIn: www.linkedin.com/company/5195 or our YouTube channel: www.youtube.com/watch?v=zwY54t455CU\n<br><br>\n<em>At Grundfos you will be working for a global leader in advanced pump solutions and a trendsetter in water technology.</em>\n<br><br>\n<em>We contribute to global sustainability by pioneering technologies that improve quality of life for people and care for the planet. Grundfos is an unlisted, values-based company owned by a foundation that is dedicated to further developing our business.</em>"}