{"job title": "Data Scientist", "company": "Guardian Analytics", "city state": "– Mountain View, CA", "rating": "3.3", "job description": "<div>\n<strong>Data Scientist</strong><br><br>Guardian Analytics is seeking data scientists, mathematicians/statisticians, and computer scientists to develop, analyze and program cutting-edge algorithms that will be at the core of Guardian Analytics fraud prevention and Anti-money Laundering applications. Our behavioral analytics / machine-learning platform is the leader in providing Fraud Detection and Anti-money Laundering solutions. You will extend, develop, program and implement new algorithms and underlying mathematical theory, and use your analytics skills to help design and implement core components of our algorithms and models. You can have a daily, direct impact on the continued evolution of our innovative products.\n<br><br>\nThe position is based in Mountain View and reports to the VP of Product Development.\n<br><br>\n<strong>Skills and Experience Required:</strong>\n\n<ul>\n<li>PhD/MS in Statistics, CS, Applied Mathematics, Electrical Engineering or other quantitative fields with focus on machine learning, mathematical algorithms, probability, and statistical modeling</li> \n\n<li>Interest in Big Data and the associated methodologies</li> \n\n<li>4+ years of experience in algorithm development and statistical analysis of massive datasets, or equivalent coursework</li> \n\n<li>Desire to balance theory with pragmatic problem-solving skills to develop and apply advanced algorithms to real world problems and data</li> \n\n<li>Hands on experience with statistical analysis, visualization, and data mining tools such as R or Python</li> \n\n<li>1-2 years of scripting experience (Python, Perl), writing SQL queries and working with databases (MySQL preferred).</li> \n\n<li>Ability to work with product managers and engineers to translate requirements into design that can be implemented into code for both fraud detection, anti-money laundering and data visualization.</li> \n\n<li>Passionate about being at the forefront of Fraud detection, Anti-Money Laundering (AML) and cyber-crime in general.</li> \n\n<li>Resourceful, flexible, and adaptable team player</li> \n</ul>\n<strong>Additional Preferred Qualifications:</strong>\n\n<ul>\n<li>Experience in developing User Behavior Models</li> \n\n<li>Past experience in Natural Language Processing (NLP)</li> \n\n<li>Knowledge of Social Network Analysis</li> \n\n<li>Understanding of Bayesian Statistics</li> \n\n<li>Experience with Java/Hadoop/MapReduce/Spark</li> \n</ul>\n<strong>About Guardian Analytics</strong>\n<br><br>\nGuardian Analytics is the pioneer and leading provider of behavioral analytics and machine learning solutions for detecting banking and B2B vendor portal fraud. Over 450 enterprises have standardized on Guardian Analytics’ innovative solutions to mitigate fraud risk and rely on the company to stop Financial Crime. For more information, please visit www.GuardianAnalytics.com.\n<br><br>\n<strong>To Apply:</strong>\n<br><br>\nPlease send your resume and cover letter to careers@guardiananalytics.com.\n<br><br>\nGuardian Analytics is an Equal Opportunity Employer</div>\n\n<br>Apply Now"}