{"job title": "Data Scientist, Product Analytics", "company": "Gusto", "city state": "– San Francisco, CA", "rating": "4.4", "job description": "<div>Gusto is looking for an experienced and ambitious product analyst to help us leverage our data to inform product direction and strategy. In this role you will work closely with our Engineering, Product and Design teams to define and track product metrics, design customer-facing experiments and dive deep into our Payroll, Benefits and HR data to deliver insights. As the most experienced product analyst on our Data Science team, you will also help define and build our approach to data-informed product development from the ground up.</div>\n<br>\n<div>Gusto's Data Science team leverages Gusto's data to deliver data-informed insights for our customers and guide product direction and decision-making. We operate full-stack, conducting analyses, prototyping and deploying predictive models and statistical tools both for internal use and for our customers.</div>\n<br>\n<strong>Here's what you'll do day-to-day:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Work closely with product groups to define, measure and report on core product and feature metrics, and to define standards and practices for how product groups work with data</li>\n<li>Perform in-depth analyses of our Payroll, Benefits and HR product data to inform and guide product direction and strategy</li>\n<li>Design and analyze customer-facing experiments</li>\n<li>Work with our business intelligence teams to turn your insights and analyses into clean and consistent reporting</li>\n<li>Be a strong voice for a data-informed point of view within our engineering, product and design organization</li> \n\n<li>Collaborate with UX research to design surveys and provide quantitative insights on customer experience</li>\n</ul>\n\n<strong>Here's what we're looking for:\n<br><br>\n</strong>\n\n\n<ul>\n<li>5+ years experience in a similar role at a product-focused software company</li>\n<li>Strong SQL skills, and comfortable in at least one scripting or statistical programming language (ideally Python and/or R)</li>\n<li>Strong knowledge of statistics and experiment design</li>\n<li>Excellent project management skills</li>\n<li>Able to design scalable ways for product teams to use data effectively</li>\n<li>Excellent communicator - able to effectively deliver findings and recommendations to non-technical stakeholders in a clear and compelling fashion</li>\n<li>Passionate about teaching and evangelizing a data-informed approach to product development to product managers, designers and engineers</li>\n<li>MS or PhD in a quantitative field, or BS + equivalent experience</li>\n</ul>\n\nAbout Gusto<br><br>Our customers come from all walks of life and so do we. We hire people from a wide variety of backgrounds, not just because it's the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Gusto.\n<br><br>\nGusto's mission is to create a world where work empowers a better life. By making complicated, impersonal business tasks simple and personal, Gusto is reimagining HR, payroll, and benefits for over 60,000 companies nationwide. Gusto has offices in San Francisco and Denver and the company's investors include Google Capital, General Catalyst, Kleiner Perkins Caufield &amp; Byers, as well as the founders of Instagram, Stripe, Nest, PayPal, Yelp, Dropbox, and Eventbrite, among others."}