{"job title": "Data Scientist, Models and Algorithms", "company": "Gusto", "city state": "– San Francisco, CA", "rating": "4.4", "job description": "<div>Gusto is looking for experienced data scientists with expertise in building and deploy predictive models and algorithms in order to help us grow, prevent fraud, control financial risk, and deliver products that help our customers build great places to work.</div><br>\n\n<div><strong>The Data Science team leverages Gusto's data to deliver data-informed insights for our customers and guide product direction and decision-making. We operate full-stack, conducting analyses, prototyping and deploying predictive models and statistical tools both for internal use and for our customers. Here are a few areas where we contribute today:</strong></div>\n<ul>\n<li><strong>Risk and Fraud - Gusto processes &gt;$10B of payroll annually, so preventing fraud on our platform is critical for our survival. We also expedite payments for many of our customers, and with new features like Flexible Pay, we gives employees the freedom to choose their own pay schedule and get paid as soon as the next day for the hours they've already worked. We work with our Risk teams to build and deploy models for fraud prevention and underwriting our payment programs.</strong></li></ul>\n\n\n<ul>\n<li><strong>Growth</strong> - We work with our Marketing, Sales and Growth teams to help, from predictive models of lead and customer value to providing upsell and cross-sell recommendations.</li>\n<li><strong>Great Places to Work</strong> - Gusto pays hundreds of thousands of employees as small businesses all over the US. We are working with our Product teams to leverage this valuable payroll, benefits and HR data to build features that help our customers build great places to work.</li>\n</ul>\n\n<strong>Here's what you'll do day-to-day:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Build and deploy models and data products to support growth, prevent fraud, control risk and delight our customers.</li>\n<li>Enhance and contribute to the team's core analysis and modeling systems and libraries</li> \n\n<li>Identify new opportunities to leverage data to improve Gusto's products and help our business</li>\n<li>Present and communicate results to stakeholders across the company</li>\n</ul>\n\n<strong>Here's what we're looking for:\n<br><br>\n</strong>\n\n\n<ul>\n<li>At least 5 years experience conducting statistical analyses on large datasets, ideally in a business context (can supplement with academic experience where appropriate)</li>\n<li>Experience applying a variety of statistical and modeling techniques using Python, R or another statistical modeling language, as indicated by familiarity with many of the following techniques - generalized linear modeling, regularization, ensemble models (e.g., random forest, gradient boosting), Bayesian analysis methods</li>\n<li>Strong programming skills - comfortable with all phases of the data science development process, from initial analysis and model development all the way through to deployment</li>\n<li>Excellent communication skills - able to effectively deliver findings and recommendations to non-technical stakeholders in a clear and compelling fashion</li>\n<li>PhD or Masters plus equivalent experience in a quantitative field</li>\n<li>Experience applying predictive modeling to fraud, credit or growth problems is a plus.</li>\n</ul>\n\nAbout Gusto<br><br>Our customers come from all walks of life and so do we. We hire people from a wide variety of backgrounds, not just because it's the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Gusto.\n<br><br>\nGusto's mission is to create a world where work empowers a better life. By making complicated, impersonal business tasks simple and personal, Gusto is reimagining HR, payroll, and benefits for over 60,000 companies nationwide. Gusto has offices in San Francisco and Denver and the company's investors include Google Capital, General Catalyst, Kleiner Perkins Caufield &amp; Byers, as well as the founders of Instagram, Stripe, Nest, PayPal, Yelp, Dropbox, and Eventbrite, among others."}