{"job title": "Environmental Scientist/Ecologist I", "company": "GZA GeoEnvironmental", "city state": "– Springfield, MA", "rating": "3.8", "job description": "GZA's <strong>Springfield</strong><strong>, Massachusetts</strong> office is looking for a <strong>Mid-Level Environmental/Natural Resource Scientist/Analyst</strong> to support our growing Natural Resources and Permitting team in western Massachusetts and Connecticut.\n<br><br>\nThe environmental scientist will be part of an interdisciplinary team working on a wide variety of projects including but not limited to: team of environmental and natural resource scientists on site evaluations; wetland delineation and evaluation; writing environmental analysis documents; preparing maps using GIS; preparing and presenting wetland and natural resource permit applications; conducting desktop and field studies, participating in meetings and agency consultation, client interaction, site compliance inspections, and other related regulatory documents.\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\nThe successful candidate will have the following responsibilities in assisting with technical execution of projects under the supervision of project managers:\n\n\n<ul>\n\n\t<li>Perform routine and specialty field tasks potentially including wetland delineation and evaluation, botanical investigations, soils investigations, wildlife and aquatic habitat evaluations, faunal surveys, site reconnaissance and explorations, ecological constraints assessment, sampling, inspections, GIS mapping, and construction observations.</li>\n\n<li>Prepare reports and recommendations based upon field studies.</li>\n\n<li>Develop permit applications.</li>\n\n<li>Present permit applications to regulatory authorities.</li>\n\n<li>Manage assigned tasks as part of larger projects.</li>\n\n<li>Field and office QA/QC responsibilities.</li>\n</ul>\n\n<strong>Special Skills/Requirements:</strong>\n\n\n<ul>\n\n\t<li>Bachelor’s degree in Soil Science/Biology/Ecology or related discipline required; Master’s degree preferred.</li>\n\n<li>3+ years’ experience in wetland delineation, natural resource evaluation, GPS data collection and ecological permitting. Experience with processing of GPS field data and preparation of GIS mapping exhibits is preferred.</li>\n\n<li>Candidate must possess a valid driver’s license and be willing to travel locally and regionally for this position. Field work can occur year-round and in all weather conditions.</li>\n\n<li>Strong verbal and written communication skills with the ability to prepare clear and concise letters, memoranda, technical reports, proposals, and figures.</li>\n\n<li>Must be willing to learn and improve regulatory knowledge.</li>\n\n<li>Able to work independently and within a team.</li>\n\n<li>Strong time management, coordination, problem solving, and interpersonal skills.</li>\n\n<li>Strong academic record.</li>\n\n<li>Environmental science experience and strong ecological/environmental analytical skills are required.</li>\n\n<li>Experience with erosion and sedimentation control applications is desired.</li>\n\n<li>OSHA 10-hour construction safety training is a plus.</li>\n</ul>\n\n<strong>About GZA:</strong>\n\n\n<ul>\n\n\t<li>\n\n\n<ul>\n\n <li>Professional development and enrichment</li>\n\n<li>Exciting work environment</li>\n\n<li>Generous, company-subsidized benefits package, including medical, dental, vision, tuition reimbursement, and 401K retirement plan</li>\n</ul>\n\n\t</li>\n</ul>\n\nGZA GeoEnvironmental, Inc. (GZA) is an employee-owned multidisciplinary environmental consulting, geotechnical engineering, geo-civil engineering, construction management and environmental remediation firm. GZA is a leader in providing quality engineering and environmental consulting services to a diverse and exciting client base. We attract experienced professionals who understand proactive client service, safety, risk management and loss prevention practices, quality control, teamwork, and the development of younger staff. We seek employees who enjoy their work, desire continuous improvement, and want to contribute to the vision and growth of a quality, employee-owned, professional firm.\n<br><br>\n<em>GZA GeoEnvironmental, Inc. is an Affirmative/Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, national origin, ancestry, sex, sexual orientation, gender identity, physical or mental disability, citizenship status, marital or veteran status, age or other protected status.</em>\n<br><br>\nGZA GeoEnvironmental, Inc. is an Affirmative/Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, national origin, ancestry, sex, sexual orientation, physical or mental disability, citizenship status, marital or veteran status, age or other protected status."}