{"job title": "Data Scientist", "company": "Hackensack Meridian Health", "city state": "– US-NJ-Edison", "rating": "3.7", "job description": "Overview<br><br><strong>How have you impacted someone's life today? At Hackensack Meridian</strong> <em><strong>Health</strong></em><strong> our teams are focused on changing the lives of our patients by providing the highest level of care each and every day. From our hospitals, rehab centers and occupational health teams to our long-term care centers and at-home care capabilities, our complete spectrum of services will allow you to apply your skills in multiple settings while building your career, all within New Jersey's premier healthcare system.</strong>\n<br><br>\n<strong>The Data Scientist will be leading advanced analytic projects supporting Hackensack Meridian Health, using data to solve strategic and research problems. The Data Scientist will wrangle large and complex data sets, and build machine learning models to aid Hackensack Meridian Health initiatives across all departments. The Data Scientist will conduct appropriate analyses and present results in an innovative format and informative visualizations for a broad audience. The Data Scientist employs investigative design, performs data collection and statistical analyses of data, interprets results, verifies data accuracy, and prepares final reports using a variety of software and tools. In addition, the data scientist will participate in peer review and provide training on analytics and data science.</strong><br><br>Responsibilities<br><br><strong>1. Distill complex data into actionable insights that empower others to drive operational strategic initiatives. 2. Design, build, and extract large and complex data sets, including both structured and unstructured data, while thinking strategically about uses of data and how data use interacts with data design. 3. Build, test, and implement machine learning models to aid performance improvement and strategic initiatives by investigating appropriate methods and algorithms. 4. Deliver intelligence and insights to stakeholders within a specified timeframe by applying and demonstrating expertise in the areas of advanced analytics, machine learning, forecasting, data wrangling, and predictive modeling. 5. Evaluate data quality and provide support to data governance activities. 6. Communicate findings (written and verbally) to diverse stakeholders and present to senior leadership. 7. Provide feedback to other team members by participating in peer review and educate the organization on data science and analytics.</strong><br><br>Qualifications<br><br><strong>Education, Knowledge, Skills and Abilities Required: 1. Advanced degree (M.S. or Ph.D.) in quantitative fields (statistics, engineering, physics, epidemiology or STEM) and 3 years experience in data analytics, advanced statistical analysis, or predictive analytics required; or an equivalent combination of education and/or experience. 2. Strong experience with structured data and relational databases, and familiarity with unstructured data. 3. Experience with statistical programming software, such as R, SAS, or Stata. 4. Ability to structure analysis with efficiency and repeatability in mind. 5. Ability to investigate, organize, and merge data from different sources into a single data structure. 6. Ability to execute logical data queries from operational, billing, and clinical information systems. 7. Hands on experience with data mining, predictive modeling, and machine learning. Education, Knowledge, Skills and Abilities Preferred: 1. Knowledge or experience in healthcare and health delivery sciences highly preferred. 2. Experience with visualization/BI tools and automated reporting tools preferred (SSRS, Crystal Reports, Tableau, Power BI, etc.). 3. Ability to perform complex analyses for strategic and research projects, such as study design/sample size estimations and analysis of study results preferred. 4. Familiarity with programming and/or scripting languages (Python, C, C++, Java etc.) preferred. Licenses and Certifications Required: Licenses and Certifications Preferred:</strong>"}