{"job title": "United States Houston: Data Scientist", "company": "Halliburton", "city state": "– Houston, TX", "rating": "3.5", "job description": "We are looking for the right people people who want to innovate, achieve, grow and lead. We attract and retain the best talentby investing in our employees and empowering them to develop themselves and their careers. Experience the challenges, rewards and opportunity of working for one of the world's largest providers of products and services to the global energy industry.\n<br><br>\nOverview\n<br><br>\nAs a data scientist on Halliburton Digital Solution team, you are responsible to deliver digital solutions which can achieve measurable business results through collaborating with subject matter experts in businesses, building data analytics models, prototyping data driven digital tools to tackle business problems. We are looking for top talents who enjoyed learning and contributing to our team through creative and innovative thinking.\n<br><br>\nJob Responsibilities\n<br><br>\nTranslate large scale complex business data(time series data, structured/unstructured) into identified patterns/trends or predictive models, deploy solutions to business units to generate measurable values for businesses.\n<br><br>\nGrasp the latest machine learning, artificial intelligence, cloud distributed computing technologies to ensure the best technologies were implemented to meet businesses' data challenges.\n<br><br>\nRequired Qualifications\n\n\n<ul>\n<li>Advanced degree (Master or Ph.D.) in Math, Statistics with 3+ years of data analytics experience</li>\n<li>Minimum of 3 year experience in building classification or regression models using R or Python.</li>\n<li>Familiar with popular machine learning and artificial intelligence packages provided by Amazon AWS, Microsoft or Google (such as Azure, Sagemaker, GCP).</li>\n<li>Minimum of 3 year experience with data visualization technologies using popular software (such as Tableau, PowerBI).</li>\n</ul>\n\n<strong>Desired Qualifications</strong>\n\n\n<ul>\n<li>Worked with big data platform like Hadoop, Hive, or Phoenix. Had knowledge in parallel programming, map-reduce framework in Spark.</li>\n<li>Knowledge in full stack development. This covered backend data processing skills including programming with Postgresql, or with Sklearn, and front end development with HTML, CSS, Javascript, Python or Java.</li>\n<li>Experience in programming data visualization dashboard using data visualization open source like (D3.js, dimple.js)</li>\n</ul>\n\nInterview Process\n\n\n<ul>\n<li>Potential candidates are required to pass a data challenge test before on-site interview can be scheduled</li>\n</ul>\n\nHalliburton is an Equal Opportunity Employer.\n<br><br>\nLocation\n<br><br>\n3000 N. Sam Houston Parkway E., Houston, Texas, 77032, United States\n<br><br>\nJob Details\n<br><br>\nRequisition Number: 62116\n<br><br>\nExperience Level: Experienced Hire\n<br><br>\nJob Family: Engineering/Science/Technology\n<br><br>\nProduct Service Line: Landmark Software&amp;Services\n<br><br>\nFull Time / Part Time: Full Time\n<br><br>\n<strong>Additional Locations for this position:</strong>\n<br><br>\nCompensation Information\n<br><br>\nCompensation is competitive and commensurate with experience.\n<br><br>\nNearest Major Market: Houston\n<br><br>\nJob Segment: Database, Developer, Cloud, Java, Testing, Technology"}