{"job title": "Data Scientist", "company": "Hallmark", "city state": "– Kansas City, MO, US", "rating": "3.3", "job description": "<div>\nData Scientist\n<br>\n Apply now »<br>\n\n <div>\nApply now \n\n\n<ul>\n\n \n<li>\n<br>\n<br>\n Start apply with LinkedIn</li>\n<br><br>\n<li>\n<br>\n Apply Now</li><br>\n\n<div>\n<div>\n<div>\nStart</div>\n </div>\n </div>\n\n<br><li>\n <div>\n<strong>Please wait...</strong></div>\n</li>\n\n</ul>\n\n </div>\n</div>\n<br><strong>Date:</strong> \n<br>\n Jun 7, 2018\n<br><br>\n<strong>Location:</strong>\n<br><br>\n Kansas City, MO, US, 64108<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n }<br><br><strong>Company:</strong> \n<br>\n Hallmark<br>\n<div><strong><em>WHEN YOU CARE ENOUGH YOU CAN CHANGE THE WORLD.</em></strong>\n<br><br>\nDo you want to work for a one of the world's most trusted and recognized brands? Hallmark is a company rooted in connecting people. We care for our employees, our communities, and our world. A career at Hallmark means you get to make a big impact and create something that can make a genuine difference. We’re looking for people who want to continue to carry our vision forward.\n<br><br>\nOver the last 100+ years we have created thousands of unique products in 30 languages that are distributed in over 40,000 retail rooftops throughout 100 countries around the world. This means that Hallmark was a big data company before big data was even a “thing.” We have data on millions of consumers and their purchases across tens-of-thousands of products across thousands of points of distribution. Recently, we have layered digital consumer behavior data, digital marketing data, and social data. This means our big data <em><u>just</u> <u>got</u> <u>bigger</u></em>!\n<br><br>\nWe need a curious, analytic <strong>Data Scientist</strong> to join our team to help us develop business growth insights from all this data. You will have the opportunity to analyze large datasets in a collaborative team work environment providing daily challenges and ongoing learning.\n<br><br>\nHallmark’s <strong>Data Scientist</strong> perform data analyses to derive insight, patterns and correlations from Hallmark's big data that includes vast amounts of consumer data, store data, product sales data, and other relevant data. You will develop predictive and prescriptive algorithms and conduct data analyses to drive business growth and impact strategic business decisions. You will work in a team environment alongside a group of expert mathematicians, statisticians and data scientists.\n<br><br>\n<strong>The perfect candidate…:</strong>\n\n<ul>\n\n\t<li>is an <strong>analytic leader</strong> who can <strong>mentor</strong> and <strong>teach</strong> to help <strong>enhance</strong>, <strong>build</strong>, and <strong>grow</strong> Hallmark’s analytic capabilities.</li>\n<li>will have <strong>proven experience</strong> over multiple years conducting analysis and developing algorithms for consumers and/or stores from a consumer packaged goods (CPG) company or retailer.</li>\n<li>can <strong>hit the ground running</strong> and bring <strong>new analytical approaches</strong> not currently practiced by Hallmark.</li>\n<li>is <strong>flexible</strong>, has strong initiative and is <strong>highly collaborative</strong>.</li>\n<li>will be innately <strong>curious</strong> and a strong critical thinker.</li>\n</ul>\n<strong>APPLICATION INSTRUCTIONS:</strong>\n<br><br>\nTo be considered an applicant for this position you must show how you meet the basic qualifications of the job in a resume or document you upload, or by completing the work experience and education application fields. Accepted file types are Microsoft Word (DOC or DOCX), PDF, HTML, or TXT. Individual file size attachment limit is 10 MB.\n<br><br>\nIn compliance with the Immigration Reform and Control Act of 1986, Hallmark Cards, Inc. and its subsidiary companies will hire only individuals lawfully authorized to work in the United States. Hallmark does not generally provide sponsorship for employment. Employment by Hallmark is contingent upon the signing of the Employment Agreement, signing of an agreement to arbitrate in connection with the Hallmark Dispute Resolution Program, completing Form I-9 Employment Eligibility Verification, passing the urinalysis drug screen, education verification and satisfactory reference and background checks.\n<br><br>\n<strong>BASIC QUALIFICATIONS</strong>\n\n<ul>\n\n\t<li>3+ years of mathematical predictive algorithm development utilizing large-scale multivariate datasets in a business environment</li>\n<li>3+ years’ business experience in application of advanced analytics and data mining including predictive algorithms</li>\n</ul>\n<strong>PREFERRED QUALIFICATIONS</strong>\n\n<ul>\n\n\t<li>Business experience working with large-scale consumer analytics datasets</li>\n<li>6+ years’ business experience of mathematical predictive algorithm development utilizing large-scale multivariate datasets</li>\n<li>6+ years’ experience in business application of advanced analytics and data mining including predictive algorithms in a professional environment</li>\n<li>Experience in building big data based IT processes, understanding data science workflows and building pipelines</li>\n<li>Strong communication skills: written, verbal, and presentation</li>\n<li>PhD or MS in quantitative discipline - Statistics, Physics, Math, Engineering, Economics, Econometrics, Data Science, Computer Science, Operations Research – highly preferred</li>\n<li>Experience with SAS, R, Python, Tableau, SQL, Hadoop, Spark</li>\n<li>Proficiency in either R or Python</li>\n<li>Experience deriving insight from structured and unstructured data</li>\n<li>Experience with a consumer packaged goods (CPG) company or retailer</li>\n<li>Demonstrated ability to derive explanatory variables from high-dimensionality collections of data: social, click-stream, SKU-level sales, digital marketing, weather, economic</li>\n<li>Experience working with Big Data</li>\n<li>Inherently Curious, Self-starter, Proactive, Comfort with Ambiguity, Passion for Problem-solving, Creative, Collaborative, Team-oriented</li>\n<li>Demonstrated ability to coach and teach others</li>\n</ul>\nHallmark believes in enriching the lives of our employees by offering benefit programs to help you:\n\n<ul>\n\n\t<li><strong>Take care of you and yours:</strong> We offer comprehensive medical, dental and vision benefits, as well as discounts on elder care, child care, education assistance and adoption assistance.</li>\n<li><strong>Save for your future:</strong> Through profit sharing, you share in the success of Hallmark. We also offer a 4% match on 401(k) contributions.</li>\n<li><strong>Enjoy your time:</strong> Maximize your work-life balance through Paid Time Off (PTO), paid holidays, community volunteer opportunities and discounts on product, entertainment venues, amusement parks and sporting events.</li>\n<li><strong>And More!</strong> (Like an on-site cafeteria, free parking, access to Crown Center and a fitness center.)</li>\n</ul>\nHallmark is an equal opportunity employer. All qualified applicants will be considered for employment without regard to race, color, religion, sex, age, pregnancy, national origin, physical or mental disability, genetics, sexual orientation, gender identity, veteran status, or any other legally-protected status. Principals only please.\n<br><br>\n<strong>Nearest Major Market:</strong> Kansas City\n<br>\n<strong>Job Segment:</strong> \n<br>\n Retail Sales, Retail</div><br>\n\n <div>\nApply now »<br>\n\n <div>\nApply now \n\n\n<ul>\n\n \n<li>\n<br>\n<br>\n Start apply with LinkedIn</li>\n<br><br>\n<li>\n<br>\n Apply Now</li><br>\n\n<div>\n<div>\n<div>\nStart</div>\n </div>\n </div>\n\n<br><li>\n <div>\n<strong>Please wait...</strong></div>\n</li>\n\n</ul>\n\n </div>\n</div>\n\n<br>"}