{"job title": "Data Scientist", "company": "Hamilton Technical Personnel", "city state": "– New York, NY", "rating": "NA", "job description": "Our client is a highly successful financial-technology company with an outstanding reputation for innovative software products which support global eTrading. They re now seeking a smart, hands-on data scientist who will join a newly established team dedicated to analyzing patterns in complex data sets and identifying trends which define product usage and requirements. Must have ability to take ownership of data research projects or parts of major complex projects and coordinate or oversee to successful completion and then develop meaningful recommendations for senior management to support the expansion of software products for this innovative and award-winning fin-tech company. Responsibilities include: Analyze trends and patterns in data sets that can be leveraged towards future software product developmentInteract with Data Scientists on small dedicated team and work independently on major projects.Design and improve data collection and database designs to optimize efficiency and improve the data qualityCapture data from multiple sources that can be used to enhance and improve analysis The right candidate will have strong skills in data mining, skills in machine learning and/or statistical languages such as SAS, R, Python, and a strong understand data sourcing. Our client offers exceptional compensation potential, challenging work, superior benefits. This is a key position where one s work will be recognized and rewarded. Qualifications:Masters or PhD in Computer Science, Mathematics, Statistics or other hard science fieldsSolid professional experience (4-6 years) in a Data Science roleStrong skills with statistical languages such as Python or SAS or RExperience with data mining, optimizing data collection, database design and data modeling/analysisFamiliarity with toolkits for analyzing large, complex datasetsExcellent analytical skills and the ability to extract meaningful trends from complex sourcesExpert problem-solving skills and creative thinking ability Comfort and ability to present key findings to managers Our client offers exceptional compensation potential, challenging work, superior benefits. This is a key position where one s work will be recognized and rewarded. - provided by Dice Data Science / Deep analysis of complex data / Statistical Languages SAS or Python or R / Data mining, Data Optimization, Data Modeling / Machine Learning\n<br>\nAssociated topics: c c++, computer engineering, electrical, electrical engineering, informatic, information technology, programmer, python, radar, schematic"}