{"job title": "Data Scientist", "company": "Harvard Pilgrim", "city state": "– United States-Massachusetts-Wellesley", "rating": "3.8", "job description": "<div>Are you interested in becoming part of a dynamic team that is looking to innovate and improve? Would you like to work for a company that has been rated by the BBJ (15 yrs) as one of the best places to work? Do you want to be part of a company that is committed to giving back to the community?</div>\n<br>\n<div>Harvard Pilgrim Health Care is currently seeking highly motivated individuals to join our organization as Data Scientist. The Data Scientist is expected to provide innovative solutions driven by exploratory data analysis from complex and high-dimensional datasets, recognize patterns, identify opportunities, pose business questions, and make valuable discoveries.</div> \n<br>\n<div><strong><u>WHAT YOU WILL BE DOING</u></strong></div>\n\n\n<ul>\n<li>.Participate on multiple and concurrent projects and manage project phases or smaller projects in their entirety. Communicate results and insights in a clear and concise manner to a non-technical audience.</li> \n\n<li>Identify, define and translate business needs/problems into analytical questions.</li> \n\n<li>Design and execute experiments, models, algorithms, and visualizations.</li> \n\n<li>Apply advanced statistical and computational methodologies to provide actionable insights and identify strategic opportunities that optimize quality, consumer experience, and healthcare costs.</li> \n\n<li>Develop scalable, efficient, and automated processes for large scale data analyses and model development, validation, and implementation.</li> \n\n<li>Perform out-of-the-box thinking, collaborate with others, and make a difference every day!</li> \n\n<li>Other duties and projects as assigned.</li>\n</ul>\n\n<div><strong><u>WHAT YOU NEED</u></strong></div>\n\n\n<ul>\n<li>Bachelor’s degree in Data Science, Applied Mathematics, Computer science, Statistics, Epidemiology, or equivalent combination of experience and education. 3 years of work experience in a Data Scientist or similar role, or equivalent combination of transferrable experience and education; 3 years experience with advanced statistics and statistical packages (SAS, SQL) as well as Excel/PowerPoint skills (including visual graphics and analytics).</li> \n\n<li>Strong willingness and emerging ability to lead projects and manage project phases or smaller projects in their entirety.</li> \n\n<li>Emerging ability to think strategically and broadly (end to end process), analyzing complex business problems. Full understanding of data sources and limitations, warehousing system and the impact of the data on business decisions.</li> \n\n<li>Ability to prioritize work independently and meet/exceed deadlines. Strong decision making ability, teamwork, collaborative, and communication skills. Proven track record of creating strong actionable insights that drive decision making and business process.</li> \n\n<li>Resilient, collaborative, flexible, innovative.</li>\n</ul>\n\n<div><strong><u>WHAT MAKES US STAND OUT</u></strong></div>\n\n\n<ul>\n<li>Work-Life-Flexibility</li> \n\n<li>Paid volunteer time off (up to 3 days annually)</li> \n\n<li>Open Time Off</li> \n\n<li>Annual Mini-Grant of $500 donated to a non-profit organization of the employee’s choice</li> \n\n<li>Educational Reimbursement</li>\n</ul>\n\n<div><strong><u>Working Environment</u></strong></div> \n<br>\n<div>Normal office environment; must have ability to commute between HPHC locations as required by the position.</div>"}