{"job title": "Research Scientist", "company": "Harvard School of Dental Medicine", "city state": "– Boston, MA", "rating": "NA", "job description": "The Department of Developmental Biology at HSDM is looking for a Research Scientist in the laboratory of Dr. Andreia Ionescu. We welcome candidates with BS/MS/PhD who are interested in becoming lab manager.\n<br><br>\nResearch in Dr. Ionescu’ s laboratory focuses on cartilage and bone regeneration using both cell and mouse models. The successful candidate will support multiple projects investigating the molecular mechanisms of osteoarthritis and epiphyseal cartilage regeneration, as well as helping with general daily laboratory upkeep tasks. The position involves a substantial amount of mouse work as well as mammalian cell culture, general biochemistry and molecular biology techniques.\n<br><br>\nDuties and responsibilities include, but are not limited to, the following: use of the following molecular biology techniques: qPCR, mammalian tissue culture with established lines and primary cells, biochemical assays, histology, immunohistochemistry, laser capture microscopy. Performance of rodent work, including the following: husbandry, breeding, colony maintenance, genotyping, small animal surgery, euthanasia and tissue collection.\n<br><br>\nThe incumbent will also be responsible for organizing, processing, and reporting data. Will also be expected to participate and present in regular lab meetings. High level of initiative and motivation preferred; ability to work independently and with a team preferred; excellent communication, organization, time management, and record-keeping skills preferred. The candidate must have extremely high standards in terms of quality of work, attention to detail, strong organization skills, and absolute commitment to task completion. He or she must be able to balance multiple tasks and shifting priorities under tight deadlines at an accelerated pace when necessary; proven ability to work independently and creatively; and strong skills in written English, demonstrated in examples such as prior research writing. Strong skills in Microsoft Office are expected.\n<br><br>\nFor additional information about the Ionescu lab, please visit: https://hsdm.harvard.edu/ionescu-lab"}