{"job title": "Talent Acquisition Data Analyst", "company": "Hayneedle", "city state": "– Omaha, NE", "rating": "3.2", "job description": "<strong>Talent Acquisition Data Analyst</strong>\n<br><br>\nWant to help change the future of online commerce? Ready to work with a team of bright minds at the intersection of content, commerce, and technology to build the worlds most customer-centric home shopping experience?\n<br><br>\nHayneedle was recently acquired by <strong>Walmart/Jet</strong> and is experiencing unprecedented growth. With an entrepreneurial spirit that fosters teamwork and professional development, our business is poised to redefine the way consumers decorate and shop for their home.\n<br><br>\nWe are looking for a Talent Acquisition Data Analyst who can design, develop and support dashboards and reports. This role will be critical to help lead activities to capture, analyze and report on trends using dashboards they create. We need your expertise creating adhoc reports and dashboards to help our leaders and team members visualize and understand the data.\n<br><br>\nThis role will report to the Director of Talent Acquisition and will be based at Hayneedle HQ in Omaha, Nebraska.\n<br><br>\n<strong>WHAT YOU WILL GET TO DO:</strong>\n\n<ul>\n<li>Aggregate Talent Acquisition reports and provide other ad-hoc analytics</li>\n<li>Work proactively and independently with Talent Acquisition leaders to perform analysis of relevant metrics, uncover and interpret trends in data, and provide recommendations</li>\n<li>Communicate analytical findings to non-technical audiences in a way that influences Talent Acquisition leadership on decision making</li>\n<li>Create regular and ad-hoc reports, data mining, data consulting and other data analysis as needed</li> \n</ul>\n<strong>WHO YOU ARE:</strong>\n\n<ul>\n<li>Bachelor's Degree or equivalent. (Math, Statistics, Data Science, Operations Research, Industrial Organizational Psychology).</li>\n<li>3+ years of related experience developing predictive models that drive business decisions and improve business outcomes</li>\n<li>Experience with data analysis software tools</li>\n<li>Experience with Greenhouse a plus prefer knowledge of Recruiting module</li>\n<li>Great attitude with a passion for data and motivation to develop solutions</li>\n<li>A good balance of analytical and creative thinking with prowess in analyzing and interpreting complex data</li>\n<li>Team player who is a self-starter and is able to thrive in fast-paced, results-oriented environment</li>\n</ul>\n<strong>WHAT WE CAN OFFER YOU:</strong>\n\n<ul>\n<li>Exciting, challenging problems to solve - you'll never have a boring day at the office</li>\n<li>A refreshingly fun work environment where you will collaborate with a smart and talented team of merchandisers, designers, engineers and business folks who care most about getting things done</li>\n<li>Unique chance to work with our family of brands: <strong>Walmart, Jet</strong>, etc.</li>\n<li>Opportunity to participate in the growth stage of a business</li> \n</ul>\n<strong>Meet Our Family of Brands</strong>\n<br><br>\nWalmart.com\n<br><br>\nJet\n<br><br>\nHayneedle\n<br><br>\nBonobos\n<br><br>\nMooseJaw\n<br><br>\nModCloth\n<br><br>\nShoes.com"}