{"job title": "Data Scientist", "company": "Hays", "city state": "– Reston, Virginia", "rating": "4.0", "job description": "Data Scientist, Permanent, Reston, VA, $120,000-$150,000\n<br><br>\nData Scientist - PERMANENT- RESTON, VA\n<br><br>\nThe end client is unable to sponsor or transfer visas for this position; all parties authorized to work in the US without sponsorship are encouraged to apply.\n<br><br>\n<strong>Data Scientist Skills &amp; Requirements:</strong>\n\n\n<ul>\n<li>Previously mentored Jr. level data scientists</li>\n<li>Natural language processing (sentiment analysis, NER, SyntaxNet, )</li>\n<li>Machine learning (both supervised and unsupervised, online and offline)</li>\n<li>Automatic reply and dialogue systems (bots)</li>\n<li>Big data</li>\n<li>Writing code for R&amp;D</li>\n<li>Managing data (Python, R, or Java)</li>\n<li>Users of tools like TensorFlow and PyTorch</li>\n<li>Worked with text and social media data (NLP)</li>\n</ul>\n\nWhy Hays?\n<br><br>\nYou will be working with a professional recruiter who has intimate knowledge of the Information Technology industry and market trends . Your Hays recruiter will lead you through a thorough screening process in order to understand your skills, experience, needs, and drivers. You will also get support on resume writing, interview tips, and career planning, so when there's a position you really want, you're fully prepared to get it. Additionally, if the position is a consulting role, Hays offers you the opportunity to enroll in full medical, dental or vision benefits.\n\n\n<ul>\n<li>Medical</li>\n<li>Dental</li>\n<li>Vision</li>\n<li>401K</li>\n<li>Life Insurance ($20,000 benefit)</li>\n<li>ATOP - Accrued time off program</li>\n<li>Consultant lunches and outings</li>\n<li>Care packages/Survival packs</li>\n<li>Dedicated Consulting Services Representative</li>\n</ul>\n\nNervous about an upcoming interview? Unsure how to write a new resume?\n<br><br>\nVisit the Hays Career Advice section to learn top tips to help you stand out from the crowd when job hunting.\n<br><br>\nHays is an Equal Opportunity Employer.\n<br><br>\nDrug testing may be required; please contact a recruiter for more information."}