{"job title": "Data Scientist", "company": "HCSC", "city state": "– IL - Chicago", "rating": "3.2", "job description": "<div>\n<div>\nRefer</div><br>\n\n<div>\nSave</div><br>\n\n<div>\nApply</div>\n </div>\n\n<br>Job ID: CP-1026684\n<br><br>\nDescription:\n<br>\n <div>We’re looking for a Data Scientist in our growing Enterprise Analytics area to develop new data science products using machine learning, natural language processing, data visualization techniques, and other forms of advanced analytics.\n<br><br>\nThe Enterprise Analytics team is also a Center of Excellence for data science at Blue Cross and Blue Shield of Illinois, New Mexico, Montana, Oklahoma &amp; Texas. This person will spend approximately a quarter of their time promoting best practices in data science across the enterprise and leading and organizing technical training for the broader community.\n<br><br>\nAt the largest customer-owned and not-for-profit health insurer and fourth largest health insurer overall in the United States, you will have the opportunity to work with massive datasets to drive revenue growth, improve our operational and member-facing processes, and affect how healthcare is delivered to our members.\n<br><br>\nAn ideal candidate would be someone who loves working with data, demonstrates a continuous learning and growth mindset, possesses an interest in the intersection of healthcare and technology, and has an ability to communicate complex technical concepts to non-technical audiences.\n<br><br>\nJob Purpose:\n<br>\nThis position is responsible for employing advanced analytical techniques to create and drive adoption of data-based products and processes to add business value for internal and external customers. They will use data analysis, machine learning, predictive modeling, statistics, visualization, and other data science techniques to derive actionable insights. They will leverage domain expertise and communication skills to identify data-based solutions to customer needs, and present and explain technical findings to non-technical audiences to promote data-driven decision making. They will create analytical processes for automated machine driven decision making where human decision making is not scalable or feasible.\n<br><br>\n<strong>Required Job Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree and 3 years of work experience in a mathematical, statistical, computer science, engineering, physics, economics or related quantitative field; OR Actuarial credential or Master</li>\n<li>s degree and 2 years of work experience in a mathematical, statistical, computer science, engineering, physics, economics or related quantitative field; OR Ph.D. in a mathematical, statistical, computer science, engineering, physics, economics or related quantitative field; OR 6 years</li>\n<li>experience in an advanced mathematical, statistical, computer science, engineering, physics, economics or related quantitative field.</li>\n<li>Strong learning and growth mindset</li>\n<li>Customer-focused</li>\n<li>Strong interpersonal, verbal and written communication skills.</li>\n<li>Must demonstrate proficiency in at least four of the following six areas: 1) data analysis and relational-style query languages; 2) machine learning and/or statistical modeling; 3) data visualization; 4) a high-level programming language; 5) distributed computing; 6) understanding of healthcare.</li>\n<li>Proficiency with Microsoft applications including Access, Excel, Word and Power Point.</li>\n</ul>\n\n<strong>Preferred Job Qualifications:</strong>\n\n\n<ul>\n<li>Masters or Ph.D. in a quantitative field, or bachelors degree with significant healthcare experience.</li>\n</ul>\n\nThis position is based in Chicago, IL.\n<br>\nRelocation will not be provided for this position.\n<br>\nSponsorship will not be provided for this position.</div><br>\n\n <div>HCSC is committed to diversity in the workplace and to providing equal opportunity and affirmative action to employees and applicants. We are an Equal Opportunity Employment / Affirmative Action employer dedicated to workforce diversity and a drug-free and smoke-free workplace. Drug screening and background investigation are required, as allowed by law. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.</div>\n\n<br>Requirements:<br>\n\n<div> Expertise\n\n<ul>\n\n<li>\nAnalytics &amp; Reporting</li> \n</ul>\n\nAnalytics &amp; Reporting</div> <div> Job Type\n\n<ul>\n\n<li>\nFull-Time Regular</li> \n</ul>\n\nFull-Time Regular</div> <div> Location\n\n<ul>\n\n<li>\nIL - Chicago</li> \n</ul>\n\nIL - Chicago</div>"}