{"job title": "Scientist - Statistical Geneticist", "company": "Helix", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "We believe that everyone benefits from their biological information. It is our mission to empower every person to improve their life through DNA. With our high-quality, trusted partners and state-of-the-art lab, we have created the first platform of personalized products and services powered by genetics. From inherited cancer screening to custom fitness and nutrition plans, the world of DNA learning is becoming more accessible and more valuable than ever.\n<br><br>\nSo far we have raised over $300 million from investors like Illumina (the world's leader in genetic sequencing equipment), Warburg Pincus, Sutter Hill Ventures, Kleiner Perkins Caufield &amp; Byers and Draper Fisher Jurvetson Growth. Our app store and marketplace include partners such as National Geographic, Admera Health, Vinome and many others, with whom we have partnered to develop applications which interpret your genome.\n<br><br>\nOur big vision comes with big responsibility. That's why we're building a team of experts in the field of genetics, engineering, design, business development, and beyond to help bring actionable insights to our customers. We're looking for the best and brightest minds who are passionate about our mission and are excited to work with a truly diverse team.\n<br><br>\nWe are looking for scientists to join our growing Research team. This role is ideal for an scientist trained in population genetics, biostatistics, or genetic epidemiology. The successful candidate will perform population-scale analysis using public and internal genotype, exome, and phenotype data to evaluate, explore, and identify genetic associations and underpinnings of phenotypic traits and disease. You will have the opportunity to work in a highly collaborative environment with our team of scientists, bioinformaticians, and engineers, where your impact will be new genetic insights that are published in peer-reviewed journals and translated into new products for our users. Above all, you have an insatiable curiosity, entrepreneurial spirit, enjoy team science, and are excited about the potential discoveries we will make by leveraging the largest CLIA-certified exome dataset in the world.\n<br><br>\n<strong>As a Scientist - Statistical Geneticist, you will:</strong>\n\n<ul>\n<li>Analyze population-scale genomic and phenotypic data to evaluate, explore, and identify genetic associations and causes of phenotypic traits and disease</li>\n<li>Research and develop novel statistical and computational approaches for population-scale analysis</li>\n<li>Keep up to date on the latest science in scientific areas related to genotype-phenotype relationships including genetic risk scores, GWAS, PheWAS, meta-analyses and gene burden tests</li>\n<li>Evaluate and incorporate latest analytical approaches in statistical genetics in an industry environment</li>\n<li>Communicate project results both verbally and in writing to scientists and nonscientists alike</li>\n</ul>\nRequired background:\n\n<ul>\n<li>PhD in statistical genetics, biostatistics, or related field (genetics, computer science, public health, etc)</li>\n<li>Human population genetics and genomics research experience</li>\n<li>Experience with exome and/or whole genome sequence analysis</li>\n<li>Experience with GWAS, PheWAS, and gene burden tests</li>\n<li>Experience analyzing and manipulating large datasets in Python, R, or SAS; C/C++ or Java a plus</li>\n<li>Strong communication skills, both oral and written</li>\n<li>Entrepreneurial spirit; willing to contribute in multiple areas</li>\n</ul>\n<strong>Ideal candidate will have:</strong>\n\n<ul>\n<li>2+ years postdoc or industry experience</li>\n<li>Experience analyzing large-scale datasets such as UKBiobank, GIANT, TOPmed, PAGE, MVP, etc</li>\n<li>Understand the theoretical frameworks for GWAS, genetic risk scores, gene burden tests, and be able to extend known tools into novel and scalable approaches</li>\n<li>Experience handling large structured and unstructured data using Python, R, Matlab or other frameworks</li>\n<li>Experience with Linux-based high-performance computing environments (on-prem or cloud)</li>\n<li>Up-to-date knowledge of and ability to use genomic annotation and interpretation tools</li>\n<li>Experience in algorithm development and/or statistical learning approaches</li>\n</ul>\n<strong>What Helix has to offer you</strong>\n<br><br>\nAside from working alongside brilliant, dedicated, passionate, down-to-earth, curious, warm, and thoughtful people, we also provide great benefits:\n\n<ul>\n<li>Competitive compensation, including meaningful equity</li>\n<li>Health insurance, including medical, dental, and vision</li>\n<li>12 weeks of Maternity or Paternity leave</li>\n<li>4 weeks of paid Pregnancy Disability</li>\n<li>401(k) with employer matching</li>\n<li>On-premise nursing room</li>\n<li>Corporate fitness rate</li>\n<li>Commuter benefits</li>\n<li>Catered meals</li>\n<li>Flexible PTO</li>\n</ul>\nHelix is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws."}