{"job title": "Bioinformatics Scientist", "company": "Helix", "city state": "– San Carlos, CA", "rating": "4.1", "job description": "We believe that everyone benefits from their biological information. It is our mission to empower every person to improve their life through DNA. With our high-quality, trusted partners and state-of-the-art lab, we have created the first platform of personalized products and services powered by genetics. From inherited cancer screening to custom fitness and nutrition plans, the world of DNA learning is becoming more accessible and more valuable than ever.\n<br><br>\nSo far we have raised over $300 million from investors like Illumina (the world's leader in genetic sequencing equipment), Warburg Pincus, Sutter Hill Ventures, Kleiner Perkins Caufield &amp; Byers and Draper Fisher Jurvetson Growth. Our app store and marketplace include partners such as National Geographic, Admera Health, Vinome and many others, with whom we have partnered to develop applications which interpret your genome.\n<br><br>\nOur big vision comes with big responsibility. That's why we're building a team of experts in the field of genetics, engineering, design, business development, and beyond to help bring actionable insights to our customers. We're looking for the best and brightest minds who are passionate about our mission and are excited to work with a truly diverse team.\n<br><br>\nWe are looking for a bioinformatics scientist to join our Partner Science team. The successful candidate will work with our partners to build safe, accurate and insightful products that benefit all Helix users. You will help them integrate and parse the genomic data coming from Helix by reviewing their product and by contributing to our SDK. You will work cross-functionally with our science, bioinformatics R&amp;D, and engineering teams to develop new analytical capabilities toward democratizing access to genomic information. For example, you could create a service to test the applicability of a polygenic risk score across populations with different ancestries. Above all, you have an insatiable curiosity, entrepreneurial spirit, enjoy teamwork, and are excited about the potential of combining exome data with the expertise of all our partners.\n<br><br>\n<strong>As a Bioinformatics Scientist, you will:</strong>\n\n<ul>\n<li>Review and test products on the Helix platform</li> \n\n<li>Onboard partners and help them integrate with our genomic APIs. Create solutions that scale as the number of partners using Helix genomic data increases</li>\n<li>Work closely with our bioinformatics team to prototype new analytical capabilities (allelic dosage, risk score distribution across ancestries)</li>\n<li>Use Helix dataset as well as public datasets like UKBB to create and replicate genetic risk scores</li>\n<li>Communicate about the science at Helix</li>\n</ul>\n<strong>Required background:</strong>\n\n<ul>\n<li>Ph.D. in bioinformatics or a related field (genetics, computer science, etc), or an MS + 3 years of experience in the industry</li>\n<li>Experience with human NGS (exome/genome preferred) sequence analysis</li>\n<li>Experience analyzing and manipulating large datasets in Python (preferred), R.</li>\n<li>Strong communication skills, both oral and written.</li> \n\n<li>Entrepreneurial spirit; willing to contribute in multiple areas; curious and independently motivated</li>\n<li>Problem-focused and able to drive tasks to completion</li>\n<li>Able to travel at least once per quarter</li> \n</ul>\n<strong>The ideal candidate will have:</strong>\n\n<ul>\n<li>Experience with outside collaborations</li>\n<li>Ability to explain complicated topics to lay audience (blogging or public lectures)</li>\n<li>Experience with GitHub, AWS, etc.</li>\n<li>Code documentation intended for general audience readability and use</li>\n<li>Experience analyzing large-scale datasets such as the UKBiobank</li>\n</ul>\n<strong>What Helix has to offer you</strong>\n<br><br>\nAside from working alongside brilliant, dedicated, passionate, down-to-earth, curious, warm, and thoughtful people, we also provide great benefits:\n\n<ul>\n<li>Competitive compensation, including meaningful equity</li>\n<li>Health insurance, including medical, dental, and vision</li>\n<li>12 weeks of Maternity or Paternity leave</li>\n<li>4 weeks of paid Pregnancy Disability</li>\n<li>401(k) with employer matching</li>\n<li>On-premise nursing room</li>\n<li>Corporate fitness rate</li>\n<li>Commuter benefits</li>\n<li>Catered meals</li>\n<li>Flexible PTO</li>\n</ul>\nHelix is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws."}