{"job title": "Data Scientist", "company": "HelloWorld", "city state": "– Seattle", "rating": "4.0", "job description": "Data Scientist\n<br>\n Analytics - Seattle\n<br>\n <div>\nOverview<br><br>At HelloWorld, we are committed to creating and deploying best-in-class loyalty programs and promotions for our clients. We are seeking a key team member to support growth in analytics, insights and data-driven offering. This team member will be an experienced data scientist with machine learning and \"big data\" experience and a stellar track record of providing data-driven insights and solutions from the data. The winning candidate will be driven, self-directed, possess a passion for exploring the whys and what-ifs and an ability to translate these into recommendations that optimize program performance. Technical aptitude and familiarity with common data mining and statistical applications are important for this position. The candidate should also be an effective communicator capable of independently driving issues to resolution and communicating insights to non-technical audiences.<br><br>Description and Responsibilities\n\n\n<ul>\n<li>Manipulate and analyze complex, high-volume, high-dimensionality data from varying sources using a variety of tools and data analysis techniques.</li>\n<li>Deliver actionable insights on ambiguous projects with multiple stakeholders, unclear requirements and often incomplete data.</li>\n<li>Develop and implement measurement plans to address specific business questions with high quality, defensible data analytics.</li>\n<li>Derive actionable insights, build predictive models and/or construct addressable segments from individual- and event-level behavior data using advanced statistics and machine learning.</li>\n<li>Integrate data from multiple platforms and applications to provide holistic insights and cross-platform actionabilty.</li>\n<li>Design, implement, and analyze experiments to provide causal analysis.</li> \n\n<li>Present findings and recommendations to key decision makers and influencers at various seniority levels within HelloWorld and client firms.</li>\n<li>Integrate with other functional teams to create cross-functional solutions that leverage data and insights.</li>\n<li>Influence stakeholders through effective storytelling with data, using clear visualizations, and other influencing tools, underscored by robust and defensible data analysis.</li>\n</ul>\n\nJob Specifications and Competencies\n\n\n<ul>\n<li>5+ years of industry experience solving business problems using quantitative analytical methods.</li>\n<li>Master's degree in a quantitative STEM field such as mathematics, sciences, operations research, engineering with an emphasis on scientific methodologies.</li>\n<li>Experienced and proficient querying, dimensioning and reducing both structured and unstructured data using SQL, Python, R, or related querying/scripting language or statistical software. Preference for experience with multiple tools.</li>\n<li>Experience with predictive modeling techniques and machine learning – K means clustering, logistic and linear regression, structural equation modeling,</li>\n<li>Strong experimental design skills, including an ability to construct and execute proper controls.</li>\n<li>Experience articulating business questions and using quantitative techniques to arrive at a solution using available data.</li>\n<li>Sophisticated and innovative application of quantitative methods to solve prediction and insights challenges, often with imperfect data,</li>\n<li>Demonstrated experience processing, exploring, transforming, analyzing, and presenting insights from large quantities (Millions to Billions of rows) of data</li>\n<li>Strong business knowledge; experience in loyalty, retention or catalog marketing preferred.</li> \n\n<li>Ability to translate business challenges into analytical solutions –, acknowledge and address confounds or uncertainties, and choose best methods in light of these challenges.</li>\n<li>Excellent verbal and written communication skills with an ability to communicate technical findings to a non-technical business audience.</li>\n<li>Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment.</li>\n</ul>\n\n</div>"}