{"job title": "Data Scientist", "company": "Helpshift", "city state": "– San Francisco", "rating": "3.8", "job description": "<div><div>Are you a data enthusiast with an emphasis on Machine Learning? Does playing with data, building models, deriving insights excite you? Do you pride yourself on extracting insights from unstructured data? If so, then Helpshift has an incredible opportunity for you! Helpshift is at the forefront of innovation in the customer service space and you’ll get to solve business critical problems using AI and ML.</div><div>You will be working in a fast-paced start-up where everyone is data savvy. Surrounded by talented people from different backgrounds and working with unique data; you will be challenged constantly. You will work closely with various teams, you will own the life cycle of a data science product - from conceptualization, research, development to production.</div> <div>This job helps you to challenge your analytical knowhow beyond classification, clustering, ranking and, regression.</div></div><div><div>About the job\n\n<ul>\n\n\n<ul>\n<li>We're looking for data scientists with deep expertise in statistics, machine learning, optimization, and/or building data products. Our process gives you full ownership over the projects you tackle, so you should be a person who dreams big, then executes well.</li></ul>\n</ul>\n\n</div>\n</div><div><div>About the work\n\n<ul>\n\n\n<ul>\n<li>You will drive data culture and evangelize use of data science in all possible aspects of business.</li><li>Research and development of bleeding edge ML algorithms/models.</li> <li>Discovering new applications of algorithms in Natural Language domain.</li><li>Iterative improvement of the currently deployed models.</li><li>Building ML/predictive framework to draw insights at scale for different aspects of business, for example understanding drivers of various customer behaviour or understanding points of failure.</li><li>Enhancing existing operations related modules including assignment of tickets to support agents, workflow automation, clustering, topic modeling, etc. with sophisticated ML algorithm</li></ul>\n</ul>\n\n</div>\n</div><div><div>About you\n\n<ul>\n\n\n<ul>\n<li>An ideal candidate should have strong depth and breadth of knowledge in different areas of machine learning, statistics as well as reasonable programming skills. Other desired skills and traits are:</li><li>Strong fundamentals in machine learning, general statistics and data science principles</li><li>Excellent problem solving skills, with an ability to communicate even complex ideas in clear manner</li><li>Strong work ethics like sense of collaboration and ownership, result orientation, being a team player</li><li>Proficiency in Java, Python, R or related tools used from data handling to modelling to deployment</li><li>Knowledge of statistical concepts related to data driven design like multivariate testing, DOEs</li><li>Good understanding of applying AI/ML techniques to complex business problems</li></ul>\n</ul>\n\n</div>\n</div><div><div>Must-Have\n\n<ul>\n\n\n<ul>\n<li>MS/M.Tech./M.E. in Computer Science, Engineering, Statistics, Operations Research or related field with research experience in machine learning</li> <li>Three years experience building machine learning or AI systems</li><li>Expert knowledge of probability and statistics, including experimental design, predictive modeling, optimization, and causal inference</li><li>Familiarity with machine learning concepts: regression and classification, clustering, feature selection, feature engineering, curse of dimensionality, bias-variance tradeoff, neural networks, SVMs, etc.</li><li>A strong sense of connecting technical work to product impacts</li><li>Expert knowledge of a statistical computing language such as R or Python/pandas</li><li>Excellent written and verbal technical communication skills</li><li>Familiarity with a scripting language and/or shell scripting</li></ul>\n</ul>\n\n</div>\n</div><div><div>Nice to have\n\n<ul>\n\n\n<ul>\n<li>Preferred: Ph.D. in Computer Science, Engineering, Statistics, or other relevant technical field</li><li>Preferred: Experience with large-scale distributed systems</li><li>Preferred: Experience with tools in the Hadoop ecosystem such as Hive, Pig, or Spark</li><li>Preferred: Knowledge of functional programming languages like Lisp, Haskell, Clojure</li><li>Practical understanding of Neural Networks</li><li>Past experience in Natural language processing</li></ul>\n</ul>\n\n</div>\n</div><div><div>Helpshift is a technology company that believes in making it easy for businesses to care for their customers, everywhere. Helpshift is used by 130 Million end users every month. Our SDK is installed on over 1.3 Billion devices worldwide. Founded in 2011 and headquartered in San Francisco, Helpshift has raised more than $38 million from True Ventures, Nexus Venture Partners, Visionnaire Ventures, Intel Capital, Cisco Investments, Salesforce Ventures, and Microsoft Ventures.</div> <br>\n<div>Helpshift embraces diversity. We are proud to be an equal opportunity workplace and do not discriminate on the basis of sex, race, color, age, sexual orientation, gender identity, religion, national origin, citizenship, marital status, veteran status, or disability status.</div> </div>"}