{"job title": "Business Intelligence Analyst", "company": "Hendrick Health System", "city state": "– Abilene, TX", "rating": "4.4", "job description": "<strong>Position Summary:</strong>\n<br><br>\nThe overall responsibility of the Business Intelligence Analyst is to maintain or update business intelligence tools, databases, dashboards, systems, or methods. This position works closely with other internal staff members as well as staff of the hospital. The successful candidate will be a self-starter with excellent communication skills.\n<br><br>\n<strong>Job Requirements:</strong>\n<br><br>\nMinimum Education:\n<ul>\n <li>High School or Equivalent</li> \n</ul>\nMinimum Work Experience:\n<ul>\n <li>5 Years</li> \n</ul>\n<strong>Required Skills,Knowledge, and Abilities:</strong>\n<ul>\n <li>Disseminate information regarding tools, reports, or metadata enhancements</li> <li>Conduct or coordinate tests to ensure that intelligence is consistent with defined needs</li> <li>Identify or monitor current and potential customers, using business intelligence tools</li> <li>Manage timely flow of business intelligence information to users</li> <li>Provide technical support for existing reports, dashboards, or other tools</li> <li>Maintain library of model documents, templates, or other reusable knowledge assets</li> <li>Assuring the integrity of project data, including data extraction, storage, manipulation, processing and analysis.</li>  <li>Collecting and collating appropriate data for usage in databases and conducting related research.</li>  <li>Discussing business intelligence needs or information with external clients and internal staff.</li>  <li>Responsible for administration, database design, security, and maintenance.</li>  <li>Coding accurately variables from original information or data and completing statistical analyses as required.</li> <li>Preparing and making presentations, monitoring and maintaining the quality nature of database systems.</li>  <li>Analyzing data with standard statistical methods, interpreting the results, and providing written summary of data analyses.</li> <li>Sharing the knowledge of analysis techniques and data coding with other staff.</li> <li>Working with scientists to design and develop statistical analyses, which address projected research questions.</li>  <li>Participating in ongoing decisions concerning data collections, study design, methodology, and data analysis</li> \n</ul>"}