{"job title": "Healthcare Data Analyst, Principal", "company": "Hennepin County, Minnesota", "city state": "– Minneapolis, MN", "rating": "3.4", "job description": "<div>\nDescription<br>\n<div>Can you boil down complex healthcare data analysis into a \"so what\" takeaway? As a Principal Healthcare Data Analyst, you will use data to strategically design presentations to influence a variety of audiences into action. The Hennepin Health Healthcare Data team provides analytics for finance, partner providers, clinical management, operations, network management, and marketing. Successful candidates are data-driven, and are able to combine their analytical and communication skills to interpret data for various stakeholders.\n<br><br>\n&nbsp;</div><div><strong>Location and hours:</strong> \n<br>\nThis position is located at the Grain Exchange building in downtown Minneapolis, 400 S 4th St Minneapolis, MN 55415,&nbsp;accessible by public transportation and light rail. This position may require some travel, mainly within the metropolitan area.\n<br><br>\n<strong>In this position, you will:</strong></div><strong>\n<br>\n</strong>\n\n<ul>\n\t<li>Develop and implement project plans for complex studies that bring solutions.\t</li><li>Extract and define relevant financial, clinical, quality, and operational data. Recognize when data does not seem accurate. Troubleshoot and fix data when not accurate.\t</li><li>Understand, analyze, and interpret data for customers who must make strategic, economic, or operational decisions.\t</li><li>Use various software applications, such as spreadsheets, relational databases, statistical packages, business intelligence software, and data visualization software to assemble, manipulate, and/or format data, graphs, and/or reports.\t</li><li>Summarize findings and recommended actions for the end audience.\t</li><li>Interpret data statistically to determine past financial or clinical performance and/or to predict a financial or clinical probability.\t</li><li>Develop financial reports and other tools for use at the department level for forecasting, trending, and results analysis.\t</li><li>Analyze and solve issues with legacy, current, and planned databases and data systems.</li>\n</ul>\n\n<strong>Need to have:</strong>\n<br>\nYou must have one of the following:\n\n<ul>\n\t<li>Ph.D. degree in business administration, public administration, research methods, statistics, behavioral/social science, public health, computer science/MIS, management science, urban/city planning, or a field appropriate to the area of specialization.\t</li><li>Master's degree in one of the fields listed above <strong>and</strong> two or more years of relevant experience in a healthcare setting.\t</li><li>Bachelor's degree in one of the fields listed above&nbsp;<strong>and</strong> three or more years of relevant experience in a healthcare setting.\t</li><li>Bachelor's degree in any field <strong>and</strong> a minimum of two courses in research methods, analysis, statistics, project management, planning or evaluation <strong>and</strong> four&nbsp;or more years&nbsp;of relevant experience in a healthcare setting.</li>\n</ul>\n\n<strong>Nice to have:</strong>\n<br>\n<strong></strong><ul><strong>\t</strong><li><strong>2 years or more of experience:</strong>\n\n<ul>\n <li>Using data to answer questions in a healthcare environment. </li><li>With data tools such as: SQL, SAS, R, or other statistical programs,&nbsp;Epic Caboodle, Power BI, Tableau, Qlikview, and/or Microsoft Excel. </li><li>Collecting, researching, analyzing, and presenting data.</li>\t\n</ul>\n\n</li><li>Knowledge of at least one of the following:\n\n<ul>\n <li>Population health. </li><li>Accountable care organizations. </li><li>Bundled payments. </li><li>Healthcare provider or payer operations. </li><li>Database design. </li><li>Risk adjustment. </li><li>Process improvement. </li><li>Healthcare claims.</li>\t\n</ul>\n\n<strong></strong></li><li><strong>Ability to:</strong>\n\n<ul>\n <li>Evaluate data, summarize, and make recommendations for change. </li><li>Develop and maintain effective working relationships with individuals in the public and private health and human services sectors. </li><li>Effectively communicate and present data analysis, research, and other issues to non-analyst audiences.</li>\t</ul></li>\n\n\n</ul>\n\n<strong></strong><div><strong>\nAbout the department:</strong>\n<br>\nHennepin Health is an award-winning, nationally recognized managed care organization that serves Hennepin County residents ages 0 to 64 who are eligible for Medical Assistance or Minnesota Care. Hennepin Health operates an accountable care model that brings together Hennepin Health, Hennepin Healthcare, Northpoint Health&nbsp;&amp; Wellness Center, and Hennepin County Human Services. Hennepin Health takes an integrative approach to health care by considering member's medical, behavioral health and social service needs, and connecting them with the services they need offered by Hennepin County and community resources.\n<br><br>\n<strong>About Hennepin County:</strong><br><br>Hennepin is the largest county government organization in Minnesota. Our employees work every day to improve the health, safety and quality of life for our residents and communities. All of our jobs align to one or more of our overarching goals -- that Hennepin County residents are healthy, protected and safe, self-reliant, assured due process, and mobile.\n<br><br>\nOur employees receive a combination of generous benefits and positive workplace culture not found at other organizations. This includes meaningful work that impacts our community, competitive pay, work-life balance, a variety of benefits and opportunities to grow. Learn more at www.hennepin.us/employees .\n<br><br>\nHennepin County envisions an organization where our commitment to diversity is fundamental in providing excellent service to our community.\n<br><br>\nYour future. Made here.\n<br><br>\nThis position is internally classified as a Planning Analyst, Principal.\n<br><br>\nClick here to view the job classification specification.</div><div>Invitations to interview will be based upon an assessment of education and experience. Final candidates&nbsp;will be required to complete a&nbsp;background check.\n<br>\n&nbsp;</div><div>&nbsp;</div></div>\n\n<br>"}