{"job title": "Data Scientist", "company": "Hershey", "city state": "– Hershey, Pennsylvania", "rating": "3.5", "job description": "<strong>Job Location: Hershey, PA</strong>\n<br><br>\nThe BI &amp; Analytics Enterprise Data Science team within Hershey Information Systems provides exciting opportunities to innovate in a fast-paced team that contributes to game-changing projects and transformational technologies. As a data scientist in the Enterprise Data Science team, you'll partner with technology and business partners to build new, machine-intelligent capabilities that impact the business. You will work with large volumes of data, innovative technologies and advanced methods to solve real-world problems. You'll design and run experiments, research new algorithms, and find new ways of optimizing risk, profitability, and customer experience.\n<br><br>\nApplicants should have a background in machine learning, statistical modeling, feature discovery/selection, optimization, exploratory data analysis, data mining and pattern recognition.\n<br><br>\n<strong>Primary responsibilities:</strong>\n\n<ul>\n\n <li>Interact with customers directly to understand the business problem, help and aid them in implementation of ML/DL algorithms to solve problems</li> \n\n<li>As part of a team, use machine learning, deep learning and other analytical techniques to create scalable solutions for business problems</li> \n\n<li>Demonstrate understanding of forecasting, optimization, statistical analysis and operations research. Extensive knowledge of forecasting techniques such as trend analysis, econometric models and machine learning is preferred</li> \n\n<li>Design, develop and evaluate highly innovative models for predictive learning, content ranking, and anomaly detection</li> \n\n<li>Analyze and extract relevant information from historical data to help automate and optimize key processes</li> \n\n<li>Work closely with technology, business and engineering teams to drive model implementations and adoption of new algorithms.</li>\n</ul>\n<strong>Experience:</strong>\n\n<ul>\n\n <li>+2 years of experience working with R &amp; Python</li> \n\n<li>+2 years of professional experience or relevant coursework/projects</li> \n\n<li>+2 years of relevant experience building large scale machine learning or deep learning models and/or systems</li> \n\n<li>+1 years of experience building, training, scoring, tuning and maintaining predictive models</li> \n\n<li>+1 years of experience with large-scale data storage processing architectures (Hadoop, HIVE, Spark/SparkR, etc.)</li> \n\n<li>Experience building models with frameworks like MXNet, TensorFlow, Caffe, TORCH, theano or similar a plus</li> \n\n<li>Experience with deep learning (e.g., CNN, RNN, LSTM) a plus</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n\n <li>Masters degree with STEM focus required, Ph.D. welcome to apply</li> \n\n<li>Strong working knowledge of deep learning, machine learning and statistics</li> \n\n<li>Familiarity with agile methodology</li> \n\n<li>Strong communication skills (written &amp; oral)</li> \n\n<li>Comfortable working in a fast paced, highly collaborative, dynamic work environment</li> \n\n<li>Strong attention to detail</li> \n\n<li>Ability to think creatively and solve problems</li> \n\n<li>Startup mindset &amp; innovative thinker</li>\n</ul>\nThe Hershey Company is an Equal Opportunity Employer. The policy of The Hershey Company is to extend opportunities to qualified applicants and employees on an equal basis regardless of an individual's race, color, gender, age, national origin, religion, citizenship status, marital status, sexual orientation, gender identity, transgender status, physical or mental disability, protected veteran status, genetic information, pregnancy, or any other categories protected by applicable federal, state or local laws.\n<br><br>\nThe Hershey Company is an Equal Opportunity Employer - Minority/Female/Disabled/Protected Veterans"}