{"job title": "Data Scientist", "company": "Hertz", "city state": "– US-FL-Estero", "rating": "2.6", "job description": "General Responsibilities<br><br>Hertz is seeking a passionate individual with extensive knowledge of statistics and a proven track record of its use in real-world problem-solving. This individual will possess strong knowledge of classical statistical modeling methods including general linear models and model diagnostics. Qualified candidates will also have knowledge of experimental design as well as the analysis and visualization of observational data. A familiarity with the principles of Machine Learning, Applied Predictive Modeling and time series modeling is strongly preferred.\n<br><br>\nThe candidate must be willing to work with business professionals who are not statistically proficient, and thus the ability to communicate highly technical material in a friendly, non-threatening manner is essential.\n<br><br>\nThe candidate must demonstrate a desire to create business value over all else, even when the competitor is statistical elegance. Conversely, the candidate must show continual improvement of theoretical and applied skills with evidence of a desire to continue technical learning and growth - both as a technician and a business professional.\n<br><br>\nExperience with R (or a comparable statistical programming language such as SAS, SPSS, or MATLAB) and SQL, as well as familiarity with the principles of software engineering (e.g., object-oriented programming, test-driven development, usage of revision control software, etc.) and languages such as Python and Java are strongly desired for this position.\n<br><br>\nJob Summary: Participates in all phases of analytic lifecycle. Analyzes trends and patterns in structured and unstructured data in support of business problem solving. Identifies and communicates meaningful insights and provides input to the project team. Will help align findings and insights to deliver business appropriate recommendations. May lead small projects. Committed to learning, development, skill maintenance, and personal improvement. Ad-hoc business analyses will occasionally be required, as will contributions to custom analytic software (e.g., model evaluation/selection/diagnostic techniques, design of experiment support, sampling designs, visualizations, and simulations).\n<br><br>\nJob Responsibilities\n\n<ul>\n\n <li>Responsible for creating, packaging, and communicating analytic work (synthesis) using appropriate medium for relevant insights, including impactful story line and applicable data visualizations.</li>\n<li>Responsible for effectively synthesizing own project work</li>\n<li>Participates in the delivery of analytic work that supports business objectives and priorities.</li>\n<li>Plans and manages execution of own work, participates in planning, and delivers on commitments</li>\n<li>Applies appropriate quantitative techniques and methods to solve business problems.</li>\n<li>Responsible for building analytic applications using statistical, database, and/or general programming languages and tools.</li>\n<li>Performs other duties as assigned.</li>\n</ul>\n\nMandatory Requirements<br><br>Education: Undergraduate studies with post graduate studies in a quantitative area of focus is required\n<br><br>\nKnowledge &amp; Experience: Typically three or more years of related experience with statistical software. Experience with problem solving in a business environment; working with large customer, retail or financial databases; working with product, geographic, demographic data to identify trends and opportunities. Experience with retail, financial services or related industry. Consulting experience, knowledgeable and experienced with the core functions of an organization (call center, billing, finance, sales, marketing, product, pricing, etc), experience with process design and continuous improvement. Ability to lead from behind is advantageous. Demonstrable evidence of self-learning is a must."}