{"job title": "Data Scientist", "company": "Hewlett Packard Enterprise", "city state": "– Houston, Texas", "rating": "3.5", "job description": "<p></p><p>Data scientists utilize their analytical, statistical, and programming skills to collect, analyze, and interpret large data sets.</p><p></p><p>Defines, manages, and evaluates business plans to ensure they are operationally executable against defined strategic objectives. Leads and partners with cross-functional teams to develop short-term (typically less than two years) business plans and supporting data-driven models. Prepares comprehensive implementation tactics, including execution plans, resource allocation plans, follow-up guidelines, assessment, and process accountabilities. Ensures that business activities are aligned with stated plans among different stakeholders. Sets business metrics, evaluates actual performance, and makes recommendations to business leaders on performance target achievement. Develops data-driven analyses to optimize resources and ensure that business plans can be translated into financial value.</p><p></p><p><u><b>Responsibilities:</b></u></p><ul><li>Leads complex data and business analyses to develop business plans, and identifies recommendations and insights.</li><li>Works independently to construct highly complex statistical and financial models to forecast business performance; coaches others on model development.</li><li>Establishes the metrics required to measure business performance, and develops the process for identifying and addressing performance gaps.</li><li>Manages complex, time- sensitive market research projects and prepares synthesized intelligence reports with clear implications.</li><li>Leads cross-functional teams across the entire span of business planning activities.</li><li>Contributes to priority projects by adding creative insights and developing recommendations.</li><li>Partners with business leaders to develop business plans and proactively identify new opportunities.</li><li>Develops go-forward business plan recommendations based on potential risks and returns.</li><li>Identifies cutting-edge analytical tools, models, and methods for making key business decisions.</li></ul><p></p><p><u><b>Education and Experience Required:</b></u></p><p><br>Requires 6 - 10 years work experience in strategy, planning, operations, finance, or related functional area. Advanced university degree (e.g., MBA) or demonstrable equivalent.</p><p></p><p><u><b>Knowledge and Skills:</b></u></p><ul><li>Extensive knowledge of research methodology for key business issues.</li><li>Excellent analytical thinking, technical analysis, and data manipulation skills.</li><li>Ability to leverage new analytical techniques to develop creative approaches to business analysis.</li><li>Extensive knowledge and understanding of how to analyze business problems using Excel, Access, statistical analysis, and financial modeling.</li><li>Strong business acumen and technical knowledge within area of responsibility.</li><li>Excellent verbal and written communication skills.</li><li>Very strong project management skills, including leading large, cross-functional initiatives.</li><li>Strong relationship management skills, including partnering and consulting.</li><li>Developed leadership skills, including team-building, conflict resolution, and management.</li><li>Ability to identify emerging trends from market and industry data.</li></ul><ul><li>Use this information to develop data-driven solutions to difficult business challenges.</li><li>Data scientists commonly have a bachelor's degree in statistics, math, computer science, or economics.</li><li>Data scientists have a wide range of technical competencies including: statistics and machine learning, coding languages, databases, machine learning, and reporting technologies</li><li>Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.</li><li>Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.</li><li>Assess the effectiveness and accuracy of new data sources and data gathering techniques.</li><li>Develop custom data models and algorithms to apply to data sets.</li><li>Use predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.</li><li>Develop company A/B testing framework and test model quality.</li><li>Coordinate with different functional teams to implement models and monitor outcomes.</li><li>Develop processes and tools to monitor and analyze model performance and data accuracy</li></ul><p>1029933</p>"}