{"job title": "Data Scientist Intern", "company": "Hewlett Packard Enterprise", "city state": "– San Jose, California", "rating": "3.5", "job description": "At Hewlett Packard Enterprise (HPE), we live by three core values that drive our business: Partner. Innovate. Act. These values combine to help us create important work all over the world to advance how people live and work.\n<br><br>\nLearning does not only happen through training. Relationships are among the most powerful ways for people to learn and grow, and this is part of our HPE culture. In addition to working alongside talented colleagues, you will have many opportunities to learn through coaching and stretch assignment opportunities. Youll be guided by feedback and support to accelerate your learning and maximize your knowledge. We also have a reverse mentoring program which allows us to share our knowledge and strengths across our multi-generation workforce.\n<br><br>\nThis is a 2019 summer intern position.\n<br><br>\nHewlett Packard Enterprise is seeking a highly motivated Data Scientist Intern to work in the San Jose, CA office.\n<br><br>\nResponsibilities:\n<ul>\n<li>Identify, analyze and interpret trends or pattern in complex data sets, including telemetry from storage arrays and other IT infrastructure components</li><li>Use advanced machine learning techniques to predict or alert in case of failures, and recommend actions that can mitigate or resolve them.</li><li>Automate data collection, pre-processing and/or analysis</li><li>Communicate findings clearly and succinctly to technical and non-technical audience</li>\n</ul>\nEducation/Experience:\n<ul>\n<li>Masters degree- working towards completion of PhD program in Computer Science or Computer Engineering.</li><li>R or scala programming, SQL experience</li>\n</ul>\nWe offer:\n<br><br>\n• Competitive salary and extensive social benefits\n<br><br>\n• Diverse and dynamic work environment\n<br><br>\n• Work-life balance and support for career development\n<br><br>\n• Want to know more about HPE? Then lets stay connected!\n<br><br>\nhttps://www.facebook.com/HPECareers\n<br><br>\nhttps://twitter.com/HPE_Careers\n<br><br>\nHPE is an EOE / Female / Minority / Individual with Disabilities / Protected Veteran Status\n<br><br>\n1032034"}