{"job title": "Data Scientist", "company": "HG Data", "city state": "– Santa Barbara, CA", "rating": "4.5", "job description": "<strong>Data Scientist</strong>\n<br><br>\nWe are looking for a data scientist with software development background. We are a rapidly growing company with small focused engineering teams that deliver innovative features to a fast growing market. We build big-data systems utilizing cutting edge technologies and solutions that allow for our engineers to continuously learn and develop while shipping amazing products.\n<br><br>\n<strong>Qualities/ Experience:</strong>\n\n<ul>\n<li>Self-learner, hacker, technology advocate who can work on anything</li>\n<li>Amazing engineering skills, youre on your way to being the one of the best engineers you know</li>\n<li>You can architect, design, code, test, and mentor others</li>\n<li>Experience working with interesting and successful projects</li>\n<li>Thrive in a fast growing environment</li>\n<li>Excellent written and spoken English communication</li>\n<li>An interest in Machine Learning and Natural Language Processing, as well as modeling</li>\n</ul>\n<strong>RESPONSIBILITIES:</strong>\n<br><br>\n<strong>Day to Day</strong>\n\n<ul>\n<li>Build predictive models and or solutions for areas including text classification, entity linking, entity extraction, insight generation, predictions and trends.</li> \n\n<li>You will collaborate with Product Development Teams to build the most effective solutions</li>\n<li>You will develop features in our databases, backend apps, front end UI, and Data as a Service (DAAS) product</li>\n<li>You will help architect and design large scale enterprise big-data systems</li>\n<li>You will work on ideas from different team members as well as your own</li>\n<li>Fix bugs rapidly</li>\n<li>Attend daily stand-up meetings, planning sessions, encourage others, and collaborate at a rapid pace</li>\n</ul>\n<strong>EXPERIENCE &amp; BACKGROUND:</strong>\n\n<ul>\n<li>BS, MS, or Ph.D. in Computer Science or related technical discipline</li>\n<li>Experience Natural Language Processing, preferably in a commercial setting. Machine Learning a plus.</li>\n<li>Proficient in Java (3+ years experience recommended)</li>\n<li>MySQL, ElasticSearch, ESB, Hadoop, Spark, or other related data processing/database technologies</li>\n<li>Experience with Amazon Web Services (EC2, S3, RDS, EMR, ELB, etc.)</li>\n<li>Experience with web services using REST in Java</li>\n<li>Actual coding experience in large distributed environments with multiple endpoints and complex interactions</li>\n<li>Comfortable in an agile development environment</li>\n<li>Understanding and have real world experience using design patterns</li>\n<li>Comfortable programming on a Mac with Intellij and other tools</li>\n</ul>\n<strong>HG DATA CULTURE:</strong>\n\n<ul>\n<li>We realize were people first. Weve had minimal turnover in the past four years with a high rating on Glassdoor</li>\n<li>This is a position with growth potential.</li>\n<li>You will not be isolated as an Engineer; HG Data is an open and transparent company.</li>\n<li>Your brain will be used, and your ideas will be implemented.</li>\n<li>Our compensation and benefits are excellent, better than many startups; stock options are part of the package, but not the only part.</li>\n<li>We offer a 401(k) match.</li>\n<li>HG Data Company is an Equal Opportunity Employer</li> \n</ul>"}