{"job title": "Senior Data Scientist", "company": "High Alpha", "city state": "– Indianapolis, IN", "rating": "NA", "job description": "High Alpha is an Indianapolis-based venture studio pioneering a new model for entrepreneurship that unites company building and venture capital. Throughout the venture lifecycle, High Alpha is involved in creating, operating and advising our studio companies, providing the critical infrastructure, talent, services and resources needed for them to innovate and scale quickly.\n<br><br>\nOur Data Science team works across the portfolio, servicing our companies by working together with leadership, product, and engineering teams to incorporate data science and machine learning capabilities into products and processes. This innovative approach allows us to work on numerous problems, in parallel, at different stages of implementation. If you are interested in working on fast-paced, complex problems then this the perfect position for you.\n<br><br>\nThe candidate will architect, build, and maintain data stores, ETL tools, and other analytical components. The majority of the research is done in Python so proficiency in the standard data science toolkit (numpy, pandas, scikit, etc) is required. The candidate will lead building, implementing, and supporting High Alpha's data science infrastructure, the candidate will also work on modeling, feature engineering, and analysis.\n<br><br>\n<strong>What We're Looking For:</strong>\n<br><br>\n<strong>Preferred Skills and Expertise</strong>\n\n<ul>\n<li>Experience in building machine learning infrastructure on AWS, Google Cloud, or Azure.</li>\n<li>Experience with big data technologies like Kubernetes, Spark, Hbase, Bigtable, Hadoop, MapReduce, Hive, Pig, MySQL, MongoDB, Cassandra, Spark, NoSQL, and SQL.</li>\n<li>Proficiency in Python (numpy, pandas, scipy, etc) required. Experience in web languages (Go, Ruby, Node, React, etc), R, Java or C++ considered beneficial.</li>\n<li>Experience with Scikit-learn, Tensorflow, or PyTorch is required.</li>\n<li>Strong understanding of object-oriented design and web technologies.</li>\n<li>Proficient understanding of code versioning tools, such as GIT.</li>\n<li>Experience in short release cycles, Agile/Scrum and TDD.</li>\n<li>Experience with deployment workflows and tools.</li>\n<li>Experience in developing and supporting large scale computational grids.</li>\n<li>Well-versed in different approaches to data architecture and applications, including traditional data warehousing concepts and data lakes.</li>\n<li>Experience building and maintaining ETL tools and building data pipelines.</li>\n<li>Practical understanding of statistics, predictive analytics, machine learning, and artificial intelligence algorithms.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Experience in data-driven cultures.</li>\n</ul>\n<strong>Preferred Education and Experience</strong>\n\n<ul>\n<li>Degree in Computer Science, Electrical Engineering, Data Science or related subject.</li>\n<li>4+ years in high-performance computing or machine learning environments preferred.</li>\n</ul>\n<strong>We dream big, move fast and expect more---so being flexible, adapting to change and having a sense of humor is required.</strong>\n<br><br>\n<strong>What we value :</strong>\n<br><br>\n<strong>Dreaming Big</strong>\n<br><br>\nWe constantly challenge ourselves to push boundaries, defy conventional wisdom, and take smart risks by pursuing big opportunities hiding in plain sight.\n<br><br>\n<strong>Moving Fast</strong>\n<br><br>\nWe push ourselves and portfolio companies to build processes and systems that compress time, speed, and decision-making to produce results faster.\n<br><br>\n<strong>Expecting More</strong>\n<br><br>\nWe demand the best from ourselves, our team, and our partners. We create the context for success by providing the appropriate resources, infrastructure, training, and mentorship required to win.\n<br><br>\nHigh Alpha is an equal opportunity employer, and we value diversity at our company. We don't discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}