{"job title": "Data Scientist - (Geospacial)", "company": "Highmark Health", "city state": "– Pittsburgh, PA", "rating": "3.0", "job description": "<b>Company :</b>Highmark Health<b>Job Description : </b><p><b>General Overview: </b><br>The Data Scientist uses geospatial analysis and visualization to support scientific research projects, peer-reviewed publications and internal R&amp;D projects at the heart of our Data Science/AI capabilities. The incumbent designs, executes and synthesizes point analytics to support specific business questions, programs or initiatives. The incumbent is a data-driven problem solver who understands and utilizes the Organization's business partner’s strategies, goals and processes to answer critical business questions by leveraging and synthesizing the large volume and variety of data available to them. Draws on tools and methods from statistics and machine learning to perform analysis, create predictive models, visualize data, and drive projects through to delivery of the intended outcome. Continuously scans and tests new data sources, tools, and analytical techniques and partners with leading institutions and experts to contribute to our portfolio of next-generation analytic projects.</p><p></p><p><b>Essential Job Functions:</b></p><ul><li>Work directly with the business to understand their questions, business processes, programs and/ or initiatives, then identifying how analytical solutions could help deliver value for them (e.g., more effective and/ or efficient processes). This would include being accountable for, outlining new use cases, creating high level impact estimates, and identifying the necessary data elements (including proxies) to deliver the analytical solution to complex business problems. Assemble data sets using knowledge of where the required data exists within the Organization's source data system, derived production sets or publicly available sources. Includes securing appropriate access and documenting objectives, assumptions and processes.</li><li>Select and apply the appropriate advanced modeling/machine learning techniques to these data sets to deliver business insight, ensuring that the final analysis is well researched, accurate, and documented. This requires technical flexibility, in-depth knowledge and delivery of advanced analytical approaches, for example regression models, tree-based learning, neural networks, clustering techniques, natural language processing.</li><li>Consult with the business to contextualize and translate the results of our analysis in a form which the business can understand and take action on. This will be include written reports, presentation and data visualizations, and draws clear lines between the high-level problem specifications, the analyses performed, and how the results link directly back to business objectives. It requires the incumbent to demonstrate their depth of understanding of many areas of the business, the data and the analytical methods through ongoing engagement with a range of audiences.</li><li>Plan, prepare and deliver/coordinate all elements of the analysis in such a way that it is delivered on time, to a high standard and ready to implement on a production basis (including dissemination through the Organization's user systems). This includes identifying the best route to implementation (developing the analytical solution accordingly).</li><li>Research self- directed new analytical skills and approaches, building relationships internally and externally to transfer knowledge and maintain their position as subject matter experts, consult with follow data scientists and analysts to guide analysis and deliver larger projects.</li><li>Other duties as assigned.</li></ul><p></p><p></p><p><b>Minimum Qualifications: </b></p><ul><li>Master's Degree in Analytics, Mathematics, Physics, Computer and Information Science or Engineering</li><li>3 - 5 years in Data Analytics</li><li>3 - 5 years using Large Datasets</li><li>3 - 5 years utilizing Statistical Software</li><li>3 - 5 years in Data Visualization</li><li>3 - 5 years in Predictive Modeling</li><li>1 - 3 years in Research and Development</li><li>1 - 3 years in a Business Analyst role</li><li>1 - 3 years in Consulting</li></ul><p></p><p><b>Preferred Qualifications: </b></p><ul><li>1 - 3 years utilizing GIS software or equivalent spatial analysis tool</li><li>1 - 3 years in Research and Development</li><li>1 - 3 years in the Healthcare Industry</li></ul><p></p><p><b>Knowledge, Skills &amp; Abilities:</b></p><ul><li>SAS, R, Python, SPSS or related</li><li>Analysis of business problems/needs</li><li>Analytical and Logical Reasoning/Thinking</li><li>Collaborative Problem Solving</li><li>Statistical Analysis</li><li>Written &amp; Oral Presentation Skills</li></ul><p></p><p><b>Referral Award Payout Level: 2</b></p><p></p><p>----------------------------------------------------------------------------------------</p><p>Highmark Health and its affiliates prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, national origin, sexual orientation/gender identity or any other category protected by applicable federal, state or local law. Highmark Health and its affiliates take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, sexual orientation/gender identity, protected veteran status or disability.</p><p></p>"}