{"job title": "Pharmacy Analytics Translator (Data Scientist)", "company": "Highmark Health", "city state": "– Pittsburgh, PA", "rating": "3.0", "job description": "<b>Company :</b>Highmark Inc<b>Job Description : </b><p>The Harvard Review describes the <b>Analytics Translator</b> as the new must-have role in an organization. MIT Sloan Management Review says that in many organizations, there is a consistent disconnect between data scientists and the executive decision makers – that’s why it’s time for a new role – the data translator.</p><p></p><p>Highmark Health’s Pharmacy Services Team has identified this exciting new role to play a critical role in bridging the technical expertise of data engineers and data scientists with the operational expertise of our Pharmacy frontline business staff.</p><p></p><p>The incumbent helps to ensure that the deep insights generated through sophisticated analytics translate into impact at scale in the Pharmacy organization. The incumbent draws on his or her domain knowledge to help Pharmacy business leaders identify and prioritize their business problems, based on which will create the highest value when solved.</p><p></p><p>These may be opportunities within a single line of business (e.g., improving client-facing reporting) or cross-organizational initiatives (e.g., creating integrated views of medical and pharmacy drug spend to identify areas of opportunity). In order to develop solutions to these problems, the incumbent will tap into their working knowledge of Artificial Intelligence and analytics to convey business goals to the data professionals who create the models and solutions, ensuring that the solution produces insights that the business can interpret and execute on, and, ultimately, communicates the benefits of these insights to business users to drive adoption.</p><p></p><p><b>ESSENTIAL RESPONSIBILITIES</b></p><ul><li>Support executive leadership in scoping and solutioning business needs by identifying and prioritizing problems suited for analytics and setting expectations for feasibility and impact to the business.</li><li>Develop project plans and deliverables for data and analytics teams to execute on to support the business and operation needs, acting as a translator to turn business operation and decision needs into analytic work plan.</li><li>Synthesizes complex analytics-derived insights into easy-to-understand, actionable recommendations for various levels of business needs, from individual sales staff to executive leadership.</li><li>Work with data scientist and matrixed partners to identify the business data needed to produce the most useful insights to the team ensuring that the solution solves the business problem in the most efficient and interpretable form for business users.</li><li>Provide leadership and project oversight to matrixed Analytics and Data team members.</li><li>Support various enterprise initiatives by working as part of matrixed teams with members having a wide variety of business expertise, skill sets, and priorities. Help to drive results from these teams through various modes of support.</li></ul><p></p><p><b>EDUCATION</b></p><p></p><p><b>Required</b></p><ul><li>Master's Degree in Mathematics, Engineering, Physics, Computer/Information Science, Decision Science, Health Information Systems, or related field</li></ul><p></p><p><b>Substitutions</b></p><ul><li>None</li></ul><p></p><p><b>Preferred</b></p><ul><li>Doctorate in Pharmacy, Mathematics, Engineering, Computer Information Systems, or related field</li></ul><p></p><p><b>EXPERIENCE</b></p><p></p><p><b>Required</b></p><p>3 years of experience in Data Science</p><p></p><p>And 3 years of experience in one or more of the following:</p><ul><li>Data Analytics</li><li>Using large data sets and data visualization</li><li>Utilizing statistical software and predictive modeling</li></ul><p></p><p>To include 1 year of experience in</p><ul><li>Research and development</li><li>Decision Support</li><li>Consulting</li><li>Healthcare</li></ul><p></p><p><b>Preferred</b></p><ul><li>3 years of Pharmacy experience</li></ul><p></p><p></p><p><b>SKILLS</b></p><ul><li>Python and/or R</li><li>Collaborative Problem Solving</li><li>Analytical and Logical Reasoning/Thinking</li><li>Analysis of business problems/needs</li><li>Structured problem solving</li><li>Interpretation of quantitative model results</li><li>Written &amp; Oral Presentation Skills</li><li>Experience with Spark and big data querying tools, such as Hive</li><li>Experience cleaning and transforming data</li><li>Experience with data and feature selection</li><li>Experience with Data Visualization and Dashboard tools such as Tableau, Spotfire, Qlikview, ggplot, Shiny</li><li>SAS</li><li>SQL</li></ul><p></p><p>Employee referral level: 2</p><p></p><p><b>Disclaimer:</b> The job description has been designed to indicate the general nature and essential duties and responsibilities of work performed by employees within this job title. It may not contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees to do this job.</p><p></p><p><b>Compliance Requirement:</b> This job adheres to the ethical and legal standards and behavioral expectations as set forth in the code of business conduct and company policies</p><p>----------------------------------------------------------------------------------------</p><p>Highmark Health and its affiliates prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, national origin, sexual orientation/gender identity or any other category protected by applicable federal, state or local law. Highmark Health and its affiliates take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, sexual orientation/gender identity, protected veteran status or disability.</p><p></p>"}