{"job title": "Data Scientist", "company": "Highway Toll Administration", "city state": "– US-NJ-Jersey City", "rating": "3.1", "job description": "Who we are...<br><br>Verra Mobility is a global leader in smart mobility. We develop technology-enabled solutions that help the world move safely and easily. We are fostering the development of safe cities, working with police departments and municipalities to install over 4,000 red-light, speed, and school bus stop arm safety cameras across North America. We are also creating smart roadways, serving the world's largest commercial fleets and rental car companies to manage tolling transactions and violations for over 8.5 million vehicles. And we are a leading provider of connected systems, processing nearly 165 million transactions each year across 50+ individual tolling authorities.<br><br>In a nutshell<br><br>The Data Scientist is responsible for applying advanced analytics to provide accurate, relevant, and actionable insights that enable us to make smarter decisions and deliver even better products and services to our customers. This role works closely with data scientists/analysts, engineers, product/project management and collaborates with other cross-functional teams to turn data into insights and turn insights into actions to help the business improve efficiencies and drive new opportunities.\n<br><br>\nThis position requires strong research and analytics skills, and ability to understand broad problem/decision context, frame the problem, and perform necessary research and analysis to draw relevant and insightful conclusions from often incomplete information.<br><br>This is the kind of stuff you'll do<br><br>• Research, gather, structure, and validate data and information from various sources, extend company’s data with third party sources when needed.• Aggregate, analyze data and information and create algorithms/models/applications to produce relevant and actionable insights.• Synthesize data, information, and knowledge to form conclusions and recommendations.• Communicate insights and findings to stakeholders through effective presentations, reports, dashboards, scorecards, and other visualization tools.• Research and develop machine learning, data mining and other analytics algorithms/applications.• Perform ad-hoc analysis and present results in a clear and concise manner.• Work closely with data architects/engineers to structure data for efficient, scalable, and reliable analysis.• Work closely with software engineering teams to implement algorithms/models/applications.<br><br>What we need in you<br><br>• Master’s Degree or Ph.D. in Computer Science, Applied Mathematics, Physics, or in another highly quantitative field.• 5+ years of experience developing analytics algorithms, models and applications using C/C++, C#, Python, or other programming language.• Knowledge of statistical analysis and machine learning algorithms and techniques, such as k-NN, Naive Bayes, SVM, Random Forests, neural networks, etc.• Experience with R, MatLab, Excel, SAS, or other common statistical analysis and computing tools.• Knowledge of relational databases and SQL query languages.• Strong critical thinking and problem-solving skills.• Strong verbal and written communication skills.• Strong organizational skills with the ability to manage multiple assignments and work autonomously in a fast-paced environment.• Detail oriented and have a hands-on, \"get it done\" attitude.\n<br><br>\nTS10\n<br><br>\nIND2\n<br><br>\n#Mon"}