{"job title": "Data Analyst", "company": "Hill-Rom", "city state": "– Cary, NC", "rating": "3.5", "job description": "ESSENTIAL DUTIES AND RESPONSIBILITIES: Other duties may be assigned:\n\n\n<ul>\n<li>Gathers, analyzes and reports accurate business and financial data that is critical to business decisions and utilizes critical thinking skills to interpret the data.</li>\n<li>Help to accelerate project related revenue through data forecasting, PMO metrics, and aid in room-by-room conversion tracking.</li>\n<li>Provide administrative support to the PMO in gathering information, documentation, and certifications by partnering with field-based project management team members to understand current project status against project plan</li>\n<li>Provide enhanced visibility to the revenue backlog, as well as develop a method to achieve four-quarter revenue forecasting while maintaining compliance with ASC606 requirements.</li>\n<li>Demonstrates excellent communication skills with daily collaboration and interaction with field service personnel, project management, all levels of service leadership, and quality assurance and regulatory affairs to complete required tasks.</li>\n<li>Assists in continuous improvement projects, training and/or initiatives that drive business/financial results.</li>\n<li>Coordinates documentation and facilitates communications regarding the required documentation of pending, in progress and completed installations of Clinical Workflow Solutions product systems.</li>\n<li>Collects and reviews Device History Records for accuracy and completeness prior to submission to document control in accordance with FDA acceptance activities standards.</li>\n</ul>\n\n<strong>EDUCATION, EXPERIENCE AND QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Demonstrated proficiency with MS Office (Word, Excel, PowerPoint)</li>\n<li>Must be able to perform each essential duty satisfactorily</li>\n<li>Ability to communicate effectively and clearly to a wide-range of customers</li>\n<li>Ability to define problems, identify solutions and follow through to completion</li>\n<li>Bachelor's degree in Business Administration, Management, or Finance required</li>\n<li>1-3 years of experience</li>\n<li>Experience with MS Project, MS CRM, Salesforce, PowerBI, SQL, and JD Edwards preferred</li>\n</ul>"}