{"job title": "Senior Machine Learning Engineer", "company": "Hired", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "We're on a mission to help get everyone a job they love. Find the job you love here at Hired!\n<br><br>\n<strong>ABOUT US:</strong>\n<br><br>\nAt Hired we believe we are entering a new era of work, where people are not looking for jobs they are seeking opportunities. Focusing on in-demand technology roles, we intelligently match outstanding people to full-time and freelance opportunities at the world's most innovative companies. By taking the pain out of the job search, we help people build purpose-driven careers and businesses find the talent to fulfill their missions. Ultimately, we want to empower everyone to find and do their best work, from one opportunity to the next.\n<br><br>\nHired is headquartered in San Francisco, with offices in cities across North America and Europe, with plans to expand into new geographies, industries and job categories. For more information, news and tips for candidates and employers, visit Hireds blog.\n<br><br>\n<strong>ABOUT THE ROLE:</strong>\n<br><br>\nHired is looking for a Senior Machine Learning Engineer to join our Data Science and Relevance team to build new products using machine learning algorithms.\n<br><br>\n<strong>WHAT WE NEED YOUR HELP WITH:</strong>\n\n<ul>\n<li>Define key metrics for data science team that have a direct impact on high level business metrics</li>\n<li>Use statistics tools to analyze data to understand and model the relationships between different metrics and identify key insights</li>\n<li>Generate innovative new features using external and internal data sources to enhance the recommendation engine and other data science products</li>\n<li>Strong understanding of all the data in the company and champion data collection from all sources</li>\n<li>Collaborate with Product Managers, Business teams to identify opportunities to build data science products</li>\n<li>Consult with other engineers to help them run and analyze A/B tests effectively</li>\n<li>Have strong understanding of product, business, key KPIs across product and business</li>\n<li>Work with leadership to identify key new product initiatives to drive growth</li>\n</ul>\n<strong>WHAT WE LOOK FOR:</strong>\n\n<ul>\n<li>5+ years of experience building products using data science and machine learning algorithms</li>\n<li>Expert level knowledge in SQL and at least one of the advanced stats tools</li>\n<li>Strong experience in programming languages like Python, Java or similar languages</li>\n<li>Strong experience in statistics, machine learning models and mathematical theory</li>\n<li>Passion for learning new technologies fast</li>\n<li>MS or PhD in Computer Science or related field</li>\n</ul>\n<strong>COMP, BENEFITS, &amp; PERKS:</strong>\n\n<ul>\n<li>Competitive compensation &amp; equity options</li>\n<li>Open vacation &amp; sick time</li>\n<li>Flexible work hours</li>\n<li>Employer paid health insurance, vision, and dental</li>\n<li>401(k)</li>\n<li>Pre-tax commuter benefit</li>\n<li>Gym reimbursement</li>\n<li>Weekly educational classes &amp; catered lunch</li>\n<li>Monthly team events</li>\n<li>Stocked kitchen &amp; beverages</li>\n<li>Cell phone reimbursement</li>\n</ul>\nWe believe that when we can bring our whole selves to work on a day-to-day basis we become happier, more comfortable, more confident and more excited to do great things for our company, each other, our product and our users. Hired aims to both build an internal team as well as help our clients build their teams with talent from all different backgrounds and lifestyles.\n<br><br>\nHired is committed to building a diverse, equitable and inclusive workforce. Hired is an equal opportunity employer; we welcome and consider qualified applicants regardless of gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences. Members of communities historically underrepresented in tech are encouraged to apply.\n<br><br>\nFor San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider qualified applicants with arrest and conviction records for employment."}