{"job title": "Business Intelligence Analyst", "company": "Holland America Line Careers", "city state": "– Seattle, WA", "rating": "NA", "job description": "Business Intelligence Analyst\n<br><br>\nSeattle, WA\n<br><br>\nWe are committed to our mission: Through excellence, we create once-in-a-lifetime experiences, every time.\n<br><br>\nWe welcome your interest in joining the Holland America Group - a division of Carnival Corp. The Holland America Group includes Holland America Line and Seabourn (both headquartered in Seattle, Washington), Princess Cruise Lines (headquartered in Santa Clarita, California), and P&amp;O Australia (headquartered in Sydney). The Holland America Group operates a combined total of 41 cruise ships with over 36,000 employees worldwide. This position will be located in our Seattle offices.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nThe Business Intelligence Analyst will produce and analyze business intelligence data sets by querying data repositories and generating periodic reports. Devise methods for identifying data patterns and trends in available information sources to derive business insights and communicate results to management and other team members. Will work closely with internal customers to define and prioritize reporting and analysis requirements, as well as partnering with IT to build and improve BI solutions.\n\n\n<ul>\n<li>Synthesize current business intelligence or trend data to support recommendations for action.</li>\n<li>Conducts research and analysis to support management decision making.</li>\n<li>Analyze accident and incident information to create trend or performance reports.</li>\n<li>Communicate with internal customers to gather and understand requirements.</li>\n<li>Visualization of data using tools such as Oracle BI and Excel.</li>\n<li>Work with departmental customers to gather data and reports for monthly Objectives &amp; Targets report.</li>\n<li>Document specifications for business intelligence or information technology (IT) reports, dashboards, or other outputs.</li>\n<li>Generate standard or custom reports summarizing business or financial data for review by executives, managers, and other stakeholders.</li>\n<li>Work with Ethics department to provide quarterly data for Corporate Sustainability Report.</li>\n<li>Identify new analytical and detail reporting solutions or modification/improvements to existing reporting.</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>BS in Statistics, Economics, information science or the equivalent combination of education and experience; advanced degree is a plus</li>\n<li>4+ years experience in similar role</li>\n<li>Ability to use complex computer programs</li>\n<li>Advanced analytic skills required</li>\n<li>Communicate with both technical and non-technical team members</li>\n<li>Ability to manage a back-log, establish priorities, multi-task and work proactively and independently</li>\n<li>Must be very detail-oriented and requires a high level of accuracy</li>\n<li>Must have excellent problem-solving and collaboration skills</li>\n</ul>\n\n<strong>Benefits:</strong>\n\n\n<ul>\n<li>Flexible Work Schedule! 9/80 alternative workweek schedule option providing each employee with one (1) weekday off every two weeks.</li>\n<li>Time off benefits - 8 paid holidays, paid vacation and paid sick time</li>\n<li>Travel Generous Cruise and Travel Privileges for you and your family</li>\n<li>Health - Complete benefit plans including medical, dental, vision and flexible spending accounts</li>\n<li>Wellness - Health and wellness programs include discounted health benefits and memberships</li>\n<li>Tuition Reimbursement - Up to 80% with a maximum of $3000 per fiscal year</li>\n<li>401(k) - Company match of 33% on employees first 6% contribution with 100% vesting after 4 years of service</li>\n<li>Profit Sharing Plan- Eligible after 1 year of service</li>\n<li>Employee Stock Purchase Plan Discount on Carnival Corporation stock</li>\n<li>Training - In-house Discover University courses on professional development</li>\n<li>Rewards &amp; Incentives - Employee Recognition and Reward Programs; rideshare, financial commuter incentives; special employee discounts for local venues, banking services and retail stores</li>\n</ul>\n\nNext StepsFor more than 140 years, Holland America Line has been a recognized leader in cruising, taking our guests to exotic destinations around the world. Apply today and set sail on an exciting new career course! Our application process is quick and easy, be sure to login to our Talent Center and create a profile and then apply directly to your specific job.\n<br><br>\nHolland America Line is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin, disability or protected veteran status."}