{"job title": "Data Scientist", "company": "Hometap", "city state": "– Boston, MA", "rating": "NA", "job description": "<strong>Who We Are</strong>\n<br><br>\nAt Hometap, we believe you can have a house and a life. In fact, for many, having a house is the key to having a life. By tapping into the built-in value of a home, we help homeowners do the big-ticket stuff that makes life better: Start a business or buy a second home without taking out additional debt to pay for it. Get out from under crippling debt without ruining credit. And when it comes to college tuition, parents can help their children secure their future without sacrificing their own.\n<br><br>\nHometap makes investments in residential homes, buying a small equity stake against the homes future value. For homeowners, this is a simplified, sensible alternative to mortgage debt and monthly payments. For investors, this is a new asset class, allowing them to participate in the multi-trillion-dollar residential real estate market without the obligations and downsides of homeownership.\n<br><br>\n<strong>Who You Are</strong>\n<br><br>\nData drives you. You are motivated by having a significant impact on the company and creating differentiated solutions within this brand-new industry. You are comfortable exploring and working your way through ambiguity. You value collaborating with a team of researchers who encourage your success.\n<br><br>\n<strong>What Were Looking For</strong>\n<br><br>\nHomeTap is seeking a Data Scientist to join us at the ground level to build a world class data and analytics platform. This driven data scientist will have the opportunity to work with our experienced Leadership team to build the data platform from the ground floor. We are at the forefront of a brand new, multi-trillion dollar industry, and use large-scale data analysis to help homeowners unlock their equity. This role will have significant impact developing the algorithms necessary to accurately value home prices, forecast home value appreciation and help drive investment decision-making.\n<br><br>\n<strong>What You Bring</strong>\n\n<ul>\n<li>Bachelors or Masters degree in computer science, data science, information technology, economics, statistics, the hard sciences, or related fields.</li>\n<li>3+ years experience in several of the following:</li>\n<li>Python Data Science analyst package such as NumPy, scikit-learn, Pandas, XGBoost, etc.</li>\n<li>Processing frameworks such as Spark, or similar</li>\n<li>Significant experience building models, algorithms and data structures for machine learning</li>\n<li>Statistical analysis methodologies</li>\n<li>Ideally, visualization experience with packages such as matplotlib, plot.ly, &amp; Tableau</li>\n<li>SQL and NoSQL databases such as MySQL, Snowflake, et al.</li>\n<li>Source code management experience with Git, et al.</li>\n<li>Demonstrable ability to analyze large data sets and provide compelling insights to technical and non-technical people</li>\n</ul>\n<strong>Our Team &amp; Culture</strong>\n<br><br>\nAt Hometap, the Data Science team is the research and development department of the company. We build industry leading solutions which create significant competitive advantage for the company. Some of the problems we face have very amorphous scopes and require the team to embrace an experimentation and cooperation mindset. As such we rely on each others varying expertise to scope the problem into manageable, tractable, goals. Collaboration is a central tenet of the group, we plan together, execute independently and share with each other throughout the project. Therefore we value openness, transparency and accept the best idea, wherever it originates from.\n<br><br>\nEqually important to the candidates skill-sets is the candidates fit within our business. We are looking for someone who is entrepreneurial, fast paced, data-driven, a creative thinker who looks for opportunities within challenges, has a competitive drive to win and values collaboration.\n<br><br>\nLocal candidates only please no relocation is available for this position.\n<br><br>\nNo Visa sponsorship available at this time."}