{"job title": "Automotive Data Analyst", "company": "Homes.com", "city state": "– Beverly", "rating": "4.2", "job description": "Description\n<br>\n <div>\n<em>Position at Dominion Dealer Solutions</em></div><br>\n\n <div><div>Automotive Data Analyst\n<br><br>\nFor over a decade DataOne Software has been creating innovative data and software products that are utilized across the automotive industry. Our solutions are used to market, sell, manage inventory, and service millions of vehicles throughout North America. We like to think of our corporate culture as offering the best of both worlds, with the positive, can-do approach of a profitable, fast growing business combined with the backing and security of a large corporate presence. We take pride in maintaining a dynamic and collaborative work environment where employees can thrive, impact our business and realize their potential.\n<br><br>\nJob Description:\n<br><br>\nOverview: The Data Analyst position is responsible for acquiring automotive data, analyzing it and entering it into a proprietary set of internal tools with an exceptional attention to detail and a very low error rate.\n<br><br>\nAdditional details below:\n<ul>\n<li>Primary function will be to obtain, compile, analyze, interpret, research and enter for presentation all ordering, pricing, and technical information needed by DataOne Software from the Automotive Industry.</li> <li>Successful Analysts will acquire a high level of knowledge and expertise of the variations and unique attributes of automotive vehicles and their manufacturers.</li><li>Data Analysts must apply this expertise, as well as keep track of numerous details, in order to correctly capture the necessary automotive data within our normalized data hierarchy</li><li>Each Data Analyst is ultimately responsible for DataOne standards of 100% accuracy in the data incorporated into our products.</li><li>As a member of our Automotive Data Team, Data Analysts are responsible to help the team achieve established goals, as well as completing individual responsibilities in a timely manner.</li><li>Data Analysts will be assigned special projects commensurate with their abilities, experience and skill level.</li> <li>Analysts will be required to work with Customer Support to investigate and resolve customer reports of error that are related to their work or responsibilities.</li>\n</ul>\nThe position activity breaks down into roughly the following general activities:\n<ul>\n<li>15% data acquisition</li><li>10% special projects</li><li>40% data analysis</li><li>35% data entry</li>\n</ul>\nRequired Skills:\n<br><br>\nUpon Hire\n<ul>\n<li>Strong research, analytical, math, and logic abilities are necessary to be successful</li><li>Strong computer skills, OR strong knowledge of and experience with the automotive industry/data</li><li>Very high accuracy and attention to details required and must be demonstrated in decision making and entry of information.</li><li>Typing speed of 30+ accurate words per minute</li><li>Proficient with Gmail, Google Docs, Microsoft Word and Excel.</li>\n</ul>\nAcquired post hire\n<ul>\n<li>Excellent understanding of the Automotive industry including</li><li> Automotive brands, manufacturers, technology/equipment, vehicle types, market segments, specifications.</li>\n</ul>\nEducation/Experience\n<ul>\n<li>High School degree is mandatory. Associates degree or higher desired.</li><li>1-3 years of experience in the data entry field to acquire skills necessary to coordinate and perform a variety of data entry and data collection activities.</li>\n</ul>\nRequired Attributes\n<ul>\n<li>Positive approach</li><li>Creative problem solver</li><li>Accurate and detail oriented</li><li>Focused</li><li>Motivated</li><li>Professional</li><li>Team player</li><li>Good time management</li>\n</ul>\nSummary\n<br><br>\nDominion Enterprises is a leading online marketing and software services company offering client solutions across multiple targeted business verticals. Our iconic B2C web and mobile portals, including ForRent.com, Homes.com, CycleTrader.com and BoatTrader.com, generate nearly 30 million unique visits monthly. Our B2B cloud SaaS solutions directly support clients in establishing their online and mobile brands, generating leads, and managing customer relationships. We have more than 40 businesses and 3,000 employees in our Norfolk, Va. home office, across the U.S., and internationally. See our complete story at www.dominionenterprises.com. We offer a dynamic environment, excellent growth opportunities, competitive earnings and a comprehensive benefits package that includes a generous 401(k). Dominion Enterprises is an equal opportunity employer and supports a diverse workforce. Dominion is a drug-testing employer.\n<br><br>\nIf you have the skills and are looking for a challenging growth opportunity, email cover letter with resume &amp; salary history to:\n<br><br>\njobs@dataonesoftware.com\n<br><br>\nDataOne Software\n<br><br>\n100 Cummings Center\n<br><br>\nSuite 251C\n<br><br>\nBeverly, MA 01915\n<br><br>\nFax: 978-522-8434\n<br><br>\nPhone: 978-927-8385</div></div>\n<br>"}