{"job title": "Item Data Analyst", "company": "Home Depot", "city state": "– Atlanta GA 30308", "rating": "3.5", "job description": "<div>Position Description:\n \n <br>\n \n <strong><strong>Position Purpose:</strong><br> <br> </strong>At HomeDepot.com, our award-winning e-Commerce team is blazing a trail of retail shopping innovation by leveraging cutting-edge technology with our 2,200+ store locations and a relentless focus on customer service. We have been named one of the world's most innovative companies and we are on a mission to provide the best interconnected shopping experience to our consumers. To do so, we need more dreamers, innovators and big thinkers passionate about re-imagining the future of retail. Interested in making history with us? If so, apply today to experience what it’s like to be a part of our HomeDepot.com team. Who knows? Your next big idea may just change the future of retail!<strong><br> </strong><br><p>The Item Data Analyst, Data Governance is part of an enterprise Product/Item Data Governance team, which is responsible for designing the product taxonomy, defining product attributes, and ensuring data quality and data integrity for product data at The Home Depot. The Item Data Analyst will support Sr. Analysts on projects to optimize product attributes or the overall product taxonomy. The Item Data Analyst will also field ad-hoc requests from across the enterprise for changes necessary to support various business functions. The Analyst will be responsible for conducting competitive/industry research, building product knowledge in assigned categories, and planning/executing changes to product attributes and the product taxonomy. </p><strong><br> </strong><strong>Major Tasks, Responsibilities, and Key Accountabilities:</strong><br><ul><li>25% Provides subject matter expertise for assigned product/functional area. Addresses IDM data collection &amp; data quality issues, documentation, system training needs &amp; questions for both internal &amp; external customers. Develops &amp; maintains day-to-day relationships with internal &amp; external partners to support IDM data initiatives.</li><li>20% Works with IDM Managers/leadership to prioritize department projects and deliverables. Implements IDM data projects and provides status updates. Keeps projects on-task and within expectations of project time lines. Ensures deliverables and goals for area of responsibility are met or exceeded.</li><li>15% Measures ongoing effectiveness of programs against metric targets. Develops and executes ongoing enhancement/optimization strategy based on measured performance and customer feedback.</li><li>15% Trouble shoots and problem solves for ongoing operational needs as they arise, i.e. data quality collection initiatives and/or clean up, vendor system error troubleshooting and gathering of system enhancement requirements. Identifies legal requirements associated with assigned product functional area.</li><li>15% Authors and facilitates clear, concise end user/training on IDM processes, system features and enhancements.</li><li>10% Coordinates integrated teams from one or more external agencies or functional organizations in support of managed initiatives. Reports on best practices and industry standards.</li></ul><strong><br> Nature &amp; Scope</strong><br><ul><li>Position reports to Manager, IDM</li><li>No direct reports</li></ul><strong><br></strong><strong>Environment: </strong><br><ul><li>Typically located in a comfortable indoor area. There may be regular exposure to mild physical discomfort from factors such as dust, fumes or odors, temperature extremes, loud noise, strong drafts, or bright lights.</li></ul><strong>Travel: </strong><br><ul><li>Typically requires overnight travel less than 10% of the time.</li></ul><strong></strong>\n \n <p></p>\n <br>\n <p>\n\n\n \n\n\n \n \n \n \n\n ESSENTIAL SKILLS:\n \n <br>\n \n <strong>Minimum Qualifications</strong><br></p><ul><li>Must be eighteen years of age or older.</li><li>Must be legally permitted to work in the United States.</li></ul><strong></strong><br> <strong>Education Required:</strong><br><ul><li>The knowledge, skills and abilities typically acquired through the completion of a bachelor's degree program or equivalent degree in a field of study related to the job.</li></ul><strong><br> Years of Relevant Work Experience: </strong>1 years<br> <strong><br> Physical Requirements:</strong><br><ul><li>Most of the time is spent sitting in a comfortable position and there is frequent opportunity to move about. On rare occasions there may be a need to move or lift light articles.</li></ul><strong></strong><br> <strong>Preferred Qualifications:</strong><br><ul><li>1-2 years of data analysis experience</li><li>Experience working with large data sets</li><li>Ability to handle and prioritize multiple tasks </li><li>Ability to communicate complex concepts in simplistic terms</li><li>Prior experience in Ecommerce, Retail, or data management preferred</li><li>Proficient with Microsoft Excel</li><li>SQL exposure preferred</li><li>Strong interpersonal and communication skills</li><li>Excellent project and time management skills</li><li>Effective interpersonal and problem solving skills</li></ul><br> <strong>Knowledge, Skills, Abilities and Competencies:<br> </strong><ul><li>Strong decision making and problem solving skills. </li></ul><ul><li>Proficiency in Microsoft Excel and Access. </li><li>Ability to lead and manage cross functionally. </li><li>Strong organizational, analytical and customer service skills. </li><li>Independent and self-directed yet also team oriented. </li><li>Influential; practiced in negotiating with others in ways that result in mutually beneficial outcomes. </li></ul><ul><li>Positive, solutions oriented and professional attitude and approach to work.</li></ul><strong></strong>\n \n <p></p>\n <br>\n\n <p>\n \nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. \n </p>\n </div>"}