{"job title": "Data Scientist II: Yield Optimization", "company": "HomeAway", "city state": "– Austin, TX, United States", "rating": "3.7", "job description": "HomeAway, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands.\n<br><br>\n<strong>Opportunity:</strong>\n<br><br>\nWe are looking for excellent Data Scientists to join our growing 20+ strong team. This position focuses on yield optimization and dynamic pricing, so it is a good fit for those with backgrounds such as operations research, economics and applied mathematics. This role will work closely with our marketplace design team to help boost efficiency and profitability on our massive e-commerce marketplace. The statistical learning algorithms you develop will affect billions of dollars of transactions every year.\n<br><br>\n<strong>Challenges To Work On:</strong>\n<ul>\n<li>Understand supply and demand based on rich features sets that very across space and time</li><li>Modifying ranking algorithms to support a healthy marketplace with dynamic commissions</li><li>Model demand curves in a high-dimensional space using modern techniques such as deep learning</li><li>Develop mechanisms to dynamically trigger supply</li> <li>Optimal pricing</li> <li>Spacial modeling of supply value</li>\n</ul>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Work on larger programs/initiatives encompassing several projects that have a company-wide impact</li><li>Apply best-in-class machine learning techniques to solve the business problem at hand</li><li>Produce novel insights with machine learning to inform company strategy</li><li>Assist others with data discovery and data preparation phase</li><li>Help build the core feedback loops and incentive structures in our marketplace</li><li>Work end-to-end on studio projects that you conceive, develop and land as a winner in the company</li><li>Attend conferences and read papers to stay on top of advancements in the field</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Experience with programming languages such as R, Python, or Scala</li><li>Experience in processing and analyzing large scale data volumes, semi-structured and unstructured data and near real-time throughput</li><li>Experience applying the right ML model to solve business problems</li><li>Ability and passion to learn new techniques to stay on the cutting edge</li><li>Experience working in Hadoop ecosystem</li><li>Strong database knowledge and expertise in SQL</li><li>Experience using visualization tools such as Tableau and Datameer</li><li>Good storytelling and presentation skills i.e be able to present business side of the story that data presents to c-team and business leaders</li><li>Masters or Ph.D in Statistics, Operations Research, Math, Computer Science or other quantitative field</li>\n</ul>\n<strong>Benefits &amp; Perks:</strong>\n<ul>\n<li>Competitive health and insurance benefits.</li><li>Competitive salary.</li><li>Annual target bonus or commission.</li><li>Paid vacation and sick time.</li><li>Vacation rental on a yearly basis (taxable benefit).</li><li>Employee Stock Purchase Program.</li><li>Free snacks and beverages.</li><li>Frequent company update talks with our leadership team.</li><li>Free listing on HomeAway.com.</li><li>Electronic, adjustable stand-up desk.</li><li>Discounted Metro &amp; Rail pass.</li><li>Casual dress.</li>\n</ul>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}