{"job title": "Data Scientist ll", "company": "HomeAway", "city state": "– Austin, TX, United States", "rating": "3.7", "job description": "<strong>About us:</strong>\n<br><br>\nHomeAway, based in Austin, Texas, is the world leader in vacation rentals with more than 2 million unique places to stay in 190 countries, and is a part of the Expedia, Inc. family of brands.\n<br><br>\nHomeAway offers an extensive selection of vacation rental homes that provide travelers with memorable experiences and benefits, especially more room to relax, for less than the cost of traditional hotel accommodations. The company also makes it easy for vacation rental owners and property managers to advertise their properties and manage bookings online.\n<br><br>\nWe are looking for excellent Data Scientists to join our growing 20+ strong team. This position focuses on the measurement and optimization of our search relevance and ranking algorithms, so it is a good fit for those with backgrounds in information retrieval, recommender systems, economics and learning to rank. This role will work closely with our ranking development team to improve conversion originating from traveler searches. The statistical learning algorithms you develop will impact tens of millions of traveler searches a year.&lt;\n<br><br>\n<strong>Challenges to work on:</strong>\n<ul>\n<li> Modifying ranking algorithms to support a healthy marketplace with dynamic commissions.</li> <li>Create models to understand traveler preferences with respect to price, geography, traveler preferences, images, and amenities</li><li>Spatial modeling of supply value</li>\n</ul>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Work on larger programs/initiatives encompassing several projects that have a company-wide impact</li> <li>Apply best-in-class machine learning techniques to solve the business problem at hand</li> <li>Produce novel insights with machine learning to inform company strategy</li> <li>Assist others with data discovery and data preparation phase</li> <li>Help build the core feedback loops and incentive structures in our marketplace.</li> <li>Attend conferences and read papers to stay on top of advancements in the field</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>2+ years of experience in Data Science and analytics fields</li> <li>Experience with programming languages such as R, Python, or Scala</li> <li>Experience in processing and analyzing large scale data volumes, semi-structured and unstructured data and near real-time throughput</li> <li> Experience applying the right ML model to solve business problems</li> <li>Ability and passion to learn new techniques to stay on the cutting edge.</li> <li>Experience working in the AWS and Hadoop ecosystems</li><li>Strong database knowledge and expertise in SQL</li> <li>Good storytelling and presentation skills i.e be able to present business side of the story that data presents to c-team and business leaders</li> <li>Masters or Ph.D in Statistics, Math, Computer Science, Economics or other quantitative field</li>\n</ul>\n<strong>Benefits:</strong>\n<ul>\n<li>Competitive health and insurance benefits.</li><li>Competitive salary.</li><li>Annual target bonus or commission.</li><li>Paid vacation and sick time.</li>\t<li>Vacation rental on a yearly basis (taxable benefit).</li><li>Employee Stock Purchase Program.</li><li>Free snacks and beverages.</li><li>Frequent company update talks with our leadership team.</li><li>Free listing on HomeAway.com</li><li>Electronic, adjustable stand-up desk.</li><li>Discounted Metro &amp; Rail pass.</li>\n</ul>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}