{"job title": "Scientist, Bioinformatics", "company": "Homology Medicines", "city state": "– Bedford, MA", "rating": "NA", "job description": "<p>Scientist, Bioinformatics</p>\n<p>Location: Bedford, MA <br> Job Code: MGBS 0017-18 </p>\n<p><strong>Job Summary</strong></p>\n<p>We are seeking highly motivated individual with a diverse background to join our bioinformatics team. This person will have a strong understanding of gene sequence data and ability to design gene edits that improve genes, pathways and cellular functions with in rare disease indications. It is essential that this individual have the ability to incorporate cutting edge bioinformatics technologies, data management and genomic analysis tools. This role is focused on target discovery and validation of rare disease indications as well as contribute to strategy development and planning, implementation of infrastructure, tool development and execution of individual projects.<br> <br></p>\n<p>Solid scientific training in one of the relevant disciplines and delivery oriented mindset with a focus on real world impact. The candidate should also be a quick learner, extremely flexible and able to adapt to needs and new scientific advancements.</p>\n<p> </p>\n<p><strong>Essential Functions and Duties</strong></p>\n<ul>\n<li>Analyze and mine data for understanding underlying biological mechanisms of processes</li>\n<li>Evaluate, develop, implement, and perform algorithms for data analysis</li>\n<li>Support infrastructure and provide code base maintenance (documentation, testing, and revision control)</li>\n<li>Contribute to the identification and validation of novel rare disease targets leveraging public and proprietary rare disease genomics and genetics data and work closely with target validation team.</li>\n<li>Represent bioinformatics discipline in drug discovery project team to provide broad range of support to ensure best use of all relevant data impacting project decisions:</li>\n<ul>\n<li>Proactively identify opportunities and propose informatics solutions.</li>\n<li>Independently carry out informatics analysis.</li>\n<li>Summarize and present scientific results with clear conclusions and recommendations.</li>\n</ul>\n<li>Contribute to the development of innovative data management/integration and information intelligence solutions:</li>\n<ul>\n<li>Act as bridge between end users and developers to clarify and define system requirement.</li>\n<li>Provide bioinformatics support to ensure data quality and usability.</li>\n<li>Conduct data mining to extract maximal value out of information system.</li>\n</ul>\n<li>Maintain expertise in state-of-the-art bioinformatics methods.</li>\n<li>Willingness to develop, optimize and implement innovative analytical approaches in regards to :<br> • Molecular genomic assays to evaluate genome-wide editing <br> • Allele quantitation<br> • Single cell genomics<br> • Off target and on target analyses<br> • Gene expression<br> • Vector design<br> • Expression cassette designs<br> • Sequencing of complex virus genomes<br> • Whole genome and targeted NGS applications</li>\n</ul>\n<p><br> <br></p>\n<p><strong>Skills and Experience</strong></p>\n<ul>\n<li>Advanced degree in bioinformatics, computational biology, computer science, or related field with 2+ years of working experience in related field.</li>\n<li>Proficiency in data analysis including:</li>\n<ul>\n<li>Next generation sequencing data.</li>\n<li>Diverse types of genomics data such as gene expression profiling, copy number profiling, RNAi screening, and expert user of genomics data analysis tools/packages such as Bioconductor, GenePattern, or equivalent.</li>\n<li>Solid understanding of statistical analysis principles and expert user of one of the statistical data analysis tools/packages, such as R, matlab, SAS or equivalent.</li>\n<li>Experience and training in the area of machine learning a plus.</li>\n<li>Ability to independently manipulate large datasets in Unix/Linux environment.</li>\n</ul>\n<li>Proficiency in common bioinformatics databases and tools, can independently design and perform diverse bioinformatics tasks.</li>\n</ul>\n<p>Interested Candidates should forward a CV to Careers@homologymedicines.com or apply at www.homologymedicines.com</p>\n<p><strong>About </strong></p>\n<p>Homology Medicines is a genetic medicines company translating proprietary gene editing and gene therapy technologies into novel treatments for patients with rare diseases. The combination of a new multidimensional gene correction platform and a management team that has successfully developed and commercialized rare disease therapies positions the Company to move beyond the current limitations of gene therapy and gene editing approaches to improve patient care. Homology Medicines has built foundational intellectual property on gene editing and gene therapy using vectors derived from naturally occurring human adeno-associated viruses (AAVs). The Company's technology is precise, on-target and highly efficient for <em>in vivo</em> editing of genetic mutations. The team and technology create a significant opportunity for Homology Medicines to rapidly advance a diverse pipeline of new medicines that address and potentially cure the underlying cause of genetic diseases.</p>\n<p> </p>"}