{"job title": "Principal Data Scientist (HCE)", "company": "Honeywell", "city state": "– USA-Atlanta", "rating": "3.4", "job description": "Principal Data Scientist (HCE)<br><br>Join a team recognized for leadership, innovation and diversity\n<br><br>\nHoneywell is a Fortune 100 company with global sales surpassing $40B and has been one of Fortune’s Most Admired Companies for over a decade. Through innovation, the Company brings together the physical and digital world to tackle some of the toughest societal and business problems – making the world a more productive, safe, and sustainable place.\n<br><br>\nThe business is organized into five primary groups: Aerospace, Buildings, Performance Materials and Technologies, Safety and Productivity Solutions, and the Connected Enterprise. Honeywell specializes in things that are critically connected - beyond smart phones and laptops, we make the kinds of connections that keep cities working, planes flying, plants running, and workers safe. Our unique capabilities, over a century in the making, bring together data, expertise, and technology to connect people, processes, and assets.\n<br><br>\nHoneywell International is building a world that’s safer and more secure, more comfortable and energy efficient, more innovative and productive. For more information, please visit Honeywell.com or follow us @HoneywellNow.\n<br><br>\nWe’re looking for a new team member who is motivated by cracking tough challenges with data, trained in problem solving, and with an unending thirst for learning.\n<br><br>\nAs a Principal Data Scientist, you will join a high-performing, global team, and be responsible for designing, developing, and implementing data driven solutions for all Honeywell business groups and functions. You will work closely with application architects to integrate results into operational platforms, including Hadoop and NoSQL architectures.\n<br><br>\nThe Principal Data Scientist is expected to work within Honeywell to deliver on opportunities for new growth and efficiency based on data analyses.\n<br><br>\nYou will also be expected to actively participate in defining and continuously evaluating our analytics strategy for Honeywell, as well as being a strong leader in executing data science driven projects as we build out capabilities and our architecture.\n<br><br>\nYou will report to the Data Science Site Leader in the Honeywell Industrial Analytics organization, part of the Connected Enterprise.\n<br><br>\n<strong>Specific Responsibilities:</strong>\n<br><br>\n<strong>Develop</strong> data modeling, mining, pattern analysis, data visualization and machine learning solutions to address customer needs and understand the role\n<br><br>\n<strong>Foster</strong> relationships with business team members by being proactive, displaying a thorough understanding of the business processes and by recommending innovative solutions\n<br><br>\n<strong>Communicate</strong> project output in terms of customer value, business objectives, and product opportunity\n<br><br>\n<strong>Promote</strong> data science methods and processes across functions\n<br><br>\n<strong>Work</strong> with our businesses and infrastructure teams to develop a strategy that will clearly outline how our enterprise platforms can enable business growth &amp; productivity. Also understand the role and what specific tools are needed in an enterprise like Honeywell.\n<br><br>\n<strong>You Must Have</strong>:\n<ul>\n <li>Master’s degree in Computer Science, Engineering, or Applied Mathematics</li> \n</ul>\n<br><br>\n<strong>We Value</strong>:\n<ul>\n <li>PhD degree in Computer Science, Engineering, Applied Mathematics or related field</li> <li>Strong Data Science prototyping experience (Python and/or R tool-stack)</li> <li>Machine Learning experience of physical systems</li> <li>Experience with distributed storage and compute tools (e.g. Hive and Spark)</li> <li>Experience bringing prototypes to production on Hadoop platforms and/or as containerized services.</li> <li>Experience with Streaming Analytics (i.e. Spark Streaming)</li> <li>Experience with Recurrent Neural Network architectures</li> <li>Experience with Natural Language Processing</li> <li>Experience with Image Analytics</li> <li>Experience with SQL</li> <li>Experience with Tableau</li> <li>Experience working with remote and global teams</li> <li>Results driven with a positive can-do attitude</li>\n</ul>\n\nExempt\n<br><br>\nCreated with SnapDevelop data modeling, mining, pattern analysis, data visualization and machine learning solutions Foster relationships with business team members by being proactiveCommunicate project output in terms of customer value, business objectives, and product opportunityPromote data science methods and processes across functions INCLUDES\n\n\n<ul>\n\n <li>Continued Professional Development</li>\n</ul>\n<br><br>\n<strong>ADDITIONAL INFORMATION</strong>\n\n<ul>\n<li><strong>Job ID:</strong> HRD38824</li> <li><strong>Category:</strong> Engineering</li> <li><strong>Location:</strong> 715 Peachtree Street, N.E., Atlanta, GA 30308 USA</li> \n</ul>\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status."}