{"job title": "Junior Data Scientist", "company": "Honeywell", "city state": "– USA-Phoenix", "rating": "3.4", "job description": "Junior Data Scientist\n<br><br>\nAre you a leader in the data science community who is looking to lead the application of data science techniques to new, innovative product and service offerings?\n<br><br>\nHoneywell International is a $40 billion diversified Fortune 100 leader with more than 130,000 employees in 100 countries around the world. We invent and manufacture technologies that address some of the world’s toughest challenges linked to global macro trends like energy efficiency, clean energy generation,\n<br>\nsafety and security, globalization, and customer productivity. We are building a world that’s safer and more secure, more comfortable and energy efficient, more innovative and productive.\n<br><br>\nAs a Data Scientist in our organization, you will work on programs to extract insights from data and use the insights to make recommendations to new product and service offerings. Key to the growth of the organization will be our ability to monetize critical data produced by our connected products.\n<br><br>\nMaster’s degree in computer science, applied mathematics, statistics, software engineering, physics, or related discipline in marketing and analytics\n<br>\nExperience and fluency in using modelling tools (e.g. R, SPSS, Matlab)\n<br>\nExperience and fluency in programming or scripting language (e.g. Python, Java)\n<br>\nExperience in data visualization and presentation tools (e.g. Tableau, Qlik, Ploty, D3)\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br>\nPhD in computer science, applied mathematics, statistics, software engineering, physics, or related discipline in marketing and analytics\n<br>\nExperience in condition monitoring and predictive failures\n<br>\nExperience in text analytics\n<br>\nExperience with open source data processing frameworks\n<br>\nAerospace knowledge or experience\n<br><br>\nDue to US export control laws, must be a US citizen, permanent resident or have protected status.\n<br><br>\nExempt\n<br><br>\nCreated with SnapCommunicate results of the analyses in a clearly and effective manner to stakeholdersLeverage tools, processes and procedures to create, manipulate, and manage very large data setsDesign experiments, test hypotheses, and build models/prototypesWork with product managers and engineers to define, design, and develop solutionsINCLUDES\n\n\n<ul>\n\n <li>Relocation Provided</li>\n<li>Continued Professional Development</li>\n</ul>\n\n<strong>ADDITIONAL INFORMATION</strong>\n\n<ul>\n<li><strong>Job ID:</strong> HRD42801</li> <li><strong>Category:</strong> Engineering</li> <li><strong>Location:</strong> 1944 E Sky Harbor Circle, Phoenix, AZ 85034 USA</li> \n</ul>\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status."}