{"job title": "Data Scientist - Entry Level", "company": "Honeywell", "city state": "– Atlanta, Idaho", "rating": "3.3", "job description": "Data Scientist - Entry Level\n<br><br>\nJoin a team recognized for leadership, innovation and diversityBe part of a team that designs, develops and integrates highly complex software functions within Honeywell. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities.\n<br>\nUse your fresh new skill set to provide value added features to our customers\n<br>\nAccelerate innovation and growth, teaming with the world's most talented engineers\n<br>\nWe invite you to discover for yourself why a career with Honeywell is the opportunity you've been looking for\n<br><br>\nData Scientist innovated to solve the world's most important challenges At Honeywell, we are investing heavily in our data science capabilities, chartered to build our predictive analytics capabilities for condition monitoring, predictive aircraft maintenance, optimize product performance &amp; build recommendation systems for end customers. Work on all stages of data science projects from understanding data to implementing the solutions into products and service offerings. Drive the interaction with Honeywell internal business partners to define, design, and develop solutions to customer problems using data insights derived from quick prototyping of multiple ideas\n<br>\n20Solving customer problems\n<br><br>\n20Strong communication and presentation skills\n<br><br>\n20Able to solve complex problems\n<br><br>\n20Modelling techniques\n<br><br>\n20Conduct big data analysis using SQL\n<br><br>\n<strong>YOU MUST HAVE</strong>\n\n\n<ul>\n<li>Bachelor's degree in Data Science or related field, Master Degree preferred</li>\n<li>1+ years of data science work experience, including a demonstrated high-level of proficiency in applying data techniques to solving customer problems</li>\n<li>1+ years of experience in machine learning, predictive analytics, and statistical modeling</li>\n<li>1+ years of experience in data visualization (e.g. Tableau, Qlik, Ploty)</li>\n<li>Strong communication and presentation skills</li>\n</ul>\n\nWe Value\n\n\n<ul>\n<li>Experience working with large datasets using Hadoop framework and tools</li>\n<li>Ability to communicate and present complex quantitative analyses in clear and precise manner to leadership team.</li>\n<li>PhD in Computer Science, applied mathematics, statistics, software engineering, physics, or related discipline in marketing and analytics</li>\n<li>Experience in condition monitoring and predictive failures</li>\n<li>Experience with moving prototypes to production environment and optimizing models in production environment</li>\n<li>Experience in condition monitoring and predictive failures</li>\n</ul>\n\nExempt How Honeywell is Connecting the WorldINCLUDES\n\n\n<ul>\n<li>1st Shift</li>\n<li>Continued Professional Development</li>\n<li>ADDITIONAL INFORMATION</li>\n<li>Job ID: HRD37677</li>\n<li>Category: Information Technology</li>\n<li>Location: 715 Peachtree Street, N.E., Atlanta, GA 30308 USA</li>\n</ul>\n\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status."}