{"job title": "SR. DATA ANALYST NOAH Scottsdale", "company": "HonorHealth", "city state": "– Scottsdale, Arizona", "rating": "3.3", "job description": "<strong>Job Description</strong>\n<br><br>\n<strong>Job Description</strong>\n\n<li>Job LocationUS-AZ-SCOTTSDALE</li>\n\nRequisition ID\n<br>\n<strong>2018-12087</strong>\n<br><br>\nShift\n<br>\n01 - Days\n<br><br>\nDepartment\n<br>\nNOAH Prog Admin\n<br><br>\nFacility\n<br>\nSupport Services\n<br><br>\nPosition Type\n<br>\nRegular Full-Time\n<br><br>\nPhysical Work Location and New Employee Orientation Location : Address\n<br>\n<strong>3634 N. DRINKWATER</strong>\n<br><br>\nWork Hours (ex:M-F, 8am - 4pm)\n<br>\n8am-5pm\n<br><br>\nOverview\n<br><br>\nHonorHealth is a non-profit, local healthcare organization known for community service and outstanding medical quality. HonorHealth encompasses five acute care hospitals with approximately 11,500 employees and 4,500 volunteers, over 70 primary and specialty care practices, clinical research, medical education, an inpatient rehabilitation hospital, an Accountable Care Organization, two foundations, and extensive community services.\n<br><br>\nHonorHealth is a leader in medical innovation, talent and technology with a genuine commitment to your growth. The health system's vibrant careers take place in an environment filled with opportunity and respect because we see the HONOR in you.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education</strong>\n<br>\nBachelor's Degree or 4 years' related experience in lieu of degree Required\n<br><br>\nExperience\n<br>\n3 years related experience analyzing complex data. Required\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nJob Summary\n<br>\nGenerates data and creates complex user-friendly reports related to clinic, financial, and grant performance, utilizing a range of system applications. Analyze and recommend methodologies for improved performance. Collaborates with HonorHealth departments to support system and coordination of clinical programs.\n\n\n<ul>\n<li>Support NOAH with required data, analysis and insights to ensure informed decisions are made. Ensure data quality is adequate. Communicate insights in a timely and effective manner. Analyze health care data for organizational initiatives; lead and plan data intensive projects and department initiatives. Design reports and dashboards needed to execute and measure short term and long term clinical and operational initiatives. Works with internal customers to identify data and analysis needs and will meet those needs by designing programmatic analyses, reporting capabilities, ad-hoc analysis, and where new data is needed, are responsible for defining business requirements to collect, translate and, aggregate new data.</li>\n<li>Assist NOAH management team in the design and implementation of new software. Collaborates with HonorHealth departments to ensure efficiency and accuracy of data development and collection. Represent NOAH at external meetings. Assist in the compilation and submission of NOAH's UDS report, Meaningful Use Attestations, or other government mandated report.</li>\n<li>Performs other related duties as assigned.</li>\n</ul>\n\nIt is the policy of HonorHealth to provide equal opportunity in employment. Selection and employment of applicants will be made on the basis of their qualifications without regard to race, color, religion, creed, national origin, age, disability, sexual orientation, marital status, veteran status or any other legally protected status.\n<br><br>\nPlease review the Equal Employment Opportunity poster.\n<br><br>\nPlease review the Equal Employment Opportunity Poster.HonorHealth wants all interested and qualified candidates to apply for employment opportunities. If you are an applicant with a disability who is unable to use our online tools to search and apply for jobs, please contact us at ******************************** . Please indicate the specifics of the assistance needed. This option is reserved only for individuals with disabilities that are unable to use the online tools and is not intended for other purposes.\n<br><br>\nScottsdale Healthcare is an Equal Opportunity Employer. We encourage qualified Minorities, Females, Protected Veterans and Individuals with Disabilities to apply and be considered for open positions."}