{"job title": "Sr. Data Engineer", "company": "Horizontal Integration", "city state": "– Saint Paul, MN", "rating": "4.3", "job description": "<div>\n<div>\nDescription<br><br>This role functions as a core member of an agile team supporting strategic initiatives relying on data to solve complex problems. The Sr. Data Engineer is responsible for the infrastructure that provides insight from raw data and handles diverse sources of data seamlessly. He/she enables analytical solutions that leverage emerging technologies. Additional responsibilities include developing prototypes and proof of concepts for the selected solutions, and implementing complex data projects with a focus on collecting, parsing, managing, analyzing and visualizing large diverse sets of data using multiple platforms. This role will be responsible for understanding and applying emerging technologies to solve complex business problems leveraging data and develop innovative data solutions.\n<br><br>\nQualifications:\n\n<ul>\n\n\t<li>The Data Engineer requires substantial expertise in a broad range of software development and programming fields.</li>\n<li>It is required to have knowledge of data analysis, end user requirements analysis, and business requirements analysis to develop a clear understanding of the business needs and to incorporate these needs into technical solutions.</li>\n<li>They have a solid understanding of physical data architecture and design principles. The ability to work well in a team environment is essential.</li>\n</ul>\nA combination of education and experience:\n\n<ul>\n\n\t<li>Bachelor degree in Computer Science / Engineering</li>\n<li>Minimum of 7 years of experience with data management technologies, business intelligence technologies, advanced analytics technologies, design strategies, and experience with one or more advanced analytics tools.</li>\n<li>Must demonstrate knowledge of descriptive, predictive and prescriptive models and how to operationalize them.</li>\n</ul>\nPreferred Experience:\n\n<ul>\n\n\t<li>Strong expertise in development</li>\n<li>Experience with Azure Data Lake and other Microsoft Analytics Platform capabilities</li>\n<li>Experience working with large and complex data sets with multi-terabyte scale</li>\n<li>Experience in building data analytics solutions on Hadoop stack</li>\n<li>Experience with architecture and design of highly available/scalable distributed systems.</li>\n<li>Experience with design and development of streaming data platforms using Kafka Streams, Spark, Flink, Storm, Beam or Cloud Dataflow.</li>\n<li>Experience with NoSQL technologies such as ElasticSearch .</li>\n<li>Experience with SQL on Hadoop technologies such as Hive, Impala or Presto.</li>\n</ul>\n#Priority\n<br><br>\n<em>Horizontal Integration is proud to be an Equal Opportunity and Affirmative Action Employer. We seek to provide employment opportunities to talented, qualified candidates regardless of race, color, sex/gender including gender identity and/or expression, national origin, religion, sexual orientation, disability, marital status, citizen status, veteran status, or any other protected classification under federal, state or local law.</em>\n<br><br>\n<em>\n<br>\nIn addition, Horizontal Integration will provide reasonable accommodations for qualified individuals with disabilities. If you need to request a reasonable accommodation in order to complete the application or interview process, please contact hr@horizontalintegration.com.</em>\n<br><br>\n<em>\n<br>\nAll applicants applying must be legally authorized to work in the country of employment.</em></div>\n</div>\n<br>"}