{"job title": "Data Scientist", "company": "Horizontal Integration", "city state": "– Englewood, CO", "rating": "4.0", "job description": "<div>\n<div>\nDescription<br><br><strong>Dish Network- Englewood, CO\n<br>\nData Scientists\n<br>\nContract</strong>\n<br><br>\n<strong>**Drug and background check required upon offer**</strong>\n<br><br>\nIf you meet most of the following requirements, you are likely to be a great fit for the position:\n\n<ul>\n\n\t<li>You have an academic background in applying statistics and machine learning. The typical candidate has a Bachelors or Masters degree in Math, Statistics, Computer Science, or Physics or such quantitative fields or has done a program from a business school in marketing, analytics etc. with a focus on quantitative approaches.</li>\n<li>You have at least 5 years of experience working with data and data analysis in some form. You have built predictive models and have done analyses to explain and understand the underlying process, variable relationships, causality etc.</li>\n<li>You have a wide range of statistical and machine learning tools under your belt, and deep practical insight to choose the best tools for a given problem. These include linear models for regression and classification, multi-level models, factor analysis &amp; PCA, discriminant analysis, support vector machine, decision tree ensembles &amp; bootstrap, neural networks, mixture models &amp; clustering algorithms, and so on.</li>\n<li>You know how to incorporate prior domain knowledge in your models in a principled fashion. You are familiar with Bayesian modeling and inference; you also know when and when not to use them based on practical considerations.</li>\n<li>You are proficient in at least one programming language commonly used for data analysis (like R/Python), and you are comfortable with SQL</li>\n</ul>\nAdditional Preferred qualifications:\n\n<ul>\n\n\t<li>Experienced in designing and analyzing controlled experiments. This will be a strong plus.</li>\n<li>Have worked on problems involving survival analysis or time series modeling</li>\n<li>Possess strong data visualization skills using programmatic tools (e.g. ggplot2) and tools like Tableau</li>\n<li>Have worked with large data sets, with big data processing tools like MapReduce, Spark, Hive, etc. Have data engineering skills to do basic preprocessing, cleaning and transformations.</li>\n<li>Knowledgeable on different database and data warehousing systems like MySQL, Amazon Redshift, BigQuery, Teradata</li>\n</ul>\n\n#Red Zone<br><br><em>Horizontal Integration is proud to be an Equal Opportunity and Affirmative Action Employer. We seek to provide employment opportunities to talented, qualified candidates regardless of race, color, sex/gender including gender identity and/or expression, national origin, religion, sexual orientation, disability, marital status, citizen status, veteran status, or any other protected classification under federal, state or local law.</em>\n<br><br>\n<em>\n<br>\nIn addition, Horizontal Integration will provide reasonable accommodations for qualified individuals with disabilities. If you need to request a reasonable accommodation in order to complete the application or interview process, please contact hr@horizontalintegration.com.</em>\n<br><br>\n<em>\n<br>\nAll applicants applying must be legally authorized to work in the country of employment.</em></div>\n</div>\n<br>"}