{"job title": "Sr. Data Analyst - IDQ", "company": "Horizontal Integration", "city state": "– Atlanta, GA", "rating": "4.3", "job description": "<div>\n<div>\nDescription<br><br><strong>Atlanta, GA\n<br>\nSr. Data Analyst; IDQ</strong>\n<br>\n<strong>Duration: 5/14/2018 - 7/27/2018</strong>\n<br><br>\nData Profiling professional who will provide leading practices relative to data profiling and establishing data cleansing rules in support of data migration, and ongoing sustainment controls carried out by Master Data Management technology tools.\n<br>\nWill provide guidance and recommended approaches to staff of up to 3 for leading approaches for identifying integrity issues through profiling of data in support of Siebel to SalesForce.com migration\n<br>\nWil set up tools and techniques to support efficiency in execution of work ? IDQ best practices &amp; toolsets, templates, report finding templates, tracking of profiling scope of work\n<br>\nParticipate in creation of deliverables and assessment outputs and presentations of findings and recommendations to client\n<br>\nParticipate as needed in configuration of profiling cases and conducting hands-on profiling in IDQ\n<br><br>\n<strong>Skills:</strong> \n<br>\nInformatica Data Quality (IDQ) - advanced level required\n<br>\nInformatica MDM - nice to have\n<br>\nSiebel prior experience - a plus\n<br>\nSalesForce.com - nice to have\n<br><br>\n#KRT\n<br><br>\n<em>Horizontal Integration is proud to be an Equal Opportunity and Affirmative Action Employer. We seek to provide employment opportunities to talented, qualified candidates regardless of race, color, sex/gender including gender identity and/or expression, national origin, religion, sexual orientation, disability, marital status, citizen status, veteran status, or any other protected classification under federal, state or local law.</em>\n<br><br>\n<em>\n<br>\nIn addition, Horizontal Integration will provide reasonable accommodations for qualified individuals with disabilities. If you need to request a reasonable accommodation in order to complete the application or interview process, please contact hr@horizontalintegration.com.</em>\n<br><br>\n<em>\n<br>\nAll applicants applying must be legally authorized to work in the country of employment.</em></div>\n</div>\n<br>"}