{"job title": "Data Scientist", "company": "HotelTonight", "city state": "– San Francisco, CA", "rating": "4.2", "job description": "<div>HotelTonight makes it remarkably easy to book great hotels at amazing rates on your mobile device, for tonight, tomorrow and beyond. Our goal is to be the premier and most loved way to book a place to stay and were looking for a Data Scientist to help do just that.</div><br>\n<div>If hotel rooms are the fuel that powers HotelTonight, data is the oil that makes it fire on all cylinders. Leveraging this data in the right way is what will differentiate HotelTonight and make it the leading hotel booking app on the planet.</div><br>\n<div><strong>As one of the first Data Scientists on the Data &amp; Strategy team,</strong> you will drive business decisions across the company using data and be responsible for implementing and fostering an environment that thrives on advanced analysis. You'll work closely with teams across Marketing, Supply and Finance on projects around customer segmentation, forecasting user quality and forecasting business performance - just to name a few!</div><br>\n<div>Check out this post to learn more about how our D&amp;S team has made user data at HotelTonight more secure.</div>WITHIN 30 DAYS, YOU WILL:\n\n<ul>\n<li>Become familiar with our datasets and the analysis tools that we work with</li><li>Learn about the business and the problems (short-term and long-term) that we face</li><li>Start to fill holes in our analysis platform and identify the areas of our business that are most important to focus on</li>\n</ul>\n\n<strong>WITHIN 60 DAYS, YOU WILL:</strong>\n\n<ul>\n<li>Deliver your first detailed analysis, which includes a strategic plan for how to act upon your findings</li><li>Improve the teams access to advanced analysis tools and begin teaching them how to most effectively use them</li><li>Increase your knowledge of the business and the teams involved, and prioritize the most impactful projects</li>\n</ul>\n\n<strong>WITHIN 90 DAYS, YOU WILL:</strong>\n\n<ul>\n<li>Establish a roadmap for advanced analysis projects for the next few months</li><li>Implement your first strategic initiatives and begin measuring the impact on key metrics associated with the initiative</li><li>Empower the rest of the team to apply advanced analysis to their own projects using your analysis tools</li>\n</ul>\n\n<strong>WHAT YOU'LL NEED TO BE SUCCESSFUL IN THIS ROLE:</strong>\n\n<ul>\n<li>Professional experience using advanced analysis to guide strategic decisions at the company level</li><li>You know how to use the right tool for the job, whether that's a programming language (like R or Python) or just plain old SQL</li><li>Experience working with statistics and supervised/unsupervised models</li><li>Communication: you love to talk about your work and findings, and can clearly explain the details</li><li>Familiarity with Amazon Web Services, Apache Spark, Tensorflow, etc</li><li>Ability to move quickly by making smart assumptions</li><li>Experience working with e-commerce marketplaces is a big plus</li><li>A love for travel, especially the hotel part!</li>\n</ul>\n\n<strong>WHAT YOU'LL GET FROM US:</strong>\n\n<ul>\n<li>An official Best Places to Work as listed in the SF Business Times (we're in the top 10!)</li><li>A highly collaborative and supportive team environment that isn't afraid to take risks, and we encourage you let go of the fear of failure and give that crazy but brilliant idea a shot</li><li>Well help you create goals that drive you, take on projects that excite you, and learn things that will surprise you</li><li>A beautiful workspace at Market &amp; 5th St</li><li>Excellent health, dental, vision and 401k plans, and stock options too</li><li>Fun stuff quarterly travel stipend, flexible time off, catered meals, subsidized cell phone plans and fitness memberships, access to our very own hotel-inspired full bar, and the opportunity to spin the HT Roulette wheel to win a spontaneous weekend getaway!</li>\n</ul>\n\n<div>We are on a mission to radically transform hotel bookings. Doing this requires us to think differently and to question conventional approaches, therefore its essential to have a diverse team of the very best people with all types of backgrounds and experiences to bring the best ideas to life. We are committed to maintaining an environment where all of our team members have the opportunity to be heard, to make an impact and to do the best work of their lives.</div>"}