{"job title": "Data Scientist", "company": "HouseCanary", "city state": "– Boulder, CO", "rating": "3.6", "job description": "<div>At HouseCanary, were using data and analytics to predict the future of US residential real estate. Our goal is to help people make better decisions by offering innovative and unparalleled insights. HouseCanarys platform accurately forecasts values 36 months into the future for four million residential blocks and more than 100 million properties.</div><br>\n<div>We're seeking a passionate data scientist to help develop best-in-class analytical models used to power HouseCanary products.</div>What you'll do:\n\n<ul>\n<li>Define, build and own statistical and machine learning models, algorithms and bodies of research</li><li>Help internal stakeholders derive the most value out of HouseCanarys data assets by communicating research and analytic outputs</li><li>Collaborate with data engineers and solution architects to integrate models and analyses into HC products</li><li>Derive new key performance metrics for various aspects of the housing market</li><li>Evaluate new data sources for quality and feature extraction</li><li>Contribute to our suite of valuation, data imputation, and normalization algorithms</li>\n</ul>\n\n<strong>What you have:</strong>\n\n<ul>\n<li>Undergraduate and graduate degree in statistics, mathematics, economics, engineering or another closely related field</li> <li>At least two years of applied model building experience</li><li>Experience in statistical analyses, data mining, natural language processing, or machine learning</li> <li>Advanced knowledge of at least one programming language (R or Python is highly desired)</li>\n</ul>\n\n<strong>Special consideration given for:</strong>\n\n<ul>\n<li>Ph.D. in statistics, mathematics, economics, or engineering</li><li>Knowledge of residential real estate market</li><li>Fantastic sense of humor</li>\n</ul>\n\n<div>HouseCanary is the authoritative source for accurate, uniform information, analyzed and visualized real-time to make better, faster decisions.</div><br>\n<div>HouseCanary - one platform, infinite insights.</div>"}