{"job title": "Data Engineer", "company": "HOVER", "city state": "– San Francisco, CA", "rating": "4.8", "job description": "We are looking for a Data Engineer to guide our global operations. You'll join a fast-growing team where you'll get to shape the evolution of our data architecture for business analytics and marketing. This is an ideal position if you like to own the high-level strategy and the detailed tactical implementation: we're interested in candidates who have exceptional communication skills as well as a strong technical ability.\n<br><br>\nHOVER is a Google Ventures backed series B startup that has raised over $20M from top Silicon Valley investors. Homeowners, contractors, and insurance professionals all use HOVER to get fully measured, accurate, and interactive 3D models of any propertyin a matter of minutes, and with just a few snaps of a smartphone camera.\n<br><br>\n<strong>WHAT YOU'LL DO:</strong>\n<br><br>\nYou'll own and architect the data analytics and marketing stack. You'll work directly with business stakeholders to help understand their systems integration needs and make data flow reliably between systems. You'll also make sure that our fast growing team of data scientists and analysts have the right toolset to be efficient and drive business action. Your projects and responsibilities will include:\n\n<ul>\n<li>Integrating data from our internal systems to our marketing automation stack</li>\n<li>Selecting new tools or frameworks for data orchestration tool, data quality monitoring, and better business alerting and getting those tools in place</li>\n<li>Managing our data analytics stack of Alooma, Snowflake, Segment, and Tableau</li>\n<li>Define robust data access policies and the toolset to manage and monitor access</li>\n</ul>\nYou'll collaborate closely with cross-functional teams across marketing, sales, data, and engineering. Equal parts engineer and architect you'll make sure that as we scale people and systems our data is everywhere we need it to be.\n<br><br>\n<strong>WHAT WE'RE LOOKING FOR:</strong>\n<br><br>\nFor this role, we are looking for someone with:\n\n<ul>\n<li>4-6 years of experience as a data engineer</li>\n<li>Expertise in data integrations between cloud applications and internal systems</li>\n<li>The ability to architect the entire data ecosystem overseeing data flows across numerous cloud applications and internal systems</li>\n<li>Experience making build-vs-buy evaluations and the desire to implement 3rd party, open source, and custom coded solutions</li>\n<li>Exceptional communication skills. You should be able to share what you know with clarity, patience, and empathy.</li>\n<li>The ability to work independently and set your own priorities, with meticulous attention to detail and deadlines.</li>\n</ul>\nSkills\n\n<ul>\n<li>Strong expertise in Python and SQL</li>\n<li>Ad-tech or Marketing-tech experience</li>\n<li>Experience managing a data warehouse</li>\n<li>Experience with orchestration tools such as Airflow or Luigi and data quality frameworks such as dbt</li>\n\n<strong><li>Plusess:</li>\n\n</strong>\n\n\n<ul>\n<li>Ruby-on-Rails knowledge to dabble in our backend codebase</li>\n<li>Experience managing pieces of our current toolset of Alooma, Segment, Snowflake and Tableau</li></ul>\n\n\n</ul>"}