{"job title": "Data Scientist", "company": "HRH Group Services", "city state": "– Reno NV", "rating": "NA", "job description": "The Senior Data\n<br>\nScientist will work in small multi-disciplinary team on a wide variety of\n<br>\nbusiness problems. Areas of focus for the Company today include: pricing\n<br>\naccuracy, support for straight-through-processing of applications and claims,\n<br>\nexposure risk management, claims severity management, distribution\n<br>\neffectiveness and others. In addition to standard forms of advanced analytics\n<br>\nthe Sr. Data Scientist will also help explore the development of predictive\n<br>\nmodels with machine learning and artificial intelligence.\n<br><br>\nEssential Duties\n<br>\n<strong>and Responsibilities:</strong>\n<br><br>\nWe are looking\n<br>\nfor a candidate that will be able to properly use a wide range of\n<br>\nanalytical and modeling methods to solve significant business problems\n<br><br>\nLead\n<br>\nmodel design sessions with other scientists and business representatives to:\n<br>\ndiscuss various approaches to solving a business problem, evaluate each and\n<br>\ndesign an end-to-end process for executing the chosen methodology\n<br><br>\nWork\n<br>\nwith data engineers and IT resources to assemble data. Perform preliminary data\n<br>\nanalysis and feature creation. Collaborate with business sponsors and peers in\n<br>\nthe regular review and interpretation of model iterations and final model\n<br>\nselection. Work with data engineers and IT resources to generate\n<br>\ndeployment-ready code\n<br><br>\nEngage\n<br>\nwith business partners to develop and execute a model deployment plan including\n<br>\ntesting the model in real time, incorporating user feedback into model\n<br>\nimprovements and evaluating model performance over time\n<br><br>\nIdentify\n<br>\nand test new areas to apply predictive modeling and other advanced analytics\n<br><br>\nJob\n<br>\n<strong>Requirements:</strong>\n<br><br>\nComputer\n<br>\nScience, or Math degree is preferred\n<br><br>\n5+ years of\n<br>\nexperience solving complex business problems with advanced predictive\n<br>\nanalytics.\n<br><br>\nTechnical\n<br>\n<strong>Requirements:</strong>\n<br><br>\nData Science is\n<br>\nKey requirement\n<br><br>\nCreation of\n<br>\nSolutions is Key in this role\n<br><br>\nExcellent\n<br>\nknowledge of relational database structure, programming concepts, external data\n<br>\nsources, and experience working with complex data systems\n<br><br>\nWorking\n<br>\nknowledge of Python, SAS and R skills, experience with Emblem is a\n<br>\nplus but not required.\n<br><br>\nAdvanced\n<br>\nMicrosoft Excel skills, including macro (VBA) and pivot table creation\n<br><br>\nData\n<br>\nvisualization skills and experience with relevant tools"}