{"job title": "Business Analytics Manager", "company": "HSBC", "city state": "– Miami, FL", "rating": "3.6", "job description": "The Business Analytics Manager reports to the Head of Business Development, Analytics, and Intra-Group Sales and provides support to the business through the development and maintenance of accurate business intelligence and management information through analysis of available information and information sourcing. The role will also involve the implementation of improved data analytics and data visualization tools. Additionally, the employee will be responsible for creating opportunities to make processes and reporting more efficient. The job holder will lead the development and management of consistent Management Information which will be used to assist Senior Management to drive growth and meet business objectives.\n<br><br>\nThis person is responsible for leading the production and analysis, digesting and interpreting data to enhance business development. Supports the administration and servicing of Private Banking relationships and HSBC's ability to provide best-in-class service to its HNW and UHNW client base. Also represents the PBUS business in various projects and initiatives across HSBC.\n<br><br>\n<strong>Primary Responsibilities/Essential Functions:</strong>\n\n\n<ul>\n<li>Responsible for delivering regular, timely and actionable data insight and providing detailed analysis</li>\n<li>Source, incorporate, interpret, analyze and explain data acquired for the project deliverables</li>\n<li>Communicate data findings, issue, logic applied</li>\n<li>Develop solutions to improve data usability and manageability</li>\n<li>Filter and \"clean\" data to ensure data is consistent, aggregated and usable</li>\n<li>Identify and escalate issues</li>\n<li>Ensure timely delivery of tasks</li>\n<li>Monitor and track KRIs and KPIs associated with Business and Front Office requirements and objectives</li>\n<li>Work with other areas of HSBC as required to resolve escalated business issues, increase efficiency, and streamline processes.</li>\n<li>Participate in committees and working groups as requested.</li>\n<li>Represent the PBUS Business and participate in various projects and initiatives within PBUS and across HSBC.</li>\n<li>Ensure activities comply with relevant internal policies and external regulations.</li>\n<li>Respond to internal and external Audit requests as assigned, including addressing issues where required.</li>\n<li>Support the Company's Diversity programs. Adhere strictly to compliance and operational risk controls in accordance with HSBC and regulatory standards, policies and practices; report control weaknesses, compliance.</li>\n<li>Perform other job-related and Business Analytics duties as assigned.</li>\n</ul>\n\n<strong>Decision-Making Responsibility:</strong>\n\n\n<ul>\n<li>Performs according to prescribed procedures.</li>\n<li>Daily discretion within assigned authority. Decisions beyond assigned authority are referred to higher levels of management for approval.</li>\n</ul>\n\nManagement of Risk\n\n\n<ul>\n<li>Each employee must be aware of the Operational Risk scenario associated with the role and acts in a manner that takes account of operational risk considerations.</li>\n<li>Each employee must ensure compliance, operational risk controls in accordance with HSBC or regulatory standards and policies; and optimize relations with regulators by addressing any issues.</li>\n<li>Each employee must promote an environment that supports diversity and reflects the HSBC brand.</li>\n</ul>\n\nObservation of Internal Controls\n\n\n<ul>\n<li>Each employee must maintain HSBC internal control standards, including timely implementation of internal and external audit points together with any issues raised by external regulators. Any failures to comply with the above should be reflected in year end performance assessments.</li>\n<li>Each employee must understand, follow and demonstrate compliance with all relevant internal and external rules, regulations and procedures that apply to the conduct of the business in which the jobholder is involved, specifically Internal Controls and any Compliance policy including, inter alia, the Group Compliance policy.</li>\n<li>Experience with data analytics tools (i.e. Alteryx) and data visualization (i.e. Tableau or Qlik)</li>\n<li>Minimum of five years proven and progressive private banking or customer service experience or equivalent</li>\n<li>Minimum of Bachelor's degree in business, finance, related field or equivalent experience</li>\n<li>Comprehensive understanding of the major products/services available in the private banking industry</li>\n<li>Proven communications, mathematical, analytical, organizational, planning skills, and problem-solving skills.</li>\n<li>Ability to work effectively on a team and with business partners and colleagues throughout the organization with a drive for success and achievement.</li>\n<li>Excellent communication skills, negotiation, and influencing</li>\n</ul>\n\nEEO/AA/Minorities/Women/Disability/Veterans"}