{"job title": "Director - Data Engineering and Technology", "company": "HUB International", "city state": "– Chicago, IL", "rating": "3.5", "job description": "<strong>Director - Data Engineering &amp; Technology</strong>\n<br><br>\n<strong>About HUB International</strong>\n<br><br>\nHUB International Limited (HUB) is the 7th largest global insurance and employee benefits broker, providing a broad array of property, casualty, risk management, life and health, employee benefits, investment and wealth management products and services. With over 10,000 employees in 450 offices throughout North America, HUB has grown substantially, in part due to our industry leading success in mergers and acquisitions.\n<br><br>\n<strong>About the Position</strong>\n<br><br>\nLooking for a self-motivated, creative and enthusiastic individual to join our team as the Director of Data Engineering &amp; Technology with experience in the Microsoft Stack, Master Data Management, Cloud and Big Data technologies. The desired candidate must have a proven track record working in large organizations that have complex, interrelated systems and bringing that content together on Big Data platforms. The individual will provide thought leadership and drive the architecture, design and transformation of Enterprise Data Warehouse (HANA) and Enterprise Data Hub (Hadoop) solutions. The Director possesses running, maintaining, maturing and setting industry standards on the end-to-end vision of the enterprise data strategy. The Director will also need to understand how Data Warehouses logical design translates into physical database design for relational stores, how data flows across the enterprise and how the most value can be extracted from the data in the most effective way.\n<br><br>\nThis position is responsible for the ongoing support, and maturing, of the architecture and design of the company's Data Platforms, which includes relational data architecture and non-relational data stores under the Hadoop ecosystem. This position will also collaborate with other application and infrastructure solution architects as part of an enterprise architecture working group. The ability to demonstrate strong leadership and influencing skills is a strong requirement.\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>Initiates and drives dialog with business areas to understand business needs/gaps, conduct analysis, and recommend solutions/options that best meet current and future business growth.</li>\n\n<li>Technical and architectural understanding of all aspects of Microsoft`s. Delivering complex reports and dashboards against relational and OLAP sources within SharePoint portals, using Microsoft SQL Server, Microsoft SharePoint, SSRS, Power BI and Microsoft Excel.</li>\n\n<li>Ability to develop and implement all necessary operational process and procedures to insure a well-functioning and secure environment.</li>\n\n<li>Skilled in metrics to determine overall system health, and apply those metrics to capacity planning needs.</li>\n\n<li>Skilled in transforming verbal descriptions of required functionality into design mock ups.</li>\n\n<li>Deep understanding and experience in developing in SharePoint and the Microsoft technology stack.</li>\n\n<li>Must be familiar with the SharePoint security architecture and how it interfaces to Active Directory.</li>\n\n<li>Must have documented experience implementing, managing, and documenting a production environment with several hundred users, and must be able to articulate the positive and negative aspects of how architectural choices impact the environment and end-users.</li>\n\n<li>Must have coding skills of C#, .NET Framework, and ASP.NET, SharePoint Server, ADO.NET, VB, HTML, CSS, JavaScript, jQuery, XML, SQL Server, Web Services, security, instrumentation, exception handling, SharePoint branding and support of large, complex, or enterprise-wide solutions.</li>\n\n<li>Familiar with workflow solutions using MOSS workflow engine and other technologies to include custom forms and InfoPath</li>\n\n<li>Excellent data analysis skills using SQL.</li>\n\n<li>Strong analytical skills and an ability to present and communicate data, trends, insights and recommendations</li>\n\n<li>Experience in delivering quality work on time with multiple, competing priorities</li>\n\n<li>Strong collaboration with others on the team to design and maintain a global information delivery, meet project milestones, manage client satisfaction and mentor others on the team</li>\n</ul>\n<strong>Required Skills</strong>\n\n<ul>\n<li>7+ years implementing enterprise Data &amp; Analytical solutions in a complex environment.</li>\n\n<li>3+ years working as a Solution Architect with depth in data integration and data architecture for Enterprise Data Warehouse implementations.</li>\n\n<li>3+ years leading strategic engagements and delivering BI Roadmaps Experience in designing and implementing the data architecture (conceptual, logical, physical &amp; dimensional models).</li>\n\n<li>Experience in broad Information Technology experience</li>\n</ul>\n· Experience in experience with SharePoint development\n\n<ul>\n<li>Experience in implementing master data management</li>\n\n<li>Experience designing and implementing ETL strategies</li>\n\n<li>Experience with Kimball data modeling methodologies and other Data Warehousing activities</li>\n\n<li>Strong Leadership skills to mentor junior mentors. Strong communication skills with the ability to present solutions to senior leadership</li>\n\n<li>BA/BS degree in Computer Science or similar degree is required.</li>\n</ul>\n\\#LI-MD1\n<br><br>\n<strong>Location:</strong> United States, Illinois, Chicago\n<br><br>\n<strong>Required Education:</strong> Bachelor's degree (4-year degree)\n<br><br>\n<strong>Required Experience:</strong> 7-10 years\n<br><br>\n<strong>Required Travel:</strong> No travel required\n<br><br>\n<strong>Date published:</strong> 1-May-2018\n<br><br>\n<strong>Department:</strong> Information Technology\n<br><br>\n<strong>Ref#:</strong> AvaR139_20180512\n<br><br>\nHUB International Limited is an equal opportunity and affirmative action employer that does not discriminate on the basis of race/ethnicity, national origin, religion, age, color, sex, sexual orientation, gender identity, disability or veteran's status, or any other characteristic protected by local, state or federal laws, rules or regulations. The EEO is the Law poster and its supplement is available here at http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm .\n<br><br>\nWe endeavor to make this website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact the US Recruiting Team toll-free at (844) 300-9193 or USRecruiting@hubinternational.com . This contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications."}