{"job title": "Senior Data Scientist", "company": "Humana", "city state": "– Louisville, KY", "rating": "3.3", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>\n<br><br>\n<strong><strong><strong>Description</strong></strong></strong><br><br>The Senior Data Scientist uses mathematics, statistics, modeling, business analysis, and technology to transform high volumes of complex data into advanced analytic solutions. The Senior Data Scientist work assignments involve moderately complex to complex issues where the analysis of situations or data requires an in-depth evaluation of variable factors.<br><br><strong><strong>Responsibilities</strong></strong>\n<br><br>\nThe Senior Data Scientist develops, maintains, and collects structured and unstructured data sets for analysis and reporting. Creates reports, projections, models, and presentations to support business strategy and tactics. Begins to influence departments strategy. Makes decisions on moderately complex to complex issues regarding technical approach for project components, and work is performed without direction. Exercises considerable latitude in determining objectives and approaches to assignments.\n<br><br>\n<strong>Required Qualifications</strong>\n<ul>\n<li>Masters Degree in Math, Statistics, Engineering or a related field</li><li>5+ years statistics and modeling experience</li><li>Experience using SAS modeling tool</li><li>Experience building and maintaining analytic data sets</li><li>Proven ability with data mining and/or predictive modeling techniques</li><li>Proven ability to effectively communicate results of statistical models to broad audience, including senior leadership</li><li>Comprehensive knowledge of all Microsoft Office applications</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n<ul>\n<li>PhD Degree in Math, Statistics, Engineering or a related field</li><li>2+ years as a Data Scientist at Employer</li><li>Experience with health care data, including Medicare/Medicaid</li><li>Experience with SAS Enterprise Miner</li><li>Advanced experience with statistical analyses and modeling techniques including propensity score matching, multivariate statistical modeling, and neural networks.</li><li>Experience with large data sets and/or the analysis of patient-level healthcare data</li>\n</ul>\n<strong>Additional Information</strong>\n<br><br>\n<strong><strong><strong>Scheduled Weekly Hours</strong></strong></strong><br><br>40"}