{"job title": "Data Scientist 2", "company": "Humana", "city state": "– Louisville, KY", "rating": "3.3", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>\n<br><br>\n<strong><strong><strong>Description</strong></strong></strong><br><br>The Data Scientist 2 uses mathematics, statistics, modeling, business analysis, and technology to transform high volumes of complex data into advanced analytic solutions. The Data Scientist 2 work assignments are varied and frequently require interpretation and independent determination of the appropriate courses of action.<br><br><strong><strong>Responsibilities</strong></strong>\n<br><br>\nThe Data Scientist 2 develops, maintains, and collects structured and unstructured data sets for analysis and reporting. Creates reports, projections, models, and presentations to support business strategy and tactics. Understands department, segment, and organizational strategy and operating objectives, including their linkages to related areas. Makes decisions regarding own work methods, occasionally in ambiguous situations, and requires minimal direction and receives guidance where needed. Follows established guidelines/procedures.\n<br><br>\nThe Data Scientist 2 will work directly with internal customers to help guide decision makers (executives to front-line leaders) to make it easy for our associates to complete complex processes, ultimately having a direct impact on our members using your consulting, analytics and problem solving skills. You will also engage with business partners outside of Resolution Team on discovering the actionable insights that will help improving member and providers experience through analytics. You will assist in the presentation, implementation, and evaluation of your recommendations and solutions.\n<br><br>\n<strong><strong>The Data Scientist 2 will:</strong></strong>\n<ul>\n<li>Participate in discussions with the internal business partners to determine areas of challenge that are opportunities for analytics to be the right tool</li><li>Develop analytical constructs based on addressing business challenges</li><li>Develop predictive models to identify operational gaps, drive process improvement and identify business opportunities</li><li>Provide expertise and assistance in implementing model results in ongoing business processes</li><li>Combine and analyze diverse types of data to extract fresh, actionable discoveries about G&amp;A operation</li><li>Participate in developing and selecting new data sources and ensuring the quality and reliability of the data</li>\n</ul>\n<strong>Required Qualifications</strong>\n<ul>\n<li>BS or MS with strong quantitative/analytical emphasis</li><li>1-2 years of working experience in analytics</li><li>Proven ability to present solutions using both technical and non-technical arguments for business interpretation of models and results</li><li>Knowledge of applications that process millions of records</li><li>Knowledge of data mining, statistics, analytical methods and tools, techniques and algorithms</li><li>Experience using Python, SAS, R or similar statistical tools</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n<ul>\n<li>Experience with health care data</li><li>Experience with SAS Enterprise Miner</li><li>knowledge of G&amp;A operation</li>\n</ul>\n<strong><strong><strong>Scheduled Weekly Hours</strong></strong></strong><br><br>40"}