{"job title": "Trend Detection Data Scientist 2", "company": "Humana", "city state": "– Louisville, Kentucky", "rating": "3.4", "job description": "Description The Data Scientist 2 uses mathematics, statistics, modeling, business analysis, and technology to transform high volumes of complex health care claims data into actionable solutions. The Data Scientist 2 work assignments are varied and frequently require interpretation and independent determination of the appropriate courses of action. Responsibilities The Data Scientist 2 develops, maintains, and collects structured and unstructured claims data sets for analysis and reporting. Creates reports, models, and presentations to support business strategy around claims drivers and findings. Understands department, segment, and organizational strategy and operating objectives, including their linkages to related areas. Makes decisions regarding own work methods, occasionally in ambiguous situations, and requires minimal direction and receives guidance where needed. Follows established guidelines/procedures. Required Qualifications + Bachelor's Degree + 4 years technical experience + Experience in developing, maintaining, and collecting structured and unstructured claims data sets for analysis and reporting + Experience in creating reports, projections, models, and presentations to support business + Experience in using mathematics, statistics, modeling, business analysis, and technology to transform high volumes of complex data into advanced analytic solutions + Possesses an understanding of department, segment, and organizational strategy and operating objectives, including their linkages to related areas + Capable of making decisions regarding own work methods, occasionally in ambiguous situations Preferred Qualifications + SAS experience + Qlikview experience Additional Information Scheduled Weekly Hours 40 About Us Equal Opportunity Employer It is our policy to recruit, hire, train, and promote people without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity or expression, disability, or veteran status, except where age, sex, or physical status is a bona fide occupational qualification. View the EEO is the Law poster. If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact ****************************** for assistance."}