{"job title": "Data Scientist - Text Analytics", "company": "Huntington National Bank", "city state": "– Columbus, Ohio", "rating": "3.2", "job description": "Our Enterprise Analytics department is growing, and we're looking for an outstanding candidate to lead our text analytics capabilities with Natural Language Processing and Machine Learning. Huntington is looking for even better ways to serve our customers and we need you to design and build our text analytics platform. In this role you will work within our Data Science and predictive modeling team and partner with data architecture, communications, and marketing leadership to drive actionable and valuable insights to our customers and colleagues. This includes identifying opportunities and championing these capability around Huntington. You will need to assist in architecting our text data environment, build predictive models and automated insights, and operationalize the delivery mechanism throughout the enterprise. At the project level, you will need to identify the appropriate technique, develop new data sets and models, define and monitor success, and communicate with technical and non-technical partners along the way.\n<br><br>\nKey Responsibilities\n<br><br>\nCollaborate with communications, marketing, customer advocacy, and other groups to ensure business needs are understood and translated into project requirements. You'll need to create a roadmap consisting of the technology, analytical approach, delivery mechanisms, and monitoring to ensure on-going success of text analytics. You'll also need to work with executive leadership to gain buy-in as well as technology experts to ensure execution success, across multiple lines of business. This position requires both technology and project leadership while planning and executing multiple analytic projects at once in response to evolving business needs.\n<br><br>\nBasic Qualifications\n\n\n<ul>\n<li>A Master's Degree</li>\n<li>5 or more years of work experience in Statistics, Computer Science, Engineering, or Library Science.</li>\n<li>A minimum of 3 years of experience with natural language processing (NLP), topic modeling, and semantic and sentiment analysis.</li>\n<li>A minimum of 3 years of experience with multiple text analytics and machine learning tools (i.e. NLTK, Scikit Learn, TensorFlow, tm, openNLP, tidytext).</li>\n<li>A minimum of 3 years of experience with at least one programming language (i.e. R, Python, or Julia).</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>PhD preferred.</li>\n<li>Experience with text analytics in a retail context.</li>\n<li>Coursework in Text Information Systems and Natural Language Processing</li>\n<li>3 years of experience with SQL queries of large databases such as Oracle, DB2, SQL Server, Teradata, and Hadoop.</li>\n<li>Experience developing and applying statistical or machine learning methods in a corporate environment through applications such as R, python, or SAS.</li>\n<li>Fluent in programming languages such as Python, Java, or C++ in a data mining context, and experience building web-based applications or dashboards using R, python, HTML, CSS, Perl, and JavaScript.</li>\n<li>Excellent written and verbal communication skills with a proven ability to interact effectively across all organizational levels.</li>\n<li>Progressive thinker and problem solver, with a strong ability to manage ambiguity/complexity.</li>\n<li>Work effectively in teams as well as independently across multiple tasks while meeting aggressive timelines.</li>\n<li>Experience working in a consumer-centric company and with teams of technical professionals in a cross-functional environment.</li>\n<li>Ability to embrace change, constructively negotiate constraints, and effectively leverage resources to create exceptional outcomes. Consistently model and inspire high levels of professional demeanor and integrity.</li>\n</ul>\n\nEEO/AA Employer/Minority/Female/Disability/Veteran/Sexual Orientation/Gender Identity Tobacco-Free Hiring Practice: Visit Huntington's Career Web Site for more details. Huntington does not accept solicitation from Third Party Recruiters for any position.\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: *************\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nHuntington National Bank\n<br><br>\nYou're going places, eager to learn, filled to the brim with ideas and ready to make an impact. We welcome and thrive on this type of energy. We are changing the industry by creating a new standard for banking. While our perspective on the industry may be fresh, our roots run deep, and our commitment to doing what's right has never waivered. Our competitors know us by our steadfastness, our customers know us by our loyalty and once you join our team, you'll know how much we value our people. Contact Info\n\n\n<ul>\n<li>41 South High Street</li>\n</ul>\n\nColumbus, OH 43215"}