{"job title": "Data Scientist", "company": "HVH Precision Analytics", "city state": "– New York, New York", "rating": "NA", "job description": "HVH Precision Analytics applies AI/machine learning techniques to the breadth of healthcare and non-healthcare data integrated with our deep clinical expertise to provide a unique and unmatched suite of services and products to the pharmaceutical and healthcare industries. Our ability to collect, aggregate, and analyze the journeys of known patients to inform the early diagnosis of undiagnosed patients is revolutionary in the healthcare market, and helps our clients maximize their ability to find and engage patients.\n<br><br>\nHVH is a joint venture between Perspecta (formerly Vencore and Lockheed Martin), which has offerings in mission services, digital transformation and enterprise operations for U.S. government customers in defense, intelligence, civilian, health care, and state and local markets, and Havas Health &amp; You (part of Havas Group), a global strategic communications partner to many top biopharma companies.\n<br><br>\nWe are seeking highly motivated individuals who are passionate about AI/machine learning and its application across disparate data resources to help our healthcare clients gain insights not previously possible and to connect patients to therapies sooner and positively impact their lives.\n<br><br>\n<strong>Job Title: Data Scientist</strong>\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nData science professional to perform healthcare analysis to support quick-turn analysis tasks. These analysis tasks will involve developing original code and leveraging HVHs existing healthcare analytics platform to provide analytic content in support of project work, RFP responses and other business needs. The professional will be a member of HVHs analytics team.\n<br><br>\n<strong>Job Requirements:</strong>\n<ul>\n<li>Apply data mining and machine learning techniques and models to extract analytic insights from healthcare and non-healthcare data sets</li><li>Rapid delivery to clients of analytic products in support of project work, RFP responses and other business needs</li><li>Develop visualizations for delivery to clients</li><li>Develop software solutions using Python, and/or R</li><li>Interface with other HVH analysts and program managers and with HVH customers</li><li>Respond to additional ad-hoc analysis requests</li>\n</ul>\n<strong>Required Skills</strong>\n<br><br>\nThe skills required for this position are listed below:\n<ul>\n<li>Degree in any of the following majors: Engineering, Computer Science, Mathematics, Bioinformatics, Physics</li><li>Minimum 3 years experience, with a BS/MS degree in one of the above listed majors</li><li>Works independently and is a self-starter</li><li>Client interface and presentation skills</li><li>Proficiency in the following programming and analysis tools:</li></ul>\n\n<ul>\n<li>Visualization tools (PowerBI)</li><li>Python (pandas, scikit-learn, Numpy, Scipy, and database access packages)</li><li>SQL / (MySQL)</li><li>AWS (Redshift)</li><li>Microsoft Excel</li></ul>\n\n<ul>\n<li>R</li><li>Powerpoint: presentation development skills</li></ul>\n\n<ul>\n<li>Linux (Red Hat, CentOS); Python and software development in a Linux environment * Consideration will be given to prior publications, independent software projects completed, and non-proprietary code authored by the candidate</li>\n</ul>\nJob Type: Full-time\n<br><br>\nExperience:\n<ul>\n<li>Engineering, Computer Science, Mathematics, Bioinformatics,: 3 years (Required)</li>\n</ul>\nEducation:\n<ul>\n<li>Bachelor's (Required)</li>\n</ul>"}