{"job title": "Business/Data Analyst Intern-Coop - Austin, TX", "company": "IBM (United Kingdom) Ltd", "city state": "– Austin, Texas", "rating": "NA", "job description": "Title Business/Data Analyst Intern-Coop - Austin, TX\n<br>\n<strong>Job Description</strong>\n<br>\nIBM CIO (Chief Information Office) Organization is looking for innovative talent for our Austin, TX office who bring fresh new ideas to create a productive environment for all IBMers across the globe through our internship program offering. Our mission is to provide the best work experience in a digital workplace to all IBM employees and consequently positively impact on the way IBM deliver what our clients need.\n<br><br>\nAre you interested in working in an innovative and collaborative environment for the summer? If so, this is your chance to work in the first IBM area to become agile and to create meaningful solutions that impact our technology and business transformation for a new business era - all in just one summer!\n<br><br>\nAuto req ID ******BR\n<br>\nRequired Education High School Diploma/GED\n<br>\nRole ( Job Role ) Business Analyst\n<br>\nState / Province TEXAS\n<br>\nPrimary job category Technical Specialist\n<br>\nCompany (0147) International Business Machines Corporation\n<br>\nContract type Internship\n<br>\nEmployment Type Full-time OR Part-time\n<br>\nIs this role a commissionable/sales incentive based position? No\n<br>\nTravel Required No Travel\n<br>\nIBM Business Group F&amp;O\n<br>\nPreferred Education Bachelor's Degree\n<br>\nCity / Township / Village AUSTIN\n<br>\nEO Statement IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br>\nRequired Technical and Professional Expertise\n\n\n<ul>\n<li>Experience</li>\n</ul>\n\nwith User Experience (UX) design\n\n\n<ul>\n<li>Minimum</li>\n</ul>\n\nof 1-year experience using problem solving skills such as: Analyze causes using existing techniques or tools, prepare and recommend solution alternatives\n\n\n<ul>\n<li>Ability</li>\n</ul>\n\nto absorb professional knowledge quickly and develop skills\n\n\n<ul>\n<li>Ability</li>\n</ul>\n\nto draw upon professional concepts to collaborate with others to carry out assigned duties\n\n\n<ul>\n<li>Ability</li>\n</ul>\n\nto challenge the validity of given procedures and processes with the intent to enhance and improve\n\n<li>Enrolled in a Bachelor of Science in Business Information Technology, Management Information Systems, or a similar degree program</li>\n\nAbility to work in the United States without the need for current or future IBM sponsorship\n<br><br>\nCountry/Region United States\n<br>\nPreferred Technical and Professional Experience\n\n<li>Experience using Agile and Design Thinking methodologies</li>\n<li>Experience working with leaders of design</li>\n<li>Experience writing user stories and requirements documents using analytical skills</li>\n\nSecondary Job Category Services Specialist\n<br>\nEligibility Requirements\n\n\n<ul>\n<li>None</li>\n</ul>\n\nPosition Type Intern\n<br>\nEarly Professional Track Track unaligned\n<br>\nNew Collar Role Yes"}