{"job title": "Senior Data Scientist", "company": "IBM (United Kingdom) Ltd", "city state": "– Cairo, Alabama", "rating": "NA", "job description": "Title Senior Data Scientist\n<br>\nJob Description In this new era of Cognitive Business, IBM Global Business Services is one of the worlds largest providers of information technology solutions and business consultancy. Our vision is to bring a new level of smart to how the world works. A place where people, businesses, governments and systems are interconnected and work together. A place where billions of people will live and work better. We are changing how we create. How we collaborate. How we analyze. How we engage. IBM is a leader in this global transformation.\n<br>\nData is the world's natural resource for the next century.\n<br>\n<strong>Who you are:</strong>\n<br>\nYou will be highly hands-on and enjoy keeping up with the latest innovations. With a very good grasp of a broad set of machine learning algorithms and software engineering skills, you will have a machine learning / mathematical / statistical background.\n<br>\nAs a Data scientist you will apply your deep analytics expertise, designing and implementing end to end unstructured data mining of large scale big data platforms. semantic correlation, ontology, and text analytics techniques to analyze un-structured data and identify critical insights. You will participate in feature / design discussions / workshop with Architect and the offering Management Teams to come up with innovative solutions that can scale.\n<br><br>\nFor Data Scientist, we need to add the following in the skill set:\n\n\n<ul>\n<li>Defining the business problem and working hypothesis</li>\n<li>Helping to locate/resolve data/quality issues</li>\n<li>Proficient in the following: Python, R, Java, SQL</li>\n<li>Proficient at consuming and building REST APIs</li>\n<li>Proficient at integrating predictive/prescriptive models into applications and processes</li>\n<li>Training and experience applying probability and statistics</li>\n<li>Experience in data modeling and evaluation and a deep understanding of supervised and unsupervised machine learning</li>\n<li>Experience applying mathematical modeling and/or constraint programming to a range of industry problems</li>\n<li>Ability to apply predictive models as input into decision optimization problems</li>\n<li>Experience building Monte Carlo simulation/optimization for what-if scenario analysis</li>\n<li>Experience integrating data and the output of predictive and prescriptive models within the context of a business problem</li>\n<li>Proficiency with data parsing, scraping, and wrangling</li>\n</ul>\n\nHow well help you grow\n<br>\nYoull have access to all the technical and management training courses you need to become the expert you want to be\n<br>\nYoull learn directly from expert developers in the field; our team leaders love to mentor\n<br>\nYou have the opportunity to work in many different areas to figure out what really excites you\n<br><br>\nClient Innovation Centre, Global Business Unit Introduction\n<br>\nIBM Global Business Services (GBS) is a team of business, strategy and technology consultants enabling enterprises to make smarter decisions and providing unparalleled client and consumer experiences in cognitive, data analytics, cloud technology and mobile app development. With global reach, outcome-focused methodologies and deep industry expertise, IBM GBS empowers clients to digitally reinvent their business and get the competitive edge in the cognitive era in over 170 countries.\n<br>\nBottom line?\n<br>\nWe outthink ordinary. Join us by applying today. Discover what you can do at IBM.\n<br><br>\nAuto req ID ******BR\n<br>\nRequired Education Bachelor's Degree\n<br>\nRole ( Job Role ) Data Scientist\n<br>\nState / Province AL QAHIRAH\n<br>\nPrimary job category Data Science\n<br>\nCompany (0040) IBM World Trade Corp - Egypt Branch\n<br>\nContract type Regular\n<br>\nEmployment Type Full-Time\n<br>\nIs this role a commissionable/sales incentive based position? No\n<br>\nTravel Required No Travel\n<br>\nIBM Business Group GBS\n<br>\nPreferred Education Doctorate Degree\n<br>\nCity / Township / Village CAIRO\n<br>\nEO Statement IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br>\nRequired Technical and Professional Expertise - Experience in data modeling and evaluation and a deep understanding of supervised and unsupervised machine learning\n\n\n<ul>\n<li>Experience applying mathematical modeling and/or constraint programming to a range of industry problems</li>\n<li>Ability to apply predictive models as input into decision optimization problems</li>\n<li>Experience building Monte Carlo simulation/optimization for what-if scenario analysis</li>\n<li>Experience integrating data and the output of predictive and prescriptive models within the context of a business problem</li>\n<li>Proficiency with data parsing, scraping, and wrangling</li>\n</ul>\n\nCountry/Region Egypt\n<br>\nPreferred Technical and Professional Experience None\n<br>\nEligibility Requirements None\n<br>\nPosition Type Professional\n<br>\nEarly Professional Track Not Applicable - Professional Hire\n<br>\nNew Collar Role Yes"}