{"job title": "Content Marketer - Data Science and Machine Learning", "company": "IBM", "city state": "– SAN FRANCISCO, CA, US", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br><br>\n<strong>Content Marketer, Data Science and Machine Learning</strong>\n<br><br>\n<strong>What you will do</strong>\n<br>\nThis Content Marketer position is part of the IBM Data Science and Machine Learning Marketing Team. This role is responsible for creating and managing content that captures the attention of our target buyers and engages them along their buying journey. The content marketer will work closely with product marketers to understand core messages and positioning, and guide the content journey. You will create assets in a variety formats, working with IBM and industry SMEs; project manage the creation, delivery, and distribution, and track performance; and then work with campaign, digital, and social teams to ensure content is published and producing engagement and pipeline results in the campaigns. Specifically, you will:\n\n<ul>\n<li>Manage all content for the team by maintaining and tracking performance of the asset inventory, project managing assets from inception to distribution. Includes agency management, budget allocation, SME curation, publishing assets into the campaign and the appropriate IBM tracking systems.</li><li>Understand and contribute to the definition of target buyers and relevant cohorts (personas) for each target role with the product marketing managers. Apply persona-based buyer insights to design customer engagement experiences.</li><li>Define the content subject and type required to move the target buyer through the buyers journey. Designs buyer journeys and content narratives for new, cross sell, up sell and loyalty/retention buyer types, within the campaign framework.</li><li>Overlay the buyers journey onto their digital experience and works with campaign and digital managers to ensure content is published to all sites quickly and is continually maintained.</li><li>Create derivative messaging and content from the core product messages. Examples of derivative messaging include: web copy, e-books, slideshares, presentations, search engine optimization terms and web copy, social media blogs, tweets, and other content to be used in social media tactics.</li><li>Track asset performance with regular reporting and data to understand the effectiveness of marketing campaigns, assets, and messages, and modifies the strategy based upon results.</li><li>Collaborate with the team to manage the budget for content creation and work with marketing agencies to ensure on-time project delivery.</li><li>Define the messaging and search terms for search engine optimization, working with the campaign team to execute that strategy, as well as monitor web metrics.</li><li>Work with the digital and social teams to execute social media tactics, including writing and publishing blogs and tweets, identifying target social venues to place content, and push out pre-built content to a thought leader distribution list.</li>\n</ul>\n\n<strong>Who you are</strong>\n<br>\nYou are part creative and part operational expert. You have a passion for telling stories in written formats as well as seeking out innovative mediums to capture the attention of our audience. You are also data-driven. You are efficient and can multi-task, keeping many projects on track at the same time, while constantly verifying and improving how your work drives results.\n\n<ul>\n<li>5-10 years as a writer/storyteller demonstrating relevant success</li><li>Very strong writing skills required frequent writing is a requirement</li><li>Proven ability to project manage, multi-task, and publish content with many projects in motion and multiple stakeholders and SMEs.</li><li>Demonstrated ability to be data-driven, to constantly monitor and optimize/test performance from engagement to pipeline. Experience in using modern tracking and reporting tools.</li><li>Demonstrable skills in working with complex projects across matrixed teams</li></ul>\n\n<ul>\n<li>Working knowledge of Microsoft Office tools and video editing tools</li><li>Demonstrated ability to collaborate with marketing and business teams including product management, sales, tech sales, engineering</li><li>Ability to deeply understand and profile target buyers their needs, wants, beliefs, as well as how they learn about cutting edge technology and what type of content engages them.</li><li>Excellent presentation and verbal skills with the ability to persuade</li> <li>A plus: Knowledge of data science and machine learning, having practiced agile marketing, and ability to produce video</li>\n</ul>\n\n<strong>MC18</strong>\n<br><br>\nRequired Technical and Professional Expertise\n\n<ul>\n<li>5-10 years as a writer/storyteller demonstrating relevant success</li><li>Proven ability to project manage, multi-task, and publish content with many projects in motion and multiple stakeholders and SMEs.</li><li>Demonstrated ability to be data-driven, to constantly monitor and optimize/test performance from engagement to pipeline. Experience in using modern trackig and reporting tools.</li><li>Demonstrable skills in working with complex projects across matrixed teams</li><li>Working knowledge of Microsoft Office tools and video editing tools</li><li>Demonstrated ability to collaborate with marketing and business teams including product management, sales, tech sales, engineering</li><li>Ability to deeply understand and profile target buyers their needs, wants, beliefs, as well as how they learn about cutting edge technology and what type of content engages them.</li>\n</ul>\n\nPreferred Tech and Prof Experience<br>\n\n<div>N/A</div>\n<br>EO Statement\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br><br>"}