{"job title": "Watson Health Data Scientist", "company": "IBM", "city state": "– Washington DC&nbsp;", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br>\n<strong>Preferred location for this role in Boston, MA. New York, NY or Nashville, TN.</strong>\n<br><br>\nThe <strong>Watson Health Data Scientist</strong> role is to ensure that formative and summative data collected in research and evaluation activities of the Watson Health Center for Research and Evaluation meet high quality standards for accuracy, validity, reliability, use and stewardship (e.g. data management process and compliance). This professional will develop processes and systems for collecting, compiling, curating, analyzing and maintaining all research data and data repositories. The position requires close and effective collaboration and partnership with the Center's research teams and projects, external research partners and other users including IBM Watson Health senior management, market segment leaders and offering managers.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n<ul>\n<li>Data management system (DMS); design, develop, test, implement and operate a DMS to:\n\n<ul>\n<li>collect, document and transform data</li><li>organize, curate, analyze, and represent data to meet user requirements</li><li>store, secure and maintain data and information repositories</li><li>comply with Regulators' and IBM data protection, privacy, reporting/audit requirements</li><li>oversee all internally and externally sourced data management</li></ul></li>\n<li>Data collection: support researchers in study design, execution and analysis to assure accurate collection, recording and reporting of data</li><li>Data reporting:\n\n<ul>\n<li>design, standardize and deliver data for visuals (e.g. tables, graphs, .pptx decks, infographics) required for scientific publications and presentations</li><li>design, update and report relevant results to researchers, management and other stakeholders</li></ul></li>\n<li>Software development: for clinical data testing systems</li><li>Training team on the software developed to allow future use and growth</li>\n</ul>\n\n<strong>Essential knowledge and skills:</strong>\n\n<ul>\n<li>Critical thinking, problem solving and organization skills</li><li>Data management systems knowledge and expertise</li><li>Knowledge of biomedical and clinical research processes</li><li>Knowledge of health data sources and data management</li><li>Knowledge of health care delivery including work flows and settings, health outcomes and measurement, health IT, health economics, research publication processes</li><li>Highly developed teaming and partnership skills involving researchers, developers, designers and executive management</li><li>Demonstrated scientific writing and verbal communication skills</li><li>Knowledge of biomedical and clinical research processes</li><li>Skilled at managing and coordinating multiple high priority projects and tasks</li>\n</ul>\n\nRequired Technical and Professional Expertise\n\n<ul>\n<li>Masters or PhD in data science, biostatistics, health services administration, engineering</li><li>Two or more years in a lead role in clinical data management and systems development with a broad understanding of major trends in health data sources, clinical research, health IT</li><li>Experience with clinical informatics or biomedical informatics highly desirable</li><li>Two or more years of experience working in industry in a variety of health data analytic roles</li><li>Three or more years of academic or industrial experience in clinical research, with a focus on data analytics, management and scientific publication</li>\n</ul>\n\nPreferred Tech and Prof Experience\n\n<ul>\n<li>None</li>\n</ul>\n\nEO Statement\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br><br>"}