{"job title": "Finance Data Scientist", "company": "IBM", "city state": "– ROCHESTER, MN, US", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br>\nDo you have a passion for transformation and innovation? Are you ready to join the company that has become essential to the world driven by that same passion?\n<br><br>\nGet to know IBM: https://vimeo.com/165353494/165353494 (copy/paste into your browser)\n<br><br>\nIBMers dont stand still; we continually look to transform our company staying ahead of the ever-changing world we all live in. The IBM Rochester Minnesota Finance organization is instrumental in driving innovative improvements to global financial processes providing measurable value to the business. We lead and participate in worldwide cross-functional Finance teams with our peers in New York, Asia, Europe, Latin America and more. We will complement your skill set with our on-site classroom experiences and ample opportunities to work on Agile or Lean Six Sigma teams training provided! We offer dynamic exciting career paths allowing individuals to choose analytical paths, leadership paths, and a mix of both Join our new hire network group and enjoy creative social events sponsored by our own Finance climate group.\n<br><br>\nThe Finance Data Scientists objective is to help deliver innovative analytics solutions based on deep Business Intelligence, Big Data and insight reporting technologies. Act as a business consultant, data scientist and solution architect in support of IBM's INTERNAL customers. You will transform data into analytical solutions delivering business value and improved business outcomes. We are looking for an experienced professional with experience working with structured and unstructured data ideally in Finance decision support teams.\n<br><br>\n<strong>The business need:</strong>\n\n\n<ul>\n<li>Interpret rich data sources;</li>\n<li>Manage large amounts of data</li>\n<li>Merge data sources;</li>\n<li>Ensure consistency of data-sets;</li>\n<li>Create visualizations to aid in understanding data;</li>\n<li>Build deep, complex mathematical and statistical models using the data;</li>\n<li>Present and communicate the data insights/findings</li>\n<li>Discover relationships among elements in data sets</li>\n</ul>\n\nDiscover your true potential Be essential. Discover your true potential.\n<br><br>\nRequired Technical and Professional Expertise\n\n<ul>\n<li>At least 2 years of analytical experience</li>\n</ul>\n\nPreferred Tech and Prof Experience\n\n<ul>\n<li>Project management skills and leadership experience.</li>\n</ul>\n\nEO Statement\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br><br>"}