{"job title": "Data Scientist", "company": "IBM", "city state": "– RESEARCH TRIANGLE PARK, NC, US", "rating": "3.6", "job description": "<strong>Job Description</strong>\n<br>\nWe live in a moment of remarkable change and opportunity. Data and technology are transforming industries, society, and even the workplaceby creating professions that did not exist before the emergence of data, cloud, social, and mobile. As the largest technology and consulting employer in the world, IBM is a leader in this global transformation and just the place to continue your career.\n<br><br>\n<strong>Job Responsibilities</strong>\n\n<ul>\n<li>Understand clients needs and business requirements and help frame the business problem from technical perspectives.</li><li>Translated complex quantitative analysis into compelling and easily understandable and actionable business insights through visualization and other appropriate techniques.</li><li>Design end-to-end cognitive solutions and performance metrics based on business needs.</li><li>Collect data from various data sources and prepare the data by applying ETL (extraction, transformation, and loading) technologies.</li><li>Implement models and build end-to-end cognitive solution.</li><li>Evaluate model performance and help improve the models/pipelines/solutions.</li><li>Communicate with end users, SMEs (subject matter experts) and business stakeholders to showcase the solution, collect feedbacks and provide supports.</li><li>Help Data Engineers, Software Developers deploy the solution into production.</li><li>Maintain the solution and evolve the models.</li>\n</ul>\n\nRequired Technical and Professional Expertise\n\n<ul>\n<li>At least 5 years of experience in Data Science, Machine Learning.</li><li>At least 5 years (required) of hands-on experience in cognitive projects, data science projects, etc.</li><li>5 years experience with Statistics, Machine Learning, Deep Learning algorithms.</li><li>5 years experience with Big Data technology, e.g. Hadoop, Spark.</li><li>5 years experience with data visualization tools or libraries.</li><li>5 years experience with Python, or Java or Scala or R or SPSS.</li><li>5 years experience with SQL and experience in one or more ETL Tools.</li><li>5 yearsexperience using Source Control tools, e.g. Git and Github.</li><li>Understanding of Agile methodology.</li>\n</ul>\n\nPreferred Tech and Prof Experience\n\n<ul>\n<li>Understanding of best practices of DevOps is a plus.</li>\n</ul>\n\nEO Statement\n<br>\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n<br><br>"}