{"job title": "Rig Workover Planner / Data Analyst", "company": "IC Engineering Inc.", "city state": "– Bakersfield, CA", "rating": "NA", "job description": "Job Description<div><strong>Summary:</strong> \n<br>\nThe main function of the Workover Planner is to update and maintain the schedule for workover rigs in San Joaquin Valley Business Unit (SJVBU) Integrated Schedule. The current data flow to the schedule is inefficient and this role will have a key role in transforming the data flow to the desired state.\n<br><br>\n<strong>Responsibilities:</strong> \n\n\n<ul>\n<li>Maintain interface with Information Technology (IT) support and Chevron’s Primavera user network.</li>\n<li>Optimize the data flow to the Integrated Schedule; contribute actively to designing, testing and implementing solutions.</li>\n<li>Collaborate with “citizen developers” and IT to develop dashboards meeting customer requirements.</li>\n<li>Perform daily updates to workover jobs in integrated schedule.</li>\n<li>Provide timely and accurate reports by agreed upon deadlines.</li>\n<li>Perform sensitivity analysis on the schedule to assist in decision-making for plan changes.</li>\n<li>Analyze and critique project execution schedules to provide assurance of their accuracy.</li>\n<li>Facilitate schedule planning sessions with various functions including Drilling &amp; Completions, Permitting, Subsurface Optimization, and Facility Engineering teams.</li>\n<li>Organize and maintain planning / scheduling documentation in alignment with the SJVBU Integrated Schedule Plan.</li>\n<li>Work with project controls analysts to support value of work done and outlook preparation.</li>\n</ul>\n\n<strong>Skills:</strong> \n\n\n<ul>\n<li>4+ years of experience of related experience</li>\n<li>Previous experience with computer applications such as Primavera, Power BI, Power App, Salesforce.com, Microsoft Word, PowerPoint, Access, and Excel.</li>\n<li>Ability to analyze schedules and make value adding recommendations.</li>\n<li>Ability to accurately document and record customer/client information.</li>\n<li>Knowledge of data flow/workflow optimization methods and ability to support implementation.</li>\n<li>Experience with relational databases and back end linkages between systems of record.</li>\n<li>Verbal and written communication skills, attention to detail, problem solving and interpersonal skills.</li>\n</ul>\n\n<strong>Education/Experience:</strong> \n\n\n<ul>\n<li>College degree preferred.</li>\n</ul>\n\n<strong>Manager Notes:</strong> \n\n\n<ul>\n<li>This is meant to be a long term ongoing contract.</li></ul></div>Company Description<div>About us, IC Engineering is one of Chevron’s internal contracting groups. Over the last 25 years, Chevron has hired 50+ contractors to become permanent Chevron employees. IC currently has over 35 employees within the different Chevron operating companies worldwide.</div>\n"}