{"job title": "Senior Health Data Analyst/Scientist", "company": "ICF", "city state": "– Bethesda, MD", "rating": "3.6", "job description": "<p><u><b>Working at ICF</b></u></p><p></p><p></p>Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.<p></p><p></p><p><b>Health, Research, Informatics &amp; Technology</b></p><p><b>Bethesda, Maryland</b></p><p></p><p><u><b>Job Description</b></u></p><p>The Health, Research, Informatics &amp; Technology Division of ICF provides a broad range of services related to Biomedical Informatics support for the Dept. of Health and Human Services (HHS) in the DC–metro area. We are currently seeking an experienced, versatile Senior Health Data Analyst/Scientist to support a client project. The Senior Analyst/Scientist is responsible for extracting, converting, and analyzing common data elements for HIV/AIDS data. The goals of this project are to evaluate existing efforts that share de-identified patient-level HIV/AIDS human clinical studies (interventional trials or observational studies); analyze data for a cohort of HIV/AIDS patients in Electronic Health Record databases; and, design clinical research informatics solutions that provide optimal syntactic format and semantic terminology bindings for sharing HIV/AIDS trial data</p><p></p><p>This position requires being onsite daily at our client location in Bethesda, Maryland.</p><p></p><p><u><b>Key Responsibilities:</b></u></p><ul><li>Prepare programmatic scripts to validate, cleanse and import data from data providers into a secure database</li><li>Assess quality of imported data and fitness for purpose</li><li>Perform analysis on imported data for hypothesis generation and testing</li><li>Perform targeted analysis to compare data modeling and representation in data sources</li><li>Assist in project administration duties e.g., liaison with external entities, writing reports</li><li>Create basic R package that determines study feasibility</li><li>Analyze data that only are available in SAS format or in SAS environment</li><li>Conduct OHDSI Network study and coordinate data extraction and execution of this study from multiple sites in OHDSI network (using OHDSIRTools package).</li></ul><p> </p><p><u><b>Basic Qualifications: </b></u></p><ul><li>BS/BA Degree in Bioinformatics, Computer/Data Science, or related technical discipline and at least three (5) years of relevant experience. Master's degree preferred.</li><li>3 years of experience with SQL and relational databases</li><li>1 year of experience with SAS</li><li>3 years of hands on experience with one of the following programming languages: Java, Python, Perl and C.</li><li>Knowledge and experience in clinical data modeling, clinical data repositories, clinical data warehousing and clinical trials data</li><li>Knowledge and experience in data analytics and data research</li><li>Knowledge of clinical medicine and medical terminologies</li></ul><p></p><p><u><b>Preferred Qualifications:</b></u></p><ul><li>Experience with R is highly desirable (or willingness to learn R) in order to be able to follow R code and create R libraries (packages)</li><li>Familiarity with with XML and JSON schema, experience with software like Oxygen, Altova XML Spy or other similar tool</li><li>Experience in scientific publication</li></ul><p><u><b>Professional Skills:</b></u></p><ul><li>Excellent oral, and written communication skills</li><li>Excellent ability to document projects and provide status reports.</li><li>Excellent team and interpersonal skills. Ability to both take direction and work in a self-directed environment, effectively interact with all levels of staff and external contacts, and ability to work as an effective team member.</li><li>Excellent organization and time management skills, and flexibility to handle a variety of tasks, and adjust priorities as needed.</li></ul><p></p><p>ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. </p><p></p><p>ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)</p><p></p><p><u><b>Pay Transparency Statement: </b></u>For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf</p><p></p><p><b>Working at ICF</b></p><p>Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICF—together for tomorrow.</p><p></p><p><b>About ICF</b></p><p>ICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.</p><p></p><p></p><p></p>Maryland Client Office (MD88)<p></p><p></p>"}