{"job title": "Marketing Data Scientist", "company": "ICF", "city state": "– Fairfax, VA", "rating": "3.6", "job description": "Working at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you're seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICFtogether for tomorrow.\n<br><br>\n<strong>MARKETING DATA SCIENTIST</strong>\n<br><br>\nFairfax, VA\n<br><br>\nICF delivers the analytics, creativity, and digital innovation of a world-class marketing agency, amplified by domain expertise and resources of a leading international consulting firm. As we continue to drive market transformation for our energy sector clients, we seek a Marketing Data Scientist to help us develop best-in-class strategies and recommendations for our clients.\n<br><br>\nOur line of business owns private- and public-sector energy sector marketing accounts and oversees the marketing automation, paid media, demand generation, customer engagement, and marketing strategy functions within ICF's Commercial Energy service portfolio. The Marketing Team is responsible for generating customer awareness of and demand for clients' electric and natural gas utility programs through a wide range of marketing and communications channels such as organic search, search engine advertising, social media advertising and earned strategies, display advertising, broadcast media, direct mail, email marketing and earned media.\n<br><br>\nWe're seeking a Marketing Data Scientist who wants to perform a wide variety of data-driven tasks and is passionate about swimming in data to uncover actionable insights. For example, this person will own development of a lead forecasting model (i.e., how much of marketing performance is impacted by variables such as segmentation, media spend, promotions, program participation data, year-on-year trends, external variables, and macroeconomic factors). The Data Scientist will also own the modeling and forecasting of additional key marketing metrics. The outputs from these models will be used to develop marketing strategies and recommendations.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Statistical modeling -- develop models to describe the relationship between any business-relevant independent and dependent variables</li>\n<li>Marketing forecast development -- analyze all available existing data sets to determine which variables are more predictive of marketing awareness building and lead generation performance</li>\n<li>Analyze the effectiveness of marketing campaigns and tactics such as looking at CTR, conversion rates, open rates, and participation in programs</li>\n<li>Identification of opportunities for process improvement and innovative solutions to marketing analytics challenges</li>\n<li>Data cleansing/processing -- work with IT to create automated processes to ingest and cleanse data from multiple data sources, partners, and vendors</li>\n<li>Data management -- work with IT to develop and maintain databases that support marketing analysis.</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>MS/BS in a technical field: Economics, Statistics, Computer Science, Engineering or related discipline</li>\n<li>5+ years of experience in a combination of business intelligence / marketing analytic roles</li>\n<li>Strong demonstrated quantitative and qualitative research skills using standard statistical software such as SAS, R, Stata</li>\n</ul>\n\n<strong>Preferred Skills/Experience:</strong>\n\n\n<ul>\n<li>Experience with data visualization technologies, such as Tableau, a plus</li>\n<li>Strong organizational skills and customer service focus</li>\n<li>Experience in implementing and streamlining data processes, including marketing automation efforts plus experience with non-theoretical, \"messy\" datasets</li>\n<li>Ability to work collaboratively and cohesively in a team environment</li>\n</ul>\n\n<strong>Professional Skills:</strong>\n\n\n<ul>\n<li>Excellent listening, written, and oral communication skills paired with an excellent sense of humor</li>\n<li>Ability to exercise independent judgment while effectively prioritizing and executing tasks while under pressure</li>\n<li>Builds and maintains relationships with users to ensure buy-in and adoption of processes andsolutions</li>\n<li>Strong analytical and problem-solving capabilities</li>\n<li>Team player with the ability to work in a fast-paced environment</li>\n</ul>\n\nICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.\n<br><br>\nICF is an equal opportunity employer that values diversity at all levels. (EOE Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)\n<br><br>\nPay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\n<br><br>\nYou may be required to participate in periodic drug testing and background checks.\n<br><br>\nAbout ICF\n<br><br>\nICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.\n<br><br>\nFairfax, VA (VA01)"}