{"job title": "Statistician/Data Scientist", "company": "ICF", "city state": "– Golden, CO", "rating": "3.6", "job description": "<u><strong>Working at ICF</strong></u><br><br>Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.<br><br><strong>Commercial Energy Division</strong>\n<br><br>\n<strong>Innovation and Customer Engagement</strong>\n<br><br>\n<strong>Golden, Colorado</strong>\n<br><br>\n<strong><strong>About ICF International</strong></strong>\n<br><br>\nThe ICF International (NASDAQ:ICFI) Commercial Energy Division partners with commercial energy clients to deliver professional services and technology solutions related to energy management and energy efficiency programs. The firm combines passion for its work with industry expertise and innovative analytics to produce compelling results throughout the entire program life cycle, from research and analysis through implementation and improvement. Since 1969, ICF has been serving government at all levels, major corporations, and multilateral institutions. More than 3,500 employees serve these clients worldwide. ICF's Web site is www.icfi.com.\n<br><br>\n<strong><u><strong>Job Description:</strong></u></strong>\n<br><br>\nThe Commercial Energy Division at ICF International is growing and we have an immediate need for a Statistician and Data Scientist who will be responsible for doing data research, recommending and implementing advanced statistical and computational methodologies, and integrating these analyses into supporting IT systems to drive business objectives. The job involves the analysis of large customer, energy, and marketing datasets in order to identify appropriate statistical methodologies, develop code (primarily using R), run the analyses, perform output quality control, and create technical reports. The individual will work with other computer scientists, data researchers, and business stakeholders to leverage supporting technology systems within a dynamic and fast paced environment.\n<br><br>\n<strong><u><strong>Key Responsibilities:</strong></u></strong>\n<ul>\n<li>Work with Data Engineers to perform exploratory data research and analysis by manipulating, combining, and refining large data sets in SQL Server</li><li>Identify and implement appropriate statistical analyses and models to provide actionable conclusions on energy, customer, and marketing data</li><li>Establish scalable, repeatable, and automated statistical models primarily with R and in some cases other common statistical packages</li><li>Document methodology, code, output, and processes of modeling activities for technical reports</li><li>Track and quantify effectiveness of procedures and analytical models</li><li>Take an approach with repeatability, transparency, and time efficiency in mind</li><li>Work with software engineering to integrate models into quantitative software solutions<br><br><strong><u><strong>Basic Qualifications:</strong></u></strong></li>\n</ul>\n\n<ul>\n<li>BS/BA in a technical field: Engineering, Science or IT related discipline</li><li>MA in Statistics or Mathematics</li><li>Expert in R statistical language and programming</li><li>Have an understanding and desire to do energy, demographic, and marketing data research and modeling</li><li>Working knowledge of T-SQL and SQL queries</li>\n</ul>\n<strong><u><strong>Additional Preferred Skills/Experience:</strong></u></strong>\n<ul>\n<li>Experience working in a Microsoft technology environment</li><li>Experience with large data systems within a software development lifecycle</li><li>Experience with regression analyses often used in marketing research</li>\n</ul>\n<strong><u><strong>Professional Skills:</strong></u></strong>\n<ul>\n<li>Excellent listening, interpersonal, written, and oral communication skills</li><li>Highly self-motivated and directed</li><li>Able to exercise independent judgment</li><li>Builds and maintains relationships with users to ensure understanding of analyses performed</li><li>Strong organizational skills with ability to effectively prioritize and execute tasks while under pressure</li><li>Ability to effectively work in a diverse team of technologists and business stakeholders</li>\n</ul>\nICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.\n<br><br>\nICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)\n<br><br>\nReasonable Accommodations are available for disabled veterans and applicants with disabilities in all phases of the application and employment process. To request an accommodation please email icfcareercenter@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. Read more about non-discrimination: EEO is the law and Pay Transparency Statement.\n<br><br>\n<strong>Working at ICF</strong>\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICF—together for tomorrow.\n<br><br>\n<strong>About ICF</strong>\n<br><br>\nICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.<br><br>Golden, CO (CO15)"}