{"job title": "Senior HR Data Analytics - Talent Acquisition", "company": "ICF International, Inc", "city state": "– Fairfax, VA", "rating": "3.6", "job description": "Working at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you're seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICFtogether for tomorrow.\n<br><br>\nDo you have a passion for data analytics and reporting, and have experience in Talent Acquisition and Human Resources? We are building out our Human Resources Operations team and seeking a talented\n<br><br>\nSenior People Analytics - Senior HR Data Analyst who can design, develop and support dashboards and reports for our recruiting and Talent Acquisition team. We have recently implemented Workday and this role will be critical to help lead activities and collaborate with Business Leaders as well as Talent Acquisition team to capture, analyze and report on trends in the recruiting department. We need your expertise using tools such as Tableau to help our leaders and team members visualize and understand the data.\n<br><br>\n<strong>What you will do:</strong>\n\n\n<ul>\n<li>Work proactively and independently with Talent Acquisition leaders to perform analysis of relevant metrics, uncover and interpret trends in data, and provide recommendations.</li>\n<li>Communicate analytical findings to non-technical audiences in a way that influences Talent Acquisition leadership on decision making.</li>\n<li>In partnership with our Learning &amp; Development team, develop training and support materials to inform Talent Acquisition leadership and business stakeholders.</li>\n<li>Aggregate Talent Acquisition reports and provide other ad-hoc analytics</li>\n<li>Create regular and ad-hoc reports, data mining, data consulting and other data analysis as needed.</li>\n</ul>\n\n<strong>What you need:</strong>\n\n\n<ul>\n<li>Bachelor's Degree or equivalent. (Math, Statistics, Computer Science, Engineering, Data Science, Operations Research, Industrial Organizational Psychology)</li>\n<li>5+ years of related experience developing predictive models that drive business decisions and improve business outcomes</li>\n<li>Experience with data analysis software tools (Tableau preferred), using SQL queries</li>\n<li>Experience with Workday HCM a plus prefer knowledge of Recruiting module</li>\n<li>Great attitude with a passion for data and motivation to develop solutions</li>\n</ul>\n\nICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.\n<br><br>\nICF is an equal opportunity employer that values diversity at all levels. (EOE Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)\n<br><br>\nPay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\n<br><br>\nWorking at ICF\n<br><br>\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICFtogether for tomorrow.\n<br><br>\nAbout ICF\n<br><br>\nICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.\n<br><br>\nFairfax, VA (VA01)"}