{"job title": "Big Data/Machine Learning Engineer ? Lead", "company": "Iconma, L.L.C.", "city state": "– Vienna, VA", "rating": "3.4", "job description": "Big Data/Machine Learning Engineer Lead\n<br><br>\nLocation: Vienna, VA/ Remote\n<br><br>\nDuration: 3 months\n<br><br>\n<strong>Description:</strong>\n\n\n<ul>\n<li>Collaborating as part of a cross-functional Agile team to create and enhance software that enables state of the art, next generation Big Data &amp; Fast Data applications.</li>\n<li>Building efficient and scalable storage for structured and unstructured data.</li>\n<li>Developing and deploying distributed computing Big Data applications using Open Source frameworks like Apache Spark, Apex, Flink, Nifi, Storm and Kafka on AWS Cloud</li>\n<li>Building and running large-scale NoSQL databases like Elasticsearch and Cassandra.</li>\n<li>Utilizing programming languages like Java, Scala, Python.</li>\n<li>Designing and building applications for the cloud (AWS, Azure, GCP, DO)</li>\n<li>Leveraging DevOps techniques and practices like Continuous Integration, Continuous Deployment, Test Automation, Build Automation and Test-Driven Development to enable the rapid delivery of working code utilizing tools like Jenkins, Maven, Nexus, Chef, Terraform, Ruby, Git and Docker.</li>\n<li>Performing unit tests and conducting reviews with other team members to make sure your code is rigorously designed, elegantly coded, and effectively tuned for performance</li>\n<li>B.A./B.S. in Computer Science of related technical discipline</li>\n<li>3+ years of professional programming experience in Java, Scala, Python, C++, or Golang</li>\n<li>3+ years of professional experience working on data streaming (Apache Spark, Flink, Storm, and/or Kafka) or data warehousing (Snowflake Analytics, Presto, AWS Athena, AWS Redshift) applications.</li>\n<li>2+ years working with Linux-based OSes (Red Hat preferred)</li>\n<li>2+ years working with scripting languages (Shell, Python, Perl)</li>\n<li>Experience working within cloud environments (AWS preferred)</li>\n<li>Experience with streaming analytics, complex event processing, and probabilistic data structures.</li>\n<li>Experience with columnar data stores and MPP</li>\n</ul>"}