{"job title": "Scientist", "company": "Iconma", "city state": "– Carlsbad, California", "rating": "3.4", "job description": "<strong> Description:</strong> <li> When candidate is a part of the team at Client, candidate will do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Candidate work will have real-world impact, and candidate will be supported in achieving your career goals.</li>\n\n<strong>How will candidate make an impact:</strong>\n<br>\nManager is seeking a creative and motivated Scientist III to join our rapidly growing genome engineering team. The candidate will be responsible for developing new products and will work closely with cross-functional teams including Bioinformatics, Marketing, Technical Service and/or Operations.\n<br><br>\n<strong>What will candidate do:</strong>\n<br>\nSuccessful candidates will have a strong molecular biology experience with a background in protein engineering applications including hands-on experience in protein purification, protein expression, and functional protein activity screens. The candidate will work independently in a fast-paced environment with very supportive teammates.\n\n\n<ul>\n<li>Independently designs experimental plans, analyzes experimental data, generates laboratory protocols, and writes technical reports, quantitative analyses, and product summaries</li>\n<li>Troubleshoots and solves difficult problems in the design/execution of development projects</li>\n<li>Investigates, creates, and incorporates new methods and technologies to improve the effectiveness of development workflows</li>\n<li>Maintains accurate lab notebook to support protection of intellectual property in accordance with relevant client required standards</li>\n<li>Presents data at scientific conferences (external and internal)</li>\n<li>Interacts closely with other internal departments (i.e., Marketing, Business Development, Quality, Operations and/or Technical Services)</li>\n<li>Complies with all company safety, training, and quality regulations</li>\n</ul>\n\n<strong>How will candidate get here:</strong>\n<br>\nA PhD with 1 plus years of relevant experience or a master's degree in Molecular Biology, Biochemistry, Genetics, or a related discipline and 3 plus years of lab experience is required. Protein evolution/characterization experience is preferred. Prior industrial experience is desirable.\n\n\n<ul>\n<li>Protein evolution (screens, library design, analysis)</li>\n<li>Protein experience (AKTA)</li>\n<li>Strong cloning experience (standard cloning, PCR, mutagenesis, sequencing)</li>\n<li>Experience with cell culture (sterile technique, maintaining cell lines, transfecting mammalian cell lines)</li>\n<li>Experience with protein functional analysis (Activity assays, western blots, immunocytochemistry)</li>\n</ul>\n\n<strong> Knowledge, Skills, Abilities:</strong> <li> Experience with bacterial screening systems</li> <li> Background in genome engineering or protein characterization</li> <li> Proven proficiency in data analysis, research design, troubleshooting, and the evaluation of new techniques and procedures for manufacturing reagents, systems, products or technologies</li>\n\n<strong> Skill/Experience/Education</strong>\n<br>\n<strong>Mandatory:</strong>\n<br>\nScientist III\n<br><br>\n<strong>Desired:</strong>\n<br>\nContingent Hourly (CWHR)-TEM.CWHR. A00"}