{"job title": "Senior Data Analyst", "company": "Iconma, L.L.C.", "city state": "– Mclean, VA", "rating": "3.4", "job description": "Senior Data Analyst\n<br><br>\nLocation: McLean, VA\n<br><br>\nDuration: 6-7 months\n<br><br>\n<strong>Description:</strong>\n\n\n<ul>\n<li>Analyzing business requirements and convert them in to data mapping for ETL development.</li>\n<li>Provide expert level capability for data analysis required to translate requirements to detailed rules.</li>\n<li>Provide peer reviews, tasks, and day-to-day support to others on the analyst team</li>\n<li>Reviewing technical designs to ensure accurate and complete translation of business requirements into detailed system level requirements</li>\n<li>Writing system-level requirements per the selected methodology functional process models, user stories, software requirement specifications</li>\n<li>Analyzing business requirements to independently convert them into detailed system requirements and functional specifications</li>\n<li>Providing input into proposed solutions, identify impacts, risks and issues, and work with technical and business staff to implement proposed solutions</li>\n<li>Assist in providing or facilitating the resolutions to an extensive range of complicated problems.</li>\n<li>Prioritizing assignments and working independently to ensure work is completed on schedule, within budget, and meets customer expectations</li>\n</ul>\n\nKey to success in this role\n\n\n<ul>\n<li>Strong analytical mindset and process skills</li>\n<li>Ability to work with data to create rules for in ETL process.</li>\n<li>Ability to work in a dynamic, rapidly changing environment</li>\n<li>Ability to elicit, analyze, document, and validate the system requirements that support the business requirements for the systems supported</li>\n<li>Strong verbal and written communication skills</li>\n<li>Ability to develop mutually beneficial relationships with both technical and business teams</li>\n<li>Demonstrates customer service and intrapersonal best practices</li>\n<li>Ability to work independently and with business partners at various levels of the organization</li>\n<li>Works under minimal supervision. Able to provide technical guidance to the team.</li>\n<li>Good communication and team player.</li>\n<li>Strong written and oral communications skills.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's degree in Computer Science or related area of study or equivalent combination of education and/or relevant work experience</li>\n<li>5 years' experience with system requirements</li>\n<li>5 years' experience supporting key business applications</li>\n<li>5 Years of strong SQL experience</li>\n<li>5 Years' experience in Data mapping and ETL process development</li>\n<li>Capable and willing to receive work direction from direct and indirect leadership</li>\n<li>Strong analytical and technical problem-solving skills</li>\n<li>Ability to develop decision criteria and unbiased technology comparisons</li>\n</ul>\n\nPreferred Skills\n\n\n<ul>\n<li>Prior Mortgage-banking industry experience a strong plus</li>\n<li>Graduate degree or advanced studies</li>\n<li>Experience with DOORS and Version One</li>\n<li>Experience with ETL tools</li>\n<li>Excellent analytical, comprehension, communication, writing, and interpersonal skills</li>\n<li>Education Level: Bachelor's degree</li>\n<li>Years' Experience: 4</li>\n</ul>\n\nCompetency Description Proficiency Years' Experience\n<br><br>\n100255 Business Analysis Medium 3 - 5 Years\n<br><br>\n101525 SQL High 5 - 7 Years"}