{"job title": "Senior Research Data Scientist - St.", "company": "Iconma", "city state": "– Saint Louis, Missouri", "rating": "3.4", "job description": "<strong> Description:</strong> <li> Client has an opportunity available for a Research Data Scientist to join our Global IT Analytics team within R&amp;D IT. The R&amp;D IT organization works directly with client scientists to develop software platforms that enable cutting-edge research and development to revolutionize plant breeding and biotechnology, optimize supply chain logistics and deliver best customer experience. This position will support the Facility platform within client.</li> <li> The responsibilities of this position include development of research strategies for discovery projects in the Facility platform. The successful candidate will use the latest mathematical innovations to propose R&amp;D software solutions that accommodate emerging trends in data quantity and quality. The Research Data Scientist will design and test algorithms and conduct prototyping to evaluate possible scenarios leveraging computational and statistical techniques for the development of novel approaches for high-throughput data analyses. The successful candidate will have the opportunity to work collaboratively with interdisciplinary scientists internal and external to client, organize challenging problems, develop new solutions, and work with business &amp; development teams to ensure these solutions deliver value.</li>\n\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>PhD in Mathematics, Statistics, Computer Science, Engineering or an analytical discipline</li>\n<li>Experience with statistical modeling and data mining of various types of data, in particular geospatial data, time-series data.</li>\n<li>Experience analyzing and presenting complex data and proven problem-solving abilities</li>\n<li>3+ years of experience with Statistical and Mathematical programming packages (Python, R, Matlab)</li>\n<li>Strong publication record in leading scientific journals</li>\n<li>Strong organizational, interpersonal, and written communication skills</li>\n<li>Excellent learner, and ability to prioritize multiple tasks to meet deadlines</li>\n<li>Ability to work in a matrix environment, leading &amp; influencing people at varying levels of responsibility</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Proficiency in Bayesian and Spatio-Temporal Statistical Modeling</li>\n<li>Proficiency in Machine learning algorithms and concepts</li>\n<li>Experience working with agricultural/biological scientific data is highly desired</li>\n<li>Drive for translating business problems into research initiatives that deliver business value</li>\n<li>Creativity in defining challenging exploratory projects</li>\n</ul>\n\n<strong>Additional Info:</strong>\n\n\n<ul>\n<li>Will work directly with the manager everyday</li>\n<li>New development work.</li>\n<li>This is position is part of a 5+ year old team of ~35 multi-disciplinary Data Scientists.</li>\n</ul>\n\n<strong> Highest Education:</strong>  <li> PhD in an analytics discipline.</li>\n\n<strong>Must Haves:</strong>\n\n\n<ul>\n<li>Ph.D. in an analytics discipline with hands on experience working with real world data. Or Master's Degree in an analytics discipline with 3+ years of post-grad school experience.</li>\n<li>Strong background in statistics and machine learning.</li>\n<li>Prior programming experience in Python and R</li>\n</ul>\n\n<strong>Nice To Haves:</strong>\n\n\n<ul>\n<li>Strong publication record in leading scientific journal</li>\n<li>Proficiency in Bayesian and/or Temporal Statistical Modeling</li>\n</ul>"}