{"job title": "Data Scientist", "company": "Ideal Concepts, Inc.", "city state": "– Allentown, PA, United States", "rating": "3.7", "job description": "We are seeking a talented data scientist with a desire to become a part of a rapidly growing health insurance marketing and technology company.\n<br><br>\nIdeal Concepts, Inc. an Inc. 5000 company and a 2017 Top Workplace In Lehigh Valley, is seeking a talented data scientist with a desire to become a part of a rapidly growing health insurance marketing and technology company. We have become a national leader in health insurance sales, and we would like to continue expanding our reach across the country.\n<br><br>\nIdeal Concepts’ rapid growth necessitates an expanded marketing department. We are looking for a full time data scientist to help us make smarter decisions using existing performance data. The right candidate will be a vital part of all marketing efforts and will act as the data that supports marketing decisions. He/she will be primarily focused on data mining, statistical analysis, and projection modeling.\n<br><br>\nWe are looking for a self-motivated, highly analytical, experienced, and intelligent team player who is highly invested in the success of the company. The right candidate will fit into the existing company culture and will hold themselves responsible and accountable for the performance of all marketing channels.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Conducting regular statistical analysis across multiple marketing channels</li><li>Extending our data via reputable third party sources</li><li>Processing, cleansing, and verifying the integrity of data used for analysis</li><li>Aiding in proprietary algorithms and machine learning models</li><li>Preparing timely, actionable reports centered on return on investment (ROI), cost per acquisition (CPA), conversion/close rate, etc.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>3-5 years of business analysis experience a must</li><li>Experience with business intelligence tools</li><li>Basic understanding of the health insurance and Medicare industries a plus</li><li>B.A. degree in a relevant field</li>\n</ul>\n<strong>Benefits:</strong>\n<ul>\n<li>15 PTO days</li><li>8 paid predetermined holidays</li><li>401K</li><li>Fully covered health benefits (%100 company contribution), including major medical, dental, vision, accident, critical illness and life insurance</li><li>Technology focused, fast paced working environment</li><li>Professional team atmosphere with motivated, career-driven professionals as co-workers</li><li>Expansion and growth with one of the top health insurance marketing companies in the nation</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}