{"job title": "Director of Data Science", "company": "Ideo", "city state": "– Palo Alto, CA", "rating": "3.7", "job description": "IDEO is in search of a Director who will lead the growth of our data science practice and global Design for Augmented Intelligence (D4AI) offering. This person will develop and manage a portfolio of work that sets the standard for how intelligent products, services, and systems are designed.\n<br><br>\nThe ideal person possesses deep expertise in data science and machine learning, and is a collaborative leader who creatively inspires and supports both internal and external teams in how data science can improve the human experience.\n<br><br>\nWhy is this role important for IDEO’s work?\n<br>\nYou will work as part of the IDEO leadership team on growing the Design for Augmented Intelligence (D4AI) offering. You will guide project teams to ensure technical craft excellence and push the boundaries for how we practice human-centered data science. You will also develop, manage and execute a business development strategy that recognizes the range of D4AI opportunities in the market. Your skill set is critical to our work because you have the ability to both cultivate client relationships and support the development of world class designers and data scientists.\n<br><br>\nWhere is this job?\n<br>\nAs D4AI is a new offering, the role involves establishing and growing the capability at the Palo Alto location. In service of global growth, we’re looking for leaders who are excited about being mobile, to work with and learn from our community around the world.\n<br><br>\nOnce here you will:\n<br>\nDrive conversations with prospective clients to understand their priorities, convey IDEOs process, and scope project proposals.\n<br>\nPush the boundaries for how data science shows up in designing intelligent products, services, and systems to improve the human experience.\n<br>\nCultivate partnerships with existing clients to unlock new opportunities for collaboration and impact through design.\n<br>\nInvest in the growth of our D4AI capabilities by supporting the learning and development of IDEO data scientists and the broader design community.\n<br>\nServe as a trusted advisor to our clients and project teams by providing strategic level guidance, coaching and constructive critique in service of delivering world class design.\n<br>\nShare data science techniques and approaches with other designers—from the data science discipline to interaction design, software design, and beyond\n<br>\nRepresent IDEO externally through speaking engagements, writing, and other media opportunities to build the brand and tell IDEO stories.\n<br>\nBuild, maintain, and share a strong internal and external network.\n<br>\nWhat does IDEO offer you?\n<br>\nIDEO is a place unlike any other. It’s a place where you can solve diverse challenges for our clients and the organization, alongside thoughtful individuals who lead with curiosity, empathy, and optimism. Sure we work hard, but we also craft moments that allow our community to pause, create, and connect. We encourage our community to bring their whole selves to work, respect the need for work-life balance, and allow for autonomy in the design process and your career.\n<br><br>\nRelevant experience and mindset:\n<br>\nMastery in the fields of data science / machine learning / artificial intelligence\n<br>\nDemonstrated experience developing and leading client relationships and building lasting partnerships\n<br>\nDemonstrated experience managing project teams that apply data science skills and ideas\n<br>\nDemonstrated experience supporting the learning and development of individuals, especially helping data scientists develop their technical skills\n<br>\nDemonstrated experience in project scoping, including crafting and evolving proposals that describe data science deliverables\n<br>\nDemonstrated experience critiquing technical work to inspire others to excel\n<br>\nExcellent written and verbal communication skills in both internal and external capacities\n<br>\nA proactive, creative problem solving mindset and can thrive in a highly collaborative, fast-paced environment\n<br>\n<strong>Question about you:</strong>\n<br>\nWhat excites you about being a data science leader at IDEO?\n<br><br>\nEQUAL OPPORTUNITY EMPLOYER\n<br>\nIDEO is an equal opportunity employer; applicants are considered for all roles without regard to race, color, religious creed, sex, national origin, citizenship status, age, physical or mental disability, sexual orientation, marital, parental, veteran or military status, unfavorable military discharge, or any other status protected by applicable federal, state or local law."}