{"job title": "EHS Data Analyst Coordinator", "company": "IDEXX Laboratories, Inc.", "city state": "– Westbrook, ME", "rating": "3.3", "job description": "IDEXX is looking for an EHS Data Analyst Coordinator to assist in managing and conducting day-to-day compliance activities to ensure that the organization's operations are conducted in a manner consistent with ethical business practices, organization policies and legal requirements. This person will help to identify and establish compliance goals for assigned functions and/or lines of business. Interface with LOBs, ensure functional compliance and provide training and guidance as needed. Act as primary contact with applicable internal and external partners including government agencies.\n<br><br>\nWhat will I do?\n\n\n<ul>\n<li>Maintain knowledge of industry, legal and regulatory developments that affect the Company and informs management as appropriate. Ensures compliance with laws and regulations.</li>\n<li>As part of the global legal team, works closely together with all members of the team in managing general legal transactions/projects/programs, international law, compliance, employee relations, litigation, business development and other matters as needed.</li>\n<li>Develops understanding of Company's business operations and ongoing related legal issues in order to proactively identify and mitigate legal risks. Works with business and technical teams on a day-to-day basis to identify, analyze and propose solutions to legal issues.</li>\n<li>May support the development of department budget, policies and procedures. May be responsible for budget setting, monitoring and control.</li>\n<li>May work with and supervises outside counsel on various legal matters as appropriate. May assists the broader legal team in managing general commercial transactions, international law, litigation and other matters as needed.</li>\n<li>May manage staff, assign work, monitor activities, evaluate performance and manage escalated/critical issues. May administer employment actions, provide coaching and guidance to staff and promote staff training and development. Support the development and management of department policies and procedures. May mentor, train and coach others.</li>\n</ul>\n\nAm I Qualified?\n\n\n<ul>\n<li>Bachelors degree or equivalent combination of education and experience required.</li>\n<li>Expertise within related legal specialty area.</li>\n<li>Self-starter, with ability to work independently, initiates and coordinate projects and meet deadlines within a changing, fast-paced environment.</li>\n<li>Excellent problem-solving skills, sound judgment and strong interpersonal, presentation and communication skills.</li>\n<li>Attention to detail, handles confidential information with discretion and possesses a \"can do\" attitude.</li>\n<li>Strategic-thinker, goal- and team-orientated, able to handle difficult issues in a professional, assertive and proactive manner and history of developing cross-functional relationships with all levels of an organization.</li>\n<li>Practical, business-oriented approach to problem-solving, tempered by an appreciation of legal complexity and risk.</li>\n</ul>\n\nEOE/Minority/Female/Disabled/Veteran<br><br>SDL2017"}