{"job title": "Data Scientist", "company": "iHerb.com", "city state": "– Irvine, CA, US", "rating": "3.6", "job description": "<div><strong>Job Summary:</strong></div><div>\nThe Data Scientist works with the team of data scientists and engineers to gather and analyze data from various sources, spot trends and gain maximum insight for data-driven decision making, evaluate and identify points of improvement across iHerbs platform using rigorous analytical models, A/B testing, etc., and implement Machine Learning and AI enabled new products. At iHerb, we hire people with a broad set of technical skills who are ready to tackle challenging problems and make an impact on millions of users. Our data scientists not only bring about novel Machine Learning and Statistical models, they routinely work on scalability, efficiency, and availability of large-scale applications.</div> \n<br>\n<div><strong>Job Expectations:</strong></div><ul>\n<li>\n Solve challenging analytical problems, which requires working with large and complex data sets and applying analytical methods including machine learning and statistical approaches as needed.</li> \n<li>\nEnd-to-end analysis including data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations.</li>\n<li>\nPrototype and build analytical pipelines using various data sources to provide insights at scale.</li> \n<li>\nInteract cross-functionally with a wide variety of teams and work closely with them to identify opportunities to improve on iHerbs platform.</li>\n<li>\nDeveloping analytical solutions, forecasting, and optimization methods to improve the quality of iHerbs user experience. Areas include search quality, product recommendation, end-user behavioral modeling, user engagement, pricing, etc.</li>\n<li>\nMake business recommendations (e.g. cost-benefit, forecasting, experiment analysis) based on rigorous analysis.</li>\n</ul>\n\n<strong><div>Knowledge, Skills and Abilities:</div>\n<br>\n</strong>\n<br>\n<div><strong>Required:</strong></div><ul>\n<li>\nCoding Experience with one or more programming languages(Python, C#, Java, Scala)</li>\n<li>\nHands on experience with statistical modeling and machine learning software (. Python Statistical and ML libraries, R, Stan, etc)</li>\n<li>\nAdvanced knowledge of database query languages(SQL)</li>\n</ul>\n\n<div><strong>Experience Requirements:</strong></div><ul>\n<li>\nGenerally requires 5 years relevant experience in data analysis or a related field (Data Scientist, Machine Learning Engineer, Statistician, Etc...) and 2 years of relevant work experience in data analysis or related field. (e.g., as a Data Scientist, Statistician, etc.).</li>\n</ul>\n\n<div><strong>Education Requirements:</strong></div><div>\nM.Sc. degree in Computer Science, Statistics, Applied Mathematics or a related quantitative discipline required. Ph.D. highly preferred.\n<br><br>\n#LI-LZ1</div>"}