{"job title": "Array Assay Development: Scientist 1", "company": "Illumina", "city state": "– San Diego, CA", "rating": "4.2", "job description": "Summary\n<br><br>\nAs a Scientist 1 at Illumina, you will support innovative product development and on market product enhancements through the application of scientific principles and detail orientated troubleshooting skills. You will be a technical expert within a multi-disciplinary team working to evaluated feasibility of new, and sustaining current, high throughput market leading products for the Array platform offered by Illumina. You will help to develop, optimize and sustain Genotyping, methylation and copy number assays; as well as customer and manufacturing processes to maintain and expand Illumina's market share in the healthy screening (human and Ag.) and direct to consumer markets.\n<br><br>\nJob duties include but are not limited to:\n\n\n<ul>\n<li>Build a fundamental understanding of reagent formulations and physical / biochemical relationship to assay performance for Illumina's current and future Array based assays</li>\n<li>With minimal oversight Design, conduct, analyze, troubleshoot and present experiments to demonstrate feasibility of new methods and efficiently move products into the product development pipeline.</li>\n<li>Contribute to creative solutions to problems and actively participate in improving methods.</li>\n<li>Work with cross-disciplinary teams to optimize assay conditions and manufacturing / QC processes to achieve commercial levels of stability, robustness, and performance.</li>\n<li>Reduce scalability and robustness risks in production of Illumina's Array reagents for Genotyping, Methylation and Copy Number applications</li>\n<li>Support root cause determination, containment and corrective action verification and implementation to enable closures of ECI / CAPA within expected timeframes.</li>\n<li>Develop biochemical / analytical tools to QC critical components and finished goods.</li>\n<li>Develop standard test methods and Pugh matrices for Manufacturing and customer facing process and raw material design changes of varying scope and risk.</li>\n<li>Support collection and documentation of voice of customer feedback from key customers and translate these into design inputs to guide scope of work for proof of concept studies for new Array based assays.</li>\n<li>Evaluate feasibility of novel biochemical approaches to solve evolving market needs in the field of healthy screening (human and Ag.) and direct to consumer markets.</li>\n<li>Be able to successfully work cross functionally with and / or lead both internal and external, Scientists, RA's, Engineers, Bioinformaticians, SW and commercial personnel with different skills sets and approaches to troubleshooting/ product design, to implement robust and scalable solutions for production, QC and use of reagents supporting the Illumina Array workflows</li>\n<li>Take a leadership role on projects and guide technical areas independently.</li>\n<li>Analyze large complex datasets.</li>\n<li>Write reports and present results and project assessments to Senior Management.</li>\n<li>Perform other duties as assigned.</li>\n</ul>\n\nAll listed tasks and responsibilities are deemed as essential functions to this position; however, business conditions may require reasonable accommodations for additional task and responsibilities\n<br><br>\nEducation and Experience\n\n\n<ul>\n<li>Ph.D. or equivalent in applied biochemistry, molecular biology, genetics or related field.</li>\n<li>Postdoctoral or commercial product development experience, preferably in the genomic, biotech or medical device industries highly desired.</li>\n<li>Experienced in molecular biology methods for nucleic acid analysis and manipulation including purification, amplification, labeling, hybridization, etc.</li>\n<li>Proven track record in rational / hypothesis based experimental design, process and or workflow implementation, troubleshooting, and data analysis within the space of new product development and on market product improvement.</li>\n<li>Demonstrated ability to understand and define customer need (both internally and externally) and implement biomolecular solutions that meet their need in terms of data quality, scalability and cost effectiveness.</li>\n<li>Proven ability to think innovatively toward solving market and operational needs effectively, robustly and efficiently.</li>\n<li>Analytical, detail-oriented, organized, takes initiative, and self-motivated.</li>\n<li>Collaborative, open and self-aware, team player; able to able to rapidly integrate into cross functional teams to drive progress towards group and platform goals.</li>\n<li>Excellent verbal/written communication and interpersonal skills.</li>\n<li>Experience with various analysis tools for arrays and or next-generation sequencing analysis highly desirable.</li>\n</ul>\n\nPreferred Skills and Experience\n\n\n<ul>\n<li>Experience with transfer of new products to manufacturing and/or QC desired.</li>\n<li>DNA and/or RNA based genomic assay development with control materials and QC metrics.</li>\n</ul>\n\nIllumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}