{"job title": "Senior Scientist", "company": "Imagion Biosystems Ltd.", "city state": "– Albuquerque, NM", "rating": "NA", "job description": "Job Title: Scientist\n<br><br>\nReports to: VP of Research and Pre-Clinical Development\n<br><br>\nFLSA Stats: Full Time Exempt\n<br><br>\nJob Overview\n<br><br>\nImagion Biosystems, Inc. is looking for a motivated and experienced scientist to join our growing research and development team. This position will support a dynamic team focused on enhancing the functionality and in vitro/in vivo performance of the company's magnetic relaxometry technology platform. The scientist will establish and validate methods and protocols to synthesize, purify, and characterize bio-functionalized nanoparticles including polymer coating and subsequent conjugation of biological materials onto the nanoparticles. Additionally, this person will support Imagion Biosystems' customers and external collaborators and report on research activities through oral presentations and written reports and data summaries. The ideal candidate will be creative, self-directed, deadline-driven, detail-oriented, and comfortable working in an interdisciplinary team environment.\n<br><br>\nPrimary Duties and Responsibilities\n<br><br>\nThe polymer/conjugation chemist will be required to:\n\n\n<ul>\n<li>Contribute to the development of surface modification and functionalization strategies for the Company's iron oxide nanoparticles using polymer, antibodies and other targeting ligands.</li>\n<li>Undertake the development and characterization of new antibody and protein conjugation products using physical, chemical and cell based methods.</li>\n<li>Independently operate and analyze data obtained on a variety of analytical instrumentation such as UV/Vis spectrometer, HPLC, dynamic light scattering, thermogravimetric analysis, ELISA, gel electrophoresis, etc.</li>\n<li>Work with existing team members in a laboratory environment. May supervise 1+ research associate level scientists.</li>\n<li>Communicate results directly to supervisor through processed data tables as well as written and oral reports.</li>\n<li>Deliver oral presentations to internal colleagues as well as external collaborators and customers.</li>\n<li>Maintain and review laboratory notebooks.</li>\n<li>Maintain lab equipment and reagents.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Ph.D. with 5+ years of relevant experience with 3+ years industry experience in biotech/pharma.</li>\n<li>Expertise in polymer chemistry and antibody conjugation, such as EDC, maleimide chemistry, etc. is required. Previous experience of working with nanoparticles in particular iron oxide nanoparticles is highly desirable but not required.</li>\n<li>Good understanding of cancer biology with hand on experience in variety of in vitro and in vivo assay development.</li>\n<li>Critical thinking and problem-solving skills and the ability to analyze data and plan for next steps</li>\n<li>Ability to work in a fast-paced, dynamic, collaborative work environment.</li>\n<li>Ability to shift working style between carefully following standard procedures and exploring novel approaches.</li>\n<li>Effective oral and written communication skills.</li>\n<li>Good housekeeping skills to maintain a safe work environment.</li>\n<li>Detail orientation</li>\n<li>Proficiency in MS Word, Excel, Power Point, graphing software, etc.</li>\n</ul>\n\nTo apply for this position, please send a C.V. or résumé to HR@imagionbio.com.\n<br><br>\ndownload this job description"}