{"job title": "Data Scientist", "company": "Impact", "city state": "– Santa Barbara, CA", "rating": "3.9", "job description": "<p><strong>Our Company:</strong></p>\n<p>At Impact, our culture is our soul. We are passionate about our people, our technology, and are obsessed with customer success. Working together enables us to grow rapidly, win, and serve the largest brands in the world. If you are looking to join a team where your opinion is valued, your contributions are noticed, you get to work with fun and talented people solving cutting-edge marketing challenges with technology, and advance your career, this is the place for you. Impact operates globally with offices worldwide in Santa Barbara, San Francisco, Columbus, New York, London, Cape Town, and Sydney.</p>\n<p>Our company is transforming how advertisers handle media and performance marketing partnerships. Our integrated suite of products enables digital brands and agencies to maximize their return on global ad spend by providing a single trusted view into the consumer journey from ad impression through acquisition across all devices and channels.<strong><br> <br> Why this role is exciting:</strong></p>\n<p>As a Data Scientist, you are working on researching and building the next generation of algorithms for advertisers and major brands to optimize their marketing activity. The data science team works on research, design, and validation of new algorithms that forecast and optimize key performance indicators for leading brands in the digital marketing ecosystem.</p>\n<p><strong>Responsibilities</strong>:</p>\n<ul>\n<li>Define innovative methodologies to address product requirements</li>\n<li>Prototype and build scalable analysis pipelines</li>\n<li>Apply machine learning and artificial intelligence to build accurate predictive models</li>\n<li>Partake in our culture of personal accountability and ownership, peer review, and self-improvement</li>\n</ul>\n<p><strong>Does this sound like you?</strong></p>\n<ul>\n<li>BS in Economics, Applied Statistics, Computer Science or related field; MS or PhD preferred</li>\n<li>2+ years of applied experience with machine learning, AI, data mining or statistical work</li>\n<li>Demonstrated ability in choosing the right statistical approaches for a range of problems</li>\n<li>Desire to learn and adapt in a fast paced environment</li>\n<li>R, Python, SQL experience (with Hadoop, Spark) preferred</li>\n<li>Ability to find answers to complex business and industry questions using big data; produce and present high-impact research</li>\n<li>Knowledge of multivariate statistics and modeling techniques</li>\n<li>Knowledge of time-series and forecasting </li>\n<li>Knowledge of machine learning algorithms</li>\n<li>Knowledge of Economics</li>\n</ul>\n<p><strong>Benefits/Perks:</strong></p>\n<ul>\n<li>Medical, Dental and Vision insurance</li>\n<li>Generous vacation</li>\n<li>Flexible work hours</li>\n<li>Catered lunch every Friday, a healthy snack bar, and great coffee to keep you fueled</li>\n<li>Flexible spending accounts and 401(k)</li>\n<li>An employee-led culture team that plans our happy hours,</li>\n<li>Parties and other events to celebrate our many successes</li>\n<li>An established company with a cool, high velocity work ethos, where each person can make a difference!</li>\n</ul>\n<p><strong>Do you want to join our ever-growing team?</strong></p>\n<p>We'd love to hear from you at <strong><em>careers@impact.com</em></strong> and we will connect with you shortly.</p>\n<p><em>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p>"}