{"job title": "Data Scientist", "company": "Impiger Technologies", "city state": "– Richardson, TX", "rating": "4.6", "job description": "Data Scientist <div><div><strong>Location</strong>: Chennai\n<br>\n<strong>Experience</strong>: 5-8 Years\n<br>\n<strong>No. of Positions</strong>: 1\n<br><br>\n<strong>Roles and Responsibilities</strong>\n\n<ul>\n<li>Creating Insights and foresight based on given datasets, like Trend Analysis, Focus Areas, etc.</li>\n<li>Modeling data and creating models for forecasting techniques</li>\n<li>Technology skills of Python, R, Hadoop ecosystem, Spark, MongoDB or any No-SQL</li>\n<li>Analyze and create visualizations like Graphs, Plots, etc. based on data using D3.JS or any other visualization tools</li>\n<li>Predict the outcome of data by creating different Machine Learning Algorithms, using techniques like Linear and Logistic Regression, Decision Trees, etc.</li>\n<li>Creating data models and applying various validation measures to check the models before going to production and re-verifying the models over time</li>\n<li>Generating pre-learn models from existing data which also provides self-update of models</li>\n<li>Experience in creating algorithms and models like Churn Propensity, Cross Sell, Time Series type models, etc.</li>\n<li>Hands on experience in Analytics — deriving key business insights from data and in creating algorithms, implementing a solution based on the analysis.</li>\n<li>Building ML/predictive framework to draw insights at scale for different aspects.</li>\n<li>Prior practical experience in techniques like SVM, Predictive modeling, Self-learning systems</li>\n<li>Good business and communication skills with an ability to validate and scientifically prove hypotheses for a given business problem</li>\n<li>Prior experience in a product organization building data products is a plus</li>\n</ul>\n<strong>Desired Profile</strong>\n\n<ul>\n<li>Expertise in working with data platforms including large-scale data: SQL, Hadoop, PL/SQL, Pig, Hive</li>\n<li>Technical expertise in working with languages: R, Perl, Python, Java, Scala.</li>\n<li>Strong verbal and written communication</li>\n</ul>\n\n</div><br>\n\n<div> Mail your Resume to careers@impigertech.com</div></div>\n<br>"}