{"job title": "Lead Data Engineer", "company": "IMVU", "city state": "– Redwood City, CA", "rating": "3.1", "job description": "<strong>Lead Data Engineer</strong><br><br><strong>Redwood City, CA</strong>\n<br><br>\n<strong>Who we are:</strong>\n<br><br>\nIMVU envisions a world of deepening friendships through highly connective virtual shared experiences. Instead of posting past each other on Facebook or Instagram, IMVU user interactions are hyperpersonal - the experience is similar to the fidelity of face-to-face interaction, but at a heightened level, which enables users to find a meaningful connection like in the real world.\n<br><br>\nToday, we are studying ways to help people meet new friends and deepen their relationships. The essence of this work supports users making emotional connections and providing shared experiences that help them bond.\" IMVU currently has 4 million monthly active users (MAU) and is experiencing huge year over year growth on mobile - 91% on iOS and 62% on Android.\n<br><br>\n<strong>Team:</strong>\n<br><br>\nThe Data and Analytics team is focused on creating competitive advantage for IMVU and our customers through novel data infrastructure, metrics, insights and data services. We are a small but rapidly growing analysis and engineering team that builds and leverages state-of-the-art analytics systems. Our work informs decisions and direction for our business, while also impacting our products. The petabyte of data we store and the hundreds of GB of transactional data that we process each day provide a great opportunity to apply machine learning techniques to design powerful and meaningful experiences to our users.\n<br><br>\nWe are looking for a seasoned software engineer to not only build data pipelines to efficiently and reliably move data across systems, but also to build the next generation of data tools to enable us to take full advantage of this data. In this role, your work will broadly influence the company's products, data consumers and analysts.\n<br><br>\n<strong>You are GREAT at doing this:</strong>\n\n<ul>\n\n\t\n<li>As a Lead Data Engineer, you will be an integral member of our Data &amp; Analytics team responsible for design and development</li>\n\n\n\n<li>Partner with data analysts, product owners and data scientists, to better understand requirements, finding bottlenecks, resolutions, etc.</li>\n\n\n\n<li>You will be an SME for all things Big Data as well as mentor other team members.</li>\n\n\n\n<li>Design and develop different architectural models for our scalable data processing as well as scalable data storage</li>\n\n\n\n<li>Build data pipelines and ETL using heterogeneous sources</li>\n\n\n\n<li>You will build data ingestion from various source systems to Hadoop using Kafka, Flume, Sqoop, Spark Streaming etc.</li>\n\n\n\n<li>You will transform data using data mapping and data processing capabilities like MapReduce, Spark SQL</li>\n\n\n\n<li>You will be responsible to ensure that the platform goes through Continuous Integration (CI) and Continuous Deployment (CD) with DevOps automation</li>\n\n\n\n<li>Expands and grows data platform capabilities to solve new data problems and challenges</li>\n\n\n\n<li>Supports Big Data and batch/real time analytical solutions</li>\n\n\n\n<li>You will have the ability to research and assess open source technologies and components to recommend and integrate into the design and implementation</li>\n\n\n\n<li>You will work with development and QA teams to design Ingestion Pipelines, Integration APIs, and provide Hadoop ecosystem services</li>\n\n\n\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n\n\t\n<li>B.S. degree in Computer Science, Electrical and Computer Engineering, or equivalent technical fields.</li>\n\n\n\n<li>8+ years of experience over all</li>\n\n\n\n<li>5+ years of experience with Hadoop eco-system (HDFS, MapReduce, Hbase, Hive, Impala, Spark, Kafka, Kudu, Solr)</li>\n\n\n\n<li>Strong development/automation skills. Must be very comfortable with reading and writing Scala, Python or Java code.</li>\n\n\n\n<li>Proven Ability to build Curated Models for BI and Analytics</li>\n\n\n\n<li>Strong SQL Skills</li>\n\n\n\n</ul>\n<strong>Bonus Points:</strong>\n\n<ul>\n\n\t\n<li>Experience with Free-to-play/social games</li>\n\n\n\n</ul>\n<strong>About Us:</strong>\n<br><br>\nIMVU is a global 3D avatar-based social community of Millions of users and Thousands of creators who come together to celebrate the joy of shared experiences. Far beyond traditional social media, IMVU users create a whole new experience at the intersection of digital connection and face to face relationships. Instead of posting past each other on Facebook or Instagram, IMVU user interactions are hyperpersonal - experiencing the fidelity of face-to-face interaction at a heightened level and finding a meaningful connection like in the real world.\n<br><br>\nIMVU is where the real world comes to play. Today IMVU users enjoy the freedom to live the life they create through customizing highly-stylized avatars, connecting with friends in immersive chat rooms, shopping and stylizing new looks, sharing their experiences, and starring in their own animated emoji. IMVU is a powerful and collaborative world, which also offers an opportunity to make real money using proprietary design tools to create looks and rooms to sell in the IMVU Shop.\n<br><br>\nFounded in 2004 and based in the heart of Silicon Valley, IMVU is led by a team that's dedicated to pioneering the virtual reality industry. IMVU is backed by venture investors Menlo Ventures, Allegis Capital, Bridgescale Partners and Best Buy Capital.\n<br><br>\nIMVU has been recognized frequently as Best Place to Work in the Silicon Valley.\n<br><br>\n<strong>HOW TO APPLY</strong>\n\n<ul>\n\n\t\n<li>Please try out our core product before you apply. We'd like you to understand our products and have some understanding of our customers.</li>\n\n\n\n<li>Please include a cover letter. Make sure to discuss why you are interested in learning more about IMVU. Job applications without cover letters will not be considered.</li>\n\n\n\n</ul>\nIMVU is an equal opportunity employer; applicants are considered for all roles without regard to race, color, religious creed, sex, national origin, citizenship status, age, physical or mental disability, sexual orientation, marital, parental, veteran or military status, unfavorable military discharge, or any other status protected by applicable federal, state or local law."}