{"job title": "Data Engineer", "company": "Indeed", "city state": "– Austin, TX", "rating": "3.5", "job description": "<strong>Our mission:</strong>\n<br>\nAs the worlds number 1 job site, our mission is to help people get jobs. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for job seekers.\n<br><br>\n<strong>The team:</strong>\n<br>\nWe are a rapidly growing and highly capable engineering team building the most popular job site on the planet. Every month, over 200 million people count on us to help them find jobs, publish their resumes, process their job applications, and connect them to qualified candidates for their job openings. With engineering hubs in Seattle, San Francisco, Austin, Tokyo and Hyderabad, we are improving people's lives all around the world, one job at a time.\n<br><br>\n<strong>Your job:</strong>\n<br>\nAs a Data Engineer at Employer, your role is to deliver the information your business partners need to grow the business. You will assist business teams in drawing insights from our data. You are someone who wants to see the impact of their work and make a difference every day. You know what it takes to deliver quality reporting and business intelligence solutions to the organization. You understand the value and benefit of solid data practices and how to translate that into satisfied business partners.\n<br><br>\nYou are an experienced Software Engineer. You are skilled in extracting, transforming, and loading data. You are able to translate business requests into database design.\n<br><br>\nYou are someone who is passionate about data-driven approaches. You enjoy exploring large data sets and get excited about learning new technologies and learning in a collaborative environment. You are skilled at eliciting requirements from a wide range of different teams.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Create and manage data sources</li>\n<li>Integrate with diverse APIs</li>\n<li>Contribute to the ongoing development of the data warehouse ecosystem</li>\n<li>Work closely with stakeholders on the data demand side (finance, analysts, and data scientists)</li>\n<li>Work closely with stakeholders on the data supply side (domain experts on source systems of the data)</li>\n<li>Design and build optimized OLAP and Star Schema data structures</li>\n<li>Build self-monitoring, robust, scalable batch and streaming data pipelines for 24/7 global operations.</li>\n<li>Create highly reusable code modules and packages that can be leveraged across the data pipeline</li>\n<li>Develop and maintain data dictionaries for governance of published data sources</li>\n<li>Develop and improve continuous release and testing processes</li>\n<li>Elicit requirements from a wide range of different teams</li>\n</ul>\n\n<strong>About you:</strong>\n<br>\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Bachelor's degree in computer science, computer engineering, or an engineering discipline</li>\n<li>Strong CS fundamentals, problem-solving skills and software engineering skills</li>\n<li>5+ years industry experience in software development and/or data engineering</li>\n<li>Experience in a hands-on, data centric role with data engineering, streaming, or warehousing.</li>\n<li>Ability to communicate effectively with stakeholders to define requirements</li>\n<li>A strong ability to understand and organize data from various sources.</li>\n<li>Strong expertise in an object oriented language (preferably Python or Java)</li>\n<li>Strong SQL skills</li>\n<li>Experience in columnar relational data stores and NoSQL technologies</li>\n<li>Experience with big data tools such as Hadoop, Hive, Spark, etc, as well as knowledge of more traditional warehouses.</li>\n<li>Experience delivering data pipelines and managing resulting data stores using managed cloud services (like AWS or Google Cloud Services)</li>\n<li>Ability to identify and resolve performance and data quality issues</li>\n<li>Experience with modern data pipelines, data streaming, and real time analytics using tools such as Apache Kafka, AWS kinesis, Spark Streaming, ElasticSearch, or similar tools.</li>\n<li>Knowledge of machine learning tools and concepts a plus.</li>\n</ul>\n\nEmployer provides a variety of benefits that help us focus on our mission of helping people get jobs.\n<br><br>\n<strong>View our bounty of perks:</strong> [1] http://indeedhi.re/EmployerBenefits"}