{"job title": "Data Scientist", "company": "Independence Blue Cross LLC", "city state": "– Philadelphia, PA", "rating": "3.4", "job description": "Looking for a chance to show what you\n<br>\n can do in an environment that will appreciate you and help you grow? If\n<br>\n you are learning-oriented, strive for excellence, and have a strong customer\n<br>\n commitment, bring your talents to Independence Blue Cross as we seek to enhance\n<br>\n the health and well-being of the people and communities we serve. As a\n<br>\n member of Independence Health Group, we seek to innovate, reimagine and lead in\n<br>\n the transformation of healthcare. We are committed to attracting,\n<br>\n retaining and growing the best talent.\n<br><br>\nIndependence\n<br>\n Blue Cross is seeking a data scientist to work in our dynamic, industry leading\n<br>\n Advanced Analytics team of researchers, analysts, and other data scientists. Our\n<br>\n goal is to develop advanced analytics solutions and inform strategies and\n<br>\n decisions that allow us to provide best-in-class service to our members through\n<br>\n access to affordable, high-quality health care.\n<br><br>\nThe Advanced\n<br>\n Analytics team drives the full project lifecycle from consulting with the business\n<br>\n areas to understand their business needs, translating the business need into\n<br>\n predictive analytics, deploying models within the business, and conducting\n<br>\n evaluations of changes and interventions that were based on model outputs\n<br>\n (e.g., outreach interventions via text messages, Health Coach outreach calls,\n<br>\n product pricing, fraud, waste, and abuse and recoveries).\n<br><br>\nWe have a leading-edge\n<br>\n data warehouse and computing environment with a robust suite of analytic\n<br>\n software. The candidate will have access to a wide range of data sources and\n<br>\n will apply predictive modeling and machine learning techniques within a Hadoop\n<br>\n framework. This role will require frequent interaction with project\n<br>\n stakeholders and business partners at all levels of the organization and offers\n<br>\n the opportunity to provide thought leadership and direction for analytic\n<br>\n solutions that inform business decisions.\n<br><br>\nResponsibilities:\n<br><br>\n· Have or develop\n<br>\n subject-matter expertise related to a wide array of data including medical and\n<br>\n pharmacy claims, prior authorization data, EMR data, lab results, and marketing\n<br>\n data.\n<br><br>\n· Collaborate with internal business areas and subject matter\n<br>\n experts (SMEs) to understand critical business questions, goals, and objectives\n<br>\n and translate into business opportunities to be captured\n<br>\n through predictive analytics solutions.\n<br><br>\n· Play a lead role within a cross-functional team of business\n<br>\n stakeholders, SMEs, analysts, and other data scientists in developing\n<br>\n delivering predictive analytics solutions.\n<br><br>\n· Develop predictive models across a variety of business areas\n<br>\n (e.g., clinical, pharmacy, marketing, product, and fraud detection) and deliver\n<br>\n and solutions to stakeholders.\n<br><br>\n· Execute and manage\n<br>\n analytics projects from inception and design through delivery, implementation,\n<br>\n and evaluation.\n<br><br>\n· Create meaningful data\n<br>\n visualizations &amp; presentations to communicate findings in a way that\n<br>\n clearly links the business question to the analytic approach illustrates how\n<br>\n the results inform the business question.\n<br><br>\n· Test and learn new algorithms, models, software, and data\n<br>\n sources for continual improvement of quantitative solutions.\n<br><br>\n· Develop processes to implement feedback loops to improve\n<br>\n model quality over time.\n<br><br>\n· Drive proof of concept\n<br>\n tests of new data, software and technologies.\n<br><br>\n· Provides guidance to\n<br>\n other Health Analytics team members where relevant\n<br><br>\nTechnical Skills:\n<br><br>\n· Expertise in using SQL,\n<br>\n R, Python, Scala etc. to manipulate large data sets and develop statistical\n<br>\n models.\n<br><br>\n· Expertise in data\n<br>\n management and modeling in an Hadoop environment, including use of Hive and\n<br>\n Spark for parallelized processing\n<br><br>\n· Ability to perform\n<br>\n feature engineering (transformation, binning, high level categorical reduction,\n<br>\n etc.) and validation (hold-outs, CV, bootstrap)\n<br><br>\n· Demonstrated experience\n<br>\n using analytical techniques for predictive modeling, including linear\n<br>\n regression, logistic regression, survival analysis, GLM, tree models (Random\n<br>\n Forests and GBM), cluster analysis, principal components, and deep learning\n<br>\n neural network models.\n<br><br>\n· Strong expertise in\n<br>\n regularization techniques (Ridge, Lasso, elastic nets)\n<br><br>\n· Proficiency in data\n<br>\n visualization.\n<br><br>\n· Familiarity with or\n<br>\n participation in the OHDSI community and experience with the OMOP common data\n<br>\n model a plus.\n<br><br>\n· Knowledge of SOLR and\n<br>\n Hbase a plus\n<br><br>\nProfessional Skills:\n<br><br>\n· Must have a strong\n<br>\n customer focus, ability to work with internal clients and manage day-to-day\n<br>\n interactions with and expectations of business stakeholders\n<br><br>\n· Ability to lead\n<br>\n requirement gathering consultations with business stakeholders and translate\n<br>\n business needs into analytic problems.\n<br><br>\n· Strong understanding of\n<br>\n how analytic results inform or address a business problem or objectives and a\n<br>\n superior ability to communicate technical ideas and results to non-technical\n<br>\n clients in written and verbal form.\n<br><br>\n· Ability to lead projects in a team\n<br>\n environment, collaborating with various subject matter experts, management, analysts,\n<br>\n and other data scientist.\n<br><br>\nQualifications:\n<br><br>\n· Masters or PhD (preferred) in Statistics,\n<br>\n Mathematics, Computer Science, Data Science, Health\n<br>\n Economics, Epidemiology, Healthcare Informatics, or other relevant field\n<br>\n with additional coursework in machine learning, predictive\n<br>\n modeling and data management.\n<br><br>\n· 5+ years of work experience with health\n<br>\n care data analytics, statistical analysis, predictive modeling, machine\n<br>\n learning techniques, and visualization tools.\n<br><br>\n· Advanced knowledge of\n<br>\n health care industry, products, systems, business strategies and products\n<br><br>\n· Record of peer-reviewed\n<br>\n publications a plus."}