{"job title": "Data Analyst", "company": "Indiana University", "city state": "– Indianapolis, IN", "rating": "4.2", "job description": "The IU Simon Cancer Center is seeking an experienced Data Analyst. This position will collaborate with IUSCC administrative staff, principal investigators and their teams within the Cancer Center, research and administration personnel within the IUSCC CTO, and various representatives within the CTSI/IUSM/IU Health to determine requirements for the design and development of software solutions to support various data analytics, quality, and metric reporting. This position will often work independently from other application developers, and in those cases must oversee the entire life cycle of application development and provide regular progress reports to the clients. This position must interact effectively with internal infrastructure groups to leverage the resources required to meet the technical needs of the projects.\n<br><br>\nDuties and responsibilities include, but are not limited to:\n<br><br>\n*Perform report development, data analytics, quality assurance, data visualization, and data validation.\n\n\n<ul>\n<li>Some database maintenance and modification will be necessary.</li>\n<li>Gather and document functional and technical data analysis requirements and translate requirements into database, reporting, and visualization solutions. Develop in-depth understanding of underlying data, data structures, and business uses to ensure solutions meet client needs and are compliant with appropriate data compliance requirements. Work with vendors to understand code changes and/or upgrades that will impact solutions and modify/test as such.</li>\n<li>Create technical documentation of solution logic, processes, and overall summary. Create test case documentation and ensure accurate and complete testing. Document status and completion of requested solutions and maintain centralized listing of solution needs and priorities.</li>\n<li>Design, develop, program, test, and maintain complex operational and analytical solutions leveraging SQL, iReport, JasperReports, database enabled websites, Tableau, and other reporting technologies.\n<br><br>\n<strong>REQUIRED: Bachelor's Degree from an accredited institution in informatics, information technology, healthcare information technology or other field with an information technology enhanced degree such as healthcare, finance, business, or science, plus 2 years of professional experience.\n<br><br>\nA combination of related education and experience may be considered.</strong><br><br>Preferred Qualifications<br><br>Experience in a healthcare environment; knowledge of an EMR system; experience creating JasperReports or iReports. Familiar with responsive web design; user Interface development, HTML, CMS, PHP, CSS .NET; JavaScript - jQuery UI and AJAX; Adobe Photoshop; Illustrator; Flash; HTML e-mails, MySQL, LAMP, Experience with ASP.Net; Oracle and MSSQL Database<br><br>Working Conditions / Physical Demands</li>\n</ul>"}