{"job title": "Data Scientist", "company": "Infinity Consulting Solutions", "city state": "– Chicago, IL", "rating": "3.8", "job description": "DATA SCIENTIST Seeking an experienced Data Scientist to join a growing global organization. The Data Scientist will join a team that is focused on using company data to make strategic decisions. You will become an integral part of the Analytics Team which is responsible for building a unified platform to handle the various data analysis workloads across the company. Excellent communication and interpersonal skills are required as you will be working with key stakeholders across all business units to help design, build, and operationalize the strategic analytics objectives and drive projects. The main objective of the role and the team is to explore and understand customer data while building statistical models for both prediction and description of data for our customer. Responsibilities: Collaborate with Project Managers and business stakeholders to execute Analytics projects. This includes outlining specific deliverables, provide input to project plans and milestones. Analyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analyses Perform machine learning, natural language, and statistical analysis methods, such as classification, collaborative filtering, association rules, sentiment analysis, topic modeling, time-series analysis, regression, statistical inference, and validation methods Leverage data management processes and available infrastructure / Relation data sources/API tools to develop POC capabilities/solutions Work alongside ETL engineers to establish an analytics platform to be used across the business Use good software engineering practices (appreciate the importance of good coding practices to DS, unit testing, version control using git, code review) Ability to conduct large scale projects and research through all stages: concept formulation, definition of metrics, determination of appropriate statistical methodology, research evaluation, and final research report Mentor other team members as needed Qualifications MS/PhD in a quantitative field: computer science, econometrics, mathematics, statistics, analytics, or other related field 3+ years of professional experience as a Data Scientist 3+ years programming in R and/or Python Strong knowledge of database concepts and SQL Detailed knowledge on a range of analytical techniques (e.g. Supervised and Un-supervised machine learning techniques, graph data based analytics, statistical analysis, time series, geospatial, nlp, sentiment analysis, pattern detection to name a few) Good understanding of data manipulation/wrangling techniques Experience with command-line scripting, data structures and algorithms and ability to work in a Linux/Windows environment, processing large amounts of data in an on-premise and/or cloud environment Experience with Spark is desired Experience with h2o is preferred Experience with Alteryx is preferred Experience with Tableau or other data visualization tools is desired Familiarity with data warehousing concepts Familiarity with IBM DB2 and SQL Server (SSRS, SSIS, SSAS) databases. Familiarity with IBM SPSS and SAS tools for data exploration and mining is a plus Automate the model building process Good data modeling intuition Proven ability to influence and work with cross-functional teams. Significant skill required to work effectively across internal functional areas in situations where clear parameters may not exist. Strong work ethic and personal integrity; self-directed and self-motivated with a highly developed curiosity and willingness to learn and to teach. Excellent verbal and written communication skills as well as interpersonal and influencing skills; ability to define and capture business needs along with articulating strategic implications of analytic results with clarity and persuasiveness in an audience appropriate manner. - provided by Dice Algorithms, Analysis, API, Data Analysis, Database, Data Modeling, DB2, GIT, IBM, Linux, Management, Metrics, Modeling, Programming, Project, Python, Research, SAS, SQL, SQL Server, Statistical Analysis, Testing, Validation, Version Control, Windows\n<br>\nAssociated topics: data analytic, data engineer, data scientist, data warehouse, database, database administrator, etl, erp, sql, teradata"}