{"job title": "Senior Data Engineer", "company": "Infolob Solutions Inc", "city state": "– Santa Clara, CA", "rating": "4.0", "job description": "We are looking for<strong> Senior Staff Software Engineer- Data</strong> in<strong> Santa Clara, CA</strong>. Please go through the below details and let me know your interest. if you’re interested please send me your updated resume along with your available time to take the call.\n<br><br>\n<strong>Role: Senior Staff Engineer, Data</strong>\n<br><br>\n<strong>Location: Santa Clara, CA</strong>\n<br><br>\n<strong>Duration: 6 Months initial contract</strong>\n<br><br>\nDescription:\n<br><br>\nWe are looking for an experienced senior data engineer with software engineering skills to help us build critical data pipelines at massive scale, architect and build our big data warehouse and data mart systems, and develop models to facilitate real-time or near real-time applications, faster operational and historical analytics\n<br><br>\nResponsibilities:\n<ul>\n<li>Participate in the full development life cycle of Data Warehouse and Data Mart systems</li><li>Design and implement ETL frameworks for Data Warehouse system using technologies like Hive, Spark and Java</li><li>Design, build and launch scalable, extremely efficient and reliable data pipelines to move data (both large and small amounts from diverse sources) into and out of Data Warehouse and Data Mart systems</li><li>Design and implement data warehouse query engine, implement our proprietary cutting edge Hadoop-based data warehouse systems</li><li>Gather and document data mart reporting and other requirements to meet business needs</li><li>Define and promote best practices and design principles for data warehousing techniques and architecture, while improving data organization and accuracy processing through data governance framework</li><li>Monitor and troubleshoot performance issues on data warehouse and data mart servers</li>\n</ul>\n<strong>Desired Skills &amp; Experience</strong>:\n<ul>\n<li>5+ years working experience in data warehouse development and architecture. 4+ years of experience in Big Data, Data Warehouse or Large Scale Cloud systems</li><li>5+ years ETL development/operations/reporting from multiple sources, using appropriate tools</li><li>5+ years advanced SQL skills, including stored procedures, functions, indexes, and views</li><li>A track record of crafting, implementing and delivering scalable, performant data pipelines and data services</li><li>Expert level software development experience using Java and/or Python</li><li>Expertise with dimensional warehouse data models (star, snowflake schemas)</li><li>Deep knowledge and hands-on experience with relational databases (Greenplum and Oracle, MySQL/Postgres etc) and database schema design</li><li>Extensive experience with Hadoop, MapReduce/Yarn, Hive and HBase</li><li>Knowledge of automation and orchestration platforms such as Airflow</li><li>BS/MS Degree in Computer Science or related field</li><li>Excellent inter-personal and teamwork skills, having experiences working with oversea teams is a plus.</li></ul>\n\n\n<ul>\n<li>provided by Dice</li>\n</ul>\n\nData Engineer, ETL, Data Warehouse,Hive, Spark, Java, Hadoop, MySQL"}