{"job title": "Associate Data Scientist", "company": "Infosys", "city state": "– New York, NY", "rating": "3.3", "job description": "<div>Role Associate Data Scientist</div> <div> Auto req ID 37549BR</div> <div> Domain Analytics</div> <div> Skillset PYTHON ,</div> <div> Country USA</div> <div> State / Region / Province New York</div> <div> Work Location New York, NY</div> <div> Company ITL USA</div> <div> Job Description Infosys – DNA - Analytics - <strong>Senior Associate Data Scienctist</strong> - US\n<br><br>\nInfosys is a global leader in technology services and consulting. We enable clients in more than 50 countries to create and execute strategies for their digital transformation. From engineering to application development, knowledge management and business process management, we help our clients find the right problems to solve, and to solve these effectively. Our team of 200,000 innovators, across the globe, is differentiated by the imagination, knowledge and experience, across industries and technologies, that we bring to every project we undertake.\n<br><br>\nWanted: Global Innovators To Help Us Build Tomorrow’s Enterprise Using\n<br><br>\nAs a <strong>Senior Associate Data Scientist</strong>, you will significantly contribute to identifying best-fit architectural solutions for one or more projects; apply data science techniques to analyze large amounts of data, presenting data insights using high impact visualization, provide regular support/guidance to project teams on complex coding, issue resolution and execution. You will collaborate with some of the best talent in the industry to create and implement innovative high quality solutions, participate in Sales and various pursuits focused on our clients' business needs. You will be part of a learning culture, where teamwork and collaboration are encouraged, excellence is rewarded, and diversity is respected and valued.\n<br><br>\nLocation for this position can be: Dallas, TX, Fort Worth, TX, Chicago, IL, New York, NY. This role will require relocation and may require travel.\n<br><br>\nU.S. citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor at this time.\n<br><br>\n<strong>Qualifications</strong>\n<br>\nBasic\n\n\n<ul>\n<li>Bachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education.</li>\n<li>At least 4 years of experience in Information Technology.</li>\n</ul>\n\nPreferred\n\n\n<ul>\n<li>Masters or Ph.D. in Mathematics, Statistics, Computer Science, Operations Research, Engineering Science, Astrophysics, Computational Biology.</li>\n<li>Exposure to data science and machine learning techniques and best practices including processing, cleansing, and verifying the integrity of data used for analysis</li>\n<li>Apply analytical rigor and statistical methods to analyze large amounts of data, using advanced analytics techniques.</li>\n<li>Experience with Python/R/Scala in Natural Language Processing (NLP) and Text Analytics, Time series modelling or Computer Vision.</li>\n<li>At least 4 years of experience understanding business requirements from client and translate it to appropriate Data Analytics use cases</li>\n<li>At least 3 years of experience leading project planning and delivery effort from the domain team</li>\n<li>At least 2 years of programming in R/Python and SQL</li>\n<li>Experience in Tableau/Spotfire Visualization and ability to quickly ramp up on PowerBI</li>\n<li>Strong skills in communicating and presenting data-derived insights to non-technical audiences appropriately</li>\n<li>Strong skills in communicating and presenting data-derived insights to non-technical audiences appropriately</li>\n<li>Expected to build value through deep product, functional and application expertise and client engagement capabilities</li>\n<li>Apply analytical rigor and statistical methods to analyze large amounts of data, using advanced analytics techniques.</li>\n</ul>\n\nThe job also entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email or face to face.\n<br><br>\nAbout Us\n<br>\nInfosys is a global leader in consulting, technology and outsourcing solutions. We enable clients, in more than 30 countries, to stay a step ahead of emerging business trends and outperform the competition. We help them transform and thrive in a changing world by co-creating breakthrough solutions that combine strategic insights and execution excellence.\n<br>\nEOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity/National Origin</div>"}