{"job title": "Business Analyst (m/w) Bank Management &amp; Data Lake IT", "company": "ING", "city state": "– Tech | Berufserfahrene | Deutschland | man-167526", "rating": "3.8", "job description": "<div> <div><strong>Jetzt Business Analyst (m/w)</strong> <strong>Bank Management &amp; Data Lake IT am Standort Frankfurt werden.</strong>\n<br><br>\nWeshalb zuschauen, wenn man auch mitgestalten kann? Sie bringen die Dinge zum Laufen. Und machen sie dann jeden Tag ein bisschen besser. Sie denken auch mal unkonventionell oder probieren vermeintlich Unmögliches aus – gern gemeinsam mit den passenden Leuten. Kommunikative Stärke, IT-Know-how und ein Auge für komplexe Zusammenhänge – Sie merken schon: Hier ist Ihr Können gefragt. Jump on.<br><br>Ihre Aufgaben<br><br>Sie sind zu gleichen Teilen Data Scientist, Geschäftsprozess-Spezialist und versiert im Requirements Engineering? Perfekt. Für die Anforderungs-Analyse unserer Gesamtbanksteuerungssysteme suchen wir jemanden, der das Big Picture der IT-Landschaft überblickt und spielend zwischen Bank- und User-Perspektive wechseln kann. Dazu gehören selbstverständlich Fit-/Gap-Analysen, Business Cases, Product Lifecycle Management im Umfeld des Data Warehouse sowie die interaktive Erfassung von User Stories zusammen mit dem Product Owner. Sie sehen: Zusammen denken und arbeiten wir agil, optimieren kontinuierlich Geschäftsprozesse und passen uns so den sich stetig wandelnden Gegebenheiten und Anforderungen an.<br><br>Ihr Profil\n\n<ul>\n<li>Studium der (Wirtschafts-)Informatik, der Wirtschaftswissenschaften oder eine vergleichbare Qualifikation</li><li>Exzellente Kenntnisse und Praxiserfahrung in Requirements und Software Engineering</li><li>Fundierte Fachkenntnisse im Gesamtbanksteuerungsbereich z. B. im Meldewesen oder im Analytischen Risk Management</li><li>Know-how im Umgang mit den gängigen Datenanalyse-Tools (SQL, ETL etc.)</li><li>Kenntnisse der agilen Methoden in einer Linienorganisation</li><li>Gutes Englisch in Wort und Schrift</li><li>Belastbarer, kommunikativer Teamplayer</li>\n</ul>\n\nIhre Bewerbung<br>\n\n<div>Bewerben Sie sich jetzt online bei Deutschlands drittgrößter Privatkundenbank: Geben Sie Ihre persönlichen Daten an und laden Sie Anschreiben, Lebenslauf und Zeugnisse in wenigen Minuten hoch. Am schnellsten geht es, wenn Sie alle Unterlagen schon bereithalten.</div></div></div>\n<br>"}