{"job title": "Business Intelligence Analyst, Lead (hq-jg)", "company": "InGenesis", "city state": "– San Antonio, TX", "rating": "2.5", "job description": "Business Intelligence Analyst, Lead\n<br><br>\nSan Antonio, TX\n<br><br>\nWe are currently accepting applications for a full-time Business Intelligence Analyst, Lead for company headquarters located in San Antonio.\n<br><br>\nWe encourage you to Join Our Team and apply! Upon applying and meeting the qualifications, we will reach out to you and answer any further questions you may have about this opportunity.\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nAs a member of our growing Business Intelligence Team the Business Intelligence Analyst Lead will be responsible for producing insightful market and business analytics for workforce solution programs. This includes external economic/global business trends, client specific analytics and overall program key performance indicators (KPI's) and service level agreements (SLA's). Acts as a project manager for all analytic deliverables coordinating with InGenesis executives, stakeholders and developers to ensure an on time and high-quality product is delivered.\n<br><br>\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's Degree preferably in Mathematics, Economics, Finance, or Business</li>\n<li>Minimum of 3 years' experience in in business analytics</li>\n<li>Strong research and analytical skills with exceptional attention to detail</li>\n<li>Excellent interpersonal skills, including verbal and written communication, ability to work and interact well with others, and ability to develop and maintain positive working relationships</li>\n<li>Strong initiative and ability to meet deadlines</li>\n<li>Ability to identify problems and opportunities, gather relevant evidence, and make effective decisions using sound judgment</li>\n<li>Ability to independently handle multiple projects and tasks in a fast-paced environment</li>\n</ul>\n\n<strong>Preferred Skills (not required):</strong>\n\n\n<ul>\n<li>Experience with Vendor Management Systems (VMS) such as Fieldglass, Beeline or PeopleFluent</li>\n<li>Experience with Applicant Tracking Systems (ATS) such as Bullhorn, Healthsource or Taleo</li>\n<li>Experience with business intelligence software such as Power BI, Business Objects or equivalent</li>\n</ul>\n\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Responsible for market research and client specific analytics</li>\n<li>Contributes analysis for regular client quarterly business reviews</li>\n<li>Provided contractual Service Level Agreement (SLA) reporting</li>\n<li>Works with InGenesis leadership to develop and report client specific and enterprise metrics</li>\n<li>Collaborates with internal stakeholders to develop process recommendations</li>\n<li>Provides written explanation of results and trends to stakeholders</li>\n<li>Builds reports within the VMS and ATS according to requirements from requestor</li>\n<li>Project manages new analytic deliverables</li>\n<li>Develops presentation of data trends that provides business insight</li>\n<li>Utilizes case management system to manage, monitor, and track all reporting requests from internal and external clients.</li>\n<li>Participates in special projects and performs other duties as assigned.</li>\n</ul>\n\nWe support a diverse workforce and is an Equal Opportunity Employer who does not discriminate against employees and applicants for employment on the basis of race, gender, color, religion, national origin, age, sexual orientation, gender identity, genetic information, disability, veteran status, or other classification protected by law."}