{"job title": "Data Scientist", "company": "Innove, LLC", "city state": "– San Antonio, TX", "rating": "NA", "job description": "<strong>JOB DESCRIPTION:</strong>\n<br><br>\n<em>Description of Position, Primary Function or Responsibilities</em>\n<br><br>\nAir Education and Training Command is creating a new Chief Data Officer function. The Data Scientist (Sr.) will be part of the technical support team who would define, build and manage a new learning services system to modernize the commands learning environment. This would include engaging with stakeholders to learn about needs and existing solutions, creating a new technical backbone for the command, and helping develop a modern data strategy.\n<br><br>\nConsistently perform analysis and translate business needs to create high-quality Business Requirements and Functional Specifications documentation within specified time frames to solve most complex problems (multiple interfaces with other systems across multiple business units) considering all impacted components from an end-to-end perspective. Ensures end-to-end traceability of requirements is complete. Apply specific functional and/or business expertise to perform assigned tasks and develop specific project deliverables. Conduct impact analysis of technology changes on business processes and existing technology. Competent to work at the highest technical capacity on most phases of the business systems analysis. Contribute to the review of Test Planning and Test Execution strategies. Create the appropriate User-Interface Model(s) to support projects. Develop business workflow diagrams. Assist in the development of data models and interface design specifications. Documents, tracks, and resolves issues related to data quality. Contribute to the design and mapping of data conversion strategies. Participate in collaborative system and data design sessions with the user community, technical architecture resources, and development resources. Complete project activities on time and within budget, and proactively identifies and communicates issues that may jeopardize milestones or project budget to the Project Manager. Versed in strategic policy guidance and is familiar with the higher headquarter offices who develop government policy that effects the configuration of the Learning Services Ecosystem.\n<br><br>\n<strong>MINIMUM QUALIFICATIONS &amp; EXPERIENCE</strong>\n<br><br>\nBachelors Degree in associated discipline area (e.g. computer science, information technology, statistics, etc).\n<br><br>\nFive years industry experience.\n<br><br>\nSecret clearance.\n<br><br>\n<strong>PREFERRED QUALIFICATIONS &amp; EXPERIENCE</strong>\n<br><br>\nExperience on MAJCOM staff; familiarity with flying training, aircraft maintenance and related data systems; strong communication and teambuilding skills."}