{"job title": "Data Scientist", "company": "Innovation Works, Inc.", "city state": "– Pittsburgh, PA", "rating": "4.0", "job description": "<strong>Company Overview</strong>\n<br><br>\nGridwise, a mobility tech startup headquartered in Pittsburgh, PA, is looking for a highly motivated individual who is seeking the excitement of a startup to join our core team in a Data Scientist role.\n<br><br>\nGridwise is a mobile software platform which empowers rideshare (Uber/Lyft/etc.) and taxi drivers by providing data-driven insights to increase their efficiency and earnings on the road. Drivers use our application to help them know where and when are the best times and places to drive, allowing them to effectively plan ahead as well as make better decisions on the road. More informed decision-making by drivers enables them to find more trips and increase their earnings.\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nAs a core member of an early stage company, the candidate will be required to wear a variety of hats in order to tackle whatever challenges may arise in a startup.\n<br><br>\nAs a Data Scientist at Gridwise, you will:\n<br><br>\n- Mine insights from product usage analytics that may pertain to interesting behaviors, supply/demand patterns, or the product's impact on drivers\n\n\n<ul>\n<li>Develop predictive models and geospatial visualizations using large datasets that weve accumulated</li>\n<li>Develop processes/algorithms to clean and refine imperfect datasets obtained from various third parties</li>\n<li>Propose and execute exploratory data projects using a combination of internal and external datasets that could lead to useful features or insights</li>\n<li>Build internal tools for visualizing our data and analytics\n<br><br>\nDesired Experience/Skills/Qualifications:\n<br><br>\n- Experienced in data mining and applied machine learning</li>\n<li>Proficient in statistical analysis</li>\n<li>Experience working with geospatial and time-series data</li>\n<li>Skilled in working with imperfect, real-world datasets</li>\n<li>Strong programming skills, in both data analysis and application development</li>\n<li>Passionate about entrepreneurship and startups</li>\n<li>Experience working in cross-functional teams of software engineers and product managers</li>\n<li>Analytical thinker, able to think outside of the box</li>\n<li>Fast learner, scrappy, and very self-motivated\n<br><br>\nCompensation for this role will be a combination of salary and equity.\n<br><br>\nCompensation</li>\n</ul>\n\n<strong>$50K $70K</strong>\n\n\n<ul>\n<li>0% 2.0%\n<br><br>\nIf youre interested in this opportunity and feel youd be a great fit for our team, please fill out the application form at the following link:\n<br><br>\nhttp://grwi.se/fulltimepos</li>\n\n</ul>"}