{"job title": "Data Analyst I", "company": "InnovaSystems International", "city state": "– Alexandria, VA", "rating": "3.9", "job description": "At InnovaSystems, extraordinary solutions are born through innovative software.\n<br><br>\nA leading provider of information technology and enterprise-level solutions to the Department of Defense, federal, state and local government agencies, InnovaSystems delivers a vital service to support our nation s National Security Strategy. We engage organizational effectiveness and readiness by optimizing disparate data sources and operational systems resulting in reduced costs, increased effectiveness, and accessibility.\n<br><br>\nAs a member of the InnovaSystems team, you will be empowered to do the best work of your career with challenging assignments that solve real-world problems and a steady focus on comprehensive leadership training and career growth!\n<br><br>\nInnovaSystems is looking for a <strong>junior-level Data Analyst</strong> to manage critical collection, ingestion, and publication of data that will enable the success of our next-generation DoD web applications.\n<br><br>\nThis is an individual contributor position, reporting directly to the Operations Lead.\n<br><br>\n<strong>The Data Analyst will be responsible for:</strong>\n\n<ul>\n<li>Performing on-going, ad hoc reporting and data management for a vast &amp; complex array of data sources for multiple projects.</li>\n<li>Overseeing the accurate, timely and documented fulfillment of data and reporting requests.</li>\n<li>Driving improvements to current data management process and execution activities along with development managers and product owners</li>\n</ul>\n<strong>Ideal candidates will possess the following attributes:</strong>\n\n<ul>\n<li>Intellectually curious, highly analytical, and purposefully strategic.</li>\n<li>Ability to multi-task, execute quickly, and get things done.</li>\n<li>Excellent interpersonal communicator with an ability to discuss complex topics at all levels of technical understanding - executives, peers, customers, and partners</li>\n<li>Action-oriented, hands-on and works well with cross-functional teams across dispersed offices</li>\n<li>A high integrity individual that leverages empathy, honesty, and reliability to build a strong internal circle to get stuff done</li>\n</ul>\n<strong>Required technical skills &amp; experience:</strong>\n\n<ul>\n<li>1-3 years of direct experience in SQL query analysis required</li>\n<li>Experience with authoritative data streams, ETL/batch processes, and typical troubleshooting to resolve issues.</li>\n<li>Experience creating and maintaining interface control agreements like SIA, MOU, MOA.</li>\n<li>Strong analytical and problem-solving skills</li>\n<li>Ability to manage multiple and/or shifting priorities, and produce professional and accurate work product under time constraints</li>\n<li>Highly-motivated, with a strong work ethic and ability to work both independently and in a group environment</li>\n<li>Advanced computer skills including all MS Office applications</li>\n<li>Excellent written and verbal communication skills</li>\n</ul>\n<strong>Bonus points if you have:</strong>\n\n<ul>\n<li>Familiarity with relational databases</li>\n<li>Military experience is desired</li>\n</ul>\nIn return, InnovaSystems will invest in you! We offer training, direct mentorship, and support for growth into a more technical or managerial position from day one. We have a robust set of in-house tools to help you build, flesh out, and execute progress on the goals that matter.\n<br><br>\n<strong>Benefits &amp; Culture</strong>\n\n<ul>\n<li>Flexible schedule</li>\n<li>Technical and Leadership Training</li> \n\n<li>10 Paid Holidays</li>\n<li>3 weeks (120 hours) of paid leave annually - hours increase after 3 years of service</li>\n<li>401k Plan w/ 5% match</li>\n<li>Comprehensive benefit package to include health, dental, vision and supplemental insurance plans</li>\n</ul>\nVaries depending on location:\n\n<ul>\n<li>Onsite Gym/Workout Facilities</li> \n\n<li>Social Events</li>\n<li>Contributes to community organizations; Challenged Athletes Foundation (CAF), Support the Enlisted Program (STEP), Salvation Army, Wes Wish Toy Drive</li>\n</ul>"}