{"job title": "Statistician/Data Scientist IV", "company": "Insequence, Inc.", "city state": "– Arnold, MO", "rating": "NA", "job description": "<strong><u>Description:</u></strong>\n\n<ul>\n<li>Provide statistical and mathematical support in assisting NGA analyze and interpret a wide range of data to help NGA understand and improve our customers experience.</li> \n\n<li>Ability to leverage a range of data sources (e.g., Web traffic, customer requests for information, survey responses, production databases, etc.) for an understanding of what drives a positive customer experience.</li>\n<li>Provide insights that will be used to inform NGA strategy and decisions, in partnership with teams examining Website design, customer interactions, featured content, and future GEOINT products and services.</li> \n\n<li>Works with various stakeholders to develop business questions and identify the data necessary to analyze to answer those questions.</li> \n\n<li>Collaborate across a diverse team of statisticians/data analysts.</li> \n\n<li>Utilizes industry standard communication and visualization tools to visualize and communicate complex quantitative information and analysis to senior executives.</li>\n<li> Applies business analytics and customer segmentation techniques in any corporate function, e.g. marketing analytics, consumer analytics, operations analysis, human capital analytics, or other relevant fields.</li> \n\n<li>Uses data mining for structured and unstructured information to join and explore relationships in disparate data sets.</li> \n\n<li>Applies advanced analytics capabilities to derive insights from a combination of unstructured, semi-structured, and structured data.</li> \n\n<li>Maintains, moves, and manipulates data between applications, using appropriate software: Apache Spark, ElasticSearch, R, Python, Kibana and others as technology evolves.</li> \n\n<li>Strength in collaboration and teamwork within, between, and across organizational boundaries.</li>\n<li>Demonstrates good oral and written communication skills, along with good interpersonal skills and an ability to work cooperatively and effectively as a team member.</li>\n</ul>\n<strong><u>Experience Requirements:</u></strong>\n<br><br>\nFamiliarity with MS Office, data mining, ability to develop and manipulate, and maintain databases. Demonstrated experience using COTS statistical software (SPSS, SAS, MatLab etc.), COTS desktop software (MS Office and Access), and the Windows operating environment. Of particular importance is software packages used for advanced statistical analysis of operational data and tools for data visualization.\n<br><br>\nExpert-level proficiency, and at least 10 years experience. Ability to develop and lead teams in the support of GEOINT regional offices and divisions. Proven ability to interact and provide technical support to Office-level leadership and management internally as well as externally.\n<br><br>\n<strong><u>Education Requirements:</u></strong>\n\n<ul>\n<li>Bachelor of Science degree or higher in statistics, mathematics, image science, remote sensing, earth science, physical science or related technical or scientific field; or similar course of study at an accredited school (or substituted education and experience)</li>\n<li>10+ Years of relevant experience.</li>\n</ul>"}