{"job title": "Postdoctoral Fellow (Computational Biologist)", "company": "Institute for Systems Biology", "city state": "– Seattle, WA", "rating": "4.1", "job description": "The Baliga Lab is seeking an outstanding Postdoctoral Fellow to join a leading edge effort to a unique opportunity for a computational biologist to work with a cross-disciplinary team of experimentalists, clinicians, and computational biologists to develop multiscale gene regulatory network models of cancers towards enabling personalized and precision medicine. The strategy, which builds on extensive prior work in the Baliga Lab, on a powerful integrative framework called SYGNAL SYstems Genetics Network AnaLysis that can decipher directly from cross-sectional, multi-omic patient data the gene network(s) that have become dysfunctional within an individual patient. The position offers an extraordinary team-based science environment with opportunities for significant growth, training and career advancements.\n<br><br>\n<strong>Job responsibilities will include:</strong>\n\n\n<ul>\n<li>Working on computational analysis of large multi-omics datasets and mathematical modeling of complex biological systems.</li>\n<li>Participating in collaborative projects with other leading academic research and industry collaborators on computational analysis of high-dimensional, cell and molecular profiling data to advance patient-focused precision medicine efforts.</li>\n<li>Expertise in predictive pattern recognition applied to molecular profiling data and mathematical modeling of biological and disease processes, and demonstrable ability to interpret the output of such analyses in the clinical context, are prerequisite.</li>\n<li>Perform analyses in a transparent manner and to clearly communicate analysis results and methods with collaborating researchers who may or not have computational backgrounds.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Ph.D. in bioinformatics, biology, engineering, physics, computer science, mathematics, or a related scientific discipline (required).</li>\n<li>Expertise in predictive pattern recognition applied to molecular profiling data and mathematical modeling of biological and disease processes, and demonstrable ability to interpret the output of such analyses in the clinical context, are prerequisite.</li>\n<li>Expertise in analysis, interpretation and applied computational research on large multivariate molecular profiling datasets.</li>\n<li>Experience with mathematical modeling of dynamical biological systems at the level of gene regulation.</li>\n<li>Experience analyzing large-scale human scale molecular profile datasets (e.g., TCGA).</li>\n<li>Experience developing and integrating data and tools to distill knowledge from large datasets.</li>\n<li>Experience in machine learning, biostatistics, and sequence analysis.</li>\n<li>Excellence in relevant programming languages (e.g. Python, R, MATLAB, C/C++).</li>\n<li>A track record demonstrating scientific creativity, collaboration, and independence.</li>\n</ul>\n\nISB is an EOE (M/F/D/veteran status)\n<br><br>\nPosition Type\n<br><br>\nThis position is a full time position.\n<br><br>\nApplication Process\n<br><br>\nPlease provide a CV and cover letter to be considered for this position."}