{"job title": "Senior Information Scientist - UK / US / Remote", "company": "Instem PLC", "city state": "– Conshohocken, PA", "rating": "3.5", "job description": "Senior Information Scientist\n<br><br>\nTheCompany\n<br><br>\nInstem is a world leader in developing solutions for the Pharmaceutical industry with over 40 years' experience in providing data acquisition and information management solutions for drug safety evaluation. Instem's solutions are supplied to an international set of blue chip customers. The software we provide is designed to work in a highly regulated environment. The successful candidate will have a rewarding experience learning and developing highly marketable professional skills. Instem is a Microsoft Gold Partner and is also partnered with many other companies including Oracle, SAP and SAS.\n<br><br>\n<strong>About the Role:</strong>\n<br><br>\nAs a member of our growing group of servicespecialists you will be part of a team that is highly focused on providing SEND(Standard for Exchange of Nonclinical Data) related services to ourclients.\n<br><br>\nYou will join a services team thathas extensive experience in Life Sciences, the SEND standard and other relatedregulatory standards/guidance. In-depthinitial training, mentoring and continuous learning is at the heart of ourstaff development.\n<br><br>\nTo start, you will be an integral part of a team engaged in converting nonclinical data into SEND compliant datasets. As your Instem experience grows you'll advance to providing other SEND related services and client consultancy which may be provided either remotely or at the client site. This is a fast-paced, team environment, focused on providing high-quality services and consultancy to our clients in an ever-changing regulatory landscape.\n<br><br>\n<strong>Primary Responsibilities(with on-going training provided):</strong>\n\n\n<ul>\n<li>Maintaining an in-depth understanding of SEND and other regulatory standards/guidance</li>\n<li>Performing reviews of preclinical data converted into SEND</li>\n<li>Performing reviews for SEND (and other regulatory) compliance</li>\n<li>Interfacing with and supporting service customers</li>\n<li>Assisting with management of SEND service projects</li>\n<li>Maintain/develop skills necessary to engage in additional SEND related consultancy services (with training provided as needed):</li>\n<li>SEND Education</li>\n<li>SEND Consultancy</li>\n<li>SEND Dataset Verification</li>\n<li>Providing SEND/regulatory training and/or support to other Instem staff</li>\n<li>Providing SEND conversion training and/or support to other Instem staff</li>\n</ul>\n\n<strong>Background, experience andpersonal attributes:</strong>\n<br><br>\nThe following will be used to evaluate and recruit thesuccessful candidate.\n\n\n<ul>\n<li>Strong interpersonal skills</li>\n<li>Desire to efficiently produce high-quality deliverables</li>\n<li>Excellent written and oral communication skills</li>\n<li>Outgoing, positive and engaging</li>\n<li>Comfortable working as part of a team in a fast-paced environment, yet also able to work independently</li>\n<li>Good organizational habits and ability to meet deadlines</li>\n<li>Desire for on-going professional development and continuous learning</li>\n<li>Educational or professional experience in a Life Sciences/Preclinical environment or IT with an appreciation for complex data</li>\n<li>Bachelors degree in Life Science (or similar field) or IT</li>\n<li>Skilled using basic Microsoft applications</li>\n</ul>\n\n<strong>Additional Information</strong>\n<br><br>\nYouwill enjoy and expect periodic domestic and/or international travel.\n<br><br>\nAll candidates will be required to demonstrate and exemplify Instem's core values:\n<br><br>\nRespect, Empowerment, Creativity, Integrity, Passion, and Enjoyment\n<br><br>\nThesuccessful candidate can expect a competitive starting salary, a generousholiday allowance and regular performance and pay reviews designed to rewardpotential. Further to this, the company prides itself in employee training andthe successful candidate can expect to participate in relevant training schemesconcerning our market and products. Opportunities for future advancement also exist.\n<br><br>\nApply today and learn moreabout how along with us, you can help our customers bring life enhancingproducts to market faster.\n<br><br>\nInstemprovides advanced and best-in-class IT solutions to the global health and lifesciences community which improves the productivity of their processes in thediscovery and development of new drugs, therapies and products.\n<br><br>\nFor themore than 400 clients around the world, we are supplying breakthroughtechnology and services that help them efficiently access, capture, manage andenrich a wide array of data while generating new insight to advance theirmission."}