{"job title": "Senior Staff Data Scientist", "company": "Intelliswift Software Inc", "city state": "– Bellevue, WA", "rating": "NA", "job description": "Job DescriptionData scientist, you will build knowledge graph dataset and develop various machine learning model for artificial intelligence operation system.• Analyze Business operation data, including purchase, usage, consumption, browsing/clicks, search query etc to understand customer behavior.\n\n\n<ul>\n<li>Integrate those structured data sources into a coherent and consistent knowledge graph structure.</li>\n<li>Design, develop, test and maintain knowledge graph dataset.</li>\n<li>Access and leverage the knowledge graph to complete machine learning, search, clustering and recommendation tasks.</li>\n<li>Effectively communicate and explain results to key decision maker.</li>\n</ul>\n\nQualification\n\n\n<ul>\n<li>Advanced degree in computer science, engineering, statistics, mathematics or related field.</li>\n<li>Experience in manipulating unstructured, semi-structured and fully structured datasets.</li>\n<li>Experience in building Graphical Models, Building Knowledge Graphs, Data Mining.</li>\n<li>10+ years of experience in creating and maintaining data structures using different kind of database management systems.</li>\n<li>Experience in developing and implementing analytical data models, predictive modeling, recommendation systems, classification and regression models, time-series models.</li>\n<li>Experience in Graph Databases, specifically Neo4j technology.</li>\n<li>Expert in machine learning language, specifically Python.</li>\n<li>Understanding Chinese language a strong plus.Company DescriptionIntelliswift Software, Inc. is a premier business and technology solutions company headquartered in the Silicon Valley, with offices across the United States, India and Singapore.</li>\n</ul>\n\nThe company has a proven track record of delivering results through its global delivery centers and flexible engagement models for over 450 brands ranging from Fortune 100 to growing companies.\n<br>\nIntelliswift provides a variety of services including Enterprise Applications, Mobility, Big Data/BI, Staffing Services, and Cloud Solutions.\n<br>\nGrowing at an outstanding rate, Intelliswift has been recognized as the second largest private IT Company in the East Bay."}