{"job title": "Marketing Data Scientist", "company": "Intel", "city state": "– Santa Clara, CA", "rating": "3.8", "job description": "This position is within the Global Insights and Analytics (GIA) team - the heart of Intels central market research and insights function that supports the Global Marketing and Communication (GMC) group and Intels Business Units (BUs). Emphasis of this position is on driving data driven culture into Intels marketing efforts and integrating analytics driven insights into decision making by combining behavioral data (i.e. web behavior, social media listening, search, telemetry) with traditional primary research data (i.e. survey-based data, focus groups) and other types of data (i.e. sales, media spend).\n<br>\nThis individual contributor Marketing Data Scientist position will assist business with insights based on finding patterns and relationships in data. This position requires experience with predictive modeling, statistics, Machine Learning, Data Mining, and other data analysis techniques to collect, explore, and extract insights from structured and unstructured data. We are seeking someone who has a strong business understanding in order to translate data into intelligence, solve a variety of business problems and enable marketing strategy.\n<br><br>\nQualifications\n<br><br>\nMinimum Qualifications:\n<br>\nBachelor’s Degree in in Statistics, Mathematics, Economics, Computer Science, Data Science or Engineering (Masters Degree is a plus).\n<br>\nMinimum 4 years of experience in marketing, sales or business analytics.\n<br>\nExperience with data mining software packages such as R, PYTHON, SAS, SPLUS.\n<br>\nSQL and statistical algorithms and modeling.\n<br>\nExperience working with large and complex data sets.\n<br>\nExperience in predictive modeling and machine learning algorithms.\n<br>\n<strong>Additional Preferred Characteristics:</strong>\n<br>\nEffective presentation/communication skills and the ability to interpret and simplify data for others.\n<br>\nCommunicate conclusions in a clear and sharp manner.\n<br>\nWork well independently as well as part of a broad team.\n<br>\nInnovative attitude and out-of-the-box thinking.\n<br>\nCurious and inspired by challenges. A keen interest in innovation and breaking new ground for Intel."}