{"job title": "Scientist", "company": "Integrated Resources, Inc.", "city state": "– San Diego, California", "rating": "3.8", "job description": "Title: Scientist\n<br><br>\nLocation: San Diego, CA\n<br><br>\nDuration: 06 months+\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nDesign and conduct laboratory studies utilizing a variety of sample analysis platforms primarily on human specimens for biomarker applications in drug development programs\n<br>\nConduct ex vivo functional, target engagement functional assays with human and non-human PBMCs.\n<br>\nUtilize flow cytometry/FACS, immunoassays, gene expression profiling, cell and tissue culture, nucleic acid extractions, and other platforms relevant to profiling of immune cells and skin biology\n<br>\nInitiate or help manage projects with external vendors or collaborators\n<br>\nExecute research activities under limited supervision\n<br>\nProvide critical analysis and interpretation of data\n<br>\nDeliver reporting and communication of results, and participate in scientific discussions\n<br><br>\nExperience &amp; Expertise\n<br><br>\nA minimum of a Bachelors degree with 5 or more years of related experience or a Masters degree with 2 or more years of related experience is required.\n<br>\nExperience with immunoassays, flow cytometry/FACS and tissue culture is required, and a background in inflammation or immunology research is strongly preferred.\n<br>\nExperience with tissue culture and functional cellular immunology assays desired\n<br>\nExperience with molecular biology including RNA, DNA preparation and analysis including RT QPCR, microarrays, RNAseq desired.\n<br>\nAbility to work independently with minimal supervision in a team environment.\n<br>\nProficiency in working with complex data sets and interpreting and presenting results.\n<br>\nKnowledge of data analysis and visualization applications.\n<br>\nEffective oral, written and interpersonal communication skills.\n<br><br>\n<strong>Technical Knowledge and Skills:</strong>\n<br><br>\nExperience in protein detection assays including ELISA, MSD, and ultra-sensitive immunoassay platforms\n<br>\nExperience with immunophenotyping via multi-parameter flow cytometry\n<br>\nExperience with FACS sorting of human cells preferred\n<br>\nFamiliarity with assay development principles\n<br>\nExperience in molecular techniques for analysis of gene expression\n<br>\nFamiliarity with bio specimen management and analysis of samples from clinical studies and other aspects of translational research would be helpful\n<br>\nFamiliarity with assay automation is desirable\n<br>\nExperience in tissue culture of immune cells including ex vivo assays with primary blood and tissue cells (e.g. Cell differentiation, activation, and cytokine production) would be a plus."}