{"job title": "Data Scientist", "company": "InterQuest Group", "city state": "– New York City", "rating": "3.9", "job description": "Sr. Data Scientist \u0096 New York City \u0096 R, Python, SQL, Regression Analysis, Decision Trees\n<br><br>\nKey Skills: Machine Learning, R, Python, SAS, SQL, Decision Trees, Random Forest, Unstructured Data, Hadoop\n<br><br>\nSalary: up to $140,000 great benefits\n<br><br>\nAn up and coming consulting firm that provides advisory services and decision support software to the financial services industry is looking for a Data Scientist to play an integral part in their foundation, as they continue to rapidly grow. Based in Manhattan, NYC.\n<br>\nYou will be joining a team that has the business expertise, analytical skills and know-how to implement creative, practical data science solutions for their clients. They are looking for data scientists wo are passionate about working with big data from data wrangling to Spark programming to sophisticated statistical modeling and machine learning using R / Python. You will also ownership of all aspects of the analysis and full life cycle project control from data compilation, project planning, statistical modeling and project delivery presentation.\n<br><br>\n<strong>Essential Skills:</strong>\n\n\n<ul>\n<li>Advanced degree in a quantitative discipline required (minimum of Master\u0092s preferred)</li>\n<li>2 years of quantitative modeling experience \u0096 machine learning, decision trees, regression modeling</li>\n<li>Working knowledge of R, Python or SAS</li>\n<li>Strong communication skills and engagement ability with technical and non-technical stakeholders</li>\n<li>Ability to work well with others in a high-pressure environment</li>\n<li>Deep understanding of experiment design: factorial experiment design, multivariate experiments, simple random sampling vs. stratified, etc.</li>\n</ul>\n\nThe consultancy has been very profitable and is looking to double in size in the next two years, so it is a great opportunity to get in with a disruptive company at the ground floor. Please contact Carson McCusker of InterQuest at 646-809-4192 or carson.mccusker@itqanalytics.com."}