{"job title": "Nurse Scientist - RN", "company": "Intermountain Healthcare", "city state": "– US-UT-Salt Lake City", "rating": "3.2", "job description": "Description: <p><strong>About Us</strong><br>What does it mean to be a part of Intermountain Healthcare? It means that the quest for clinical excellence is not just a goal, but a given. It means building an environment where physicians and employees can deliver the best in healthcare. And it’s realizing each employee or volunteer is vital to the healing process, because we can only achieve the<em> </em>extraordinary<em> together</em>. </p>\n<p>Being a part of Intermountain Healthcare means joining with a world-class team of over 36,000 employees and embarking on a career filled with opportunities, strength, innovation, and fulfillment. Our mission is: Helping people live the healthiest lives possible.</p>\n<p>Our patients deserve the best in healthcare, and we deliver.</p><p><strong>Job Description</strong></p>\n<p>Performs research that uses our model healthcare system to advance clinical investigation and improve patient outcomes and healthcare quality through innovation, discovery and implementation science. This will support Intermountain's Care Delivery Science concept that highlights that there is a science behind how the health care delivery system can improve patient outcomes. This will require a multi-disciplinary approach of applied health services researchers, bioinformatics, systems engineering and implementation science capabilities supporting existing clinical teams to increase the update and adoption of best-evidence based interventions. This position of a nursing research leader will be a member of this multi-disciplinary team and leverage the nursing capabilities throughout the organization on implementing best evidence-based interventions and help evaluate the impact on patient outcomes and costs.<br></p>\n<p>Successful candidates will be experienced in nursing research, they will be collaborative as a relationship-based, clear communicator.</p>\n<p><strong>Essential Job Duties</strong></p>\n<ul>\n<li>Develop a portfolio of independent nursing research that provides a vehicle for achieving defined outcomes. These include increasing the grant awards, growing research publications and increasing the number and types of studies that use nurses to improve deployment of evidence-based interventions across the system.</li>\n<li>Provide expertise in quality improvement principles, study design, development, analysis and dissemination of new knowledge and the use of evidence to guide and support clinical nursing practice.</li>\n<li>Design nursing specific study protocols, and determine methods and procedures for data collection, data management and quality control, and determine statistical techniques for data analysis.</li>\n<li>Build and support a team of nursing researchers</li>\n<li>Demonstrate solid understanding of project management including development, support, installation, resource allocation, life cycle planning, cost tracking, and project risk assessment.</li>\n<li>Collaborate with healthcare facilities and educational institutions for multi-site nursing research opportunities.</li>\n<li>Submit grants to support the integration of nursing research and evidence-based practice.</li>\n<li>Mentor others in the research process.</li>\n<li>Create and participate in writing reports, research papers, national presentations, articles, and other documentation of nursing study results.</li>\n<li>Evaluate innovative nursing research techniques.</li>\n</ul>\n<p><strong>Posting Specifics</strong></p>\n<ul>\n<li>Wage: Commensurate with experience</li>\n<li>Department: Extraordinary Care</li>\n<li>Work Location: Key Bank Tower, Salt Lake City, UT</li>\n</ul>\n<p><strong>Minimum Requirements</strong> </p>\n<ul>\n<li>Doctorate in nursing or a related field with a strong emphasis in research. If the doctorate is in a related field, a master or bachelor degree in nursing is required.</li>\n<li>Licensure as a registered nurse in the State of Utah.</li>\n<li>Experience as a principal Investigator in grant-funded nursing projects.</li>\n<li>Experience in obtaining federal and/or foundation grants.</li>\n<li>Experience in publishing in peer reviewed journals as first or senior author.</li>\n<li>Five years of research experience in designing and deploying evidence-based interventions in routine care and analyzing the impact patient outcomes using rigorous study design methods.</li>\n<li>Expertise in nursing practice, education, and research with an ability to coach others.</li>\n<li>Experience using statistical research methods and their use in outcomes data reporting.</li>\n<li>Excellent communication skills with experience in study coordination and collaboration.</li>\n<li>Ability to meet time demands necessary to execute research. </li>\n</ul>\n<p><strong>Physical Requirements</strong> </p>\n<ul>\n<li>Interact with others requiring the employee to communicate information.</li>\n<li>Operate computers and other IT equipment requiring the ability to move fingers and hands.</li>\n<li>See and read computer monitors and documents.</li>\n<li>Remain sitting or standing for long periods of time to perform work on a computer, telephone, or other equipment. </li>\n</ul>\n<p><strong>Preferred Requirements</strong> </p>\n<ul>\n<li>Experience in a role requiring the ability to demonstrate proficiency with MS project and database applications.</li>\n<li>Familiarity with statistical and informatics/bioinformatics analysis tools.</li>\n</ul>\n<p> </p>\n<p><strong>Please Note</strong></p>\n<p>All positions subject to close without notice. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.<br></p> <br> \n Location: US-UT-Salt Lake City <br> \n Activation Date: Tuesday, September 4, 2018 <br> \n Expiration Date: Tuesday, September 18, 2018 <br> \n Apply Here"}