{"job title": "Data Scientist", "company": "Intent Media", "city state": "– New York, NY", "rating": "4.7", "job description": "<strong>Intent Media</strong> isn't your usual company. Our work is powered by the premise that every person at Intent Media is unique and possesses a distinct set of skills, personality, and passions. We embrace our collective talents to tackle technical challenges, refine our successfully disruptive business ideas and co-create one of the most human and inspiring work cultures out there. We are a team of collaborators who value and reward shared success over individual heroics.\n<br><br>\nAs a member of our Data Science team, you will use your quantitative expertise to identify new areas of research and optimization, and then see those ideas through to production. Data Science is a fundamental contributor to Intent Media's success - your work will have a direct and tangible impact on the business.\n<br><br>\nThere are no typical projects, but a workflow might involve performing research and analysis against petabytes of historical data using our collection of large-scale analytics tools like Spark, Snowflake, and RedShift, building prototypes using mostly Scala or another functional language, pairing with engineers on the Modeling and Prediction team to harden and deploy the functionality, and running live tests to monitor the results.\n<br><br>\nAll of these steps take place in an environment of respect and collaboration, and the Data Science team is empowered to own its agile processes. Every member of the team is expected to be both a student and teacher, and we believe that the most effective Data Science team is one that is collectively learning and growing. Experience in coaching and mentoring colleagues at all levels is strongly desired. As part of the Data Science team, you'd help build out a real-time predictive analytics platform that makes decisions for some of the largest sites on the web.\n<br><br>\n<strong>About You:</strong><ul>\n<li>Significant industry experience in several of the following areas: personalized experiences, big data analytics, implementing machine learning &amp; statistical methods, designing and running A/B tests, product design and life cycle, writing production code, designing online auctions.</li>\n<li>Experience in user experience customization a plus</li>\n<li>Experience coaching and mentoring team members</li>\n<li>Experience writing production software in languages like Scala, Clojure, Java, Python, or C++ in an agile, collaborative environment</li>\n<li>Experience with handling large amounts of data (TB+) in a production setting</li>\n<li>Experience with Spark is a significant plus</li>\n<li>You are familiar with Test Driven Development and treat your test code with the same respect as production code.</li>\n<li>Experience in ad-tech a plus</li>\n\n<strong>About Us:</strong>\n<br><br>\nIntent Media is the data science company for the world's leading travel sites. Sophisticated machine learning capabilities trained and fine-tuned for years enable us to serve ads and conversion-boosting user experiences based on a unique understanding of where a given user is in the shopping journey.\n<br><br>\nWe operate in more than 40 countries with hundreds of airline, hotel, car rental, online travel agency and meta-search partners around the globe, including nine of the top 10 OTAs and meta-search sites in North America. We're over 100 people strong, with offices in NYC (HQ), London and Munich.\n<br><br>\nEvery day, we're inspired by two pursuits. First, we're building novel products that are upending e-commerce. Second, we're building the company we've always wanted to work for one that's open, human and collaborative, where very smart people come together to share ideas and get things done. We've been included on the Crain's top 100 places to work in NYC list for six years running!\n<br><br>\n<strong>Love Your Job!</strong>\n<br><br>\nOur employees enjoy coming to work, and we let them know they're valued.\n<br><br>\nOur vibrant team accomplishes a lot every day, but we insist upon work/life balance so things never become stale. We don't take ourselves too seriously, but we take our work very seriously. We believe that in order for our employees to perform their best, they need access to strategic decisions, and so our flat structure and open communication invite innovation from all levels ideas flow freely.\n<br><br>\nWe offer competitive compensation, stock options, and great perks &amp; benefits, including:\n\n<ul>\n<li>Unlimited vacation</li>\n<li>A generous parental leave policy</li>\n<li>A beautiful, dog-friendly office in SoHo with drinks and snacks</li>\n<li>An open environment with lots of natural light and roof deck access</li>\n<li>Annual $2,000 learning budget and Citi Bike membership</li>\n<li>Access to Fond, our employee perks program featuring deals and discounts on hundreds of products and services</li>\n<li>Access to Sherpaa, a telehealth service with 24/7</li>\n<li>In-office yoga classes</li>\n<li>Company-wide social events, <strong>and more!</strong></li>\n</ul>\n<strong>So what are you waiting for? Apply with your resume in just a few clicks! You can learn more about us at:</strong>\n<br><br>\nAbout Intent Media\n<br><br>\nIntent Media Products\n<br><br>\nInstagram\n<br><br>\nLinkedIn\n<br><br>\nTwitter</ul>"}