{"job title": "Data Scientist", "company": "Integral Ad Science", "city state": "– New York, NY", "rating": "3.2", "job description": "We are seeking a Data Scientist to join our team in NYC!\n<br><br>\nThe Data Science team at Integral is a high profile team that is a center of innovation for the company and a major contributor to the company's core products. The types of challenges we solve have attracted people from industry and academia with diverse backgrounds, ranging from machine learning, statistics, physics, biology, neuroscience, and computer science to finance and economics. We're passionate about maintaining an open and collaborative environment, where team members bring their own unique style of thinking and tools to the table.\n<br><br>\nAs a member of the Data Science team you will use machine learning / AI to solve complex problems across a wide range of areas related to causality, marketing attribution, ad viewability, video and contextual classification, all while helping us build and scale the next generation of our data science research and development platform.\n<br><br>\nResponsibilities:\n\n<ul>\n<li>Work on challenging fundamental data science problems in online advertising</li>\n<li>Work on formulation, implementation, testing and validation of predictive models</li>\n<li>Measurably impact business KPIs by delivering high-quality scalable solutions</li>\n<li>Discover actionable insights from data and present them through rich visualizations</li>\n<li>Partner with product and engineering teams and work closely with other teams</li>\n<li>Propose and develop solutions independently and in collaboration with others</li>\n<li>Write high-quality efficient code while implementing your own ideas</li>\n<li>Prepare white papers, scientific publications, conference presentations, and blog posts</li>\n<li>Drive the collection of new data and the refinement of existing data sources</li>\n<li>Assemble data sets from multi-terabyte structured and unstructured data repositories</li>\n<li>Develop and follow best practices for data analysis, instrumentation, and experimentation</li>\n</ul>\nQualifications:\n\n<ul>\n<li>Advanced degree in a relevant technical field (machine learning, computer science, statistics, physics, mathematics, or related field), or 4+ years' experience in a relevant role</li>\n<li>Comfort manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources</li>\n<li>A strong passion for empirical research and for answering difficult questions with data</li>\n<li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner</li>\n<li>Extensive experience solving analytical problems using quantitative approaches based on machine learning and statistics methods, including (but not only) application of machine learning methods to predict several user behaviors, causal inference and uplift modeling, survival analysis, and the design of randomized experiments to test model predictions.</li>\n<li>Proficiency with at least one scripting language such as Python</li>\n<li>Familiarity with relational databases and SQL</li>\n<li>Experience working with large data sets, experience working with distributed computing tools a plus (Hadoop, Spark, Hive, etc.)</li>\n<li>Experience with at least some of the following machine learning libraries: scikit-learn, H2O, SparkML, etc</li>\n<li>Experience with practical data science: source control workflows, deploying machine learning models in production, real-time machine learning</li>\n</ul>\nLearn more about us by visiting: http://bit.ly/glassdoorIAS or www.integralads.com.\n<br><br>\n<strong>Equal Opportunity Employer:</strong>\n<br><br>\nIAS is an equal opportunity employer, committed to our diversity and inclusiveness. We will consider all qualified applicants without regard to race, color, nationality, gender, gender identity or expression, sexual orientation, religion, disability or age. We strongly encourage women, people of color, members of the LGBTQIA community, people with disabilities and veterans to apply.\n<br><br>\nAttention agency/3rd party recruiters: IAS does not accept any unsolicited resumes or candidate profiles. If you are interested in becoming an IAS recruiting partner, please send an email introducing your company to recruitingagencies@integralads.com. We will get back to you if there's interest in a partnership."}