{"job title": "Data Engineer", "company": "International Cruise &amp; Excursions, Inc. (ICE)", "city state": "– Scottsdale, AZ", "rating": "3.6", "job description": "<strong>About This Job:\n<br>\n</strong>\n<br>\n<div>As the Data Engineer, you will develop, construct, test and maintain architectures including databases and large-scale data processing systems for software solutions in an innovative and dynamic technology environment. Working together with our business development, product solutions, and software development teams, you will develop world-class products that are designed to achieve overall business success. You will work closely with the Enterprise Architects designing the development projects following the ICE Development Lifecycle and platform.</div> \n<br>\n<div><em>Please note: we are unable to provide sponsorship, and only local candidates will be considered</em></div>\n<br>\n<strong>Responsibilities:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Design, construct, install, test and maintain highly scalable data management systems</li>\n<li>Ensure systems meet business requirements and industry best practices</li>\n<li>Create and maintain data management documentation</li>\n<li>Design and build scalable data repositories enabling high-performance of consumer/member transaction volume within the ICE products</li>\n<li>Build APIs for data consumption and integration of external datasets as necessary</li>\n<li>Build high-performance algorithms, prototypes, predictive models and proof of concepts</li>\n<li>Problem-solve issues around data integration, unusable data elements, unstructured data sets, and other data management incidents</li>\n<li>Research opportunities for data acquisition and new uses for existing data</li>\n<li>Develop data set processes for data modeling, mining and production</li>\n<li>Integrate new data management technologies and software engineering tools into existing structures</li>\n<li>Create custom software components (e.g. specialized UDFs) and analytics applications</li>\n<li>Employ a variety of languages and tools (e.g. scripting languages) to marry systems together</li>\n<li>Install, implement and update disaster recovery procedures</li>\n<li>Recommend ways to ensure continuous improvement around data reliability, efficiency and quality</li>\n<li>Collaborate with data architects, modelers and IT team members on project requirements and goals</li>\n<li>Collaborate with QA Engineers and automation to build test plans, scripts and automation to verify and validate data management systems and production implementation</li>\n<li>Other duties/tasks as assigned</li>\n</ul>\n\n\n<br><br>\n<strong><u>Skills:</u>\n<br><br>\n</strong>\n\n\n<ul>\n<li>Able to identify and implement a data solution strategy</li>\n<li>Skilled in working directly with senior business management to determine requirements and present options</li>\n<li>Statistical analysis and modeling</li>\n<li>Database architectures</li>\n<li>SQL-based and NoSQL-based technologies</li>\n<li>Data modeling tools (e.g. UML, ERWin, Enterprise Architect and Visio)</li>\n<li>Data warehousing solutions</li>\n<li>Data mining</li>\n<li>Demonstrates initiative with or without direct authority. Able to influence and advocate for approaches to problem solving</li>\n<li>Demonstrates intellectual curiosity in exploring new territories and finding creative ways to solve data management problems</li>\n<li>Supports and maintains positive attitude and vision with peers, associates, and management</li>\n<li>Demonstrates effective teamwork and collaboration</li>\n<li>Ability to prioritize competing or conflicting requests and execute tasks in a high-pressure environment</li>\n<li>Utilizes good judgment</li>\n<li>Must demonstrate ability to handle diversity among people and environments</li>\n<li>Must be detail oriented and able to follow-up and follow-through on project actions and tasks</li>\n<li>Ability to maintain confidentiality of sensitive information</li>\n<li>Extensive written and oral communication skills</li>\n</ul>\n\n<strong>Qualifications:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Bachelor's degree in Computer Science, Computer Engineering, Applied Math, Statistics or related field</li>\n<li>Certified Data Management Professional (CDMP) a plus</li>\n<li>5+ years' experience designing, building, and maintaining data management systems</li>\n<li>Broad experience in planning, architecting, and delivering mission-critical enterprise-grade systems and solutions</li>\n<li>Experience with cloud architecture and data repositories</li>\n<li>Data design experience</li>\n<li>Experience in data cleansing and optimization for data consumption</li>\n<li>Experience with source control tools such as Git and TFS a plus</li>\n<li>Experience in .Net framework and Web Services (SOAP, REST, XML) a plus</li>\n<li>Experience with Azure Service Fabric and micro services a plus</li>\n<li>Working familiarity of front-end web framework using C#, JavaScript and/or Angular a plus</li>\n<li>Experience using CSV/JSON/XML data formats</li>\n<li>Experience in developing LOB (Line of Business) applications, as well as consumer websites</li>\n<li>Experience in consumer-facing, ecommerce and mobile systems a plus</li>\n<li>Experience with agile methodologies</li>\n</ul>\n<strong><u>Who We Are:</u></strong>\n<br><br>\nHeadquartered in Scottsdale, Arizona, International Cruise &amp; Excursions, Inc. ('ICE' for short) is dedicated to providing branded travel, leisure, and lifestyle products to consumers (over 55 million each year). The ICE slogan reads \"Powered by Innovation,\" and we mean it!\n<br><br>\nWe're proud to be consistently recognized as a CareerBuilder Top Company to Work for in Arizona, Phoenix Business Journal's Best Places to Work winner, and one of Arizona's Most Admired Companies. Our ongoing entrepreneurial spirit and overwhelmingly talented employees encourage a friendly, successful work environment and that's what sets us apart. With over 2,200 employees worldwide, we're always looking to expand our ICE team with career-focused leaders who are committed to exceeding expectations.\n<br><br>\nExplore our incredible company culture on our website!\n<br><br>\n<strong><u>Our Core Values:</u></strong>\n<br><br>\nRespect. Passion. Integrity. Innovation. Social Responsibility. Teamwork. Accountability.\n<br><br>\n<strong><u>Additional Benefits</u></strong>:\n\n<ul>\n<li><em>FREE 7-day resort stays and cruises on your anniversary</em></li>\n<li>Medical Health Insurance</li>\n<li>Onsite Wellness Clinic</li>\n<li>Long Term Disability</li>\n<li>Life Insurance</li>\n<li>Dental &amp; Vision Coverage</li>\n<li>401K Plan</li>\n<li>Pet Care Insurance</li>\n<li>Legal Insurance</li>\n<li>Flexible Spending Accounts (FSA)</li>\n<li>Employee Assistance Program</li>\n<li>Discounted Employee Services (dry-cleaning, nail services, massage, personal training, etc.)</li>\n<li>Dedicated Employee Enrichment &amp; Recognition Programs</li>\n<li>Exclusive Employee Travel Rates on Cruise, Resorts, Hotels, Tours, Car Rentals, Dining and Merchandise offerings</li>\n</ul>\n#ZR"}