{"job title": "Data Scientist, Business Analytics", "company": "Intuit", "city state": "– Mountain View, CA", "rating": "4.2", "job description": "We are looking for a hands-on Data Scientist in the Small Business &amp; Self-Employed Data Product, Analytics &amp; Science team. The ideal candidate is a creative problem solver with a passion for customer experience and for delivering advanced data-driven solutions. You will work alongside customer experience leaders and product managers to help define, build and shape the future of the customer experience across Intuit’s ecosystem.\n<ul>\n<li>Demonstrates knowledge of the business goals and business constraints. Creates appropriate analyses that drive business leaders to take action</li><li>Effectively executes contributions to multi-person projects. Translates simple business requirements into key milestones and deliverables</li><li>Clearly articulates findings and contributes to dialogues with leaders to change business actions</li><li>Coaches and mentors others on best practices, proactively suggests improvements to the status quo and develops analytical initiatives of moderate complexity, developing tracking, combining data from multiple sources to extract meaning, reconcile assumptions, and identify logical path for action</li><li>Understand the current ecosystems, historical customer behaviors, and long-term trends in order to identify ways to improve and communicate the necessary information to key partners</li><li>Partner with cross-functional teams including Customer Care, Product, Marketing, Engineering, Finance and Analytics to design and build tools to improve upon customer experience</li><li>Democratize data by building and socializing decision tools (dashboards, reports); build key data sets/pipelines to empower operational and exploratory analysis.</li><li>Provide insights to the leadership team on impact of strategic initiatives on the key metrics</li></ul>\n\n<ul>\n<li>2+ years of experience in generating and presenting insights from marketing/product/customer care data; experience in advanced analytics and optimization a plus!</li><li>Understanding of statistical and predictive modeling concepts, experimental design and multivariate A/B testing, machine-learning approaches, clustering and classification techniques, and recommendation and optimization algorithms</li><li>Experience in descriptive statistics, experimental design and hypothesis testing.</li><li>Outstanding communication skills with the ability to interact with business leaders to make business recommendations</li><li>Uses SQL skills to perform data segmentation and aggregation from scratch; experience working with granular web clickstream data and behavior tracking tools like SiteCatalyst</li><li>Experienced in programming languages and stats packages (e.g. python, R); comfortable creating re-usable data sets with high quality data</li><li>Advanced degree in Mathematics, Statistics, Finance, Economics, Business or a related field. PhD in a related field a plus</li><li>Love mentoring and guiding others on best practices. Passionate about the advancement of whole team</li><li>Experience with customer behavioral analytics and knowledge of customer care analytics is a plus!</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}