{"job title": "Director of Data Science, Fraud &amp; Risk", "company": "Intuit", "city state": "– Mountain View, CA, United States", "rating": "4.2", "job description": "Overview<br><br>Intuits AI/ML Group is hiring a Data Scientist Leader to focus on Security and Anti-fraud. Our team develops game-changing technologies aimed to detect and prevent fraud across Intuit product offerings. Youll be building and prototyping algorithms and applications to improve security and anti-fraud efforts on top of the collective financial data of 60 million consumers and small businesses. Applications will span multiple business lines, including personal finance, small business accounting, and tax.\n<br><br>\nYour role will range from research experimentation and technology innovation, to software development and consultative business facilitation. You are extremely passionate about applying Machine Learning to real customer problems, powering the next generation experiences for large-scale applications. You thrive on ambiguity and will enjoy frequent pivoting as part of exploration. You must be comfortable managing interactions with our partners involved with big data infrastructure, software, data warehousing, and product management.\n<br><br>\nYoull be comfortable as a hands-on leader of a small team of 3-5 elites where members frequently wear multiple hats.<br><br>Responsibilities\n\n\n<ul>\n<li>Perform hands-on data analysis and modeling with huge data sets</li>\n<li>Apply data mining, anomaly detection, and machine learning to enhance Intuits security and anti-fraud efforts.</li>\n<li>Discover data sources, get access to them, import them, clean them up, and make them machine learning ready</li>\n<li>Create and refine features from the underlying data. Youll enjoy developing security/anti-fraud subject matter expertise to have an intuition about what features might make your model perform better, and then youll lather, rinse and repeat</li>\n<li>Run regular A/B tests, gather data, perform statistical analysis, draw conclusions on the impact of your models and communicate results to peers and leaders</li>\n<li>Explore new design or technology shifts to determine how they might connect with the customer benefits we wish to deliver</li>\n</ul>\n\nQualifications\n\n\n<ul>\n\n<li>\n<div>MS or Ph.D. in an appropriate field (Computer Science, Statistics, Physics, Applied Math, Operations Research, etc.).</div></li>\n<li>\n<div>MS (Ph.D.) with 8+ (6+) years industrial experience, including 3+ years experience in managing a team.\n<br>\nExpertise in modern advanced analytical tools and programming languages, including at least Python, Scala, and Java.</div></li>\n<li>\n<div>Efficient in SQL, Hive, Spark, etc.</div></li>\n<li>\n<div>Comfortable working in a Linux environment</div></li>\n<li>\n<div>Expertise in data mining algorithms and statistical modeling techniques such as clustering, classification, regression, decision trees, neural nets, support vector machines, anomaly detection, sequential pattern discovery, and text mining.</div></li>\n<li>\n<div>Solid communication skills -- demonstrated ability to explain complex technical issues to both technical and non-technical audiences</div></li>\n</ul>\n<strong>Preferred Additional Experience:</strong>\n\n<ul>\n\n<li>\n<div>Prior experience working in the security or anti-fraud space</div></li>\n<li>\n<div>Prior experience in PM role</div></li>\n</ul>"}