{"job title": "Senior Data Scientist, Business Analytics - QuickBooks Self Employed", "company": "Intuit", "city state": "– Mountain View, CA", "rating": "4.2", "job description": "Overview<br><br>Here in the Quickbooks Self Employed team, we like to think of ourselves as a startup within Intuit. Like any good startup story, weve now hit the point where we know we have product/market fit and are really starting to grow. Of course, no story about analytics in a startup would be complete without all manner of interesting data challenges because the product and business are evolving rapidly. Over the last year, weve gone from not being able to trust our logging to now having good enough logging where we can provide our customers the basics in terms of KPIs, reporting, and insights.\n<br><br>\nWhile weve covered the basics, whats the fun in settling for that? Now is the time to build upon our foundation and make analytics a differentiator that allows us to serve the self-employed like nobody else can. In this role, your first mission will be to help us make take our reporting and insights solutions and make it easy for our internal customers to find what they need. . .in other words, our reporting should look like the sort of product wed ship to world and not a cobbled together collection of Tableaus that only an analyst could love. But dont assume this is a reporting role. . .thats just the most impactful thing we can do right now. Along with that, we have all manner of other unsolved problems in areas such as experimentation and conversion modeling that well need you to help us solve in order to serve our customers. While our team is comprised of people from varying backgrounds who can do a number of things, we all have one thing in common - we enjoy working on the highest impact problems, whatever that may happen to mean at the time.\n<br><br>\nWhat does it take to thrive in this role? You need to be a top-notch problem solver and identifier (no points for an elegant solution to the wrong problem). Its also a good idea to know the standard suite of analytical tools - SQL, R/Python, some sort of data visualization tool - but more importantly you must know how to learn tools quickly. We also find that having a bit of a software engineering mindset is good too - much like good software solutions, good analytical solutions are scalable and repeatable as this is what allows to solve a problem once and go tackle the next one. Last, knowing that in most cases done is better than perfect is important - at this stage of the journey, getting the current problem right to the sixth decimal place is almost always less impactful than getting to the next problem.\n<br><br>\nIf this role sounds interesting go check out the product (http://selfemployed.intuit.com or check out the app) and if you find this exciting, then we look forward to hearing from you!<br><br>Responsibilities\n\n<ul>\n<li>Solve marketing and product analytics problems by doing work such as developing data structures, pipelines, and data visualizations that enable us to find insights and take action by working with click data, event data, user provided data, third party data, and more</li><li>Perform analyses that inform decisions on everything from retention strategy to product experience using predictive and descriptive analytical techniques</li><li>Communicate findings from analyses in a way that enables business leaders to make better decisions</li><li>Ability to help design and execute product and marketing experiments through A/B testing</li>\n</ul>\n\nQualifications\n\n<ul>\n<li>5+ years of experience in generating and sharing insights from product/marketing data</li></ul>\n\n<ul>\n<li>Technical experience including SQL, some form of coding (Python, Scala, etc), and ETL/scheduling such tools as Airflow</li></ul>\n\n<ul>\n<li>Experience with data visualization tools such as Tableau, Superset, etc.</li></ul>\n\n<ul>\n<li>Experience working with SaaS-based subscription metrics including conversion, retention and product usage is preferred</li></ul>\n\n<ul>\n<li>Entrepreneurial spirit and passionate about data</li></ul>\n\n<ul>\n<li>Undergrad Degree in Quantitative Field (Masters preferred)</li>\n</ul>"}