{"job title": "Group Manager Data Science &amp; Analytics - QuickBooks Self Employed", "company": "Intuit", "city state": "– Mountain View, CA, United States", "rating": "4.2", "job description": "Overview<br><br>Come join Intuit as a Group Manager in the Small Business Group Data Analytics &amp; Science team, supporting the QuickBooks Self Employed Segment. We are looking for creative problem solvers with a passion to deliver data-driven insights. This position leads a team of talented analysts and scientists to work alongside with business stakeholders to deliver customer insights and recommendations.<br><br>Responsibilities\n\n\n<ul>\n\n<li>\n<div>Leads and nurtures a team of talented analysts and scientists with a focus on customer acquisition, retention and end-to-end customer experiences</div></li>\n<li>\n<div>Partners with business leaders (e.g. marketing, product and customer success) to define business strategies, areas of investment, and critical priorities</div></li>\n<li>\n<div>Translates business and analytics strategies into multiple short-term and long-term projects, and manages end-to-end execution</div></li>\n<li>\n<div>Activates analytics insights that lead to decisions or better hypotheses, and evangelizes innovative analytics ideas that enable new opportunities</div></li>\n<li>\n<div>Drives analytics rigor by inspecting and experimenting methodologies, improving techniques, and creating a learning culture</div></li>\n<li>\n<div>Drives data roadmap from data quality to data visualization, and marshals resources from multiple functions to deliver scalable solutions\n<br>\nRoles-model win-together while challenging status quo and driving changes across teams regardless of organizational structure</div></li>\n</ul>\nExamples of deliverables:\n\n<ul>\n\n<li>\n<div>Data insights to inform the future: development of KPIs, business performance diagnostics, customer behavioral analyses, self-service analytics, and etc. to drive actionable customer insights</div></li>\n<li>\n<div>Data products to transform customer experiences: personalized features, data predictions, propensity modeling, and etc. to make customer experiences more intelligent with data</div></li>\n<li>\n<div>Data capabilities to improve productivity: data roadmap with data engineering partners, continuous process improvement, tool and platform adoption, and etc. to raise data standards</div> </li>\n</ul>\n\nQualifications\n\n\n<ul>\n<li>10+ years of diverse analytics experience on end-to-end customer-level data</li>\n<li>Proven experience in leading a team of analysts and/or scientists</li> \n\n<li>Strong passion in uncovering strategic opportunities and solving business problems</li>\n<li>Proficient with SQL</li> \n\n<li>Experience in statistical modeling techniques</li> \n\n<li>Experience in data gap assessments, requirements and infrastructure implementation</li>\n<li>Outstanding communications skills with both technical and non-technical colleagues</li>\n<li>Undergraduate degree a must. Masters in a quantitative discipline preferred</li>\n</ul>"}