{"job title": "Data Scientist", "company": "Invesco", "city state": "– United States-New York", "rating": "3.6", "job description": "<div><div>Data Scientist(Job Number: 21902)</div><div><div>Description</div>\n<br>Invesco is a leading global asset management firm with more than $937B* in assets under management. We provide our retail and institutional clients a diverse and comprehensive range of investment capabilities to help people get more out of life. Invesco is publicly traded on the New York Stock Exchange (IVZ) and has about 7,000 employees in over 20 countries.\n<br>\n(*As of December 31, 2017)\n<br><br>\n<strong><u>Job Purpose (Job Summary)</u>:</strong><br><br><ul>\n<li>Take a hypothesis-driven approach to create valuable client insights and transformative business tools through the aggregating, manipulating, and disseminating of broad sets of data</li> <li>Work closely with colleagues in North America Retail Distribution to ensure that insights and tools are leveraged to improve marketing ROI and create distinctive client experiences</li> <li>Demonstrates strong business acumen (e.g., comfortable dealing with ambiguity, demonstrates strong business judgment, outcome-oriented with demonstrated drive for results), and communication (demonstrated ability to synthesize insights, strong written/oral communications)</li>\n</ul>\n<strong><u>Key Responsibilities / Duties</u>:</strong>\n<ul>\n<li>Data requirements and management:</li><li>Collaborate with business subject matter experts and IT teams to make strategic recommendations on data collection, integration and retention</li><li>Identify data needs and relevance to hypothesis testing</li><li>Wrangle both structured and unstructured data from both proprietary and third-party sources and use advanced data management tools and big data technologies</li><li>Develop usage and access control policies/systems and partner with other stakeholders in continuous improvement processes impacting data quality</li><li>Analytics:</li><li>Create/validate data-driven, analytical capabilities (i.e., predictive models/algorithms) to understand customer behavior and competitive dynamics</li><li>Works closely with other stakeholder groups to validate findings (e.g., with business partners) in a hypothesis-driven approach</li><li>Work with ambiguity (e.g. imperfect data, loosely defined concepts, ideas, or goals) and translating these into more tangible outputs</li><li>Communication and change advocacy:</li><li>Present and depict recommendations so that business stakeholders can make data-informed decisions</li><li>Convey complex solutions in easy to understand terms through usage of data visualization and clear written and verbal communication</li><li>Actively leads the organization to test and buy-in to novel solutions to important problems, both from an IT and business perspective</li><li>Metrics and outcome measurement:</li><li>Provides ongoing monitoring of performance of decision systems and statistic models</li><li>Suggests metrics on business outcomes (particularly those related to new capabilities) that are clear, accurate, relevant, logical and honest</li></ul></div>\n<br>\n<div><div>Qualifications</div>\n<br><strong><u>Work Experience / Knowledge</u>:</strong>\n<ul>\n<li>6-10 years of hands-on experience developing and applying predictive models and other advanced statistical approaches in a corporate or consulting setting</li><li>Experience with digital analytics (next product to buy, cross channel attribution modeling, digital analytic tools, dynamic ecommerce pricing, etc)</li><li>Technical competencies:</li><li>Proficiency in statistical data analysis and data mining packages (e.g., R, SAS, SPSS, Alteryx, MatLab, STATA, Excel)</li><li>Advanced knowledge of data management tools including SQL/RDBMS, NoSQL (e.g. MongoDB), Hadoop and/or other big data technologies</li><li>Advanced programming skills in at least one of Java, Python, R, C++, C#, etc.</li><li>Experience linking multiple data platforms (social media, open, etc) and with data visualization tools (e.g., Tableau)</li>\n</ul>\n<strong><u>Skills / Other Personal Attributes Required</u>:</strong>\n<ul>\n<li>Leadership - Collaborative:</li><li>Influences and persuades others and builds consensus towards a common goal or objective</li><li>Embraces role of his or her organization in the execution of Invesco’s broader strategic goals</li><li>Distinctive communications skills and ability to communicate technical content in an easy to understand way</li><li>Serves as a change advocate and encourages experimentation</li><li>Leadership – Decision making:</li><li>Intellectual curiosity, along with excellent problem-solving and quantitative skills, including the ability to disaggregate issues, identify root causes and recommend solutions</li><li>Ability to independently own database development and decisions, balancing demands and deadlines</li><li>Client Relationships – Client presence:</li><li>Consistently establishes credibility with Invesco leadership and treats internal stakeholders as “clients”</li><li>Results achievement:</li><li>Ability to set and implement strategy to achieve Invesco’s organizational goals (e.g., Top 5 ranking at largest distribution partners)</li>\n</ul>\n<strong><u>Formal Education</u>:</strong> (minimum requirement to perform job duties)\n<ul>\n<li>Undergraduate or advanced degree in a quantitative discipline (i.e. Statistics, Mathematics, Econometrics, Operations Research, Computer Science)</li><li>Strong academic qualifications, including advanced understanding/coursework in database management and math (Linear, Algebra, Calculus)</li>\n</ul>\n<strong><u>Working Conditions</u>:</strong>\n<ul>\n<li>The position is located in the United States (specific city TBD by candidate, client, and/or IVZ need)</li><li>Sitting and occasional lifting of less than 20 pounds</li>\n</ul>\n<strong><u>FLSA (US Only)</u>:</strong> Exempt\n<br><br>\nThe above information on this description has been designed to indicate the general nature and level of work performed by employees within this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The job holder may be required to perform other duties as deemed appropriate by their manager from time to time.\n<br><br>\nInvesco's culture of inclusivity and its commitment to diversity in the workplace are demonstrated through our people practices. We are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, creed, color, religion, sex, gender, gender identity, sexual orientation, marital status, national origin, citizenship status, disability, age, or veteran status. Our equal opportunity employment efforts comply with all applicable U.S. state and federal laws governing non-discrimination in employment.</div>\n<br>\n<div>North America-United States-New York-New York-1166 Avenue of the Americas</div></div> <div><div></div></div>"}