{"job title": "Scientist", "company": "Ionis Pharmaceuticals", "city state": "– Carlsbad, CA", "rating": "3.3", "job description": "<div> Requisition Number 18-0164</div> <div> Post Date 10/15/2018</div> <div> Company Ionis</div> <div> Title Scientist</div> <div> Employment Type Full Time</div> <div> Description<br><br>Ionis Pharmaceuticals, Inc., located in the North San Diego County city of Carlsbad, was founded in 1989 to create advanced, novel medicines to treat diseases with an unmet medical need. We are the pioneer and leader in the discovery and development of antisense\n<br>\n drugs. By exploiting various cutting-edge RNA targeting technologies, we are capable of specifically and efficiently targeting any gene of interest, including ones which are not targetable by small molecules or antibodies. We currently have three approved\n<br>\n drugs, and a robust pipeline of over 30 drugs in various stages of clinical trials.\n<br><br>\nIonis is a challenging, motivating and rewarding environment designed to foster innovation and scientific excellence. Our success is a direct result of our outstanding employees. We are interested in bringing together individuals with different skill sets\n<br>\n into this creative environment to be part of a productive team. Join us and experience our unique culture while you develop and expand your career.\n<br><br>\n<strong>SCIENTIST</strong>\n<br><br>\nSUMMARY:\n<br><br>\nThis position is in the Neuroscience Drug Discovery Group, a group focused on identifying and validating treatments for neurodegenerative, neurodevelopmental and neuropsychiatric diseases. We are seeking a technically proficient individual to execute nucleic\n<br>\n acid (e.g. RNA isolation and qPCR) and protein-based assays (e.g. ELISA), as well as maintain cell culture systems. This is an individual contributor position that will be working in the laboratory as an integral part of the drug discovery team.\n<br><br>\nQUALIFICATIONS:\n\n<ul>\n<li>Hold a B.S. degree in molecular biology, biology, biochemistry, neuroscience or related field</li> \n\n<li>2 years of laboratory experience (in academia or industry) with proficiency in techniques focused on RNA such as RNA isolation, library preparation for NGS, qPCR, ddPCR, etc.</li> \n\n<li>Experience with basic cell culture systems preferred</li> <li>Experience with protein assays (e.g. ELISA, western blotting) a plus</li> <li>Experience handling laboratory animals a plus</li> <li>Ability to analyze data sets and maintain records</li> <li>Strong interpersonal skills with experience working in a team setting</li> <li>Strong organization, written and communication skills</li> <li>Ability to be successful in an intense work environment</li> \n</ul>\nExcellent salary and benefits package offered.\n<br><br>\nPlease visit our website, \n<br>\n<strong>www.ionispharma.com</strong>, for more information about Ionis and to apply for this position; reference requisition # 18-0164\n<br><br>\nNO PHONE CALLS PLEASE. PRINCIPALS ONLY.\n<br><br>\n<em>Ionis Pharmaceuticals, Inc. and all its subsidiaries are proud to be EEO employers.</em></div>\n<br>"}