{"job title": "Data Scientist - Programmer", "company": "IQVIA", "city state": "– Plymouth Meeting, PA", "rating": "3.4", "job description": "<p><b>The Analytics Center of Excellence</b></p><p>Drawing on the strengths of Quintiles and IMS Health, IQVIA is creating the next generation of clinical development. Our new solutions combine world-class clinical research and data-driven insights to offer clients more precise and predictable paths to product approval.</p><p></p><p>Our new Analytics Center of Excellence (ACOE) harnesses our global healthcare insights, working closely with our clinical and therapeutic experts to power evidence-driven design, speed site activation and recruit the right patients, faster. This is a new unit within our business, integrated within Clinical Operations. We’re using big data and advanced analytics to derive insights that transform clinical development and bring new medicines to patients faster through successful trial delivery.</p><p>This multi-functional team is an innovation for our business, requiring entrepreneurial and independent thinking to build our capability. Unique and with a global view, this Center of Excellence is a chance to revolutionize the clinical research industry.</p><p></p><p><b>Data Scientist/Programmer– the role</b></p><p>As an analytics software expert, this is a unique opportunity to build unparalleled in-depth knowledge within our business. Working with modern distributed analytics systems, complex data, and challenging requests, you will have the opportunity to apply complex code, and possibly move into a Methodology role within IQVIA.</p><p></p><p><b>Your typical activities might include:</b></p><ul><li>Collaborating with business owners, subject matter experts, and go to market teams to develop and deliver analytics.</li><li>Leveraging data assets to support CRO business, optimizing design and execution of clinical trials, and improving risk management. </li><li>Overseeing multiple projects from concept to completion. </li><li>Direct analytical methodology research, project execution, streamlining process and building efficiencies.</li><li>Production deployments of advanced analytics.</li><li>Comprehensive testing of your own code.</li></ul><p></p><p><b>Qualification:</b></p><p>Our ideal candidate will have:</p><ul><li>A Bachelors or Masters degree in Statistics, Economics, Computer Science or a related field.</li><li>At least two years of relevant quantitative experience analyzing data.</li><li>Alternatively, a relevant combination of education, training and work experience.</li><li>Experience with at least 2 of the following: Python, R, Scala, or Java</li><li>Experience with Spark, SparkR, and PySpark within distributed environment is preferred.</li><li>Strong SQL or Hive skills.</li><li>Experience working with large volumes of complex claims data.</li><li>Local language skills to an advanced level (spoken and written), with complete fluency in English.</li></ul><p></p><p>IQVIA is an EEO Employer - Minorities/Females/Protected Veterans/Disabled</p><p></p><p>We know that meaningful results require not only the right approach but also the right people. Regardless of your role, we invite you to reimagine healthcare with us. You will have the opportunity to play an important part in helping our clients drive healthcare forward and ultimately improve human health outcomes.</p><p></p><p>Whatever your career goals, we are here to ensure you get there!</p><p>We invite you to join IQVIA™.</p><p></p><p>#LI-TF1<br>#GLD<br> </p>"}