{"job title": "Data Science Manager", "company": "IRi", "city state": "– Chicago, IL", "rating": "2.9", "job description": "Job Description\n<br>\nWhat will I do as a Data Science Manager?\n<br><br>\nAssist in the execution of statistical studies and analyses required to support the maintenance and improvement of IRI’s methodologies and algorithms and to answer client questions and concerns.\n<br><br>\nWhat are the responsibilities of a Data Science Manager?\n<br><br>\n- Perform statistical and analytical studies by following established procedures\n\n\n<ul>\n<li>Execute customized research studies to create and enhance IRI methodologies and algorithms</li>\n<li>Document technical requirements and support implementation and testing of new and improved methodologies and products</li>\n<li>Identify potential data, program, or methodological issues and report to lead</li>\n<li>Update and maintain existing software and databases</li>\n<li>Write, validate and execute software to support data investigation and statistical analysis</li>\n<li>Transfer business and technical knowledge gained on one project to work doing on the next</li>\n<li>Obtain a basic understanding of IRI business and industry and apply to day to day activities</li>\n<li>Meet strict deadlines for project completion</li>\n<li>Effectively execute and satisfy multiple concurrent projects on a timely basis\n<br><br>\nWhat are the qualifications?\n<br><br>\n- M.S. in Applied Statistics, Mathematics, Analytics or other quantitative field; or a Bachelors in Applied Statistics, Mathematics, Analytics or other quantitative field with 3 years of relevant experience.</li>\n<li>Advanced-level programming proficiency using SAS and/or R and SQL. Knowledge of other programming languages (e.g., Alteryx, Python) is a plus.</li>\n<li>Experience using UNIX/LINUX and/or mainframe operating systems</li>\n<li>Appropriate knowledge of specialized statistical skills required for position</li>\n<li>Positive, team player with the ability to problem-solve independently</li>\n<li>Proficient at analyzing data from varied sources to find root cause and resolve issues</li>\n<li>Excellent written and verbal communication skills</li>\n\n</ul>"}