{"job title": "Senior Big Data Modeler - Director", "company": "IRi", "city state": "– Chicago, IL", "rating": "2.9", "job description": "Job Description\n<br>\nWhat will I do as a Modeler?\n<br><br>\nWe are looking for strong, experienced individuals with experience in Business Intelligence Architecture (BI) and Analytical (OLAP) Modeling. Ideal candidate will be 60% client facing/team responsibilities and 40% hands-on involvement on building solutions. Sound Good? This position for you! Salary is negotiable and commensurate with experience.\n<br><br>\nWhat are the qualifications?\n<br><br>\nPosition - Director\n<br><br>\nRelevant Years of Experience - 7+ yrs\n<br><br>\nLocation - Chicago\n<br><br>\nQualifications\n<br><br>\nBachelors degree in Computer Science or related (must-have). Masters in Computers/Analytics/Business administration and/or additional technical or project management certifications will be a plus\n<br><br>\nWork domain\n<br><br>\nBusiness Intelligence Architecture (BI) and Analytical (OLAP) Modeling\n<br><br>\nWork mix - 40 % client facing/managerial responsibilities and 60% hands-on involvement on building solutions\n<br><br>\nTravel - Yes. 3-5 days a month\n<br><br>\nTeam management responsibilities - Yes - 2 -5 members\n<br><br>\nTechnical skills - Business Intelligence products\n<br><br>\nOne or more of the following - SAP HANA, Microsoft Analysis services, QlikView, Tableau, Cognos, Hyperion, Powepivot, Pentaho, Microstrategy, Oracle BI , other BI products\n<br><br>\nScripting Languages - Python, Perl, C#, C/C++\n<br><br>\nETL Tools ( ETL - extract, transform and load data)\n<br><br>\nOne or more of the following DataStage, Informatica, Talend, Ab initio, Microsoft Integration services, Aptar, Syncsort\n<br><br>\nDatabases - One or more of the following - Postgres, Hadoop, Oracle, IBM DB2, MS SQL, Netezza, Teradata, Sybase\n<br><br>\nBig Data ecosystem - Hadoop, Mongo, NoSQL, Spark, Tachyon\n<br><br>\nStatistical and simulation tools - R, MLPack, SPSS, SAS, Mat LAB\n<br><br>\nBackground, Domain and Soft skills - Creative, experienced and skilled enough to not require detailed requirements and who can take direction and operate independently. Not hesitant to put out ideas and review options with a broader group\n<br><br>\nStrong communication and client facing skills - review issues, collect requirements, iterate on options, present solutions/model results to clients, gain client buy-in\n<br><br>\nAptitude for numbers and strong quantitative skills\n<br><br>\nTeam player and able to work well with both onsite and virtual teams (from other locations in US and India)\n<br><br>\nWorked directly or delivered large scale analytics and datawarehouse projects to clients in consumer packaged goods/retail/pharma/finance/telecom verticals\n<br><br>\nAny prior experience with other large market research firms/BI consulting divisions from larger companies (Oracle, Microsoft, SAP, IBM, Accenture) will be a plus\n<br><br>\nAny prior experience working with multi site teams - onshore/offshore will be a plus"}