{"job title": "Data Scientist - AWM Production and Infrastructure", "company": "J.P. Morgan", "city state": "– Plano, TX", "rating": "3.8", "job description": "<div><strong><em>Asset and Wealth Management Production and Infrastructure</em></strong> (AWMP&amp;I) technology team develops and manages the suite of applications, infrastructure components and systems that support financial accounting, client reporting, business profitability analysis, information websites, investment engines, pricing databases, decision-making and data processing. The technologies and business applications we support and provide oversight for include business applications, data centers, servers, desktops, networks, communications systems, contingency sites and much more.</div> \n<br>\n<div><strong>AWMP&amp;I is comprised of a global management team who specialize in:</strong></div>\n\n\n<ul>\n<li>Production Support (Application Services Delivery)</li>\n<li>Technology Infrastructure Architecture and Engineering</li>\n<li>Distributed Computing Infrastructure Support</li>\n<li>End User Technology</li>\n<li>Infrastructure Solutions Management</li>\n</ul>\n\n<div>We're looking for an individual to apply data analytics/data scientist techniques to drive better discussions and help solve difficult problems. This person must be creative, self-motivated, persistent, and innovative. The issues faced will be diverse and involve financial modeling, inventory analysis, cost optimization, and forecasting. Success in this role will be defined by the individual's ability to understand data about technology infrastructure stored in disparate data stores and produce useful outputs that save costs, allow for smarter decisions, predict future demand, and address capacity issues.</div> \n<br>\n<strong><div>Responsibilities:</div>\n\n<br></strong>\n\n\n<ul>\n<li>Use data about the firm's infrastructure to drive better decisions, lower costs, help infrastructure groups understand their infrastructure better.</li>\n<li>Work cross team to define problem statements, collect data, build analytics models</li>\n<li>Create data drive optimization models for technology infrastructure</li>\n<li>Leverage tools like R, R Studio, Python, Hadoop, SQL.</li>\n<li>Further leverage machine learning techniques and algorithms like k-NN, Naïve Bayes, SVM, Decision Forests to improve the process</li>\n</ul>\n\n<div><strong>Qualifications</strong></div>\n\n\n<ul>\n<li>BS/BA degree or equivalent experience</li>\n<li>Proficient knowledge in the following key areas: Infrastructure Architecture (database, middleware, SAN, networks, virtualization, etc.).</li>\n<li>Proficiency in query languages like SQL, JSON, Hive, etc.</li>\n<li>Ability to work independently with little oversite.</li>\n<li>Good experience in operationalizing data governance and data quality.</li>\n</ul>\n\n<div>Our Asset and Wealth Management division is driven by innovators like you who are driven to create technology solutions that make us work more efficiently and help our businesses grow. Its our mission to efficiently take care of our clients wealth, helping them get, and remain properly invested. Across 27 cities, our team of 4,600 agile technologists thrive in a cloud-native environment that values continuous learning using a data-centric approach in developing innovative technology solutions.\n<br><br>\nWhen you work at JPMorgan Chase &amp; Co., youre not just working at a global financial institution. Youre an integral part of one of the worlds biggest tech companies. In 14 technology hubs worldwide, our team of 40,000+ technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world.\n<br><br>\nAt JPMorgan Chase &amp; Co. we value the unique skills of every employee, and were building a technology organization that thrives on diversity. We encourage professional growth and career development, and offer competitive benefits and compensation. If youre looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you.</div>"}