{"job title": "Data Scientist Associate, Workforce Analytics", "company": "J.P. Morgan", "city state": "– Jersey City", "rating": "3.8", "job description": "<div>\n<div><b>Human Resources – Workforce Analytics – Data Scientist (Associate)</b></div>\n<div> </div>\n<div>JPMorgan Chase &amp; Co. (NYSE: JPM) is a leading global financial services firm with assets of $2.5 trillion and operations worldwide. The firm is a leader in investment banking, financial services for consumers and small business, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase &amp; Co. serves millions of consumers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase &amp; Co. is available at www.jpmorganchase.com.</div>\n<div> </div>\n<div>Corporate Human Resources plays an integral role in designing, implementing, and managing global initiatives across the firm. The functional areas within Corporate HR include global Recruiting, Training, Talent and Development, Career Management, Diversity, Compensation, Benefits, Employee Relations, Technology, Finance, HR Service Delivery, and Workforce Analytics (WFA). </div>\n<div> </div>\n<div>\n<div>Workforce Analytics (WFA) is a newly established centralized global team. WFA is the application of quantitative methods, technology, and research to all of the people data and people decisions in the firm. We have a vision to help make individuals, teams, and businesses at JPMC among the most engaged and productive in the world. Our mission is to create workforce insights that help leaders make evidence-based people decisions that change behavior and drive measurable business outcomes. </div>\n<div> </div>\n<div><b>Position Overview &amp; Responsibilities:</b></div>\n<div> </div>\n<div>WFA Advanced Analytics is responsible for leveraging large quantities of people-related data to assist HR executives, business partners, and employees make data-driven decisions. This position will focus largely on machine learning and natural language processing (NLP) applied to large amounts of open-text data from a variety of JPMC-wide sources, including Exit Interview surveys, Employee Opinion surveys, Culture &amp; Conduct surveys, and other employee pulse polls. The Data Scientist will utilize experience exploring data, applying advanced statistical techniques, and designing machine learning algorithms to create innovative products that provide value to the company and its people. S/he will collaborate with HR Technology, Workforce Analytics Data Engineering, and other subject matter experts to build robust data pipelines, and will play a key role in improving the analytics infrastructure for WFA. The Data Scientist will report to the Head of WFA Advanced Analytics and join a highly agile cross-functional team that leads some of the most critical analytics projects in HR, including reporting and analytics deliverables for the firm-wide and HR Operating Committees. </div>\n<div> </div>\n<div><b>Candidate Profile</b></div>\n<div> </div>\n<div>The ideal candidate will demonstrate skill in client engagement, descriptive data analysis, and creative problem solving using programming languages like Python. S/He will possess significant knowledge and experience with natural language processing. S/He will have significant skill and experience in predictive model development &amp; validation, as well as in communicating technical subject-matter to a variety of audiences. </div>\n<div><b> </b></div>\n<div>Proven leadership and skills in data exploration, relationship management and data-driven story telling will be vital to success in this position. S/He must have proven successes in balancing long term visionary planning with the ability to create practical, actionable plans that are coherent and understood by stakeholders. Beyond strong programming and analytics skills, the ideal candidate will be innovative, self-motivated, and inclined to create genuine business value through the alignment of technology, data and business interests.</div>\n<div> </div>\n<div><b>Key Responsibilities</b></div>\n<ul>\n<li>Partner with HR, business, and functional groups to provide insightful analytics with actionable paths forward</li>\n<li>Gather, manipulate, and explore large datasets to test hypotheses and extract useful insights</li>\n<li>Reporting, data narratives, and analytics deliverables for the HR Operating Committee and others</li>\n<li>Build innovative models, tools and applications that apply NLP and machine learning algorithms at scale</li></ul>Partner with clients to promote evidence-based decision-making and devise action plans that nudge behavior changes </div>\n<div> </div>\n<div> </div></div>\n<div>\n<div><b>Requirements</b></div>\n<div> </div>\n<ul>\n<li>\n<div>B.S. in a quantitative field required; M.S. or Ph.D. preferred</div></li>\n<li>\n<div>2 years of professional experience in a related field desired</div></li>\n<li>\n<div>Significant SQL and Python programming experience</div></li>\n<li>\n<div>Strong communication skills and a team-oriented attitude</div></li></ul></div>\n<div> </div>"}