{"job title": "Capacity Planning Data Scientist", "company": "J.P. Morgan", "city state": "– Tampa", "rating": "3.8", "job description": "As a member of the Infrastructure Engineering team, you'll\n<br>\nplay a big part in designing the platforms, servers, and networks that make it\n<br>\npossible for us to provide service to our customers, clients, and businesses\n<br>\naround the globe each and every day. In this role you’ll call on your\n<br>\nexperience designing tailored solutions to understand the requirements of a\n<br>\nproject, test the performance of the infrastructure, and verify that the\n<br>\nrequirements have been successfully met. As a team, you and your peers\n<br>\nwill be responsible for driving results, collecting and analyzing monitoring\n<br>\ndata in test and production, and managing projects to completion. And\n<br>\nwhile you will be part of a tight-knit team of engineers who shares your\n<br>\npassion for technology, you’ll also gain access to the best minds in the\n<br>\nbusiness—both as part of the JPMorgan Chase &amp; Co. global technology\n<br>\ncommunity, and through our partnerships with some of the most important tech\n<br>\nfirms in the world.\n<br><br>\nThis role requires a wide variety of strengths and\n<br>\ncapabilities, including:\n<br><br>\n• BS/BA\n<br>\ndegree or equivalent experience\n<br><br>\n• Proficient\n<br>\nknowledge in the following key areas: Hardware Architecture (performance\n<br>\ntesting, monitoring, operations), Hardware Benchmarking (program management,\n<br>\nnetwork management), Design (compliance, security), Network Engineering\n<br>\n(planning, provision)\n<br><br>\n• Knowledge\n<br>\nof one specific infrastructure technology and basic programming languages or\n<br>\ndatabase management systems (Windows, LINUX, Oracle, MS SS, R, Python)\n<br><br>\n• Intermediate\n<br>\nunderstanding of LOB technology drivers and their impact on architecture design\n<br><br>\n• Knowledge\n<br>\nof more than one specific infrastructure technology\n<br><br>\n• Thinks\n<br>\ncreatively to deliver solutions through continuous improvement\n<br><br>\n• \n<br>\nStatistical\n<br>\nprogramming in R, Python, or equivalent\n<br><br>\n• \n<br>\nBasic\n<br>\nunderstanding of time-series forecasting\n<br><br>\n• \n<br>\nLinear and\n<br>\nnon-linear statistical modeling\n<br><br>\nOur Consumer &amp; Community Banking\n<br>\nGroup depends on innovators like you to serve nearly 66 million consumers and\n<br>\nover 4 million small businesses, municipalities and non-profits. You’ll support the delivery of award winning\n<br>\ntools and services that cover everything from personal and small business\n<br>\nbanking as well as lending, mortgages, credit cards, payments, auto finance and\n<br>\ninvestment advice. This group is also focused on developing and delivering\n<br>\ncutting edged mobile applications, digital experiences and next generation\n<br>\nbanking technology solutions to better serve our clients and customers.\n<br><br>\nWhen you work at JPMorgan Chase &amp;\n<br>\nCo., you’re not just working at a global financial institution. You’re an\n<br>\nintegral part of one of the world’s biggest tech companies. In 14 technology\n<br>\nhubs worldwide, our team of 40,000 technologists design, build and deploy\n<br>\neverything from enterprise technology initiatives to big data and mobile\n<br>\nsolutions, as well as innovations in electronic payments, cybersecurity,\n<br>\nmachine learning, and cloud development. Our $9.5B annual investment in\n<br>\ntechnology enables us to hire people to create innovative solutions that will\n<br>\nnot only transform the financial services industry, but also change the\n<br>\nworld.\n<br><br>\nAt JPMorgan Chase &amp; Co. we value the\n<br>\nunique skills of every employee, and we’re building a technology organization\n<br>\nthat thrives on diversity. We encourage\n<br>\nprofessional growth and career development, and offer competitive benefits and\n<br>\ncompensation. If you’re looking to build\n<br>\nyour career as part of a global technology team tackling big challenges that\n<br>\nimpact the lives of people and companies all around the world, we want to meet\n<br>\nyou.<br>\n\n<div>•It's\n<br>\ntime to take your career to the next level, and we can help. Apply today.</div>"}