{"job title": "Data Scientist", "company": "J.P. Morgan", "city state": "– Palo Alto", "rating": "3.8", "job description": "<div>\n<div>\n<div><b>About us</b></div>\n<div>Commercial Banking is a core business unit focused on Commercial Lending within the JP Morgan Chase group. The group is focused on an innovative journey to create a stealth mode division building a platform for the commercial Banking clients. The platform delivers a one stop shop for the commercial banking clients through AI-driven technologies and best-in class User Experience. The platform will also integrate with other business process related to commercial banking. We are looking out for creative entrepreneurs with high end user focus and who enjoy building large scale systems in the area of FIN tech/Prop tech. This is a unique opportunity to join a fast-paced internal startup team with the resources and support of the nation’s largest bank. The unit is based in Palo Alto and Bangalore. </div>\n<div> </div>\n<div><b>About the role</b></div>\n<div>The Data Scientist will drive the design and development of key artificial intelligence (AI) components of the JP Morgan Chase Commercial Real Estate platform including named entity recognition in natural language text, classifying business process actions from unstructured data, sequence mining actions into business process models and risk/conformance modeling.</div>\n<div> </div>\n<div><b>Responsibilities</b></div>\n<div>As a Data Scientist of an agile platforms group, the successful candidate will be leading the development of key aspects of JP Morgan Chase Commercial Real Estate product:</div>\n<ul>\n<li>Data mining using state-of-the-art methods</li>\n<li>Selecting features, building and optimizing classifiers using machine learning techniques</li>\n<li>Extending company’s data with third party sources of information when needed</li>\n<li>Enhancing data collection procedures to include information that is relevant for building analytic systems</li>\n<li>Processing, cleansing, and verifying the integrity of data used for analysis</li>\n<li>Creating automated anomaly detection systems and constant tracking of its performance</li></ul></div></div>\n<ul>\n<li>\n<div>The successful candidate will have experience in working in innovative projects with fast-paced delivery schedules in startups &amp; large enterprises:</div></li>\n<li>5 – 10 years of experience in Applied Machine learning</li>\n<li>Proven track record of analyzing large-scale complex data sets, modeling and machine learning algorithms</li>\n<li>Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.</li>\n<li>Experience with common data science toolkits, such as R, Python (NumPy, SciPy, Pandas ) , Matlab</li>\n<li>Experience in deep learning frameworks (e.g., Tensorflow, MxNet), and Large-scale optimization preferred.</li>\n<li>Experience with NLP toolkits such as NLTK, OpenNLP, Stanford CoreNLP etc.</li>\n<li>Proficiency in using query languages such as SQL</li>\n<li>Experience with NoSQL databases, such as MongoDB, Cassandra</li>\n<li>Good applied statistics skills, such as distributions, statistical testing, regression, etc.</li>\n<li>Educational background in a relevant field (Computer Science, Applied Math, Statistics)</li></ul>\n<div> </div>\n<div>The final officer title and job grade is at the discretion of the firm and will be discussed at the time of offer. It may be different than what is listed on the requisition based on candidate experience level. </div>"}