{"job title": "Genomics Scientist", "company": "Jackson Laboratory", "city state": "– Farmington, CT", "rating": "3.7", "job description": "Summary\n<br><br>\nThe Genomics Scientist is responsible for the management and execution of sequencing based projects as well as development, testing, validation and implementation of new genomic technologies and protocols. Strong background &amp; technical skills in molecular biology and sequencing technology improvement and optimization are required. Under the leadership of the senior genomics management, with limited supervision, the incumbent will be responsible for direct execution of experiments, assessment of QC for research/or service projects, and troubleshooting technical problems. The incumbent will also be responsible for the design, organization, and implementation of a multitude of sequencing-based molecular biology experiments in the areas of biomedical, clinical, and biotechnology research at JAX. They will ensure that sample preparation and sequencing production is maximized and will drive new technology development, process optimization, and pipeline and protocol development. A demonstrated team player with independent decision making in regard to technical and project management issues is required.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Development, testing, validation, and implementation of new genomic technologies and methodologies, improvement and optimization of protocols, including development and optimization of protocols for HTS library preparations 50%• Engage in sample/sequencing QC analysis and, when necessary, provide input and suggestions for additional features and improvements on the protocols and data analysis 15%• Initiate scientific projects by applying new technologies and analysis capabilities to showcase their robustness and discovery power. - 20%• Publish in peer review journals; contribute to scientific research papers, grant applications and reports - 15% • Other duties as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Ph.D. in Genetics, Biochemistry, Molecular Biology, and extensive experience in different aspects of genomics, including an excellent understanding of sequence data and its applications • Demonstrated knowledge and experience in sequencing based molecular approaches and sequencing based interrogation.• experience in protocol development and optimization procedures.• Effective problem-solving and decision-making skills.• Strong analytical, organizational, and record-keeping skills.• Excellent verbal and written communication skills, including public-speaking and presentation skills.• Demonstrated team player with the ability to work independently as well as part of a diverse team.• Ability to organize, manage and monitor multiple initiatives to successful completion, adapting to shifting priorities in a high-pressure environment• Excellent initiative and organizational skills to prioritize complex tasks, projects, and workflow, and use independent judgment to make decisions regarding operations and deadlines• Interpersonal relationship skills sufficient to allow incumbent to work effectively with individuals and groups made up of people representing a diversity of levels and degrees of sophistication• Experience in validation and documentation of new and complex molecular biology methods, and in HTS library preparation, operation and downstream data QC.• Strong publication record, and extensive experience in the preparation and handling of scientific manuscripts and reports• Prior LIMS (Laboratory Informatics Management System) experience is preferred.</li>\n</ul>\n\nAbout Us\n<br><br>\nThe Jackson Laboratory (JAX, www.jax.org) is a nonprofit biomedical research institute with over 2,000 employees whose mission is to discover precise genomic solutions for human disease and empower the global biomedical community in the shared quest to improve human health. A National Cancer Institute-designated Cancer Center, JAX has a mammalian genetics headquarters in Bar Harbor, Maine, a facility in Sacramento, California, and a genomic medicine facility, The Jackson Laboratory for Genomic Medicine (JAX-GM), in Farmington, Connecticut. JAX-GM sits on a 17-acre site on the campus of the University of Connecticut Health Center. The 183,500-square-foot facility opened in the fall of 2014. Now, it houses over 300 biomedical researchers, technicians and support staff in state-of-the-art computing facilities and laboratories. Our employees work in a collaborative, value-driven, and team-based environment where the focus is on advancing science and improving patients' lives.JAX employees work in a collaborative, value-driven, and team-based environment where the focus is on advancing science and improving patients' lives. Researchers apply genetics to increase the understanding of human disease and advance treatments and cures for cancer, neurological and immune disorders, diabetes, aging, and heart disease. JAX was voted among the top 15 \"Best Places to Work in Academia\" in the United States in a poll conducted by The Scientist magazine! Our Values:INTEGRITY - Courage and commitment to do what is rightPEOPLE - Inspiring our people to enhance the health of allONE TEAM - Unified by our promise to transform medicine and scienceEXCELLENCE - Achieving world-class resultsINNOVATION - Leading with discovery and creative solutionsSTEWARDSHIP - Caring for and enhancing the resources entrusted to us\n<br><br>\nWhat do we have to offer? JAX offers a dynamic and supportive work environment, competitive salaries, and a comprehensive benefits package, including a medical plan, outstanding retirement plan, generous paid time off, and tuition reimbursement including an MBA program. Our campus offers a fitness center with an award-winning wellness program, an onsite full service cafeteria, and a fully operational primary care facility available to employees and their families.Most importantly, every position contributes to JAX's mission of discovering precise genomic solutions for human disease and empowering the global biomedical community in our shared quest to improve human health.The Jackson Laboratory provides equal employment opportunities to all employees and applicants for employment in all job classifications without regard to race, color, religion, age, mental disability, physical disability, medical condition, gender, sexual orientation, genetic information, ancestry, marital status, national origin, veteran status, and other classifications protected by applicable state and local non-discrimination laws.Learn more about career opportunities at JAX: http://www.jax.org/careers.<br><br>SDL2017"}