{"job title": "Data Scientist", "company": "Jacobs", "city state": "– Washington, District of Columbia", "rating": "3.4", "job description": "<strong><br><br>Description</strong>\n<br><br>\nJacobs National Security Solutions (NSS) provides world-class IT network and service management capabilities; cutting edge cyber threat awareness and cybersecurity solutions; innovative web- and software applications development; and advanced data analytics for major clients in the Intelligence Community, Department of Defense, and Federal Civilian Agencies.\n<br><br>\nOur forward thinking solutions deliver an integrated approach to IT network design and management, full lifecycle IT service management, IT service delivery, asset management, logistics and procurement, and vendor management. We leverage the expertise and passion of our employees to conduct identity and access management, penetration testing, and vulnerability assessments for our nations most closely guarded agencies and networks. Our Cyber Security Operations Centers ensure safe, effective network operations for Federal clients while our data scientists are helping stop illegal acts before they can endanger Americans or our way of life.\n<br><br>\nJacobs promotes a culture of operational excellence to create a safer, smarter, and more connected world while upholding the highest standards of compliance, quality and integrity.\n<br><br>\nWe continue to thrive and need your talent and motivation to help propel us farther, faster.\n<br><br>\nJacobs is seeking a Data Scientist in Washington, DC. Duties will include:\n<li> Applying complex analysis of data in support of mission problems, with expertise in problem solving, scripting in multiple languages, as well as the creation and/or implementation of tools and processes that aid in advanced analytics, testing and quality assurance, and DevOps.</li> <li> Using and developing statistical analysis, modeling, simulation, and machine learning methods. Comfort with complex mathematical concepts and models.</li>  <li> Scripting, data collection and data management services; performing enterprise-wide data collection, storage, and manipulation; and, developed and implemented automated testing frameworks.</li>\n<strong><br><br>Qualifications</strong>\n<li> Active Top Secret security clearance with SCI eligibility.</li>  <li> BS degree in a related scientific or engineering discipline from an accredited college or university and ten (10) to fourteen (14) years of progressive experience, or an MS degree in a related scientific or engineering discipline, and eight (8) to twelve (12) years of progressive experience, or a Ph.D. degree in a related scientific or engineering discipline and four (4) to seven (7) years of progressive experience.</li>  <li> Experience with the following tools/languages: Python, R, STATA, Mathematica, Pig/Piglet, SQL, PostgreSQL, NoSQL, MSSQL, C++, bash, JMP, ROOT, Latex, MATLAB, Java, Javascript, XML, C++, MapReduce.</li> <li> Experience with AWS/cloud development and solutions architecture</li> <li> Experience with Agile Methodology/Scrum Development and DevOps</li> <li> Familiar with Jira and Confluence</li> <li> Experience working with multiple stakeholders, gathering requirements, analysis and integration resulting in informed deconning making, explaining highly technical concepts to a non-technical audience</li> <li> Preferred Qualifications: AWS Solutions Architect Certified ScrumMaster Masters Degree/PHD</li>  Essential Functions: Physical Requirements: Most work will be done at a desk or computer. Work Environment:<br><br>General Office environment. The work environment is fast-paced and sometimes involves extreme deadline pressures. The nature of the work requires a high degree of teamwork and cooperation with other members of the staff as well as individuals across the Company and Customers.<br><br>Equipment &amp; Machines:<br><br>General office equipment including PC/laptop, Fax, Copiers, Shredder, Printers, Telephone, and other miscellaneous office equipment.<br><br>Attendance:<br><br>Attendance is critical at all times. Must be able to work a 40-hour workweek, normally Monday through Friday. However, times and days may vary depending on business requirements. Needs to be available to work overtime during critical peaks and be available to meet last minute requests for overtime should the situation occur.<br><br>Other Essential Functions: Must be able to communicate effectively both verbally and in writing. Grooming and dress must be appropriate for the position and must not impose a safety risk/hazard to the employee or others. Must put forward a professional behavior that enhances productivity and promotes teamwork and cooperation. Must be able to interface with individuals at all levels of the organization both verbally and in writing. Must be well-organized with the ability to coordinate and prioritize multiple tasks simultaneously. Must work well under pressure to meet deadline requirements. Must be willing to travel as needed. Must take and pass a drug test and background check as well as a motor vehicle records check. Must be a US citizen.\n<br>\n#cjpost Jacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. Jacobs is a background screening, drug-free workplace."}