{"job title": "Data Scientist - IRES - SAFB", "company": "Jacobs", "city state": "– Colorado", "rating": "3.4", "job description": "<strong><br><br>Description</strong><br><br>The Data Scientist will work on the IRES Program supporting the Missile Defense Agency. The work location can be at Schriever AFB, Colorado, Redstone Arsenal, Huntsville, Alabama, or Ft Belvoir, Virginia. They apply knowledge and knowhow of data science to applications pertinent to subject matter experts at MDA. They collaborate with business units and endusers to create compelling and accurate data presentations based on the entire Data Analytics and Reporting service suite. They design and prototype data ingestion, cleaning, curation, storage and retrieval, concentrating particularly on analytics, statistical modeling, dissemination and presentation. The data scientist will work with developers and data analysts from the Data Analytics team to build and maintain endtoend user capabilities and interface based on business functional and performance requirements.#cjpost\n<br><br>\n<strong><br><br>Qualifications</strong><br><br><strong> Requirements</strong> : High School Diploma and 20 years general experience or an Associates degree and 18 years general experience or a Bachelors degree and 16 years general experience or a Masters degree and 14 years general experience. Requires 14 years directly related experience. Related experience must be in one or more of the following: Java, Microsoft Certified Solutions Developer (MCSD), Elasticsearch ELK Stack (or other Big Data) ecosystem, Cloudera, Kafka, Linux (Redhat), SQL, JSON, C++, Python, R, C#, Ruby, Agile methodologies, Adobe Certified Expert (ACE). Must have strong interpersonal skills and writing ability commensurate with programming skills, mathematical skills and statistical background. Candidate must possess a CompTIA Security+ with CE or higher or able to obtain certification within 30 days. Must be a US citizen and have an active DoD Secret clearance. <strong> Desired</strong> : Experience developing processes and training and cloud based system architectures and related tools. Experience with Cloudera, Kafka, Logstash, Redhat, SQL, JSON, C++, Python, R, C#, Ruby, Agile Methodologies, Adobe Certified Expert (ACE). Excellent interpersonal skills and ability to work both independently and in a fast-paced team environment. Excellent written and verbal communications skills required. Highly self-motivated and directed, with keen attention to detail. Creative problem-solving abilities. Ability to prioritize and execute tasks in a high-pressure environment. Ability to work with minimal oversight. Willing to work in a team-oriented, collaborative environment. Experience in large development initiatives, developing high volume database applications, data warehousing, complex shell scripting, Agile methodology and public or private cloud experience.Jacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. Jacobs is a background screening, drug-free workplace."}