{"job title": "Sr. Manager Data Science", "company": "Job Juncture", "city state": "– San Diego, CA", "rating": "5.0", "job description": "<strong>Our client is a leading analytical products company that is focused on advancing healthcare. Perfect location in CA.</strong>\n<br><br>\nThis is an awesome opportunity to be responsible for leading a team of data scientists that help deliver our next-generation analytics platform.\n<br>\nYou will work with data scientists, analysts, product management, software engineering, and clinical experts to take analytic innovation from the research lab to production applications.\n<br>\nYou will work in a large complex data environment with a variety of sources and technologies.\n<br>\nYou will be creating a real difference in making medication management safer, and efficient and cost effective.\n<br>\nThe selected candidate will bring new ideas, creativity and perspectives to our organization.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\t<li>Lead a team of data scientists and wranglers to build, maintain, and improve analytic decision systems and predictive models that drive significant customer impact</li>\t<li>Work with business leaders to understand their domains, desired outcomes, and translate product requirements into analytic deliverables</li>\t<li>Work with leadership to develop and execute on roadmap of desired analytic capabilities and product deliverables within committed timeframes</li>\t<li>Explore opportunities from internal and external data sources to innovate on new products and/or enhance existing models</li>\t<li>Present to senior management on business reviews, roadmap progress and innovation concepts</li>\t<li>Lead evaluation of emerging analytics technologies and services for selection and proper fit with the organization</li>\t<li>Drive an engaging, innovative and inclusive culture within your team</li>\t<li>Evaluate and manage external data science partners, as needed, to deliver on business goals</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n\n<ul>\n\t<li>Track record of delivering and maintaining successful data science products into commercial products and achieving desired customer outcomes in a dynamic environment</li>\t<li>5+ years managing, leading and developing direct reports</li>\t<li>Degree in a quantitative field (engineering, math, statistics, physics) with 10+ years of experience</li>\t<li>Expert level experience with <strong>multiple statistical and data related programming languages such as Python, R, SAS, SQL</strong></li>\t<li>Experience with various machine learning methods including classification/tree, SVM and ensemble approaches.</li>\t<li>Ability to effectively switch communication styles from business to technical audiences, ranging from in depth analysis to concise, high level messaging</li>\t<li>Understanding of software development and engineering practices including source control, CI/CD and DevOps</li>\t<li>Experience with agile, lean practices and methodologies</li>\t<li>Ability to work effectively in cross-functional groups. Must be able to excel in a fast-paced environment with multiple priorities.</li>\n</ul>\n\n<strong>Preferred skills</strong>\n\n<ul>\n\t<li>Experience with medical software such as Hospital Information Systems, Medical Record Systems or Lab Information Systems</li>\t<li>Knowledge of Hadoop, Cloud and other modern data architecture</li>\n</ul>\n\n<strong>MUST have</strong>\n<br>\n<strong>managing Data Science Teams for 5 years</strong>\n<br>\n<strong>successful delivery of complex data science and analytical problems</strong>\n<br>\n<strong>working with business stakeholders,</strong>\n<br>\n<strong>Evaluate current technologies and organization, align to meet business objectives</strong>\n<br>\n<strong>Lead and mentor a team</strong>\n<br>\n<strong>own execution of data science roadmap</strong>\n<br><br>\n<strong>OTHER DETAILS:</strong>\n<br>\n<strong>Visa sponsorship available</strong>\n<br>\nRelocation Assistance Available\n<br>\n<strong>7+ to 10 years’ experience</strong>\n<br>\nSeniority Level - Mid-Senior\n<br>\nAt least a Bachelor's Degree is required\n<br><br>"}