{"job title": "CPG Data Scientist", "company": "Jobspring Partners", "city state": "– Chicago, Illinois", "rating": "3.6", "job description": "Do you have a customer analytics and marketing background and are looking to leverage that and join a fast-growing company and team? We are working with a analytics company looking for candidates that have some sort of customer analytics or market experience to join their downtown Chicago office.\n<br><br>\nThey are looking for a data scientist with 2+ years of professional experience working in the marketing / consumer analytics space. The ideal candidate will have experience model building with Python and R , as well as having some sort of experience with ML and predictive analytics. Any Spark or Hadoop experience is a huge plus as well. Their team is small, but growing, and they are looking for an individual that enjoys working in a collaborative environment who has strong communication skills.\n<br><br>\nIn this role, youll be working heavily hands on, but also having a chance to lead and mentor some of the more junior scientists on their small Chicago team of 3. This position offers a lot of upward mobility and growth as the team continues to grow in this high-demand industry.\n<li> 2+ years professional data science experience in the marketing / consumer analytics space</li> <li> Professional ML / predictive analytics experience</li> <li> Experience with relational databases</li> <li> Collaborative, team-based approach to data science</li> <li> Experience with streaming tools such as Spark and Hadoop</li> <li> Cloud exposure</li> <li> Masters of PhD in Physics, Math, Stats, or related field</li>\nTech Breakdown\n<li> 100% Analytics 50% Reporting / 50% Predictive</li>  <li> 50% Python / R</li> <li> 25% SQL</li> <li> 25% Spark / Hadoop</li>\nDaily Responsibilities\n<li> 75% Hands On</li> <li> 25% Lead</li> <li> Total compensation up to 120k</li> <li> Generous PTO</li> <li> Growth potential and yearly raises</li>\nYou will receive the following benefits:\n<li> Medical Insurance &amp; Health Savings Account (HSA)</li> <li> 401(k)</li> <li> Paid Sick Time Leave</li> <li> Pre-tax Commuter Benefit</li>\nApplicants must be currently authorized to work in United States on a full-time basis now and in the future.\n<br><br>\nThis position does not offer sponsorship.\n<br><br>\nJobspring Partners, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) across 10 major North American markets. Our unique expertise in todays highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients."}