{"job title": "Data Scientist", "company": "Johns Hopkins University Applied Physics Laboratory", "city state": "– Laurel, MD", "rating": "4.6", "job description": "The Johns Hopkins Applied Physics Laboratory (APL) is a national leader in scientific research and development. APL is actively seeking a Data Scientist for the Health Data Sciences &amp; Analytics Group. The Data Scientist will support the National Health Mission Area, whose aim is to revolutionize health through science and engineering. JHU/APL is located midway between Baltimore and Washington, DC.\n<br><br>\nThe Health Data Science and Analytics Group provides cutting edge analytics contributions to national and global public health and healthcare challenges, developing solutions in Health Informatics, Population Health, Precision Medicine, Digital Health, Analytics and Software Systems. Our multidisciplinary team of engineers and scientists develop statistical and machine learning algorithms and incorporate visual analytics into software systems that process large and complex data sets. We are looking for data scientists, computer scientists, applied mathematicians, statisticians and software developers that are creative problem solvers and team players dedicated to building world class expertise to provide solutions for health and healthcare systems around the globe.\n<br><br>\nJob Summary:\n<br><br>\nDesign and develop novel computational algorithms and statistical methods and design corresponding data architectures to analyze large and complex data for a variety of challenging health and healthcare problems.\n<br><br>\nDuties:\n<br><br>\n1. Develop advanced algorithms and create software applications to perform analytics on large-scale and complex data for real-world health and healthcare applications. Assure milestones are met on time and be responsive to sponsor needs. Become a sought out resource by consistently producing high-quality results. Promote a climate conducive to intellectual curiosity, creativity, innovation, collaboration, growth, life-long learning, productivity, and respect for others. (80%)\n<br><br>\n2. Document and present papers on current research and analytic activities. (10%)\n<br><br>\n3. Communicate often and effectively with team, sponsors and JHU/APL leadership. Participate in the data science, analytics and APL community. Take advantage of collaboration and innovation opportunities to help ensure success of APL's mission. (10%)\n<br><br>\nNote: This job summary and listing of duties is for the purpose of describing the position and its essential functions at time of hire and may change over time.\n<br><br>\nRequired Qualifications:\n<br><br>\n• B.S. in Computer Science, Information Science, Mathematics, Statistics, Data Science, or related field.\n<br><br>\n• 1-5 years of experience.\n<br><br>\n• Experience in selecting, developing, and applying machine learning and data mining algorithms.\n<br><br>\n• Working knowledge of modern large-scale data systems and architectures.\n<br><br>\n• Experience with pattern recognition, statistical analysis and machine learning; solid software development skills with some of the following implementation languages: Python, R, Matlab, JAVA, or C /C;\n<br><br>\n• Excellent interpersonal skills and outstanding written and oral communication skills\n<br><br>\n• Strong problem solving skills strong analytical and organizational skills; ability to work independently or within a group.\n<br><br>\n• Must be eligible for Secret clearance requiring background investigation.\n<br><br>\nDesired Qualifications:\n<br><br>\n• M.S. or Ph.D. in the disciplines listed above.\n<br><br>\n• The ability to manage and manipulate large data sets.\n<br><br>\n• Ability to carry out original machine learning research and algorithm development.\n<br><br>\n• Experience in developing and applying machine learning algorithms in health and healthcare application settings.\n<br><br>\n• Experience with datadriven predictive model development, unstructured text mining, natural language processing, and anomaly and novelty detection.\n<br><br>\n• A strong technical writing background.\n<br><br>\n• Experience in medicine, emergency response, or public health applications and/or exposure to clinical information systems and medical data standards.\n<br><br>\nSpecial Working Conditions: Some travel to local sponsor sites and support for field testing may be required.\n<br><br>\nSecurity: Applicant selected will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship.\n<br><br>\nEqual Employment Opportunity: Johns Hopkins University/Applied Physics Laboratory (APL) is an Equal Opportunity/Affirmative Action employer that complies with Title IX of the Education Amendments Acts of 1972, as well as other applicable laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, sexual orientation, gender identity, national origin, disability, or protected veteran status."}