{"job title": "Research Data Analyst", "company": "Johns Hopkins University", "city state": "– Baltimore, MD", "rating": "4.1", "job description": "Classified Title: Research Data Analyst\n<br><br>\nWorking Title: Research Data Analyst\n<br><br>\nRole/Level/Range: ACRP/04/MC\n<br><br>\nStarting Salary Range: $44,750 - $61,600 (commensurate with experience)\n<br><br>\nEmployee group: Full Time\n<br><br>\nSchedule: Mon - Fri/ 7.5 hrs per day\n<br><br>\nExempt Status: Exempt\n<br><br>\nLocation: 05-MD:School of Public Health\n<br><br>\nDepartment name: 10001101-Epidemiology\n<br><br>\nPersonnel area: School of Public Health\n<br><br>\n<strong>General summary/purpose:</strong>\n<br><br>\nThe Research Data Analyst will perform data management and data analysis for an environmental infectious disease research study.\n<br><br>\n<strong>Specific Duties/Responsibilities:</strong>\n\n\n<ul>\n<li>Manage data sets within the R Statistical Computing Environment</li>\n<li>Perform exploratory, inferential, and prediction analyses of environmental time-series data within the R Statistical Computing Environment</li>\n<li>Produce descriptive summaries of analyses, including written text, tables and figures for manuscripts, grants and reports</li>\n</ul>\n\n<strong>Minimum qualifications:</strong>\n<br><br>\nBachelor's degree in related discipline and three years of related experience required. Additional education (Master's level) may substitute for some required experience, to the extent permitted by the JHU equivalency formula.\n<br><br>\nJHU Equivalency Formula: 30 undergraduate degree credits (semester hours) or 18 graduate degree credits may substitute for one year of experience. Additional related experience may substitute for required education on the same basis. For jobs where equivalency is permitted, up to two years of non-related college course work may be applied towards the total minimum education/experience required for the respective job.\n<br><br>\n<strong>Preferred qualifications:</strong>\n\n\n<ul>\n<li>Experience with spatial-temporal analyses</li>\n<li>Experience with Bayesian statistics, and using related R packages</li>\n</ul>\n\n<strong>Special knowledge, skills, and abilities:</strong>\n\n\n<ul>\n<li>This position requires expert proficiency in R packages.</li>\n<li>Must be able to work with inter-related databases.</li>\n<li>Experience in temporal statistics is required.</li>\n</ul>\n\nThe successful candidate(s) for this position will be subject to a pre-employment background check.\n<br><br>\nIf you are interested in applying for employment with The Johns Hopkins University and require special assistance or accommodation during any part of the pre-employment process, please contact the HR Business Services Office at jhurecruitment@jhu.edu. For TTY users, call via Maryland Relay or dial 711.\n<br><br>\nThe following additional provisions may apply depending on which campus you will work. Your recruiter will advise accordingly.\n<br><br>\nDuring the Influenza (\"the flu\") season, as a condition of employment, The Johns Hopkins Institutions require all employees who provide ongoing services to patients or work in patient care or clinical care areas to have an annual influenza vaccination or possess an approved medical or religious exception. Failure to meet this requirement may result in termination of employment.\n<br><br>\nThe pre-employment physical for positions in clinical areas, laboratories, working with research subjects, or involving community contact requires documentation of immune status against Rubella (German measles), Rubeola (Measles), Mumps, Varicella (chickenpox), Hepatitis B and documentation of having received the Tdap (Tetanus, diphtheria, pertussis) vaccination. This may include documentation of having two (2) MMR vaccines; two (2) Varicella vaccines; or antibody status to these diseases from laboratory testing. Blood tests for immunities to these diseases are ordinarily included in the pre-employment physical exam except for those employees who provide results of blood tests or immunization documentation from their own health care providers. Any vaccinations required for these diseases will be given at no cost in our Occupational Health office.\n<br><br>\nEqual Opportunity Employer\n<br><br>\nNote: Job Postings are updated daily and remain online until filled.\n<br><br>\nEEO is the Law\n<br><br>\n<strong>Learn more:</strong>\n<br><br>\nhttps://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\nImportant legal information\n<br><br>\nhttp://hrnt.jhu.edu/legal.cfm\n<br><br>\nSchool of Public Health - East Baltimore Campus"}