{"job title": "Data Scientist", "company": "John Deere", "city state": "– Johnston, IA", "rating": "4.0", "job description": "There are 7 billion people on this planet. And by 2050, there will be 2 billion more... many moving into urban centers at an unprecedented rate. Making sure there is enough food, fiber and infrastructure for our rapidly growing world is what we’re all about at John Deere. And it’s why we’re investing in our people and our technology like never before in our 175-year history. Here the world’s brightest minds are tackling the world’s biggest challenges. If you believe one person can make the world a better place, we’ll put you to work. RIGHT NOW.\n<br><br>\nPrimary Location: United States (US)&nbsp;- Iowa (US-IA)&nbsp;- Johnston&nbsp;\n<br>\nFunction: Data Science &amp; Analytics\n<br>\nTitle: Data Scientist&nbsp;- 46546\n<br><br>\n<strong>Your Responsibilities</strong>\n<br><br>\n&nbsp;\n<br><br>\nAs a <strong><em>Data Scientist</em></strong> for John Deere Financial located in Johnston, IA, you will utilize prescriptive and predictive analytics to generate insights that provide value to customers, the channel, and Deere. In addition, you will:\n<br><br>\n&nbsp;\n<ul>\n<li>Build statistical models and algorithms to support cross sell, up sell, sales lead generation, customer retention, and our understanding of marketing campaign effectiveness</li><li>Investigate the use of highly complex methodologies, including machine learning and deep learning, in marketing and/or sales applications</li><li>Identify data necessary for analysis</li><li>Write routines to retrieve data from new, complex, or messy data sources and/or partner with entry level Data Wranglers to pull data from existing data sources with higher quality and lower complexity</li><li>Develop solutions and/or visualizations to allow business users (e.g. dealers, marketers, sales professionals) to leverage the insights</li><li>Partner with Data &amp; Analytics Catalyst to communicate value and drive adoption</li><li>Stay up-to-date with the latest appropriate analytical techniques and recommend these where needed</li><li>Explain implementation and usage in business terms</li><li>Work closely with the Data Infrastructure teams to ensure data is modeled efficiently and in such a way to facilitate the required analytics</li><li>Support the business transformation of the Enterprise through analytics</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Visa sponsorship is <u>NOT</u> available for this position.</strong>\n<br><br>\n&nbsp;\n<br><br>\n<strong>What Skills You Need</strong>\n<br><br>\n&nbsp;\n<ul>\n<li>1 or more years of experience applying statistical analyses and analytical methodologies on advanced analytics projects, being able to demonstrate the development of algorithms and predictive models to solve business issues</li><li>Proficiency in at least one statistical programming language (e.g. R, SAS, Python, SQL)</li><li>Proven ability to influence without authority</li><li>Proven ability to communicate complex, technical information to a non-technical audience</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>What Makes You Stand Out</strong>\n<br><br>\nOther areas of experience or interest that will help us place you on the right team include:\n<ul>\n<li>Experience with analytics/big data platforms and/or technologies such as AWS, Hadoop, Spark, Scala</li><li>Knowledge of and experience with multiple statistical programming languages such as R, SAS, Python, SQL</li><li>Knowledge of User Experience (UX) and/or design</li><li>Knowledge of Deere products, JDF products, customers, dealer and merchant channel</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Education <em>(or equivalent work experience)</em></strong>\n<br><br>\n&nbsp;\n<ul>\n<li>Bachelor's degree in in statistics, data science, mathematics, economics or computer science or equivalent experience</li><li>Master’s degree in statistics, data science, mathematics, economics or computer science</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>What You'll Get</strong>\n<br><br>\nAt John Deere, you are empowered to create a career that will take you to where you want to go. Here, you'll enjoy the freedom to explore new projects, the support to think outside the box and the advanced tools and technology that foster innovation and achievement. We offer comprehensive relocation and reward packages to help you get started on your new career path. Click here&nbsp;to find out more about our Total Rewards Package.\n<br><br>\nThe information contained herein is not intended to be an exhaustive list of all responsibilities and qualifications required of individuals performing the job. The qualifications detailed in this job description are not considered the minimum requirements necessary to perform the job, but rather as guidelines.\n<br><br>\nJohn Deere is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, sex, age, sexual orientation, gender identity or expression, status as a protected veteran, or status as a qualified individual with disability.\n<br><br>\n&nbsp;"}