{"job title": "Data Scientist", "company": "Johns Hopkins Medicine", "city state": "– Glen Burnie, MD", "rating": "3.9", "job description": "Data Scientist\n<br><br>\nRequisition #: 174156\n<br><br>\nLocation: Johns Hopkins Health Care, Glen Burnie, MD\n<br><br>\nCategory: Non-Clinical Professional\n<br><br>\nWork Shift: Day Shift\n<br><br>\nWork Week: Full Time (40 hours)\n<br><br>\nWeekend Work Required: No\n<br><br>\nDate Posted: Aug. 24, 2018\n<br><br>\nJohns Hopkins Health System employs more than 20,000 people annually. Upon joining Johns Hopkins Health System, you become part of a diverse organization dedicated to its patients, their families, and the community we serve, as well as to our employees. Career opportunities are available in academic and community hospital settings, home care services, physician practices, international affiliate locations and in the health insurance industry. If you share in our vision, mission and values and also have exceptional customer service and technical skills, we invite you to join those who are leaders and innovators in the healthcare field.\n<br><br>\nThe Healthcare Economics Data Scientist will be responsible for the creation, development, and communication of Healthcare Economics analysis, data mining, and pattern-recognition capabilities; providing specialized analytics and data driven insights to myriad business units through the organization; and using large data sets to find opportunities for product and process optimization, and building models to test the effectiveness of various courses of action. This position collaborates with a group of Healthcare Economics professionals to support the organization's goal of providing executive leadership with actionable intelligence related to the financial, clinical, and population health performance of various lines of business within JHHC. This position is responsible for providing insights and recommendations using statistical and quantitative analysis coupled with explanatory and predictive modeling to drive focused decision making. Must have strong experience using a variety of data mining and analysis tools, using/creating algorithms and designing/running simulations in a healthcare, payor, or clinical setting.\n\n\n<ul>\n<li>Develops financial reporting and analytics to measure ROI and support cross-functional initiatives</li>\n<li>Liaises among finance, population health, health services, and data/IT to scope projects and initiatives, maximize effectiveness of data sources and quality, and determine financial impact; Collaborates with Health Services and Population Health teams to design clinical service initiatives to improve quality of care delivery while improving cost and utilization</li>\n<li>Provides economic acumen and insight to financial projection processes including risk scores, cost and utilization trend analysis, financial benchmarking, and ad hoc analysis; proven ability to drive business results with data-driven insights.</li>\n<li>Uses data science methodologies to scan available data pools for predictive patterns in member population, and works with Healthcare Economics team to identify clusters, behavioral or care patterns, and outliers having direct impact on cost or revenue drivers.</li>\n<li>Supports specialized reporting and financial projects for business units throughout the organization</li>\n<li>Serves as a go-to for leaders and stakeholders throughout the organization to craft creative financial approaches to practical business issues</li>\n<li>Creates financial and predictive models to evaluate the feasibility and key success drives for new ventures, opportunities, and translates prediction into prescriptive models for operational success</li>\n</ul>\n\nRequirements:"}