{"job title": "Senior Scientist, Computational Biology-Oncology Translation...", "company": "Johnson &amp; Johnson Family of Companies", "city state": "– Spring House, Pennsylvania", "rating": "NA", "job description": "SunIRef:it\n<br><br>\nSenior Scientist, Computational Biology-Oncology Translational Research - Spring House, PA - **********\n<br><br>\nFind Jobs\n<br>\nCompany Reviews\n<br>\nFind Salaries\n<br>\nFind Resumes\n<br>\nEmployers / Post Job\n<br>\nUpload your resume\n<br>\nSign in\n<br><br>\nHome\n<br><br>\nwhatjob title, keywords, or company\n<br><br>\nwherecity, state, or zip code\n<br><br>\nFind Jobs\n<br><br>\nAdvanced Job Search\n<br><br>\nSenior Scientist, Computational Biology-Oncology Translational Research\n<br><br>\nJohnson &amp; Johnson Family of Companies\n<br><br>\n3,552 reviews\n\n<li>Spring House, PA</li>\n\nJohnson &amp; Johnson Family of Companies\n<br><br>\n3,552 reviews\n<br><br>\nRead what people are saying about working here.\n<br><br>\nDesired: BioinformaticsPerlJavaStatisical AnalysisPythonMachine LearningLinuxRC/C++\n<br><br>\nJanssen Research &amp; Development, L.L.C., a Johnson &amp; Johnson company, is recruiting for a Senior Scientist, Translational Research. This position can be located in Spring House, PA.\n<br><br>\nJanssen Research &amp; Development, LLC discovers and develops innovative medical solutions to address important unmet medical needs in oncology, immunology, neuroscience, infectious diseases and vaccines, and cardiovascular and metabolic diseases. Please visit ************************* for more information.\n<br><br>\nThriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer.\n<br><br>\nIn this role, you will provide data analysis and Computational Biology support for the Oncology therapeutic area. In this role, you will work in close collaboration with scientists in Translational Research, Discovery, Early and Late Clinical, Discovery Sciences, Data Sciences, and Quantitative Sciences to analyze, integrate, and interpret high dimensional data from a variety of platforms including next-generation sequencing, gene expression microarrays, CyTOF, SNP arrays, RBM, and flow cytometry panels. With a focus on immuno-oncology, you will provide oncology data analysis and computational biology support to identify disease mechanisms, mechanism of action for therapeutic interventions, and candidate biomarkers for the Oncology Therapeutic Area. You will build, analyze, and interpret biological networks from disparate data sources. You will also collaborate with R &amp; D IT to implement informatics systems that address the Oncology Therapeutic Area needs.\n<br><br>\nYou will perform real-time bioinformatics and statistical analysis, visualization, and data interpretation for Oncology Disease Area Strongholds (DAS) with a focus on immuno-oncology program. You will use statistical and machine learning methods to identify prognostic and predictive biomarker signatures from high dimensional biological data. You will integrate data from external (e.g. NCBI Entrez, NCBI GEO, TCGA/ICGC, dbGaP/EGA, COSMIC, UCSC Genome Browser, Ingenuity) and internal sources, including clinical biomarker data. You may also evaluate and develop novel algorithms and approaches for data analysis.\n<br><br>\nYou will communicate results to bench scientists, clinicians, and management in an appropriate biological context. You will participate in Disease Area Stronghold meetings and proactively support related Bioinformatics and Computational Biology projects. You will maintain compliance with all internal requirements for data integrity and reproducible research, actively work with the internal and external scientific and technical community, and participate in technology evaluations and software/database usage training.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nYou are required to have a Master's Degree in Computational Biology, Biostatistics or related discipline with a minimum of 5 years of relevant experience working on bioinformatics projects OR a Ph.D. in Bioinformatics, Computational Biology, Biostatistics or related discipline with 2 years postdoctorate and 2 years industry experience working on bioinformatics projects.\n<br>\nYou are required to have prior work experience in a computational biology, bioinformatics or related setting.\n<br>\nYou are required to have experience in one or more of the following: High dimensional data integration, gene expression analysis, next generation sequencing analysis, survival analysis, and/or biological network inference.\n<br>\nYou are required to have Strong R programming skills.\n<br>\nWorking experience in Unix/Linux environment is required.\n<br>\nOther high level programming (Java, C++, etc.) and database (e.g. MySQL, PostgreSQL, Oracle) experience is preferred.\n<br>\nProficiency with classification and machine learning methods is preferred.\n<br>\nStatistical analysis experience with working knowledge of regression analysis, multivariate data analysis, and linear/nonlinear mixed effects modeling is preferred.\n<br>\nExperience with BioConductor is preferred.\n<br>\nScripting language experience (e.g. Perl or Python) is preferred.\n<br>\nOncology experience is preferred.\n<br>\nBiological background is preferred.\n<br>\nJohnson &amp; Johnson Family of Companies are equal opportunity employers, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, protected veteran status, disability status, or any other characteristic protected by law.\n<br><br>\nPrimary Location\n<br>\nUnited States-Pennsylvania-Spring House-\n<br>\nOrganization\n<br>\nJanssen Research &amp; Development, LLC. (6084)\n<br>\nJob Function\n<br>\n<strong>R &amp; D</strong>\n<br>\nRequisition ID\n\n\n<ul>\n<li>*********</li>\n</ul>\n\nJohnson &amp; Johnson Family of Companies - 1 hour ago - report job - original job\n<br><br>\nOn Company Site\n<br><br>\nSave this job"}