{"job title": "Senior Clinical Research Scientist (Senior Clinical Research Associate)", "company": "Johnson &amp; Johnson", "city state": "– Irvine, California", "rating": "4.0", "job description": "Johnson &amp; Johnson's Family of Companies is recruiting for a Senior Clinical Research Scientist (Senior Clinical Research Associate) to be located in Irvine, Ca to support our neurovascular business. <div>\nThe Johnson &amp; Johnson Medical Devices Companies have been working to make surgery better for more than a century. With substantial breadth and depth in surgical technologies, orthopedic and interventional solutions, we aspire to improve and enhance medical care for people worldwide. Together, we are working to shape the future of health through differentiated products and services.</div><div>\nCERENOVUS is a global leader in neurovascular care. Offering a broad portfolio of devices used in the endovascular treatment of hemorrhagic and ischemic stroke, CERENOVUS is committed to changing the trajectory of stroke.</div> <div>\n<strong>The Senior Clinical Research Scientist will:</strong>\n<br>\n· Develop and draft clinical trial protocols, informed consents, investigator brochures, and other study materials for neurovascular studies with minimal supervision.\n<br>\n· Plan for study budgets and collaborate with Clinical Operations to manage the development of Investigator agreements and site contracts within fair market value (FMV), vendor agreements, payments, and financial disclosures.\n<br>\n· Deliver assigned clinical programs, through effective partnership with Clinical Operations, Biostatistics and Data Management , to enable optimized engagement leading to delivery of clinical project commitments (deliver on time, within budget and in compliance with regulations and SOP).\n<br>\n· Develop strong collaborative relationships with the study core team and others to ensure study progress for assigned projects and that issues are identified and communicated to leaders.\n<br>\n· Draft study reports with minimal supervision for assigned studies to include any annual reports, study close out reports as well as clinical sections for IDE, PMA, 510(k), and other regulatory submissions.\n<br>\n· Contribute to the development and deliver appropriate clinical evidence generation and dissemination strategies to support products within Cerenovus, with collaborative relationships with all relevant Clinical R&amp;D partners and cross-functional partners (R&amp;D, Global Strategic Marketing, Medical Affairs, Regulatory Affairs, Health Economics and Market Access);\n<br>\n· Ensure input and strong alignment from key regional MD Clinical R&amp;D leads and other strategically important countries/regions in the development of the clinical evidence generation and dissemination strategies.\n<br>\n· Be responsible for critically assessing the literature.\n<br>\n· Support clinical scientific discussions with regulatory agencies / notified bodies to drive support of the clinical and regulatory strategy, including proposed clinical investigations; review process of clinical evidence generated for marketing authorization, line extensions, etc., including during sponsor regulatory inspections;\n<br>\n· Contribute to appropriate interpretation and dissemination of all evidence generated, including abstracts, manuscripts, clinical study reports, and use of clinical data/evidence for market access and reimbursement;\n<br>\n· Foster strong relationships with key investigators to drive clinical study execution and deliver evidence.\n<br>\n· Ensure registration on www.clinicaltrials.gov from study initiation through posting of results.\n<br>\n· Develop a strong understanding of the product pipeline, product portfolio and business needs.\n<br>\n· Keep management informed of key developments and issues that impact clinical strategy and portfolio management.\n<br>\n· Be involved in other tasks to support clinical research activities as needed.\n<br>\n· Manage work with limited supervision. Senior staff member may review work during development, dependent on level of complexity, and upon completion.</div>\n\n<br><strong>Qualifications</strong>\n<br>\n· A Bachelors degree in Biological Science or related discipline, with a minimum of 4 years related clinical research experience Or with a Masters or PhD these requirements respectively would be required.\n<br>\n· Clinical research experience within the medical device industry is required.\n<br>\n· Experience including involvement with investigational device exemption (IDE) trials is required.\n<br>\n· Good understanding of clinical research science and processes along with an understanding of product development process, team dynamics, related healthcare market environment, clinical trends, and global clinical trial regulations is preferred.\n<br>\n· Knowledge and experience writing clinical protocols and reports is required.\n<br>\n· Ability to provide scientifically strategic and scientific clinical research input across new product development and life-cycle management projects is preferred.\n<br>\n· Proven track record in delivering clinical projects within clinical research setting, on time, within budget and in compliance to SOPs and regulations is preferred.\n<br>\n· Ability to lead study teams to deliver critical milestones is preferred.\n<br>\n· Ability to collaborate across different functional areas to ensure alignment with governance processes (assigning roles and responsibilities, setting priorities, managing deliverables, etc). and to meet business objectives is preferred.\n<br>\n· Demonstrated ability to build collaborative relationships with key internal and external partners and stakeholders is preferred.\n<br>\n· Knowledge and experience in neurovascular is preferred.\n<br>\n· Up to 20% travel may be required.\n<br><br>\n<strong>Primary Location</strong>\n<br>\nUnited States-California-Irvine\n<br>\n<strong>Organization</strong>\n<br>\nDepuy Orthopaedics. Inc. (6029)\n<br>\n<strong>Job Function</strong>\n<br>\nClinical Research non-MD\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>6571180320</strong>\n<br>"}