{"job title": "Systems Analyst / Data Scientist", "company": "Johns Hopkins University Applied Physics Laboratory", "city state": "– Laurel, Maryland", "rating": "4.6", "job description": "<strong>Job Description</strong>\n<br><br>\nOverview\n<br><br>\nThe U.S. Navy is faced with increasingly dangerous air threats, including unmanned aerial vehicles and advanced anti-ship missiles. To defend sailors and marines from these threats, we in the A3A group of the Air and Missile Defense Sector drive improvements to combat systems that combine radars, electronic warfare systems, combat management software, tactical networks, and surface to air missiles. Our team of passionate analysts, engineers, and software developers work together to research new concepts, guide design, develop working prototypes, and support both deployed and in-development systems through careful analysis.\n<br><br>\nApply if you...\n\n<li>Want to work closely with a passionate team</li>\n<li>Have an analytical mind and like to find the root cause of issues</li>\n<li>Are curious about cutting edge technology, data science, and machine learning</li>\n<li>Want to learn about systems such as the Enterprise Air Surveillance Radar, Ship Self-Defense System, Cooperative Engagement Capability, SLQ-32 Electronic Warfare Suite, and the Enhanced Sea Sparrow and Rolling Airframe Missiles</li>\n<li>Want to provide meaningful feedback to the Navy to protect our sailors</li>\n\nIn the first 3 months you will...\n\n<li>Meet our growing team, which has expertise in areas including combat systems, sensors, software design, and data science</li>\n<li>Learn the basics of the Ship Self Defense System, which is found on aircraft carriers and amphibious ships</li>\n<li>Attend technical presentations and discussions</li>\n<li>Participate in combat system studies related to predictive analysis, test execution, and post-test analysis</li>\n<li>Support an off-site test event with tactical assets</li>\n\nIn the first year you will...\n\n<li>Make substantial contributions to the analysis of combat system test events, which will directly inform engineering decisions that impact the warfighter</li>\n\n\n<ul>\n<li>Investigate interactions between sensors, networks, combat management software, and weapon systems</li>\n<li>Simulate air defense scenarios for pre-test predictions and evaluation of proposed system improvements</li>\n<li>Contribute to a growing suite of automated analysis software to ensure that once an issue is understood, it is always found</li>\n</ul>\n\n<li>Present your work externally or internally</li>\n<li>Visit a Navy ship and meet with sailors and officers</li>\n\nNote: This job summary and listing of duties is for the purpose of describing the position and its essential functions at time of hire and may change over time.\n<br><br>\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>BS in Engineering, Mathematics, Physics, Computer Science or equivalent</li>\n<li>At least 3 years experience in engineering or related field</li>\n<li>Familiarity with Python, Java, or similar programming languages</li>\n<li>A math background with knowledge of probability and statistics</li>\n<li>Ability to work both independently and as part of a team</li>\n<li>Effective written and oral communication skills</li>\n<li>Must have ability to obtain a Secret clearance</li>\n</ul>\n\n<strong>Desired Qualifications:</strong>\n\n\n<ul>\n<li>Advanced degree in Engineering, Mathematics, Physics, Computer Science or equivalent</li>\n<li>Background in combat systems, radar, electronic warfare, tactical networks, and/or missile integration</li>\n<li>Experience with software development</li>\n<li>Experience with machine learning or artificial intelligence</li>\n<li>Knowledge of RF physics</li>\n<li>Current SECRET (or above) clearance</li>\n</ul>\n\nSpecial Working Conditions\n<br><br>\nTravel as required to meetings in the DC region. This position requires infrequent (~5%) CONUS travel to government and contractor facilities to support test and analysis.\n<br><br>\n<strong>Security:</strong>\n<br>\nApplicant selected will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship.\n<br><br>\n<strong>Benefits:</strong>\n<br>\nAPL offers a comprehensive benefits package with an initial 3 weeks of vacation, 2 weeks paid parental leave, continuing educational assistance, a scholarship tuition program for dependents, and will contribute an amount equal to 10.5% of your salary to retirement when you contribute at least 4%.\n<br><br>\n<strong>Equal Employment Opportunity:</strong>\n<br>\nJohns Hopkins University/Applied Physics Laboratory (APL) is an Equal Opportunity/Affirmative Action employer that complies with Title IX of the Education Amendments Acts of 1972, as well as other applicable laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, sexual orientation, gender identity, national origin, disability, or protected Veteran status.\n<br><br>\nThe Johns Hopkins Applied Physics Lab (APL) is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual identity, gender identity, national origin, disability, or protected Veteran status."}