{"job title": "Director, Clinical Project Scientist", "company": "Johnson &amp; Johnson", "city state": "– Spring House, Pennsylvania", "rating": "4.0", "job description": "Janssen Research and Development, L.L.C., a member of Johnson &amp; Johnson's Family of Companies, with a specific focus on the field of Oncology, is currently seeking a<strong> Director, Clinical Project Scientist</strong> in the Oncology Therapeutic Area. The position will preferably be based out of Springhouse (PA, USA) or Raritan (NJ, USA). Up to 20% domestic and international travel is required. <div>\nThe <strong>Director, Clinical Project Scientist</strong> executes clinical research strategies, contributes to the development and execution of clinical research programs for company products and ensures the compliance of department, company and regulatory standards and procedures. The function directs study design, protocol development and implementation of clinical studies in the late phase development organization; reviews and evaluates results of phase 2 and 3 investigations in preparation for new drug application to the regulatory agencies.</div><br>\n\n<div>The <strong>Director, Clinical Project Scientist</strong> acts as a liaison between company and clinical investigators and develops credible relationships with opinion leaders, medical directors, and key regulatory officials. Candidates should have a strong commitment to oncology clinical research.</div> <div>\nThe current position is in Late Development (LD) for a cellular therapy product in the hematologic malignancy space. As part of the role the Director CPS will collaborate with the study responsible physician (SRP) and the Molecule Responsible Physician (MRP) Specifically, the CPS will assist in the preparation of protocol writing for and operational execution of late development studies. Because this is a novel immunotherapy compound we are looking for a CPS with immunotherapy/cellular therapy experience. Exposure to CAR-T development in the clinical or research setting is highly desirable. In this position the CPS will act as the clinical liaison and point of contact for Chemistry, Manufacturing and Controls (CMC) and supply chain functions and will be involved in strategic decision making for country and site selection based on technical requirements for cellular therapy administration.</div><br>\n\n<div><strong>ESSENTIAL DUTIES INCLUDE:</strong> </div><div>\n\n\n<ul>\n<li>Support on-site visits in US and EU to provide site training and instruction of best practices. Also, be expected to contribute to the development and later implementation of SOPs specific for cellular therapy administration, to be used for internal and external training.</li>\n<li>Participates in the start-up of global clinical studies, ensuring on schedule site activation and subject enrollment, monitoring, compliance with department safety practices, policies, procedures as well as the day to day management of a clinical trial.</li>\n<li>Implement clinical study parameters, deliverables, policy compliance and resource needs, apply scientific discipline to minimize risk and increase performance, play a key role in the medical review of study data and timely and high-quality data entry and assist in coding, analysis and documentation of Company clinical work.</li>\n<li>Participate in investigator meetings, investigator engagement, managing sites to ensure study treatment discontinuation decisions are made per protocol and align with stakeholders within the study team. Work with safety, data management teams and Data Monitoring Committee to make timely decision regarding study objectives.</li>\n<li>Assess external clinical research proposals involving Company products and manuscripts that are being prepared for publication. The CPS will also serve as a liaison between the Company and clinical research staff in many countries. The CPS will participate in the training of site and Company staff on the study protocol; ensures that the clinical staff has the necessary guidance and tools for performance of various projects.</li>\n<li>Requires a high-performing and energetic individual who demonstrates outstanding scientific knowledge applicable to oncology clinical research and the highest personal and ethical standards.</li>\n<li>Capabilities to work on additional LD studies moving into operation in later years. This will involve close interaction and working closely with the discovery, biomarkers, clinical pharmacology, companion diagnostic development team, regulatory, statistics and operations. In addition to understanding how these various functions work, the CPS should can implement translational medicine approaches for late clinical development.</li>\n<li>Reports directly to the Clinical Research Leader for the product to which he/she is assigned.</li>\n<li>The successful candidate must be equally comfortable among the team to which he/she is assigned and in the global environment in which the Company operates. The program is in an accelerated development mode and experience with registrations studies will be highly valued.</li></ul></div>\n\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>A minimum of an Advanced Degree in a Scientific discipline (i.e. M.S, Ph.D. or Pharm.D. or equivalent) is required.</li>\n<li>A minimum of 8 years of experience in a related clinical research position is required. Spending at least part of the time within the pharmaceutical industry, is preferred.</li>\n<li>Significant knowledge of clinical cancer research and its application to cancer drug development is required. Good oral and written communication skills are essential.</li>\n<li>Good presentation skills (including report development) is a requirement.</li>\n<li>Successful work experience in a matrix team environment with cross functional teams is required <div><strong>Johnson</strong></div></li><strong>\n</strong></ul><strong>\n\n&amp; Johnson Family of Companies are equal opportunity employers, and all\n<br>\nqualified applicants will receive consideration for employment without regard\n<br>\nto race, color, religion, sex, sexual orientation, gender identity, genetic\n<br>\ninformation, national origin, protected veteran status, disability status, or\n<br>\nany other characteristic protected by law.</strong>\n\n<br>\n<strong>Primary Location</strong>\n<br>\nUnited States-New Jersey-Raritan\n<br>\n<strong>Other Locations</strong>\n<br>\nNorth America-United States-Pennsylvania-Spring House\n<br>\n<strong>Organization</strong>\n<br>\nJanssen Research &amp; Development, LLC. (6084)\n<br>\n<strong>Job Function</strong>\n<br>\nClinical Research non-MD\n<br>\n<strong>Requisition ID</strong>\n<br>\n<strong>8482180730</strong>\n<br>"}