{"job title": "Data Scientist", "company": "John Hancock", "city state": "– US-MA-Boston", "rating": "3.8", "job description": "Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference and a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.\n<br><br>\nAre you interested in a Data Scientist position working on multi-dimensional, complex analytic initiatives? John Hancock Retirement Planning Service (RPS) Division is looking for an exceptional data scientist to lead the discovery of hidden information using our massive data and leverage advanced analytics and predictive modeling techniques to enable data-driven strategic decision making. We’re a lean, flat and experimental team that combines science and engineering to identify and inject high-value insights into the Retirement Planning process. The team works in quick iterations, using cutting edge techniques and algorithms that are best suited for the various challenges, which include but not limited to: sales, distribution, marketing and pricing. Results of this work will be presented and transformed in a variety of ways, including interactive visualizations, presentations, publications and web applications.\n<br><br>\nThe Data Scientist is accountable for the development and implementation of advanced analytic models to improve business process, and to generate insight in order to support the strategy &amp; goals of the business unit. This position will provide analytics thought leadership, coaching to the data scientists &amp; analysts and support the development of the capabilities of the team. Additional responsibilities include the development of documentation &amp; measurement framework.\n<br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Develop &amp; implement models to support business unit and divisional strategy and business pillar initiatives</li>\n\n\n<ul>\n<li>Develop advanced analytics models in order to maximize ROI, revenue and overall profitability.</li>\n<li>Perform needs analysis with business area (understand business problem &amp; generate hypotheses)</li>\n<li>Explore, generate &amp; source data relevant to the hypothesis(internal, external, 3rd party)</li>\n<li>Create, assess, evaluate &amp; Iteratively improve models</li>\n<li>Calculate model impact/ROI</li>\n<li>Peer review other Data scientists work</li>\n<li>Leverage sound judgment, balancing analysis effort vs incremental improvement</li>\n</ul>\n\n<li>Measure &amp; communicate analytic results &amp; impact of analytics models</li>\n\n\n<ul>\n<li>Implement measurement &amp; documentation framework against all project work</li>\n<li>Generate insights in such a way that the businesses can clearly understand the quantifiable value. Enable the business to make clear trade-offs between and among choices, with a reasonable view into the most likely outcomes of each.</li>\n<li>Turn statistical and computational analysis into user-friendly graphs, charts, and animation. Enable those who aren’t professional data analysts to effectively interpret data. Ability to communicate results and educate others through reports and presentations</li>\n</ul>\n\n<li>Provide thought leadership around analytics methodology, tools, and measurement</li>\n\n\n<ul>\n<li>Leverage extensive theoretical and practical knowledge of advanced analytic methods and algorithms, understanding their utility in different problem domains (sparse data, rare event detection, etc), evaluation methodologies and pitfalls, and stays on top of industry &amp; academic developments.</li> \n\n<li>Innovate &amp; find creative ways to source &amp; leverage data to support modeling efforts, leveraging structured &amp; unstructured data, and big data technologies.</li>\n<li>Collaborate with internal stakeholders to develop tools and services such as modeling, dashboard development, decision aids and business case analysis to drive innovation, strategic initiatives and recommend solutions.</li>\n</ul>\n\n<li>Coach &amp; provide guidance to data scientists &amp; data analysts</li>\n\n\n<ul>\n<li>Leverage depth of experience in business, technical &amp; analytical problem solving to support &amp; coach other team members</li></ul>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Post grad in Statistics, Math, Comp Sci, Engineering or other related discipline (PhD preferred)</li>\n<li>Minimum of seven years' experience specifically in statistical/data analysis, data mining and predictive modeling</li>\n<li>Advanced Experience in Python, R, SQL</li>\n<li>Experience with Tableau or D3</li>\n<li>Proficient with various data science methodologies including GLM, clustering, random forests, survival analysis, SVM, text mining, neural network and Bayesian analysis.</li>\n<li>Track of record of delivering innovative analytical insights to lines of businesses</li>\n<li>Strong commitment to organizational success and team work</li>\n<li>Adaptable and open to change with strong collaboration and elaboration skills</li>\n<li>Demonstrated data transformation &amp; manipulation experience</li>\n<li>Strong knowledge of strategic marketing, data, audience targeting, segmentation, and customer analysis. Familiarity of vendors that operate in this space</li>\n<li>Insurance or Financial Services industry experience preferred.</li>\n<li>Demonstrated experience exhibiting innovation and leadership in proposing new strategies and/or tactics based on analysis findings</li>\n<li>Experience with Big Data platforms desired</li>\n<li>Experience with analysis of unstructured data desired</li>\n<li>Innovative mindset</li>\n<li>Strong Communication and consulting skills</li>\n<li>Strong collaboration and elaboration skills</li>\n</ul>\n\n<strong></strong><br>\n\n<div><strong>About John Hancock Financial and Manulife</strong>\n<br><br>\nJohn Hancock is a division of Manulife Financial Corporation, a leading international financial services group that helps people make their decisions easier and lives better. We operate primarily as John Hancock in the United States, and Manulife elsewhere. We provide financial advice, insurance and wealth and asset management solutions for individuals, groups and institutions. Assets under management and administration by Manulife and its subsidiaries were over $1.1 trillion (US$850 billion) as of March 31, 2018. Manulife Financial Corporation trades as MFC on the TSX, NYSE, and PSE, and under 945 on the SEHK. Manulife can be found at manulife.com.\n<br><br>\nOne of the largest life insurers in the United States, John Hancock supports approximately 10.7 million Americans with a broad range of financial products, including life insurance, annuities, investments, 401(k) plans, and college savings plans. We also offer advice through Signator, a network of independent financial advisors. Additional information about John Hancock may be found at johnhancock.com.\n<br><br>\nAgency submissions and contacts are by invitation only and must be initiated by John Hancock's Recruiting Department only. Unsolicited agency submissions will not be honored.<br><br>JOHN HANCOCK IS AN EQUAL OPPORTUNITY EMPLOYER - AA/F/M/D/V\n<br>\n<strong>*LI-JH</strong></div>\n<br>"}