{"job title": "Listings Data Analyst", "company": "Jones Lange Lasalle Inc.", "city state": "– San Francisco, CA", "rating": "3.6", "job description": "<strong>Job Summary:</strong>\n<br><br>\nThe Research Listings' Data Analyst position will help to collect and monitor all aspects of the local listings data for office property for the local market area. This position will monitor and enrich our listings data and continue to elevate a best-in-class research program that differentiates JLL and drives a competitive advantage in the marketplace through market expertise, analysis and insight. This team member will be responsible for achieving data excellence, to enhance our client engagement and sales enablement platform and ensure real time accuracy of our listings data platform to our salesforce.\n<br><br>\nThe analyst will have primary responsibility for collecting data, maintaining and constantly elevating the quality of our data and analysis of that data, creating broker relationships and fostering those broker relationships to gain enhanced access to basic and more enhanced data and creating a constant stream of feedback to and from brokers and administrative staff so that our research platform captures all changes in the marketplace. This person will work with inside and outside brokers, administrative professionals and research professionals at JLL to consistently monitor and update listings in the local market, enriching that information through primary research and ensuring our database is kept updated in real-time.\n<br><br>\nThe position will report to the Sr. Director of Data Management &amp; Technology.\n<br><br>\n<strong>What this job involves:</strong>\n\n\n<ul>\n<li>Monitor the inventory of newly available space, as well as space that is no longer available, and appropriately enter into our centralized database</li>\n<li>Utilize internal and external resources to enrich the available space in the database with accurate floorplans, images and marketing flyers</li>\n<li>Work with our revenue producers and business admins to confirm and correct information in our database</li>\n<li>Act as an ambassador to our Research team and technology tools</li>\n</ul>\n\nSound like you? Before you apply it's worth knowing what we are looking for:\n\n\n<ul>\n<li>Bachelor's degree and a demonstrated interest in commercial real estate</li>\n<li>Great communication skills and a positive attitude</li>\n<li>Ability to multi-task and work successfully under pressure to effectively manage deadlines</li>\n<li>Strong organization and prioritization skills</li>\n<li>Analytical/problem solving skills are highly desired; ability to understand and communicate information to members of the Research and IT groups</li>\n<li>Must have a desire to work within a diverse, collaborative and driven professional environment</li>\n</ul>\n\n<strong>About JLL Research:</strong>\n<br><br>\nJLL Research consists of 550+ full time professionals globally and is the largest research group in the real estate industry and among the best of any world-wide professional services firm. Our mission is \"To create clear competitive advantage for our clients through the strategic use of accurate data, market intelligence and innovative thinking from around the world\". Our research activities include maintaining comprehensive property market databases, analyzing current market conditions and future trends, understanding the factors that drive property performance and occupancy trends, and providing research-led strategy and advice to investors, developers and occupiers around the world. We are committed to developing new metrics and methodological tools to capture and understand the factors driving office, retail and warehousing/logistics real estate markets across the world and bring insight to the future for our clients.\n<br><br>\n<strong>What you can expect from us:</strong>\n<br><br>\nYou'll join an entrepreneurial, inclusive culture. One where we succeed together across the desk and around the globe. Where like-minded people work naturally together to achieve great things.\n<br><br>\nOur Total Rewards program reflects our commitment to helping you achieve your ambitions in career, recognition, wellbeing, benefits and pay. We'll offer you a competitive salary and benefits package.\n<br><br>\nJoin us to develop your strengths and enjoy a fulfilling career full of varied experiences. Keep those ambitions in sight and imagine where JLL can take you.\n<br><br>\nApply today!\n<br><br>\n<strong>#LI</strong>\n<br><br>\nJLL Privacy Statement\n<br><br>\nWhen you visit JLL websites, JLL may collect information related to those visits, without you actively sending that information. This information may include, for example, the internet browser you are using, your access device's operating system, the language in which that system presents information to you, your IP (Internet Protocol) address, the web search that took you to the JLL website, the web pages and advertisements displayed to you, and the links you click on.\n<br><br>\nFor additional details please see JLL's Global Privacy Statement or our career site pages for each country.\n<br><br>\nFor employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy here."}