{"job title": "Data Analyst", "company": "Jones Lange Lasalle Inc.", "city state": "– Chicago, IL", "rating": "3.6", "job description": "JOB DESCRIPTION: Analyst, Technology, Data &amp; Information Management\n<br><br>\nWe are seeking candidates that are self-starters who can work in a diverse and fast-paced environment that can join our team immediately.\n<br><br>\nKey Responsibilities\n\n\n<ul>\n<li>Develops, executes and monitors simple to moderately complex data management / analytic processes to support ad hoc data and information delivery for assigned projects.</li>\n<li>Assists in the development and maintenance of production data management, data integration and reporting processes.</li>\n<li>Tests and monitors data / information management processes to ensure data quality and consistency in support of business initiatives.</li>\n<li>Manages the identification, prioritization and remediation of data quality issues.</li>\n<li>Engages with colleagues and internal customers to understand business requirements, and to support the accurate business usage and interpretation of JLL data.</li>\n<li>Develops documentation and data flow diagrams to maintain accurate metadata and data lineage.</li>\n<li>Participates in the design and development of technical solutions to ensure that business requirements are satisfied.</li>\n<li>Performs data discovery to understand data values and relationships in new data sources.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's degree in Information Science, Computer Science, Mathematics, Statistics or a quantitative discipline in science, business, or social science. Advance degree and/or 1-2 years of experience in the fields of information science, computer science or analytics preferred.</li>\n<li>Knowledge of standard analytical, reporting and programming languages and their application (such as SQL, Python, R, SAS, SSRS, SSIS, Cognos, Tableau, Power BI, etc.)</li>\n<li>Understanding of data and systems engineering concepts to effectively integrate and analyze data to develop actionable business information deliverables.</li>\n<li>Able to think logically, organize work flows efficiently, and solve problems independently.</li>\n<li>Reliable, self-motivated, and self-disciplined individual with can-do attitude, capable of executing on multiple projects simultaneously within a fast paced environment.</li>\n<li>Capability to self-learn new software applications and programming languages.</li>\n<li>Effective written and verbal communication skills, including technical writing.</li>\n</ul>\n\n<strong>#LI</strong>\n<br><br>\nJLL Privacy Statement\n<br><br>\nWhen you visit JLL websites, JLL may collect information related to those visits, without you actively sending that information. This information may include, for example, the internet browser you are using, your access device's operating system, the language in which that system presents information to you, your IP (Internet Protocol) address, the web search that took you to the JLL website, the web pages and advertisements displayed to you, and the links you click on.\n<br><br>\nFor additional details please see JLL's Global Privacy Statement or our career site pages for each country.\n<br><br>\nFor employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy here."}