{"job title": "Business Intelligence Analyst", "company": "Jones Lange Lasalle Inc.", "city state": "– Minnetonka, MN", "rating": "3.6", "job description": "We are currently seeking a seeking a Business Intelligence (BI) Analyst to join our BI analytics team. You will work closely with the BI manager to study formal and informal data to help better understand performance. This is a great opportunity for an analytically minded individual willing to learn multiple service lines to use information to influence the decision making process. This is a virtual role.\n<br><br>\nWhat does this job involve?\n<br><br>\nHaving the know-how\n<br><br>\nYou'll need to have a great knowledge in Business Intelligence and be fluent in Technology. In this role, you will assess the current technical environment and develop technology requirements and conceptual solutions to meet business objective. You will partner with data owners to understand business requirements and common reporting/analysis use cases and work with technical and business teams to define appropriate technical solutions which includes BI solutions &amp; Data Warehouse implementation, data access and dashboard creation. You will also be assisting with some reporting- drafting and distributing reports weekly, monthly, quarterly, and annually.\n<br><br>\nBeing a trailblazer and breaking new ground\n<br><br>\nTo be successful in this role, you should be a confident professional with broad skills in analyzing and solving complex business problems, writing and presenting, facilitating and influencing. This includes being able to extrapolates data and be able to forecast and trending of performance data as well as analyze trends of monthly Key Performance Indicator results for performance improvement concepts. Also, you should be able to provide hands-on support to provision data from a variety of internal sources, build reporting and meta-data models to support strategic data initiatives and design complex reports and dashboards based on requirements.\n<br><br>\nSound like you? Before you apply, it's also worth knowing what we're looking for:\n<br><br>\nSmart\n<br><br>\nA Bachelor's Degree in Engineering, Finance, Information Technology or related field is required; also along with 0- 2 years of experience in Corporate Real Estate environment. Previous experience with other data and statistical applications are a plus (PowerPivot, Tableau, SAS, Access, MiniTab, Sigma Excel, SQL)\n<br><br>\nDynamic and Highly Skilled\n<br><br>\nYou'll need to be dynamic and technologically savvy and utilize software to support planning solutions and communicate ideas clearly with planning team and lines of businesses. You will be successful if you have advanced skills in Microsoft Excel (pivot table, vlook-up, and cell calculations) and Sharepoint. Proficiency in Microsoft Office suite and ability to consolidate data into Power Point for presentations to client and lines of business is highly valued. You'll be effective in you role by learning to ask the right questions to understand the underlying needs of our clients. You'll discover how to be proactive and innovative with solutions your stakeholders.\n<br><br>\nOrganized, Open and Flexible\n<br><br>\nExcellent communication skills are important both written and spoken and we'll expect you to work independently, multi-task, and manage your time to meet deadlines. You keep on top of things as you'll often need to reorganize your time day to day, to deal with your team's changing necessities and requests. An individual with strong interpersonal skills with an ability to interact with all level external and internal clients will successful in the role. Most importantly, you'll want to work as part of a diverse supportive and talented team.\n<br><br>\nWhat you can expect from us\n<br><br>\nYou'll join an entrepreneurial, inclusive culture. One where we succeed together across the desk and around the globe. Where like-minded people work naturally together to achieve great things. Our Total Rewards program reflects our commitment to helping you achieve your ambitions in career, recognition, well-being, benefits and pay. We'll offer you a competitive salary and benefits package.\n<br><br>\nWith us, you'll develop your strengths and enjoy a career full of varied experiences. We can't wait to see where your ambitions take you at JLL.\n<br><br>\nApply today!\n<br><br>\n<strong>#LI</strong>\n<br><br>\nJLL Privacy Statement\n<br><br>\nWhen you visit JLL websites, JLL may collect information related to those visits, without you actively sending that information. This information may include, for example, the internet browser you are using, your access device's operating system, the language in which that system presents information to you, your IP (Internet Protocol) address, the web search that took you to the JLL website, the web pages and advertisements displayed to you, and the links you click on.\n<br><br>\nFor additional details please see JLL's Global Privacy Statement or our career site pages for each country.\n<br><br>\nFor employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy here.\n<br><br>\nJLL Privacy Statement\n<br><br>\nWhen you visit JLL websites, JLL may collect information related to those visits, without you actively sending that information. This information may include, for example, the internet browser you are using, your access device's operating system, the language in which that system presents information to you, your IP (Internet Protocol) address, the web search that took you to the JLL website, the web pages and advertisements displayed to you, and the links you click on.\n<br><br>\nFor additional details please see JLL's Global Privacy Statement or our career site pages for each country.\n<br><br>\nFor employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy here."}