{"job title": "CIB QR - Quantitative Research - Algo Execution Quant Associate/VP", "company": "JPMorgan Chase &amp; Co.", "city state": "– New York, NY", "rating": "3.8", "job description": "Apply Now\n<br><br>\nCIB QR - Quantitative Research - Algo Execution Quant Associate/VP\n<br><br>\nReq #: 180112376\n<br><br>\nLocation: New York, NY,US\n<br><br>\nJob Category: Accounting/Finance/Audit/Risk\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nAbout J.P. Morgan\n<br><br>\nJ.P. Morgan has been doing first-class business in a first-class way for more than two hundred years. We have been a leading player in helping companies grow and markets develop throughout our history. We work in collaboration across the globe to deliver the best solutions and advice to meet our clients' needs, anywhere in the world. We operate in 150 countries, and hold global leadership positions across our businesses. We have an exceptional team of employees who work hard to do the right thing for our clients and the firm every day. This is why we are the most respected financial institution in the world - and why we can offer you an outstanding career.\n<br><br>\nLinear Quantitative Research\n<br><br>\nLinear Quantitative Research is an expert quantitative modeling group in J.P. Morgan, an unchallenged leader in financial engineering, statistical modeling and portfolio management. With a global team, Linear Quantitative Research partners with traders, marketers and risk managers across all products and regions.\n<br><br>\nQuantitative skills are a core capability of J.P. Morgan, contributing critically to product innovation, effective risk management and appropriate financial and risk controls. The team's mission is to develop and maintain sophisticated mathematical models, cutting-edge methodologies and infrastructure to improve the performance of algorithmic trading strategies and promote the advanced electronic solutions to our clients worldwide. We also work closely with trading desks to develop statistical arbitrage strategies and other quantitative trading models.\n<br><br>\nOpportunities\n<br><br>\nNew hires will benefit from both on the job training as well as intensive formal classroom training. Through the diversity of the businesses it supports and the variety of functions that it is responsible for, the Linear Quantitative Research group provides unique growth opportunities for its new hires to develop their abilities and their careers.\n<br><br>\n<strong>Roles and responsibilities include the following:</strong>\n\n\n<ul>\n<li>Developing mathematical models for equities electronic trading algorithms</li>\n<li>Evaluating and documenting quantitative methodologies, back-testing and simulating quantitative models</li>\n<li>Supporting trading activities by explaining model and algorithm behavior, carrying out scenario analyses, developing and delivering quantitative tools, and supporting analytics including transaction cost analysis</li>\n<li>Designing and developing software for analytics and their delivery to systems and applications</li>\n<li>Engaging in direct client interaction to promote and market our algorithms</li>\n<li>Position is located in New York</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Experience in agency algo execution research is not required, but a definite plus</li>\n<li>Proficient in at least one of the object oriented programming, like C++ or Java and good at one of Python, Matlab or R</li>\n<li>Good at statistical or econometric models</li>\n<li>Experience in machine learning is a plus</li>\n<li>Candidates must be details oriented, self-motivated, eager to learn</li>\n</ul>"}