{"job title": "Senior Data Engineer (Apache Spark | Python)", "company": "JPMorgan Chase &amp; Co.", "city state": "– Lewisville, TX", "rating": "3.8", "job description": "Apply Now\n<br><br>\nSenior Data Engineer (Apache Spark | Python)\n<br><br>\nReq #: 180109875\n<br><br>\nLocation: Lewisville, TX,US\n<br><br>\nJob Category: Technology\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nOur Global Technology Infrastructure group is a team rewarded with innovators who love technology as much as you do. Together, you'll use a disciplined, innovative and a business focused approach to develop a wide variety of high-quality products and solutions. You'll work in a stable, resilient and secure operating environment where youand the products you deliverwill thrive.\n<br><br>\nAs an experienced Infrastructure Development professional, your mission is to help lead our team of innovators and technologists toward creating next-level solutions that improve the way our business is run. Your hands-on knowledge in system design, application development, testing and operational stability will help your team deliver high quality products. You'll be instrumental in solving more difficult technical issues, developing integration elements, building data models, APIs, and open 3rd-party SDKs. You'll see your ideas come to life as part of a small, success-driven team. Your quest to embracing leading-edge technologies and methodologies inspires your team to follow suit. And best of all, you'll be able to harness massive amounts of brainpower through our global network of technologists from around the world to tackle big challenges.\n<br><br>\nThe role requires leading, designing and building a data analytics platform for solving several use cases including Technology Lifecycle Management, Financial transformation, Vendor and license management and Data Quality. It also requires expertise in the entire technology stack along with specific expertise in Machine Learning and data science to enable building stable, resilient and firmwide solutions.\n<br><br>\nThis role requires a wide variety of strengths and capabilities, including:\n\n\n<ul>\n<li>BS/BA degree or equivalent experience</li>\n<li>Provide technical expertise throughout the software lifecycle including design, implementation and delivery.</li>\n<li>Understanding cloud , virtualization, APIs, and modern software languages</li>\n<li>Software development experience in one or more general purpose programming languages: Python, Java, C, C++, R or Scala</li>\n<li>Experience with developing frameworks that helps increase development and release velocity, improves code health and technical standards</li>\n<li>Advanced experience working with two or more from the following: web application development, database, unix/linux environments, distributed and parallel systems, information retrieval, networking, large scale software development, security software development</li>\n<li>Understanding of or experience with agile and lean philosophies</li>\n<li>Strong critical thinking and problem solving skills with clear communication</li>\n<li>Ability to collaborate with different roles to achieve common goals</li>\n<li>Advanced experience in machine learning algorithms</li>\n<li>Advanced experience in Scala/R for data manipulation and correlation</li>\n<li>Experience in Big Data technologies (HDFS, SPARK etc)</li>\n</ul>\n\nWhen you work at JPMorgan Chase &amp;Co., you're not just working at a global financial institution. You're anintegral part of one of the world's biggest tech companies. In 14 technologyhubs worldwide, our team of 40,000+ technologists design, build and deployeverything from enterprise technology initiatives to big data and mobilesolutions, as well as innovations in electronic payments, cybersecurity,machine learning, and cloud development. Our $9.5B+ annual investment intechnology enables us to hire people to create innovative solutions that willnot only transform the financial services industry, but also change theworld.\n<br><br>\nAt JPMorgan Chase &amp; Co. we value theunique skills of every employee, and we're building a technology organizationthat thrives on diversity. We encourageprofessional growth and career development, and offer competitive benefits andcompensation. If you're looking to buildyour career as part of a global technology team tackling big challenges thatimpact the lives of people and companies all around the world, we want to meetyou.\n<br><br>\nReady to take your career to the next level? Apply today."}