{"job title": "VP, Marketing Data Scientist (Analytics Manager)", "company": "JPMorgan Chase", "city state": "– Columbus, OH", "rating": "3.8", "job description": "<ul>\n<li>*Chase:**</li>\n</ul>\n\nChase is the U.S. consumer and commercial banking business of JPMorgan Chase &amp; Co. (NYSE: JPM), a leading global financial services firm with assets of $2.4 trillion and operations worldwide. Chase serves nearly half of America?s households with a broad range of financial services, including personal banking, credit cards, mortgages, auto financing, investment advice, small business loans and payment processing. Customers can choose how and where they want to bank: 5,200 branches, 16,000 ATMs, mobile, online and by phone. For more information, go to Chase.com.\n\n\n<ul>\n<li>*The Role:**</li>\n</ul>\n\nThis Marketing Data Scientist ? Vice President position will be part of CCB Data &amp; Analytics Team, reporting directly to one of our Executive Directors of Small Business Decision Sciences. Small Business Decision Sciences provides analytics, business intelligence, and modeling support to drive our Small Business acquisition, sales, marketing, and retention strategies. This role is a combination of consulting (problem solving and client interaction) and leading the development and implementation of analytics throughout our Small Business Lines of Business. The successful candidate will be analytically/technically strong, will have great communications skills, and a collaborative and resourceful style.\n\n\n<ul>\n<li>*Key Responsibilities:**</li>\n</ul>\n\n+ Thought leadership, independence and technical proficiency in:\n<br><br>\n+ Developing insights, methods or tools derived from large datasets using various analytic methods such as predictive modeling, text mining, machine learning statistical forecasting, optimization, simulations etc.\n<br><br>\n+ Handling data from multiple sources and disparate databases to construct conclusions and strategies\n<br><br>\n+ Analyzing data to explore improvement opportunities, assessing strengths through confidence of data inputs, identifying data defects, recognizing statistical anomalies and linking data to business processes\n<br><br>\n+ Ownership of program, processes, partnerships, key communications with limited oversight\n<br><br>\n+ Accountable for own work product and that of team, if a manager\n<br><br>\n+ Responsible for coaching and mentoring less experienced team members\n<br><br>\n+ Comfortable communicating complex analytical results\n<br><br>\n+ Deliver tactical and strategic marketing, sales, finance, and business insights through analytics, reporting and state of the art visualization techniques\n<br><br>\n+ Provide subject matter expertise for data driven decision and opportunities\n<br><br>\n+ Partner with a variety of internal and external clients to solve quantitative problems related to optimizing business processes and performance\n<br><br>\n+ Interact with senior leaders within CCB organization to drive and develop business strategy and performance\n<br><br>\n+ Align with data owners and department managers, contribute to the development of data models and architecture for analytics\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n+ PhD (or Masters) in a related field (Computer Science, Operational Research, Physics, Mathematics, Neuroscience, Engineering, Econometrics, Statistics, Other Sciences etc.) or equivalent\n<br><br>\n+ PhD with at least 5 years of advanced analytics experience (8+ years if Masters or equivalent)\n<br><br>\n+ Exceptional interpersonal and collaboration skills, ability to explain complicated mathematical concepts, algorithms and data structures with an ability to influence both internal &amp; external business partners\n<br><br>\n+ Hands-on experience in delivering analytics and insights to multiple levels of management\n<br><br>\n+ Exposure to forecasting and planning functions and processes\n<br><br>\n+ Tangible experience with business strategy and tactical implementation\n<br><br>\n+ Proficient in standard data mining and analytical methods\n<br><br>\n+ Proficiency in data analysis languages such as Python, SAS, R, etc.\n<br><br>\n+ Proficiency in general purpose languages such as Java, C++, Scala, etc.\n<br><br>\n+ Experience in Big Data platforms and related technologies such as Hadoop, Hive, Pig, Apache Spark etc.\n<br><br>\n+ Experience in relational databases including proficiency in SQL\n<br><br>\n+ Strong analytics, interpretive and problem solving skills\n<br><br>\n+ Expert in time series analysis, unsupervised and supervised learning algorithms, dimensionality reduction techniques\n<br><br>\n+ Technical understanding of data extraction, transformation and load processing\n<br><br>\n+ Experience with dynamic and interactive reporting applications\n<br><br>\n+ Consulting orientation ability to influence both internal &amp; external business partners\n<br><br>\n+ Strong written and oral presentation / communication skills ? the ability to convey complex information simply and clearly to senior business leaders\n<br><br>\nJPMorgan Chase is an equal opportunity and affirmative action employer Disability/Veteran."}