{"job title": "VP, Digital Analytics Manager: Senior Data Analyst", "company": "JPMorgan Chase &amp; Co.", "city state": "– Columbus, OH", "rating": "3.8", "job description": "Apply Now\n<br><br>\nVP, Digital Analytics Manager: Senior Data Analyst\n<br><br>\nReq #: 180115315\n<br><br>\nLocation: Columbus, OH,US\n<br><br>\nJob Category: Marketing/Communications\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nDigital Analytics Senior Data Analyst\n<br><br>\nDescription\n<br><br>\nChase is undertaking an aggressive digital transformation agenda, which builds on the success of the current mobile and online service offerings. Chase is investing in innovative ways to deepen customer engagement and profitability through the use of digital channels. The ambition is to position Chase as the undisputed leader in digital financial services and payments and to enable Chase to deliver the highly personalized, real time experiences that customers increasingly expect.\n<br><br>\nChase Digital is searching for a Data Analyst who will be a key member of the Digital Analytics organization. As a Data Analyst, you will work as a member of a cross-functional team to improve the online and mobile experience for our customers. You will be responsible for digging into various types of data to identify areas of friction and delivering actionable recommendations. It is imperative you bring the data to life through storytelling and data visualization. You will work with Product, Customer Experience, Development and Operations teams to identify areas of opportunity for key initiatives and drive strategic analysis. This position will be responsible for all analysis and research for one or more key initiatives.\n<br><br>\n<strong>Essential Functions &amp; Responsibilities:</strong>\n\n\n<ul>\n<li>Design analytical approaches to open-ended strategic business problems.</li>\n<li>Leverage behavioral/click-stream analytical applications front end to quickly identify anomalies in trends</li>\n<li>Extract raw data using SQL, Python or R from behavioral/click-stream applications to perform deeper dive and segment based analysis that extends beyond the capabilities of the GUI.</li>\n<li>Write SQL, Python, or R code to efficiently gather and analyze data from a variety of relational sources such as transactional and cross channel journey data.</li>\n<li>Apply aggregations, segmentation, statistics, clustering, etc to complex business problems using a multitude of disparate data sets and applications.</li>\n<li>Craft compelling narratives focused on improving the customers' Digital experience by joining transactional, behavioral, journey and voice of the customer data</li>\n<li>Bring data to life through visualization and storytelling.</li>\n<li>Interpret the analysis with a focus on actionable recommendations.</li>\n<li>Communicate approach, results and recommendations to executives, product owners, designers, program managers and developers.</li>\n<li>Contribute to sharing and documenting knowledge as well as building out an analytics repository.</li>\n<li>Build scalable and extensible solutions for common analytical approaches.</li>\n<li>Discover, explore, analyze and document data from all source and target systems to better understand the total scope of Data Availability at JPMC.</li>\n<li>Participate in an Agile development process for on-going projects or ad-hoc requests.</li>\n<li>Escalate issues and concerns appropriately.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Skills Summary:</strong>\n\n\n<ul>\n<li>Bachelor's (Masters preferred) in Statistics, Data Science or related quantitative degree plus 5+ years of working experience in data analytics.</li>\n<li>Experience writing SAS, R, or Python for data analytics.</li>\n<li>Experience writing SQL on Teradata, and Hadoop/Hive environments.</li>\n<li>Experience with behavioral / click-stream data (Adobe Analytics, Google 360) and extracting processed data from the applications with SQL- extending beyond the front-end of the application a must.</li>\n<li>Experience working with Journey, Voice of the Customer and operational data sources such as Splunk is preferred</li>\n<li>Experience working with Web and native Mobile app data</li>\n<li>Experience applying aggregations, segmentation, statistics, clustering, to complex business problems.</li>\n<li>Experience joining structured and semi-structured datasets to showcase channel and product level experiences from a customer level</li>\n<li>In-depth knowledge of data warehousing, dimensional modeling, and data architecture.</li>\n<li>Experience working in Unix environment.</li>\n<li>Experience with Agile methodologies is preferred.</li>\n<li>Experience in financial industry is preferred.</li>\n<li>Excellent critical thinking, verbal and written communications skills.</li>\n<li>Strong estimating, planning and time management skills.</li>\n<li>Strong understanding of Big Data and open source technologies.</li>\n<li>Ability and desire to thrive in a proactive, highly engaging, high-pressure, and customer focused environment.</li>\n</ul>"}