{"job title": "Customer Journey Data Scientist", "company": "JPMorgan Chase", "city state": "– Wilmington, DE", "rating": "3.7", "job description": "<ul>\n<li>*Chase:**</li>\n</ul>\n\nChase is the U.S. consumer and commercial banking business of JPMorgan Chase &amp; Co. (NYSE: JPM), a leading global financial services firm with assets of $2.5 trillion and operations worldwide. Chase serves nearly half of America's households with a broad range of financial services, including personal banking, credit cards, mortgages, auto financing, investment advice, small business loans and payment processing. Customers can choose how and where they want to bank: 5,200 branches, 16,000 ATMs, mobile, online and by phone. For more information, go to Chase.com.\n\n\n<ul>\n<li>*The Role:**</li>\n<li>*The Data Scientist will engage in initiatives which require the development and deployment of advanced analytical solutions. This will include hands on model development for business needs and machine learning using SAS and/or other languages.** He/She will be responsible for designing and implementing processes and layouts for complex, large-scale data sets using machine learning algorithms and other statistical methods. Projects can involve; a) customer experience journey analysis where every customer touch-point is mapped, across channels and products b) analyzing call center volumes and reasons to reduce or mitigate demand c) customer segmentation, cross-sell/up-sell, customer churn/attrition, sentiment analysis and product propensity modeling d) customer targeting for personalized service and communications e) machine learning solutions to improve the customer experience through increased accuracy and higher efficiency and f) use of data visualization techniques/tools to communicate analytic findings. The role will require working on multiple projects simultaneously.</li>\n<li>*Responsibilities:**</li>\n</ul>\n\n+ Develop and plan required analytic projects in response to business needs.\n<br><br>\n+ In conjunction with data owners and department managers, contribute to the development of data models and protocols for mining production databases.\n<br><br>\n+ Contribute to data mining architectures, modeling standards, reporting, and data analysis methodologies.\n<br><br>\n+ Work with business domain experts and application developers to identify data relevant for analysis\n<br><br>\n+ Work with application developers to extract data relevant for analysis.\n<br><br>\n+ Create data definitions for new database file/table development and/or changes to existing ones as needed for analysis.\n<br><br>\n+ Provide and apply quality assurance best practices for data mining/analysis services.\n<br><br>\n+ Develop new analytical methods and/or tools as required.\n<br><br>\n+ Adhere to change control and testing processes for modifications to analytical models.\n<br><br>\n+ Respond to and resolve data mining performance issues. Monitor data mining system performance and implement efficiency improvements.\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n+ Generally 3+ years of related experience\n<br><br>\n+ Bachelor's degree in a quantitative, STEM or related field\n<br><br>\n+ MS/PhD in a quantitative discipline such as Statistics, Physics, Economics, Applied Math, Computer Science, Operations Research, or Computational Sciences, with coursework and projects in machine learning and data analysis preferred\n<br><br>\n+ Strong understanding of data mining models, structures, theories, principles, and practices, including machine learning, statistics and text mining techniques.\n<br><br>\n+ Excellent knowledge of data mining / predictive modeling tools such as SQL, SAS, etc.\n<br><br>\n+ Experience with data visualization tools like Tableau, etc.\n<br><br>\n+ Hands-on coding / implementation of algorithms for data mining\n<br><br>\n+ Expertise in Machine Learning algorithms preferably using Financial data\n<br><br>\n+ Ability to conduct research into data mining issues, practices, and products as required.\n<br><br>\n+ Strong familiarity and experience with data preparation and processing such as assessment of data quality, new variable creation, variable selection, etc.\n<br><br>\n+ Experience extracting data from both conventional databases (via SQL) and Hadoop data clusters (via Hive or similar language)\n<br><br>\nJPMorgan Chase is an equal opportunity and affirmative action employer Disability/Veteran."}