{"job title": "Data Engineer (Apache Spark | Python)", "company": "JPMorgan Chase &amp; Co.", "city state": "– Lewisville, TX", "rating": "3.8", "job description": "Apply Now\n<br><br>\nData Engineer (Apache Spark | Python)\n<br><br>\nReq #: 180109883\n<br><br>\nLocation: Lewisville, TX,US\n<br><br>\nJob Category: Technology\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nOur Global Technology Infrastructure group is a team rewarded with innovators who love technology as much as you do. Together, you'll use a disciplined, innovative and a business focused approach to develop a wide variety of high-quality products and solutions. You'll work in a stable, resilient and secure operating environment where youand the products you deliverwill thrive.\n<br><br>\nAs a member of our Infrastructure Development team, you will dive right into creating innovative solutions that advance businesses and careers. You'll join an inspiring and curious team of technologists dedicated to develop and deploy large scale infrastructure solutions that supports JPMC's diverse and critical businesses. You will be using the latest technologies, data management and security practices in all aspect of software development. Critical thinking, clear communication and collaboration are key to success product delivery.\n<br><br>\nThe role requires designing and building a data analytics platform for solving several use cases including Technology Lifecycle Management, Financial transformation, Vendor and license management and Data Quality. It also requires expertise in the entire technology stack along with specific expertise in Machine Learning and data science to enable building stable, resilient and firmwide solutions.\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\nThis role requires a wide variety of strengths and capabilities, including:\n\n\n<ul>\n<li>BS/BA degree or equivalent experience</li>\n<li>Software development experience in one or more general purpose programming languages: Python, Java, C, C++, R and Scala</li>\n<li>Experience working with two or more from the following: web application development, database, unix/linux environments, distributed and parallel systems, information retrieval, networking, large scale software development, security software development</li>\n<li>Understanding or have experience with agile and lean philosophies</li>\n<li>Strong critical thinking and problem solving skills with clear communication</li>\n<li>Ability to collaborate with different roles to achieve common goals</li>\n<li>Advanced experience in machine learning algorithms</li>\n<li>Advanced experience in Scala/R for data manipulation and correlation</li>\n<li>Experience in Big Data technologies (HDFS, SPARK etc)</li>\n</ul>\n\nWhen you work at JPMorgan Chase &amp; Co., you're not just working at a global financial institution. You're an integral part of one of the world's biggest tech companies. In 14 technology hubs worldwide, our team of 40,000+ technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world.\n<br><br>\nAt JPMorgan Chase &amp; Co. we value the unique skills of every employee, and we're building a technology organization that thrives on diversity. We encourage professional growth and career development, and offer competitive benefits and compensation. If you're looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you."}