{"job title": "Merchant Services- Data Scientist, VP", "company": "JPMorgan Chase&amp;Co.", "city state": "– New York, NY", "rating": "3.7", "job description": "Apply Now<br><br>Merchant Services- Data Scientist, VP<br><br>Req #: 180084545<br><br>Location: New York, NY,US<br><br>Job Category: Product Management<br><br>Job Description:<br><br>Merchant Services is the global payment acceptance and merchant acquiring business of JPMorgan Chase&amp;Co. Merchant Services is a leading provider of payment, fraud management and data security solutions, capable of authorizing transactions in more than 130 currencies. The company's proprietary platforms provide integrated commerce solutions for all major credit and debit card payments as well as mobile payments. Merchant Services has uniquely combined proven payment technology with a long legacy of merchant advocacy that creates quantifiable value for ecommerce companies. Merchant Services is the #1 Merchant Acquirer Worldwide, based on volume, by The Nilson Report in April 2016. We are #1 in eCommerce volume in Europe, based on The Nilson Report. Merchant Services is also #1 in Merchant Processing Volume in the US with more than 20% market share, by The Nilson Report in April 2017. Double-digit growth year over year in processing volume is evidence of our best-in-class distribution and the advantage we have in the market place with ChaseNet and Chase Pay.<br><br>The Merchant Services Analytics team (reporting into the Head of Product for Merchant Services) is responsible for defining and executing the multi-year global analytics strategy and roadmap (e.g., optimizing payments performance of global merchants as well as driving payments innovation through analytics based insights products with an engaging user experience). The team is also driving the build out the analytics environment, establishing cross-functional and cross line of business data assets (across Chase, Treasury Services, Digital, Commercial Banking) and shaping Merchant Services analytics best practices overall.<br><br>Payment Data Analytics&amp;Science Manager Associate is responsible for executing big data analytics projects in response to product innovation for Merchant Services. Tangible output of the programs typically are payments insights that drive optimization of authorization, chargeback and cost of payments for large merchants as well as deep consumer and business insights. As the analytics mature, these insights can be productized into data insights products for merchants (\"insights as a service\").<br><br>The right candidate for this position is highly proficient with complex data sets, using modern statistical and data exploration as well as visualization techniques (especially SQL on Hadoop, Tableau)<br><br>The role will require working on multiple projects simultaneously. The ideal candidate will possess strong data analytical skills along with exceptional leadership, client and relationship management skills. S/he must have proven successes in balancing long term strategic vision with the ability to create, practical, actionable plans that are coherent and understood by all stakeholders. Beyond excellent analytical skills, the ideal candidate will be innovative, commercially inclined to create genuine business value through the alignment of technology, data and business interests.<br><br>Ideal for high caliber analytics talent with a strong affinity for payments innovation and big data technology affinity.<br><br>Principal Duties&amp;Responsibilities:<br><br>* Develop and plan required analytic projects in response to Merchant Services analytics strategy and roadmap<br><br>* Execute analytical projects as an individual contributor<br><br>* Focus on delivering actionable recommendations to merchants on how to optimize their payment performance (authorizations, charge backs, cost of payments)<br><br>* Deliver deep, actionable consumer insights that support merchants growth agenda<br><br>* Develop visualizations of analytics insights in Tableau (for consumption of relevant stakeholders)<br><br>* Contribute to \"productization\" analytical insights in collaboration with cross-functional teams<br><br>* Develop new analytical modeling methods and/or tools as required.<br><br>* Work with business domain experts and application developers to identify data relevant for analysis.<br><br>* Create data definitions for new database file/table development and/or changes to existing ones as needed for analysis.<br><br>* In conjunction with data owners and department managers, contribute to the development of data models for analytics.<br><br>* Collaborate with unit managers, end users, development staff, and other stakeholders to integrate data mining results with existing systems.<br><br>* Apply quality assurance best practices for analytics services.<br><br>* Adhere to change control and testing processes for modifications to analytical models.<br><br>* 3+ years of working in large and medium project teams, as a contributing member in self-directed roles.<br><br>* Degree in the fields of engineering, computer science, statistics, mathematics<br><br>* Management consulting experience is a plus<br><br>* Expertise in data mining, quantitative research techniques, theories, principles, and practices<br><br>* Experience in the payments industry and/or technology-enabled industries<br><br>* In-depth understanding of the payments value chain (merchants, brands, acquirers, networks, issuers) and associated data assets - or in-depth understanding of consumer insights<br><br>* Deep experience across the full range of database and business intelligence tools (especially SQL on Hadoop (Hive, Impala) and Tableau); publishing and presenting information in an engaging way<br><br>* Ability for rapid prototyping in Tableau<br><br>* Data Science experience in R, Python is a plus<br><br>* Intensive, recent experience in assessing and sourcing data needs<br><br>* Strong familiarity and experience with data preparation and processing such as assessment of data quality, new variable creation, variable selection, etc.<br><br>* Detailed orientation and a commitment to innovation<br><br>Skill Requirements:<br><br>* Strong interpersonal and communication skills, ability to work across functions as well as with outside parties to ensure alignment and timely implementation of initiatives<br><br>* Ability to build trust-based relationships<br><br>* Strong aptitude for technical concepts and ideas<br><br>* Ability to work well within deadlines<br><br>* Executive presence and presentation skills<br><br>* Strong written and oral communication skills<br><br>* Understanding \"deep data\" environments, ideally with a Merchant mindset<br><br>* High achievement orientation with ability to lead and motivate others around results<br><br>JPMorgan Chase is an equal opportunity and affirmative action employer Disability/Veteran"}