{"job title": "Business Intelligence Analyst, Customer Success Focus", "company": "Justworks", "city state": "– New York, NY", "rating": "4.5", "job description": "Who we are\n<br><br>\nAt Justworks, you'll enjoy a welcoming and casual environment, great benefits, Diversity + Inclusion and wellness program offerings, company retreats, and the ability to interact with and learn from leaders in the startup community. We work hard and care about our most prized asset - our people.\n<br><br>\nWe're helping businesses get off the ground by enabling them to focus on running their business. We solve HR issues. We're data driven and never stop iterating. If you'd like to work in a supportive, entrepreneurial environment, are interested in building something meaningful and having fun while doing it, we'd love to hear from you.\n<br><br>\nThe job\n<br><br>\nJustworks is seeking a seasoned analyst with a passion for numbers and a demonstrated proficiency in manipulating large data sets to join the Business Intelligence (BI) team. This analyst will partner with the Customer Success (CS) team to provide analytical resources to better service our customers and improve team operations. We will aid with ad hoc and regular reporting requests, with an eye towards creating reusable data tools for the CS team and our customers.\n<br><br>\nWhat you'll do\n\n\n<ul>\n<li>Perform both regular and ad hoc analyses around key business questions that pertain to the CS department</li>\n<li>Build and maintain reports, models, and dashboards around these key metrics to monitor and improve performance</li>\n<li>Translate complicated analyses into actionable insights across the organization</li>\n<li>Strategize data needs of the organization together with the other members of the BI team</li>\n<li>Provide analytical support to members of the CS team as needed</li>\n</ul>\n\nWho you are\n\n\n<ul>\n<li>2 - 3 years of experience working with SQL and translating complex data questions into meaningful insights for non-technical stakeholders</li>\n<li>Strong working knowledge of Excel or another tool for data manipulation</li>\n<li>Comfort with predictive modeling techniques</li>\n<li>Knowledge of at least one statistical programming language preferred, with willingness to learn R, Python or Ruby</li>\n<li>Bachelor's or Master's degree in quantitative field preferred (eg. Mathematics, Statistics, Operations Research, Economics, Physics)</li>\n<li>Experience building dashboards in Tableau is a plus</li>\n<li>Passion for Customer Success is a plus</li>\n</ul>\n\nVisa sponsorship for this role is currently not available.\n<br><br>\nDiversity at Justworks\n<br><br>\nJustworks' vision is for all identities, backgrounds and expressions to be represented in the workplace. We're building the foundation for long-term success and intend to cultivate a safe, collaborative and inclusive space and company culture.\n<br><br>\nWe're proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, Veteran status, or any other legally protected status."}