{"job title": "Senior Process Development Scientist/Engineer, Cell Culture", "company": "Just For All", "city state": "– San Francisco, CA", "rating": "5.0", "job description": "You will be a key member of our Bioprocessing team in our Cellular Agriculture department and essential in producing sustainable and cost-effective clean meat products. You will be responsible for developing and scaling up our animal cell culture platform and will partner with experts in cell biology, process engineering and manufacturing teams to accomplish the above.\n<br><br>\nRole\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Design and execute experiments in bioreactors / shake flasks including process and media optimization to achieve key performance indicators (KPIs)</li>\n<li>Collaborate with other functional groups including cell-line and analytical development teams for screening and characterization studies.</li>\n<li>Perform systematic and thorough statistical data analysis on reactor data to deduce clear conclusions.</li>\n<li>Assist in technology transfer activities and scale-up/scale-down studies.</li>\n<li>Author, review and support continuous improvement of batch records and SOPs</li>\n<li>Mentor interns and research associates as required.</li>\n</ul>\n\nAttributes\n\n\n<ul>\n<li>PhD in chemical / biochemical / biological engineering or related discipline with at least 5-10 years of experience in biotechnology / biopharmaceutical industry.</li>\n<li>Experience in design and operation of bioreactors is required.</li>\n<li>Proven technical experience in developing animal cell culture-based processes.</li>\n<li>Knowledge in technology transfer and scale-up is a plus.</li>\n<li>Excellent technical writing, communication and presentation skills.</li>\n<li>Ability to multi-task and meet aggressive deadlines.</li>\n<li>Mission-driven, self-directed and enthusiastic about collaborating with an inter-disciplinary team of scientists and engineers.</li>\n<li>Ability to pass a standard background check<br><br>SDL2017</li>\n\n</ul>"}