{"job title": "Data Architect", "company": "JUST Capital", "city state": "– New York City, NY", "rating": "3.4", "job description": "<strong>The Organization:</strong>\n<br><br>\n<strong>JUST Capital,</strong> an independent, nonprofit research organization, makes it easier for people and companies to do right by their stakeholders by tracking the business behaviors Americans care about most. Our research, rankings, and data-driven tools help Americans make informed decisions about where to invest, work, and buy to direct capital towards companies advancing a more just future. The list of Americas Most JUST Companies, including the groundbreaking JUST 100 and Industry Leaders, is published annually in Forbes and on JUSTCapital.com.\n<br><br>\nEminent hedge fund manager and philanthropist Paul Tudor Jones co-founded JUST Capital, and it counts Deepak Chopra, Arianna Huffington, Ray Chambers, Steve Schmidt, and many others among its Board. The organization is supported by some of the country's premier philanthropies, including the Ford Foundation and The Robert Wood Johnson Foundation, and has forged partnerships with an array of elite research institutions, including MIT, Stanford, and NORC at the University of Chicago.\n<br><br>\n<strong>The Opportunity - Data Architect:</strong>\n<br><br>\nJUST Capital seeks to fill an important data architect position. This is a new role at JUST Capital and requires an individual comfortable in a hands on environment to architect and develop an enterprise-level data warehouse for our researchers and data scientists to store and aggregate data related to our rankings. Our data and rankings are central to our mission and work.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Provide technical guidance, direction and leadership on unusual or complex problems</li>\n<li>Design, implement and support data models, ETLs that provide structured, timely access to large datasets</li>\n<li>Build fault tolerant, self-correcting, adaptive, highly accurate ETL platforms</li>\n<li>Develop and maintain programs on source systems, ETL applications, data cleansing functions, systems management functions including load automation, and data acquisition functions among others</li>\n<li>Develop data model(s) for the data warehouse</li>\n<li>Responsible for data administration/tuning</li>\n<li>Refine logic design for translation into a specific data model</li>\n<li>Develop, institutionalize and drive best practices and data architectural awareness</li>\n</ul>\n<strong>The ideal candidate will - at a minimum - possess:</strong>\n\n<ul>\n<li>Passion for JUST Capitals mission and be a role model for what we as an organization are measuring in corporate behavior</li>\n<li>Strong problem solving, research and data science/analytical skills</li>\n<li>Experience interacting with a wide range of stakeholders and can adapt communication style on complex data architecting topics to the audience</li>\n<li>Operate at the highest level of integrity and ethical standards</li>\n<li>Advance degree preferred in related field and at least 5 years of relevant experience in each of the following areas such as but not limited to:\n\n\n<ul>\n<li>Demonstrated experience of data architecture and data modeling, developing and implementing metadata and master data strategies in data warehouse and mart environments</li>\n<li>Thorough understanding or relational and dimensional database modeling</li>\n<li>SQL with focus on business intelligence and data warehousing</li>\n<li>Java and Python development</li>\n<li>Designing and orchestrating Pentaho kettle transformations and job flows</li>\n<li>Experience in web scraping and data extraction capabilities with complex data structures</li>\n</ul>\n\n</li>\n</ul>\n<strong>The JUST Capital Work Environment:</strong>\n<br><br>\nJUST Capital is a small organization staff-wise and operates with a nimble, entrepreneurial early-stage mindset. As such, in addition to the above responsibilities, candidates should have professional work approaches, be self-starters and possess well developed organizational skills honed to allow him/her to be effective and resourceful in a fast-paced workplace. Further, adaptability, good colleagueship, working with cross-functional teams to deliver projects on tight deadlines, and internal community building are important attributes of the JUST Capital culture.\n<br><br>\n<strong>To apply:</strong>\n<br><br>\nDue to the pace of this search, candidates are strongly encouraged to apply as soon as possible. Applications should include a thoughtful cover letter describing your interest and qualifications and your resume.\n<br><br>\nSubmit your resume and cover letter to: http://justcapital.com/careers. Resumes without a cover letter will not be considered. Due to volume, only those candidates considered for an interview will be contacted.\n<br><br>\n<strong>JUST Capital is an Equal Opportunity Employer; people with disabilities are encouraged to apply</strong>"}