{"job title": "Data Scientist", "company": "Juvo", "city state": "– San Francisco, CA", "rating": "4.4", "job description": "<div>Juvo was founded with an overarching mission: to establish financial identities for the billions of people worldwide who are creditworthy, yet financially excluded. In partnership with mobile network operators, Juvos proprietary Identity Scoring technology uses data science, machine learning and game mechanics to create an identity-based relationship with anonymous prepaid users, opening up access to otherwise unattainable mobile financial services.</div>\n<br>\n<div>Since emerging from stealth in September 2016, Juvo has increased its global reach five times over, from 100 million to 500 million, and has steadily grown its operations and employee base worldwide with 70 employees today. To date, Juvo has enabled over 400M transactions in 25 countries and 4 continents, with 1M active subscribers a day. Juvos mobile operator partners include Telefonica, Millicom, Sprint, Duetsche Telekom and Cable &amp; Wireless.\n<br><br>\nIn 2017, Juvo completed a $40 million USD Series B funding round with funding from Samsung NEXT and top-tier VCs including NEA, Wing Venture, and Freestyle Capital. Early investors in the company include the former CEOs of AT&amp;T Wireless, NYSE, Sprint, Telefonica International and Vodafone Group. Juvo is frequently profiled in top tier tech and business press and our proprietary technology, Identity Scoring, is award winning.</div>\n\n<br>About the Job<br><br>We are looking for a talented Data Scientist to help Juvo convert user data into personalized credit scores. You will play a central role not only in ensuring Juvos success, but improving the financial landscape of millions, if not billions of people. As you lead key Data Science and platform initiatives, you will play a major role in the planning and construction of Juvos technical stack.<br><br>Qualifications\n\n\n<ul>\n<li>MS/PhD in a quantitative field e.g., Physics, Astronomy, Chemistry, CS, Math or have worked in Data Science, Quantitative Research or Software Development for 5 years.</li>\n<li>Comfortable in Unix computing environments and have a handful of your favorite BASH tricks. You are fluent in one or more of the following programming languages: Python, Scala, R, Java.</li>\n<li>Familiar with distributed computing frameworks such as Hadoop, Spark, Hive.</li>\n<li>You know your way around AWS and regularly use one or more of their services e.g., S3, EC2, EMR, Redshift, DynamoDB, Kinesis, etc.</li>\n<li>You like working in a fast-paced collaborative environment where the mantra is to push to master, make sure it makes sense...and doesn't break!</li>\n</ul>"}