{"job title": "Senior Data Scientist, Customer Insights", "company": "Kabbage", "city state": "– Atlanta, GA", "rating": "4.4", "job description": "Kabbage is setting a new standard in big data and FinTech, and we are looking for a <strong>Senior Data Scientist, Customer Insights</strong> to join us as we continue our amazing growth trajectory. As we offer the only fully automated, online lending platform designed to support continuous customer data monitoring, Data Science is one of the pillars of Kabbage's persistent innovation and sets the standard for automated lending.\n<br><br>\nKabbage is more than a lender for small businesses; our data and technology platform is now being used as a fully branded product by other lenders, and our products are growing rapidly. We've received numerous awards and recognition, including Glassdoor's 2017 Best Places to Work, \"36th fastest growing company in the US\" on the INC 500 List, Fast Company's \"Top 10 most innovative companies in finance\" and Forbes' \"America's Top 100 Most Promising Companies\" among others.<br><br>Your mission:<br><br>Design studies and develop algorithms that leverage multiple data sources to guide (amongst other things) our customer experience and customer behavior. Design features and models to gain a strong understanding of our customers' journey throughout their relationship with Kabbage. Communicate and apply those insights to improve customer experience, thus helping small businesses access and deploy capital more effectively.<br><br>What you'll be doing:\n\n\n<ul>\n<li>Work with multiple, complex data sources such as financial transactions, credit bureau reports, social media behavior, and e-commerce data at large scale to build predictive models including (but not limited to) customer satisfaction, customer behavior, customer engagement, segmentation, marketing response and propensity.</li>\n<li>Assess data needs, design primary research projects, and propose analytical solutions to provide practical, value-added answers.</li>\n<li>Conduct a variety of advanced statistical analyses including discrete choice/conjoint analysis, latent class and other clustering techniques, maximum difference scaling, multiple regression and logistic regressions, decision trees (e.g. CHAID/CART), and factor and correspondence/MDS analysis.</li>\n<li>Recommend and explain research methods and analytical techniques appropriate for targeting and segmenting customers, product design, reducing customer turnover (churn).</li>\n<li>Present and defend actionable insights to senior leadership.</li>\n</ul>\n\n<strong>What we're looking for in you:\n<br><br>\n</strong>\n\n\n<ul>\n<li><strong>Intelligence:</strong> Learns quickly. Demonstrates ability to quickly and proficiently understand. You have an aptitude to independently learn new technologies.</li>\n<li><strong>Communication:</strong> Excellent written and oral communication skills and ability to share findings with a large, non-technical audience.</li>\n<li><strong>Attention to detail:</strong> Does not let important details slip through the cracks or derail a project. You're a perfectionist who tempers perfection with deadlines.</li>\n<li><strong>Creativity:</strong> Able to think about traditional questions in a creative way to find new solutions given new data or circumstances.</li>\n<li><strong>Proactivity:</strong> Acts without being told what to do. Brings new ideas to the company.</li>\n<li><strong>Persistence:</strong> Demonstrates tenacity and willingness to go the distance to get something done.</li>\n</ul>\n\n<strong>What you should have:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Strong background in predictive modeling, text mining, recommender systems, market basket analysis, segmentation, graph analytics, and text analytics.</li>\n<li>Strong ability in at least one programming language, preferably Python.</li>\n</ul>\n\n<strong>Bonus Points:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Fluency in big data platforms such as Hadoop, MapReduce, Hive, or Spark.</li>\n<li>Experience with text mining and statistical language processing.</li>\n<li>Relevant industry experience is a big plus.</li>\n</ul>\n\nThe Kabbage Advantage<br><br>At Kabbage, our people are awesome, so we built the Kabbage Advantageour way of being awesome right back. We offer competitive benefits including unlimited PTO, equity in the company, and exceptional health coverage options. Our team members enjoy a dynamic work environment with daily catered lunches, fully stocked kitchens, and onsite fitness classes.\n<br><br>\nWhile our perks and benefits are generous, the people are <em>actually</em> what make Kabbage great. Kabbagers are curious, creative, and resilient. We are enthusiastic, productive, and problem solvers. And we don't do it alone. At Kabbage, you will find low ego individuals who work hard to communicate effectively and work collaboratively.\n<br><br>\n<em>Kabbage is an equal opportunity employer. At Kabbage we make all employment decisions, which include hiring, promoting, transferring, demoting, evaluating, compensating and separating, without regard to sex, sexual orientation, gender identity, race, color, religion, age, national origin, pregnancy, citizenship, disability, service in the uniform services, or any other classification protected by federal, state or local law.</em>"}