{"job title": "Data Scientist, Feature Engineering", "company": "Kabbage", "city state": "– Atlanta, GA", "rating": "4.4", "job description": "Kabbage is setting a new standard in big data and FinTech, and we are looking for a <strong>Data Scientist, Feature Engineering</strong> to join us as we continue our amazing growth trajectory. As we offer the only fully automated, online lending platform designed to support continuous customer data monitoring, Data Science is one of the pillars of Kabbage's persistent innovation and sets the standard for automated lending.\n<br><br>\nKabbage is more than a lender for small businesses; our data and technology platform is now being used as a fully branded product by other lenders, and our products are growing rapidly. We've received numerous awards and recognition, including Glassdoor's 2017 Best Places to Work, \"36th fastest growing company in the US\" on the INC 500 List, Fast Company's \"Top 10 most innovative companies in finance\" and Forbes' \"America's Top 100 Most Promising Companies\" among others.<br><br>Your mission:<br><br>Help with the incredible task of building data pipelines and finding new data sources for Kabbage. Understand all the nuances of data you are working with, and extract information from complex data sets.<br><br>What you'll be doing:\n\n\n<ul>\n<li>Analyze, understand and contextualize datasets from a variety of sources.</li>\n<li>Evaluate new data sources for acquisition and integration.</li>\n<li>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS technologies.</li>\n<li>Turn raw data into features to be used in machine learning models.</li>\n<li>Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.</li>\n<li>Work cross-functionally with technical leaders across the business to become the guru on understanding how our data is being collected and used throughout the business.</li>\n</ul>\n\n<strong>What we're looking for in you:\n<br><br>\n</strong>\n\n\n<ul>\n<li><strong>Intelligence:</strong> Learns quickly. Demonstrates ability to quickly and proficiently understand. You have an aptitude to independently learn new technologies.</li>\n<li><strong>Efficiency</strong>: Able to produce significant output with minimal wasted effort.</li>\n<li><strong>Organization and Planning</strong>: Plans, organizes, and schedules in an efficient, productive manner; focuses on key priorities; manages time well</li>\n<li><strong>Analytical Skills</strong>: Able to structure and process qualitative or quantitative data and draw insightful conclusions from it; exhibits a probing mind and achieves penetrating insights</li>\n<li><strong>Problem Solving</strong>: Provides practical solutions to problems</li>\n<li><strong>Initiative</strong>: Actively finds ways to make improvements at work</li>\n<li><strong>Flexibility/Adaptability</strong>: Adjusts quickly to changing priorities and conditions; copes effectively with complexity and change</li>\n<li><strong>Enthusiasm</strong>: Exhibits passion and excitement over work; has a can-do attitude</li>\n<li><strong>High Standards</strong>: Expects personal performance and team performance to be nothing short of the best</li>\n<li><strong>Teamwork</strong>: Reaches out to peers and cooperates with supervisors to establish an overall collaborative working relationship</li>\n<li><strong>Communication:</strong> Excellent written and oral communication skills and ability to share findings with a large, non-technical audience.</li>\n<li><strong>Attention to detail:</strong> Does not let important details slip through the cracks or derail a project. You're a perfectionist who tempers perfection with deadlines.</li>\n<li><strong>Persistence:</strong> Demonstrates tenacity and willingness to go the distance to get something done.</li>\n</ul>\n\n<strong>What you should have:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Strong ability in at least one programming language, preferably Python.</li>\n<li>Strong knowledge of statistics.</li>\n<li>Experience processing large amounts of structured and unstructured data.</li>\n<li>A successful history of manipulating, processing, and extracting value from large disconnected datasets.</li>\n<li>Experience in machine learning, natural language processing, and other modeling techniques.</li>\n<li>Experience with big data tools: Hadoop, Spark, Kafka, etc.</li>\n<li>Experience with relational SQL and NoSQL databases, including Postgres and Cassandra.</li>\n<li>Experience with AWS cloud services: EC2, EMR, RDS, Redshift.</li>\n<li>Experience with stream-processing systems: Storm, Spark-Streaming, Flink, etc.</li>\n</ul>\n\n<strong>Bonus points:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Relevant industry experience is a big plus.</li>\n</ul>\n\nThe Kabbage Advantage<br><br>At Kabbage, our people are awesome, so we built the Kabbage Advantageour way of being awesome right back. We offer competitive benefits including unlimited PTO, equity in the company, and exceptional health coverage options. Our team members enjoy a dynamic work environment with daily catered lunches, fully stocked kitchens, and onsite fitness classes.\n<br><br>\nWhile our perks and benefits are generous, the people are <em>actually</em> what make Kabbage great. Kabbagers are curious, creative, and resilient. We are enthusiastic, productive, and problem solvers. And we don't do it alone. At Kabbage, you will find low ego individuals who work hard to communicate effectively and work collaboratively.\n<br><br>\n<em>Kabbage is an equal opportunity employer. At Kabbage we make all employment decisions, which include hiring, promoting, transferring, demoting, evaluating, compensating and separating, without regard to sex, sexual orientation, gender identity, race, color, religion, age, national origin, pregnancy, citizenship, disability, service in the uniform services, or any other classification protected by federal, state or local law.</em>"}