{"job title": "Senior Data Analyst, Marketing", "company": "KAISER", "city state": "– Oakland, CA", "rating": "3.9", "job description": "The Data Analytic Consultant provides support in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing and reporting data. These positions function both as a consultant and as a high-level data analyst. The position works with clients to develop the right set of questions/hypotheses, using the appropriate tools/skills to derive the best information to address customer needs.\n<br><br>\n<strong>Essential Functions:</strong>\n\n<li> Provides direction for assigned components of project work.\n\n</li><li> Coordinates, team/project activities &amp; schedules.\n\n</li><li> With some feedback and mentoring, able to develop proposals for clients, project, structure, approach, &amp; work plan.\n\n</li><li> Given scope of work, minimal feedback/rework is necessary.\n\n</li><li> Evaluates effectiveness of actions/programs implemented.\n\n</li><li> Researches key business issues, directs the collecting and analyzing of quantitative and qualitative data.\n\n</li><li> Proactively records workflows, deliverables, and standing operating procedures for projects.\n\n</li><li> Developing specified QA procedures to ensure accuracy of project data, results and written reports &amp; presentation materials.\n<br>\n<strong>Basic Qualifications:</strong>\n<br>\nExperience\n\n</li><li> Minimum two (2) years of work experience.\n<br>\n<strong>Education</strong>\n\n</li><li> Bachelor's degree in related field, OR four (4) additional years of experience in a directly related field.\n\n</li><li> High School Diploma or General Education Development (GED) required.\n<br>\nLicense, Certification, Registration\n\n</li><li> N/A\n<br><br>\n<strong>Additional Requirements:</strong>\n\n</li><li> Working knowledge of policies, practices and systems.\n\n</li><li> Frequent use and general knowledge of industry practices, techniques, and standards.\n\n</li><li> General application of concepts and principles.\n\n</li><li> Full use and application of standard principles, theories, concepts, and techniques.\n\n</li><li> Must be able to work in a Labor/Management Partnership environment.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n\n</li><li> Master's degree.\n\n</li><li> Knowledge of health care industry preferred.\n\n</li><li> Familiarity with Kaiser Permanente health care system preferred.</li>"}