{"job title": "Data Scientist", "company": "Kani Solutions", "city state": "– Chicago, Illinois", "rating": "4.8", "job description": "Job Title: Data Scientist Location: Chicago, IL Hire Type: Long Term Contract or Permanent Job Description: We are looking for a Data Scientist that will help us discover the information hidden in vast amounts of data, and help us make smarter decisions to deliver even better products. For example, help drive decision making during the claim life cycle by forecasting claim severity, detecting fraud, identifying subrogation opportunities, etc. Primary focus will be in applying data mining techniques, doing statistical analysis, and building high quality prediction systems integrated with our products. Responsibilities: Enhancing data collection procedures to include information that is relevant for building analytic systems Extending company's data with third party sources of information when needed Processing, cleansing, and verifying the integrity of data used for analysis Designing, implementing and deploying scalable algorithms and models that utilize large amounts of data. Evaluating and optimizing model results. Interpreting, visualizing and presenting results in a clear manner Working with data engineers to deploy the models Creating automated anomaly detection systems and constant tracking of its performance. Skills and Qualifications: MS in relevant quantitative fields (Computer Science, Statistics) 2-3 years' experience with a range of techniques, tools and methods related to statistical analysis Fluency with at least one statistical language such as Python or R; hands-on experience using a variety of analytical methods Knowledge and understanding of statistical, predictive modeling and machine learning techniques and algorithms, including Neural Networks, Text Mining, etc. Experience with Keras, TensorFlow, H2OFlow Excellent communication skills. Soumen Mondal Ph: ************ E-mail: ****************** - provided by DicePython or R, Keras, TensorFlow, H2OFlow, Statistical, Predictive Modeling and Machine Learning techniques"}