{"job title": "Senior Data Scientist (Marketing)", "company": "KAYAK", "city state": "– Cambridge, MA, United States", "rating": "4.1", "job description": "<strong>Position</strong><br><br>\"Love numbers\" is one of KAYAK's core cultural values, and being the leading travel search engine worldwide means that we have a lot of numbers and data. Our marketing data science team uses that data to better enable KAYAK to share our product with travelers around the globe- we want to enable everyone to be confident in travel planning.\n<br><br>\nWe’re looking for a Senior Data Scientist to join our team. As a team built on diverse backgrounds, we are looking for an experienced problem-solver to contribute the strengths of their own experiences and expertise. Our ultimate goal is to ask and answer the questions, as well as build the tools, that will let KAYAK confidently scale user acquisition across all of our markets. You will also be working closely with an international team of analysts, engineers, and marketing experts.\n<br><br>\nThis is a “full-stack” data science role. Our team's projects can draw from the following skill sets: assembling data sources from square one, parsing and cleaning data, mining for insights, building and improving models, designing and running experiments, presenting results and giving recommendations to stakeholders outside our team, and driving business decisions or technical changes to our product.\n<br><br>\nA sample of projects we work on:\n<ul>\n<li>Improving the predictive models and control algorithms used by our home-grown bidding platform to make large-scale user acquisition decisions</li><li>Building data pipelines and reporting solutions to monitor performance metrics across marketing channels</li><li>Forecasting future KPIs using time series analysis techniques</li><li>Optimizing budget allocation and investment strategies across channels and campaigns</li><li>Running experiments to assess the true impact of marketing campaigns</li><li>User journey analyses, including lifetime value and paths to conversion</li>\n</ul>\nThis position will be based in our Cambridge office near Kendall Square/Lechmere.\n<br><br>\n<strong>What We're Looking For</strong>\n<ul>\n<li>Ability to write high quality code, especially in Python</li><li>A storyteller's approach to analysis: not satisfied at \"what\", but \"why?\", \"how?\", and \"what next?\"</li><li>Extensive experience with SQL and database usage. Data manipulation and extraction should be a well-honed tool in your toolset</li><li>Extensive experience with building mathematical models for real-world events/scenarios</li> <li>Loves problem solving and developing creative, tailored approaches</li> <li>Great communication skills- capable of bridging business and technology</li><li>4+ years of industry experience in a related role</li><li>Experimental design experience is a plus</li><li>Online marketing experience is a plus</li>\n</ul>\n<strong>About KAYAK</strong>\n<br><br>\nOur mission at KAYAK is to provide the world’s favorite travel planning tools. With every query, KAYAK searches other sites to show travelers the information they need to find the right flights, hotels, rental cars and vacation packages.\n<br><br>\nAnd because our team is always on the lookout looking for ways to make travel planning and trip management even easier, we offer a variety of tools and features such as KAYAK Trips, Explore and Price Forecast and are constantly evolving our app, Facebook Messenger and Slack bots, Alexa skill and related A.I. innovations.\n<br><br>\nIn addition to KAYAK, we manage a portfolio of metasearch brands including: momondo, Cheapflights, SWOODOO, checkfelix and Mundi that together process more than two billion consumer queries a year.\n<br><br>\nKAYAK is an independently managed subsidiary of Booking Holdings Inc.\n<br><br>\n<strong>BENEFITS AND PERKS</strong>\n<ul>\n<li>4 weeks paid vacation</li><li>Day off on your birthday</li><li>Generous retirement plans</li><li>Awesome health, dental and vision insurance plans</li><li>Flexible Spending Accounts</li><li>No stupid meetings</li><li>Drinks, coffee, snacks, games etc.</li><li>Flexible hours</li><li>Free massages from professional masseuse</li><li>Regular team events/excursions</li>\n</ul>"}