{"job title": "Scientist-II", "company": "Kelly Services", "city state": "– San Diego, CA", "rating": "3.4", "job description": "Kelly Services® has been providing outstanding employment opportunities to the most talented individuals in the marketplace. We are proud to offer a long-term temporary opportunity to work as a <strong>Scientist</strong> at a prestigious Fortune 500® company working in <strong>San Diego, CA.</strong>\n<br><br>\n<strong>Important information:</strong> This position is recruited for by a remote Kelly office, not your local Kelly branch. To be considered for this position, you must use the “Submit Resume” button to submit your resumes. If you have questions about the position, you may contact the recruiter for this position (Brooke.Schoen@kellyservices.com) however your resume must be received via the “Submit Resume” button included within.\n<br><br>\n<strong>Job Title: Scientist</strong>\n<br><br>\n<strong>Position Summary</strong>\n<br>\nSeeking candidates with experience in cell biology, molecular biology, and biochemistry. In specific, an ideal candidate will have significant experience in mammalian cell culture, molecular cloning, immunocytochemistry, western blot assays, radioligand binding assays, and FLIPR assays. Strong experimental design and data processing is desired.\n<br><br>\n<strong>We invite you to bookmark our Web site and encourage you to review it regularly for new opportunities worldwide:</strong> www.kellyservices.com<strong>.</strong>\n<br><br>\n<strong><em>Kelly Services® is a U.S.-based Fortune 500 company. With our global network of branch locations, we are uniquely positioned to provide our customers with international staffing support and our employees with diverse assignments around the world.</em></strong>\n<br><br>\n<strong>Kelly Services is an Equal Opportunity Employer</strong><br>\n\n<div>Why Kelly®?</div>\n<br><br>\nWith Kelly, youll have access to some of the worlds highest-regarded scientific organizations\n<br><br>\nproviding you with opportunities to work on todays most challenging, research-intensive, and relevant \n<br><br>\nprojects. Our connections can lead you to innovative scientific pursuits youll be proud to help \n<br><br>\nadvance. We work with 95 of the Fortune 100 companies, and found opportunities for more than 9,000 \n<br><br>\nscientific professionals last year.<br><br>You pursued a career in science to fuel your quest for knowledge and your desire to make the world \n<br><br>\na better place. Let Kelly fuel your careerconnect with us today.<br>\n\n<div>About\n<br>\nKelly Services®</div>\n<br><br>\nAs a workforce advocate for over 70 years, we are proud to directly employ nearly 500,000 people around the world and have a role in connecting thousands more with work through our global network of talent suppliers and partners. Revenue in 2017 was $5.4 billion. Visit <u>kellyservices.com</u> and connect \n<br><br>\nwith us on <u>Facebook</u>, <u>LinkedIn</u> and <u>Twitter</u>.<br><br>Kelly Services is an equal opportunity employer including, but not limited to, Minorities, Females, \n<br><br>\nIndividuals with Disabilities, Protected Veterans, Sexual Orientation, Gender Identity and is \n<br><br>\ncommitted to employing a diverse workforce. <u>Equal Employment Opportunity \n<br><br>\nis The Law.</u>"}