{"job title": "Data Scientist", "company": "Kelly Mitchell Group", "city state": "– Irving, TX", "rating": "3.5", "job description": "<div>KellyMitchell matches the best IT and business talent with premier organizations nationwide. Our clients, ranging from Fortune 500 corporations to rapidly growing high-tech companies, are exceptionally served by our 1500+ IT and business consultants. Our industry is growing rapidly, and now is a great time to launch your career with the KellyMitchell team.\n<br><br>\n<strong>Position Title:</strong> Data Scientist</div>\n<br><strong>Position Summary:</strong>\n\n<ul>\n\n\t<li>This position will focus on improving the quality and usage of data in Enterprise Data Warehouse and source systems. To ensure high levels of data quality in source systems and data warehouse platforms across the enterprise, analyze, evaluate, test, and participate in designing the remediation of data deficiencies in various environments. You will use your strong communication skills and your understanding of data modeling concepts collaborating with members of the business, operations and IT teams to understand requirements and research data anomalies to ensure consistency and quality. You will also test newly developed functionality to ensure the highest level of data quality exists upon delivery.</li> \n</ul>\n<strong>Areas of involvement include:</strong>\n\n<ul>\n\n\t<li>Identifying, documenting, and resolving data quality issues and core business data; provide recommendations for data quality and process improvements for source systems and data warehouse platforms;</li> \n\n<li>Performing root cause analysis and investigating data errors or anomalies;</li> \n\n<li>Develop as a subject matter expert and work with business analysts, business users, and database developers to understand how CVS Health data supports strategic initiatives;</li> \n\n<li>Analyzing ETL processes to ensure accurate data transformations; Documenting existing data structures and process flows; Participating in application validation and User Acceptance Testing efforts as they pertain to reporting, data, and metrics;</li> \n\n<li>Executing and evaluating manual or automated test cases and reporting test results;</li> \n\n<li>Collaborating directly with business data owners and business analysts to establish quality business rules that will provide the foundation of the enterprises’ data quality improvement plan;</li> \n\n<li>Utilizing data profiling and data quality tools to uncover and determine root causes of data quality issues;</li> \n\n<li>Collaborating with the Data Warehouse team to develop data quality scripts to apply to the ETL process based on the business rules defined by business data owners and to develop data quality improvement reporting.</li> \n\n<li>Articulating the need for and benefits of data quality to both IT and the business.</li> \n\n<li>Documenting the business requirements for a particular reporting need and act as business analyst to own the specification and validate the report before release to business user</li> \n</ul>\n<strong>Required Qualifications:</strong>\n\n<ul>\n\n\t<li>To be considered for this very important and highly visible opportunity, candidates must have a minimum of 5 years of demonstrated experience in analyzing very large data sets from data warehouses and draw relevant conclusions. In addition, candidates will need to have strong experience with the following:</li> \n\n<li>Demonstrated experience in database testing on Teradata and/or Oracle including designing and manipulating test data, extracting data for analysis; Strong work experience with Teradata, SAS, ANSI SQL, strong SQL programming experience in addition to advanced skills with MS Office products; Experience in creating very clear, concise and detailed test plans/cases from written specifications or verbal communication.</li> \n</ul>\n<strong>Education:</strong>\n\n<ul>\n\n\t<li>Bachelor’s degree required.</li> \n\n<li>Degree in Statistics, Computer Science or other data related degree. MBA or Master's degree preferred.</li> \n</ul>"}