{"job title": "Data Scientist", "company": "Kensho Technologies", "city state": "– Massachusetts, Massachusetts", "rating": "5.0", "job description": "At Kensho, we hire talented people and give them the autonomy and support needed to build amazing technology and products. To do this, we look for people who insist on a bias towards action to minimize unhelpful hierarchy and process. We collaborate using our teammates' diverse perspectives to solve hard problems. Our communication with one another is open, honest and efficient. We dedicate time and resources to explore new ideas and, as a result, we produce technology that is scalable, robust, and useful.\n<br><br>\nA data scientist at Kensho is passionate about one thing: data. The successful candidate will have extensive experience applying a range of econometrics/statistics models to a diverse set of data. You should enjoy moving beyond the theoretic confines of academia to applying your tradecraft in the real world and producing data driven products that will be used by decision makers throughout the global banking industry and beyond. The ideal candidate is precise and detail oriented. Most importantly, a Kensh data scientist is excited at the opportunity to work in a lean, tight-knit startup bringing transparency to some of the hardest problems on the planet.\n<br><br>\n<strong>What You'll Do:</strong>\n\n\n<ul>\n<li>Conduct original research on some of the most interesting datasets - both proprietary and open source</li>\n<li>Identify, research, prototype, and build predictive products</li>\n<li>Analyze, transform, structure, and crunch financial data that is growing in size, diversity, and complexity</li>\n<li>Write production-ready code to identify interesting outliers, anomalies, correlations, and associations</li>\n<li>Write tests to ensure the robustness and reliability of the team's productionized models</li>\n</ul>\n\n<strong>What We Look For:</strong>\n\n\n<ul>\n<li>Advanced degree in Computer Science, Statistics, Economics, or related quantitative field</li>\n<li>2+ years of experience in data analysis or similar role</li>\n<li>At least one core programming expertise, such as python (iPython, NumPy, SciPy, Pandas) or R</li>\n<li>Experience with advanced machine learning, natural language process, and statistics model</li>\n<li>Strong statistical knowledge and intuition, especially for applying analysis to real data</li>\n<li>Strong interest on capital market &amp; economics theory</li>\n</ul>\n\n<strong>How to Really Get Our Attention:</strong>\n\n\n<ul>\n<li>Major contributor at a top company with big data</li>\n<li>Individual research</li>\n<li>Significant experience at a top financial analytics company or hedge fund</li>\n<li>Your github account showing entrepreneurial yet practical initiative</li>\n</ul>\n\n<strong>Technologies We Like:</strong>\n\n\n<ul>\n<li>Advanced statistics &amp; statistical programming language like python, R, and MATLAB</li>\n<li>Python and specifically Numpy, SciPy &amp; Pandas, scikit-learn, TensorFlow, Theano</li>\n<li>Data stores like Postgresql, ElasticSearch, and various NoSQL alternative</li>\n</ul>\n\n<strong>Perks:</strong>\n\n\n<ul>\n<li>Medical, Dental, and Vision insurance with 100% premium covered</li>\n<li>Unlimited vacation days</li>\n<li>Paid Parental Leave</li>\n<li>401(k) plan with employer match</li>\n<li>Free snacks and drinks</li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin. **********\n<br><br>\nRead Full Job Description\n\n\n<ul>\n<li>******************************************************************************************* &amp; lever-source%5B%5D=BuiltInBoston</li>\n</ul>"}