{"job title": "Machine Learning Engineer / Data Scientist", "company": "Kensho Technologies", "city state": "– Los Angeles, California", "rating": "5.0", "job description": "Kensho is looking for extremely talented ML scientists to execute critical R &amp; D projects on one of the largest financial datasets in the world. Working in a highly collaborative environment, you will produce data driven products to empower decision making at all levels of the global banking and financial industries. The ideal candidate should have extensive experience applying a range of machine learning models to a diverse set of problems.\n<br><br>\nWhat You'll Do\n\n\n<ul>\n<li>Conduct original research on both proprietary and open source data sets</li>\n<li>Rapidly prototype and implement predictive models</li>\n<li>Write production-ready Python code, including tests to ensure robustness and reliability</li>\n<li>Collaborate with a wide array of groups across engineering, product, and business to ensure maximal impact of solutions</li>\n</ul>\n\nWhat We Look For\n\n\n<ul>\n<li>Machine learning experience at a top technology company</li>\n<li>Advanced degree in Computer Science, Physics, Mathematics, or a related discipline</li>\n<li>At least one core programming expertise, such as Python, MATLAB, or R</li>\n<li>Experience with advanced machine learning methods and technologies such as Tensorflow/PyTorch, XGBoost/LightGBM, numpy/scipy/pandas/scikit-learn</li>\n<li>Statistically rigorous approaches to model evaluation and experiments</li>\n<li>Strong communication, presentation, and interpersonal skills</li>\n<li>Effective coding and documentation habits, including GitHub and experience in one or more IDEs/editors</li>\n<li>Several of the following terms should hold deep meaning for you: lookahead bias, attention, bagging, boosting, MAP, stacking, residuals, normalization, CNN, LSTM, KL-divergence, data augmentation, sparsity, bootstrapping, HMM, TD(Lambda), information retrieval, vanishing gradients</li>\n</ul>\n\nHow to Really Get Our Attention\n\n\n<ul>\n<li>PhD from a top university</li>\n<li>Proven record for publishing original research</li>\n<li>Your github/kaggle account showing practical, entrepreneurial initiative</li>\n</ul>\n\n<strong>Perks</strong>\n\n\n<ul>\n<li>Medical, dental, and vision insurance with 100% premium covered</li>\n<li>Unlimited vacation days</li>\n<li>Paid parental leave</li>\n<li>401(k) plan with employer match</li>\n<li>Free gym membership</li>\n<li>Free snacks and drinks</li>\n<li>Ocean views</li>\n</ul>\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin. **********\n<br><br>\nRead Full Job Description\n\n\n<ul>\n<li>******************************************************************************************* &amp; lever-source%5B%5D=BuiltInLosAngeles</li>\n</ul>"}