{"job title": "Product Development Scientist II", "company": "Keurig Dr Pepper", "city state": "– USA-Massachusetts-MA - Burlington", "rating": "3.7", "job description": "Come join a creative team of scientists and engineers on the forefront of beverage innovation! This team is dedicated to growing the category by pushing the boundaries of beverage development and delivery to satisfy every consumer need. Over 10 years ago, the coffee industry was revolutionized with the launch of the Keurig brewing system, allowing consumers to brew one cup of coffee on demand. Now with the power of Keurig Dr Pepper, join a new challenger in the beverage industry and let’s discover the possibilities!\n<br><br>\nKeurig Dr Pepper (NYSE: KDP) is a leading coffee and beverage company in North America, with annual revenue in excess of $11 billion. KDP holds leadership positions in soft drinks, specialty coffee and tea, water, juice and juice drinks and mixers, and markets the #1 single serve coffee brewing system in the U.S. The Company maintains an unrivaled distribution system that enables its portfolio of more than 125 owned, licensed and partner brands to be available nearly everywhere people shop and consume beverages. With a wide range of hot and cold beverages that meet virtually any consumer need, KDP key brands include Keurig®, Dr Pepper®, Green Mountain Coffee Roasters®, Canada Dry®, Snapple®, Bai®, Mott’s® and The Original Donut Shop®. The Company employs more than 25,000 employees and operates more than 120 offices, manufacturing plants, warehouses and distribution centers across North America.\n<br><br>\nThis diverse and important role within Beverage R&amp;D enables Keurig Dr Pepper to maximize the impact of the Keurig system synergy (beverage, pod, and appliance) to partners, customers, and consumers. The product development scientist II will:\n<br><br>\n1. Lead hot and cold Beverage Development as part of the Keurig Innovation System beginning with early stage, pre-concept exploration and development, across multiple growth platforms\n<br><br>\n2. Generate ideas for beverage and system innovation working with consumer insights, marketing, and appliance teams\n<br><br>\n3. Act as the key Beverage R&amp;D representative assuring beverage requirements and quality considerations are included in Appliance and Pod Innovation and productivity initiatives\n<br><br>\n4. Advances the business by strengthening collaboration between Pod and Appliance teams, while driving consumer led innovation with sound scientific method and technical excellence\n<br><br>\nPOSITION RESPONSIBILITIES:\n<br><br>\nThis role is multifaceted, and will balance hands on beverage formulation, product and process research on related enabling technologies, project management, participation/support in consumer science analysis and interpretation, experimental test method development, data analysis, and intense collaboration with cross-functional teams, specifically appliance development and productivity\n<br><br>\nResponsibilities include:\n<br><br>\n· Hot and Cold beverage formulation for coffee, tea, cocoa, indulgent products, new appliances, and products against the beverage innovation pipeline\n<br><br>\n· Rapid prototype generation and testing (physical, chemical, sensorial attributes, and stability); data recording and analysis\n<br><br>\n· Active participant in innovation brainstorm sessions as well as funnel current and developing trends to project teams\n<br><br>\n· Source and develop new ingredients or beverage processing/packaging solutions\n<br><br>\n· Development of experimental plans with appliance and portion pack teams to test new concepts, assess feasibility and consumer test new beverages\n<br><br>\n· Create and drive timelines, actions plans, reports, and presentations to manage and communicate progress on a given initiative\n<br><br>\n· Educate cross functional partners on technical and scientific principles of beverages as necessary\n<br><br>\n· Represent beverage technical considerations including quality, sensory characteristics, stability, food safety, manufacturability, and functionality in appliance, portion pack and consumer design initiatives- prepare and deliver effective recommendations\n<br><br>\n· Positively influence and engage in a creative, performance driven culture\n<br><br>\nCAPABILITIES\n<br><br>\n· Ability to manage several diverse projects at a time\n<br><br>\n· Self-motivated, takes initiative; influencing\n<br><br>\n· Highly collaborative communication and strong presentation skills\n<br><br>\n· Ability to synthesize a vision/mission into tangible ideas that win with consumers\n<br><br>\n· Change readiness, resiliency and flexibility to thrive in a constantly-changing and fast moving organization\n<br><br>\nWORK PERKS\n<br><br>\n· On-site Gym, Cafeteria and Specialty Coffee Bar\n<br><br>\n· Continuous supply of free coffee\n<br><br>\nBenefits built for you\n<br><br>\nOur people are the heart of our business, which is why we offer robust benefits to support your health and wellness as well as your personal and financial well-being. We also provide employee programs designed to enhance your professional growth and development while ensuring you feel valued, inspired and appreciated at work.<br>\n<div>\n<div>· Bachelor’s Degree in Food Science, or Engineering discipline. Beverage concentration experience, coffee and/or dairy beverage formulation experience highly desired/preferred\n<br><br>\n· 3-6 years experience of product development in the innovation space; Consumer Packaged Goods experience preferred\n<br><br>\n· Proficiency in understanding sensory and consumer sciences, consumer insights, as well as Good Lab and Manufacturing Practices, and Food Safety Regulatory Standards\n<br><br>\n· Adequate business orientation; ability to ask relevant questions, understand business case and consumer proposition\n<br><br>\n· Strong team player; experience in bringing teams/individuals together to deliver projects; strong thought and executional leadership\n<br><br>\nKeurig Dr Pepper Inc. is an equal opportunity employer and affirmatively seeks diversity in its workforce. Keurig Dr Pepper Inc. recruits qualified applicants and advances in employment its employees without regard to race, color, religion, gender, sex, sexual orientation, gender identity, gender expression, age, disability, genetic information, ethnic or national origin, marital status, veteran status, or any other status protected by law. EOE Minorities/ Females/ Protected Veterans/ Disabled</div></div>"}