{"job title": "Financial Wellness Data Scientist", "company": "KeyBank", "city state": "– Washington, DC", "rating": "3.4", "job description": "<strong>Posting Title</strong>\n<br>\nFinancial Wellness Data Scientist\n<br><br>\n<strong>10-22-2018</strong>\n<br><br>\n<strong>Job Description</strong>\n<br>\n<div> <div><strong>JOB BRIEF (PURPOSE)</strong></div>Reporting to the Financial Wellness Science Leader, the Data Scientist is accountable for helping KeyBank realize value from its extensive set of data by formulating client insights that shape our Financial Wellness strategy and experiences. The Financial Wellness Data scientists will utilize their analytical, statistical, and programming skills to collect, analyze, and interpret large data sets. Actionable insights from this work will then be used to develop data-driven solutions to difficult business challenges. A critical aspect of the work will be applying data mining techniques, doing statistical analysis, and building high quality prediction systems integrated with our products.\n<br><br>\nThe ideal candidate will be intricately involved in running analytical experiments in a methodical manner, and will regularly evaluate alternate models via theoretical approaches. This is the perfect opportunity for the successful candidate to become a part of an innovative and energetic team that develops analysis tools which will influence both our products and client experiences.\n<br><br>\nThe Financial Wellness Data Scientist will work with external experts in the field to ensure the Key is leveraging the most useful analytics techniques and approaches that emerge. This person will also develop and support the publication of KeyBank thought capital on effective consumer financial management.\n<br>\n<div><strong>ESSENTIAL JOB FUNCTIONS</strong></div>§ Data mining using state-of-the-art methods\n<br>\n§ Extending company’s data with third party sources of information when needed\n<br>\n§ Enhancing data collection procedures to include information that is relevant for building analytic systems\n<br>\n§ Processing, cleansing, and verifying the integrity of data used for analysis\n<br>\n§ Doing ad-hoc analysis and presenting results in a clear manner\n<br>\n§ Selecting features, building and optimizing classifiers using machine learning techniques\n<br>\n§ Combine analytical insights with behavioral science principles to develop hyper-targeted, deeply personalized, Wellness-centered\n<br>\n​ experiences for our clients\n<br>\n§ Partner closely with the Financial Wellness Product, E2E Client Experience, E2E Customer Experience, and Strategy teams to embed\n<br>\nanalytical insights into the core of our Financial Wellness program(s)\n<br>\n§ Leverage relationships with experts in the field to ensure that Key remains close to emerging theories, ideas, and applications\n<br>\n§ Research and develop statistical learning models for data analysis\n<br>\n§ Collaborate with product management and engineering departments to understand company needs and devise possible solutions\n<br>\n§ Keep up-to-date with latest technology trends\n<br>\n§ Communicate results and ideas to key decision makers\n<br>\n§ Implement new statistical or other mathematical methodologies as needed for specific models or analysis\n<br>\n§ Optimize joint development efforts through appropriate database use and project design\n<br>\n§ Collecting large sets of structured and unstructured data from disparate sources<br>\n\n<div><strong>ADDITIONAL FUNCTIONS</strong></div>\n<br>\n§ Lead and participate in promotional activities and presentations\n<br>\n§ Conduct market research to better understand customer needs and satisfaction with our service\n<br>\n§ Be a thought-leader and change agent with regard to improving internal processes and procedures over time<br>\n\n<div><strong>REQUIRED QUALIFICATIONS</strong></div>\n<br>\n§ Advanced degree preferably in math, science, engineering, or economics; Statics and Machine learning preferred; Masters Degree\n<br>\n​ required, PhD preferred.\n<br>\n§ 5+ years of analytical experience working with large data sets\n<br>\n§ Excellent quantitative, analytical and problem solving skills. Knowledge of statistical analysis (regression, decision trees, experimental design) to solve real world problems\n<br>\n§ Proven ability to set a vision and gain stakeholder approval\n<br>\n§ Experience developing Financial or Technology partnerships\n<br>\n§ Passion for leading and developing people, creating followership and advancing Key’s culture\n<br>\n§ Passion for the customer experience and acting as a change agent\n<br>\n<div><strong>PREFERRED QUALIFICATIONS</strong></div>\n<br>\n§ Experience/Familiarity with Digital Banking technology\n<br>\n· Familiarity with agile project methodologies and LEAN project methodologies\n<br>\n· Deep understanding and working knowledge in Machine Learning and statistical techniques (e.g. regression techniques, neural\n<br>\nnetworks, decision trees, clustering, pattern recognition, dimensionality reduction, deep learning, etc.)\n<br>\n· Deep knowledge of experimental design, with emphasis on A/B testing in a digital environment.\n<br>\n· Experience working with big data within a Hadoop environment and in distributed analytic processing technology (Spark, Hive, etc.).\n<br>\nExperience with AWS and/or other cloud environments welcomed.\n<br>\n· Strong proficiency in programming languages, such as Python, R, and SAS. Familiarity with Tensorflow, scikit learn, pytorch\n<br>\nappreciated.\n<br>\n· Fluency in SQL for data access, manipulation, and validation\n<br>\n· Passion for data visualization and information design (proficiency in Tableau preferred)\n<br>\n<div><strong>EQUIPMENT USED</strong></div>\n<br>\nHardware – Windows or Mac Software - Microsoft Office,, HTML Editors</div>\n\n<br><strong>Requisition Number</strong>\n<br>\n<strong>31831BR</strong>\n<br><br>\n<strong>About the Business</strong>\n<br>\nKey Community Bank serves individuals and small to mid-sized businesses through a footprint of over 1,000 branches, more than 1,300 ATMs, telephone banking centers, and robust online and mobile capabilities.\n<br><br>\n<strong>Schedule Type</strong>\n<br>\nFull-Time\n<br><br>\n<strong>State</strong>\n<br>\n<strong>DC</strong>\n<br><br>\n<strong>Job Category</strong>\n<br>\nAnalytics/Insights, Other, Strategy/Planning\n<br><br>\n<strong>FLSA Status</strong>\n<br>\nExempt\n<br><br>\n<strong>About Key</strong>\n<br>\nCleveland-based KeyCorp is one of the nation's largest bank-based financial services companies, with assets of approximately $92.9 billion. Key companies provide investment management, retail and commercial banking, consumer finance, and investment banking products and services to individuals and companies throughout the United States and, for certain businesses, internationally. The company's businesses deliver their products and services through branches and offices; a network of 1,335 ATMs; telephone banking centers ; and a website, Key.com®, that provides account access and financial products 24 hours a day\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nKeyCorp is an Equal Opportunity and Affirmative Action Employer Min/Fem/Vet/Disabled\n<br><br>\n<strong>City</strong>\n<br>\nWashington\n<br><br>\n<strong>Posting State, City</strong>\n<br>\nDC - Washington\n<br><br>\n<strong>Job Family</strong>\n<br>\nRETAIL-Recruiting-Retail Banking\n<br>"}