{"job title": "Data Consultant - Business Banking", "company": "Key Bank", "city state": "– Cleveland, Ohio", "rating": "3.4", "job description": "<strong>Job Description</strong>\n<br>\n<strong>About the Job:</strong>\n<br>\nThe Analytic Data Capabilities team is looking to add a team member in\n<br>\nthe data consultant role with knowledge of Business Banking /\n<br>\nCommercial Banking products, services &amp; strategy. In this role, you\n<br>\nwill work closely with cross-functional line of business teams and Key\n<br>\nTechnology &amp; Operations teams to identify, develop and implement data\n<br>\nsolutions in service to analytic, modeling &amp; reporting teams across\n<br>\nKeyBank.\n<br>\n<strong>Essential Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Provide business ownership of investments in the data supply chain</li>\n<li>Serve as a data Subject Matter Expert on sources &amp; uses of data to</li>\n</ul>\n\nanalytics practitioners\n\n\n<ul>\n<li>Understand data needs of analytics teams across KeyBank developing</li>\n</ul>\n\na relationship as a trusted advisor\n\n\n<ul>\n<li>Gather requirements from analytics practitioners to develop /</li>\n</ul>\n\nenhance data assets - elicit requirements and create requirement\n<br>\ndocuments\n\n\n<ul>\n<li>Translate business requirements to technical requirements and vice</li>\n</ul>\n\nversa\n\n\n<ul>\n<li>Develop solution recommendations to meet data needs of analytic</li>\n</ul>\n\nstakeholders\n\n\n<ul>\n<li>Proactively communicate progress and manage stakeholder /</li>\n</ul>\n\nmanagement expectations\n\n\n<ul>\n<li>Establish / maintain strong relationships and influence others to</li>\n</ul>\n\nmove toward a common vision or goal\n\n\n<ul>\n<li>Partner with Key Technology &amp; Operations to build repository of</li>\n</ul>\n\nexternal data assets / resources\n<br>\n<strong>Preferred Skills:</strong>\n\n\n<ul>\n<li>Structured Problem Solving &amp; critical thinking</li>\n<li>Strong facilitation / Team Building / Teaming skills</li>\n<li>Must be able to demonstrate a history of managing to and</li>\n</ul>\n\ndelivering quality results in tight timelines.\n\n\n<ul>\n<li>Basics of database design, data relationships and banking (data &amp;</li>\n</ul>\n\nanalytics) use cases\n\n\n<ul>\n<li>Proficiency with data query tools</li>\n</ul>\n\n<strong>Required Experience:</strong>\n\n\n<ul>\n<li>BS or BA in marketing, technology, or related discipline</li>\n<li>Project Management / BA certification is a plus</li>\n<li>2-5 years data analysis experience</li>\n<li>2-5 years BA experience, can be concurrent to data analysis</li>\n</ul>\n\nexperience\n\n\n<ul>\n<li>Experienced in leading small (2-5) person projectized efforts</li>\n<li>Proficient using Microsoft Word, Excel, PowerPoint</li>\n</ul>\n\n<strong>ABOUT KEY:</strong>\n<br>\nKeyCorp's roots trace back 190 years to Albany, New York.\n<br>\nHeadquartered in Cleveland, Ohio, Key is one of the nation's largest\n<br>\nbank-based financial services companies, with assets of approximately\n<br>\n$134.5 billion at March 31, 2017. Key provides deposit, lending, cash\n<br>\nmanagement, insurance, and investment services to individuals and\n<br>\nbusinesses in 15 states under the name KeyBank National Association\n<br>\nthrough a network of more than 1,200 branches and more than 1,500\n<br>\nATMs. Key also provides a broad range of sophisticated corporate and\n<br>\ninvestment banking products, such as merger and acquisition advice,\n<br>\npublic and private debt and equity, syndications, and derivatives to\n<br>\nmiddle market companies in selected industries throughout the United\n<br>\nStates under the KeyBanc Capital Markets trade name. KeyBank is Member\n<br>\n<strong>FDIC.</strong>\n<br>\n<strong>ABOUT THE BUSINESS:</strong>\n<br>\nKeyBank has administrative services in place that help support the\n<br>\nbusiness. These include: Finance, Human Resources, Legal, and\n<br>\nMarketing. KeyBank s Corporate Center supports strategic initiatives\n<br>\nthrough multiple teams which provide distinctly different, yet\n<br>\ninterrelated, disciplines for the KeyBank Leadership team and its\n<br>\nbusiness groups. The Corporate Center protects and enhances Key s\n<br>\nbrand through thoughtful and deliberate messaging and responsible\n<br>\nbanking. Our proactive approach and significant expertise engage both\n<br>\ninternal and external constituents employees, clients, shareholders,\n<br>\ninvestors, regulators, legislators, community advocates by adding\n<br>\nvalue, positively influencing their perceptions, and instilling a\n<br>\nsense of confidence in Key.\n<br>\nFLSA STATUS:Exempt\n<br>\nKeyCorp is an Equal Opportunity and Affirmative Action Employer\n<br>\ncommitted to engaging a diverse workforce and sustaining an inclusive\n<br>\nculture. All qualified applicants will receive consideration for\n<br>\nemployment without regard to race, color, religion, sex, sexual\n<br>\norientation, gender identity, national origin, disability, or veteran\n<br>\nstatus.\n<br>\nJobID: 32249BR"}