{"job title": "SAR Systems Engineer &amp; Image Scientist - 1", "company": "KeyW", "city state": "– MD", "rating": "3.6", "job description": "KeyW is looking for an entry to mid-level engineer or scientist to support the analysis, calibration and performance modeling of airborne synthetic aperture radar systems. The successful candidate should be aware of all aspects of a radar system from a theoretical perspective and a signal processing perspective. The candidate will work alongside senior engineers and scientists to model system performance and error sources, develop algorithms, and support flight testing and performance evaluations.\n<ul>\n<li>Conduct research in Synthetic Aperture Radar (SAR) imaging and exploitation techniques including difficult target detection, change detection techniques, and tomographic processing.</li> <li>Develop and assess novel methods of utilizing SAR data.</li><li>Support and implement automated production processing of SAR data.</li><li>Provide on-going support to experimental and operational deployments.</li><li>Develop collection planning, performance analysis, system calibration and problem resolution.</li> <li>Aid in the design and development of innovative processing algorithms and custom exploitation tools for the KeyRadar system.</li></ul>\n\n<ul>\n<li>ABILITY TO OBTAIN AND MAINTAIN A TS/SCI CLEARANCE.</li><li>5-7 Years relevant experience with a Bachelor's. 3-5 with a Masters or 0-2 with a PHD.</li><li>Bachelor’s degree in Engineering, Physics, Applied Mathematics, or Engineering Physics with knowledge of RF systems, digital signal processing; a Master’s degree is preferred, with coursework in: Stochastic Processes, Network Theory, Signal</li> <li>Processing, Fourier Analysis, Optics, Electromagnetic Wave Propagation and Phenomenology.</li><li>Experience with Linux systems, programming in Python required.</li>\n</ul>\nKeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.\n<br><br>\nKeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to everyone, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve."}