{"job title": "Data Scientist", "company": "KeyW", "city state": "– McLean, VA", "rating": "3.6", "job description": "KeyW is looking for top talent to join our team!\n<br><br>\nWe're looking for a <strong>Data Scientist</strong> in <strong>McLean, VA</strong>.\n<br><br>\n<strong>Qualified candidates will have an active TS/SCI security clearance with CI polygraph.</strong>\n<br><br>\nThe Data Scientist will:\n<ul>\n<li>Build statistical models, test hypotheses, visualize, summarize, interpret, and report on data holdings.</li><li>Perform research on social media using quantitative and qualitative content analytics.</li><li>Plan, organize, arrange, and implement training and outreach activities for various projects and programs across the larger data science community.</li>\n</ul>\nRequired Qualifications:\n<ul>\n<li>Bachelor's degree in related technical discipline and 8+ years of experience. Advanced degree preferred</li><li>Experience with a statistical package (e.g. SPSS, R, or SAS)</li><li>Social network and link analysis tools (e.g. NodeXL, Palantir)</li><li>Experience with:</li>\n\n<ul>\n<li>Data manipulation, analytic tools, and data visualization</li><li>Constructing and performing complex database search queries</li><li>Computer science concepts and data content</li><li>Programming or statistics</li></ul>\n</ul>\n<strong>Qualified candidates will have an active TS/SCI security clearance with POLY</strong>\n<br><br>\n<strong>KeyW is an EEO employer</strong>. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability.\n<br><br>\n<strong>How to Apply?</strong>\n<br><br>\nPlease click apply on the right.\n<br><br>\nKeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.\n<br><br>\nKeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to each individual, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve.\n<br><br>\nTS/SCI with Poly"}