{"job title": "Data Scientist", "company": "Kforce", "city state": "– Chicago, IL", "rating": "3.9", "job description": "<strong>RESPONSIBILITIES:</strong>\n\n<ul>\n<li> Proactively identify business &amp; credit strategy changes, emerging risks and regulatory developments to enhance the efficiency and effectiveness of the 3rd line of defense.</li>\n\n<li> Provide auditors and loan reviewers with meaningful analytics and insights on efficiency opportunities observed within client functions.</li>\n\n<li> Demonstrate good judgment in application of advanced data analytics.</li>\n\n<li> Provide timely and insightful support</li>\n\n<li> Independently or with limited supervision: Analyze, design, deliver, and implement analytic development projects, with the use of analytics tools, such as SAS, ACL, Business Objects, Python, SQL, Spotfire, Excel, etc.</li>\n\n<li> Knowledge of relational database structures &amp; underlying concepts</li>\n\n<li> Examine opportunities to integrate data analytics into audits and credit portfolios by assisting Audit &amp; Loan Review teams in performing testing of internal controls across the Bank</li>\n\n<li> Use analytical tools and methodologies to analyze data, make observations, and make recommendations to improve policies, procedures and controls to mitigate risk or increase efficiency</li>\n\n<li> Ensure audit &amp; credit analytics are efficiently performed and accurately interpret &amp; present the results against defined criteria</li> \n\n<li> Ensure that audit &amp; credit analytic project activities are accomplished within approved time frames, scope, and budgets</li> \n\n<li> Confirm that projects adhere to development standards and guidelines</li> \n\n<li> Use technical analytics tools to perform analysis, conduct research and present findings to the audit team</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li> Visualization experience using Tableau, SpotFire, or similar</li>\n\n<li> Knowledge of relational database structures &amp; underlying concepts</li>\n\n<li> Knowledge of reporting tools such as, SAS, MSBI, BOBJ and/or audit specific data analysis tools such as ACL.</li>\n\n<li> Knowledge of design, development, and implementation utilizing current analytics technologies and architecture, as well as data warehouse concepts and methodologies</li>\n\n<li> Must have strong programming skills demonstrated via education and work experience in SQL and one programming language: Python, Java/Scala, or C/C++, C#; Scripting experience in shell, Perl or Python is a strong asset</li>\n\n<li> Data mining and analysis using package such as R, Spark, Python libraries or similar</li> \n\n<li> Exposure to and working knowledge of one or more of the major database platforms: MS-SQL, Oracle, DB2, Netezza, Hadoop, HDFS, etc. is preferred.</li>\n\n<li> Exposure to a wide variety of technology platforms and systems</li>\n\n<li> Expert analytical and system thinking skills</li>\n\n<li> Advanced MS Office skills - Word, Outlook, Excel and PowerPoint</li>\n\n<li> Strong problem solving and conflict resolution skills with the ability to exercise mature judgment</li>\n\n<li> In-depth interpersonal, communication, negotiating, influencing, and relationship management skills</li>\n\n<li> Excellent communication, relationship, and collaboration skills to architect data driven ways to effectively test credit controls within the enterprise.</li>\n\n<li> Ability to undertake self-directed learning to understand processes and systems</li>\n</ul>\n\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}