{"job title": "Business/Data Analyst - Dynamics CRM, SQL, Active Directory", "company": "Kinetix Technology", "city state": "– MD - Rockville", "rating": "4.7", "job description": "Category : Information Technology\n<br>\nLocation/City : MD - Rockville\n<br>\nDate Created : 6/23/2015 2:57:14 PM\n<br><br>\nKinetix TechnologyÂ• is a national IT professional services company that helps companies drive performance by delivering custom IT consulting and professional services. Kinetix Technology provides clients with top-quality IT consultants and technologists in two core areas of Information Technology across the Software Development Lifecycle (\"SDLC\"), Business Intelligence (\"BI\") and Data Management. Kinetix provides skilled applications professionals for all phases of the SDLC. Kinetix consultants specialize in specific technologies and job functions, as well as industry verticals, enabling them to respond to the unique needs of each client. Kinetix's BI offering assists clients in building and deploying architecturally sound, evolvable enterprise-scale information and interoperability architecture, by providing expert consultants or teams. Kinetix Technology provides consultants on a consulting, and staff augmentation engagements, in contract, contract-to-hire and direct hire positions.Our client is tasked with providing oversight, guidance, and regulatory compliance within the Capital Markets, and is dedicated to bringing integrity to the markets and confidence to investors through effective and efficient regulation, compliance, and technology-based services. We are looking for innovative and committed people to help define the clientâ?'s platforms and systems. We have an immediate need for a Senior Business Systems Analyst. The successful candidate will extensive design and implementation experience utilizing customer service and call center functionality to support an enterprise Dynamics CRM program. The candidate must have experience with defining requirements, analyzing business needs, working with development to identify solutions, CRM administration, and CRM configuration. The candidate must have an IT consulting background and experience and/or familiarity with technologies beyond CRM, such as SQL, SharePoint, MS Office, Computer Telephony Integration, Active Directory, and other complementary solutions to CRM.Job Responsibilities:\tPerform business and data analysis to understand the operational model and underlying data characteristics of the various businesses using CRM.\tDevelop functional and technical requirements specifications and data models to drive and inform business and technical decisions / implementation efforts.\tProvide ongoing technical support and troubleshooting. Help users with reports, queries and dashboards.Qualifications:\tBachelor's degree in a technical field such as Computer Science, Computer Engineering or related field; MBA or other related advanced degree preferred.\t8+ years of experience required.\tExperience with Microsoft CRM: Strong analysis and operational support experience in Microsoft Dynamics CRM 2011 or above.\tExperience Writing SQL queries.\tExcellent problem solving and analytical skills.\tExcellent communication skills (verbal and written), ability to communicate well at multiple levels including analysts, developers, and business.\tA self-starter who can work with little or no guidance.\tIT consulting and software development experience a must.Kinetix is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, ancestry, citizenship, disability, age, military or veteran status, and other characteristics protected under federal, state and local law.\n<br><br>"}