{"job title": "Big Data Solutions Architect - Capital Market Experience", "company": "Kinetix Technology", "city state": "– NY - New York", "rating": "4.7", "job description": "Category : Information Technology\n<br>\nLocation/City : NY - New York\n<br>\nDate Created : 7/2/2015 7:31:25 AM\n<br><br>\nKinetix TechnologyÂ• is a national IT professional services company that helps companies drive performance by delivering custom IT consulting and professional services. Kinetix Technology provides clients with top-quality IT consultants and technologists in two core areas of Information Technology across the Software Development Lifecycle (\"SDLC\"), Business Intelligence (\"BI\") and Data Management. Kinetix provides skilled applications professionals for all phases of the SDLC. Kinetix consultants specialize in specific technologies and job functions, as well as industry verticals, enabling them to respond to the unique needs of each client. Kinetix's BI offering assists clients in building and deploying architecturally sound, evolvable enterprise-scale information and interoperability architecture, by providing expert consultants or teams. Kinetix Technology provides consultants on a consulting, and staff augmentation engagements, in contract, contract-to-hire and direct hire positions.Our client, a major regulator of the financial industry, is seeking a Big Data Solutions Architect who will be responsible for architecting, designing and leading the implementation of a batch and real time analytics platform to scale to petabyte warehouse volumes and billions of records processed daily. Analyzing enterprise system and business requirements and incorporating them into the reference architectureâ?'s design and implementation. Prototyping data analysis solutions and facilitating solution deployment and support. Candidate will need to architect designs that bridges the needs of the business, the big data scientists and the big data engineers. The candidate will be responsible for managing the full life-cycle of a the Big Data solution. This includes creating the requirements analysis, the platform selection, design of the technical architecture, design of the application design and development, testing, and deployment of the proposed solution.Responsibilities:\tBenchmark systems, analyze system bottlenecks and propose solutions to eliminate them.\tClearly articulate pros and cons of various technologies and platforms.\tDocument use cases, solutions and recommendations.\tHave excellent written and verbal communication skills.\tHelp program and project managers in the design, planning and governance of implementing projects of any kind.\tBe able to perform detailed analysis of business problems and technical environments and use this in designing the solution.\tBe able to work creatively and analytically in a problem-solving environment.\tBe able to work in a fast-paced agile development environment and drive innovation of system designs and solutions.Required Qualifications:\tCollege degree (preferably in Computer Science or Engineering â Masters or higher)\tStrong SQL programming\t5+ years experience with Enterprise Big Data Architectur/design Expert in Hadoop, S3, and Big Data technologies\tFirm understanding of major programming/scripting languages like C/C++, Java, Linux/Unix, PHP, Python, SAS and/or R.\tExperience in working with ETL tools such as Informatica and/or Pentaho.\tExperience designing solutions for multiple large data warehouses with a good understanding of cluster and parallel architecture as well as high-scale or distributed RDBMS and/or knowledge on NoSQL platforms.\tCandidate should have experience with one of the large cloud-computing infrastructure solutions like AWS.\tCandidate should understand and have experience with data security and privacy concerns that could arise and that should be taken care of as part of the system design/architecture.\tExperience driving surveillance tattern platforms forward in the Cloud. REST, SOAP and Bittorrent\tExcellent verbal and written communication skills\t5+ years experience machine learning, data mining and/or statistical analysis.\t5+ years experience with algorithmic trading, financial market modeling, fraud detection or financial market risk analysis.\t5+ years experience managing/leading architectural and engineering teams.\tKnowledge and experience with agile software engineering processes and best practices. Kinetix is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, ancestry, citizenship, disability, age, military or veteran status, and other characteristics protected under federal, state and local law.\n<br><br>"}