{"job title": "Data Scientist", "company": "KiZAN Technologes", "city state": "– Louisville, KY", "rating": "4.1", "job description": "<div>\n<div><strong>Data Scientist</strong></div><br>\n\n<div><strong>Location: Louisville, KY</strong></div><br>\n\n<div><strong>Employment Type: Full Time</strong></div><br>\n\n<div><u>About KiZAN</u></div><br>\n\n<div>For over 25 years, KiZAN has been hiring the best and brightest talent. KiZAN promotes a culture that enables everyone to pursue what they love and has been named among the 100 Best Places to Work in Kentucky. As a family of information technology Rock Stars, KiZAN's consultants deliver solutions centered on Microsoft-based technologies that solve even the most complex business problems. As a team, we strive to create Raving Fans with every customer!</div><br>\n\n<div>KiZAN was selected as Microsoft's first Solution Provider Partner of the Year in 1995 and continues as the 2016 Microsoft Partner of the Year for the Heartland District. Today, KiZAN is a Microsoft Gold Certified Partner with offices in both Louisville, KY, and Cincinnati, OH. KiZAN provides service throughout Kentucky, Ohio, Indiana, Michigan and Tennessee.</div><br>\n\n<div>KiZAN has an immediate need for an exceptional individual to join our family as a Data Scientist. This opportunity is based out of our office in Louisville, KY. The ideal candidate has a passion for data, has strong communication skills, is a true team player with a commitment to excellence and will be able to thrive in a fast-paced, rapidly-changing environment.</div><br>\n\n<div><u>Responsibilities</u></div><br>\n\n<div><strong>The Data Scientist leads the design and development of advanced analytics solutions that enable our clients to transform their businesses by unlocking the insights hidden in their data. Responsibilities may include, but are not limited to:</strong></div>\n<ul>\n\n\t<li>Model, analyze and visualize structured and unstructured data using advanced analytical techniques and tools</li>\n\n<li>Deliver predictive and prescriptive solutions leveraging machine learning (ML) and artificial intelligence (AI)</li>\n\n<li>Lead projects through the entire data science process: formulation and refinement of questions, extraction and preparation of data, exploratory data analysis, feature engineering, model development and training, cross-validation, deployment, and operationalization</li>\n\n<li>Apply broad knowledge of statistics, machine learning algorithms, computational frameworks, analytical tools and data transformation techniques to identify optimal approaches to specific problems</li>\n\n<li>Collaborate with client analytics and data science teams in developing, operationalizing, scaling and enhancing machine learning models</li>\n\n<li>Interpret and present findings and communicate technical solutions to a variety of audiences</li>\n\n<li>Mentor team members in the execution of the data science process</li>\n\n<li>Assist sales teams in defining and estimating proposals and statements of work</li>\n</ul>\n\n<div><u>Minimum Requirements</u></div>\n\n\n<ul>\n\n\t<li>Bachelors degree in data science, statistics, mathematics, computer science or a related field, or 3+ years of practical data science experience</li>\n\n<li>Successful track record of applying data science to solve real-world business problems</li>\n\n<li>Strong high-level understanding of theory and practice of advanced analytical techniques</li>\n\n<li>Hands-on experience of building solutions using common data science languages and tools (e.g. Python, R, Azure Machine Learning Studio, Azure Machine Learning Services, Cognitive Services, etc.)</li>\n\n<li>Advanced knowledge of data transformation and analysis using SQL</li>\n\n<li>Ability to travel, overnight up to 25%</li>\n\n<li>Ability to travel independently to client sites; if by car, a valid driver's license or reliable method of transportation is required</li>\n\n<li>Authorization to work in the U.S. without sponsorship</li>\n</ul>\n\n<div><u>Skills and Abilities</u></div>\n\n\n<ul>\n\n\t<li>Strong analytical and problem-solving skills</li>\n\n<li>Ability to quickly learn and apply new technologies, as well as comprehend and decompose complex business problems</li>\n\n<li>Strong team player who enjoys working in a fast-paced team atmosphere</li>\n\n<li>Ability to work under pressure and meet strict deadlines</li>\n\n<li>Ability to listen effectively and seek clarification</li>\n\n<li>Excellent written and oral communication skills in English. Must be able to effectively and comfortably communicate with all types of individuals from the customer technical expert to the customer executive management</li>\n</ul>\n\n<div><u>Preferred Experience, Skills and Abilities</u></div>\n\n\n<ul>\n\n\t<li>Experience with structured, unstructured and semi-structured data, as well as relational and NoSQL data stores</li>\n\n<li>Experience with developing data and analytics solutions in Azure, using such technologies as SQL Databases, Data Lake, Data Factory, Stream Analytics, HDInsight, CosmosDB, Machine Learning Server, Cognitive Services, etc.</li>\n\n<li>Work experience in a consultant capacity</li>\n\n<li>Knowledge of Agile/SCRUM SDLC Methodologies</li>\n</ul>\n\n<div>EEO/AA Employer</div></div>\n\n<br>"}