{"job title": "Research Scientist", "company": "Kla-tencor", "city state": "– Milpitas, CA", "rating": "3.7", "job description": "Company Overview\n<br><br>\nCalling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are biggerand tinierthan the world has ever seen.\n<br><br>\nWho are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chipsthe kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you ownfaster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer?\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nDesign and conduct feasibility investigations to provide valuable guidance for KLA-Tencor's roadmaps in optical wafer inspection. Work within a small technology group to identify, explore, and develop promising new concepts, methods, and subsystems that exploit the photochemical properties of materials to meet challenges in optical wafer inspection. Apply expertise in photochemical processes to develop unique optical components for inspection systems. Develop special optical benches and testing apparatuses, devise and conduct experiments into subsystems and optical materials for new inspection tools, and collaborate with Engineering Teams to transfer and scale this technology to product development. Lead investigations of chemical and physical properties of optical surface and/or bulk materials. Design complex experiments and trials that involve sophisticated data collection and other chemical and physical measurements. Synthesize the experimental results into specific conclusions about optical properties and mechanisms that will limit the lifetime of optical materials and coatings. Acquire, analyze and present data to the technology group and to the rest of the organization.\n<br><br>\n<strong>Minimum Qualifications</strong>\n<br><br>\nEmployer will accept a PhD in Optics, Engineering, Chemistry, Physics, or a related field. In lieu of a PhD, employer will accept a Master's degree in Optics, Engineering, Chemistry, Physics, or a related field and 3 years of experience in the position offered or in a research-related occupation.\n<br><br>\nWORK LOCATION: Milpitas, CA.\n<br><br>\nEqual Employment Opportunity\n<br><br>\nKLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}