{"job title": "Data Scientist", "company": "Klaviyo", "city state": "– Boston, MA", "rating": "4.0", "job description": "<div>Klaviyo is looking for data scientists to analyze large data sets (were collecting billions of individual actions every month), build models and ship products that enable businesses to grow faster and communicate with their customers. Our background as a team is building these models for the Fortune 50 and we want to democratize and open up that technology to everyone.</div><br>\n<div>The ideal candidate has a background in data science, statistics and machine learning and has done work ranging from exploratory analysis to training and deploying models. We use a wide variety of data mining and machine learning algorithms. The right candidate will have both a solid fundamental understanding and deep practical experience with at least a few modeling and machine learning techniques.</div><br>\n<div>Our goal is always to match the right assumptions and models to the right problem -- they dont necessarily have to be complex. You should have experience building models that are used by people to make better decisions. Were focused on shipping early and often. We prefer iterative solutions that are incrementally better to the perfect solution. You should also be able to measure and know what impact your models had on the decisions people made -- e.g. did they outperform the previous best model or a human decision maker?</div><br>\n<div>Our data science team is still in its early days and youll have a big impact on our direction and how we operate. Youll be central to upfront research and shipping products that help our customers learn and grow from their data.</div>You:\n\n<ul>\n<li>Have a strong fundamental understanding and deep experience with at least some machine learning algorithms (e.g. regressions, decision trees, k-means clustering, neural networks).</li><li>Understand Bayesian modeling techniques.</li><li>Are capable of analyzing data and making rigorous statements about what can or cannot be concluded.</li><li>Have experience designing and implementing model performance/validation assessments.</li><li>Have a background in statistics and understand different distributions and the conditions under which theyre valid.</li><li>Know how code and have used data science tools and packages.</li><li>Have demonstrated a measurable impact based on the models youve created. Its not always easy getting a model correct and we love talking about places we got stuck and working as a team to think through ideas that could unblock us.</li><li>Have a desire to ship features powered by data science (in other words, youre excited by both upfront research and actually getting models into production at cloud scale).</li>\n</ul>\n\n<strong>You Have:</strong>\n\n<ul>\n<li>Bachelors or advanced degree in statistics, applied mathematics, computer science or other relevant quantitative discipline, or equivalent industry experience.</li><li>Have worked in a data science role for 2+ years professionally or academically and can talk about your projects and the techniques you used.</li>\n</ul>\n\n<div>About Us</div><br>\n<div>Klaviyo is a team of people who are crazy motivated by growth.</div><br>\n<div>Its what we help our customers do: grow their businesses by making it possible and easy for them to use their data to power better marketing.</div><br>\n<div>Its how we behave as individuals: were all deeply passionate about learning.</div><br>\n<div>Its how we manage our business: we have thousands of paying customers, were profitable, and were growing insanely fast.</div><br>\n<div>And its what our culture is all about. Working at Klaviyo means youll work on things you never imagined you would; youll grow in ways you didnt consider possible; and youll do the best work of your career with people who are just as motivated and talented as you are.</div> <br>\n<div>If this sounds like your ideal place to work, drop us a note!</div>"}