{"job title": "Data Scientist I", "company": "Knowesis Inc.", "city state": "– Dam Neck, VA", "rating": "3.8", "job description": "<strong>Job Description:</strong><br><br>Knowesis is looking for personnel to support the United States Special Operations Command Preservation of the Force and Family (USSOCOM POTFF) program in identifying and implementing innovative, valuable solutions across the Special Operations Forces (SOF) enterprise aimed at improving the short and long-term well-being of SOF warriors and their families.<br><br><strong><em>*This position is contingent upon contract award.*</em></strong><br><br>Operating in consultation with POTFF program staff and the Government’s POTFF biostatistician, the <strong>Data Scientist</strong> will:\n\n<ul>\n<li>Enter, clean, and conduct basic data manipulation and analysis</li><li>Build and disseminate databases and spreadsheets designed to record POTFF related programmatic data</li><li>Provide consultation and assistance to supported units and POTFF staff to identify opportunities and methods for capturing data relating to POTFF programs and initiatives</li><li>Prepare reports and presentations that accurately convey data trends and associated analysis</li><li>Enter and analyze data within government systems</li>\n</ul>\n\n<strong>Required Experience:</strong>\n\n<ul>\n<li>Possess an active DoD Secret Security Clearance</li><li>Bachelor’s Degree in quantitative science, social science or related discipline</li><li>Proficient with the suite of Microsoft Office programs, including Word, Excel and Access</li><li>Prior experience using statistical software application such as SPSS, SAS, and R</li><li>Possess excellent communication skills and shall be highly detail oriented and</li>\n</ul>\n\n<strong>Benefits</strong><br><br><em>About Knowesis</em>\n<br>\nFounded in 2007, Knowesis Inc. has been providing data driven decisions and solutions to federal healthcare clients from day one. Our core capabilities include analytics and information management, planning and operations, and communication and engagement strategies. Knowesis’ highly qualified, customer-focused professionals are committed to providing information and advice to enable client success through holistic, thorough, thoughtful, and aligned approaches. Our clients leverage these capabilities to support data driven decisions for their key business functions. Knowesis is dedicated to earning the loyalty of clients and staff through work ethic, collaboration, and humility. Our intent is to be a positive impact to our clients, team, and community.<br><br>Knowesis is Service Disabled Veteran Owned (SDVO) (CVE certified) and Small Disadvantaged Business (SBA certified 8a) with offices in San Antonio, Texas and Fairfax, Virginia. We offer a highly competitive compensation and benefits package inclusive of medical, dental, and paid time off.\n<br>\nFor more information about working with Knowesis, please visit our website at http://www.knowesis-inc.com.<br><br><em>Knowesis is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. Knowesis will consider all qualified applicants for employment without regard to race, color, religious creed, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, Knowesis will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.</em>\n<br><br>\nKeyword: Data Scientist\n<br>\nFrom: Knowesis Inc.\n<br><br>\nApply now"}