{"job title": "Data Scientist (EFT Analytics)", "company": "Koch Industries", "city state": "– NEW YORK, New York", "rating": "4.1", "job description": "<div><div><div><div><div><div>\n<div>\nLearn more by visiting our website <u>here!</u></div><br>\n\n<div>\n<div>\n<div><strong>EFT Analytics, Inc.</strong> is looking for a <strong>Data Scientist</strong> to join our team in New York City! The Data Scientist will have the opportunity to work with a dynamic team to optimize and expand our advanced analytics platform. The successful candidate will be able to enhance and expand machine learning capabilities in the platform.</div><br>\n<div>Strong written and verbal communication skills are required.</div></div>\n<br>A Day In The Life Typically Includes:\n\n<ul>\n\n <li>Root Cause Analysis for process control and manufacturing environments</li><li>Application of advanced analytics and optimization data and software tool sets</li><li>Consulting with internal customers and team (process engineers, production leaders, operators, and reliability/energy optimization roles)</li><li>Process model development - replication of customer process controls in simulation environments</li><li>Use industry technologies, tools, and data mining frameworks for data analytics including data visualization for analyzing, optimizing, developing hypotheses, and drawing conclusions</li>\n</ul>\nWhat You Will Need:<br><br>Basic Qualifications:\n\n\n<ul>\n\n <li>Knowledge of Bayesian statistics, SVM, and deep learning</li><li>Deep understanding of Bayesian belief network inference, back propagation and other algorithms appropriate to Bayesian statistics, SVM, and deep learning</li><li>Knowledge of supervised and unsupervised algorithms</li><li>Experience with statistical analysis</li><li>Bachelor's degree from an accredited institution</li>\n</ul>\nWhat Will Put You Ahead?<br><br>Preferred Qualifications:\n\n\n<ul>\n\n <li>Bachelor's or Master's degree in Data Science, Mathematics, or Statistics from an accredited institution</li><li>C#, VB.Net, or Java coding experience</li>\n</ul>\nAdditional Information:\n\n<ul>\n\n <li>Ability to travel for work up to 15% of the time, by plane, car, etc.</li> \n</ul>\nWant to learn more about <u>EFT Analytics?</u>\n<br><br>\nTwenty years ago, EFT Analytics set out to deliver real-time, data-driven insights. Today, Industry 4.0 is the advent of Internet of Things, smart manufacturing and industrial stewardship. Insights and results earn your data a seat in the boardroom. EFT is a subsidiary of Koch Industries, one of the largest private companies in the U.S. Koch has delivered results using its unique management philosophy across dozens of industries and hundreds of sites for decades. EFT strives daily to bring those time-tested fundamentals to how we operate and what we deliver.<br>\n<div>Our people and culture are just like you, totally unique. We come from vastly diverse backgrounds. We’ve taken our own paths. When there wasn’t a path, we blazed trails. Trails that led us here. Where we find ourselves unified around one mission: to be the best data analytics company on the planet. And we won’t stop until we get there.</div>\n<br>Salary and benefits commensurate with experience.\n<br>\nThis role is not eligible for work visa sponsorship.\n<br><br>\nWe are an equal opportunity employer. Minority/Female/Disabled/Veteran\n<br>\nExcept where prohibited by state law, all offers of employment are conditioned upon successfully passing a drug test.\n<br><br>\nThis employer uses E-Verify. Please visit the following website for additional information: <u>www.kochcareers.com/doc/Everify.pdf</u>\n<br><br>\nFollow us</div>\n</div>\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}