{"job title": "Analytical Scientist", "company": "Koch Industries", "city state": "– ORANGE, Texas", "rating": "4.1", "job description": "<div><div><div><div><div><div>\n<div><br>Who are we? <u>Watch to find out!</u></div><br>\n<div>\n<p><em>''Innovation is facilitated by having the right people in the right roles with the right skills and values.''</em> <br><strong>- Charles Koch, Koch Industries Chairman and CEO</strong><br><br>INVISTA, owner of the STAINMASTER®, LYCRA®, COOLMAX® and CORDURA® brands, is a subsidiary of Koch Industries, Inc., which is one of the largest private companies in America with estimated annual revenues as high as $115 billion, according to Forbes. With a presence in about 60 countries, Koch companies employ more than 120,000 people worldwide, with about 70,000 of those in the United States.<br><br></p>\n<div>\n<div>INVISTA is seeking an Analytical Scientist in our Intermediates Research and Development Group to provide analytical support across INVISTA Intermediates R&amp;D. The Scientist is responsible to assist in developing and refining analytical methods and to provide accurate and reliable sample test data. This work is in support of internal and external customers utilizing specialized instrumentation and associated techniques (e.g., ICP, ICP-MS, HPLC, GC). Responsibilities also include performing statistical analysis and preparing written reports and presentations; instrument calibration and maintenance; instrument troubleshooting and repair; and general knowledge of laboratory operations and sample preparation techniques. Knowledge of ICP analysis is a plus. </div>\n<div> </div>\n<div> </div>\n<div> </div>\n<div>\n<div>The Orange Research Laboratory is a 25,000sq ft. facility equipped with the latest analytical instrumentation, laboratory facilities, and process control equipment. The R&amp;D Analytical Scientist will work with a team of professional research scientists and other support personnel in achieving research program goals. Typical schedule is on an 8 hr. M-F day schedule, but is expected to work extended hours, if necessary.</div>\n<div> </div>\n<div><b><u>Physical Requirements</u></b>:</div>\n<ul>\n<li>Must be capable of frequently sitting, standing, walking, reaching with hands and arms, climbing, balancing, stooping, kneeling, crouching and crawling. </li>\n<li>Must be capable of regular lifting and moving up to 10 pounds, frequently lifting and moving up to 25 pounds, and occasionally lifting and moving up to 50 pounds. </li>\n<li>Must be physically capable of spending long hours standing and work in chemical-protected clothing and equipment. </li>\n<li>Must be able to wear any or all the following PPE: safety glasses, hearing protection, goggles, hard hats, FRC, acid suits, breathing air, gloves, safety boots, respirators, ACR Flash suits, and encapsulated suits. PPE use is in accordance with the Job Safety Analysis (JSA) for a given task.</li></ul></div>\n<p> </p><br>\n<p>A Day In The Life Typically Includes:</p>\n<ul>\n<li>\n<div>Operation and maintenance of instrumentation in areas such as ICP, ICP-MS, GC, on-line analyzers and HPLC.</div></li>\n<li>\n<div>Developing and refining analytical methods (including sample preparation, separations, etc.).</div></li>\n<li>\n<div>Implementing new analytical methods for characterization of unique substances.</div></li>\n<li>\n<div>Performing analytical equipment setup, calibration and maintenance.</div></li>\n<li>\n<div>Monitoring and troubleshooting of analytical instrumentation and equipment.</div></li>\n<li>\n<div>Performing statistical analysis of data and preparing and presenting associated reports.</div></li></ul><br>\n<p> </p>\n<p> </p><br>\n<p>What You Will Need:</p>\n<p><br>Basic Qualifications:</p>\n<p> </p>\n<ul>\n<li>\n<div> Bachelor's or Master's degree in chemistry or a closely related discipline with completed coursework in chemistry from an accredited college or university</div></li>\n<li>Ability to create / edit spreadsheets in Excel and create presentations in Power Point</li></ul>\n<p><br> </p>\n<p><br> </p>\n<p> </p>\n<div> </div><br>\n<p>Want to learn more about <u>INVISTA?</u></p><br>\n<div>Salary and benefits commensurate with experience.<br>We are an equal opportunity employer. Minority/Female/Disabled/Veteran<br>Except where prohibited by state law, all offers of employment are conditioned upon successfully passing a drug test. <br><br>This employer uses E-Verify. Please visit the following website for additional information: <u>www.kochcareers.com/doc/Everify.pdf</u><br><br>\n<div>Follow us </div></div></div></div><br><br><br><br><br></div><br><br><br><br><br>\n \n \n\n \n \n\n \n <div>\n \n </div>\n \n\n \n </div>\n </div>\n </div>\n\n \n </div>\n\t</div>"}