{"job title": "Data Scientist", "company": "Komodo Health", "city state": "– New York, NY", "rating": "3.9", "job description": "<strong>Data Scientist</strong>\n<br><br>\nKomodo Health is addressing the global burden of disease through the development of the world's most actionable map of healthcare data. Our solutions drive a more transparent, efficient and productive healthcare ecosystem through the creation of quantitative solutions to qualitative problems.\n<br><br>\nAs a fast-growing startup that has already partnered with multiple Fortune 500 companies, we have very ambitious goals that have been designed with career development in mind. As a company, we value our culture of encouraging growth, collaboration, and constructive debate as well as delivering innovative solutions that \"wow\" our customers.\n<br><br>\nWe are looking for a Data Scientist to play a key role in the success of our Data Science team. This is a role for someone who wants to use one of the biggest, most complete healthcare datasets to solve real world problems that deliver value to our clients while being part of the collaborative, fun, nurturing Komodo community!\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<br><br>\nAnalyze and understand the disparate sources of industry data\n<br><br>\nApply data-mining and machine learning techniques to large structured and unstructured datasets\n<br><br>\nIterate to push the boundaries on what problems can be solved through data analytics\n<br><br>\nScaling from ad-hoc advanced analytics prototypes to large-scale learning solutions in live systems\n<br><br>\nClearly communicate analysis methods and results to Komodo and client team\n<br><br>\nCollaborate closely with the product team and other engineers to translate business objectives into new features and products\n<br><br>\n<strong>REQUIREMENTS</strong>\n<br><br>\nBS, MS, or PhD in Computer Science, Engineering or related field\n<br><br>\n2+ years' experience with Python, Scala, or Java and distributed frameworks (Hadoop, Spark, etc.)\n<br><br>\nExperience with\n<br><br>\nRapid prototyping and advanced analytics (e.g. R, MatLab, Pandas, SciPy)\n<br><br>\nSQL and Relational Databases\n<br><br>\nDemonstrable successes in delivering analytical projects, including structuring and conducting analyses to generate business insights and recommendations\n<br><br>\nSolution/Delivery-oriented team player willing to go above and beyond\n<br><br>\nAbility to work beyond familiar algorithms - to get out of one's comfort zone and earnestly seek to integrate the best solutions to business challenges\n<br><br>\nHigh motivation, work ethic, and self-discipline to organize and complete tasks\n<br><br>\nSincere interest in working at a startup and scaling with the company as we grow\n<br><br>\n<strong>NICE TO HAVE</strong>\n<br><br>\nExperience with applied machine learning or algorithm development\n<br><br>\nExperience or interest in the life sciences industry\n<br><br>\nTrack record of delivering analytical solutions to poorly scoped problems\n<br><br>\nPrior client-side analytical experience serving Marketing, Sales, Medical Affairs, or Clinical Development, or, vendor-side analytical experience working with Life Sciences clients\n<br><br>\nExperience working with proprietary secondary data including medical / pharmacy claims, prescription data, sales data, and longitudinal patient-level data\n<br><br>\n<strong>BENEFITS</strong>\n<br><br>\nCompetitive salary and equity compensation\n<br><br>\nFull Medical, Dental, and Vision benefits\n<br><br>\n401k plan with employer match\n<br><br>\nFlexible hours and a \"use as you need\" vacation policy\n<br><br>\nOpportunities to attend industry conferences and events\n<br><br>\nGreat office location(s) in SF/SOMA and NY/FLAT IRON"}