{"job title": "Data Scientist", "company": "Kong", "city state": "– San Francisco, CA", "rating": "4.6", "job description": "<div><strong>Are you ready to join the API revolution?</strong></div><br>\n<div>We are a group of makers, thinkers, and doers focused on helping todays developers build tomorrows technology. Our teams work on the bleeding edge of API innovation to provide our users with a central nervous system for data and services.</div><br>\n<div>We put design at the heart of everything we do, and were relentlessly focused on creating beautiful experiences for our customers. Thats why technology companies, major banks, e-commerce innovators, and government agencies put Kong in front of their most important web applications.</div><br>\n<div>We believe in the power of Open Source and everything it stands for. Thats why developers around the world enthusiastically contribute on top of our open-source platform.</div> <br>\n<div>We are passionate about solving challenges that will fundamentally shape the future of technology, and were looking for the right people to join us on our mission. If you believe in taking ownership of your work, making an impact, and having fun along the way, we would love to talk to you.</div><br>\n<div><strong>About the role:</strong></div><br>\n<div>As a Data Scientist, you will be responsible for R&amp;D features which automate finding insights for our users by taking advantage of Kongs crucial place in the networks stack, so that they can maximally leverage their data. The models we build use a mix of raw statistics, data science and machine learning; we are pragmatic and will use the simplest approach that works. This position is ideal for someone who is passionate about ML/DL algorithms and modeling.</div> What you bring:\n\n<ul>\n<li>MS or PhD in Computer Science, Statistics, Applied Mathematics, Operations Research or related quantitative field.</li><li>Has at least 3 years of experience, using machine learning or data science modeling to help build product features.</li> <li>Experience with fundamental machine learning algorithms like linear and logistic regression and the strong foundation in Bayesian statistics, inferential statistics, probability theory, distributions, etc.</li><li>Experience with widely used algorithms like decision trees, random forest, SVM, KNN, k-means, SOM, CNN, RNN and ART etc.</li><li>Familiar with optimization algorithms (stochastic &amp; deterministics, convex &amp; non-convex)</li> \n</ul>\n\n<strong>Bonus Points:</strong>\n\n<ul>\n<li>Experience with machine learning at scale.</li><li>Familiar with time series databases (OpenTSDB, Graphite, Prometheus, Grafana)</li>\n</ul>"}