{"job title": "Business Intelligence Analyst", "company": "KVH Industries", "city state": "– Middletown, RI", "rating": "4.2", "job description": "This critical role will be responsible for working with business executives and high-level managers to design, develop, test and implement business intelligence solutions. His or her ultimate goal is to provide data transformation expertise and data visualization techniques to ensure optimal internal and external user experience.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong> include the following:\n\n<ul>\n\n <li>Design, develop, test, debug, document and support BI (Business Intelligence) specific data analyst solutions: Including data store/data warehouse architecture, ETL/ELT process, both on premise and in the cloud</li>\n\n<li>Create, implement and support BI self-service and mobile data visualization solutions to empower the users (Sales, Marketing, Finance and Executives)</li>\n\n<li>Apply practical data governance standards and techniques to ensure efficient coding logic and trusted data integrity</li>\n\n<li>Work with cross-functional teams to gather and translate user data requirements into effective and optimal BI visualization solutions</li>\n\n<li>Recommend and present data architecture, design and data story effectively in both one-on-one and group settings</li>\n\n<li>Leverage the Agile/Scrum and Dev/Ops methodologies to expedite data analyst solutions</li>\n\n<li>Perform any and other related data analyst duties as required</li>\n</ul>\n\n<strong>QUALIFICATIONS:</strong>\n\n\n<ul>\n\n \n<li>Bachelor's degree or equivalent preferably in Marketing, Finance, Economics, Computer Science, Mathematics or Statistics</li>\n\n\n\n</ul>\n\n<strong>REQUIRED</strong>\n\n\n<ul>\n\n <li>Experience in at least one of the following BI tools: Salesforce Wave, Tableau, Microsoft Power BI, Looker, Microstrategy, SAP, IBM-Cognos, SAS, Business Object, Qlik or other similar tools</li>\n\n<li>Solid experience in data testing (unit, QA, user test) to ensure data integrity</li>\n\n<li>Experience in Statistical Analysis (prescriptiv<strong>e</strong> and predictive)</li>\n\n<li>Knowledge of JSON or other Computer Science Languages</li>\n\n<li>Knowledge of modern RDBMS (i.e. Postgres, SQL or Oracle)</li>\n</ul>\n<strong>PREFERRED</strong>\n\n<ul>\n\n <li>Good hands-on knowledge of the JSON language (JavaScript Object Notation)</li>\n\n<li>Experience in at least one of the following languages: Java, Python, Ruby, C#, Go, JavaScript</li>\n\n<li>Practical knowledge of big data storage/processing solutions. Example: AWS (Redshift, S3, Kinesis…)</li>\n\n<li>Knowledge of Salesforce data objects and architecture</li>\n\n<li>Certification in Salesforce development (force.com, API or data.com)</li>\n\n<li>Good hands-on knowledge in a modern ETL tool (i.e. SSIS, Jitterbit, Boomi, Cast Iron, Informatica, IBM-Data Stage, etc.)</li>\n\n<li>Experience with Data Warehouse development and implementation</li>\n\n<li>Experience in Machine Learning and/or Artificial Intelligence</li>\n\n<li>Experience with API’s</li>\n\n<li>Experience with Application development</li>\n\n<li>Experience in both Unix and Windows environments</li>\n\n<li>Experience in cloud environment and cloud computing</li>\n\n<li>Experience in any modern RDBMS (i.e. Postgres, SQL or Oracle)</li>\n</ul>\n<strong>Interpersonal Communications and Learning Capabilities Requirements</strong>\n\n<ul>\n\n <li>Ability to quickly shift focus on various BI development projects as the business needs and requirements change</li>\n\n<li>Exceptional interpersonal/team collaboration skills including the ability to communicate with IT and business executives</li>\n\n<li>Ability to work at a detailed level while maintaining an overall project perspective</li>\n\n<li>Pragmatic documentation (i.e. data dictionary) and problem-solving skills</li>\n\n<li>Good organizational and time management skills</li> \n\n<li>Strong self-starter and a strong team player with an entrepreneurial spirit (think out of the box).</li>\n\n<li>Has a strong motivation and a fast learning capacity to master new data designs or BI solutions in a short timeframe</li>\n\n<li>Works well under pressure and an outstanding intrinsic drive to win and excel</li>\n</ul>\n<em>???????U.S. citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor at this time. KVH Industries is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, veteran status or disability. We offer a full suite of benefits to include paid time off, medical, dental, vision, life insurance, flexible spending account, employee stock purchase program, and 401k/Roth.</em>\n<br><br>\n<em>All persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. KVH also conducts background checks and drug screening after acceptance of an offer. #LI-TM1</em>"}