{"job title": "Corporate Data Scientist&amp;Analyst", "company": "L'Oreal", "city state": "– Milan, TN", "rating": "3.7", "job description": "\"When you love your work and the people you work with, amazing things can happen.\"\n<br><br>\nBe the center of the digitally connected beauty.\n<br><br>\nJoining our team is your opportunity to be at the center of L'Oréal digital transformation. It is about always having a glimpse of the future. It's about creating the next high-touch experience to be closer to the people who love our products worldwide.\n<br><br>\n<strong>THE MISSION</strong>\n<br><br>\nBecause algorithms change. People's behaviors change. The ways of communication change.This is your turn to applies advanced statistical and predictive modeling techniques to build, maintain, and improve L'Oréal databases and CRM. Work alongside business to answer its requirements and expected outcomes. Tomorrow will never look the same as today.\n<br><br>\n<strong>JOB ACCOUNTABILITIES</strong>\n\n\n<ul>\n<li>Identify Business Needs</li>\n<li>Work with brand stakeholders to identify the business requirements and analytics problems to solve</li>\n<li>Develop innovative and effective approaches based on business analysis, data analysis, data modelling, statistical analysis and predictive modelling</li>\n<li>Build data analysis solutions</li>\n<li>Design experiments, test hypotheses and build models</li>\n<li>Conduct data analysis and designs convenient algorithms</li>\n<li>Identify, analyze, and interpret trends or patterns in complex data sets</li>\n<li>Present and depict the outcomes of their finding in easy to understand terms for the business stakeholders</li>\n<li>Ensure Data Collection, Quality and retention</li>\n<li>Collaborates with CRM manager and Digital Marketing Manager to select the relevant sources of information (primary or secondary data sources, strategic approach)</li>\n<li>Works with Digital IT teams to support data collection, integration and retention based on the input collected with the Digital Marketing and CRM Managers</li>\n<li>Develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality</li>\n</ul>\n\n<strong>TECHNICAL COMPETENCIES</strong>\n\n\n<ul>\n<li>Demonstrate scientist qualities: clarity, accuracy, precision, relevance, logic, fairness</li>\n<li>Provide on-going knowledge of tracking and monitoring of performance of decision systems and statistical models.</li>\n<li>Proven working experience as a data analyst</li>\n<li>Technical expertise regarding data models, database design development, data mining and segmentation techniques</li>\n<li>Strong knowledge of and experience with reporting packages, databases, programming</li>\n<li>Ability to collect, organize, analyze, and disseminate significant amounts of information</li>\n</ul>\n\n<strong>LITTLE REQUIREMENTS</strong>\n\n\n<ul>\n<li>Relevant working experience of min 2-3 years</li>\n<li>Strong excel, SQL&amp;R programming skills</li>\n<li>Salesforce and Adobe Campaign knowledge</li>\n<li>Google Analytics certification is a plus</li>\n<li>Degree educated with a strong preference for background in computer science / mathematics / statictics</li>\n</ul>\n\nL'Oréal is Italy's Industry Leader. Join us to share your passion for innovation and new challenges. We're a crazy mix of creative, caring, smart and zany teams who just want to make a dent in the universe. Here you'll strive and drive. You'll try, fail, try better and succeed. But you will never do it alone. It's that amazing team that will make you jump out of bed every day. Not because you have to, but because you want to do some mind blowing stuff and succeed together.\n<br><br>\n<strong>APPLY NOW!</strong>\n<br><br>\nYou will get answer on your application in less than 7 days.\n<br><br>\nShare Facebook LinkedIn Twitter Google Plus Viadeo Send to a friend\n<br><br>\n? Back to job list"}