{"job title": "Data Analyst III, Business Insights", "company": "L.A. Care Health Plan", "city state": "– Los Angeles, California, US", "rating": "3.0", "job description": "<div>\n<div>\n<div>\n<div>\nData Analyst III, Business Insights</div>\n</div>\n </div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div>\nJob Category:\n<br><br>\nInformation Technology</div>\n </div>\n </div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div>\nDepartment:\n<br><br>\nEnterprise Data Strategy</div>\n </div>\n </div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div>\nLocation:<br><br>Los Angeles, CA, US, 90017<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n }</div>\n</div>\n </div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div>\nPosition Type:\n<br><br>\nFull Time</div>\n </div>\n </div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div>\nRequisition ID:\n<br><br>\n2476</div>\n </div>\n </div>\n </div><br>\n\n <div>\n<div>\n<div>\n<div>Established in 1997, L.A. Care Health Plan is an independent public agency created by the state of California to provide health coverage to low-income Los Angeles County residents. We are the nation’s largest publicly operated health plan. Serving more than 2 million members in five health plans, we make sure our members get the right care at the right place at the right time.\n<br><br>\nMission: L.A. Care’s mission is to provide access to quality health care for Los Angeles County's vulnerable and low-income communities and residents and to support the safety net required to achieve that purpose.<br>\n<div>Duties\n<br><br>\nThe Data Analyst III of Business Insights is responsible for supporting short and long term operational and/or strategic business initiatives. This role will develop, enhance, and maintain operational information and models that will have an impact on business decisions. Through the application of data analytics, joining disparate data sources, and working with raw data, this role will work to deliver valuable insights and recommendations to improve operational performance.\n<br><br>\nThe Data Analyst III of Business Insights will work in a highly matrixed environment, working closely with senior leaders, management, and line staff to understand root cause, propose recommendations for improvement, and develop solutions on key business challenges. This position will serve as a mentor to team members.\n<br><br>\nDevelops and maintains a comprehensive catalog of venues, services and other essential vendors; provides a choice of venues which meet the identified needs of the Program lead. Prepares and processes all documentation needed for successful events including contracts, purchase orders and coordination of resources. Coordinates travel and registration for each event; manages and distributes stipends and/or gifts at the conclusion of each event to eligible participants. Maintains an accurate accounting of stipends and/or gift cards distributed at each event. Arranges for facilities, food, transportation, security, audio visual and interpretation for assigned events. (45%)\n<br><br>\nDemonstrates the ability to organize, prioritize and execute multiple and often complex projects/ assignments. Develops, uses and refines tools such as event planning worksheets and event budget planners to ensure outcomes. Identifies solutions to obstacles related to the location and logistics of an event in a timely manner. (25%)\n<br><br>\nPrepares, utilizes and completes work plans for all events; maintains records of events in both electronic and hard copy versions. Oversees the completion by filed staff of event binders/archives. Creates index of event locations and services in support of the marketing and publicity of each event. (10%)\n<br><br>\nNegotiates with vendors for services; coordinates services with other L.A. Care departments as need to ensure a successful events. (10%)\n<br><br>\nPerform other duties as assigned. (10%)\n<br><br>\nEducation\n<br><br>\nHigh School Diploma/GED\n<br><br>\nAssociate's Degree or Bachelor's Degree\n<br><br>\nExperience\n<br><br>\nRequired:\n<br>\nWith High School Diploma: At least 10 years of collecting, manipulating, and analyzing data in business and/or finance\n<br><br>\n<strong>Preferred:</strong>\n<br>\nWith Associate's Degree: 7 years of collecting, manipulating, and analyzing data in business and/or finance\n<br>\nWith Bachelor's Degree: 5 years of collecting, manipulating, and analyzing data in business and/or finance\n<br>\nWith Master's Degree: 3 years of collecting, manipulating, and analyzing data in business and/or finance\n<br><br>\nProfessional Licenses\n<br><br>\nProfessional Certifications\n<br><br>\nPreferred:\n<br>\nCertificate in Event Planning\n<br><br>\nRequired Training\n<br><br>\nAdditional Information</div>\n<br><strong>L.A. Care offers a wide range of benefits including</strong>\n\n<ul>\n\n\t<li>Paid Time Off (PTO)</li>\n<li>Tuition Reimbursement</li>\n<li>Retirement Plans</li>\n<li>Medical, Dental and Vision</li>\n<li>Wellness Program</li>\n<li>Volunteer Time Off (VTO)</li>\n</ul>\n\n</div>\n</div>\n </div>\n </div>\n<br><strong>Nearest Major Market:</strong> Los Angeles\n<br>\n<strong>Job Segment:</strong> \n<br>\n Medical, Healthcare"}