{"job title": "Data Scientist", "company": "L.L.Bean", "city state": "– Freeport, Maine", "rating": "3.5", "job description": "Job ID 14411-2018\n<br>\nState Maine\n<br>\nShift First\n<br>\nCity Freeport\n<br><br>\nOverview\n<br><br>\nL.L.Bean is looking for an experienced Data Scientist to join our growing Customer Insights and Planning Department in Freeport, Maine. This individual will work on the Consumer Insights and Targeting team, reporting to a Senior Data Scientist. The Data Scientist will be responsible for developing predictive models, defining audiences in support of marketing efforts, identifying and visualizing insights through thoughtful data analysis and providing operational support to critical marketing processes. The ideal candidate is an independent and inquisitive individual who is excited to discover insight through data in order to drive the business forward.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Build and deploy predictive models to enable smart decision making</li>\n<li>Manage the production scoring process with support from IT</li>\n<li>Provide technical and analytical support to marketing programs and consumer research</li>\n<li>Serve as department expert on data access and manipulation of large and complex structured and unstructured data</li>\n<li>Support projects that advance L.L.Bean's data infrastructure and environment both on-premise and cloud</li>\n<li>Investigate and onboard new data sources to provide valuable customer insights</li>\n<li>Help build advanced analytical capabilities through an awareness of industry best practices</li>\n<li>Visualize and communicate analytical findings to a broad audience</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Proven ability to perform complex queries and analyses using SAS and SQL (experience in BigQuery Python and R is a plus)</li>\n<li>Statistical modeling experience</li>\n<li>3+ years experience in a marketing role or decision support role</li>\n<li>High degree of problem solving and reasoning abilities</li>\n<li>Exceptional organizational and communication skills</li>\n<li>Understanding of efficient database/data design principles</li>\n</ul>\n\nEducation Level: BA/BS degree (graduate degree a plus)\n<br><br>\nHealth and Safety Requirement: Every employee is responsible for contributing to a safe and healthy workplace. Employees are expected to be active participants in health and safety by following all safety policies and procedures reporting unsafe conditions or at-risk behaviors to leadership and conducting work in a safe manner. Those in a leadership role are also expected to model safe behaviors evaluate risk and ensure that risks are reduced to acceptable levels.\n<br><br>\nOver the past few years L.L.Bean has received numerous accolades including being named #1 in 2017 on Forbes Best Employers List for America's Best Mid-Size Employers, thanks to the corporate culture and unique benefits we offer our employees:\n\n\n<ul>\n<li>An excellent total compensation package</li>\n<li>Enhanced 401(k) retirement package</li>\n<li>Health care, including domestic partner and family coverage, across medical, dental, and vision</li>\n<li>Flexible spending accounts for health and dependent care</li>\n<li>Life insurance, including domestic partner and dependent coverage</li>\n<li>Outdoor experience days in addition to Paid Time Off (vacation, holiday and personal time)</li>\n<li>Discounts on L.L.Bean merchandise and Outdoor Discovery School adventures</li>\n<li>Employee Store</li>\n<li>Equipment loan program from the Employee Use Room</li>\n<li>Tuition reimbursement</li>\n<li>Access to L.L.Bean cabins and tent sites at Rangeley Lake for personal use</li>\n</ul>\n\nFor more details please visit our website at ********************* and refer to the benefits section\n<br><br>\nWe recognize the importance of diversity in creating a better world and a stronger organization. L.L.Bean is an equal opportunity employer."}