{"job title": "Data Scientist", "company": "Lab126", "city state": "– Seattle, WA", "rating": "3.1", "job description": "As part of the Last Mile Science &amp; Technology organization, you’ll partner closely with other ML scientists as well as scientists from other disciplines (e.g. economics, operations research, and statistics) in a collegial environment with a clear path to business impact. You will be responsible for developing new predictive models and algorithms for key applications and for thought leadership as we chart new courses with our delivery support technologies. Successful candidates will have a deep knowledge of competing statistical and machine learning methods for large scale prediction problems, the ability to map models into production-worthy code, the communication skills necessary to explain complex technical approaches to a variety of stakeholders and customers, and the excitement to take iterative approaches to tackle big, long term problems.\n<br>\n<strong>Key Responsibilities:</strong>\n<br>\n· Guide the technical approach for the design and implementation of successful models and algorithms in support of teams across Amazon which leverage geo-spatial data.\n<br>\n· Work in expert cross-functional teams delivering on demanding projects.\n<br>\n· Functionally decompose complex problems into simple, straight-forward solutions.\n<br>\n· Share knowledge in state-of-the-art statistics and machine learning research applicable to our problem space.\n<br>\nIf you have an entrepreneurial spirit, know how to deliver, are deeply technical, highly innovative and long for the opportunity to build pioneering solutions to challenging problems, we want to talk to you.\n<br>\n<strong>BASIC QUALIFICATIONS</strong>\n<br>\n· PhD in Artificial Intelligence, Computer Science (Machine Learning), Physics, Statistics, or Applied Math\n<br>\n· Six or more years of applying deep learning/statistical algorithms/models to solving real-world problems in industry\n<br>\n· Proficiency in C/C++, Java, or Python\n<br>\n· Outstanding written and verbal communication skills\n<br>\n· Experience with guiding R&amp;D for your organization\n<br>\n<strong>PREFERRED QUALIFICATIONS</strong>\n<br>\n· Proven record of innovation and impact across teams\n<br>\n· Excellent interpersonal skills and a can-do never-give-up attitude\n<br>\n· Ability to work independently and as part of a diverse team\n<br>\n· Publications in peer-reviewed statistics or ML journals"}