{"job title": "Variant Scientist", "company": "LabCorp", "city state": "– Westborough, MA", "rating": "2.9", "job description": "Location Westborough, Massachusetts Job ID 18-87762 Date posted 11/16/2018\n<br><br>\nThe Integrated Genetics division of LabCorp is seeking a Variant Scientist to join our Variant Science Group (VSG) team at Westborough, a beautiful New England suburb of Boston, MA! Variant Science is a very important component of our overall strategy and growth in genomics. You'll be part of a dynamic team with diverse backgrounds in genetics, nutrition, PGD, computational biology, metabolism and physiology. The Variant Scientist is responsible for classification of inherited and somatic sequence variants identified through Targeted NGS DNA sequencing and WES case triage review in a high throughput clinical laboratory setting. The VSG contributes to data sharing, supports gene and panel content development for a wide array of disorders and develops our in-house semi-automated rules based classification workbench while exploring automated approaches to scale up our ever growing variant classification needs. These efforts have resulted in peer-reviewed publications, and presentations at prominent scientific meetings. A strong background in Biochemistry/Molecular Biology/Biophysics/Cell Biology/Physiology and/or Human Genetics with experience in DNA sequence analysis, next-generation sequencing (NGS) technologies, and superior skills with Microsoft Office suite of products is essential.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Process and classify variants in accordance with company SOPs</li>\n<li>Maintain communication with laboratories located within or outside LabCorp</li>\n<li>Maintain tracking documents in relation to the variant-classification process</li>\n<li>Maintain active reports on variant processing status and performance</li>\n<li>Communicate frequently with the Laboratory Directors, Medical Geneticists and Genetic Counselors regarding variant assessment</li>\n<li>Interact with the software vendors/IT/bioinformatics group(s) regarding technology needs as and when required</li>\n<li>Opportunity to take part in company projects, publications and posters at scientific meetings of relevance to the organization</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>PhD in Life Sciences (Molecular Biology/Biochemistry/Genetics)with a strong background in Molecular Genetics</li>\n<li>Minimum of 2 years of post-doctoral and/or other relevant experience</li>\n<li>Strong analytical capabilities, superior scientific writing and communication skills, organization, meticulousness, ability to critically read, understand, and interpret data from scientific publications and online databases on a daily basis</li>\n<li>Ability to meet production timelines with a sense of urgency and ethical responsibility in a rapidly evolving dynamic setting</li>\n<li>Ability to learn and adapt to use of bioinformatics software, proficiency in working with large datasets, in-silico tools, and WES/NGS technologies</li>\n</ul>\n\nShift1\n<br><br>\nScheduleMonday-Friday, 8:00 a.m. - 5:00 p.m.\n<br><br>\nApply Now\n<br><br>\nShare\n\n\n<ul>\n<li>Facebook</li>\n<li>Twitter</li>\n<li>LinkedIn</li>\n<li>Email</li>\n</ul>\n\nLocation\n<br><br>\nCheck out where you could be working if you apply.\n<br><br>\nView Map\n<br><br>\nJoin Our Talent Community\n<br><br>\n<strong>Email:</strong>\n<br><br>\nInterested In:Search for a category and select one from the list of suggestions. Search for a location and select one from the list of suggestions. Finally, click \"Add\" to create your job alert.\n<br><br>\n<strong>Category:</strong>\n<br><br>\n<strong>Location:</strong>\n<br><br>\nAdd +\n\n\n<ul>\n<li>Laboratory Support, Westborough, Massachusetts, United StatesRemove</li>\n<li>Laboratory Technician, Westborough, Massachusetts, United StatesRemove</li>\n<li>Remove</li>\n</ul>\n\nConfirm Email\n<br><br>\nExplore More\n<br><br>\nLabcorp Specialty Labs\n<br><br>\nLabCorp and its Specialty Testing Group, a fully integrated portfolio of specialty and esoteric testing laboratories.\n<br><br>\nLearn More\n<br><br>\nCareer Path\n<br><br>\nCareer Growth at LabCorp.\n<br><br>\nLearn More\n<br><br>\nCytogenetics\n<br><br>\nHelp contribute to health care decisions nationwide.\n<br><br>\nLearn More\n<br><br>\nApplication FAQs\n<br><br>\nWhat you need to know about applying at LabCorp.\n<br><br>\nLearn More<br><br>SDL2017"}