{"job title": "Business/Data Analyst - Winter Intern (January - April)", "company": "Lacework", "city state": "– Mountain View, California", "rating": "4.8", "job description": "<div>Cloud computing is revolutionizing IT and forcing organizations to rethink their approach to cloud security. Lacework is at the forefront of this transformation. We enable security teams to effectively secure the public clouds AWS, Azure or Google by eliminating repetitive, manual and labor-intensive security tasks. Using Lacework, security teams operate security at the same pace as DevOps, which relies on automated tools to publish daily updates to the cloud.</div><div><br></div><div>We are looking for a Data/Business Analyst who is excited about building an industry leading, next generation Cloud Security System. At Lacework, youll experience the benefits of working in a dynamic, entrepreneurial environment while getting a unique and rare opportunity to get in on the ground floor and help shape our technologies, products and business. If you are ready, we have some interesting engineering-challenges ready for you! :-) Have fun while you are solving them!!!</div><div><br></div><div>During the 12-week internship, you'll be a full-time member of a small Engineering team and paired with a mentor on your team. You will have the guidance, environment, and the responsibility of deploying your projects to production. You will work on real projects, features, and updates that will affect our customers worldwide!</div>Here's what you'll need to be successful:<ul><li>Pursuing a degree in Computer Science or a related field, with demonstrated software engineering talent and a passion to help further our mission for education at scale.</li><li>Must be currently enrolled in a full-time degree program and returning to the program after the completion of the internship.</li><li>Must have a legal right to work in the U. S. for the duration of the internship· </li><li>Strong sense of ownership, customer obsession, and drive </li><li>Comfortable to write code in at least one programming language.</li><li>Familiarity with some programming language and business reporting tools.</li></ul>Bonus points if you have the following:<ul><li>Prior internship experience where you have demonstrated an ability to work in teams, problem solve and communicate effectively regarding technical projects</li><li>Use statistical methods to analyze data and generate useful business reports</li><li>Use data to create models that depict trends in the customer base and the consumer population as a whole</li><li>Collecting and interpreting data</li><li>Strong sense of ownership, customer obsession, and drive</li><li>Sharp analytical abilities and proven design skills</li><li>Experience in data modeling and analysis, especially with distinctive data sources</li><li>Demonstrated leadership abilities in an engineering environment in driving operational excellence and best practices</li><li>Demonstrated ability to achieve stretch goals in a highly innovative and fast-paced environment</li></ul><div>Lacework is an Equal Opportunity Employer. It is the policy of Lacework to provide equal employment opportunity to all persons, regardless of age, race, religion, color, national origin, sex, political affiliations, marital status, non-disqualifying physical or mental disability, age, sexual orientation, membership or non-membership in an employee organization, or on the basis of personal favoritism or other non-merit factors, except where otherwise provided by law.</div>"}