{"job title": "Data Engineer", "company": "Lake Trust Credit Union", "city state": "– ", "rating": "4.0", "job description": "* {\n font-family: 'Montserrat' !important;\n}\n.banner {\n color: #fff;\npadding: 50px;\n}\n.banner p {\n font-size: 14px;\n}\n.heading {\n font-size: 30px;\n}\n.description {\n width: 60%;\n}\n\n<div>\n<div>Data Engineer</div>\n<div>\n<p>Lake Trust’s Business Intelligence team is a cornerstone to achieve future business objectives. This team will be primarily responsible for supporting the Business Intelligence &amp; Analytics objectives of Lake Trust Credit Union. We are seeking a Data Engineer to perform a key role on this team solving problems through the use of extracting information from data</p><p>The Data Engineer role requires creativity with a high attention to detail and drive for data accuracy. If you enjoy working within an agile team this may be a great role for you.</p>\n</div>\n</div><p>\n\n</p><p>Lake Trust’s Business Intelligence team is a cornerstone to achieve future business objectives. This team will be primarily responsible for supporting the Business Intelligence &amp; Analytics objectives of Lake Trust Credit Union. We are seeking a Data Engineer to perform a key role on this team solving problems through the use of extracting information from data. </p><p> </p><p><b><u>What You’ll Do</u></b></p><p> </p><p>The data engineer will work on implementing complex data projects with a focus on collecting, parsing, managing, analyzing large sets of data to turn information into insights using multiple platforms. The Data Engineer will make the appropriate data accessible and available for use by Lake Trust. He or she should be able to decide on the needed hardware and software design needs and act according to the decisions. The data engineer should be able to develop prototypes and proof of concepts for the selected solutions. Some of the tools used will be Microsoft SQL Server, Alteryx Designer and Server, R, Microsoft PowerBI and Azure. The Data Engineer role requires creativity with a high attention to detail and drive for data accuracy. If you enjoy working within an agile team this may be a great role for you.</p><p> </p><p><b>ESSENTIAL FUNCTIONS<b>​</b></b></p><ul><li>Ability to solve problems with data</li><li>Discovery of data across many different systems, data sources and data types</li><li>Have strong SQL querying skills</li><li>Ability to profile data to measure quality, integrity, accuracy, and completeness</li><li>Poses data preparation and blending for reporting and visualization purposes</li><li>Have experience with the cataloging of data sources</li><li>Hands-on experience on all aspects of data warehousing and schema</li><li>To be proficient in designing efficient and robust ETL workflows</li><li>Helping to streamline a better data supply chain for analytics that goes from experimentation into production</li><li>Working with cloud computing environments</li><li>Tune solutions to improve performance and end-user experience</li><li>Document requirements and resolve conflicts and clear ambiguities</li><li>Work in teams and collaborate with others</li><li>Contribute to group knowledge sharing platforms and best practice</li><li>Perform other duties and responsibilities as required or assigned</li></ul><p><b> </b></p><p><b>KNOWLEDGE, SKILLS AND ABILITIES</b></p><ul><li>High attention to data accuracy</li><li>Ability to work in an agile team </li><li>Critical thinking to ask questions, determine best course and offer solutions</li><li>Complete work independently </li><li>Act as a change agent</li><li>Continuous improvement mindset</li><li>Ability to understand the big picture</li><li>Effective analytical and decision-making skills</li><li>Strong interpersonal skills to build relationships and communicate effectively with managers, staff, and vendors</li><li>Strong written and verbal communication skills</li><li>Teamwork skills within the department and on project teams</li><li>Demonstrated ability to work effectively in a fast-paced, complex, and dynamic business environment</li><li>Effectively provide open and honest feedback via performance reviews and 1-1 conversation.</li><li>Enjoy being challenged and to solve complex problems on a daily basis</li><li>Proven ability to support a strong member/customer service culture</li><li>Demonstrated and dynamic analytical/problem solving skills</li><li>Proven effective communication and collaboration</li></ul><p> </p><p><b><u>What You’ll Bring</u></b></p><p><b> </b></p><ul><li>BA/BS data analytics/computer science/information or similar degree is required</li><li>Four years job related experience is preferred</li><li>Data warehouse architecture experience is required</li><li>Hands-on experience writing SQL code is required</li><li>Building reporting semantic layers and BI dashboards is preferred</li><li>Hands-on ETL experience is required</li><li>SQL Server Integration Services is preferred</li><li>Microsoft SQL and/or Oracle querying is required</li><li>Experience with Microsoft Power BI, Alteryx Designer and Microsoft Azure preferred</li></ul><p><b> </b></p><p><b><u>What You’ll Get</u></b></p><p><b> </b></p><p>We know that pay and benefits are important. And, we’ve really got that covered. But, we also know that those are not the only things that you need to decide if this is the place for you. Join our team of Lake Trusters and you’ll enjoy:</p><ul><li>Working with an energetic team focused on making our members wildly successful</li><li>An opportunity to work with others that have your back every step of the way</li><li>Opportunities to make a difference both inside and outside of our walls</li><li>Being treated like you are more than the work you do</li></ul><p></p>"}