{"job title": "Data Scientist Internship", "company": "Lands' End", "city state": "– Dodgeville, WI, United States", "rating": "3.4", "job description": "<div><div>Lands End Data Scientist Internship\n<br><br>\nLands End® is a classic American lifestyle brand with a passion for quality, legendary service, real value and a simple two-word promise to stand behind everything it sells: Guaranteed. Period.® Lands End delivers timeless style for Men, Women, Kids and the Home. With over 50 years of experience, Lands End is renowned for its culture of service for the customer and is recognized as an innovator in the industry. Lands End is publicly traded and listed on NASDAQ under the trading symbol (LE).\n<br><br>\nOur environment is customer focused and innovative. When you join Lands End, you will join over 5,000 talented individuals who are leaders, critical thinkers, accountable, curious, flexible, and results-minded all driving toward the same goal, to motivate customers and drive sales through multiple channels. Our 12-week summer Internship Program is held at our Lands End corporate headquarters in Dodgeville, WI. Dodgeville is a community of about 4,000 that offers charming restored buildings with stores, specialty shops, restaurants and professional services. Nearby Governor Dodge State Park is Wisconsins largest with over 5,000 scenic acres, two lakes, and a waterfall. Dodgeville is located just 45 minutes from Madison. Madison is home to the University of Wisconsin and is a progressive city with outstanding restaurants, bike trails, and beautiful lakes surrounded by numerous parks. You can apply at www.landsend.com/jobs\n<br><br>\nAs a Lands End intern, youll join a diverse group of individuals from a variety of colleges, universities and areas of study for the 12-week summer program. Some highlights of our summer internship program include:\n<ul>\n<li>Competitive internship salary</li> <li>Relocation assistance</li> <li>Summer Hours</li><li>Career-building workshops</li> <li>Scholarship opportunities</li> <li>Team-building, networking activities including team project</li><li>Leadership and cross functional learning opportunities</li> <li>Free access to an 80,000 square foot onsite fitness facility</li> <li>Merchandise discounts on Lands End products</li>\n</ul>\nOur internship program is designed with future leaders in mind and serves as a pipeline for top talent. Participants in our program receive one-on-one mentorship while working alongside seasoned Marketing professionals. You will work with the team to develop and provide analysis and identify opportunities for innovation, efficiency and productivity. We will look to you to share your ideas and recommendations. The Intern experience at Lands End is a comprehensive development-based role, designed to facilitate a robust Marketing career path. Interns will be immersed and integrated in the various functions of Marketing and understand the factors that contribute to the broader scope of Marketing while gaining valuable hands-on experience in skill competency areas.\n<br><br>\nThe Data Scientist intern will assimilate data from multiple sources to investigate complex problems, forming actionable findings and insights to positively impact business results. We expect that as part of the internship you are highly inquisitive, explorative, performing what if analysis and questioning existing assumptions and processes. Armed with data and analytical results, you will then communicate informed conclusions and recommendations across the organizations leadership team.\n<br><br>\nKey Responsibilities:\n<ul>\n<li>Develops and codes software programs, algorithms, mathematical approaches and automated processes to solve business problems</li><li>Uses analytical rigor and statistical methods, machine learning, programming, data modeling, simulation and advanced mathematics to analyze large amounts of data, recognizing patterns, identifying opportunities, posing business questions and making valuable discoveries</li><li>Researches new ways for modeling and predictive behavior for large-scale projects</li><li>Generates and tests hypotheses, designing experiments to answer targeted questions</li><li>Evaluates data quality and extracts data in a \"Big Data\" environment</li><li>Documents projects including business objective, data gathering and processes, leading approaches, final algorithm, detailed set of results and analytical metrics</li><li>Works with large datasets in a 'Big Data' environment within retail/e-commerce</li><li>Programming in major analytics software packages (SAS, R, Python, Scala)</li><li>Works with unstructured data sets, cloud-based architecture and deployment frameworks for machine learning algorithms (e.g. Spark, etc.)</li>\n</ul>\nRequired Knowledge and Skills:\n<ul>\n<li>Pursuing a Masters Degree/MBA</li><li>Experience in statistical models, data analysis and visualization</li><li>Experience with extraction and manipulation of relational databases (SQL)</li><li>Experience with large data sets</li><li>Confidence with analytical tools</li><li>Proven ability to succeed in both a collaborative and independent work environment</li><li>Expertise designing and delivering presentations</li><li>Familiarity with SQL or other querying language</li><li>Inquisitive mind, diligent work ethic and high energy level</li><li>Strong analytical and problem-solving skills</li><li>Strong communication skills to communicate findings</li></ul></div>\n</div>"}