{"job title": "Environmental Scientist, Geologist, or Environmental Engineer - 1 to 3 Years Experience", "company": "Langan Engineering and Environmental Services", "city state": "– White Plains, NY", "rating": "4.4", "job description": "<strong>Work for an Industry Leader</strong>\n<br>\nChallenging Projects &amp; Dynamic Work Environment\n<br>\nExtensive Training Program\n<br>\nCommunity Service Opportunities\n<br><br>\nLangan is an award-winning ENR Top 500 Design Firm that offers integrated engineering and environmental services for both public and private sector clients at sites located throughout the United States and abroad. Langan receives numerous recognitions for its technical expertise as well as its work environment, including Zweig Group’s Best Firms to Work For, Glassdoor’s Employees’ Choice Award – Best Places to Work, NJ Biz Best Places to Work and Business of the Year – 50 Fastest Growing Companies, Hartford Business Journal’s Best Places to Work in CT, and Pittsburgh Business Times - Best Places to Work in Western PA. Visit our website for more information about our awards and recognitions.\n<br><br>\nLangan offers its employees opportunities that provide challenge and responsibility within an environment where they can grow and flourish! <strong> Join our team of industry leaders and make a difference on some of the most exciting and interesting projects in the field!</strong>\n<br><br>\n<strong>Langan has an opening for entry level Environmental Engineers, Scientists or Geologists in our White Plains office.</strong> As the successful candidate, you will have an enthusiastic, can-do attitude with strong interest in performing: environmental site investigation and remediation work; soil and groundwater sampling; vapor intrusion investigation; remedial investigation, design, implementation and monitoring; pilot tests; data management, processing and evaluation; and report preparation. In addition, possession of a strong technical education, professional demeanor, and desire to learn is essential.\n<br><br>\n<strong> <u>Job Requirements</u>:</strong>\n\n<ul>\n\n\t<li> Bachelor degree in Environmental Engineering, Environmental Science, or Geology (Master preferred);</li>\n<li> 1-3 years of Experience preferred;</li>\n<li> FE/EIT certification preferred for Engineers;</li>\n<li> Possess a valid driver’s license and reliable transportation for remote job site locations;</li>\n<li> Knowledge of groundwater flow and LNAPL / DNAPL behavior;</li>\n<li> Strong attention to detail with excellent analytical, judgment and problem-solving capabilities;</li>\n<li> Demonstrated ability to follow direction and work in a team environment;</li>\n<li> Excellent written and verbal communication and organization skills; and,</li>\n<li> Working knowledge of computers and AutoCAD design software, GIS a plus.</li>\n</ul>\nLangan offers its employees opportunities that provide challenge and responsibility within an environment where they can grow and flourish!\n<br><br>\nWe offer competitive compensation packages; full-time employment company paid medical, dental, and vision coverage; life insurance, short- and long-term disability insurance; 401(k)/Roth with company match; extensive training; buddy and mentoring programs; employee referral and professional license bonuses; educational reimbursement; and much more!\n<br><br>\n<strong>Equal Opportunity Employer</strong>"}