{"job title": "Senior Data Analyst", "company": "Latcha+Associates", "city state": "– Farmington Hills, MI", "rating": "3.7", "job description": "The Marketing Data Analyst manages the operational and analytical aspects of a complex and important account. Their focus is to expand the agency’s ability to collect, report on, and gain insight from data. The data is used to build strategies that bring our clients ideas to life. The Analyst collects data, tracks and analyzes performance of websites, applications, email deployments, and surveys for brands in the Automotive and Retail industries. The Analyst uses analytical tools to draw insights into overarching strategic plans. The focus of these strategic plans is to address all of a brand's consumer touch-points. Work with internal agency teams and clients to develop tactics which support a brand's position and improves the consumers experience. The goal is to refine the ability to gather insights and make them actionable within strategic, data based plans.\n<p>Major Responsibilities</p>\n<p>Leverages digital media and consumer response data to identify key business insight. Uses reports to draw conclusions and develop actionable insights. Conducts adhoc analysis to evaluate campaign performance.</p>\n<p>Supports Marketing Intelligence on assigned accounts and leverages data and research to develop, track and measure marketing solutions for clients.</p>\n<ol>\n<li>High level of comfort with quantitative methods and working with large and complex data sets.</li>\n<li>High-level proficiency with Excel.</li>\n<li>Experience with Tableau Software or other data visualization/dashboarding tools</li>\n<li>Experienced with statistical analysis tools, SPSS</li>\n<li>Excellent writing, verbal, presentation and concensus-building skills</li>\n<li>Targeting (Direct Mail List Strategy)</li>\n<li>Data Mining</li>\n<li>SQL – writing queries</li>\n<li>Database Research</li>\n<li>Bachelors (4-year) degree is preferred</li>\n<li>Minimum four years experience in marketing analysis, web analytics, predictive analytics and modeling and CRM analytics</li>\n<li>Experienced managing multiple projects at the same time while communicating project status</li>\n<li>Have physical and mental requirements to meet the above listed job responsibilities.</li>\n</ol>\n<p>QUALIFICATIONS, TRAINING, EDUCATION: 4+ years of Data Analytics and marketing experience. Background in consumer-driven businesses – automotive, retail, and/or CPG. Bachelor's degree in business administration, marketing, advertising or economics. A MBA preferred.</p>\n<p>In addition to a “standard interview” candidates will be expected to present a case study(ies) demonstrating their approach to CRM program strategy development, execution, analysis and presentation of the associated marketing story.</p>"}