{"job title": "Senior Data Scientist", "company": "Lattice Engines", "city state": "– San Mateo, CA, United States", "rating": "4.0", "job description": "We like to think we’re at the head of the class when it comes to helping businesses accelerate revenue growth and gain a competitive edge. With solutions to improve conversion and win rates at every stage of the revenue cycle, Lattice is the leader in predictive marketing and sales. Our rapidly growing customer base includes companies of all sizes and from nearly every industry. Tens of thousands of marketing and sales professionals around the world use our open and secure applications to increase conversion rates by as much as three times.\n<br><br>\nWe are privately held and backed by Sequoia Capital and New Enterprise Associates with headquarters in San Mateo and offices in Austin, Beijing, Boston, and New York City.\n<br><br>\nData Science is at the heart of the company DNA. Our mission is to make data science accessible to everyone and to automate the process of data preparation and data modeling, with minimum end users involvement.\n<br><br>\nAs a member of the data science team, the data scientist will work on groundbreaking R&amp;D projects to leverage massive structured, unstructured, transactional and real-time data sets from a variety of sources. The goal is to analyze customer usage patterns and make actionable statistically robust recommendations that are impactful to the business case. Daily duties includes:\n<ul>\n<li>Interact with internal and occasionally external clients in order to understand their business case for predictive analytics applications.</li></ul>\n\n<ul>\n<li>Help develop and refine the predictive algorithms that are the core of the product.</li>\n\n<ul>\n<li>Combine an understanding of the business goals with data analysis and machine learning</li><li>Cooperate with the Business Intelligence team to design and execute replicable data acquisition and utilization processes.</li><li>Investigate new data sources. Acquire, analyze, clean and structure data.</li><li>Use state of the art machine learning techniques to improve and expand existing models</li></ul>\n</ul>\n<strong>Minimum requirements</strong>:\n<ul>\n<li>Advanced degree in a quantitative discipline</li><li>3+ years of data-mining / analytics experience including applied techniques in data mining, machine learning, or scientific computing</li><li>Significant non-production level programming experience in at least 2 or more of the following: Hadoop (Hive,Pig,Spark), Scripting (Python, Perl), JAVA/C++, noSQL, R/Matlab</li><li>Collaborative team focused attitude with a strong desire to advance the product and learn new things</li><li>The ability to communicate technical ideas to a non-technical audience via strong verbal and written communication skills</li> \n</ul>\n<strong>Special requirements</strong>:\n<ul>\n<li>Publications in high quality scientific journals and conferences / patents</li><li>Knowledge and experience in the B2B analytic space</li><li>Comfortable working in a dynamic, research-oriented group with several ongoing concurrent projects</li><li>Personal GIt-Hub code repository</li><li>Experience turning ideas into actionable designs.</li>\n</ul>"}