{"job title": "Data Scientist", "company": "LaunchCode", "city state": "– Washington, DC", "rating": "3.8", "job description": "Company Description<br><br>.<br><br>Job Description<br><br>Are you a transitioning service member or military veteran with an active security clearance? Have you always wanted to work in technology, but arent sure if its possible without a relevant degree? If so, we would love to launch your tech career!\n<br><br>\nLaunchCode offers you an on-ramp to start your tech career through a full-time job opportunity with Booz Allen Hamilton. Were looking for fresh tech talent to join their data science team and build the next generation of innovative software.\n<br><br>\nIn partnership with LaunchCode, Booz Allen Hamilton is offering a full-time data science position for transitioning service members and military veterans. Selected candidates will receive a full-time job offer contingent upon finishing a 20-week, part-time programming course called LC101. The course meets twice a week in the evenings, from September 10, 2018 to February 18, 2019. After completing the course, graduates will begin their full-time career at one of the best consulting companies working with the public sector.\n<br><br>\nNo prior programming experience is required. Were looking for driven, discipline, creative applicants with active security clearances.\n<br><br>\n<strong>We only accept applications through our website at\n<br>\nhttps://www.launchcode.org/military</strong><br><br>Qualifications\n\n<ul>\n<li>Passion, drive, and aptitude to succeed in technology</li><li>An active security clearance with at least 6 months remaining before expiration (Secret, Top Secret, TS/SCI, TS/SCI with Poly preferred)</li><li>Currently located in the Washington DC Area</li><li>Availability to take a 20-week evening course that meets twice a week</li><li>Willingness to engage in analytically rigorous activities</li><li>Ability to work in the United States</li><li>Willingness to relocate upon graduation, if necessary</li>\n</ul>\n<strong>Nice to Haves</strong>\n<ul>\n<li>Strong-willed and diplomatic</li><li>Interest in researching data science and analysis topics</li><li>Great verbal communication skills</li>\n</ul>\n<strong>We only accept applications through our website at\n<br>\nhttps://www.launchcode.org/military</strong><br><br>Additional Information<br><br>."}