{"job title": "Data Scientist", "company": "Lawrence Livermore National Laboratory", "city state": "– Livermore, CA", "rating": "4.4", "job description": "<p><b>\n</b> </p> <p><em><strong>Science and Technology on a Mission!</strong></em></p><p>For more than 60 years, the Lawrence Livermore National Laboratory (LLNL) has applied science and technology to make the world a safer place.</p><p><b>\n</b> </p> <div>We have multiple openings for Data Scientists with expertise in computer science, machine learning, computer vision, computational statistics, uncertainty quantification, and/or high-dimensional data analysis. You will work independently as a technical expert developing new methods to meet data analysis challenges and to contribute to programmatic efforts in support of Laboratory mission objectives. These positions are in the Center for Applied Scientific Computing (CASC) Division within the Computation Directorate. </div><div> </div><div>These positions will be filled at either the SES.2 or SES.3 level depending on the skills of the selected candidates. Additional job responsibilities will be assigned if the candidate is hired at the higher level.</div><div> </div><div><strong>Essential Duties</strong></div><div>- Research, design, implement and apply a variety of advanced data science methods in multiple application areas (such as material science, high energy physics, predictive medicine, cybersecurity, climate modeling) in a collaborative scientific environment.</div><div>- Identify and define moderately complex problems stemming from national security applications; scope, plan, and propose advanced analysis methodologies; collect and analyze data; and document results in technical reports and peer-reviewed publications.</div><div>- Consult with programmatic sponsors and funding agencies and foster research collaborations with academia and industry.</div><div>- Author grant proposals, including proposal presentations and preparation of proposals.</div><div>- Perform other duties as assigned.</div><div><strong>In Addition at the SES.3 Level</strong></div><div>- Conduct independent research projects to establish future research directions.</div><div>- Lead small to mid-sized projects in advanced data science methodologies and tools and their application to mission-related science, serving as a primary technical contact.</div><div> </div><div><strong>Qualifications</strong></div><div>- Ph.D. in Computer Science, Statistics, Machine Learning, Mathematics or related field or the equivalent combination of education and related experience.</div><div>- Experience working in a collaborative, multidisciplinary, scientific environment and contribute to diverse application areas.</div><div>- Broad experience developing, implementing, and applying advanced statistical and machine learning models and algorithms.</div><div>- Demonstrated research ability, as documented by publications, reports, and presentations.</div><div>- Broad analytical and problem-solving skills necessary to craft creative solutions and solve complex problems with limited direction.</div><div>- Comprehensive programming skills in at least one prototyping language Python/R/MATLAB, as well as one of C/C++/Fortran to enable high-dimensional data analysis on high performance computing (HPC) platforms.</div><div>- Proficient verbal and written communication skills to effectively collaborate in a team environment, to present and explain technical information, document work, prepare and present proposals and research papers, and provide advice to management.<br><strong>In Addition at the SES.3 Level</strong></div><div>- Record of successful proposal writing and program development, and experience leading research and development in support of programs or R&amp;D. </div><div>- Experience mentoring students and/or postdocs.</div><div>- Demonstrated technical leadership in fields related to data science.</div><div> </div><div><strong>Desired Qualifications</strong></div><div>- Domain knowledge in multiple application domains and ability to communicate effectively with subject matter experts.</div><div>- Experience with high-performance computing, GPU programming, parallel programming, cloud computing, and/or related methods.</div><div>- Experience with the proper use of statistical inference.</div><p><b>\n</b> </p> <p><strong>Pre-Employment Drug Test:</strong> External applicant(s) selected for this position will be required to pass a post-offer, pre-employment drug test.<br> </p><p><b>\n</b> </p> <p><strong>Security Clearance:</strong> This position requires either no security clearance, or a Department of Energy (DOE) L-level or Q-level clearance depending on the location of the assignment.</p><p>If you are selected and a security clearance is required, we will initiate a Federal background investigation to determine if you meet eligibility requirements for access to classified information or matter. In addition, all L or Q cleared employees are subject to random drug testing. L and Q-level clearances require U.S. citizenship. If you hold multiple citizenships (U.S. and another country), you may be required to renounce your non-U.S. citizenship before a DOE L or Q clearance will be processed/granted.</p><p><b>\n</b> </p> <p><strong>Note: </strong> This listing has two openings; these are Career Indefinite positions. Lab employees and external candidates may be considered for these positions.</p><p><b>\n</b> </p> <p><strong>About Us</strong></p><p>Lawrence Livermore National Laboratory (LLNL), located in the San Francisco Bay Area (East Bay), is a premier applied science laboratory that is part of the National Nuclear Security Administration (NNSA) within the Department of Energy (DOE). LLNL's mission is strengthening national security by developing and applying cutting-edge science, technology, and engineering that respond with vision, quality, integrity, and technical excellence to scientific issues of national importance. The Laboratory has a current annual budget of about $1.8 billion, employing approximately 6,500 employees.</p><p> </p><p>LLNL is an affirmative action/ equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, marital status, national origin, ancestry, sex, sexual orientation, gender identity, disability, medical condition, protected veteran status, age, citizenship, or any other characteristic protected by law.</p>"}