{"job title": "Data Science Summer Institute Student Intern", "company": "Lawrence Livermore National Laboratory", "city state": "– Livermore, CA", "rating": "4.4", "job description": "<em><strong>Science and Technology on a Mission!</strong></em>\n<br><br>\nFor more than 60 years, the Lawrence Livermore National Laboratory (LLNL) has applied science and technology to make the world a safer place.\n<br><br>\nWe have multiple openings for data science advanced undergraduate and graduate level students and recent Bachelor's or Master's level graduates within one to join the Data Science Summer Institute (DSSI) and work on real problems that really matter to our country. DSSI is a 12-week summer internship program that allows you to take your ideas, passion, and the skills you've acquired in Machine Learning, Statistics and High Performance Computing and apply them to projects in areas of National Importance.\n<br><br>\n<strong>Essential Duties</strong>\n<br>\n<strong>At the Undergraduate Level</strong> <strong>(Non-Exempt):</strong>\n\n\n<ul>\n<li>Students will work with scientists, engineers and technical staff members to provide technical and/or research support to projects in the areas of computational science, numerical methods, mathematics, or other related fields.</li>\n<li>Under close supervision, participate in research in assigned area.</li>\n<li>Gather and analyze data and information in support of scientific research.</li>\n<li>Participate in research planning and evaluation discussion.</li>\n<li>Attend relevant on-site seminars (at least one per week).</li>\n<li>A minimum of one seminar or poster will be presented on the assignment.</li>\n<li>Perform other duties as assigned.</li>\n</ul>\n\n<strong>In Addition at the Graduate and Recent Grad Level (Exempt):</strong>\n\n\n<ul>\n<li>Under limited direction and supervision will conduct research in assigned area.</li>\n<li>Perform technical assignments of a basic degree of complexity and provide advanced technical support to scientist in scientific research and development projects.</li>\n<li>Present work through presentations and/or poster sessions.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\n<strong>At the Undergraduate Level</strong> <strong>(Non-Exempt):</strong>\n\n\n<ul>\n<li>Must be a continuing college or university student in good standing at an accredited institution pursuing an undergraduate degree in Computer Science, Statistics, Mathematics, Machine Learning, Computer Vision or other related fields.</li>\n<li>Effective programming skills in a high-level language such as R, Python or or Matlab. Distributed/parallel computing and experience with C/C++ and/or Java a plus.</li>\n<li>Ability to apply basic principles of data sciences (machine learning, statistics, computer science, mathematics) to solve technical problems.</li>\n<li>Ability to present and communicate concepts and ideas.</li>\n<li>Ability to work in a team environment.</li>\n<li>Demonstrated effective communication skills.</li>\n<li>Desire to understand and explore why certain algorithms are well-suited to specific applications.</li>\n<li>Desire to participate in both individual and team efforts including the LLNL DSSI Challenge Problems.</li>\n<li>Desire to improve skills in public presentation of scientific results by giving presentations and participating in the LLNL student poster competition.</li>\n<li>Eagerness to obtain an understanding of new application areas.</li>\n<li>Demonstrated exposure through coursework or relevant experience to some of the following topics:</li>\n\n</ul>\n\n\n<ul>\n<li>Statistical modeling and data analysis</li><li>Bayesian and frequentist statistical frameworks</li><li>Inverse problems, uncertainty quantification</li><li>Machine learning</li><li>Computer vision</li><li>Multimedia signal and video processing</li><li>Combinatorics and algorithms</li><li>Graph modeling and social network analysis</li><li>Modeling and Simulation</li>\n</ul>\n<strong>In addition, at the Graduate and Recent Grad Level (Exempt):</strong>\n\n\n<ul>\n<li>Must be a continuing college or university student in good standing at an accredited institution pursuing a graduate degree or a recent Bachelors or Masters graduate within one year.</li>\n<li>Demonstrated academic achievement in scientific curriculum.</li>\n<li>Experience applying advanced computational science and/or mathematical principles to solve technical problems.</li>\n</ul>\n\n<strong>Desired Qualifications</strong>\n\n\n<ul>\n<li>GPA of 3.0 or above.\n<br><br>\n<strong>Pre-Placement Medical Exam:</strong>  A job related pre-placement medical examination may be required.\n<br><br>\n<strong>Pre-Employment Drug Test:</strong> External applicant(s) selected for this position will be required to pass a post-offer, pre-employment drug test. This includes testing for use of marijuana as Federal Law applies to us as a Federal Contractor.\n<br><br>\n<strong>Security Clearance:</strong>  None required.\n<br><br>\n<strong>Note:</strong>  This is a Temporary Student Intern appointment. This assignment is for a full-time position during the summer academic break or a year-round part-time position during the academic year and full time during academic breaks. Refer to the Scholar Program website at https://scholars.llnl.gov/ for additional student employment information. Salaries are based on student academic level.\n<br><br>\nSelected applicants will be required to provide current unofficial transcripts.\n<br><br>\n<strong>About Us</strong>\n<br><br>\nLawrence Livermore National Laboratory (LLNL), located in the San Francisco Bay Area (East Bay), is a premier applied science laboratory that is part of the National Nuclear Security Administration (NNSA) within the Department of Energy (DOE). LLNL's mission is strengthening national security by developing and applying cutting-edge science, technology, and engineering that respond with vision, quality, integrity, and technical excellence to scientific issues of national importance. The Laboratory has a current annual budget of about $1.8 billion, employing approximately 6,500 employees.\n<br><br>\nLLNL is an affirmative action/ equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, marital status, national origin, ancestry, sex, sexual orientation, gender identity, disability, medical condition, protected veteran status, age, citizenship, or any other characteristic protected by law.</li>\n\n</ul>"}