{"job title": "Data Scientist", "company": "LeapYear", "city state": "– Berkeley, , US", "rating": "3.6", "job description": "<div>\n<strong>Your Role</strong> \n<br>\nAs a data scientist at LeapYear, you will be responsible for conceptualizing, developing, testing, and deploying machine learning products on customer data sets. You and our data science team will use LeapYear's platform to create value from the world's most sensitive, siloed data sources.\n<br><br>\nTo learn more about LeapYear's mission and values, visit leapyear.ai/careers.\n<br><br>\nFor details on the specific responsibilities and requirements of this role, please see below.\n<br><br>\n<strong>Responsibilities</strong></div>\n\n<ul>\n\n<li>\nLeverage LeapYears secure machine learning platform to deliver value from the worlds most sensitive and previously siloed data sources</li>\n<li>\nConceptualize, develop, test, and deploy machine learning products on customer data sets using LeapYears platform</li>\n<li>\nBecome an expert user and advocate of LeapYears secure machine learning SDK and collaborate with product and engineering to develop best practices and new features</li>\n<li>\nServe as a technical and subject matter expert in financial services and healthcare information technology, assisting sales during pre-sales and post-sales efforts</li>\n</ul>\n\n<div>\n<strong>Qualifications</strong></div>\n\n<ul>\n\n<li>\nPhD or equivalent in machine learning, computer science, math, statistics, or physics</li> \n<li>\nStrong foundations in the theoretical underpinnings of machine learning</li>\n<li>\nMinimum 2 years of data science experience required</li>\n<li>\nExperience manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources</li>\n<li>\nAbility to communicate complex quantitative analysis in a clear, precise, and actionable manner</li>\n<li>\nExperience working with large data sets and tools like MapReduce, Hadoop, Hive, etc.</li>\n<li>\nExperience working with large data streaming technologies like Spark, Flink, etc.</li>\n<li>\nAbility to work both independently and collaboratively in a fast-paced startup environment</li> \n<li>\nExpert knowledge of data analytics architecture, including knowledge of RDBMS, ETL, BI, and advanced machine learning libraries (e.g. Scikit-learn, MLlib, TensorFlow, Theano, Caffe), etc.</li>\n<li>\nDeep understanding of data science process, machine learning, data architecture, and IT systems</li>\n<li>\nExperience with the analytical workflows used in financial services and healthcare</li>\n</ul>\n\n<div>\n<strong>A few of the perks</strong></div>\n\n<ul>\n\n<li>\nCulture of teaching and learning</li>\n<li>\nCompetitive compensation package of salary and equity</li>\n<li>\nCatered lunch and dinner every day</li>\n<li>\nCompany outings</li>\n<li>\nBuild your ideal work station</li>\n<li>\nGenerous health insurance plan</li>\n<li>\nFree yoga and meditation classes at a world-class studio downstairs</li>\n<li>\nRelocation support</li>\n</ul>"}