{"job title": "Data Scientist", "company": "Legends", "city state": "– Frisco, TX", "rating": "3.4", "job description": "<div><div><div><div><div><div><div><div> Requisition Number 18-0662</div> <div> Post Date 7/6/2018</div> <div> Title Data Scientist</div> <div> City Frisco</div> <div> State TX</div> <div> Location The Star</div> <div> Work Schedule 9 am -6 pm</div> <div> Description The Data Scientist is responsible for the design and supervision of all historical and predictive Analytical Data Models, Analytics, and Data Science. This position is responsible for conducting and supervising modeling, data mining, and database analytics\n<br>\n using advanced algorithms and tools.\n<br>\nThe position will be responsible for using cutting edge technologies and methods to deploy supervised and unsupervised prediction algorithms, statistical models, and applying statistical rigor to Legend’s existing datasets.\n<br>\nThe position will work with all Legends’ functional areas to build new and validate existing methods and models. It will also work with customers to validate the models, tune them on a regular basis, and monitor usage and effectiveness.\n<br>\nEssential Functions\n\n\n<ul>\n<li>Design and supervise historical and predictive Analytical Data Models, Analytics, and Data Science.</li>\n<li>Work with analytics division to create new models and validate concepts and models in the current analytics pipeline.</li>\n<li>Monitor data activity, utilization, and model efficacy.</li>\n<li>Take the lead role in working with various project teams (including analysts and business designers) to discover and develop actionable, high-impact data analytics in a variety of customer business types including but not limited to Food &amp; Beverage, Ticket\n</li>\n\n</ul>\n\nSales, Finance, and Primary Research.\n\n\n<ul>\n<li>Maintain accurate and complete documentation on data models.</li>\n<li>Formulate policies, procedures, and standards relating to model development and management.</li>\n<li>Facilitate the design and implementation process for new products/projects, and evaluates impacts on the operation, informing senior executive of alternatives.</li>\n<li>Assist in establishing standards and guidelines for the design &amp; development, tuning, deployment and maintenance of information and advanced data models.</li></ul></div>\n\n\n<strong></strong><div><strong> Requirements Required Experience:</strong>\n\n\n<ul>\n<li>Bachelor’s degree in behavioral or natural sciences, business analytics, applied mathematics or comparable field.</li>\n<li>Minimum 5+ years of experience in programming, data mining, statistical analysis and modeling at an expert level.</li>\n<li>Experience with Linear and Logistic Regression, Generalized Linear Models and Generalized Linear Mixed Models.</li>\n<li>Experience with Neural networks, decision tree algorithms, Naïve Bayesian models, Association Rules, Sequence Analysis, and Support Vector Machine models</li>\n<li>Experience designing and deploying models for clustering analysis, segmentation and anomaly detection.</li>\n<li>Strong foundation in statistical theory and practice.</li>\n<li>Model validation management experience.</li>\n<li>Must have high energy level; be self-motivated, with a results oriented demeanor.</li>\n<li>Experience with R, Python, STATA, SPSS, S+, SAS Enterprise Miner or similar tools.</li>\n</ul>\n\nPreferred\n\n\n<ul>\n<li>5+ years of hands-on experience with R, Microsoft Machine Learning, IBM I2, STATA, SPSS, S+, SAS Enterprise Miner or similar tools.</li>\n<li>5+ years of hands-on experience with SQL development.</li>\n<li>2+ years of hands-on experience with Microsoft SSIS and SSAS in 2012 and above.</li>\n<li>Experience in successfully developing and implementing data models in a non-education setting.</li></ul></div>\n\n\n<div> Apply Online</div> <div> Send This Job to a Friend</div> </div> </div>\n </div>\n </div>\n </div>\n </div>\n </div><br>\n\n<div>\n<div>\n<div><div>The Legends Way <div>Built\n<br>\n on a system of people, process and execution, The Legends Way has \n<br>\nhelped to define our culture company-wide. It is woven throughout our \n<br>\nDNA and sets the stage to help us provide standard-setting results for \n<br>\nour partners.</div>\n</div>\n </div>\n</div>\n</div><br>\n\n<div>\n<div>©2014 Legends | All Rights Reserved | Privacy Policy | Terms &amp; Conditions</div>\n </div>\n\n<br>"}