{"job title": "Data Scientist Journeyman", "company": "Leidos", "city state": "– Springfield, VA", "rating": "3.4", "job description": "<p><b></b> </p> <b><u>Job Description:</u></b><br><br>Leidos is seeking a Data Scientist Journeyman to support our a customer in Springfield, VA.<b> Active TS/SCI is required for consideration.</b><br><br>The Data Scientist will analyze actual and predictable interacting operational activities of give target sets and client requests to obtain a quantitative, rational basis for decision making through the application of logic and scientific or economic disciplines and techniques. Devises modeling and measuring techniques; utilizes mathematics, statistical methods, engineering methods, operational mathematics techniques (linear programming, game theory, probability theory, symbolic language, etc.), and other principles and laws of scientific and economic disciplines. Identify and evaluate standardized methods, models and algorithms to address intelligence problems of limited scale as directed. Provide documentation for methods and algorithms use in data science solutions to the client and address outstanding items. Must have demonstrated good oral and written communication skills. The successful candidate will work as a member of a government-contractor team providing data research and analysis to solve intelligence problems.<br><br><b>MINIMUM REQUIRED SKILLS:</b><br><ul><li>Bachelor's Degree in a quantatative discipline such as data science, mathematics, statistics, earth science, GIS, computer science, physics or other scientific field and 3-10 years of relevant experience with data processing and analysis of large datasets and machine learning</li><li>Active TS/SCI Clearance required</li><li>Ability to conceive and prepare thorough, well-articulated tactical or strategic data science products</li><li>Ability to identify, retrieve, manipulate, relate and/or exploit multiple structured and unstructured data sets from various sources</li><li>Ability to identify problems to which data science can be applied and initiate appropriate solutions</li><li>Ability to identify and appropriately evaluate a wide range of existing methods, models and algorithms in familiar domains for a variety of mission driven problems while recognizing the capabilities and limitations of each method</li><li>Demonstrated strong writing and oral communication skills</li><li>Extensive knowlege of programming languages (e.g. Python, Java, JavaScript, SQL, Pig or R), spatial analysis tools and concepts, data mining methods, database structures and analytic information extraction and visualization.</li></ul><br><br>\"External Referral Eligible\"<br><br>MACSS<br><br>"}