{"job title": "Data Scientist (SME)", "company": "Leidos", "city state": "– Location: Reston, VA", "rating": "3.4", "job description": "<strong><u>Job Description:</u></strong>\n<br>\nLeidos' Defense &amp; Intelligence Group is currently seeking expertise to transform and build an end-to-end national-level security environment using DevOps to integrate, develop, test, deploy, maintain, and operate, multiple systems on traditional and cloud platforms in Reston and Tysons, VA.\n<br><br>\n<strong>ROLES AND RESPONSIBILITIES:</strong>\n<br><br>\nThis role uses Data Science and engineering techniques to satisfy customer requirements.\n<br><br>\nEvaluates and uses algorithms for Natural Language Process (NLP), Artificial Intelligence (AI), and Machine Learning (ML).\n<br>\nUses large data sets to perform entity resolution and extraction for work products and creates models to test the effectiveness of different courses of action.\n<br>\nCollaborates across a team of Data Scientists, Data Administrators, and Data Engineers to produce work products.\n<br>\nDesigns and develops methods, processes, and systems to consolidate and analyze structured and unstructured, diverse sources including \"big data\" sources.\n<br>\nDevelops and uses advanced software programs, algorithms, query techniques, models complex business problems, and automated processes to cleanse, integrate, and evaluate datasets.\n<br>\nAnalyzes the requirements and evaluates technologies for data science capabilities including Natural Language Processing, Machine Learning, predictive modeling, statistical analysis and hypothesis testing.\n<br>\nWorks with cross-discipline teams to ensure connectivity between various data sources and business problems. Identifies meaningful insights and interprets and communicates findings and recommendations.\n<br>\nDevelops algorithms and analytical techniques to improve business performance. Maintains awareness of emerging analytics and big-data technologies.\n<br>\n<strong>NSOINT</strong>\n<br><br>\nEDUCATION &amp; EXPERIENCE: Requires Masters with 15 - 20 years of prior relevant experience or Doctorate with 13 - 16 years of prior relevant experience.\n<br><br>\n<strong>Basic Qualifications:</strong>\n<br><br>\nMaster's degree in engineering, computer science, or other related technical field or Bachelor's degree in a business or management-related field accompanied by experience managing technical requirements in complex programs.\n<br>\nExperience displaying expert domain knowledge in a technical field.\n<br>\nExperience negotiating complex scenarios and challenges and devising courses of action to resolve situations with predictable outcomes.\n<br>\nExperience leading critical objectives where decision making is of utmost concern to the outcome.\n<br>\nExperience supervising others.\n<br><br>"}