{"job title": "Data Scientist", "company": "LendUp", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "LendUp builds technology, credit products, and educational experiences for the 56% of the adults in the US, who are currently shut out of mainstream banking because of poor credit or volatile income. That's a lot of hardworking, deserving people who we believe did not have good options, until now.\n<br><br>\nOur mission is to provide anyone with a path to better financial health. Being a socially responsible, machine learning-enabled financial services company is a big job, but we're driven by the challenge. Now in our sixth year, we're growing each and every day as we continue to bring our mission to life. Join our passionate team and help us turn our mission into a movement.\n<br><br>\nLendUp is headquartered in downtown San Francisco with an office in Richmond, VA. We're backed by prominent Silicon Valley investors including Y-Combinator, Google Ventures, PayPal, Susa Ventures, Data Collective, Kleiner Perkins, Andreessen Horowitz Seed Fund, Kapor Capital, QED, Eagle Cliff Investors, Thomvest Ventures, Alexis Ohanian, Troy Carter, and many others.\n<br><br>\n<strong>About the role:</strong>\n<br><br>\nYou'll power decisions at the core of LendUp on lending, growth, operations, and more. We want you to apply the best machine learning techniques to Lending, and help us find a way to help the tens of millions of Americans banks won't lend to.\n<br><br>\n<strong>You will:</strong>\n\n<ul>\n<li>Apply advanced machine learning models and statistical techniques.</li>\n<li>Work on every aspect of the problem: data munging, feature engineering, modeling, evaluation launching models to production, and monitoring.</li>\n<li>Work collaboratively with our credit and growth teams to drive end-to-end implementation.</li>\n<li>Learn from some of the smartest and most experienced data scientists and engineers in the world.</li>\n</ul>\n<strong>You have:</strong>\n\n<ul>\n<li>A good understanding of statistical methods and machine learning.</li>\n<li>Proficiency in Python, Java, or similar.</li>\n<li>A background in statistics and machine learning.</li>\n<li>Previous experience in a data science role.</li>\n<li>Analytical thinking, driven to learn fast, be creative, and win as a team.</li>\n</ul>\n<strong>We have:</strong>\n<br><br>\nLendUp has all of the things you'd expect, like a competitive salary; early stage equity; 100% company paid medical, dental and vision insurance; generous vacation/sick leave policy; catered, free lunch; fully stocked kitchens with free healthy snacks; free onsite gym; and a 401(k) program.\n<br><br>\n<strong>But here's what we really love about life at LendUp:</strong>\n\n<ul>\n<li>We are driven by having a lasting impact on the world and knowing that our time is spent positively impacting the lives of others. We are strategists and doers, because we know that both matter when it comes to achieving our lofty mission.</li>\n<li>One of our values is <em>Different Backgrounds, Same Mission</em>. We're committed to a diverse and inclusive culture that spurs innovation and creates a meaningful and impactful work environment. We are passionate participants in our employee resource groups (LeanIn, LGBTQ &amp; Allies, and Black Ladders) and have Slack channels dedicated to everything from philosophy to sports to hip-hop.</li>\n<li>We have fun together at our weekly happy hours, quarterly team building events, company-sponsored volunteerism, hackathons, and sports teams.</li>\n<li>Our dog-friendly SF office.</li>\n</ul>\n<strong>LendUp is an Equal Opportunity Employer</strong>\n<br><br>\nWe extend equal employment opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition, or any other reason protected by law."}