{"job title": "Senior Data Scientist", "company": "Lenovo", "city state": "– San Jose, California", "rating": "3.4", "job description": "Job ID #: 64124\n<br><br>\nPosition Title: Senior Data Scientist\n<br><br>\nLocation: USA-CA-San Jose\n<br><br>\nFunctional Area: Services\n<br><br>\nFacility: Corporate Office\n<br><br>\nRelocation Provided: Yes\n<br><br>\nEducation Required: Masters Degree\n<br><br>\nExperience Required: 1 - 3 Years\n<br><br>\nTravel Percent: 15\n<br><br>\nPosition Description\n<br>\nMotorola Mobility, A Lenovo Company, is one of the world's fastest growing smart phone providers, creating groundbreaking, affordable, high-quality products designed and built with the global customer in mind. And it's our people who make this all happen. We are thinkers, risk-takers and problem solvers, working together to constantly challenge the status quo. If you share our commitment to ingenuity, creativity and innovation we want you to help us define our world of tomorrow. Motorola is at the forefront of designing and developing products supporting 5G technology. Explore the opportunities and apply today.\n<br><br>\nLenovo Mobile Business Group (MBG) Services seeks to further expand its industry-leading application of deep learning and machine learning technologies in the customer service space to deliver a world-class holistic customer service experience and product warranty operation for its Lenovo Moto Smartphone product line.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Maintain our leadership in deep learning by being the first to apply cutting-edge deep learning/machine learning models in the customer service industry.</li>\n<li>Remain up-to-date on machine learning research and trends, challenge current best thinking, test theories, evaluate feature concepts and iterate rapidly</li>\n<li>Lead the development of machine learning models/predictive analytics techniques leveraging both repeatable patterns in both structured and unstructured data and discovering new trends that lead to customer experience improvements, cost reduction, and device quality &amp; reliability level predictions.</li>\n<li>Own the full flow of very challenging data problems starting with data discovery/collection/cleaning through the production implementation of resilient models that can perform using noisy real-world data, owning the deliverables and managing the priorities/timelines Position Requirements</li>\n</ul>\n\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>Advanced degree, Masters or PH.D in Computer Science, Statistics, Applied Math, Engineering with an emphasis on Machine Learning.</li>\n<li>A proven track record of successfully implementing deep learning and machine learning models on real-world structured and unstructured data</li>\n<li>Solid fundamentals, knowledge of machine learning / deep learning algorithms, classification, clustering, regression, reinforcement learning, CNN, RNN, Bayesian modeling, probability theory , algorithm design and theory of computation, linear algebra, partial differential equations, Bayesian statistics, and information retrieval.</li>\n<li>Mastery of natural language processing and text analytics (BiLSTM, LDA, word2vec, doc2vec, fasttext, etc)</li>\n<li>Experience with machine learning software platforms that leverage GPGPU compute such as Tensorflow, Pytorch, KERAS, CUDA, etc.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Success in competitive Machine Learning competitions such as Kaggle Competitions</li>\n<li>Strong combination of theoretical knowledge and handson experience in data mining, feature selection, dimensionality reduction, statistical techniques, regression analysis, machine learning / deep learning algorithms and failure prediction</li>\n<li>Expertise in statistical tools and technologies, including R, JMP , or SAS for modeling and visualization.</li>\n<li>Experience/proficiency in at least one compiled/object oriented programming language e.g. Java/C++.</li>\n<li>Experience in managing and coordinating complex cross-functional software teams and projects</li>\n<li>Experience with big data technologies such as Hadoop, BigQuery , MapReduce, etc. and parallelization tools in enterprise Big Data Platform stack, technologies and ecosystem is a strong plus</li>\n<li>Highly motivated team player with an entrepreneurial spirit and strong communication and collaboration skills, selfstarter with willingness to learn, master new technologies and clearly communicate results to technical and nontechnical audience.</li>\n</ul>\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}