{"job title": "QA Data Analyst", "company": "LERETA", "city state": "– Plano", "rating": "3.6", "job description": "<div> Title QA Data Analyst - Plano</div> <div> About the Organization Since 1986 LERETA's nationwide team of real estate tax and flood professionals has provided the mortgage and insurance industries the fastest, most accurate and complete access to property tax and flood information across the nation. With 5.8 million tax loans and over 12 million flood loans under service, LERETA is an industry leader committed to service excellence and providing cost-effective solutions to customers.</div> <div> Open Date 8/14/2018</div> <div> Position QA Data Analyst - Plano</div> <div> Full-Time/Part-Time Full-Time</div> <div> Exempt/Non-Exempt Non-Exempt</div> <div> Category Tax&amp;Flood</div> <div> Location Plano</div> <div> Req Number TAX-18-00369</div> <div> Description<br><br><strong>QA Data Analyst - Plano</strong>\n<br><br>\n<strong>LERETA</strong> is currently seeking a QA Data Analyst - Plano for the Plano, TX location to join our dynamic team of hardworking professionals.\n<br><br>\nResponsible for online and phone research of real-estate information for property tax, bond and/or HOA issues (e.g., delinquent taxes, lawsuits, P&amp;I, balances, outstanding liens). Obtains working understanding of public record information to research property taxes, bonds, and/or HOA balances for the purpose of reporting to customer.\n<br><br>\n<strong>Research Responsibilities</strong>\n\n<ul>\n\n\t<li>Analyzes legal descriptions/Metes and Bounds/plats and compares to tax maps to confirm and validate identity of property.</li>\n<li>Researches and gathers information for tax issues, e.g., delinquent tax lawsuits, delinquent and/or missing tax bills.</li>\n<li>Investigates and reports property value and/or property exemption discrepancies.</li>\n<li>Keeps up to date on property tax law changes.</li>\n<li>Manages new orders and pending queue items.</li>\n</ul>\n<strong>Processing</strong>\n\n<ul>\n\n\t<li>Checks appraisal and tax data files as necessary.</li>\n<li>Downloads data files via appropriate method.</li>\n</ul>\n<strong>Data Entry</strong>\n\n<ul>\n\n\t<li>Enters data received form the tax collectors ont</li>\n<li>Transfers data obtained over phone, fax, e-mail to production and reporting system.</li>\n</ul>\n\n</div>\n<br>\n<div> Position Requirements<br><br><strong>Minimum Requirements</strong>\n<ul>\n\t<li>High school diploma or equivalent.</li>\t<li>Property tax or title experience is preferred.</li></ul></div>\n<br>\n<div> EOE Statement We are an Equal Employment/ Affirmative Action Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.</div><br>\n\n<div>This position is currently accepting applications.</div>"}