{"job title": "Principal Software Engineer - Data Engineer", "company": "Lexicon Solutions", "city state": "– Santa Ana, CA", "rating": "5.0", "job description": "<strong>Job Description</strong>\n<br>\n\n<br>\n<strong>Principal Software Engineer - Data Engineer</strong>\n<br>\n\n<br>\nAs the Data Engineer you will be part of a team helping to build the data transport, collection and storage, and exposes services that make data a first-class citizen and solve a variety of complex problems. We are looking for a Data Engineer who is passionate and motivated to make an impact in creating a robust and scalable data platform. In this role, you will leverage data expertise to help evolve data models in various components of the data stack; You will be working on architecting, building, and launching highly scalable and reliable data pipelines to support our client's growing data processing and analytics needs. Your efforts will allow accessibility to business insights, leveraging huge amounts of client data to fuel several of the teams, such as Machine Learning, Data Analytics, Business Intelligence and many others.\n<br>\n\n<br>\nYou will need to understand how these different pieces work together, communicate and be able to build appropriate interfaces for your components that others will depend on. Careful system design is necessary to avoid bottlenecks and allow your data models to scale with increasing volumes of data.\n<br>\n\n<br>\n<strong>Requires Skills:</strong>\n\n\n<ul>\n<li>BS/MS in CS, or in another quantitative discipline with equivalent experience.</li>\n<li>Proficient in at least one of the SQL languages (SQLServer, MySQL, PostgreSQL).</li>\n<li>Experience with cloud platforms such as AWS (Kinesis, RedShift, etc.) or Azure (ADF, DW, Data Lake, etc.).</li>\n<li>5+ years experience in implementing data warehouse solutions, ETL, Analytics and Reporting.</li>\n<li>3+ years of writing complex SQL queries in high volume database environments.</li>\n<li>3+ years experience with Hadoop (or similar) Ecosystem (Yarn, HDFS, Hive/Pig, Spark, Storm, Streaming, etc).</li>\n<li>3+ years experience in data architecture and implementation using local and cloud-based storage and NOSQL data stores.</li>\n<li>3+ years experience with structured and unstructured data.</li>\n<li>Fluency in a modern scripting language, like Python.</li>\n<li>Experience building an ETL solution using Python frameworks.</li>\n<li>Ability to work within UNIX/Linux operating systems.</li>\n<li>Able to work independently and as a team-player meeting deadlines and expectations.</li>\n<li>Desire to learn new skills and tools.</li>\n<li>Ability to pay close attention to detail.</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Experience with multifunction imaging and printing systems and/or IoT platforms.</li>\n<li>Architect experience, designing, developing, deploying, and supporting large scale distributed systems and API development.</li>\n</ul>\n\n<strong>Lexicon Solutions</strong> is a full-service staffing company specializing in contract, contract-to-hire, direct placement, and payroll services. Located in the Portland metro area, we are at the heart of technology in the Pacific Northwest. Lexicon Solutions has been voted by the Portland Business Journal as one of <strong>Portland's Top Staffing Firms from 2009 - 2017.</strong>\n<br>\n\n<br>\n<strong>Lexicon Solutions is proud to offer a comprehensive benefits package, including the following:</strong>\n\n\n<ul>\n<li>Major PPO (Pre-tax) medical/dental cafeteria plan.</li>\n<li>AFLAC supplemental insurance.</li>\n<li>Complementary care.</li>\n<li>Individual supplemental term life policies.</li>\n<li>Paid holidays and sick time.</li>\n<li>Direct deposit payroll option.</li>\n</ul>"}