{"job title": "Senior Data Scientist", "company": "Lexmark International", "city state": "– Lexington, KY", "rating": "3.3", "job description": "Senior Data Scientist\n<br>\n <div>Apply Now</div>\n<br>The Senior Data Scientist will work with Service Operations, Engineering, R&amp;D, and IT to develop new operational capabilities and mature Lexmark advanced analytics and data-driven decision making. Dive into technical project work to help Predictive Service Management increase customer up time and reduce Lexmark costs. Leverage and create cutting-edge predictive models and supporting technologies to build better services and support for Lexmark field devices.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nWork with cross-functional resources including IT, Hardware/Firmware/Software Development Engineering, and Service Operations teams within Lexmark specifically to:\n<br><br>\n• Design, build, test, and deploy new algorithms and models that identify devices at risk for failure\n<br><br>\n• Blend methodologies from machine learning, applied statistics, and operations research in order to distill complex and disparate data sources into value-added information streams accessible by non-technical staff\n<br><br>\n• Work with NoSQL, RDBMS, and various AWS and Azure services to build robust applications of data science\n<br><br>\n• Create interactive applications and visualizations that empower our workforce to discover advanced analytics without becoming a data scientist\n<br><br>\n<strong>Minimum Requirements:</strong>\n<br><br>\n• Bachelor of Science in Computer Science, Physics, Math, Statistics, Economics, or related fields.\n<br><br>\n• 3-5+ years of related industry experience\n<br><br>\n• Computing programming skills &amp; experience such as; Python, R, C/C++, Java, SQL/noSQL, etc\n<br><br>\n• Experience in data manipulation, algorithms, advanced math, and/or statistical modeling and proven track record of solving real-world problems with these methods\n<br><br>\n<strong>Preferred Experience and Skills:</strong>\n<br><br>\n• Experience with relational SQL and NoSQL databases, including MongoDb and Redshift\n<br><br>\n• Experience with AWS and Azure cloud services: EC2, Redshift, SQS, SNS\n<br><br>\n• General knowledge of service delivery processes and systems (Technical Support call center, CRM)\n<br><br>\n• Proficiency in using visualization tools such as Tableau, Power BI and / or Business Objects\n<br><br>\n*Prefer candidates based in/commutable to Lexington, KY.<br>\n<div>Apply Now</div>"}