{"job title": "Call Center Data Analyst 3", "company": "LG Electronics", "city state": "– Huntsville, AL", "rating": "3.2", "job description": "At LG we make products and services that make lives better, easier and happier through increased functionality and fun. Put simply, we offer the latest innovations to make ?Life Good? ? from home appliances, consumer electronics, vehicle components and mobile communications to business innovations in digital signage, air conditioning, solar and LED lighting. As a global leader, we strive for greatness in product leadership, market leadership and people leadership to realize our growth strategies.\n<br><br>\nTalk about a mantra. Life?s Good with LG!\n<br><br>\nWe offer an environment that enables colleagues to demonstrate their capabilities, focus on their work and create value. At LG, you're encouraged to take a creative and individual approach to challenges with strong emphasis placed on performance and skill?and equal, merit-based opportunities across the board. We want our colleagues to grow with our global business. That's why we deliver sure rewards for exceptional performance and offer industry leading benefits including 100% company paid premium medical, dental and vision benefits, an employer matching 401K, eleven paid holidays per year, and paid time off; Come join the team!\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nUnder general supervision, this role will provide weekly / monthly forecasting to 3rd party vendors based on call volume and other metrics to insure adequate coverage of support. Provide operational support for Call Center technology functions including Inbound &amp; Outbound Calls, email, Chat and back office functions. Administer Workforce Planning technology and processes to optimize the quality and efficiency of service delivery. Provide operational input into strategic planning for future growth opportunities. Recommend and implement operational improvements as well as adhere to operational practices and procedures.\n<br><br>\nKey Responsibilities\n<br><br>\nResponsible for the development of short and long term forecasting.\n<br><br>\nResponsible for call center reporting, making recommendations, analyze support metrics and identify trends in relation to call volume.\n<br><br>\nAnalysis of large data sets\n<br><br>\nAccountable for identifying ongoing call center staffing needs and interfacing with HR to maintain appropriate staff levels.\n<br><br>\nResponsible for benchmarking call center practices within and outside of Software Support industry.\n<br><br>\nSupports continuous improvement to achieve consistently excellent client and employee satisfaction; identifies and recommends improvements in processes, procedures and tools usage.\n<br><br>\nCommunicate and provide feedback effectively to Customer Support management team\n<br><br>\nEnsure all tools, processes and procedures are properly documented\n<br><br>\nLead and participate in cross-functional project teams; lead and provide feedback to analysts and managers who are not direct reports\n<br><br>\nProtect company proprietary and confidential information\n<br><br>\nEducation/Experience (related experience)\n<br><br>\n3+ years of call center operations experience preffered\n<br><br>\nStrong background supporting the use of ACD (preferably Avaya Systems)\n<br><br>\nStrong critical thinking and problem solving skills\n<br><br>\nExperience with Workforce planning software such as Blue Pumpkin/Verint (Impact 360) highly desired\n<br><br>\nExperience in support in both a Field Repair Service and Technical environment preferred\n<br><br>\nExperience in a multi-site environment, preferably the startup of additional sites preferred\n<br><br>\nExperience in vendor migration and/or major upgrades preferred\n<br><br>\nExperience in vendor MSA/SOW set up and management preferred\n<br><br>\nLG Electronics, USA Inc.; LG Mobilecomm USA, Inc., LG Mobile Research USA LLC, and Zenith Electronics LLC provides equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law. Further, the Company takes affirmative action to ensure that applicants are employed and employees are treated during employment without regard to any of these characteristics."}