{"job title": "Data Scientist", "company": "Lieberman Research Worldwide", "city state": "– Los Angeles", "rating": "3.2", "job description": "<div> <div>LRW is looking for a Data Scientist who is passionate about delivering big impact and solving complex business problems. You have an entrepreneurial mindset - you see opportunities to improve something and take them.&nbsp;\n<br>\n<strong>&nbsp;</strong>\n<br>\nOur small Data Science group has three core functions:\n\n<ul>\n<li>Maintain a production-oriented analytics platform for our world class Marketing Science team</li><li>Tackle predictive modeling engagements using client provided data from major global brands</li><li>Deploy machine learning techniques for efficiency gains in LRW’s day to day operations</li>\n</ul>\n\n<strong>&nbsp;</strong>\n<br>\nWe’re all good at what we do, and we care about doing great work while having fun. We’re committed to growth and personal development, and you’ll have plenty of opportunities to learn new skills.\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>Role</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\nYour role will encompass three main areas of responsibility:\n\n<ul>\n<li>Develop automation regarding production-oriented analytics such as regressions, correlations, factor analyses, and clustering of survey data, from data processing/manipulation through analysis and result visualization</li><li>Recommend and execute predictive analytic and model delivery approaches for client engagements that involve non-survey data, including but not limited to transaction/sales data and social media metrics</li><li>Familiarize yourself with the life-cycle of a typical research project from proposal to report delivery, looking for opportunities to inject machine learning and predictive analytics into the process for greater efficiency</li>\n</ul>\n\n<strong>&nbsp;</strong>\n<br>\nOn most projects, you’ll be working in a cross-functional capacity that may include other developers from different teams. You’ll have the right amount of support from your teammates, with enough flexibility and autonomy to try new things. You’ll use your unique skill set to guide the product owners in making the right long-term decisions to solve their business problems.\n<br>\n<strong>&nbsp;</strong>\n<br>\nWe also work on R&amp;D projects, and you may be experimenting and working through ambiguous requirements. You’ll try new things and collaborate with the team to create solutions and define best practices.\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>What we worked on last year</strong>\n<br>\n<strong>&nbsp;</strong>\n\n<ul>\n<li>Developed R packages that processes millions of URLs visited by respondents, allowing them to be classified and analyzed for insight into web browsing behavior</li><li>Built a scalable cloud-based analytics platform that houses production routines designed for our Marketing Science team</li><li>Leveraged DNA sequencing algorithms and machine learning routines to categorize various paths to purchase and project attitudinal classifications onto client databases</li>\n</ul>\n\n<strong>&nbsp;</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>What We Offer</strong>\n<br>\n<strong>&nbsp;</strong>\n\n<ul>\n<li>A culture of unlimited opportunity to grow, learn, try new things, and truly have transformational impact on the organization</li><li>Wellness events like yoga, pilates, and nutrition counseling</li><li>A fun, close-knit team with opportunities to both teach and learn across a variety of disciplines</li><li>Walking distance to plenty of food options, including a weekly Farmer’s Market with the best fish tacos</li><li>Bagel Fridays</li><li>Annual merit-based bonuses</li>\n</ul>\n\n<strong>&nbsp;</strong>\n<br>\n<strong>Skills &amp; requirements</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\nIdeal Candidate\n<br>\nThe ideal candidate will be technically deep, have the desire to continue learning new platforms and technologies, work well within a team, and be a great communicator.\n<br>\n<strong>&nbsp;</strong>\n<br>\nTo be considered for this position, you must have:\n\n<ul>\n<li>Master’s degree or equivalent in Computer Science, Data Science, Computational Mathematics or related fields</li><li>At least one to three years of experience with modeling structured and/or unstructured data, leveraging such techniques as penalized regression, multinomial logit, multilevel modeling, ensemble models, or time series models. PhD in previously mentioned fields with exposure to such techniques is acceptable in lieu of experience</li><li>Proficiency with R or Python, associated packages concerning predictive analytics, and visualization libraries such as Shiny and Plotly</li><li>Experience with SQL</li><li>Passion for technology and a high technical aptitude</li><li>Insightful and always looking for great ideas</li><li>Self-sufficient</li><li>A desire to keep learning and to teach what you know</li><li>Precise and efficient communicator</li>\n</ul>\n\n<strong>&nbsp;</strong>\n<br>\nAdditional experience in the following is a plus:\n\n<ul>\n<li>Experience modeling marketing, business intelligence, or market research data</li><li>NoSQL and graph database experience</li><li>Familiarity with cluster computing leveraging platforms such as Hadoop and Spark</li><li>Proficiency in techniques and technology regarding machine learning, artificial intelligence, data mining and optimization such as neural networks, Bayesian networks, decision trees, random forests, and libraries such as TensorFlow</li>\n</ul>\n\n<strong>&nbsp;</strong>\n<br>\nOur Technologies\n<br>\n<strong>&nbsp;</strong>\n<br>\n/ R / Python / JSON / JavaScript Jupyter / GitHub / Team City / Docker / Microsoft SQL Server / Amazon Web Services\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>About Lieberman Research Worldwide\n<br>\n<strong>&nbsp;</strong>\n<br>\nLRW is a global force in the full-service custom market research field, recently being ranked as one of the Top 25 Global Research Firms by Marketing News. Partnering with Fortune 500 Companies we are able to provide insight and have impact on real world business problems. We specialize in strategic development, new product development and testing, advertising, customer satisfaction, and tracking research. LRW conducts both qualitative and quantitative research studies and has comprehensive experience across a wide range of industries. Through its main offices in Los Angeles (global headquarters) and London (European headquarters), and its affiliate network of more than 60 companies, LRW conducts research in over 80 countries worldwide.\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong>&nbsp;</strong>\n<br>\nWorking Conditions: LRW is a professional office environment, and employees use standard office equipment (occasional lifting up to 15 lbs). Conditions to include prolonged sitting, normal degree of walking, and up to 15% local and national travel, unless specified otherwise.\n<br>\nLRW is an equal opportunity employer, and does not discriminate against any employee or applicant because of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition, or any other basis protected by law. It is our policy to comply with all applicable national, state and local laws pertaining to nondiscrimination and equal opportunity. Further, the functions, specifications, physical demands, and work environment listed in this job description represent the essential functions of the job which the incumbent must be able to perform either with or without reasonable accommodation. The listed functions and responsibilities do not necessarily include all activities that the incumbent may perform.\n<br>\n&nbsp;</strong></div></div>"}