{"job title": "computational imaging research scientist", "company": "Light", "city state": "– Palo Alto", "rating": "4.9", "job description": "<div><div>Light is pioneering the era of the software-defined camera. Powered by sophisticated computational processes, software-defined cameras deliver intelligent, high-quality imaging at cost-effective, global scale. Light’s first product, the award-winning L16 Camera, has eliminated the quality or convenience dilemma that has plagued photographers for a century. Light’s foundational technologies, including its Lux Capacitor camera control chip and its Polar Fusion Engine for multi-image processing, are licensed for use in applications like smartphones and beyond. To learn more about Light, visit light.co.</div><div>The Computational Imaging (CI) Team welcomes innovative engineers who want to implement their inventions in a fast-paced, collaborative team environment. This is a unique opportunity to translate state-of-the-art research into consumer applications.</div></div><div><div>Requirements\n\n<ul>\n\n\n<ul>\n<li>Ph.D. degree in Computer Science, Electrical Engineering, Imaging Science, or equivalent</li> <li>Specialization in computational imaging, computational photography, image processing, or computer vision</li><li>Expertise in these areas: multiple view geometry, image fusion, computational photography, super-resolution, image quality</li><li>Expertise in algorithm development and implementation</li></ul>\n</ul>\n\n</div>\n</div><div><div>Preferred Skills\n\n<ul>\n\n\n<ul>\n<li>Excellent programming skills in C/C++</li> <li>Fluency with Python is desirable</li><li>Proficient with computer vision software tools such as OpenCV</li><li>Significant international publications and/or patents</li><li>Familiarity with image sensors, optics and lens design</li><li>Must be currently living in the US</li></ul>\n</ul>\n\n</div>\n</div><div><div>It would increase your cool factor if you...\n\n<ul>\n\n\n<ul>\n<li>know how to take beautiful photos</li><li>like to learn about new camera tech</li><li>have a discerning eye for superb photography</li></ul>\n</ul>\n\n</div>\n</div><div><div>This full-time role based at Light's Palo Alto headquarters is ready to be filled immediately.</div> <br>\n<div>Light is pushing the boundaries of camera technology, making beautiful photography more accessible than ever before. The Light L16 camera combines advanced optics with powerful software to enable anyone to shoot, edit and share high-quality pictures.</div><br>\n<div>To reimagine photography, visit: https://light.co/.</div><br>\n<div>We appreciate your interest in Light!</div><br>\n<div>Individuals seeking employment at Light are considered without regard to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation.</div> </div>"}