{"job title": "Data Analytics Developer / Data Scientist", "company": "Lightspeed Systems", "city state": "– Austin, TX", "rating": "4.2", "job description": "<p>With millions of happy users, a growing product line, and a new state-of-the-art office, Lightspeed Systems is quickly evolving -- and there has never been a more exciting time to work here. Do you want your hard work to be rewarded with excellent benefits, fun perks, a collaborative office environment and a meaningful career? Do you want to sharpen and expand your skills within an innovative, fast-growing company? Then work — and grow — with us.</p>\n<p>As a <strong>Data Analytics Developer</strong> at Lightspeed Systems, you’ll help us discover the information hidden in vast amounts of data and help us make smarter decisions to deliver even better products. Your primary focus will be in applying machine learning techniques to discover insights in our data and developing software that integrates those insights into our products.</p>\n<p>What can you expect as part of the Lightspeed Systems team? Expect to join a passionate team and to be a true contributor (there’s no hiding behind bureaucracy). Expect to love coming to work, but to work with people who understand the importance of play, family, and community too. Expect to <em>think</em> outside boxes, <em>solve</em> real problems, and <em>change</em> how technology is used in schools around the world.</p>\n<p><strong>ABOUT THE ROLE:</strong></p>\n<ul>\n<li>Curating and organizing structured and unstructured data into feature sets for applying machine learning techniques.</li>\n<li>Building and automating production pipelines and integrating machine learning output into new and existing products.</li>\n<li>Developing production quality code that deliver value to our customers.</li>\n<li>Communicate with internal and external clients to enhance data footprint relevant to improving customer decision making capabilities.</li>\n<li>Processing, cleansing, and verifying the integrity of data used for analysis.</li>\n<li>Perform ad-hoc experiments, analysis, and customer research, presenting findings in a clear, concise manner to a number of internal and external stakeholders.</li>\n</ul>\n<p><strong>ABOUT YOU - KNOWLEDGE, SKILLS &amp; ABILITIES</strong></p>\n<ul>\n<li>Ability to work in an environment with a significant number of unknowns – both technically and functionally</li>\n<li>Experience with traditional data stores (PostgreSQL, SQL Server, MySQL), NoSQL datastores (Cassandra, DynamoDB), and file system stores (HDFS, S3)</li>\n<li>Great communication skills with the ability to tell a story from your work</li>\n<li>Wicked good skills when it comes to scripting and programming languages (Python, R, PHP, C, Bash)</li>\n<li>Ability to leverage your scripting and programming skills (ex: Python, PHP, C, Bash) in order to deliver applications that deliver features that provide value to our customers</li>\n<li>BS or MS degree or equivalent experience</li>\n<li>5+ years experience developing software features leveraging analytics and machine learning in order to provide customer value</li>\n</ul>\n<p><strong>ABOUT US</strong></p>\n<p>Education is undergoing a technology revolution with new devices and tools being added to the classroom every day and IT departments are responsible for keeping all this technology managed, safe and working. That is where we come in! Lightspeed Systems, ed-tech provider and leader in K-12 device filtering for almost 20 years, partners with schools to make learning safe, managed and mobile. Learn more at www.lightspeedsystems.com.</p>"}