{"job title": "Principal Research Scientist", "company": "Lilly", "city state": "– Indianapolis, IN", "rating": "3.8", "job description": "<ul>\n<li>*45598BR**</li>\n<li>*Responsibilities:**</li>\n</ul>\n\nAre you are Scientist or Engineer passionate about strategic regulatory guidance? Do you seek opportunity to work in new product development, lead regulatory strategy &amp; submission process, and support throughout a products lifecycle? If so, a role within Regulatory is calling for you.\n<br><br>\nGlobal Regulatory Affairs leads the creation of regulatory strategy that expedites product development, improves the probability of success and mitigates risks. Scientists exercise considerable judgment in determining approach and then researches, prepares, and submits required regulatory documentation including those in response to inquiries during the regulatory review process. Daily utilization of regulations, guidelines, and regulatory precedence to expedite the development and delivery of products to improve the patient experience is integral to the role.\n<br><br>\nThis position will support medical device products involved in digital health technology, which may include software as a medical device (SaMD), mobile medical apps and/or embedded software (SiMD) as part of electromechanical device or combination product. You will work in a collaborative team across multiple functions to integrate a successful regulatory strategy; developing and maintaining effective and mutually positive relationships across Lilly businesses, functions, partner companies, and with the FDA. Needs to demonstrate creative vision and skill to lead teams and mentor peer Regulatory staff. Every single day you will....\n<br><br>\nIntegrate information from the external environment, product specific regulator advice, and other public information/trend to develop, review and approve robust regulatory strategies.\n<br><br>\n+ Pursue a clear understanding of the needs and wants of the regulator and incorporate into regulatory strategies with improved patient outcomes mindset\n<br><br>\n+ Lead development and provide critical review of regulatory documents for medium to high complexity strategies / submissions. Ensure the regulatory document contains appropriate data/information and is written clearly to articulate Lilly?s product development strategy.\n<br><br>\n+ Monitor upcoming and recent approvals of competitive development programs/plans.\n<br><br>\n+ Anticipate and provide regulatory expertise to identify, prevent, and solve complex regulatory issues for clinical and product development.\n<br><br>\n+ Serve as an internal SME for regulatory guidance documents within and outside of business unit focus.\n<br><br>\n+ Actively seeks to deepen regulatory knowledge through constant learning and identifying gaps in expertise\n<br><br>\n+ Translate business unit needs / patient needs into product requirements and defined product specifications that support intended use and indication for use.\n<br><br>\n+ Approve documents that support the clinical or product development process and review analysis of how documents relate to regulatory strategy.\n<br><br>\n+ Provide high quality, timely, and decisive regulatory advice that enables business partners to make well-informed decisions on development or lifecycle planning.\n<br><br>\n+ Execute high quality communications demonstrated through interactions with FDA and internal customers to articulate and ensure understanding of the regulatory strategy, pathway, submission requirements and complex issues. Accountable for communications to the regulator, product teams, and Global Regulatory Affairs (GRA) management.\n<br><br>\n+ Understand and communicate the benefits and risks of the product and ensures addressed in risk assessments. Assess products risks and effectively communicate the regulatory probability of success to set appropriate internal expectations.\n<br><br>\n+ Work collaboratively with peer regulatory functions (e.g. labeling, drug clinical regulatory, adpromo, etc)\n<br><br>\nYour ability to influence the early lifecycle development, apply lessons learned, from other product development and competitor knowledge is crucial. In this role you should be able to....\n<br><br>\n+ Work effectively with internal and external organizations to assess regulations for potential new products and influence the development work to meet regulatory expectations.\n<br><br>\n+ Balances time across product development projects, industry group engagement, external influence strategic initiatives, and continuous improvement.\n<br><br>\n+ Create and lead in an environment that encourages open discussions on issues to achieve a robust outcome on project decisions. Constructively challenge teams to reach the best solutions to issues. Serve as a regulatory technical/strategic leader in a crisis/ issue management team, as needed.\n<br><br>\n+ Build, maintain, and leverage relationships with customers (particularly with FDA), team members, and partner companies as appropriate.\n<br><br>\n+ Identify and delegate tasks to others on the regulatory team. Serve as a mentor for other regulatory personnel and participate in forums that share regulatory information across the regulatory organization and broader development organization.\n\n\n<ul>\n<li>*Req ID:**</li>\n</ul>\n\n<strong>45598BR</strong>\n\n\n<ul>\n<li>*Additional Skills/Preferences:**</li>\n</ul>\n\n+ Knowledge of FDA procedures and practices across Review Divisions and awareness of evolving regulatory reform initiatives\n<br><br>\n+ Experience in leading regulatory strategy development and regulatory submissions for medical devices.\n<br><br>\n+ Demonstrated deep knowledge of the product development process, regulatory/business strategies and plans\n<br><br>\n+ Demonstrated ability to assess and manage risk in a highly regulated environment\n<br><br>\n+ Demonstrated ability to organize key messages and connect rationale that supports or highlight risks of gaps in written, spoken, and presentation communication skills.\n<br><br>\n+ Demonstrated negotiation and influence skills\n<br><br>\n+ Demonstrated attention to detail and solution based problem solving\n<br><br>\n+ Demonstrated effective teamwork skills; able to adapt to diverse interpersonal styles\n<br><br>\n+ Experience in diabetes disease.\n<br><br>\n+ Extensive experience with preparing strategies, conducting FDA interactions and successfully securing a number of FDA clearances and/or approvals (510(k), IDE, PMA).\n<br><br>\n+ Knowledge and experience with connected medical devices, and various trial designs; normal volunteer, human factor, clinical research studies, support iterative device development, approval, reimbursement, and market adoption.\n<br><br>\n+ Knowledge &amp;/or experience of Regulatory roles with responsibility\n<br><br>\n+ Application of risk assessments, analysis, building FMEAs, FTA, and Safety Assurance Cases.\n<br><br>\n+ Experience in design standards and verification and validation.\n<br><br>\n+ Designing &amp; developing consumer medical devices / home health solutions, including Human Factors requirements and testing.\n<br><br>\n+ Advanced degree, degree in Engineering or Science\n<br><br>\n+ Knowledge of Good Clinical Practices (GCP) regulations and/or experience with clinical study development, clinical trial applications, IRBs, protocols, execution, and/or report summaries.\n<br><br>\n+ Proven learning agility, strong level of curiosity and willingness to learn.\n\n\n<ul>\n<li>*Additional Information:**</li>\n</ul>\n\n+ Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.\n\n\n<ul>\n<li>*Workplace Arrangement:**</li>\n</ul>\n\nLocal\n\n\n<ul>\n<li>*Title:**</li>\n</ul>\n\nPrincipal Research Scientist - Clinical Trials\n\n\n<ul>\n<li>*Job Category:**</li>\n</ul>\n\nScience\n\n\n<ul>\n<li>*Basic Qualifications:**</li>\n</ul>\n\n+ Bachelor degree in science or engineering related field with 7-10 years of increasing responsibility in medical device product development, including experience in development and execution of medical device clinical trials.\n<br><br>\n+ 7-10 years industry-related experience in regulatory affairs submissions, clinical and device development, 3-5 yrs. of which include FDA interactions.\n\n\n<ul>\n<li>*Company Overview:**</li>\n</ul>\n\nAt Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We?re looking for people who are determined to make life better for people around the world.\n\n\n<ul>\n<li>*City:**</li>\n</ul>\n\nIndianapolis\n\n\n<ul>\n<li>*Country:**</li>\n</ul>\n\n<strong>USA</strong>\n\n\n<ul>\n<li>*State / Province:**</li>\n</ul>\n\nIndiana\n\n\n<ul>\n<li>*Region:**</li>\n</ul>\n\nNorth America"}