{"job title": "Data Scientist", "company": "Limebike", "city state": "– Redwood City, CA", "rating": "4.1", "job description": "<ul>\n<li>Create comprehensive and insightful analyses describing user, operator, and hardware behavior</li>\n<li>Perform ad-hoc querying and create/repair DAGs as needed</li>\n<li>Build charts and dashboards and guide productionization of data pipelines</li>\n<li>Use state of the art machine learning and advanced modeling techniques to generate decisions from signals</li>\n<li>Productionize machine learning techniques to directly enhance the product experience</li>\n<li>Gather heterogenous data and make it fit for human consumption</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>2+ years in a data scientist role, with a track record of performance</li>\n<li>M.S. or Ph.D. in math, physics, statistics, engineering or economics</li>\n<li>Fluency in SQL, data querying, and a scripting language</li>\n<li>Ability to unblock any analysis or pipe from a technical standpoint as needed</li>\n<li>Expertise in at least one stats program of your choice: STATA, R, Matlab, etc.</li>\n<li>Deep and practical understanding of probability and statistics</li>\n<li>Practical understanding on how to tune modern M/L algorithms</li>\n</ul>\n\nWhat We Offer\n\n\n<ul>\n<li>Competitive salary and incentives. Base + Equity</li>\n<li>San Mateo HQ; SF optional office</li>\n<li>Flexible hours - We don't value face time as much as getting things done</li>\n<li>Medical, dental, vision, lunch+dinner, snacks, the works</li>\n<li>Scale with a rapidly growing organization, with tons of opportunity for growth</li>\n<li>Play a role in the transformation of urban mobility and sustainability</li>\n<li>Work with a team of fun and motivated coworkers</li>\n</ul>\n\nWe here at Lime strive to build a workforce comprised of individuals with diverse backgrounds, abilities, minds, and identities that will help us to grow, not only as a company, but also as individuals. Lime is an Equal Opportunity Employer."}