{"job title": "Data Scientist, I", "company": "Live Nation Entertainment", "city state": "– Hollywood, CA", "rating": "3.5", "job description": "Job Summary:\n<br><br>\n<strong>Who are we?</strong>\n<br><br>\nTicketmaster, a proud division of Live Nation Entertainment, is the world's leading live event high tech ticketing company selling nearly 455 million tickets each year, supporting over 145,000 events and more than 12,000 clients in 21 countries worldwide. At Ticketmaster, we power the people who create culture through live events, connecting more passionate fans to those experiences than anyone else. We are innovators that embrace change and work hard to help others succeed. We believe in open communication and stress accountability, because fans and clients count on us every day. We strive for ease of use for our clients and fans while seeking out those who have a bias for action versus a desire for directives.\n<br><br>\n<strong>Why Ticketmaster?</strong>\n<br><br>\nA career at Ticketmaster will challenge and engage you. The pace here is fast, the atmosphere is fun and a passion for live events is a common thread that ties us together. As a global and growing business, we can truly offer a world of opportunities to expand your skills and develop your career. Visit any of our offices and you'll find a diverse mix of passionate employees, helping fans around the globe connect with the artists, teams and events they love. It truly is a unique and rewarding environment. See and hear more about why you should consider joining our rock-star team: recruiting video\n<br><br>\n<strong>The Role:</strong>\n<br><br>\nAt Ticketmaster, we are building a new platform for live entertainment. Over the past 4 years, our API has gone from a $1 million/year to $1 billion/year, including through mobile initiatives. Today we sell tickets not only on Ticketmaster.com but on partner e-commerce sites and the biggest social networks. As we continue to grow we need <strong>outstanding Data Scientists</strong>. That’s where you come in.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Be part of a dynamic, highly-focused team that is responsible for providing machine-learning insights and products that engage TicketMaster's 170+MM users</li><li>Designing and implementing machine learning algorithms ranging from feature engineering, feature selection, clustering, predictive scoring and classification</li><li>Support the analysis of the value of various marketing channels in order to support appropriate allocation of resources.</li><li>Support feature engineering and modeling for demand, pricing and sales forecasting.</li><li>Carry out rigorous model validation and model tuning/optimization as part of the natural model life-cycle</li>\n</ul>\n<br><br>\n<strong>Qualifications:</strong>\n<ul>\n<li>2+ years of SW development with a high-level programming language like: Java, C/C++, Python</li><li>Strong machine learning background both on supervised and unsupervised algorithms</li><li>Experience with state of the art machine learning tool kits and algorithms (e.g., Vowpal Wabbit (VW); scikit-learn; Tensorflow)</li><li>2+ years of industry experience, or equivalent and pertinent course work</li><li>Proficient in SQL and RDBMS's</li><li>Experience with/knowledge of frameworks like Hadoop, Pig is desirable</li><li>Education: MS/Ph.D. In CS, Math or Statistics</li><li>Effective communication skills and enjoying work as part of a team</li>\n</ul>\nIf the above description sounds interesting to you and fits your background, apply online at www.livenationentertainment.com/careers to join the Ticketmaster team today!\n<br><br>\nApplicants for employment in the U.S. must possess work authorization which does not require sponsorship by the employer for a visa.\n<br><br>\n<strong>EQUAL EMPLOYMENT OPPORTUNITY</strong>\n<br>\nTicketmaster strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law.\n<br><br>\n<strong>HIRING PRACTICES</strong>\n<br>\nThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.\n<br><br>\nTicketmaster recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Ticketmaster may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, Internet recruiting, job fairs, college recruiting and search firms."}