{"job title": "Data Scientist", "company": "Livongo", "city state": "– Mountain View, CA", "rating": "4.4", "job description": "<div><strong>Why Join Livongo?</strong></div><div></div><div><strong>Now Better Than Ever with Retrofit!</strong></div><div></div><div><strong>Come for the Mission</strong>: As a trailblazing innovator in digital healthcare, Livongo offers uniquely effective prevention and treatment solutions for chronic conditions. Were connecting the pieces of the healthcare puzzle: treating and caring for the whole person physically and emotionally extending care and support beyond the doctors office, and applying real-time data to real-time solutions, across multiple conditions. Were experiencing astronomical growth, as evidenced by our recent acquisition of Retrofit. Our success stems from our proven ability to make a real, measurable improvement in peoples lives and health.</div><div></div><div><strong>Make an Impact:</strong> Top candidates are attracted to Livongo because they want their work to have impact. They want to accomplish something meaningful and make a tangible difference in other peoples lives. We combine smart digital technology with real-time, personal connections, to create amazing support and coaching systems that offer weight management, disease prevention, diabetes and hypertension solutions with new breakthroughs under development all the time. The chronic conditions we address are currently costing the U.S. hundreds of billions of dollars, and our solutions reduce these costs while simultaneously improving outcomes, through platforms that people love using.</div> <div><strong>We Believe in Our People:</strong> Like our health solutions, our working environment is people-centric. We focus on our members, our clients, and our employees. If were good to those folks, well succeed. We bring passion and excitement to the workplace, creating an inspiring environment powered by smart, fun, passionate individuals with wildly diverse professional backgrounds.</div> <div><strong>We Are the Next Billion-Dollar Startup</strong> according to Forbes in their 2017 top 25 young companies list. Join us during this period of dynamic growth and innovation and help Livongo revolutionize the healthcare industry, impacting millions of lives around the world.</div><div></div><div><strong>The Opportunity</strong></div><div>Come to work for a forward-thinking, paradigm-busting company that applauds the analytical mind. This cutting-edge Data Scientist role breaks the standard mold, giving you the chance to apply strategic ingenuity and innovation along with modelling expertise.</div><div>Your skills will shine in this important tech role, as you step into place as our domain expert on Livongo data, in all of its subtle nuances.Youll collaborate closely with other analysts, data scientists, engineers, PMs, clinical researchers and client-facing teams to discover, design and build impactful visualizations, insights, products and tools that will drive Livongos client growth and retention. Through your analytical ingenuity we can enhance and communicate the Livongo value proposition.</div><div>Your efforts will directly assist our team of industry innovators and thought-leaders in Product, Sales and the Leadership team, as they work to change the lives of people with chronic health conditions, and revolutionize the healthcare industry as a whole. Leverage your analytical mind to help us achieve mission-critical objectives and solidify the foundation for future success</div>Responsibilities:\n\n<ul>\n<li>Work with R, SQL, Jaspersoft, Metabase and other technologies to create intuitive and compelling visualizations and data stories which communicate the Livongo value proposition</li><li>Develop data visualizations in R with a wow factor, managing the process from inception to production</li><li>Develop scaled, automated reporting with complex logic to determine the best insights, visualizations and story for each client</li> <li>Capture, infer and anticipate business needs, prioritizing, scoping and advocating for the best projects to meet those needs in the quarterly planning processes</li><li>Perform ad hoc statistical analysis and identify meaningful cohorts</li> <li>Identify opportunities to advance and optimize Livongos data quality and analytic rigor, helping increase the operational efficiency of our code base and exceed client expectations</li> <li>Write complex and efficient SQL queries</li>\n</ul>\n\nCandidate Profile\n\n<ul>\n<li>Experience conceiving and building meaningful data visualizations which communicate a story simply and elegantly</li><li>Expert R development skills and a passion for seeking out new packages to optimize code and visualizations, with proven results</li><li>Specific experience working on data-driven products</li><li>Exceptional ability to write efficient SQL (Redshift)</li><li>Great attention to detail and a knack for prioritizing competing objectives</li><li>Both the analytical and business sense that enable you to solve real-life business problems with data</li> <li>Strong communications and collaboration skills</li> <li>An ability to overcome business challenges and get amazing amounts of important work done</li><li>A self-starter approach, as well as a passion for teamwork</li><li>A drive find a career path that enables your work to have positive social impact</li><li>Fundamental respect for all people</li>\n</ul>\n\n<strong>Impress us even more:</strong>\n\n<ul>\n<li>An undergraduate or graduate degree in a STEM field</li><li>Experience in the healthcare industry</li>\n</ul>\n\n<div>Livongo Health is on a mission to change how healthcare is delivered to people with chronic conditions around the world, starting with diabetes in the US.</div><div>We are creating a smart data cloud capable of collecting and processing millions of data points from wearable devices, EHRs, and our cellular-connected blood glucose meters. We are also building delightful web and mobile front-end apps to provide consumers with intelligent workflows and visualizations to manage their chronic conditions effectively.</div><div>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div>"}