{"job title": "Research Scientist", "company": "Lockheed Martin", "city state": "– Fort Worth, Texas", "rating": "3.6", "job description": "<strong>Description:</strong>Component level signature analysis, component and air vehicle level test and evaluation execution, production line and sustainment affordability / availability improvement project plan execution from a Signature Integration perspective, production line and field non-conformance disposition coordination for Signature Integration Team. Radio Frequency Special test equipment use on site, US sites and at international locations. US and International travel likely. Although normal shift hours are specified, sporadic weekend and alternate shift work flexibility required to support production line and field operations.\n<br><br>\n<strong>MUST BE A US CITIZEN . SECRET CLEARANCE REQUIRED.</strong>\n<br>\n<strong>Basic Qualifications:</strong>\n<br>\nExperience with Windows/Linux/Unix and MS Office.\n<br>\nBachelors degree required.\n<br>\nExperience working with projects or programs.\n<br>\n<strong>Desired Skills:</strong>\n<br>\nMatlab experience desired. Entry level Low Observables experience desired. Degreed Electrical Engineering, Mechanical, Physics candidates desired.\n<br>\nJava experience.\n<br>\nExperience using GUI.\n<br>\nExperience working within data analytics and statics.\n<br>\n<strong>BASIC QUALIFICATIONS:</strong>\n<br>\njob.Qualifications\n<br><br>\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nAs a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\nJoin us at Lockheed Martin, where were engineering a better tomorrow.\n<br>\n<strong>EXPERIENCE LEVEL:</strong>\n<br>\nExperienced Professional"}