{"job title": "Data Scientist", "company": "Lockheed Martin", "city state": "– Rochester, New York", "rating": "3.6", "job description": "<strong>Description:</strong> RMS's Analytics, PHM and Artificial Intelligence (APA) Innovations team applies technology, processes and expertise to a wide variety of platform data in order to drive proactive decision-making throughout the business. Data generated from on-board health usage and monitoring systems (HUMS), aircraft operations, and aircraft maintenance is collected, conditioned and analyzed to identify opportunities for improvements to an aircrafts design and supportability. The ultimate business goal of is to increase the availability of supported platforms, reduce operational costs and to enable a strategic business shift to condition-based maintenance. APAs rapidly evolving Analytics Development team functions like a small startup within RMS, rapidly developing solutions in pursuit of these objectives, and working with a wide variety of internal customer and expert groups.\n<br><br>\nThis position will be responsible for the analysis of vast quantities of machine data collected from fleets of complex machines such as engines and helicopters. The applicant is expected to collaborate with other data scientists, engineers, software teams, management, and other stakeholders to conduct data wrangling / mining, perform exploratory analysis, use machine learning to build models, generate visualizations, and create &amp; present reports. The position also entails web application development and database modeling.\n<br>\n<strong>Desired Skills:</strong> • Experience in web application development\n\n\n<ul>\n<li>Familiarity with Hadoop / MapReduce, Pig, Hive, and Spark</li>\n<li>Familiarity with AWS</li>\n<li>Experience with complex computer networks</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Bachelor's or Master's degree in Data Science, Computer Science, Mathematics, Statistics, or equivalent technical field, and be comfortable writing code for data analysis (preferably with Python, Scala, R, or Java).</li>\n<li>Basic theoretical foundation in statistics and machine learning</li>\n<li>Familiarity with standard applied machine learning and data mining techniques</li>\n<li>Experience in data analysis with Python, Scala, R, and/or Java</li>\n<li>Familiarity with data modeling, relational databases and SQL</li>\n<li>Comfort manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources</li>\n<li>Experience with Linux</li>\n<li>Excellent written and verbal communication skills (i.e. the ability to communicate complex analysis with clarity and precision)</li>\n<li>Passionate about empirical research and naturally inquisitive</li>\n<li>Good problem solving and organizational skills</li>\n<li>US Person</li>\n</ul>\n\n<strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</strong>\n<br>\nAs a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.\n<br><br>\nJoin us at Lockheed Martin, where were engineering a better tomorrow."}