{"job title": "Data Architect", "company": "Loma Linda University", "city state": "– Loma Linda, CA", "rating": "3.5", "job description": "<strong></strong><div><strong></strong><div><strong>Job Summary:</strong>\n<br>\n\n<br>\nThis position will support LLUSS's strategic plan and the organization's mission to continue the teaching and healing ministry of Jesus Christ, while embracing the core values of Compassion, Integrity, Excellence, Teamwork, and Wholeness. Reports to the Executive Director-Application Services. Provides strategic direction and the technical expertise needed to meet the data architecture needs of Loma Linda University Health System, via an enterprise data warehouse, which reflects the scope, services and managed populations. Responsible for providing detailed direction to the design, development, implementation and maintenance of data repositories populated by clinical information and administrative systems (revenue cycle, business needs). Supports the Leadership of process improvement and analytics initiatives. Performs other duties as needed.\n<br><br>\n<strong>Job Specifications:</strong>\n<br>\n\n<br>\nUnderstanding of data and database architecture principles. Understanding of database management systems. Understands and applies HIPPA standards and regulations to all areas of work. Able to read, write and speak English with professional quality; use computer, printer, computer programming, Microsoft applications, and other software programs necessary to the position. Must be able to write computer scripts. Able to develop and maintain large complex database applications in Access, SQL Server, etc. Must possess an in-depth knowledge of interfaces and extracts for healthcare (X12, HL7). Ability to collaborate with business users, clinicians, operational business owners and technical staff members and others to develop project requirements that lead to successful design, development and implementation. Has a strong sense of customer service. Experience consistently and effectively addressing customer needs. Is comfortable interacting with peers and colleagues at various levels of the organization. Ability to develops, tests and implements moderately complex automated extract, transformation and load routines using tools such as Unix, Kornshell scripting, SQL, PL/SQL, Data stage, Data junction. Excellent written and verbal communication skills. Ability to articulate and follow industry-standard software development life cycle (SDLC) processes and procedures. High School Diploma or GED required. Associate's Degree in a technology-related field, healthcare IT related field required or minimum of five years of experience in lieu of education required. Minimum five years of experience developing logical and physical data models in a large data warehousing environment required, preferably in a clinical or hospital setting. Valid California Drivers Licensure.\n<br><br>\nKeywords: Data Scientist; BI Architect; BI Engineer; HANA; Data Visualization; SQL Developer</div>\n</div>"}