{"job title": "Data Scientist", "company": "LovePop", "city state": "– Boston, MA", "rating": "4.2", "job description": "<div><div>Lovepop is on a mission to create one billion magical moments and the best place in the world for hungry, creative problem-solvers. We are looking for a Data Scientist to join Lovepop’s Internal Platforms team to take ownership of our inventory process. This group is the backbone to Lovepop’s operations, leveraging existing physical infrastructure and using technology, to build new in-house capabilities. You will be helping to build a system to automatically manage, optimize, and forecast our inventory operations across multiple factories, distribution centers, and sales channels. The system needs to update and learn its plan constantly based on ever changing demand.</div><br>\n\n<div><div>What you'll do here:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>Develop and implement a method for automatically creating manufacturing schedules for Lovepop factories that ensures that the correct inventory is available at the right times - from raw materials to finished goods</li><li>Develop and implement a method for the fulfillment of customer orders (e-com, retail, and wholesale) through a multi-warehouse distribution system using a frequently changing array of shipping options and available inventory</li><li>Take ownership of tactical inventory communication with both external and internal stakeholders (factories, 3PLs, sales channels, customer happiness, etc.) with the goal of rapidly automating or eliminating the need for as many touch points as possible</li></ul>\n\n</ul>\n\n</div>\n<br>\n<div><div>What you'll bring to the table:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>Master’s or PhD degree in math, engineering, computer science or relatedMinimum of 2 years of relevant experience (for Phd applied research counts)</li><li>Working knowledge of a scientific programming language (we use Python/SQL, we are open to candidates who know R and who want to learn Python)</li><li>Willingness and ability to put in flexible hours on nights and weekends as needed (Lovepop operations run around the clock)</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div> You'll be great if you:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>Have past experience in logistics (routing), inventory management or supply chain optimization experience</li><li>Are open-minded and willing to learn new technologies and process</li><li>Bring a methodical, careful and audit-ready mindset with the ability to work in a fast paced startup environment</li></ul>\n</ul>\n\n</div>\n</div></div></div></div>"}