{"job title": "Data Scientist Intern - PhD Student", "company": "Lubrizol", "city state": "– Hazelwood", "rating": "3.7", "job description": "Lubrizol, a Berkshire Hathaway company, is a market-driven global company that combines complex, specialty chemicals to optimise the quality, performance and value of customers’ products while reducing their environmental impact. Lubrizol produces and supplies technologies to customers in the global transportation, industrial and consumer markets. These technologies include lubricant additives for engine oils, driveline and other transportation-related fluids, industrial lubricants, and additives for gasoline and diesel fuel. In addition, Lubrizol makes ingredients and additives for home care and personal care products and pharmaceuticals, and specialty materials, including plastics technology and performance coatings in the form of resins and additives.\n<br><br>\n<strong>Data Scientist PhD Intern</strong>\n<br><br>\n<strong>The Statistics &amp; Data Analytics Team</strong>\n<br><br>\nThe Statistics &amp; Data Analytics department is a focused team with a proven track record of delivering systems that enable highly effective product development via virtual experimentation, optimization and knowledge discovery. In addition, the team provides data science consulting services to the Lubrizol technical community throughout the world. The project work depends on the skills/interests of the intern and the current needs of the department.\n<br><br>\nYou will be part of a cutting-edge data science team that supports Lubrizol’s world class scientists, engineers and business leaders on a global scale.​ Depending on the situation, there is flexibility on internship duration, ranging from 12 weeks to 6 months or even longer.\n<br><br>\n<strong>Some past projects:</strong>\n\n<ul>\n\n\t<li>Application of coregionalised Gaussian processes for transfer learning</li>\n<li>Development of an optimisation approach utilizing genetic algorithms</li>\n<li>Nonlinear and group feature selection</li>\n<li>Evaluation of the effectiveness of various machine learning algorithms when applied to Lubrizol problems</li>\n<li>Mining complex data for critical formulating or testing insights</li>\n<li>Assisting members of the department with data science and statistical consulting tasks</li>\n</ul>\n<strong>What tools do you need for success?</strong>\n\n<ul>\n\n\t<li>Enrolled in PhD program such as statistics, data analytics, machine learning</li>\n<li>Good statistical and programming skills with the ability to work effectively with complex data</li>\n<li>Interest and experience in advanced statistical modeling/machine learning methods</li>\n<li>Curiosity and creativity</li>\n<li>Ability to interact effectively with a wide variety of people including scientists and engineers</li>\n</ul>\n<strong>What we can offer you:</strong>\n\n<ul>\n\n\t<li>Competitive Salary</li>\n<li>Excellent benefits</li>\n<li>Accessible and central location; Derby is a thriving, multi-cultural city with easy access from any location within the UK, free car parking available.</li>\n</ul>\nThe European marketing and technical centre Lubrizol Hazelwood supports an extensive range of clients and Original Equipment Manufacturers across the globe.\n<br><br>\nThe Hazelwood site is located in a rural setting around 8 miles from Derby City centre. With a vibrant and constantly growing list of things to do and see, the city offers something to suit all tastes. Be it lively nights out, a thriving live music scene (Derby recently won the title of ‘the city of festivals!’) an abundance of shops and restaurants, or indeed, getting involved in sports at the Ipro Arena, or the newly opened Velodrome, the choice is endless. If you prefer more peaceful surroundings the beautiful Peak District is right on the doorstep, offering amazing scenery, idyllic country pubs, and fantastic opportunities for outdoor pursuit enthusiasts.\n<br><br>\nYou will find that Lubrizol offer a wealth of career and development opportunities. We employ the very best talent and strive to offer our employees the opportunity to grow and learn.\n<br><br>\nThere is something for everyone who lives and work here……\n<br><br>\nTo learn and see what it is like to work here at Lubrizol Hazelwood, please view our video.\n<br><br>\nFor further information, please visit: www.visitderby.com, www.visitpeakdistrict.com\n<br><br>\n<strong>Job Segment:</strong> \n<br>\n Chemistry, Database, Genetics, Scientific, Intern, Science, Technology, Engineering, Entry Level"}