{"job title": "Data Scientist", "company": "Lubrizol Ltd", "city state": "– Cleveland, Ohio", "rating": "3.5", "job description": "Date: Jul 31, 2018\n<br>\nLocation: Cleveland, Ohio, US, 44092\n<br>\nCompany: Lubrizol Corporation\n<br><br>\nReq ID: 40161\n<br><br>\nLubrizol, a Berkshire Hathaway company, is a technology-driven global company that combines complex, specialty chemicals to optimize the quality, performance and value of customers' products while reducing their environmental impact. Lubrizol produces and supplies technologies to customers in the global transportation, industrial and consumer markets. These technologies include lubricant additives for engine oils, driveline and other transportation-related fluids, industrial lubricants, and additives for gasoline and diesel fuel. In addition, Lubrizol makes ingredients and additives for home care and personal care products and pharmaceuticals, and specialty materials, including plastics technology and performance coatings in the form of resins and additives.\n<br><br>\nDo you have an interest in making an impact to a multi-billion dollar company?\n<br><br>\nAre you passionate about taking on difficult challenges?\n<br><br>\nUse your statistics, data science &amp; computing skills to impact global decision making!\n<br><br>\nThe Lubrizol Corporation has an immediate need for highly motivated, solution-oriented\n<br>\nData Analytics to support our businesses in Wickliffe, Ohio.\n<br><br>\nThe R &amp; D Statistics &amp; Data Analytics Team\n<br>\nOperating like a -up company, but with the backing of a large corporation, the Statistics &amp; Data Analytics team is charged with creating systems that enable highly effective product development via virtual experimentation, optimization and knowledge discovery. In addition, the team provides data science consulting services to the Lubrizol technical community throughout the world.\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\nCreate predictive models by mining complex data\n<br>\nSupport R &amp; D data analytics systems including day-to-day operations and troubleshooting\n<br>\nCollaborate and consult with data scientists and subject-area experts on statistical, data mining, and visualization problems and algorithms, and on system design and implementation\n<br><br>\n<strong>Requirements:</strong>\n<br>\nMasters degree in statistics, data analytics or closely related field; minimum graduate school GPA of 3.6\n<br>\nMinimum of eight statistics courses at the level appropriate for graduate-level statistics majors\n<br>\nAbility to efficiently analyze large complex data\n<br>\nExperience writing complex code in R, Python or SAS; knowledge of JavaScript, relational databases and SQL are added pluses\n<br>\nStrong deductive reasoning skills\n<br>\nCreativity and curiosity with the ability to learn and apply new concepts quickly\n<br>\nAbility to interact effectively with a wide variety of scientists and individuals\n<br><br>\nLocated in a suburb of Cleveland, Ohio, this opportunity is open to early and mid-career candidates including those currently studying and available to join in 2017-2018.\n<br><br>\nLubrizol Benefits\n<br>\nClick Here to Learn About all of Our Benefits!\n<br>\nCompetitive salary with performance based bonus plans\n<br>\n401K Match plus Age Weighted Defined Contribution Plan\n<br>\nCompetitive medical, dental &amp; vision offerings\n<br>\nHealth Savings Account\n<br><br>\nLearn about all the cool things we do by watching our Being Essential video!\n<br><br>\nWith multiple facilities in and around Cleveland, Ohio, Lubrizol is located in one of the largest economic regions in the United States. For the last seven years Lubrizol has been named one of the top workplaces in Northeast Ohio, and in 2016 was judged as the number one workplace by Northeast Ohio's annual Top Workplaces survey. Buzzing with business, culture, knowledge and entertainment, Northeast Ohio is a vibrant place for people of all ages and walks of life to live, learn, work and play. This region offers a little bit of everything for everyone - ethnically-diverse communities, affordable housing, award-winning schools and universities, world-class healthcare, indoor waterparks and zoos, ski resorts, museums, halls of fame, one of the longest water-fronts in the country, and the most concentrated square mile of art, cultural, education and health institutions in the nation. From making your heart race at Cedar Point, to attending a professional sporting event or biking or hiking through over the 100,000 acres of state parks, to catching a Broadway show at Playhouse Square - the second largest performing arts center in the country, you can make it happen right here in Cleveland, Ohio.\n<br><br>\nLubrizol is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.\n<br><br>\nNearest Major Market: Cleveland\n<br>\nNearest Secondary Market: Akron\n<br>\nJob Segment: Chemistry, Database, Scientific, Scientist, Consulting, Science, Technology, Engineering"}