{"job title": "Data Scientist", "company": "Lucid", "city state": "– Greater Salt Lake City, Utah", "rating": "4.7", "job description": "<div>We are a rapidly growing tech startup looking for a Data Scientist to join our Data Science Team at our headquarters in South Jordan, Utah. As a Data Scientist, you will be primarily responsible for developing machine learning pipelines. Your role will involve data wrangling, training and tuning machine learning models, and productionizing the pipeline in order to improve both internal processes and in-product experiences. In order to be a successful data scientist at Lucid you must have a high level of technical ability, an intense passion for problem solving, and excellent communication skills.</div><br>\n\n<div><strong>You will thrive as a Data Scientist at Lucid if:</strong></div><div>1. You enjoy identifying new machine learning opportunities and working closely with the appropriate stakeholders to make those ideas a reality.</div><div>2. You love exploring new tools and improving your technical skills as you identify the best possible solutions to the complex, ambiguous problems you will encounter.</div><div>3. You want to make a significant impact on business operations or user experience with each and every project you complete.</div>Responsibilities\n\n<ul>\n<li>Work with appropriate stakeholders to identify and scope promising applications of machine learning</li><li>Advanced data wrangling, which involves collating, cleaning, and manipulating very large datasets</li><li>Develop highly accurate machine learning models to help improve in-product experiences and drive business growth</li><li>Aid in productionizing projects including, but not limited to, developing API endpoints, creating datasets and associated visualizations, deploying AWS Lambdas, and creating scheduled Airflow jobs</li><li>Basic data engineering, involving developing simple ETL jobs or deploying services on EC2 instances or docker containers</li><li>Drive adoption of data science tools and best practices</li>\n</ul>\n\nBasic Qualifications\n\n<ul>\n<li>Masters degree or PhD in a technical or quantitative field</li><li>Experience working with large data sets</li><li>Intermediate understanding of machine learning</li><li>Excellent Python, R, or Scala skills</li><li>Able to think strategically and tackle open-ended problems</li><li>Detail-oriented, organized, and a good team player</li>\n</ul>\n\nPreferred Qualifications\n\n<ul>\n<li>Minimum of 1-2 years of data science experience</li><li>Excellent Spark or Pyspark skills</li><li>Strong statistical skills and experience with A/B testing implementation and execution</li><li>Can relate to Lucid Software's products and culture</li><li>Can easily thrive working in a fast-paced startup environment</li><li>Driven to meet Lucid Softwares Core Values of Innovation, Passion &amp; Excellence, Empowerment &amp; Initiative, and Teamwork over Ego</li>\n</ul>\n\n<div>At Lucid Software our core values aren't just a pretty inspirational wall hanging. These principles work hard, just like we do. Lucidites use them, every day, whether they're discussing ideas for new projects, deciding on the best solution for a customer's problem, or interviewing candidates. It's just one of the many things that makes Lucid Software the best company to work for. Check out our Life at Lucid page and see how our core values align with yours.</div> <div>We celebrate a diverse and an inclusive work environment, where we honor and support varying backgrounds, beliefs, and perspectives for the benefit of our business, including our employees and products. We are proud to be an equal opportunity workplace that has signed the Parity Pledge and strives to be a place where every Lucidite feels they belong. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.</div>"}