{"job title": "Data Scientist", "company": "LumenData", "city state": "– Silver Spring, MD", "rating": "4.8", "job description": "<div><strong>This is not a Lab Position.\n<br>\nUp to 50% travel may be required depending on the project.</strong></div>\n\n<br><div>LumenData is looking for a Data Scientist to lead client engagements.\n<br><br>\nThis will involve working directly with clients to understand business problems and available data, as well as building Predictive/Machine Learning models to help solve those problems.\n<br><br>\nThe ideal candidate would love this challenge, be comfortable engaging direclty with clients, explaining their work to business stakeholders, and dealing with real-world scenarios. These projects can range from optimizing e-commerce funnels to identifying machine failures in heavy industry.\n<br><br>\nThat’s what makes the Data Scientist role at LumenData so fun and exciting!\n<br><br>\n<strong><em>The successful candidate will be responsible for:</em></strong>\n\n\n<ul>\n<li>Facilitating workshops with business stakeholders to identify customer needs, catalog available systems and data, and design predictive anlaytics solutions</li>\n<li>Data Integration from multiple sources, including SQL and NoSQL databases</li>\n<li>Designing and executing data experiments</li>\n<li>Visualizing data in a way that tells a story</li>\n<li>Feature Engineering on varied data sets</li>\n<li>Implementing Machine Learning/Predictive Analytics models</li>\n<li>Delivering production-ready Data Science projects that achieve customer sign-off</li>\n</ul>\n\n<em><strong>REQUIREMENTS: Technical</strong></em>\n\n\n<ul>\n<li>Demonstrated ability to discuss in detail their work efforts related to real predictive business problems;</li>\n<li>Qualified candidates will have worked on 2 such problems for 2+ months each and be able to describe in detail their work from conception to realization;</li>\n<li>Undergraduate or advanced degree in Data Science, Statistics, Computer Science, Information Engineering or a related field;</li>\n<li>Expert-level experience in either Python or R; Python is preferred, but superior R candidates also will be considered;</li>\n<li>Superior understanding of SQL and database modeling;</li>\n<li>Expertise in data visualization using tools such as Tableau.</li>\n</ul>\n\n<em><strong>REQUIREMENTS: Professional</strong></em>\n\n\n<ul>\n<li>Exceptional written and verbal communication skills;</li>\n<li>Ability to take initiative and deliver tangible results under deadlines;</li>\n<li>Possess the curiosity and creativity necessary to generate quick, iterative, optimizing solutions in a wide range of industries and business domains, including anything from eCommerce to Telecommunications to Heavy Manufacturing and anything in between.</li>\n</ul>\n\n<em><strong>Some example Use Cases we are currently working on:</strong></em>\n\n\n<ul>\n<li>eCommerce/Retail:Using Web events, CRM and DMP data for analysis in real time to derive deep insights around Shopper Personas, Cart / Reservation Abandonment probability, CLV and other propensities and to enable real time site personalization.</li>\n<li>Manufacturing: Classifying streaming machine data to enable powerful predictions on machine energy consumption, efficiencies, and fault tolerances.</li>\n<li>Preventive Maintenance: Using real time analysis of machine data to provide for the identification of discrete events, detection of anomalies, and the prediction of failures; thus enabling companies to take preventive measures in an optimized manner</li>\n</ul>\n\n</div>"}