{"job title": "Principal Data Engineer", "company": "Lumeris", "city state": "– Saint Louis, MO", "rating": "2.7", "job description": "In order to apply for a position at Lumeris, you must create an account using your email address and a password of your choosing. This account will allow you to receive notifications each step of the way through the job application process. With these updates, you'll never have to wonder where you are in the process. Additionally, we can easily send pertinent documents to you for your review. Once you create the account, you may apply to any position you feel is a good fit without having to re-enter information. Thank you for your interest in Lumeris.\n<br><br>\nPosition:Principal Data Engineer\n<br><br>\nPosition Summary:Data centric developers with business acumen, data analysis, and QA. Currently Data Engineers, Data Analysts, Conversion Consultants, and Data Stewards.\n<br><br>\nAs a developer, your primary job is to create working software for clients. You like making sense of raw data. Sound like you?\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nCore Behavioral Competencies\n\n\n<ul>\n<li>Has the ability to learn on the fly; is open to change; has an experimental attitude when looking for solutions; comfortable working with unfamiliar tasks; grasps quickly the systems and processes that they are working on.</li>\n<li>Follows Departmental and Corporate policies and procedures.</li>\n<li>Abilities to find creative solutions to everyday constraints.</li>\n<li>Uses logic and analytical methods to solve difficult problems with effective solutions; appropriately utilizes resources available to them when solving problems; has excellent and objective analysis skills; provides next steps, recommendations and/or solutions.</li>\n<li>Has the functional and technical knowledge and skills to do the job at a high level of accomplishment and/or high-level results.</li>\n<li>Learns technical product, program and system continuously; learns and/or acquires new skills and knowledge; keeps abreast of new technology, process and/or product; determines when and how to apply them using methodical, thorough, and accurate approach.</li>\n<li>Is customer focused; committed to meeting the expectations and requirements of internal and external customers; obtains customer information and uses it for improvements in products and services; acts with customers in mind; establishes and maintains effective relationships with customers and gains their trust and respect.</li>\n<li>Practices attentive and active listening; has the patience to hear people out; can accurately restate the opinions of others even when he/she disagrees.</li>\n<li>Capable of producing clearly written technical/requirements documentation that represents a business user's requirement(s) and can be understood and/or used by other members of the development team.</li>\n<li>Actively participates in meetings; works as a team member with the department and company in mind, as opposed an individual.</li>\n<li>Spends time doing what is important; understands the importance that the state of being busy does not equal to providing value.</li>\n<li>Speaks up when something important is being overlooked or pushed aside by management; has the ability to focus on important tasks not letting other things get in the way.</li>\n<li>Is hardworking; full of energy when new challenges are presented; seeks opportunities.</li>\n</ul>\n\nKnowledge/experience\n\n\n<ul>\n<li>Can acquire and interpret user requirements to develop technical solution across multiple solutions</li>\n<li>Have knowledge and skillset as SME</li>\n<li>Leads technical implementation for his/her responsible component</li>\n<li>Extensive experience coding SQL</li>\n<li>Experience with object-oriented programming, preferred</li>\n<li>Experience moving data via API, preferred</li>\n<li>Experience with healthcare administrative data (ie payer), preferred</li>\n</ul>\n\nRole\n\n\n<ul>\n<li>Participates in the design and implementation of large size database projects.</li>\n<li>Makes recommendations on technology usage.</li>\n<li>Architectural ownership of component.</li>\n<li>Ability to influence and motivate team towards the accepted technical solution.</li>\n<li>Responsible for mentoring junior staff.</li>\n</ul>\n\nWork complexity\n\n\n<ul>\n<li>As a recognized leader on the team, works on extremely complex problems of diverse scope.</li>\n</ul>\n\nLumeris is an EEO/AA employer M/F/V/D.\n<br><br>\nLocation:St. Louis, MO\n<br><br>\nTime Type:Full time\n<br><br>\nStatus:XL - DI"}