{"job title": "SAP IS Retail Master Data Consultant", "company": "Luxottica Group", "city state": "– Mason, OH", "rating": "3.0", "job description": "<strong>Requisition ID:&nbsp;</strong>77849&nbsp;\n<br>\n<strong>Position:</strong>Full-Time\n<br><br>\n&nbsp;\n<br><br>\nLuxottica is a global leader in the design, manufacture and distribution of fashion, luxury and sports eyewear. Our wholesale network covers more than 150 countries and our retail presence consists of over 7,200 retail stores across the globe.\n<br><br>\nIn North America, our wholesale business is the home to global brands like Ray-Ban, Oakley, and many of the top fashion house brands. Our leading retail brands include; LensCrafters, Sunglass Hut, Pearle Vision, Target Optical and Sears Optical. We are also home to EyeMed, the fastest growing vision care company in the United States.\n<br><br>\nSupporting over 4,500 retail stores in North America, a career in our retail headquarters allows us to stay in touch with the end customer and use their ever-changing behaviors and preferences to shape our offerings of the best eyewear and services.\n<br><br>\n&nbsp;\n<br><br>\n<strong>GENERAL FUNCTION</strong>\n<br><br>\nThis position is responsible for the process design, configuration and requirement gathering for SAP Retail Master Data area, as well as integration touch points to other processes and systems. This position is responsible for hands-on and leadership of cross-functional teams tasked with solving business requirements. Responsible for estimating, configuring and leveraging SAP functionality to meet core business process needs. This position would interface regularly with business stakeholders, development teams, and third parties to ensure that business requirements are met through proper system design and configuration.\n<br><br>\n<strong>MAJOR DUTIES AND RESPONSIBILITIES</strong>\n<br><br>\n<strong>SAP Retail Master Data Business Process Management</strong>\n<ul>\n<li>Serves as the subject matter expert for SAP IS-Retail or FMS master data processes.</li><li>Partners with business users to identify and prioritize business requirements.</li><li>Collaborate with architecture and infrastructure teams on best practices, design and environment setup.</li><li>Conducts design reviews and assists with the design and specification development.</li><li>Partners with development resources to provide detail functional specifications and field mapping documents for custom development.</li><li>Responsible for quality testing and working with users for UAT.</li><li>Works with business to ensure mutual accountability as design results are achieved. Holds the business accountable to the design.</li><li>Coordinates and/or executes master data conversion for large projects</li><li>Leads project deployment and supports project hypercare</li>\n</ul>\n<strong>Non-Project Responsibilities</strong>\n<ul>\n<li>Responsible to keep abreast of industry trends and innovations and future SAP development for respective process areas or functional areas.</li><li>Provide third level production support and identify root causes to issues.</li>\n</ul>\n<strong>BASIC QUALIFICATIONS</strong>\n<ul>\n<li>2-3 full lifecycle IS-Retail or FMS SAP implementations with an in-depth understanding of ASAP methodology</li><li>Hands on experience with Retail SAP Master Data: Sites, Customers, Articles, Assortments, Listings, Pricing and Promotions</li><li>Strong experience with SAP IDOCS and interfacing with third party systems</li><li>Proven ability to lead groups, manage project deliverables, and maintain relationships</li><li>Ability to work in complex technical environment</li><li>Ability to manage multiple, changing priorities while working effectively in a team environment</li><li>Excellent Problem solving skills</li><li>Excellent oral and written communication skills</li><li>Ability to effectively interact at an executive level</li><li>7+ years of related SAP experience</li><li>At least 5 years of experience in direct hands on design and implementation of the SAP Master Data</li><li>Bachelor degree in Computer Science, MIS, Business or related field.</li>\n</ul>\n<strong>PREFERRED QUALIFICATIONS</strong>\n<ul>\n<li>Cross functional experiences with SAP modules such as MM, WM, SD and FI</li><li>Experience with defining and/or executing projects using a global template</li><li>Experience in managing budgets, project plans, resource allocations, and priorities are a plus.</li><li>Some technical experience writing LSMW’s, debugging programs, data conversion tools, etc.</li><li>SAP Certification Preferred</li><li>SAP Business Process Knowledge</li><li>Strong knowledge of ASAP Methodology</li>\n</ul>\n&nbsp;\n<br><br>\nUpon request and consistent with applicable laws, Luxottica will provide reasonable accommodations to individuals with disabilities who need assistance in the application and hiring process. To request a reasonable accommodation, please contact Talent Luxottica at 877-589-8253 (513-765-2256 outside of US) or email TalentLuxottica@luxotticaretail.com\n<br><br>\nWe are an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, national origin, religion, age, disability, sexual orientation, gender identity or expression, citizenship, veteran or military status, marital status, pregnancy (including unlawful discrimination on the basis of a legally protected pregnancy or maternity leave), genetic information or any other characteristics protected by law.\n<br><br>\n&nbsp;\n<br><br>\nInformation Technology"}