{"job title": "Data Scientist", "company": "Lyft", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "<div>At Lyft, community is who we are and it's what we do. It's what makes us different. To create the best ride for all, we start in our own community by creating an open, inclusive, and diverse organization where all team members are recognized for what they bring.\n<br><br>\nData is at the heart of how Lyft makes business and product decisions. As a data science team, we work collaboratively with partners across product, engineering, operations and growth to develop business insights and make actionable recommendations. We're looking for passionate data scientists to come work alongside us to take on some of the most interesting and impactful problems in ridesharing.\n<br><br>\nYou'll be working in a dynamic environment, where we embrace moving quickly to build the world's best transportation. Data Scientists pursue a variety of problems ranging from understanding our passengers and drivers, to ensuring we have an efficient marketplace, to optimizing how we run our marketing and growth incentives. You'll dig into the data to uncover insights, design experiments and measure the impact, and ultimately help influence decision-making across the entire organization.</div>\n\n<br><strong>Responsibilities:\n<br>\n</strong>\n<br>\n<div>\n\n\n<ul>\n<li>Set business metrics that measure the health of our products, as well as passenger and driver experience</li>\n<li>Partner with product managers, engineers, marketers, designers, and operators to translate business insights into decisions and action</li>\n<li>Find opportunities for growth and efficiency for Lyft</li>\n<li>Design and analyze product experiments; communicate results and launch decisions</li>\n<li>Develop analytical frameworks to monitor business and product performance</li>\n</ul>\n\n<strong>Experience &amp; Skills:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Degree in a quantitative field like statistics, economics, applied math, operations research or engineering. Advanced degrees are preferred</li>\n<li>3+ years of industry experience in a data science or analytics role</li>\n<li>Proficiency in SQL - able to write structured and efficient queries on large data sets</li>\n<li>Experience in programming, especially with data science and visualization libraries in Python or R</li>\n<li>Strong oral and written communication skills, and ability to collaborate with cross-functional partners to build the business</li>\n</ul>\n<em>Lyft is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. Lyft does not make hiring or employment decisions on the basis of race, color, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender-identity, sexual orientation, disability, age, military or veteran status, or any other basis protected by applicable local, state, or federal laws or prohibited by Company policy. Lyft also strives for a healthy and safe workplace and strictly prohibits harassment of any kind. Pursuant to the San Francisco Fair Chance Ordinance and other similar state laws and local ordinances, and its internal policy, Lyft will also consider for employment qualified applicants with arrest and conviction records.</em></div>\n<br>"}