{"job title": "Quantitative Analyst - Treasury", "company": "M&amp;T Bank", "city state": "– Buffalo, New York", "rating": "3.3", "job description": "Quantitative Analyst - Treasury\n<br>\nNew York-Buffalo-One M&amp;T Plaza\n<br>\n<strong>FUNCTION:</strong>\n<br>\nPerform data and statistical analysis in support of the creation and\n<br>\nmaintenance of statistical models, including Regression and\n<br>\nMultivariate models. Support Senior Analysts and Managers in data\n<br>\nanalysis and model construction.\n<br>\n<strong>POSITION RESPONSIBILITIES:</strong>\n<br>\nAssist in establishing, monitoring, evaluating and interpreting data\n<br>\nwith a risk management focus with an understanding of business\n<br>\nstrategy.\n<br>\nPerform data manipulation and analysis using SQL, SAS and Microsoft\n<br>\nExcel and present results and recommendations to managers.\n<br>\nTrack portfolio performance and risk strategy results. Incorporate\n<br>\nobservations and data in to existing models to improve predictive\n<br>\nresults.\n<br>\nIdentify deviations from forecast/expectations and explain variances.\n<br>\nIdentify risk and/or opportunities.\n<br>\nPrepare exhibits and supporting materials and develop recommendations\n<br>\nbased on analyses performed.\n<br>\nContribute to loss forecasts, demographic and credit limit utilization\n<br>\nanalysis.\n<br>\nProvide financial analysis and data support to other\n<br>\ngroups/departments including Finance, Marketing, Funding, Collections\n<br>\nand Corporate Development as needed.\n<br>\nPerform Portfolio Management campaign tracking and analysis.\n<br>\nIdentify opportunities to leverage statistical solutions to solve\n<br>\nbusiness problems.\n<br>\nAdhere to applicable compliance/operational risk controls in\n<br>\naccordance with Company or regulatory standards and policies.\n<br>\nPromote an environment that supports diversity and reflects the M&amp;T\n<br>\nBank brand.\n<br>\nMaintain M&amp;T internal control standards, including timely\n<br>\nimplementation of internal and external audit points together with any\n<br>\nissues raised by external regulators as applicable.\n<br>\nComplete other related duties as assigned.\n<br>\n<strong>NATURE AND SCOPE:</strong>\n<br>\nThis role is highly technical in nature and requires demonstrated\n<br>\nattention to detail as well as execution and follow up on multiple\n<br>\ninitiatives within the Centralized Modeling department. The ability to\n<br>\nidentify, analyze, rationalize and communicate complex business\n<br>\nproblems and recommend solutions is a key factor of success in this\n<br>\nrole.\n<br>\n<strong>MANAGERIAL/SUPERVISORY RESPONSIBILITY:</strong>\n<br>\nNone\n<br>\n<strong>MINIMUM QUALIFICATIONS REQUIRED:</strong>\n<br>\nBachelor degree in Mathematics, Statistics, Quantitative Analysis or\n<br>\nanother technical discipline with minimum of 2 years relevant\n<br>\nexperience or in lieu of degree, a combined minimum of 6 years higher\n<br>\neducation and/or work experience to include a minimum of 2 years\n<br>\nrelevant experience.\n\n\n<ul>\n<li>OR Master s degree in Mathematics, Statistics, Quantitative Analysis or</li>\n</ul>\n\nanother technical discipline.\n<br>\n<strong>IDEAL QUALIFICATIONS PREFERRED:</strong>\n<br>\nBanking or Financial Services experience.\n<br>\nPrevious Credit Analysis experience.\n<br>\nExperience with SAS, SAS Enterprise Miner and other Statistical\n<br>\nSoftware Packages.\n<br>\nAdvanced Knowledge of SQL and Microsoft Office.\n<br>\nAbility to utilize analytics in a collaborative manner across business\n<br>\nfunctions and product lines to derive optimum solutions.\n<br>\nDemonstrated ability to communicate complex concepts.\n<br>\n<strong>PHYSICAL REQUIREMENTS:</strong>\n<br>\nCompliance / Risk\n<br>\nNov 15, 2018, 4:48:48 PM\n<br>\nFull-time"}