{"job title": "Enterprise Data Consultant II", "company": "M&amp;T Bank", "city state": "– Cheektowaga, New York", "rating": "3.3", "job description": "M &amp; T Bank\n<br><br>\nEnterprise Data Consultant II\n<br><br>\nLocation: Cheektowaga, NY\n<br><br>\n<strong>Function:</strong>\n<br>\nAssists in providing guidance to business units in implementing components of the Enterprise Data Management Program in the areas of governance, quality, issue management, reporting, data architecture, solutions, analytics or project management.\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\nManage implementation of the Enterprise Data Management Program within assigned business units, providing training to business line and technology personnel.\n<br>\nAssist in facilitating data management-related working groups.\n<br>\nDevelop an understanding of data management practices and researching current industry trends.\n<br>\nMeasure compliance with the Enterprise Data Management Policy and Standards for assigned units.\n<br>\nWork with assigned units to identify critical data elements and capture related metadata.\n<br>\nMonitor quality of data within assigned unit, through the measurement of enterprise-wide key performance/key risk indicators (KPIs/KRIs) to ensure effective data risk management.\n<br>\nFacilitate remediation of data management-related issues within assigned units.\n<br>\nAnalyze large data sets to derive business insights to drive tangible business value.\n<br>\nDemonstrate usage of enterprise data management and business intelligence tools by relevant stakeholders.\n<br>\nManage strategic sourcing of material data for centralized organizational use.\n<br>\nUnderstand and adhere to the Company's risk and regulatory standards, policies and controls in accordance with the Company's Risk Appetite. Identify risk-related issues needing escalation to management.\n<br>\nPromote an environment that supports diversity and reflects the M &amp; T Bank brand.\n<br>\nMaintain M &amp; T internal control standards, including timely implementation of internal and external audit points together with any issues raised by external regulators as applicable.\n<br>\nComplete other related duties as assigned.\n<br><br>\n<strong>Required Qualifications:</strong>\n<br>\nBachelor's degree and a minimum of 5 years' relevant work experience, or in lieu of a degree, a combined minimum of 9 years' higher education and/or work experience, including a minimum of 5 years' relevant work experience\n<br>\nExcellent verbal and written communication skills\n<br>\nDemonstrated analytical ability and creative problem solving skills\n<br>\nStrong project management leadership\n<br>\nPrior experience coordinating cross-functional teams at various levels\n<br>\nProficiency in the use of spreadsheets, graphing, and presentations with a working knowledge of financial models\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br>\nMaster's Degree\n<br>\n8 years' professional experience\n<br>\nKnowledge of data management practices and/or Bank products, systems and workflows\n<br>\nKnowledge of process improvement methodology and business process management techniques\n<br>\nProficient in pertinent project and presentation software\n<br>\nBasic SQL\n<br><br>\nWe encourage candidates with relevant military experience to apply.\n<br><br>\nAbout M &amp; T\n<br>\nAt M &amp; T, we strive to be the best place our employees ever work, the best bank our customers ever do business with and the best investment our shareholders ever make. So when looking to advance your career, look to M &amp; T. As a top 20 US bank holding company and one of the best performing regional banks in the country, we offer a wide range of performance based career development opportunities for talented professionals. And through our longstanding tradition of careful, conservative and consistent management and a strong commitment to the communities we serve, we continue to grow with a focus on the future.\n<br><br>\nJob Posting: Aug 17, 2018, 1:48:11 PM\n<br>\nUnposting Date: Ongoing\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: 3DKI6\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nM &amp; T Bank\n<br><br>\nM &amp; T Bank is a multi-state community-focused bank serving New York, Maryland, New Jersey, Pennsylvania, Delaware, Connecticut, Virginia, West Virginia and Washington, D.C. Founded in 1856, M &amp; T Bank provides banking, investment, insurance and mortgage financial services to consumer, business and government clients. Contact Info\n\n\n<ul>\n<li>Cheektowaga, NY</li>\n</ul>"}