{"job title": "Senior Business Data Analyst", "company": "M&amp;T Bank", "city state": "– Wilmington, Delaware", "rating": "3.3", "job description": "Senior Business Data Analyst\n<br>\nWilmington, DE\n<br><br>\n<strong>Function:</strong>\n<br>\nCoordinates components of the data program within an assigned area of the Bank, carrying out the execution of governance, quality, issue management, reporting, data architecture, solutions, analytics, or project management activities with some oversight from management and the overall Enterprise Data Management Program.\n<br>\nThis role will support all aspects of the RMO. Including intern, TDP, mentoring and headcount data models, collection and analytics.\n\n<li>Develop centralized dashboards and scorecards for the core services provided within RMO</li>\n<li>Headcount management</li>\n<li>Contractor/Vendor management</li>\n<li>Interns</li>\n<li>Mentor Program</li>\n<li>Campus Recruiting</li>\n<li>Experience Hires - Talent Management</li>\n<li>TDP Program (performance metrics and business process analysis)</li>\n<li>Assist with coordination of campus recruiting activities, intern even coordination and mentor program activities.</li>\n<li>Interface with management, peers and external partners to understand, interpret and identify the best data collection and reporting models.</li>\n\n<strong>Competencies:</strong>\n\n<li>Influencing</li>\n<li>Strong written and verbal communication</li>\n<li>Presentation Skills</li>\n<li>Strong analytical and critical thinking skills</li>\n<li>Creative Thinking</li>\n<li>Collaboration &amp; Teamwork</li>\n\n<strong>Technical Skills:</strong>\n\n<li>Advanced Excel skills</li>\n<li>Access or SQL database knowledge</li>\n<li>MS Office - PowerPoint, MS Publisher</li>\n<li>Tableau or similar</li>\n\n<strong>Responsibilities:</strong>\n<br>\nWork with business and Technology personnel within assigned units to implement the Data Management Program within assigned area of the Bank.\n<br>\nDevelop an understanding of data management practices.\n<br>\nAssist in developing metrics to measure compliance with the business and Enterprise Data Management policy and standards for assigned units.\n<br>\nWork with assigned units to document metadata for identified critical data elements.\n<br>\nAssist in monitoring the quality of data within assigned units and facilitate disposition of data quality exceptions.\n<br>\nWork with assigned units to conduct root cause analysis and document remediation plans for data management-related issues.\n<br>\nLeverage business and enterprise data management and business intelligence tools to assist assigned units in effectively managing their data.\n<br>\nAssist assigned units in completing data analysis to derive insights that may result in tangible business value.\n<br>\nUnderstand and adhere to the Company's risk and regulatory standards, policies and controls in accordance with the Company's Risk Appetite. Identify risk-related issues needing escalation to management.\n<br>\nPromote an environment that supports diversity and reflects the M &amp; T Bank brand.\n<br>\nMaintain M &amp; T internal control standards, including timely implementation of internal and external audit points together with any issues raised by external regulators as applicable.\n<br>\nComplete other related duties as assigned.\n<br><br>\n<strong>Nature &amp; Scope:</strong>\n<br><br>\n<strong>Required Qualifications:</strong>\n<br>\nBachelor's degree and a minimum of 2 years' professional experience, or in lieu of a degree, a combined minimum of 6 years' higher education and/or work experience, including a minimum of 2 years' professional experience\n<br>\nExcellent verbal and written communication skills\n<br>\nDemonstrated analytical ability\n<br>\nCreative problem solving skills\n<br>\nBasic project management skills\n<br>\nProficiency in the use of spreadsheets, graphing, and presentations with a working knowledge of financial models\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br>\nBanking or data management industry experience\n<br>\nWorking knowledge of Data Management principles and/or Bank products, systems and workflows\n<br>\nWorking knowledge of process improvement methodology and business process management techniques\n<br>\nProficient in pertinent project and presentation software\n<br><br>\nJob Posting: Nov 15, 2018, 2:08:00 PM\n<br>\nUnposting Date: Ongoing\n<br><br>\nApply on Company Website\n<br><br>\nJob ID: 3DLMZ\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nM &amp; T Bank\n<br><br>\nM &amp; T Bank is a multi-state community-focused bank serving New York, Maryland, New Jersey, Pennsylvania, Delaware, Connecticut, Virginia, West Virginia and Washington, D.C. Founded in 1856, M &amp; T Bank provides banking, investment, insurance and mortgage financial services to consumer, business and government clients. Contact Info\n\n\n<ul>\n<li>Wilmington, DE</li>\n</ul>"}