{"job title": "Sr. Scientist", "company": "Madico, Inc.", "city state": "– Woburn, MA", "rating": "3.9", "job description": "<strong>JOB SUMMARY:</strong>\n<br><br>\nUnder general supervision plans, conducts and supervises research and development assignments which are generally broad in nature, the goal of which is the development of new/improved products, technology or processes which are designed to contribute to the growth and profitability of Madico. Operates with appreciable latitude in reviewing project progress and evaluation of results. Reviews project progress with management, marketing and other departments as needed. Requires considerable knowledge of adhesives and coatings, general formulation, mixing, coating and laminating technology and testing and evaluation expertise. Requires solid project management skills.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n<ul>\n<li>Project management.</li><li>Carry out product development/improvement, quality improvement and cost reduction activities as assigned.</li><li>Propose development activities to R&amp;D Management that could significantly improve Madico's growth and profitability.</li><li>Source materials, formulate coatings, prepare samples, and develop test protocol for effective evaluation of product designs.</li><li>Using various lab and pilot coater techniques, prepare samples for evaluation.</li><li>Supervise trials on plant equipment as necessary. For specific trials under the Sr. Dev. Chemist's responsibility, this includes being present or insuring coverage during the trial, and issuing comprehensive reports afterwards.</li><li>Operation of pilot coater.</li><li>Good communication skills. Provide written and verbal reports as needed and in a timely manner.</li><li>Provide technical support to sales and manufacturing.</li><li>Complete necessary development work to enable product to be successfully manufactured and commercialized. Direct scale-up activities.</li><li>Insure compliance with all company health, safety and environmental requirements and rules. Assist in lab housekeeping duties.</li><li>Conduct product development project activities in accordance with ISO 9001 requirements.</li><li>Operation of lab equipment, including testing, analytical and process equipment.</li><li>Deal directly with customers regarding technical service and product development issues.</li><li>Provide support and technical guidance to suppliers for meeting Madico's needs.</li>\n</ul>\n<strong>ADDITIONAL DUTIES AND RESPONSIBILITIES:</strong>\n<ul>\n<li>Additional responsibilities as assigned by R&amp;D Management, e.g., safety committee representative, emergency coordinator, MRP representative, etc.</li><li>Develop expert knowledge of relevant scientific fields in order to better understand our products and processes, the markets we serve, etc.</li><li>Help improve the efficiency and effectiveness of Madico.</li><li>Key member of R&amp;D Management's staff. Provide information, ideas and feedback to R&amp;D Management to improve decision making and effectiveness of R&amp;D group. Assist R&amp;D Management in making key decisions regarding the direction of R&amp;D in supporting Madico growth and profitability strategy.</li><li>Serve as mentor to lower level professional staff.</li><li>Foster good relations within Madico, with Lintec, our customers, and suppliers.</li>\n</ul>\n<strong>MANAGEMENT SYSTEM (IMS) RESPONSIBILITIES:</strong>\n<ul>\n<li>Improve work processes.</li><li>Provide input and verify that documented procedures are adequate and accurate and in support of achievement of the strategy</li><li>Understand the IMS policy and how it applies.</li><li>Keep records and data on pertinent business outcomes.</li><li>Participate in internal audits.</li><li>Participate in ongoing process improvement.</li><li>Participate in external registration and surveillance audits.</li><li>Directly support methods and practices of the IMS Process through personal compliance and visible support actions.</li><li>Support CSR activities</li>\n</ul>\n<strong>DESIRED MINIMUM QUALIFICATIONS:</strong>\n<br><br>\n<strong><u>Education and Experience</u></strong>:\n<ul>\n<li>Bachelor's degree in Chemistry or Chemical Engineering plus 10 years related experience or</li><li>Masters degree in Chemistry or</li><li>Chemical Engineering with 5 years related experience.</li>\n</ul>\n<strong><u>Necessary Knowledge, Skills and Abilities</u></strong>:\n<ul>\n<li>Good oral and written communication skills.</li><li>Solid computer skills.</li><li>Full knowledge of statistical techniques and processes.</li><li>Good understanding of formulating, mixing, coating, laminating and converting.</li><li>Solid project management skills. Ability to manage multiple projects effectively.</li><li>Solid understanding of chemistry.</li><li>Ability to operate analytical and test equipment typically used in coating and laminating industry.</li><li>Good customer relations skills.</li>\n</ul>\n<strong>SPECIAL REQUIREMENTS:</strong> (Any travel, security, risk, hazard or related special condition.)\n<br><br>\nSome overnight travel may be required\n<br><br>\n<strong>TOOLS AND EQUIPMENT USED:</strong> (Examples: list different types of office equipment, software, mainframe computer, PC, etc.)\n<ul>\n<li>Computers including word-processing, data base and spreadsheet software.</li><li>Company mainframe as it relates to materials.</li><li>Pilot coater.</li><li>Analytical equipment, instrumentation and test equipment.</li><li>Manufacturing mixing, coating and laminating, and converting equipment.</li>\n</ul>\n<strong>PHYSICAL DEMANDS:</strong> (The physical demands are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals to perform the essential functions.)\n<ul>\n<li>Must not be colorblind.</li><li>Must have good vision to be able to see very small or subtle defects in the high optical quality products Madico produces.</li><li>Must be able to lift and manipulate 50 pounds.</li><li>Must be respirator certifiable.</li><li>Must be able to bend, stoop, lift heavy objects to a height of 7 ft, and stand for prolonged periods of time.</li><li>Must possess good manual dexterity and coordination</li>\n</ul>\n<strong>WORK ENVIRONMENT</strong>: (The work environment characteristics described here are representative of those the employee encounters while performing the essential functions of the job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.)\n<ul>\n<li>The work environment includes the office, laboratory and manufacturing areas.</li><li>The work environment may include customer or supplier facilities.</li><li>On occasion, overnight travel may be required.</li>\n</ul>\n****************************************************************************************\n<br><br>\nThe duties listed above are intended only as illustrations of the various types of work that may be performed. The omission of specific statements or duties does not exclude them from the position if the work is similar, related, or a logical assignment to the position. The job description does not constitute and employment agreement between the employer and the employee and is subject to change by the employer as the needs of the employer and requirements of the job change.<br><br>0\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}