{"job title": "Senior Data Scientist", "company": "Manulife", "city state": "– Boston, Massachusetts", "rating": "3.6", "job description": "<strong>Are you looking for unlimited opportunities to develop and succeed? With work that challenges and makes a difference, within a flexible and supportive environment, we can help our customers achieve their dreams and aspirations.</strong>\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nAre you looking for a variety of business problems to solve? Our team leverages data to provide real value to the business so that they can make smarter decisions, optimize processes and enhance the customer experience.\n<br><br>\nThis high-visibility role will report directly to the Director-Strategy, Finance, Advanced Analytics &amp; AI, US Enterprise Operations IT. This experienced business data &amp; modeling professional will be responsible for providing modeling, programming, and econometrics support to optimize operations and enhance the customer experience.\n<br><br>\n<strong>Key responsibilities:</strong>\n<ul>\n<li>Work within administrative, existing legacy systems to extract data for consumption into models. Create bounds of model accuracy as may result from data vintage and manage perceived accuracy of model based on historical data quality.</li><li>Identify opportunities to enhance Operations businesses using econometrics and advanced analytical methods, perform analyses, and deliver findings/recommendations.</li><li>Work on complex models to answer business optimization questions in LTC and Life Insurance Operations, both on a forecasting basis as well as an ad hoc basis to meet changing business demands.</li><li>Work closely with partners (Actuaries, Ops Leaders, Senior Leaders, Shared Services) to model business problems dealing with Operations and make clear recommendations. Explain clearly impact of Ops decisions/process changes on partner areas and vice versa.</li><li>Collaborate with thought leaders and functional leadership within Insurance Operations around effective use of models to address business needs; coach/teach partner areas on creation and ownership of their models to address business needs.</li><li>Advise Data Mining Director and other leadership as to data required to effectively manage the Insurance Operations business.</li>\n</ul>\n<strong>Requirements for this role are as follows:</strong>\n<ul>\n<li>Ability to tie together disparate and unique vintage data sources into a cohesive, automated and stable data output for utilization in models</li><li>Expertise in SQL, MS Access, VBA-Excel, SAS and other query and modeling languages/tools</li><li>Ability to leverage industry-standard operations modeling techniques (Regression, Six Sigma) to address both ongoing and ad hoc modeling needs (e.g. working with actuaries to remove operations impact from reserving models)</li><li>Expertise with one or more analytics packages (SAS, R, Python) required</li><li>Experience building advanced analytics models (Artificial Neural Nets, k-Nearest Neighbors)</li><li>Expertise in programming, machine learning and computer science principles</li>\n</ul>\n<strong>Personal Skills &amp; Other Qualifications</strong>\n<ul>\n<li>Ability to creatively problem solve in a collaborative fashion</li><li>Ability to explain highly technical or complicated issues into simple non-technical language</li><li>Keen analytical thinker with strong research capabilities</li><li>Ability to perform independent research on industry trends around analytics</li><li>Excellent written and verbal skills</li><li>5+ years of work experience</li><li>Technical undergraduate degree, Master's preferred</li>\n</ul>\n<strong>L<strong>I-JH- JHC</strong></strong>\n<br><br>\n<strong>If you are ready to unleash your potential it’s time to start your career with Manulife/John Hancock.</strong>\n<br><br>\n<strong>About Manulife</strong>\n<br>\nManulife Financial Corporation is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate as John Hancock in the United States and Manulife elsewhere. We provide financial advice, insurance, as well as wealth and asset management solutions for individuals, groups and institutions. At the end of 2016, we had approximately 35,000 employees, 70,000 agents, and thousands of distribution partners, serving more than 22 million customers. At the end of 2016, we had $977 billion (US$728 billion) in assets under management and administration, and in the previous 12 months we made almost $26 billion in payments to our customers.\n<br><br>\nOur principal operations are in Asia, Canada and the United States where we have served customers for more than 100 years. With our global headquarters in Toronto, Canada, we trade as 'MFC' on the Toronto, New York, and the Philippine stock exchanges and under '945' in Hong Kong.\n<br><br>\nManulife is committed to supporting a culture of diversity and accessibility across the organization. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will consult with applicants contacted to participate at any stage of the recruitment process who request an accommodation. Information received regarding the accommodation needs of applicants will be addressed confidentially."}