{"job title": "CLINICAL LAB SCIENTIST APPRENTICE", "company": "Marian Regional Medical Center", "city state": "– Santa Maria, CA", "rating": "2.7", "job description": "<strong> Overview</strong> \n<br>\nMarian Regional Medical Center, located in Santa Maria, CA, is nationally ranked among the top 10% in the nation for safety core measures in Cardiac Services and has the only comprehensive Cancer treatment and resource program from Los Angeles to San Francisco. In April 2012, Marian opened its doors to a brand new state-of-the-art facility which houses the latest technology to support excellent physicians and caregivers who deliver compassionate care each and every day. Marian's new hospital includes 191 beds, expanded and enhanced Emergency Department, Critical Care Unit, NICU and women's services.\n<br>\nMarian is a Dignity Health member of the Central Coast, which also includes Arroyo Grande Community Hospital in Arroyo Grande, CA and French Hospital Medical Center in San Luis Obispo, CA. Dignity Health of the Central Coast is recognized for the highest quality hospitals, physicians from the top medical schools in the country, primary care offices to ensure access for all patients, premier ambulatory surgery centers, technologically advanced imaging centers, outpatient services and a comprehensive home health service; all recognized for quality, safety and service. Each hospital is supported by an active philanthropic Foundation to provide additional funding to support new programs and services, as well as to advance the community's access to health care.\n<br><br>\n<strong> Responsibilities</strong> \n<br>\n<strong>JOB SUMMARY:</strong>\n<br>\nIn keeping with the Marian Regional Medical Center health care philosophy, the Clinical Laboratory Scientist\n<br>\nApprentice under the direct supervision of a CLS, performs a wide variety of laboratory tests including but not limited to various chemical, microscopic, and bacteriologic tests to obtain data for use in diagnosis and treatment of disease, in accordance with Mission and Laboratory Customer Service Standards. Performance of all diagnostic laboratory procedures and reporting of all patient results must be completed under the direct supervision as noted above. It is a transitional job available for 90 days only. This position allows observation of the testing site and on-site training in the lab.\n<br>\nThe position ends when the California Laboratory Field Services electronically posts the California CLS license\n<br>\nnumber or first attempt at certification results in failure or 90 days, whichever occurs first.\n<br><br>\n<strong> Qualifications</strong> \n<br>\n<strong>Licensure</strong>\n<br>\nMust be qualified and prepared to take or has just taken the ASCP or AAB certifying exam for California CLS licensure.\n<br><br>\n<strong>Experience</strong>\n<br>\nCompletion of Clinical Bench Rotation in Medical Laboratory Science Internship program.\n<br><br>"}