{"job title": "Data Scientist", "company": "MarketDial", "city state": "– Salt Lake City, UT, US", "rating": "5.0", "job description": "<div>\n<strong>Job Description</strong>\n<br>\nAt MarketDial we're building software that enables our clients to make multi-million dollar decisions. As a data scientist at MarketDial you will be working closely with our top engineers to build our analytic products and solve our client's analytical needs.</div><br>\n<div>\nThis is an exciting role where you will have a lot of opportunity to work with diverse datasets from Fortune 100 companies. You will be writing models in Python to power our products. Youll also roll up your sleeves to perform ETL in SQL and problem-solve with clients.</div><br>\n\n<div>\n<strong>Skills and Qualifications</strong></div>\n\n<ul>\n\n<li>\nExcellent understanding of statistical and machine learning models (e.g., multivariate regression, classification, clustering, multidimensional scaling, trees, neural nets) including building, validating, and productionalizing models.</li>\n<li>\nExtensive experience with Python applying some of the models above to real-world data; nice if you have utilized the R language for statistics/machine learning.</li>\n<li>\nExtensive experience using database query languages like SQL.</li>\n<li>\nExperience with data visualization tools (e.g., Tableau, Power BI, D3.js , Highcharts).</li>\n<li>\nExperience with GitHub for collaboration and version control.</li>\n<li>\nGreat communication and client management skills.</li>\n<li>\nData-oriented personality.</li>\n<li>\nAbility to own a problem and seek innovative solutions without heavy oversight or guidance.</li>\n</ul>\n\n<br>\n<div>\nHere at MarketDial, we embrace and celebrate difference. We believe that a diverse culture is essential to the benefit of our culture, company, and customers. MarketDial is proud to be an equal opportunity workplace and is an affirmative action employer. We believe that in hiring the best talent, a diversity of cultures, ideas, and perspectives will reflect the global diversity that our world is today. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or need that requires accommodation, please let us know at erika@marketdial.com</div>"}