{"job title": "Data Engineer, ETL", "company": "Marketing Evolution", "city state": "– New York, NY", "rating": "3.7", "job description": "<strong>Company Overview:</strong>\n<br><br>\nMarketing Evolution has been recognized by Forrester as the industry leader in marketing optimization, due to our big-data, person-centric, decision-making SaaS platform. Marketing Evolution has announced $20.6M in new 2018 funding from top-tier global private equity and venture capital firm. This funding will used to help us continue to lead product innovation focused on customer obsessed marketers. Our award winning platform, the ROI Brain, helps companies fully unlock the power of customer relationships and use insights to make the overall business more effective, efficient, and profitable. Our customers including many Fortune 500 brands choose Marketing Evolution because they recognize the value of moving beyond the aggregated and backward-looking limitations of marketing mix and attribution models. Due to very fast growth, we are hiring at all levels; but know that our preference is always to promote from within.\n<br><br>\n<strong>Position Overview</strong>\n<br><br>\nMarketing Evolution provides marketing ROI insights to Fortune 500 companies by aggregating and analyzing vast amount of both public and proprietary data feeds. As a Data Engineer, you will be responsible for building and supporting ETL pipelines to make data consumable by our predictive analytics process.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Design and implement new ETL pipelines based on client business logic.</li>\n<li>Optimize and scale existing ETL pipelines.</li>\n<li>Develop tools to support ETL platform.</li>\n<li>Perform ad-hoc queries to support client teams.</li>\n</ul>\n<strong>Technologies we use</strong>\n\n<ul>\n<li>Python, Spark, AWS, Airflow, Bash, Docker, SQL, Scala, Hive.</li>\n</ul>\n<strong>Skills and Experience</strong>\n<br>\nRequired:\n\n<ul>\n<li>Strong communication skills relating technical work to non-technical people.</li>\n<li>Bachelors degree or higher in a relevant technical field, or comparable work experience.</li>\n<li>Competence in Python and SQL.</li>\n<li>Working knowledge of Unix systems, such as Fedora, CentOS, Redhat, etc.</li>\n<li>Understanding of data quality Best Practices.</li>\n</ul>\nPreferred:\n\n<ul>\n<li>Experience working with big data technologies such as Hadoop, Hive, Pig, Spark, Presto, etc.</li>\n<li>Experience working in a cloud-based infrastructure, such as Amazon AWS or Cloudera.</li>\n<li>Competence in at least one OOP language, such as Java, Scala, C++, etc.</li>\n<li>Experience working with NoSQL database technologies such as MongoDB, Cassandra, etc.</li>\n</ul>\n<strong>Metrics for Success</strong>\n<br><br>\nAll employees have annual career growth goals based on their position and core skills/development areas; youll receive project-based performance reviews quarterly, and career reviews bi-annually.\n<br><br>\nCustomer satisfaction and the ability to drive large efficiency gains are the most important measures of success.\n<br><br>\n<strong>Marketing Evolution Cultural Values</strong>\n<br><br>\nWe seek candidates who are excited to work at a company with the following cultural values:\n\n<ul>\n<li>Disrupt the norm: Cherish the opportunity to find better ways to do things, regardless of how disruptive or initially painful it might be.</li>\n<li>Dissent then execute: Raise issues and fixes in the planning stage, but when its time to execute, execute diligently and without reservation.</li>\n<li>Test and learn: When developing new processes or features, link it to a hypothesis, and evaluate that hypothesis without bias.</li>\n<li>Nothing is impossible: Imagine whats possible and then have the discipline to execute it. One without the other is not valuable.</li>\n<li>Defect is treasure: Every mistake is an opportunity for the organization to learn and make improvements.</li>\n<li>Share success: Given how hard it is to promote change in our industry, celebrate each success along the way.</li>\n</ul>"}