{"job title": "Senior Data Scientist", "company": "Marlette Funding", "city state": "– Newark, CA", "rating": "4.7", "job description": "<strong>Level:</strong> Manager\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nThe Data Scientist will be part of Decision Science team and will partner with various business units to research and develop machine-learning models or any other tools leveraged in the strategies.\n<br><br>\n<strong>Duties &amp; Responsibilities:</strong>\n\n<ul>\n<li>Design, develop, document and maintain machine learning tools (e.g. models) to extract hidden insights in the vast amount of data that Credit, Marketing and/or Operations can use to make their respective strategies and processes more efficient and effective.</li>\n<li>Be the subject matter expert in machine learning algorithms and their applicability.</li>\n<li>From time to time, be involved in search of relevant big data and in assessing 3rd party vendor’s capabilities.</li>\n<li>Cultivate collaborative environment with other business units and internal stakeholders.</li>\n<li>Identify risk and opportunities in different areas of the business.</li>\n</ul>\n\n<strong>Minimum Qualification</strong>\n\n\n<ul>\n<li>Master’s or PhD in quantitative fields. Data science related major is a big plus.</li>\n<li>Proficiency in statistics (e.g. experimental design, hypothesis testing).</li>\n<li>Experienced in obtaining and using big data (structured and unstructured).</li>\n<li>Experienced in using machine learning techniques (Gradient Boosting, Random Forest, Neural Network, etc.). Proficiency in NLP and graph databases is a big plus.</li>\n<li>Experienced with end-to-end machine learning pipeline: From data extraction, feature engineering to model building, performance evaluation and implementation.</li>\n<li>Proficiency in SQL, Python and its machine learning libraries (pandas, scikit-learn, matplotlib, etc.).</li>\n<li>Practical; grabbing small wins frequently.</li>\n<li>Creative; able to think like fraudsters.</li>\n<li>Desire and ability to learn new tools and techniques.</li>\n<li>Able to work independently and collaborate remotely.</li>\n<li>Able to travel to East Coast as needed.</li>\n</ul>\n<strong>Leadership:</strong>\n\n<ul>\n<li>Comfortable interacting and engaging with colleagues from all levels of management across all business units and external auditors.</li>\n<li>Demonstrated technical leadership skills including self-direction, coaching and mentoring, getting buy-ins on the models from all relevant constituents.</li>\n<li>High self-efficacy, highly motivated, well organized, capable of developing and executing a sprint plan, and able to communicate status effectively</li>\n<li>Effectively collaborate remotely.</li>\n</ul>\n<strong>Culture:</strong>\n\n<ul>\n<li>Ability to succeed within a cross-functional team emphasizing Collective Ownership in a fast-paced environment</li>\n<li>Be confident and willing to challenge status quo but also willing to concede and execute other’s ideas when necessary</li>\n<li>Capable of teaching and learning from others to promote continuity of knowledge and personal development</li>\n<li>Ability to work effectively independently and as a team member</li>\n<li>Excellent English written and verbal communication skills</li>\n</ul>\nPlease complete the online employment application, and be sure to attach your resume. Qualified applicants may be contacted within several business days.\n<br><br>\nIn addition to our interview process, all candidates will need to evidence of their initiative, level of analytical reasoning, teamwork, ability to collaborate on projects, adaptability, and strength in verbal and written skills by completing a separate candidate assessment"}