{"job title": "Data Scientist", "company": "Mars, Incorporated", "city state": "– Chicago, IL", "rating": "3.8", "job description": "XX\n<br><br>\n<strong>This Role can be based out of Chicago or Mount Olive, NJ</strong>\n<br><br>\nThis is an exciting time at Mars. Were using digital, data and user insights to transform our business by finding answers to problems that weve often never asked ourselves before. From joining the dots to improve our Petcare data ecosystem, to streamlining the efficiency and automation of our supply chain and quality operations, were already seeing some brilliant results. In fact, weve built so much momentum that were now looking for industry leaders in Business Translation, Data Science and Data Engineering with different and complementary skills to influence how we operate and grow beyond anything weve achieved before. Join us, and discover a company set up to develop your capabilities and ambitions and a group of colleagues ready to support and inspire you. Working together, well create a better world for our planet, our communities and our pets.\n<br><br>\n<strong><em>What youll do</em></strong>\n<br><br>\nInspiring the whole Mars business to adopt data driven decision-making by developing advanced analytics methods is huge in your role. How? By mining vast amounts of data from company databases for insights that will help solve business problems and ultimately make Mars more profitable.\n<br><br>\nWorking in a small multidisciplinary team alongside the Global Analytics, Data Engineering, Business Translation and AI teams, youll partner with Product Owners to solve problems that real users face using advanced digital techniques. That also means closely collaborating with users from our segments and markets around the world to find the right problems to solve. More than that, youll use this direct user exposure to invent true firsts. Thats new and emerging approaches that Mars, and maybe even the industry, havent seen before.\n<br><br>\nA big part of your role will be choosing the most appropriate technique, based on business need and available data, to develop custom data models and algorithms. As part of that, youll also create processes and tools to monitor and analyse model performance and data accuracy. All the time, balancing time to deliver with level of detail and accuracy.\n<br><br>\nWorking with different functional teams, youll implement your models and monitor their outcomes making sure were conforming to data security standards at all times. Thinking about the newest technology, youll make sure were maximising our efficiency and productivity and provide subject matter expertise across the business whenever its needed.\n<br><br>\n<strong><em>What youll need</em></strong>\n<br><br>\nTo do all this, youll need:\n<ul>\n<li>Bachelors degree in Analytics or related quantitative fields (statistics, Operations research, mathematics, econometrics etc.). An advanced degree is preferred.</li>\n<li>2-3 years experience in applied data science role or equivalent. Ideally, it would be in CPG, Telecom or Financial services</li>\n<li>Knowledge and experience in modelling techniques and advanced applied skills. For example significance testing, GLM/Regression, Random Forest, Boosting, Trees, text mining and social network analysis, using tools like Spark, Scala, SAS, R, Python, Bayesia, H2O, Storm, Yarn, and Kafka</li>\n<li>Experience using key external third party data sources including Nielsen/ IRI/ Storeviews, Kantar, Homescan Panel, Retail Execution, Shopper card, first party data and consumer surveys</li></ul> \n\n<ul>\n<li>Experience querying databases (SQL, Hive) and working with big data platforms such as Hadoop ecosystem (Azure), including in-memory solutions (SAP HANA and Apache Spark)</li>\n<li>Working knowledge of data visualization tools such as Tableau, Power BI, D3, ggplot, to deliver output to the broader business community to improve decision making and productivity</li>\n<li>Strong communication and presentation skills</li>\n</ul>\nSo, if youve got the skills we need and youre looking for the opportunity to really make a mark in a world-renowned and supportive business going through a period of fast and massive digital transformation, this could be the role youve been waiting for.\n<br><br>\nMars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request."}