{"job title": "Principal Scientist Plant Chemistry", "company": "Mars Incorporated", "city state": "– Hackettstown, NJ", "rating": "3.8", "job description": "A mutually rewarding experience.\n<br><br>\nWork. Realize your ambitions. And realize theres more to being in business than just making a profit. Thats the Mars philosophy. And the opportunity we offer every one of our Associates. An opportunity to take what you do and make it mean more for you, for those around you and for the planet. What you get here is challenging, interesting work. You get the tools you need to do a great job and you get to have the best possible people on your side to help you do it. And at the same time as getting to find ways to do business better today than we did it yesterday and driving a great career, you also get to build a more enlightened business and drive sustainability.\n<br><br>\nBecause its never just about a single person, a single project or a single brand. Its about how you can grab everything thats within your reach here and use it to pursue mutual, long-term gain. Its about having ideas. And ideals. Being prepared to risk failure because the promise of success means well all be a little better off. Its that mix of integrity and ambition that makes Mars such a special place to work. And why working here is always about more than just a job.\n<br><br>\n<strong>About Mars, Incorporated</strong>\n<br><br>\nMars is a family-owned business with more than a century of history making diverse products and offering services for people and the pets people love. With almost $35 billion in sales, the company is a global business that produces some of the worlds best-loved brands: M&amp;Ms®, SNICKERS®, TWIX®, MILKY WAY®, DOVE®, PEDIGREE®, ROYAL CANIN®, WHISKAS®, EXTRA®, ORBIT®, 5, SKITTLES®, UNCLE BENS®, MARS DRINKS and COCOAVIA®. Mars also provides veterinary health services that include BANFIELD® Pet Hospitals, Blue Pearl®, VCA® and Pet Partners. Headquartered in McLean, VA, Mars operates in more than 80 countries. The Mars Five Principles Quality, Responsibility, Mutuality, Efficiency and Freedom inspire its more than 100,000 Associates to create value for all its partners and deliver growth they are proud of every day.\n<br><br>\nJob Title Principal Scientist Plant Chemistry\n<br><br>\nReports to Global VP COCOA RESEARCH &amp; DEVELOPMENT\n<br><br>\nSegment Mars Wrigley Confectionery\n<br><br>\nFunction R&amp;D\n<br><br>\nJob Level T3\n<br><br>\nLocation/Site Hackettstown, NJ\n<br><br>\n<strong>Job Purpose/Overview</strong>\n<br><br>\nThe role provides holistic program leadership; identifies, formulates, shapes and executes a comprehensive program in Cocoa Plant Chemistry, Biochemistry and Flavor Science in science hubs as well as in satellite facilities in cocoa growing origins. The role manages a team of 2-3 associate scientists in science hub and cocoa origins: Latin America and South-East Asia\n<br><br>\n<strong>Key Responsibilities</strong>\n<br><br>\n<u>ORGANISATION</u>\n<ul>\n<li>Lead and manage team of 2-3 associate scientists in science hub and cocoa origins: Latin America and South-East Asia</li>\n<li>Develop associates through coaching, technical competency improvement, and managerial effectiveness planning</li>\n<li>Manage use of external laboratories, University affiliations, and temporary labor alternatives</li>\n<li>Responsible for technical competency development, staffing, outsourcing, and capital strategy for the plant chemistry, biochemistry and flavor science function</li>\n</ul>\n<u>PROGRAM</u>\n<ul>\n<li>Provide holistic program leadership; identifies, formulate, shape and execute a comprehensive program in Cocoa Plant Chemistry, Biochemistry and Flavor Science in science hubs as well as in satellite facilities in cocoa growing origin.</li>\n<li>Design, build and own the science support infrastructure enabling the post-harvest science projects/teams to access the pod on a tree in the origin research facilities and distribute the research initiatives between the hub and the satellite labs in the origins.</li>\n<li>Operate through the internal and external science networks to articulate the research ambitions, objectives and actively manage involved parties to deliver the milestones to the agreed quality standards and timelines.</li>\n<li>Play an active role in program governance and adherence of the projects to the Mars Science Operating System principles. Be cocoa plant chemistry and flavor science connector to the plant science Research Advisory Board (RAB), Strategic Advisory Board (SAC) and Mars Advance Science Institute (MARI).</li>\n<li>Analyze raw materials and/or finished products for their aroma and taste properties using a range of instrumentation including, but not limited to, preparative and analytical chromatography, mass spectrometry and gas chromatography-olfactometry.</li>\n<li>Identify and implement new plant chemistry, biochemistry and flavor science instrumentation to keep current with technology and drive business objectives</li>\n<li>Lead the development of innovative methodologies for plant research as required by the program</li>\n<li>Assure research is peer reviewed and is publication quality whether the business chooses to publish internally or externally.</li>\n<li>Maintain proper documentation of flavor research and write technical reports, which enable data to be utilized by the business</li>\n<li>Oversee preparation of product prototypes by scientist when necessary to support the research activities</li>\n<li>Keep current with the literature in the field and recommends the adoption of new techniques and /or research opportunities</li>\n</ul>\n<u>BUDGET</u>\n<ul>\n<li>Actively support the development of yearly operational and CAB budgets with the Director of Plant Chemistry. Manage, monitor and deliver the approved budgets in programs the role is accountable for.</li>\n<li>Partner with Plant Chemistry and Flavor science team members in identifying and securing the sources of external funding and supervises their deployment and tracking through the program execution.</li>\n</ul>\n<u>MANAGING RELATIONSHIPS</u>\n<ul>\n<li>Build efficient interfaces between Cocoa Plant Chemistry and Flavor Science and key internal partners securing alignment in program directions, infrastructure development, enabling the potential cross-fertilization, synergies and information flow.</li>\n<li>Be an active member of the Confectionery Flavor community.</li>\n</ul>\n<u>BUSINESS</u>\n<ul>\n<li>Inspire, influence and engage the business stakeholders (R&amp;D leadership, Q&amp;FS, Commercial, Supply and origin leadership teams) by generating a compelling vision of how progress in plant chemistry and flavor science research unlocks the ability to achieve business objectives in delivering the cocoa strategy.</li>\n</ul>\n<strong>Context and Scope</strong>\n<ul>\n<li>The job holder formulates and conducts research in the area of cocoa plant chemistry, biochemistry and flavor science in support of the R&amp;D strategy in cocoa post-harvest area.</li>\n<li>The job holder provides a key interface with all the relevant internal and external research partners and manages the two-directional traffic through this interface.</li>\n<li>The job holder partners with cocoa competency leaders both in cocoa-growing as well as cocoa-processing area synchronizing the research priorities to maximize the program delivery.</li>\n<li>The job holder actively manages and coordinates the Plant Chemistry, Biochemistry and Flavor Science resource to seamlessly connect the program in hub with the satellite facility project work in the cocoa growing origins.</li>\n<li>The job holder manages the allocated overheads and capital funds in the hub and origin facilities to enable and support the program execution.</li>\n</ul>\n<strong>Job Specifications/Qualifications</strong>\n<ul>\n<li>MSc. or preferably PhD. in Chemistry, Biology, Food Science, or a closely related scientific field is required.</li>\n<li>Demonstrated 5+ years of experience successfully leading complex research programs</li>\n<li>Knowledge/Experience</li>\n<li>Demonstrated ability to create a compelling vision and influence the business in pursuing a particular direction.</li>\n<li>A proven track record of the management of complex projects executed by complex, preferably cross-functional teams, a demonstrated ability in holistic program management, and a demonstrated ability to inspire and influence the senior stakeholder groups.</li>\n<li>Experience in developing and deploying the science and technology to harvest the business benefits and ensure security of a material supply.</li>\n<li>Interpersonal skills, cultural flexibility, independent ways of working in a delocalized environment across multiple geographies.</li>\n<li>Strong priority setting - capable of handling multiple priorities simultaneously and promptly, and of foreseeing and addressing issues before they become significant obstacles</li>\n<li>Demonstrated ability to combine the big picture with the attention to detail, strategic with tactical in the business environment.</li>\n</ul>\nMars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request."}