{"job title": "Cloud Storage &amp; Big Data Performance Architect", "company": "Marvell Technology", "city state": "– United States, California, San Jose", "rating": "3.7", "job description": "<div><div><div><div><div>As part of our Performance Engineering group, you’ll help craft solutions that deliver high performance on ARM servers. You’ll work across disciplines to transform define, implement, analyze and optimize solutions.\n<br><br>\nThe performance engineering group works across HW, FW, OS, tools and applications to identify trends, mine data, and help Marvell improve quality and performance of solutions based on ARM servers.\n<br><br>\nThis position requires thorough understanding of open source big data and storage source bases such as hadoop, spark, cassandra etc, as well as deployment models. Defining as well as working with customers on use cases, designing appropriate solutions, analyzing performance against competitive solutions and optimizing the solution from the application all the way to the HW.<br>\n\n<div>\n<div><strong>Required</strong></div><div>\n\n<ul>\n <li>Bachelor’s degree in Computer Science, Electrical Engineering or related fields and 10- 15 years of related professional experience OR Master’s degree and/or PhD in Computer Science, Electrical Engineering or related fields with 5-10 years of experience.</li> <li>5-10 years as data scientist or database engineer</li><li>Solid competency in statistics, working knowledge of data mining algorithms including decision trees, probability networks, association rules, clustering and regression</li><li>Solid analysis and design skills to facilitate creative insight to solution analysis</li><li>Strong experience with Apache Spark, Hadoop, Cassandra or other big data technologies.</li><li>Self-starter with entrepreneurial experience and ability to interact with other disciplines</li><li>Proven Creativity to go beyond current tools to deliver best solution to the problem</li><li>Strong programming skills in Python, or similar language</li></ul></div>\n<br>\n<div><strong>Preferred</strong> </div><div>\n\n<ul>\n<li>Data Engineering or Data Mining experience with cloud deployment</li> <li>Experience with open source participation</li><li>Experience with ARM architecture porting or optimization</li><li>Kernel/Driver level experience</li><li>Solid understanding of modern processors</li> <li>Passion for performance analysis and optimization</li></ul></div><br>\n\n<div>#LI-TM1</div><div>#GLDR</div>\n</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}