{"job title": "Manager, Data Scientist - Brighterion", "company": "MasterCard", "city state": "– San Francisco, California", "rating": "4.0", "job description": "<strong>Who is Mastercard?</strong>\n<br><br>\nWe are the global technology company behind the world’s fastest payments processing network. We are a vehicle for commerce, a connection to financial systems for the previously excluded, a technology innovation lab, and the home of Priceless®. We ensure every employee has the opportunity to be a part of something bigger and to change lives. We believe as our company grows, so should you. We believe in connecting everyone to endless, priceless possibilities.\n<br><br>\n<strong>Job Title</strong><br><br>Manager, Data Scientist - BrighterionOverview\n<br>\nThe Brighterion Modeling Customer Support team is dedicated to support models from existing customers leveraging Brighterion A.I and machine learning technologies. Expending its scope from supporting the EMS and DI platforms, the team is growing its presence in regional locations to better support our customers locally.\n<br><br>\nAs a manager you will lead the regional modeling customer support team and be accountable for delivering high quality deliverables within agreed upon timelines and conducting post- implementation reviews.\n<br><br>\nRole\n<br>\nIn this position, you will be required to:\n\n\n<ul>\n<li>Serves as a mentor for junior-level colleagues, and develops talent via ongoing technical training, peer review etc.</li>\n<li>Delegates and reviews work for junior level colleagues</li>\n<li>Respond to requests received from individual customers, including Mastercard ESS team.</li>\n<li>Oversee the design of model optimizations and implementation of model updates.</li>\n<li>Design, review and analyze automated processes to monitor production models and create dashboards</li>\n</ul>\n\nPerform recommendations (migrate existing customers from one model to a newer one, trigger model optimization, etc.). Design model optimizations and perform model updates and/or coordinate model update execution with Core Modeling team.\n<br><br>\nAll About You\n<br>\n<strong>Essential Skills:</strong>\n\n\n<ul>\n<li>Experience managing day-to-day cross-functional communications and collaboration to meet project deadlines</li>\n<li>Agile and Problem solver</li>\n<li>Strong organizational skills; able to manage multiple tasks within the constraints and timelines determined by business needs</li>\n<li>Experience in A.I. and Machin Learning</li>\n<li>Creative and ingenious</li>\n<li>Experience with SQL language</li>\n<li>Strong knowledge of Linux / Bash environment</li>\n<li>BS in computer science or a related field</li>\n</ul>\n\n<strong>Nice to have:</strong>\n\n\n<ul>\n<li>Databases: Oracle, Postgres, Netezza and Hadoop<br><br>Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law.​\n<br><br>\nIf you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.</li>\n\n</ul>"}