{"job title": "Sr Research / Development Scientist", "company": "Materials Development, Inc.", "city state": "– Chicago, IL", "rating": "2.3", "job description": "Sr Research / Development Scientist Materials Development, Inc. - Acqr + anlyze synchrotron x-ray, neutron scat. data on liquids/glasses/disordered mats from ambient to extr. conds. Select mats. to test /validate x-ray + neutron instr. perf. Synthsz + chrterize glass/ceramic mats. Dsgn exps to exp instr capabilities, assist w/ instr dsgn + optimztion. Dsgn + imp. x-ray spectroscopic studies w/ synchrotron rad. on molten mats. Prep propsls + submsn requests for synchrotron + spallation neutron exps use natl lab user facilites. Prep + submt work for pub. in peer rvd journals + proj rpts. Prsnt research @ natl and internatl confs and mtgs. Collab. w/ beamline scnts and engrs @ Advanced Photon Source, the Spallation Neutron Source + other faclts. Mod struct + prop of disordered mats w/ molclr dynmc + perform Emprcl strctrl model. based on expmtl data. Asst in create/prep docs for pat. filings. Asst in creat/prep docs for SBIR/other grant propsls. Supr jr staff membs/COOP stdnts. Comm. instmt capablts + relev. resrch to pot. clients. Sprvse 1 employee. Travel approx. 5% cstmrs + conf presnt. Req. Mst. or equv.+1 yr rel profl exp which must incld. Acqr + anlyze synchrotron x-ray, neutron scat. data on liquids/glasses/disordered mats from ambient to extr. conds.; Acqr + anlyze synchrotron x-ray, neutron scat. data on liquids/glasses/disordered mats from ambient to extr. conds.; Asst in create/prep docs for pat. filings; Prep propsls + submsn requests for synchrotron + spallation neutron exps use natl lab user facilites Prep + submt work for pub. in peer rvd journals + proj rpts. Any suitable combo of edu/train/exp acceptable. Send resume w/ code 1001 to: Rick Weber, Materials Development, Inc., 825 Chicago Avenue, Suite G; Evanston, Illinois 60602. No calls/emails/faxes/agencies. EOE. Evanston , IL Apply by mail 5061156\n<br>\nrecblid as0z6p8uf423puajskuy2jdsm3e7tl\n<br>"}