{"job title": "Data Scientist - Cybersecurity", "company": "Mayfield", "city state": "– United States", "rating": "NA", "job description": "<strong>About the position:</strong>\n<br>\nVolterra is looking for Data Scientists to join our growing data science team located in Santa Clara and Bangalore. You will work on novel models to analyze and to predict behavior from large scale data passing through Volterra's edge services platform. You will use data modeling, advanced mathematics, and machine learning to analyze data from web firewalls, edge routers and factor behavior-based analytics, identifying threats and finding valuable insights.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n <li>Build mathematical models to derive practical insight from large volumes of data and solve real-world cyber security problems</li> <li>Work with data engineering team to help in architecture and design of data ingestion and manipulation</li> <li>Research and prototype new techniques to identify cyber-attacks based on real-time data</li> <li>Demonstrate leadership by taking ownership of complete lifecycle from development, training, deployment to feedback, refinement of ML models</li> <li>Collaborate with architects, data engineers, and application developers to help in design of edge services</li>\n</ul>\n\n<strong>Minimum qualifications:</strong>\n\n<ul>\n <li>PhD in Computer Science or related</li> <li>8+ yrs. of experience in any of following: Python, C++</li> <li>Deep understanding of building and applying sophisticated statistical models</li> <li>Strong working knowledge of Python ML libraries like sklearn, pandas and numpy</li> <li>Experience in any one of the DL libraries such as Tensorflow, Keras, PyTorch, Caffe</li>\n</ul>\n\n<strong>Preferred qualifications:</strong>\n\n<ul>\n <li>Experience with data visualization libraries and tools such as D3, Tableau</li> <li>Experience with time series data analysis and anomaly detection</li> <li>Experience with text analysis problems such as machine translation and text classification</li>\n</ul>\n\n<strong>About the company:</strong>\n<br>\nVolterra is a startup focused on Edge Computing and funded by leading venture firms - Microsoft Ventures, Mayfield and Khosla Ventures.\n<br>\nVolterra offers a comprehensive benefits package for full-time employees: Medical, Dental, and Vision Insurance; Flexible Spending Accounts (health &amp; dependent care); Life and AD&amp;D Insurance; Short-Term and Long-Term Disability Insurance; 401K; and un-accrued flexible time off.\n<br>\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n<br><br>"}