{"job title": "Radiology Data Analyst", "company": "Mayo Clinic", "city state": "– Scottsdale, AZ", "rating": "4.0", "job description": "City\n<br><br>\nScottsdale\n<br><br>\nState\n<br><br>\nArizona\n<br><br>\nTelecommute\n<br><br>\nYes\n<br><br>\nDepartment\n<br><br>\nRadiology\n<br><br>\nPosition description\n<br><br>\nThis position supports a cross-functional team and provides in-depth data insights for complex business problems that can be approached with advanced analytics techniques to collect, explore, and extract insights from structure and unstructured data. Assists with providing data modeling, mining, pattern analysis and data visualization. Data analyst will be tasked with the process of data extracts and overall data management for various data sources for the radiology department. Data management includes data engineering, data schemas, data architecture, data quality, data security, data governance, data extraction, and loading and transforming from multiple resources. Uses predictive modeling, statistics, and other data analysis techniques to collect, explore, and extract insights from structure and unstructured data. Develop algorithms to apply mathematics to data, perform large scale experimentation and build data driven apps to translate data into intelligence, solve a variety of business problems and enable business strategy. The Data Analyst-Radiology assists the Radiology department with casual inferences and observations by finding patterns, trends, and relationships in data. Candidate must possess human relations skills to interact with a variety of personnel. Evidence of strong communication and organizational skills is required and the analyst must possess the ability to multi-task and prioritize issues appropriately.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nBachelor?s degree in a relevant discipline - for example, Data/Business Analytics, Information Systems, Computer Science, or Data Science with a minimum of 2 years of relevant experience and a proficiency in writing reports from various applications. A combination of education and experience may be considered with a minimum of 5 years demonstrated success as a data analyst. Working structured query language (SQL) knowledge as well as advanced skills using visual reporting tools (e.g. Tableau, MS Power BI, Crystal Reports)\n<br><br>\nAdditional qualifications\n<br><br>\nMaster?s degree in relevant discipline preferred. Experience working in healthcare technology. Exposure to managing both custom developed and vendor-supplied applications is preferred. Background knowledge of Radiology clinical practice operations, radiology systems and objectives for the department is desirable and a combined knowledge of Radiology operations and information technology is highly desirable.Experience with Epic or other EHR reporting options (which could include certification) is also highly desirable\n<br><br>\nExemption status\n<br><br>\nExempt\n<br><br>\nCompensation Detail\n<br><br>\nEducation, experience and tenure may be considered along with internal equity when job offers are extended. The minimum salary every 2 weeks is approx $xxxx.xx, based on a full-time position.\n<br><br>\nBenefits eligible\n<br><br>\nYes\n<br><br>\nSchedule\n<br><br>\nFull Time\n<br><br>\nSchedule details\n<br><br>\nMonday-Friday Normal business hours.\n<br><br>\nSite description\n<br><br>\nMayo Clinic's campuses in Arizona are located in Phoenix and Scottsdale, in the beautiful Sonoran Desert. The region is known as the Valley of the Sun, a metropolitan area with more than 4 million residents in 25 cities and towns.\n<br><br>\nWith Phoenix being the sixth largest city in the nation, this sunny \"desert metropolis\" offers the amenities of a big city in the midst of a strikingly beautiful, rugged, southwest landscape.\n<br><br>\nScottsdale frequently earns praise as a highly desirable place to live. The city's more than 200,000 residents enjoy a vibrant mix of culinary hot spots, arts and entertainment, professional and collegiate sports teams, and community resources. The region's desert climate promotes an outdoor lifestyle with a full complement of sports and recreation.\n<br><br>\nCategory\n<br><br>\nOffice &amp; Administrative Support, Other Patient Care\n<br><br>\nJob posting number\n<br><br>\n<strong>103304BR</strong>\n<br><br>\nRecruiter\n<br><br>\nAmy Christian\n<br><br>\nEqual opportunity employer\n<br><br>\nMayo Clinic is an equal opportunity educator and employer (including veterans and persons with disabilities)."}