{"job title": "Data Scientist", "company": "Mayo Clinic", "city state": "– Rochester, MN", "rating": "4.0", "job description": "<strong>City</strong>\n<br><br>\nRochester\n<br><br>\n<strong>State</strong>\n<br><br>\nMinnesota\n<br><br>\n<strong>Telecommute</strong>\n<br><br>\nNo\n<br><br>\n<strong>Department</strong>\n<br><br>\nOffice of Access Management\n<br><br>\n<strong>Why Mayo Clinic</strong>\n<br><br>\nPosition can be based out of any Mayo Clinic location: Rochester, Florida, Arizona, or Mayo Clicinc Health Systems (MCHS).\n<br><br>\n<strong>Position description</strong>\n<br><br>\nThe Data Scientist position develops predictive models on large-scale datasets to address various business problems through leveraging advanced statistical modeling, operations research, machine learning, or data mining techniques. Data scientists are responsible for providing Consultative Services at an institutional or enterprise level to departments/divisions and committees from any Mayo entity requesting assistance. The Data Scientist will work with other staff in developing demand models, facility capacity and sizing models, physician supply and demand studies, layout efficiency/optimization analysis, process simulation assessments, financial analysis, and strategic planning for outpatient practices of Mayo Clinic across the enterprise. This position also is responsible to gather, analyze, present findings to leadership. The Data Scientist will provide develop the analytics tools that can be used by other staff with non-technical expertise. Duties include: applies advanced statistical and optimization modeling techniques to build, maintain, and improve on multiple real time decision systems; models and frames business scenarios that are meaningful and which impact on critical business processes and/or decisions; develops innovative and effective approaches to solve client's analytics problems and communicates results and methodologies; automates models and metrics that track product performance; integrates analytics with other disciplines to support initiatives, research, and project requirements; communicates insights to key stakeholders, which include technical and non-technical audiences. Must be able to understand, interpret and convey technical information to others, serve as a good team player on large institution wide projects, and independently manage single institution small-scale projects of mild to moderate complexity through the entire project life cycle.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nMaster's degree required. If Master's degree, three years of relevant experience. If a Doctorate degree, one year of relevant experience.\n<br>\nDegree in management, industrial engineering, statistics, economics systems engineering, operations research, analytics is preferred. Experience using advanced engineering techniques, including operational research, queuing analysis, theory of constraints and simulation. Expected level of experience in software programming using OR packages, simulation, R, Python or SAS, and other data mining tools.\n<br><br>\n<strong>Additional qualifications</strong>\n<br><br>\nUnderstanding of health care industry, and associated key performance drivers, business trends, and the latest industry developments in Qualitative, Quantitative and advanced engineering analysis. Demonstrated project management skills, including working with a diverse team, managing budgets, milestones, and schedules. Certified Analytics Professional (CAP) is encouraged.\n<br><br>\n<strong>Exemption status</strong>\n<br><br>\nExempt\n<br><br>\n<strong>Compensation Detail</strong>\n<br><br>\nEducation, experience and tenure may be considered along with internal equity when job offers are extended. The minimum salary every 2 weeks is approx $2669.60, based on a full-time position.\n<br><br>\n<strong>Benefits eligible</strong>\n<br><br>\nYes\n<br><br>\n<strong>Schedule</strong>\n<br><br>\nFull Time\n<br><br>\n<strong>Site description</strong>\n<br><br>\nPosition can be based out of any Mayo Clinic location: Rochester, Florida, Arizona, or Mayo Clicinc Health Systems (MCHS).\n<br><br>\n<strong>Category</strong>\n<br><br>\nAdministration, Business, Finance\n<br><br>\n<strong>Job posting number</strong>\n<br><br>\n<strong>106688BR</strong>\n<br><br>\n<strong>Recruiter</strong>\n<br><br>\nBrianna Hanna\n<br><br>\n<strong>Equal opportunity employer</strong>\n<br><br>\nMayo Clinic is an equal opportunity educator and employer (including veterans and persons with disabilities).\n<br><br>\nEmail"}