{"job title": "Data Scientist", "company": "McAfee", "city state": "– Santa Clara, California, United States", "rating": "3.4", "job description": "<strong>Job Details:</strong><br><br>Job Description:\n<br><br>\nWith the mission of capturing the biggest market share in the area of cyber security, network security, endpoint security, threat research, malware research, cloud security, we work together for a common goal of shaping the companys future by designing and building the best in class robust and scalable security products for consumer and enterprise customers. As industry top performers, we aim to develop optimized high performance system software solutions with high availability and reliability.\n<br><br>\nThis is where you come in. We are looking for a new team member who defined by his/her unique and innovative skills, style or point of view. You can be an architect, scientist, threat researcher, or a coder as long as you design things that matter.\n<br><br>\nThe Data Scientist will develop and enhance advanced data mining algorithms and machine learning, which will help drive data analysis for a wide range of information and product features.\n<br><br>\nEssential Duties and Responsibilities\n<br>\n· Collaborate with other engineers to formulate innovative solutions to experiment and implement advanced data mining algorithms in cloud-based application security space\n<br>\n· Hands-on in application/development of machine learning techniques on the large datasets to solve business problems\n<br>\n· Communicate complex concepts and the results of the analyses in a clear and effective manner to senior management\n<br>\n· Big Data experience, ideally using Hadoop technology stack\n<br><br>\nProfessional Competencies\n<br>\n· Passion for working with big data and professional experience in data mining, statistical analysis, machine learning, predictive modeling and data manipulation preferred\n<br>\n· Working knowledge of Big Data processing, e.g., Map-Reduce and Spark\n<br>\n· Proven ability to work with a team as well as work independently\n<br>\n· A can-do attitude to carry out a project from scratch to production on a timely basis\n<br>\n· A great communicator, execution focus, and superb attention to details\n<br><br>\nRequired Experience and Skills\n<br>\n· Master's Degree in Computer Science, Engineering, or related fields\n<br>\n· 7+ years experience with a Masters Degree as Data Scientist or 3+ years experience with a Doctoral Degree as a Data Scientist\n<br>\n· 2+ years programming experience in a distributed systems environment using one or more of Java, Python or Scala.\n<br>\n· 2+ years model development experience using one of R or Python (scikit-learn)\n<br>\n· 2+ years experience exploring data in using Hive, SQL or SprakSQL.\n<br>\n· Experience and knowledge of Security domain, particularly Anomaly Detection and Behavior Modeling\n<br>\n· Strong understanding of one or more of Bayesian Statistics, Deep Learning, Time Series Analysis, Unsupervised Learning and State Space Models.\n<br>\n· Experience in optimizing big data pipeline a plus\n<br>\n· Excellent problem solver, analytic thinker and quick learner\n<br><br>\nQualifications:<br><br>_<br><br>Job type:<br><br>Experienced Hire<br><br>Shift:<br><br>Shift 1 (United States of America)<br><br>Primary Location:<br><br>US, California, Santa Clara<br><br>Additional Locations:\n<br><br>\nPosting Statement:\n<br><br>\nMcAfee prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}