{"job title": "Data Scientist", "company": "mckesson", "city state": "– United States-Virginia-Richmond", "rating": "3.3", "job description": "McKesson is in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. McKesson Medical-Surgical provides medical-surgical supplies and equipment to physicians' offices, home care agencies, long-term care facilities and surgery centers. Our catalog includes more than 150,000 national brand products from bandages to exam tables, plus McKesson's own line of high-quality medical-surgical products. We're proud to be the only national distributor serving the entire continuum of healthcare.\n<br><br>\nEvery single McKesson employee contributes to our mission—by joining McKesson Medical-Surgical you act as a catalyst in a chain of events that helps millions of people all over the globe. Your expertise, drive and passion can help us improve everything we touch, from providers to payors to pharmacies. You’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.\n<br><br>\nJoin our team of leaders to begin a rewarding career.<br><br><strong>Current Need</strong><br><br>We are seeking a Data Scientist to join our team in Richmond, VA.\n<br><br>\n<strong>Position Description</strong>\n<br>\nMcKesson Medical-Surgical (MMS) Data Scientist position will focus on advanced analytics geared towards promoting customer-benefiting intelligence which helps improve operational efficiency and patient health. This position will be based in our Richmond, VA office. The Data Analyst will collaborate with big data engineers in a cross functional team environment on various proof of concepts and on productionizing advanced analytics business applications on our Hadoop environments.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n <li>Meets and collaborates with business users on requirements, objectives and metrics</li> <li>Performs exploratory data analysis, generates and tests working hypotheses, and uncovers noteworthy trends and relationship</li> <li>Uses Big Data technologies to answer existing questions, as well as develop various data insights from the complete breadth of MMS data</li> <li>Implement algorithms to power user-facing data-driven features</li> <li>Be a champion for data sciences by helping business users understand algorithms outputs thru meaningful metrics and visualizations</li> <li>Able to use sound judgment and prioritize tasks among multiple priorities</li> <li>Results oriented, enthusiastic, creative thinker</li> <li>Self-starter attitude with the ability to excel in dynamic work environments</li>\n</ul>\n\n<strong>Minimum Requirements</strong>\n<br>\n5 years experience in analytics or data related fields\n<br><br>\n<strong>Critical Skills</strong><div>\n\n<ul>\n<li>3 years experience working with large, complex data systems to aggregate, organize, and prepare data for use in business analysis</li> <li>3 years experience using relevant software packages for statistical analyses and visualization (SQL, R, Spark, Python, Tableau/ Power BI)</li> <li>1 years experience working with Classification ML model</li> \n</ul>\n<strong>Additional Knowledge &amp; Skills</strong>\n<ul>\n <li>Excellent communication skills with the ability to distill complex issues into structured frameworks and actionable insights</li> <li>Experience in relational database concepts with a solid knowledge of SQL (PL/SQL knowledge preferred)</li> <li>Experience with Hadoop and hive query language preferred</li> <li>Ability to work independently in a fast paced, unstructured environment</li> <li>Strong mathematical background with knowledge in at least one of the following fields: statistics, data mining, operations research, econometrics, and/or information retrieval (machine learning</li> <li>Deep experience in extracting, cleaning, preparing and modeling data</li> <li>Experience with Linux command-line scripting, data structures, and algorithms</li> <li>Data visualization and presentation skills to effectively communicate data insights</li> <li>Experience with Machine learning implementation on Azure or other public cloud platforms</li>\n</ul>\n\n<strong>Additional Knowledge &amp; Skills</strong>\n<br>\nDemonstrated experience in bridging business requirement and technical development. Experience in working with large complex data systems to aggregate, organize, and preparing data for use in business analysis. Knowledge of data tools, such as SQL, NoSQL, Visual Basic, SAP, IBM, Neteeza, Teradata, Hadoop, and Oracle\n<br><br>\n<strong>Education</strong>\n<br>\nBA or BS degree or equivalent experience.\n<br><br>\n<strong>Physical Requirements</strong>\n<br>\nGeneral Office Demands\n<br><br>\n<strong>Benefits &amp; Company Statement</strong>\n<br>\nMcKesson believes superior performance – individual and team – that helps us drive innovations and solutions to promote better health should be recognized and rewarded. We provide a competitive compensation program to attract, retain and motivate a high-performance workforce, and it’s flexible enough to meet the different needs of our diverse employee population.\n<br><br>\nWe are in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. We partner with payers, hospitals, physician offices, pharmacies, pharmaceutical companies and others across the spectrum of care to build healthier organizations that deliver better care to patients in every setting.\n<br><br>\nBut we can’t do it without you. Every single McKesson employee contributes to our mission—whatever your title, whatever your role, you act as a catalyst in a chain of events that helps millions of people all over the globe. Talented, compassionate people are the future of our company—and of healthcare. At McKesson, you’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.\n<br><br>\nMcKesson is an equal opportunity and affirmative action employer – minorities/females/veterans/persons with disabilities.\n<br><br>\nQualified applicants will not be disqualified from consideration for employment based upon criminal history.\n<br><br>\n<strong>Agency Statement</strong>\n<br>\nNo agencies please.</div>"}