{"job title": "Data Scientist - Journey Analytics", "company": "McKinsey &amp; Company", "city state": "– New York, New York", "rating": "4.3", "job description": "<strong> Qualifications</strong>\n<li> Bachelors degree, preferably in a mathematically intensive field</li> <li> Enthusiasm for analytically intensive work</li> <li> Excitement to learn about technology, and customer operations analytics</li> <li> Enthusiasm to improve the business performance of Journey Analytics clients</li> <li> Understanding of statistical and advanced analytic methods (descriptive statistics, predictive analytics, machine learning)</li> <li> Ability to work collaboratively in a team environment and effectively with people at all levels in an organization</li> <li> Confidence sharing your views and perspectives with senior clients and colleagues</li>\n<strong> Who You'll Work With</strong>\n<br><br>\nYou will work alongside Journey Analytics leaders in New York and the McKinsey Customer Experience leadership team.\n<br><br>\nJourney Analytics is a specialist analytics team dedicated to combining analytics, design and consulting frameworks to improve customer experience by understanding, tracking and predicting sequences of events and interactions, to create better outcomes for businesses and customers in a variety of data-rich industries. Visit us to see what our data scientists have been working on: http://www.mckinsey.com/solutions/journey-analytics\n<br><br>\n<strong> What You'll Do</strong>\n<br><br>\nYou will be the entrepreneurial leader that builds and owns analytics-based assets that bring the value of journey analytics to clients and their customers, at scale.\n<br><br>\nYou will lead a team of specialists, data scientists and data engineers under the mentorship of solution leadership, through all stages of an engagement: defining the project, crafting the business solution, gathering and structuring data, building machine learning models, communicating business impact to senior client leaders, and being the change agent within an organization to make our recommendations a reality.\n<br><br>\nYou will help business leaders answer critical questions related to customer journey mapping, customer experience transformations, digital adoption, multichannel acquisition, and other industry-specific challenges. Through diagnostics, predicting customer behavior, tracking and prescribing interventions to journeys, training up client analytics teams and joint value capture programs, you will help clients achieve tangible improvements across every customer, patient and product journey.\n<br><br>\nYour time will be spent 60% on client delivery, 20% on asset development and 20% on client development.\n<br><br>\nYou'll work on analytics-intensive client engagements, where you will identify and communicate insights and implications to clients, and develop business recommendations. Lastly, you will develop, refine, and disseminate specialized expertise through client work, internal knowledge development efforts, and external reach and relevant activities.<br><br>Functions <li> Strategy</li>"}