{"job title": "Director of Data Engineering", "company": "Medidata Solutions", "city state": "– New York, NY, United States", "rating": "4.1", "job description": "Medidata's unified platform, pioneering analytics, and unrivaled expertise power the development of new therapies for over 1,000 pharmaceutical companies, biotech, medical device firms, academic medical centers and contract research organizations around the world. The Medidata Clinical Cloud® connects patients, physicians and life sciences professionals. Companies on the Medidata platform are individually and collaboratively reinventing the way research is done to create smarter, more precise treatments. For more information: www.mdsol.com.\n<br><br>\nWe know that diverse teams win and are fully committed to selecting leaders and employees that represent the markets in which we operate. We are still led by our Co-founders, Tarek Sherif and Glen de Vries, and have global operations in US, Europe and Asia with over 2000 employees.\n<br><br>\n<strong>Your Mission:</strong>\n<br><br>\nMedidata is looking for a technology leader with experience building data platforms at scale with open source and big data technologies. This position, which reports to the Senior Director, Data Engineering and Analytics, provides an opportunity to build a Clinical Data Repository (CDR) and Data lake that will power game changing innovation in clinical trial research. Opportunities like this are a rarity, don’t miss out!\n<ul>\n<li>Align data engineering programs to a corporate data model and a set of data engineering standards which will enable Medidata to realize maximum value from its data assets</li> <li>Partner with the Chief Data Architect to create a Future State Data Architecture which sets the target for convergence and alignment of all data programs</li><li>As the senior Data Engineering leading, advocate for strong engineering and quality best practices to make sure that the Data is always accurate, timely, and a trusted source for business decisions</li><li>Insure that appropriate levels of governance and compliance are implemented across the data infrastructure</li><li>Build and lead a high performance team through effective hiring, coaching, and growth &amp; development</li><li>Ensure processes, tools, and automation are efficient, effective and scalable</li><li>Drive development and execution of data engineering initiatives</li><li>Develop and support strong cross functional partnerships with Product, Development, Testing, Security &amp; Compliance, Customer Success and Professional Services</li>\n</ul>\n<strong>Your Competencies:</strong>\n<ul>\n<li>Passion for building world-class data platforms that support a global customer base</li><li>Assertive, take-charge, proven manager, team player with a strong results orientation, positive “can do” attitude, and a sense of urgency to get things done</li><li>Experience with key Data technologies, such as Hadoop, Storm, Kafka, NoSQL, Cassandra, Redshift, MapReduce</li><li>10 years of progressive experience in data infrastructure development, with a track record of successful high quality deliveries</li><li>Experience leading and managing technical teams in data and agile engineering best practices</li><li>Proven execution skills and ability to successfully execute against strategy in cooperation with other functions</li><li>Ability to apply both technical competence and interpersonal skills to achieve business outcomes</li><li>High emotional intelligence, sound temperament and professional attitude</li><li>Provide clear, consistent leadership, management and mentoring for direct reports and the broader technology organization</li>\n</ul>\n<strong>Your Education &amp; Experience:</strong>\n<ul>\n<li>Minimum of Bachelor's degree in computer science or related field</li><li>10+ years of experience building and leading a growing data engineering function for cloud products</li> <li>Bonus points: Experience in life sciences industry and/or medical/clinical operations</li>\n</ul>\nMedidata is making a real difference in the lives of patients everywhere by accelerating critical drug and medical device development, enabling life-saving drugs and medical devices to get to market faster. Our products sit at the convergence of the Technology and Life Sciences industries, one of most exciting areas for global innovation. Nine of the top 10 best-selling drugs in 2017 were developed on the Medidata platform.\n<br><br>\nMedidata’s solutions have powered over 14,000 clinical trials giving us the largest collection of clinical trial data in the world. With this asset, we pioneer innovative, advanced applications and intelligent data analytics, bringing an unmatched level of quality and efficiency to clinical trials enabling treatments to reach waiting patients sooner.\n<br><br>\nEEO Statement\n<br><br>\n<strong>US:</strong>\n<br>\nMedidata Solutions, Inc. is an Equal Opportunity Employer. Medidata Solutions provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability status, protected veteran status, or any other characteristic protected by the law. Medidata Solutions complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities.\n<br><br>\n#LI-AS1"}