{"job title": "Data Scientist", "company": "MedStar Health", "city state": "– Washington, DC", "rating": "3.5", "job description": "<div><div>\n<strong>Job Summary</strong> </div>\n<br>\n<div>\n<div> The Database Management and Systems Coordinator will provide data science expertise to support a variety of research projects. In addition, the position is responsible for communicating with team members about how to apply data science to current and future projects.</div>\n</div><br>\n\n<div>\n<strong>Minimum Qualifications</strong>\n<br><br>\n<strong>Education/Training:</strong></div><strong>\n\n<br></strong>\n<br>\n<div>\n<div>\n\n\n<ul>\n\n<li>\n Bachelor’s degree in business, computer science, or related discipline and/or an equivalent combination of training and experience or certificate of computer training.</li> \n</ul>\n\n</div>\n</div><br>\n\n<div><strong>Experience:</strong></div><div>\n<div>\n\n\n<ul>\n\n<li>\n A minimum of 4 to 6 years of progressive experience managing, training, and troubleshooting various software applications</li>\n<li>\n Technical or functional project management experience is preferred</li>\n<li>\n 2 – 3 years of experience in health care setting</li>\n<li>\n Clinical research experience preferred</li>\n<li>\n Demonstrated accountability in task ownership and solution oriented work approach</li>\n<li>\n Knowledgeable in the use of information technology</li>\n<li>\n Experience identifying and implementing process improvements</li>\n</ul>\n\n</div>\n</div><br>\n\n<div><strong>Knowledge, Skills &amp; Abilities:</strong></div><div>\n\n\n<ul>\n\n<li>\n Must be able to work independently using initiative and good judgment.</li>\n<li>\n Proven organizational skills including attention to detail and multi-tasking skills</li>\n<li>\n Excellent verbal and written communication skills</li>\n<li>\n Detail-oriented professional who can quickly adapt to a variety of situations.</li>\n<li>\n Familiarity with online database systems is recommended</li>\n</ul>\n\n</div><br>\n\n<div>\n<strong>Primary Duties and Responsibilities</strong></div><br>\n\n<div>\n\n\n<ul>\n\n<li>\n Contributes to the achievement of established department goals and objectives and adheres to department policies, procedures, quality standards and safety standards. Complies with governmental and accreditation regulations.</li>\n<li>\n Participates in multidisciplinary quality and service improvement teams as appropriate. Participates in meetings, serves on committees and represents the department and hospital/facility in community outreach efforts as appropriate.</li>\n<li>\n Function as the product manager for data science related projects.</li>\n<li>\n Understand and provide recommendations for data science projects set up to align with organizational goals.</li> \n\n\n<li>\n Collaborate with end users, technical support, key stakeholders and organizational leadership.</li>\n<li>\n Work with internal resources and/or vendor, where appropriate, to ensure issues are resolved in a timely manner.</li>\n<li>\n Provide support to end users.</li>\n<li>\n Coordinate the evaluation of upgrades on the test environment and provide feedback to vendor product support regarding the functionality.</li>\n<li>\n Articulate to functional area experts how data analytics might be applied and useful given particular project constraints.</li>\n<li>\n Serve as the organizational representative to audiences seeking input on data analytics.</li>\n<li>\n Implement metrics to track application adoption and present metrics to organization leadership.</li> \n\n\n<li>\n Identify requirements and develop reports to meet organizational reporting needs.</li>\n<li>\n Document business needs and, develop and apply data analytic methods to address those needs.</li>\n<li>\n Participate in data analysis-related activities, as necessary.</li>\n<li>\n Design, develop and disseminate standard adhoc reports as needed. Maintain a library of reports and update designs as necessary. Confirm validity of reports and obtain approval of global reports before release to end users.</li>\n<li>\n Maintain active and effective communication with Scientific Center Administrative Directors (SCAs)s, Principal Investigators (PIs), clinical research coordinators and other MedStar affiliated offices as necessary to keep them updated on changes with the use/functionality/status of the respective applications.</li>\n<li>\n Conduct internal audits of the system and provide a strategy for maintaining data integrity as well as pre established standards of data input into the system.</li>\n<li>\n Consistently demonstrate support for compliance in the performance of job duties and responsibilities by a) developing and maintaining knowledge of, and performing job functions in compliance with, rules, regulations, policies, and statutes that affect his/her job; b) maintaining knowledge of and performing job functions in compliance with MedStar Health and MedStar Health Research Institute policies and procedures; and c) reporting compliance concerns in an appropriate and timely manner.</li>\n</ul>\n\n</div>\n\n<ul>\n \n<li>\n Perform other duties as assigned.</li>\n</ul>\n<strong>About MedStar Health</strong>\n<br>\nMedStar Health is dedicated to providing the highest quality care for people in Maryland and the Washington, D.C., region, while advancing the practice of medicine through education, innovation and research. Our 30,000 associates and 5,400 affiliated physicians work in a variety of settings across our health system, including 10 hospitals and more than 300 community-based locations, the largest visiting nurse association in the region, and highly respected institutes dedicated to research and innovation. As the medical education and clinical partner of Georgetown University for more than 20 years, MedStar is dedicated not only to teaching the next generation of doctors, but also to the continuing education and professional development of our whole team. MedStar Health offers diverse opportunities for career advancement and personal fulfillment.\n<br><br>\nPlease feel free to contact:</div>\n\n<br>"}