{"job title": "Sr. Data Analyst, Quality", "company": "Memorial Hermann", "city state": "– Houston, TX", "rating": "3.7", "job description": "At Memorial Hermann, we're about creating exceptional experiences for both our patients and our employees. Our goal is to provide opportunities for our diverse employee population that develop and grow careers in a team-oriented environment focused on patient care.\n<br><br>\nEvery employee, at every level, begins their journey at Memorial Hermann learning about the history of the organization and its established culture built on trust and integrity. Our employees drive this culture, and we want you to be a part of it.\n<br><br>\nJob Summary\n<br><br>\nPosition is responsible for managing and performing complex analysis and interpretation of data to include monitoring of resources, evaluation of processes and presentation of historical information trends to ensure optimal departmental effectiveness across the enterprise. The incumbent will be responsible for the preparation of data and reports that may be presented at hospital, system and board levels in the organization.Job DescriptionJob Description\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<br><br>\nBachelor's degree in health care administration, nursing, business or a related field, Master preferred.\n<br><br>\nThree to five years' experience in assigned area.\n<br><br>\nTwo years supervisory experience.\n<br><br>\nKnowledgeable in use of Access and Microsoft Office products.\n<br><br>\nDemonstrates commitment to the Partners-in-Caring process by integrating our culture in all internal and external customer interactions; delivers on our brand promise of \"we advance health\" through innovation, accountability, empowerment, collaboration, compassion and results while ensuring one Memorial Hermann.\n<br><br>\n<strong>Principle Accountabilities:</strong>\n<br><br>\nManages analysis and interpretation of data to demonstrate clinical and financial outcomes.\n<br><br>\nManages the development of and implementation of process improvement strategies.\n<br><br>\nManages the enterprise clinical data management program used for strategic planning and day to day robust process improvement and management decisions.\n<br><br>\nAssists in developing report templates for Board, enterprise and hospital level reporting automating the data capture when possible.\n<br><br>\nManages the tracking and reporting of regulatory data requirements and submissions to Center for Medicare and Medicaid, The Joint Commission and other regulatory agencies.\n<br><br>\nAdheres to all Memorial Hermann policies, procedures, and standards, within budgetary specifications, including time management, supply management, productivity, and accuracy of practice.\n<br><br>\nPromotes individual professional growth and development by meeting requirements for mandatory/continuing education, skills competency, supports department-based goals which contribute to the success of the organization; serves as preceptor, mentor, and resource to less experienced staff."}