{"job title": "Data Scientist", "company": "Men's Wearhouse", "city state": "– Fremont, CA", "rating": "3.2", "job description": "<div>Business Title Data Scientist</div> <div> Job Category Marketing &amp; Advertising</div> <div> Work Address Fremont, CA 94538</div> <div> Job Status Full-Time</div> <div> Position Summary &amp; Key Accountabilities\n<br><br>\nTailored Brands, Inc.’s purpose is to help our customers love how they look. We accomplish this by providing a personal, convenient, one-of-a-kind shopping experience with compelling products and world-class service. We help fulfill this mission by providing our employees with an engaging and inclusive workplace focused on teamwork, growth and respect.\n<br><br>\nWe are seeking a highly motivated and experienced Data Scientist to join our Business Insights team in our headquarters in Fremont, CA.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Research and develop methods for measuring and analyzing marketing spend effectiveness</li>\n<li>Research new ways for modeling customer behavior</li>\n<li>Work with Senior Data Scientist to design experiments to answer targeted questions</li>\n<li>Formulate a roadmap of project activity that leads to measurable improvement in business performance metrics/key performance indicators over time.</li>\n<li>Conduct end-to-end analysis that includes data gathering and requirements specification, analysis, ongoing scaled deliverables and presentations.</li>\n<li>Work with Senior Data Scientist to architect, develop and automate analytics solutions</li>\n<li>Help formulate business recommendations (cost-benefit, invest-divest, forecasting, impact analysis) with effective presentations of findings at multiple levels of stakeholders through displays of quantitative information</li>\n<li>Develop comprehensive understanding of Tailored Brands data structures and metrics, advocating for changes where needed for both products and sales activity</li>\n<li>Creatively explore how to use data to continually add value and translate ad hoc questions into flexible methodologies that scale to answer broad problems across the organization</li></ul></div> <div> Skills, Abilities, Experience &amp; Qualifications\n<li>MS or PhD in Statistics or related (e.g., Mathematics, Physics, Ops Research).</li>\n<li>Relevant work experience including statistical software (R, S-Plus, SAS, or similar), databases (Terradata or similar) and scripting languages (such as Python).</li>\n<li>Demonstrated willingness to both teach others and learn new techniques</li>\n<li>Experience articulating business questions, pulling from datasets and using statistics to arrive at an answer. Experience translating analysis results into business recommendations.</li>\n<li>Deep interest and aptitude in data, metrics, analysis and trends, and applied knowledge of measurement, statistics and program evaluation.</li>\n<li>Demonstrated problem solving skills and impeccable business judgment. Effective written and verbal communication skills.</li></div> <div> Work Environment, Physical &amp; Mental Demands\n<li>Ability to work at least 40 hours per week from the Company’s Fremont, California corporate office with flexibility based on project needs</li>\n<li>Exerts up to 10 pounds of force occasionally and/or a negligible amount frequently to move objects.</li></div> \n"}