{"job title": "Principal Data Scientist, Center for Mathematical Sciences", "company": "Merck&amp;Co., Inc.", "city state": "– West Point, PA", "rating": "3.7", "job description": "Requisition ID: QUA007843\n<br><br>\nMerck&amp;Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck Manufacturing Division, MMD, is a team of dedicated, energetic individuals who are committed to being the most trusted supplier of pharmaceuticals and health products worldwide. Our facilities, along with our external contractors, suppliers, and partners, comprise an interdependent global manufacturing network that's committed to delivering a compliant, reliable supply to customers and patients on time, every time, across the globe.\n<br><br>\nThe employee is responsible for the analysis and evaluation of data to meet the needs of the our Manufacturing Division. The employee will, through consultation with employees and teams, provide data science expertise including data wrangling, data evaluation (visualization and numerical analysis) and interpretation of results. The employee will create analytic workflows, dashboards and apps that allow our Manufacturing Division employees to utilize the data we gather in manufacturing activities. In the future this data will increase in size and complexity. The employee will provide innovations in data science and bring in new technology as appropriate. They will be involved in external regulatory and industry collaborations to learn from and influence the external environment.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education Minimum Requirement:</strong>\n\n\n<ul>\n<li>A minimum of 5 years of experience in a science-based analytics role. MS or PhD in Data Science, Statistics, Mathematics, Engineering or Biology (with emphasis on data analysis).</li>\n</ul>\n\n<strong>RequiredExperience and Skills:</strong>\n\n\n<ul>\n<li>Deep technical skills including statistics, programming (R, Python), data management (SQL), multivariate analysis, machine learning, data science.</li>\n<li>The employee will need the following non-technical skills: business acumen, a curiosity about science and engineering needed to supply Merck's products.</li>\n<li>Excellent oral and written communication skills.</li>\n</ul>\n\n<strong>Preferred Experience and Skills:</strong>\n\n\n<ul>\n<li>Additional experience in Engineering, Biology, Chemistry.</li>\n<li>Six Sigma is considered a plus.</li>\n</ul>\n\n<strong>MMDHJ</strong>\n<br><br>\nYour role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we're counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we're inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com.\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck&amp;Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nVisa sponsorship is not available for this position.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster\n<br><br>\nEEOC GINA Supplement\n<br><br>\nJob: Quantitative Sciences Generic\n<br><br>\nOther Locations: Kenilworth, NJ, US\n<br><br>\nEmployee Status: Regular\n<br><br>\nTravel: Yes, 10 % of the Time\n<br><br>\nNumber of Openings: 1\n<br><br>\nShift (if applicable): 1st\n<br><br>\nHazardous Materials: no\n<br><br>\nCompany Trade Name: Merck\n<br><br>\nNearest Major Market: Philadelphia"}