{"job title": "Scientist, In Vivo Pharmacology Image-Guided Radiotherapy", "company": "Merck KGaA", "city state": "– Billerica, MA", "rating": "3.7", "job description": "<strong>Your role:</strong>\n<br><br>\nThe successful candidate will be responsible for the hands-on execution of in vivo immunopharmacology studies with a specific focus on the application of precision, image-guided irradiation in experimental mouse tumor models.\n<br><br>\nYou will be responsible for developing mouse tumor radiotherapy models using the Xstrahl Small Animal Radiation Research Platform (SARRP) and will provide hands-on technical expertise to support the non-clinical development of novel radiotherapy/immune-oncology combination therapies. The successful individual will collaborate closely with teams across development programs and contribute to the execution of a research strategy focused on the evaluation of novel cancer immunotherapy approaches in combination with radiotherapy.\n<br><br>\n<strong>Who you are:</strong>\n\n\n<ul>\n<li>Bachelor's degree with 4+ years of experience, master's degree with 2+ years of experience, PhD, or DVM strongly preferred</li>\n<li>Candidates with industry or professional experience are preferred</li>\n<li>Bachelor's degree with 3+ plus years of experience or master's degree minimum requirement</li>\n<li>Hands on experience using an image-guided, precision irradiation system in a research or veterinary setting is strongly preferred</li>\n<li>The candidate should be proficient in handling rodents (rats, and mice), able to prepare formulations, administer compounds via various routes (IV, PO, IP), and collect blood or tissue samples for analysis</li>\n<li>Previous experience using methodologies to interrogate the immune system (i.e. multi-color flow cytometry, ELISPOT, etc.) is a plus</li>\n<li>The candidate will be expected to keep abreast of cutting-edge developments in the fields of radio/immunotherapy and animal radiotherapy to serve as a knowledge expert across programs</li>\n<li>The candidate should be proficient in data collection/documentation all study results in the form of lab notebook reports and, as needed, contribute to the authorship of regulatory submission documents</li>\n<li>Demonstrated ability to work in a diverse team setting and collaborate effectively on complex projects, troubleshoot effectively and think proactively</li>\n<li>A background in immunology or cancer immunology, is desired</li>\n</ul>\n\nJob Requisition ID: 184103\n<br><br>\nLocation: Billerica\n<br><br>\nCareer Level: C - Professional (1-3 years)\n<br><br>\nWorking time model: full-time"}