{"job title": "Associate Principal Clinical Scientist, Oncology", "company": "Merck", "city state": "– Lansdale, PA", "rating": "3.7", "job description": "Merck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck?s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world?s premier, most research-intensive biopharmaceutical company. Today, we?re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck?s leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nResponsible for the clinical/scientific execution of clinical protocol(s)/program. Lead for all scientific aspects of the implementation and conduct of clinical studies (e.g, Scientific Advisory Committee [SAC], Data Monitoring Committee [DMC], Adjudication, medical monitoring). Serves as the CSSM scientific lead on the clinical trial team (CTT). Collaborates with the Medical Writer on clinical/scientific and regulatory documents and Study Manager on study deliverables. Builds talent and capabilities of junior team members through proactive coaching, mentoring and development opportunities. May include management of direct reports including assignment of resources, professional development and performance management.\n<br><br>\n<strong>Education Minimum Requirement:</strong>\n<br><br>\n+ Degree in the Life Sciences or significant experience in clinical development (&gt; 15 years)\n<br><br>\n+ Bachelor?s Degree with 11 years?; or MS with 8 years?; or PhD with 2 years? relevant career experience.\n<br><br>\n<strong>Required Experience and Skills:</strong>\n<br><br>\n+ Pharmaceutical and/or clinical drug development experience.\n<br><br>\n+ Excellent oral (including presentation) and written communication, and computer/database management skills.\n<br><br>\n<strong>Preferred Experience and Skills:</strong>\n<br><br>\n+ Oncology experience\n<br><br>\nYour role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we?re counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we?re inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com .\n\n\n<ul>\n<li>*Search Firm Representatives Please Read Carefully:**</li>\n</ul>\n\nMerck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster at http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\nEEOC GINA Supplement? at http://www1.eeoc.gov/employers/upload/eeoc_gina_supplement.pdf\n<br><br>\nOFCCP EEO Supplement at https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\n<br><br>\nMerck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of it?s manifestations.\n\n\n<ul>\n<li>*Job** _Clinical Research - Clin Ops_</li>\n<li>*Other Locations:** _NA-US-MA-Boston, NA-US-NJ-Rahway_</li>\n<li>*_Title:_** _Associate Principal Clinical Scientist, Oncology_</li>\n<li>*_Primary Location:_** _NA-US-PA-Upper Gwynedd_</li>\n<li>*_Requisition ID:_** _CLI008087_</li>\n</ul>"}