{"job title": "Associate Scientist -Assay Development and Automation", "company": "Merck &amp; Co., Inc.", "city state": "– West Point, PA", "rating": "3.7", "job description": "Requisition ID: BIO005209\n<br><br>\nMerck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world's premier, most research-intensive biopharmaceutical company. Today, we're doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck's leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nVaccine Analytical Development in Merck Research Labs, West Point, PA is seeking a candidate for a laboratory automation and development position. The successful candidate will be part of an automation team which designs, programs, tests maintains and supports automated analytical equipment and processes in order to complete analytical methods. Development and support of high-throughput, quantitative, and automated biochemical, immunological, and cell - based assays includes set up, programming and maintenance of complex automated liquid handling and integrated robotics systems. Responsibilities include planning and executing experiments to optimize assay and automation performance, application programming for automation of assay control and operation, data reduction, and data reporting. The position will mainly support vaccine development.\n<br><br>\nThe successful candidate will be responsible for various aspects of assay development and support involving the use of robotic instrumentation to automate bioanalytical assays, and should have a working knowledge of standard immunological methods, and aseptic cell - culture technique. The candidate would also maintain automated equipment in a standardized environment, investigate new technologies, and incorporate new instrumentation into existing systems. The candidate will possess excellent communication and customer service skills, and ability to work in a team environment. Experience with computer programming language is strongly preferred. Laboratory automation, industrial experience, statistics experience and a working knowledge of GMP / GLP would be beneficial.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education Minimum Requirement:</strong>\n\n\n<ul>\n<li>B.S. / B.A. Degree in Engineering, Science or Informatics</li>\n</ul>\n\n<strong>Required Experience and Skills:</strong>\n\n\n<ul>\n<li>Experience (theory and application) with a variety of analytical assays, including biochemical, cell- based, and immunoassays.</li>\n<li>Previous experience with a programming language, image processing, or system control applications (eg Visual Basic, C++, Java, MatLab )</li>\n<li>Excellent organizational and problem solving skills with the ability to work on a team.</li>\n</ul>\n\n<strong>Preferred Experience and Skills:</strong>\n\n\n<ul>\n<li>Exceptional planning skills and ability to prioritize and track multiple projects.</li>\n<li>Demonstrates the ability to work independently and / or in a team environment and is results oriented.</li>\n<li>Understanding of the regulatory guidelines governing operation of GMP laboratories and documentation.</li>\n</ul>\n\nYour role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we're counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we're inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com.\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster\n<br><br>\nEEOC GINA Supplement\n<br><br>\nJob: Biologics, Vaccines, Analytical Formulat\n<br><br>\n<strong>Other Locations:</strong>\n<br><br>\nEmployee Status: Regular\n<br><br>\nTravel: No\n<br><br>\nNumber of Openings: 1\n<br><br>\nShift (if applicable): N/A\n<br><br>\nHazardous Materials: BL2 organisms\n<br><br>\nCompany Trade Name: Merck\n<br><br>\nNearest Major Market: Philadelphia"}