{"job title": "Data Scientist", "company": "Merck", "city state": "– Kenilworth, NJ", "rating": "3.7", "job description": "Merck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck?s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world?s premier, most research-intensive biopharmaceutical company. Today, we?re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck?s leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nThe Merck, Biologics Process Research and Development organization is responsible for the development of upstream and downstream processes supporting both development and commercial process development and transfer for biologics pipeline. Due to the breadth of responsibilities for Biologics PR&amp;D collaboration across divisions including discovery, commercialization, and external partners is required .The downstream process development and engineering (DPDE) group within Biologics PR&amp;D in Kenilworth, NJ is seeking a motivated and experienced data scientist to join our team to support internal technology initiatives for both our current diverse pipeline and next-generation bioprocessing initiatives within Merck Research Labs. The individual will be responsible for leading modeling initiatives including bioprocess economics analysis, plant scheduling and optimization, systems biology, unit operation mechanistic modeling, and advanced digital platforms for big data. The individual will also be responsible for establishing and building upon automation platforms both for process control systems as well as stand-alone equipment with custom programming solutions required to meet technology development initiatives (robotic handlers etc.). This senior scientist should be a subject matter expert in data science with a core knowledge of biotherapuetic development. Candidates should have a strong scientific and computer science background with independent data analysis, model building, process automation and simulation experience.\n\n\n<ul>\n<li>*Education Minimum Requirement:**</li>\n</ul>\n\n<strong>?</strong>\n<br>\nMS with 3 years of experience\n<br>\nor a new Ph.D\n\n\n<ul>\n<li>*Required Experience and Skills:**</li>\n</ul>\n\n<strong>?</strong>\n<br>\nDeep technical skills including\n<br>\ncomputer programming (R, Python or similar)\n<br><br>\n<strong>?</strong>\n<br>\nData management (SQL) and data\n<br>\nvisualization techniques\n<br><br>\n<strong>?</strong>\n<br>\nMultivariate analysis, data\n<br>\nscience\n\n\n<ul>\n<li>*Preferred Experience and Skills:**</li>\n</ul>\n\n<strong>?</strong>\n<br>\nUnit operation\n<br>\nmodel building (mechanistic)\n<br><br>\n<strong>?</strong>\n<br>\nMachine learning\n<br><br>\n<strong>?</strong>\n<br>\nBioprocess economic modelling\n<br>\npackages such as Biosolve, SuperPro, Bio-G or similar\n<br><br>\n<strong>?</strong>\n<br>\nTotal Cost of Ownership / Net\n<br>\nPresent Value analysis\n<br><br>\n<strong>?</strong>\n<br>\nApproaches for systems biology\n<br>\nand proteomics analysis\n<br><br>\n<strong>?</strong>\n<br>\nUnderstanding of scripting\n<br>\napproaches to build automation across platforms such as DeltaV, Pi, SIPAT,\n<br>\nTecan and similar\n<br><br>\n<strong>?</strong>\n<br>\nApproaches for chemometric\n<br>\nmodeling of spectral data sources\n<br><br>\n<strong>?</strong>\n<br>\nApproaches for complex\n<br>\nResidence Time Distribution Modeling\n<br><br>\nYour role at Merck is\n<br>\nintegral to helping the world meet new breakthroughs that affect generations to\n<br>\ncome, and we?re counting on your skills and inventiveness to help make\n<br>\nmeaningful contributions to global medical advancement. At Merck, we?re\n<br>\ninventing for life.\n<br><br>\nIf you need assistance\n<br>\nand/or a reasonable accommodation due to a disability during the application or\n<br>\nthe recruiting process, please send a request to staffingaadar@merck.com .\n\n\n<ul>\n<li>*Search FirmRepresentatives Please Read Carefully:**</li>\n</ul>\n\nMerck &amp; Co., Inc. is\n<br>\nnot accepting unsolicited assistance from search firms for this employment\n<br>\nopportunity. Please, no phone calls or emails. All resumes\n<br>\nsubmitted by search firms to any employee at Merck via email, the Internet or\n<br>\nin any form and/or method without a valid written search agreement in place for\n<br>\nthis position will be deemed the sole property of Merck. No fee will be\n<br>\npaid in the event the candidate is hired by Merck as a result of the referral\n<br>\nor through other means.\n<br><br>\nFor more information\n<br>\nabout personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster at http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n<br><br>\n<strong>EEOC GINA</strong>\n<br>\nSupplement? at http://www1.eeoc.gov/employers/upload/eeoc_gina_supplement.pdf\n<br><br>\nOFCCP EEO Supplement at https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\n<br><br>\nMerck is an equal opportunity\n<br>\nemployer, Minority/Female/Disability/Veteran ? proudly embracing diversity in\n<br>\nall of its manifestations.\n\n\n<ul>\n<li>*Job** _Bio Process-Purif/Recovery_</li>\n<li>*Title:** _Data Scientist_</li>\n<li>*Primary Location:** NA-US-NJ-Kenilworth</li>\n<li>*Requisition ID:** _BIO005370_</li>\n</ul>"}