{"job title": "Associate Scientists, Immunology", "company": "Merck KGaA", "city state": "– Billerica, MA", "rating": "3.7", "job description": "<strong>ASSOCIATE SCIENTISTS, IMMUNOLOGY</strong>\n<br><br>\n<strong>Job Location:</strong>\n<br><br>\nEMD Serono Research &amp; Development Institute, Inc.\n<br><br>\n45A Middlesex Turnpike\n<br><br>\nBillerica, Massachusetts 01821\n<br><br>\n<strong>Send resumes to:</strong>\n<br><br>\nEMD Serono Research &amp; Development Institute, Inc.\n<br><br>\n400 Summit Drive\n<br><br>\nBurlington, Massachusetts 01803\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nThe Associate Scientist, Immunology, will be responsible for the following job duties:\n\n\n<ul>\n<li>Perform and design experiments using cell based and immunological assays to advance drug discovery research programs;</li>\n<li>Plan, design, and perform methodologies and execute projects related to T cell cultures and isolation of immune cell types according to plans and protocols with appropriate supervision;</li>\n<li>Interpret data, draw conclusions, and present results in connection with immunological techniques both within and outside of his or her group;</li>\n<li>Work independently after training and follow safety rules and regulations;</li>\n<li>Maintain records of all cell-based and immunological assay experimentation and establish protocols; and</li>\n<li>Contribute critically to improve techniques or strategies.</li>\n</ul>\n\n<strong>Requirements &amp; Qualifications:</strong>\n\n\n<ul>\n<li>Master's degree in Pharmaceutical Science, Biotechnology, or a closely related field and one (1) year of work experience in assay design and development within a Pharmaceutical or Biotechnology industry;</li>\n<li>Demonstrated ability isolating, growing, and developing blood derived white cells, such as T lymphocytes, macrophages, and dendritic cells, gained through one (1) year of lab bench experience;</li>\n<li>Demonstrated ability performing high throughput ELISA based assays gained through one (1) year of work experience;</li>\n<li>Demonstrated ability conducting phenotypic analysis of cells using Flow Cytometry gained through one (1) year of lab bench experience;</li>\n<li>Demonstrated knowledge of Graphpad prism and Spotfire gained through one (1) year of work experience;</li>\n<li>Demonstrated ability working in a Quality Level 2 laboratory or GLP2 level laboratory gained through one (1) year of work experience;</li>\n<li>Demonstrated knowledge of automation technology such as Bravo, Via Flow, and iQue Screener gained through one (1) year of work experience; and</li>\n<li>Demonstrated ability conducting gene expression analysis from primary and culture blood cells gained through one (1) year of work experience.</li>\n</ul>\n\nAll years of experience may be gained concurrently.\n<br><br>\nThis position is eligible for the EMD Serono Research &amp; Development Institute, Inc. Employee Referral Program.\n<br><br>\n<strong>Please mail resumes to:</strong>\n<br><br>\nEMD Serono Research &amp; Development Institute, Inc.\n<br><br>\nHR Services\n<br><br>\nAttn: Req #183915\n<br><br>\n400 Summit Drive\n<br><br>\nBurlington, Massachusetts 01803\n<br><br>\nJob Requisition ID: 183915\n<br><br>\nLocation: Billerica\n<br><br>\nCareer Level: C - Professional (1-3 years)\n<br><br>\nWorking time model: full-time"}