{"job title": "Scientist, Protein Purification", "company": "Merck KGaA", "city state": "– Billerica, MA", "rating": "3.7", "job description": "<strong>Your role:</strong>\n\n\n<ul>\n<li>Responsible for activities ranging from protein purification, filtration, pre-formulation, biochemical and biophysical characterization of proteins</li>\n<li>Execute routine protein purification with affinity, size exclusion, ion exchange chromatography using AKTA FPLC systems (Unicorn software)</li>\n<li>Perform high-throughput small scale purification</li>\n<li>Perform analyses including SDS-PAGE, SE-HPLC, DSC, ELISA, etc.</li>\n<li>Provide expertise and insight to guide development of effective purification strategies</li>\n<li>Develop novel purification processes as well as using standard methods to purify proteins from the mg to gram scale</li>\n<li>Perform, develop and optimize robust, efficient, scalable strategies for improving process performance. Activities will include small-scale studies and pilot scale purification studies</li>\n<li>Train junior staff members including co-op students</li>\n<li>Initiate and champion innovative technologies</li>\n<li>Demonstrate ability to work effectively in teams, both within the group and cross-functionally</li>\n<li>Analyze and interpret data, present/document the results at meetings, provide reports and prepare scientific presentations as needed, and write/revise SOPs and technical reports</li>\n</ul>\n\n<strong>Who you are:</strong>\n\n\n<ul>\n<li>Master's degree with 3 plus years or PhD in biotechnology, biochemistry, engineering, or relevant field, strongly preferred.</li>\n<li>Bachelor's degree 3+ years of experience or master's degree required</li>\n<li>Solid and proven theoretical basis and hands-on experience in protein purification and analytical characterization.</li>\n<li>Expertise in protein structure, function and purification: e.g., purification of affinity-tagged, secreted proteins as well as \"problematic\" proteins (low expression, poor solubility, intra-cellular expression, prone to breakdown, etc.).</li>\n<li>Hands-on experience with purification unit operations including filtration, chromatography, TFF, UF/DF, AKTA, UNICORN and HPLC systems. Hands-on experience in troubleshooting and routine instrument maintenance.</li>\n<li>Proficient in protein extraction and solubilization methods, protein refolding and purification via affinity, hydrophobic interaction (HIC), ion exchange (IEX), size exclusion (SEC) and mixed-mode chromatography</li>\n<li>Knowledge and skills in biochemical characterization of proteins including analytical and biophysical techniques. Experience with protein formulation strategies is highly desirable.</li>\n<li>Proven track record in Purification Process Development is necessary with emphasis on chromatographic separations and excellent understanding of and experience with chromatographic resin screening and process optimization. Experience with scale-up and GMP manufacturing is desirable but not necessary.</li>\n<li>Interest in evaluating and developing new protein purification technologies is required.</li>\n<li>Knowledge of mammalian, microbial and yeast protein expression is a plus.</li>\n</ul>\n\nJob Requisition ID: 183900\n<br><br>\nLocation: Billerica\n<br><br>\nCareer Level: C - Professional (1-3 years)\n<br><br>\nWorking time model: full-time"}