{"job title": "Associate Scientist", "company": "Merck &amp; Co., Inc.", "city state": "– West Point, PA", "rating": "3.7", "job description": "Requisition ID: BIO005288\n<br><br>\nMerck &amp; Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.\n<br><br>\nMerck is on a quest for cures and is committed to being the world's premier, most research-intensive biopharmaceutical company. Today, we're doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck's leading discovery capabilities and world-class small molecule and biologics R&amp;D expertise to create breakthrough science that radically changes the way we approach serious diseases.\n<br><br>\nThe Vaccine Process Development (VPD) department in West Point, PA is seeking a highly motivated scientist/engineer to join their downstream process development team in support of our organization's expanding vaccine pipeline. The VPD downstream group develops purification processes for the manufacture of vaccine candidates encompassing a diverse range of biomolecules, including viruses, recombinant protein subunits, nucleic acids, and polysaccharide-protein conjugates. The successful candidate will be responsible for applying sound scientific understanding and engineering principles to help develop, optimize, scale-up, and transfer of downstream processes for clinical and commercial manufacture. The position involves working in a highly inter-disciplinary environment as an individual scientific contributor under the supervision of a senior scientist. The individual is expected to work well in teams, including cross-functional collaboration with other bioprocess functional areas.\n<br><br>\nThe primary job responsibility will be to deliver on specific assigned objectives related to development of robust and scalable processes for the manufacture of clinical supplies and subsequent technical transfer of such processes to GMP operations. The successful candidate will have a strong working knowledge of chromatography, membrane filtration, and centrifugation technologies and be able to apply this understand towards process development challenges. Experience in programming (e.g. Visual Basic, Python) and statistical &amp; data visualization software (e.g. Excel, Spotfire, JMP, Design Expert) will be considered as a positive factors. In addition to the core responsibilities outlined above, the individual is expected to have an understanding of the regulatory guidelines governing cGMP manufacture, keep careful notes, comply with all required training, and maintain a focused attention on laboratory safety.\n<br><br>\nOur ability to excel depends on integrity, knowledge, imagination, skill, diversity and teamwork. To this end, we strive to create an environment of mutual respect, encouragement and teamwork. As part of our team, you will have the opportunity to collaborate with talented and dedicated colleagues throughout our organization while developing and expanding your career.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Education Minimum Requirement:</strong>\n<br><br>\nBS degree (or BS degree to be completed by Spring/Summer of 2019) in Chemical Engineering or Biological Sciences.\n<br><br>\n<strong>Required Experience and Skills:</strong>\n\n\n<ul>\n<li>Experience in preparative purification of proteins, viruses, VLPs, and/or other biological molecules</li>\n<li>Technical background in chromatography, membrane filtration, and common biochemical analytical techniques.</li>\n<li>Ability to understand and execute experiments independently in fulfillment of assigned program objectives in a manner that meets quality and timeline expectations</li>\n<li>Well-developed organizational, record-keeping, and problem solving skills, with an attention to detail.</li>\n<li>Excellent communication and interpersonal skills to work in a cross-functional team environment.</li>\n</ul>\n\n<strong>Preferred Experience and Skills:</strong>\n\n\n<ul>\n<li>At least 1 year of downstream process development experience for vaccine candidates and/or therapeutic biologics, including experience in process operations scale-up.</li>\n<li>Relevant experience in an academic research laboratory or as intern or co-op in an industrial setting</li>\n<li>Familiarity with established safety practices for working with live viruses including hands-on experience with Biosafety Level 2 operations</li>\n<li>Experience in programming (e.g. Visual Basic, CC+, MatLab) and statistical/visualization software.</li>\n<li>Communication of scientific information through oral presentations and written documents.</li>\n<li>Familiarity with GxP principles and regulations.</li>\n</ul>\n\nYour role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we're counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we're inventing for life.\n<br><br>\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com.\n<br><br>\n<strong>Search Firm Representatives Please Read Carefully:</strong>\n<br><br>\nMerck &amp; Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.\n<br><br>\nVisa sponsorship is not available for this position.\n<br><br>\nFor more information about personal rights under Equal Employment Opportunity, visit:\n<br><br>\nEEOC Poster\n<br><br>\nEEOC GINA Supplement\n<br><br>\nOFCCP EEO Supplement\n<br><br>\nMerck is an equal opportunity employer, Minority/Female/Disability/Veteran proudly embracing diversity in all of it's manifestations.\n<br><br>\nJob: Bio Process-Purif/Recovery\n<br><br>\n<strong>Other Locations:</strong>\n<br><br>\nEmployee Status: Regular\n<br><br>\nTravel: Yes, 10 % of the Time\n<br><br>\nNumber of Openings: 1\n<br><br>\nShift (if applicable): 1st\n<br><br>\nHazardous Materials: BSL1 and BSL2 viruses\n<br><br>\nCompany Trade Name: Merck\n<br><br>\nNearest Major Market: Philadelphia"}