{"job title": "Marketing Data Analyst - San Jose, Req", "company": "Meriwest Credit Union", "city state": "– San Jose, CA, US", "rating": "4.1", "job description": "<p><u>Marketing Data Analyst</u></p><p></p><p><strong><br></strong></p><p><strong>Position Summary:</strong><br><br><br>Performs quantitative research and data analytics using statistical methodology. Performs studies to determine impact of products and services offered, market potential and competitive intelligence. Recommends marketing activity based on research, evaluation and a thorough understanding of the members usage and adoption. Assists in development of products and promotions by providing analysis and trend reports as needed.</p><p></p><p><strong>Qualifications:</strong></p><ul><li>B.A./B.S. degree in Marketing, Marketing Research, Statistics, Mathematics or related field. </li><li>Experience in data analytics, data visualization and quantitative market research is required. </li><li>Financial institution experience is preferred.</li><li>Strong data analytical skills, demonstrated ability to handle multiple projects simultaneously, perform competitive analysis and evaluate impact of consumer promotions. Strong written and oral communication skills. </li><li>Ability to present complex information in an understandable and compelling manner is necessary. </li><li>Experience with MS - Excel, survey research and statistical analysis software, analytical tools, data visualization tools and mapping software and online data services. </li><li>Familiarity with Business Objects, Qlik and Machine learning is a plus.</li></ul><p><strong>Essential Duties and Responsibilities:</strong> </p><ul><li>Performs statistical and data analysis as required. Develops graphs, reports and presentations. Creates and presents quality dashboards. </li><li>Identifies, analyzes and interprets trends and patterns in data sets to gain an in depth understanding of the credit union members. Uses results of machine learning to develop member segments for effective target marketing of products and services.</li><li>Performs primary and secondary market research via developing and implementing surveys to assess member feedback. Analyze data collected and communicate results to management. Implements data collection systems and updates. </li><li>Provides market and competitive evaluation reports. Monitors trends in competitor activity and provides timely updates.</li><li>Assists in development and production of direct marketing initiatives through analysis of target market universe, customer segment development and targeted list production. </li><li>Evaluates the impact of marketing communications, advertising and product launches and provides timely and relevant feedback to stakeholders. Performs other duties as assigned. </li></ul><p><strong>Do you want to be valued as an employee?</strong></p>Employees are Meriwest’s most valuable resource. We provide competitive wages and a supportive environment that promotes career advancement. We also offer an excellent, fully comprehensive benefits program, including:<ul><li>Medical/Dental/Vision on the first day of employment for full-time employees</li><li>Free Long Term Care Insurance for employees</li><li>Education Assistance</li><li>Pension Plan/401K</li><li>Bonus and incentive potential</li><li>Generous Paid Time Off (PTO)/Holiday program </li><li>Employee loan discounts on new mortgages, after 6 months of employment</li><li>Career growth support </li><li>In-house fitness center</li></ul><strong>To apply for this position:</strong><ul><li>All resumes must reference: Req #3199 when applying for this position</li></ul><br><br><div>D/M/F/V<br>EEO</div><p> </p><br>"}