{"job title": "Analytics - Director -Data Scientist", "company": "Merkle", "city state": "– Culver City, California", "rating": "3.2", "job description": "Company Description<br><br><p>Merkle is a leading data-driven, technology-enabled, global performance marketing agency that specializes in the delivery of unique, personalized customer experiences across platforms and devices. For more than 30 years, Fortune 1000 companies and leading nonprofit organizations have partnered with Merkle to maximize the value of their customer portfolios. The agencys heritage in data, technology, and analytics forms the foundation for its unmatched skills in understanding consumer insights that drive people-based marketing strategies. Its combined strengths in performance media, customer experience, customer relationship management, loyalty, and enterprise marketing technology drive improved marketing results and competitive advantage. With 4,400+ employees, Merkle is headquartered in Columbia, Maryland, with additional offices in the US, Europe, and Asia. In 2016, the agency joined the Dentsu Aegis Network.</p><br>Job Description<br><br><p>The Audience Analytics M1 Data Scientist ensures timely delivery of data, analytics and strategic consulting to support the clients people based marketing initiatives with an emphasis on working with the media team. Provides direction and manages the work processes and output of a team of analysts. Develops and/or communicates strategy to implement the objectives of the organization and guides others in linking their activities to the objectives. Evaluates client needs for quantitative analysis. Participates in creating and articulating relevant solutions for clients and in developing methods or processes for implementation. Leverages knowledge of statistical modeling techniques to provide suggestions or guidance to teams under their oversight. Provides direction on optimizes clients multi-channel campaigns. </p><p> </p><p>Perform advanced analytics tasks, including but not limited to:<br>- Manages project tasks, timelines and deliverables<br>- Manages and mentors junior analysts, contributing to their technical and career development<br>- Manages relationships with other Merkle business units<br>- Develops analytical solutions to client business problems<br>- May pitch in the analyze and pull data or implement analytical solutions<br>SME in the following techniques:<br>- Predictive statistical models<br>- Customer profiling<br>- Segmentation Analysis<br>- Campaign Analysis<br>- Data Analysis and Mining<br>- Presents ideas and findings to clients<br>- Participates in the sales process through solution development and responses to RFPs<br>- Demonstrate thought leadership<br>- Other duties as assigned </p><p><br> </p><br>Qualifications<br><br><p><strong>Skills:</strong><br>- Experience with MS Office (Word, Access, Excel, PowerPoint, Outlook) required<br>- <strong>Experience managing 2+ employees</strong><br>- <strong>Experience with SAS, SQL, logistic regression, multiple regression required</strong><br>- Excellent written and oral presentation skills<br>- Ability to explain/present complicated/advanced analytical methodology and results to non-technical audiences<br>- Ability to provide strategic insights to improve client campaign performance<br>- Ability to execute advanced analytic tasks (including but not limited to modeling, segmentation, DOE, forecasting, etc.) and create meaningful analytical outputs<br>- Ability to translate analysis insights into actionable recommendations and strategies for omni-channel marketers </p><p><br><strong>Experience:</strong><br>- <strong>Must have experience with modeling and statistical concepts</strong><br>- Experiences with applying statistical techniques such as regression, ANOVA, cluster analysis, factor analysis, time series forecasting, experimental and design, etc. to solve business problems<br>-<strong> Possess core database marketing knowledge such as understanding of Merkle and client data, relational database concepts, and direct marketing concepts</strong><br>- Possess core analytical competencies such as ability to formulate an analytical problem; QC data and results;</p><br><br>Additional Information<br><br><p>Merkle<strong> </strong>fosters a diverse environment that encourages original thinking about our business and empowers us to communicate with a global world of customers. We embrace differences of opinion and diversity of thought as they help us challenge and refine our solutions. Merkle, as a best-in-class marketing agency, welcomes big ideas, and believes they can come from anywhere. All your information will be kept confidential according to EEO guidelines.</p>"}