{"job title": "Big Data Engineer", "company": "Merlin International, Inc.", "city state": "– Vienna, VA", "rating": "NA", "job description": "<strong>What we're looking for:</strong>\n<br><br>\nMerlin is a fast-paced environment leading the forefronts of cutting edge Analytics technology around: Open Source, Docker, Kubernetes, and Enterprise Partnerships. Our engineering organization based in Vienna, VA is looking for a hands-on open source engineer with a passion for developing technologies for cybersecurity that impact multiple industries such as: government, healthcare &amp; financial. Being part of the team, you will help to build the next-generation open source framework that stand in the forefront of current enterprise security challenges. The product will help our customers to detect and mitigate the most advanced attacks on their assets in campus, data center and public cloud.\n<br><br>\nWe are looking for candidates of different experience levels for our quickly expanding team.\n<br><br>\n<strong>Your day, if you join us:</strong>\n\n<ul>\n<li>Work with senior technical leaders and product management teams to develop open source use cases, integration methodologies and roadmap definitions for: data storage, real-time streaming, search/index &amp; advanced analytics</li>\n<li>Implement, troubleshoot, and optimize big data solutions within a Kubernetes (Docker) orchestrated framework for on-premise and cloud environments</li>\n<li>Work with industry experts to develop solutions for deployment at massive scale.</li>\n<li>Must be able to perform detailed analysis of business problems and technical environments and use this in designing the solution</li>\n<li>Advise senior technical leadership on new and improved big data strategies that will drive performance and overall improvement</li>\n<li>Work with QA, technical publication, support and other teams to ensure high quality end-to-end component delivery</li>\n<li>A team player that can mentor junior members of the development team</li>\n<li>Rapidly learn, evaluate and explain emerging security technologies</li>\n<li>Good documentation, excellent written and verbal communication skills</li>\n<li>Must be able to work in a fast-paced agile development environment</li>\n</ul>\n<strong>Your \"must haves\" for the role:</strong>\n\n<ul>\n<li>BS/MS in Computer Science/Engineering or a related technical field</li>\n<li>Proven hands-on open source solution expertise in design, implementation &amp; deployment for: Spark, Kafka, ElasticSearch, MongoDB, Cassandra, Zookeeper etc.</li>\n<li>Parallelized data ingestion and transformation jobs in Spark including Spark Streaming</li>\n<li>Developing Kafka Producer/Consumer applications using Java/Scala.</li>\n<li>Experience in strong Elasticsearch (ELK), Beats, X-Pack setup and maintenance</li>\n<li>Experience with NoSQL databases: MongoDB and Cassandra with solid understanding in optimization techniques</li>\n<li>Proven hands-on software development expertise in: Java, Scala, Python and other scripting languages like Perl, Linux, PHP, Ruby, R</li>\n<li>Can articulate a solid understanding of algorithms, data structures, and deep data analytics using machine learning libraries</li>\n<li>Production Implementation experience in projects with considerable data size (TB/PB) and complexity</li>\n<li>Hands-on experience in developing big data microservices applications using REST API architectures and web services</li>\n<li>Full SDLC experience in CI/CD around build automation for requirements gathering, architecting, planning, testing and deploying open source components at commercial or enterprise scale</li>\n<li>Experience with Enterprise application integration patterns and architectures</li>\n</ul>\n<strong>Benefits of working here:</strong>\n<br><br>\nStrong product, good leadership, great culture, good people, diverse, great benefits, great compensation. If you have good work ethic, are visible, lean in, you will be recognized. We are in growth mode and there are tons of opportunity. A positive attitude and being flexible to change goes a long way here at Merlin. Our new office offers multiple places to work unconstrained by typical office cubes.\n<br><br>\nMerlin employees work hard and play hard. Our wellness package provides access to an on-site gym and includes Medical, Dental and Vision insurances along with FSA and EAP available. We offer 401K with employer match, PTO and a work culture respectful of the fact that not everything in one's personal life is guaranteed to happen \"after hours.\" Managers have a wide degree of flexibility to create schedules that create great work-life balance for their teams.\n<br><br>\n<strong>About Merlin</strong>\n<br><br>\nMerlin International provides next-generation cybersecurity solutions that protects government and commercial organizations. We offer a broad portfolio of solutions that secure the enterprise from endpoints to networks, from governance to risk management, from infrastructure to information. Our people seek innovative ways to deliver cybersecurity solutions that organizations need to protect their critical business assets while furthering their respective mission.\n<br><br>\nMerlin is building the next generation security products &amp; capabilities that will enable organizations to continuously monitor and mitigate security exposures and cyber-attacks. The company's solution dynamically identifies and evaluates network users, endpoints and applications to provide visibility, intelligence and policy-based mitigation of security problems. Using an open DataPlane &amp; ControlFabric architecture, the solution allows broad range of IT security products and management systems to share information and automate remediation actions.\n<br><br>\nMerlin is at the forefront of Endpoint and IoT Security, Risk Mitigation, AI based predictive analysis and content analytics. As the world becomes more and more connected so does the need for these capabilities. We are looking for individuals that want to be at the ground floor of building a product that addresses the world's most challenging security problems. Innovation starts here, visionaries welcome!"}