{"job title": "Data Scientist", "company": "Metabiota", "city state": "– San Francisco, CA", "rating": "3.4", "job description": "<strong>The Job</strong>\n<br><br>\nMetabiota is looking for an exceptional Data Scientist. You will be a core member of the team responsible for evaluating and interpreting global infectious disease data with an eye towards building statistical distributions of parameters, developing models, and performing model validation. You will also be responsible for building, managing, and scaling infectious disease models within cloud computing environments. Your work will have direct public health and business implications.\n<br><br>\n<strong>Who We Are and What We Do</strong>\n<br><br>\nMetabiota is the pioneer in comprehensive risk analytics that help protect global health. Built on a strong foundation of scientific expertise, including a worldwide network of on-the-ground experts, Metabiota delivers actionable, data-driven analytics to help countries and corporations mitigate complex health issues. With a strategic global presence and sustained partnerships, Metabiotas agile approach helps identify, analyze and transfer the risk associated with biological threats. For more information, visit http://www.metabiota.com.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>You will work closely with the Data Science, Engineering, and Product teams to research and create predictive models related to infectious diseases for government and commercial clients</li>\n<li>Build and scale models with cloud computing platforms (e.g., AWS and GCP)</li>\n<li>Develop appropriate models and methods for analysis and ensure the accuracy and reproducibility of data sets and analyses by following relevant work practices and procedures</li>\n<li>Provide interpretation of results and explain methodology to team members</li>\n<li>Create customer-facing reports of modeling/statistical work and present to internal and external stakeholders</li>\n<li>Ensure all modeling/statistical work is processed on time to appropriate quality levels</li>\n</ul>\n<strong>Your ProfileWho you are:</strong>\n<br><br>\nYou are an exceptional quant who craves to apply your skills to solve real world business problems. You are energetic, independent, and creative. You are nimble; build-test-validate-pivot is second nature to you. You are as comfortable building models by yourself as you are standing in front of a room and talking about your work.\n<br><br>\n<strong>Basic Qualifications:</strong>\n\n<ul>\n<li>B.S. in a data analytics or mathematics field, e.g. statistics, biostatistics, epidemiology</li>\n<li>Expertise with statistical software and associated programs, e.g., R (preferred), Python, SAS</li>\n<li>Experience with building and scaling models with cloud computing platforms, e.g., AWS, GCP</li>\n<li>Experience with Docker and Container Technology is a strong plus</li>\n<li>Experience with infectious diseases, economic or financial models a plus, but not required</li>\n<li>The ability to effectively explain complex statistical approaches to individuals from different disciplinary backgrounds</li> \n\n<li>Excellent oral and written communication skills.</li>\n<li>Self-starter able to work independently and take ownership of work.</li>\n</ul>\n<strong>Your Compensation:</strong>\n\n<ul>\n<li>Strong competitive salary</li>\n<li>Matching 401(k)</li>\n<li>Employer-paid health benefits, PTO and more</li>\n<li>The chance to join a company thats changing the world as we know it!</li>\n</ul>\nBeing authorized to work in the U.S. is a precondition of employment."}