{"job title": "IT - Healthcare Information Data Scientist", "company": "Methodist Le Bonheur Healthcare", "city state": "– Memphis, TN", "rating": "4.2", "job description": "<div>Summary\n<br><br>\nFrom a staff position and under limited supervision, the Healthcare Information Data Scientist functions as a member of various multi-disciplanary teams producing innovative solutions driven by exploratory data analysis from complex and high-dimensional databases. The incumbent uses a flexible, analytical approach to design, develop, and evaluate predictive models and advanced algorithims that lead to optimal value extraction from the data. Effectively communicates information in a way that is easy to understand for the intendeded audience, both technical and non-technical. Models appropriate behavior as exemplified in <strong>MLH Mission, Vision and Values.</strong>\n<br><br>\nEducation/Experience/Licensure<br>\n<div><strong>Education/Formal Training</strong>\n<br><br>\n<strong>Work Experience</strong>\n<br><br>\n<strong>Credential/Licensure</strong></div> <div><strong>REQUIRED:</strong>\n<br><br>\nBachelors degree in Data Science, Computer Science or related field.\n<br><br>\nTwo (2) years of applicable computer programming or related experience.\n<br><br>\nN/A</div> <div><strong>PREFERRED:</strong>\n<br><br>\nN/A\n<br><br>\nN/A\n<br><br>\nN/A</div> <div><strong>SUBSTITUTIONS ALLOWED:</strong>\n<br><br>\nN/A\n<br><br>\nN/A\n<br><br>\nN/A</div>\n<br>Knowledge/Skills/Abilities\n\n<ul>\n\n\t<li>Demonstrated knowledge in the following: software business intelligence, data analysis data mining, compiler/decompiler, user interface, enterprise application integration, operation job scheduling and server and network monitoring.</li>\n<li>Knowledge of design techniques, tools, and principles involved in the production of precision data models, queries, and programs.</li>\n<li>Advance knowledge of SQL and relational database management systems.</li>\n<li>Demonstrated knowledge of programming, data modeling, simulation, as well as statistics and mathematics.</li>\n<li>Ability to parse data in common file formats such as csv and xml files, applying regular expressions and mathematical transforming data into information.</li>\n<li>Ability to communicate verbally and in writing information concepts and methods to non-technical users.</li>\n</ul>\nKey Job Responsibilities\n\n<ul>\n\n\t<li>Analyzes problems and develops solutions involving computer software programs and applications by designing programs or queries to retrieve complex data from databases in one or more programming languages.</li>\n<li>Evaluates project plans and proposals to assess feasibility issues. Coordinates with stakeholders including executives, project sponsors, IT Teams, clinicians, and clinical and operational staff to determine analytic requirements for project requests.</li>\n<li>Applies theoretical expertise and innovation to create or apply new technology.</li>\n</ul>\nPhysical Requirements\n\n<ul>\n\n\t<li>Subject to call back at all times. Ability to travel to any area of the organization, both local and remote as needed. Must provide own transportation.</li></ul>\n\n\n<ul>\n\n\t<li>Required to sit for extended periods.</li>\n<li>Ability to understand complex verbal and written communications, and respond verbally or in writing as appropriate. Typical mediums of communication include face-to-face dialog, telephone, memos, and electronic mail.</li>\n<li>Ability to interpret equipment status indicators to determine appropriate operating condition. Indicators may include visual and/or auditory techniques or cues.</li>\n<li>Ability to read and understand technical manuals and other documentation to determine correct action, safety precautions, and other conditions of proper hardware and software operation.</li>\n<li>Ability to work varying hours due to the accessibility of individuals or equipment involved in different projects, the need to minimize system downtime or user interruption, or to recover from hardware or software failures.</li>\n<li>Will occasionally experience stressful working conditions due to tight project schedules and hardware or software problems.</li>\n<li>Ability to occasionally lift and/or move equipment up to 25 pounds without assistance. Must occasionally lift and/or move equipment up to 40 pounds with assistance.</li>\n<li>Ability to occasionally crouch, kneel, bend and/or crawl to access, inspect, connect, position or perform other operations on equipment. Some locations, such as user or equipment locations, may present very close quarters.</li>\n<li>Ability to occasionally use small hand tools and be able to manipulate small equipment components such as screws, nuts, or other fastening devices as usually found on computer equipment.</li>\n<li>Subject to regular periods of repetitive hand motion in the operation of computer terminals and other equipment.</li>\n</ul>\n\n</div>\n<br>"}