{"job title": "Data Scientist", "company": "Metron, Inc.", "city state": "– Reston, VA", "rating": "3.0", "job description": "Job Description<div>Our Reston office is seeking a talented Data Scientist for R&amp;D projects with large amounts of complex data. As a Data Scientist you will be responsible for designing, implementing, and analyzing the results of innovative solutions to clients’ machine learning and data mining problems. Project teams are small, typically 2-5 people including Data Scientists, Mathematicians, and Software Developers. Each person is involved in the project’s entire process, from concept through design and implementation to demonstration. Our management structure gives you the freedom to create innovative designs and products. The ideal candidate will have experience writing well-documented, maintainable, and extensible software and APIs.\n<br><br>\n<strong>Desired Qualifications:</strong>\n<ul>\n<li>Bachelors or Master’s degree in Machine Learning, Data Science, Computer Science, Statistics, Mathematics, or a related field</li><li>Significant experience developing new, scalable anomaly detection, classification, and related data mining algorithms</li> <li>Programming experience in Java, Scala, or scripting tools such as Python, Hive, and Pig</li><li>Experience with software such as R, SAS, SPSS, Weka, or scikit-learn</li><li>Experience with big data tools such as Hadoop Spark, Mahout, or Storm a plus</li><li>Experience with NLP (Natural Language Processing) and/or deep learning a plus</li><li>Ability to communicate algorithm design, performance metrics, and data analyses in written and oral reports</li><li>US CITIZENSHIP REQUIRED; applicants selected will be subject to a security investigation and will need to meet eligibility requirements for access to classified information</li>\n</ul>\nPosition Location: Reston, VA\n<br><br>\nAll qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or protected veteran status. Metron takes affirmative action in support of its policy to employ and advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.\n<br><br>\nVEVRAA Federal Contractor</div>"}