{"job title": "Data Scientist - Junior", "company": "MetroStar Systems", "city state": "– District of Columbia", "rating": "3.7", "job description": "MetroStar Systems Careers\n<br>\n<strong>=========================</strong>\n<br>\nData Scientist - Junior\n<br>\nIT Engineering Washington, District Of Columbia\n<br>\nApply\n<br>\nMetroStar Systems is looking for a Junior Data Scientist that is\n<br>\npassionate about data collection, analyzing and dissemination. If you\n<br>\nwant to join a company that values thoughtful data collection and are\n<br>\nopen to commuting to Washington DC we want you to work for MetroStar!\n<br>\nCome be a game changer and join our team!\n<br>\n<strong>You're a great fit if:</strong>\n\n\n<ul>\n<li>You can independently perform complex data mining tasks involving</li>\n</ul>\n\nthe application of proven data mining principles, practices, and\n<br>\ntechniques which require knowledge of customer data domains.\n\n\n<ul>\n<li>You love to analyze, evaluate, and integrate data mining solutions</li>\n</ul>\n\nto diverse problem sets.\n\n\n<ul>\n<li>You're comfortable advising all stakeholders on advanced data</li>\n</ul>\n\nmining and technical matters, research, and applications.\n<br>\nYou'll love our {company/technology/position} if: (This is the stuff\n<br>\nyou MUST have to be a fit)\n\n\n<ul>\n<li>You have 3+ years of experience with data analytics</li>\n<li>You have a Bachelor's Degree and you are able to obtain/maintain a</li>\n</ul>\n\nPublic Trust clearance\n<br>\nWe'll REALLY love you if:= (This is the bonus stuff that makes you\n<br>\nstand out)\n\n\n<ul>\n<li>You have experience using Tableau and/or PowerBI to create</li>\n</ul>\n\ndashboards\n<br>\nThe Admin Stuff: Applicants selected may be subject to a government\n<br>\nsecurity investigation and must meet eligibility requirements for\n<br>\npotential access to classified information. Accordingly, US\n<br>\nCitizenship is required\n<br>\nThe Legal Stuff:MetroStar Systems is committed to creating a diverse\n<br>\nenvironment and is proud to be an equal opportunity employer. All\n<br>\nqualified applicants will receive consideration for employment without\n<br>\nregard to race, color, religion, gender, gender identity or\n<br>\nexpression, sexual orientation, national origin, genetics, disability,\n<br>\nage, or veteran status. The statements herein are intended to describe\n<br>\nthe general nature and level of work being performed by employees, and\n<br>\nare not to be construed as an exhaustive list of responsibilities,\n<br>\nduties, and skills required of personnel so classified. Furthermore,\n<br>\nthey do not establish a contract for employment and are subject to\n<br>\nchange at the discretion of MetroStar Systems."}