{"job title": "Data Scientist ll", "company": "Microsoft Corporation", "city state": "– Redmond, WA", "rating": "4.1", "job description": "The goal of Azure Customer Growth &amp; Analytics team is to foster a data-driven culture; to encourage and enable the entire organization to make more informed decisions through data. In support of this mission, our Business Analytics team works closely with engineering, marketing, finance, and business leaders to identify opportunities for improving the customer experience and accelerating the growth of our business. Our charter spans the breadth of Cloud + AI, where we design and deliver standardized views of business performance, identify salient trends, perform ad hoc analyses of historical data, define benchmarks and models for predicting upcoming performance, and surface key insights. As the availability of data and demand for analysis grows, we need a capable data scientist to help stakeholders across the organization better understand user behavior and service usage, create compelling offers, and optimize the customer experience.\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\n<strong>KEY ACCOUNTABILITIES:</strong>\n<br><br>\no Become a subject matter expert in the C+AI business and underlying data ecosystem. Collaborate with product and program owners across the organization to understand objectives, identify opportunities, and inform data-driven decisions. Prioritize projects to maximize business impact.\n<br><br>\no Identify changes in customer behavior, system performance, or financial results, and deliver the necessary insights to explain them and recommend actions to be taken.\n<br><br>\no Deliver accurate and timely standardized reporting and analysis in support of ongoing business reviews and planning processes. Recognize opportunities for process improvements to increase quality, accelerate delivery, and reduce cost.\n<br><br>\no Lead the development and management of metrics, KPIs, and dashboards.\n<br><br>\no Ensure the ongoing documentation of analysis methodologies and results.\n<br><br>\no Educate users about how to leverage data as an asset for their particular function.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n<strong>KEY QUALIFICATIONS:</strong>\n<br><br>\no 3-5 years of experience in analytics, business intelligence, or data driven business strategy.\n<br><br>\no Functional knowledge of cloud computing and online services business models, including business, technical, and operational metrics.\n<br><br>\no Demonstrated analytical ability; problem deconstruction, statistical thinking, meticulous forensic analysis skills, data validation, and scientific rigor.\n<br><br>\no Demonstrated stakeholder management ability including effective prioritization, clear concise communication, and delivery of actionable data driven insights.\n<br><br>\no Highly proficient with T-SQL and Excel. Experience with PowerBI, Kusto, Python and/or R preferred.\n<br><br>\no Experience applying business concepts to data resulting in insights on customer acquisition funnel, retention, and monetization.\n<br><br>\n<strong>PERSONAL ATTRIBUTES/INTERPERSONAL SKILLS:</strong>\n<br><br>\no Excellent written and oral communication skills, particularly the ability to synthesize complex problems/scenarios into easy-to-understand concepts. Effective presentation skills and experience with engaging audiences of all levels.\n<br><br>\no Effective in rapidly evolving environments and working across organizational boundaries. Collaborative attitude and enjoys engaging on team projects.\n<br><br>\no Creative, innovative, organized thinker, with a high attention to detail. Strong drive to achieve quality and accurate results.\n<br><br>\nAvid learner, who enjoys researching new techniques and best practices, as well as teaching others.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form at https://careers.microsoft.com/us/en/accommodationrequest .\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}