{"job title": "Senior Data &amp; Applied Scientist", "company": "Microsoft Corporation", "city state": "– Bellevue, WA", "rating": "4.1", "job description": "Do you want to help millions of internet users find the best images on the web? The Bing Image Relevance Team develops the advanced search technology that powers Bing image search. We are responsible for delivering the best images for user?s queries and browsing. It?s more than just finding a web page that matches a query ? it?s about training sophisticated machine learned models to drive the ranking, using word embeddings and deep learning to understand the quality of matches, online learning to react quickly to change, natural language processing to understand queries, taking advantage of big data and signals from millions of people across the web. Pulling together and combining information from multiple sources to provide the user with results that best match their intent. Machine learning, deep learning, natural language processing, computer vision, big data mining and information retrieval - it?s all part of the job.\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\nThe Bing Image Relevance Team is looking for a talented machine learning scientist to help us deliver our next generation of ranking algorithms. Qualified applicants should have a strong machine learning background, excellent coding skills, and a MS or higher degree in computer science or a related field. We are looking for a self-motivated and passionate individual who is interested in applying machine learning, deep learning, natural language processing, and data mining to deliver the best search results on the web and make an impact on millions of users. You should have strong technical skills and be able to apply research concepts in new and innovative ways.\n<br><br>\nThis is a fun and fast paced environment, where developers are empowered to innovate. This is a great opportunity to work on something highly strategic to Microsoft, and an opportunity to directly impact millions of users in an exciting area.\n<br><br>\n<strong>Our ideal candidate has:</strong>\n<br><br>\n? Publications in major ML/IR/NLP/CV conferences. Examples: ICML, NIPS, SIGIR, ACL, EMNLP, CVPR, KDD\n<br><br>\n? Awareness and understanding of emerging research and technologies\n<br><br>\n? Great design and problem-solving skills, and an ability to innovate and solve challenging technical problems\n<br><br>\n? Ability to self-learn new techniques from textbooks or research papers and manage through uncertainty\n<br><br>\n? Passion and self-motivation\n<br><br>\n? Excellent communication skills and ability to work in a collaborative environment\n<br><br>\n? A bias toward engineering excellence and delivering quality at scale.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n+ Master?s degree in Computer Science, Engineering, Applied Mathematics, or related field (Ph.D. preferred).\n<br><br>\n+ 3+ years of experience in the areas of machine learning, deep learning, information retrieval, natural language processing or data mining\n<br><br>\n+ 3+ years of experience with general purpose programming language (C/C++/C#/Java/Python etc.)\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form at https://careers.microsoft.com/us/en/accommodationrequest .\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}