{"job title": "Data Scientist", "company": "Micron Technology", "city state": "– Boise, ID, US", "rating": "3.7", "job description": "<div><div><div>...</div>\n\n\n\n\n \n\n\n </div>\n</div>\n<br><strong>Date:</strong> \n<br>\n Aug 9, 2018\n<br><br>\n<strong>Location:</strong>\n<br><br>\n Boise, ID, US<br><br>#job-location.job-location-inline {\n<br>\n display: inline;\n<br>\n }<br><br><strong>Company:</strong> \n<br>\n Micron<br>\n<div>Req. ID: 120386\n<br><br>\n<strong>Micron Technology’s vision is to transform how the world uses information to enrich life and our commitment to people, innovation, tenacity, collaboration, and customer focus allows us to fulfill our mission to be a global leader in memory and storage solutions. This means conducting business with integrity, accountability, and professionalism while supporting our global community.</strong>\n<br><br>\nAs a Data Scientist at Micron Technology, Inc., you will <strong>make values</strong> out of data and create <strong>practical</strong> applications of that data to improve the methods of operation. Data scientists utilize their analytical, statistical, and programming skills in conjunction with intimate understanding of the problem statement to collect, analyze, and interpret large data sets using the information to develop data-driven solutions to difficult challenges.\n<br><br>\n<strong>Responsibilities and Tasks include, but not limited to:</strong>\n\n<ul>\n\n\t<li>Creating various Machine Learning-based tools or processes within the company, such as recommendation engines or automated lead scoring systems, based on data collection, aggregation, and analysis</li>\n<li>Performing statistical analysis and have basic programming knowledge</li>\n<li>Understanding of database systems and structure</li>\n</ul>\n<strong>Successful candidates will have the following, but not limited to:</strong>\n\n<ul>\n\n\t<li>A Bachelor’s Degree in Electrical Engineering, Computer Engineering, Computer Science or related fields</li>\n<li>SME on DRAM operations <strong>(Preferred)</strong> for better leverage of application of the data to new operations and methodologies</li>\n<li>Understands or has experience in statistics and programming</li>\n<li>Strong skills in machine learning, coding languages, databases, aggregations and reporting/summarization techniques</li>\n</ul>\n<strong>About Us</strong>\n<br><br>\n<strong>As the leader in innovative memory solutions, Micron is helping the world make sense of data by delivering technology that is transforming how the world uses information. Through our global brands — Micron, Crucial and Ballistix — we offer the industry’s broadest portfolio. We are the only company manufacturing today’s major memory and storage technologies: DRAM, NAND, NOR and 3D XPoint™ memory. Our solutions are purpose built to leverage the value of data to unlock financial insights, accelerate scientific breakthroughs and enhance communication around the world.</strong>\n<br><br>\n<strong>Micron Benefits</strong>\n<br><br>\n<strong>Employee Rewards Program, Healthcare, Paid time off (Combined Sick and Vacation Time), Retirement savings plans, Paid maternity/paternity leave, Employee Assistance Program, Professional development training, Workplace wellness programs, Micron Health Clinic (Boise only), Fitness Center / Activity rooms (Boise only), Tuition Reimbursement, Micron Corporate Discounts, Casual Dress attire.</strong>\n<br><br>\nWe recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices.\n<br><br>\nEach manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters.\n<br><br>\nTo request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748).\n<br><br>\nKeywords: Boise || Idaho (US-ID) || United States (US) || DEG (DRAM Engineering Group) || Experienced || Regular || Engineering || #LI-MP1 ||\n<br><br>\n<strong>Nearest Major Market:</strong> Boise\n<br>\n<strong>Nearest Secondary Market:</strong> Meridian\n<br>\n<strong>Job Segment:</strong> \n<br>\n Database, Scientific, Engineer, Scientist, Electrical, Engineering, Technology, Science</div>\n\n<br>"}