{"job title": "Data &amp; Applied Scientist", "company": "Microsoft", "city state": "– Redmond, Washington", "rating": "4.1", "job description": "Cloud Computing is the one of the most important initiatives for Microsoft. It is a highly competitive &amp; rapidly growing market and we aim to win it.\n<br><br>\nThe Azure Compute Analytics and Insights team is a growing Agile team tasked with turning our incredibly rich and Big data into strategic assets that will drive business and engineering goals and efforts.\n<br><br>\nAs a member of our team, you will turn this data into actionable insights that will drive feature improvements to the Azure Compute Service and its customers. Our vision is to be have a balanced team of data science and development skills. If you dream of being able to use data science/applied statistical techniques like: anomaly detection, machine learning, expert systems and/or experimentation, then you should talk to us. If you have the drive to help to implement it and see it productized, then you really should talk to us. We are not one of those teams that just builds reports with brilliant insights that no one uses. We are here to make it happen.<br><br>Responsibilities\n\n<ul>\n<li>Design new tools and processes to enable better data modeling, analysis, and experimentation</li><li>Employ machine learning to detect and correlate problems</li> <li>Build models, simulations, scalable and automated analytical systems</li> <li>Drive improvements to the product design and architecture, leading to increased customer satisfaction</li> <li>Lead and collaborate with experts from across the company to advance data science best practices</li> <li>Educate and train others on modern applications of data science techniques</li> <li>Learn how to build and sustain engagement from all levels of an organization</li> \n</ul>\n\nQualifications\n\n<ul>\n<li>3 or more years of experience using data/ML/AI to impact critical product or business decisions</li> <li>A proven track record of collaborating across organizational boundaries and delivering great results</li> <li>Familiarity with software development, database design, and online service development</li> <li>A Masters or higher degree in computer science, machine learning, statistics, math, economics, business or other scientific or quant-focused field.</li><li>Programming skills (esp. related to data technologies like Python, PERL, Java, C#, etc.)</li> \n</ul>\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}