{"job title": "Data Scientist", "company": "Micron", "city state": "– Manassas", "rating": "3.5", "job description": "&nbsp;\n<br><br>\nReq. ID: 121908&nbsp;\n<br><br>\nAs a Data Scientist at Micron you will:\n<ul>\n<li>Work within a Data Science Team on leading edge projects.</li><li>Develop and codes software programs, algorithms, typically on very large datasets, from multiple sources.</li><li>Develop new solutions using Deep Neural Networks on the latest frameworks, on GPUs</li><li>Provide Visualization Solutions for complex data sets, including dimensionality reduction when needed.</li><li>Assists in the design of user interface and business application prototypes.</li><li>Interacts with product and service teams to identify questions and issues for data analysis and experiments.</li><li>Interprets actionable insights from large data and metadata sources and communicates the findings to product, service, and business managers for product enhancement.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Requirements:&nbsp;</strong>\n<ul>\n<li>Must have an MS plus 2 years relevant work experience, or BS + 7 Years relevant work experience.</li><li>Experience working with structured, semi-structured, and un-structured data sources.</li><li>Solid Experience with Deep Neural Networks. CNNs, LSTMs, RNNs, RCNNS,</li><li>The ability to problem solve and provide complex solutions with limited direction.&nbsp;</li><li>Strong experience with design, development, and implementation of complex architecture.</li><li>Some experience with web front end development: HTML/CSS, JavaScript (JQuery or Angular preferred).</li><li>Hands-on experience with various machine learning methods.</li><li>Excellent communication and leadership skills.</li><li>Demonstrated capability in Python, Java, and at least one other programming language.</li><li>Ability to learn quickly and become productive on new technologies, APIs, development languages, and frameworks.</li><li>Some working knowledge of Hadoop Environment, including: Hive, Map Reduce, No/SQL, HBase, and Spark.</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>Education:</strong>\n<br><br>\nBachelor’s Degree or Master’s Degree in: Computer Science, Science, Engineering, Information Science; or a related field&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong><em>Desired Skills:</em></strong>\n<ul>\n<li>Simulations</li><li>Optimization</li><li>Signal analysis methods.</li><li>Complex data visualization techniques.</li><li>Image analytics&nbsp;with OpenCV or equivalent.</li><li>Proficiency in R Language.</li><li>Cuda</li>\n</ul>\nWe recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices.\n<br><br>\nEach manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters.\n<br><br>\nTo request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748).\n<br><br>\nKeywords: Manassas || Virginia (US-VA) || United States (US) || Frontend Manufacturing || College || Regular || Engineering || #LI-AW1 ||\n<br>\n&nbsp;"}