{"job title": "Data &amp; Applied Scientist", "company": "Microsoft Corporation", "city state": "– Redmond, WA", "rating": "4.1", "job description": "Office 365 continues to lead the cloud transformation for Microsoft and has become the locomotive for services across the Company. Customers and Partners are betting on the cloud and expecting Office 365 to deliver an unparalleled experience on the service. Office 365 is leading the transformation and redefinition of how we help customers on the service. Our mission is to distinguish O365 support as a cloud-first support model that is optimized for customer experience and based on a culture of satisfaction.\n<br><br>\nThe Data &amp; Applied Scientists from the AI and Business Intelligence team explore big data from Office 365 operations and support in search of consistent patterns and systematic relationships, connecting the across all data sources involved. The goal of this team is to predict trends, find insights, and produce actionable, trustworthy recommendations and decisions for Office 365 operations and modern support, which is executed on through an analytical modelling process based on machine learning, by processing structured, semi-structed and unstructured data.\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\nDevelop volume forecast models\n<br><br>\nDevelop algorithms and technologies for mining O365 service data to optimize O365 operations\n<br><br>\nDevelop AI applications, such as recommendations, for improving O365 service agent experiences\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n<br><br>\nB.S. and/or M.S. (Ph.D. Preferred) in Computer Science, Mathematics, Electrical Engineering, Statistics, or Computational Linguistics.\n<br><br>\n2+ years of experience working on statistical modelling with large data sets or doing large scale quantitative analysis, or software /tool development.\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\nPreference given towards those with good experience in statistical modelling, in using various data analysis tools, and having good computation skills and software development experience.\n<br><br>\nThe candidate needs to demonstrate proficiency in using SQL and C / Python.\n<br><br>\nThe candidate also needs to demonstrate the capability of quickly extending their learning to new languages, tools, and environments.\n<br><br>\nThe candidate should have experience processing large data sets through statistical software (ex. R) and programming languages (ex. Python), or other methods.\n<br><br>\nStrong algorithmic problem-solving skills a plus.\n<br><br>\nUnderstanding of statistics, hypothesis testing, p-values, confidence intervals, regression, classification, optimization, Cosmos/ADL (via Scope/U_SQL/Spark) is a plus.\n<br><br>\nPreference also given to candidates with coursework or experience in statistical modeling and inference, machine learning, data mining, time series forecasting.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}