{"job title": "Applied Scientist 2", "company": "Microsoft Corporation", "city state": "– Bellevue, WA", "rating": "4.1", "job description": "What if your job description were simply, make tomorrow better? That is the essence of roles within our Bing Team. Every day, we bring an insatiable curiosity to the table, challenging ourselves to reimagine what is and what can be. We build on what has come before to create what is next. We drive machine intelligence. We help shape the future. We empower billions of people around the globe.\n<br><br>\nSince Bing launched in June of 2009, the search world has changed for the better. We are helping people break free from search overload and enabling them to make decisions with Bing?s powerful, friendly tools. We are attracting new users and changing how people think about Microsoft and Search. We have a long road ahead and we need your help! Bing is the beating heart of the Microsoft Artificial Intelligence (AI) movement.\n<br><br>\nWithin Bing we are the Query formulation relevance team working on suggestions for bing.com, windows 10 and Edge. Key to our continued success in this hypercompetitive space is taking enormous volumes of data and turning them into useful, actionable information to drive increased user engagement through great Bing features and improvements. You will work with great engineers and applied scientists with a mission to save user effort to get to the information they need. We are talking petabytes of data about how searches succeed, how they fail, and how we can improve Bing and its partners. You will engage very closely with other key partner teams that are dependent on our platform and experiences, to drive end-to-end scenario helping our user growth. This position offers great career-growth potential as well as the impact and visibility across the entire Bing organization. Being at the very core of Bing engineering, it also offers great exposure to the latest software and hardware technology trends in the search industry.\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\nCurrent position enables you to be part of the evolving intelligent Bing search where you will be responsible for\n<br><br>\n+ Implementing ML Techniques to improve suggestions relevance\n<br><br>\n+ Developing data ingestion, processing and data serving solutions using C#\n<br><br>\n+ Analyzing A/B experiments and make data-driven decisions Machine Learning/AI/Natural Language\n<br><br>\n+ Processing (NLP) to develop scalable backend data platform to enable various experiences\n<br><br>\n+ Productionalizing the ML model and techniques within the Bing Autosuggest stack.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nA successful candidate will have the following qualifications:\n<br><br>\n<strong>Required Qualifications:</strong>\n<br><br>\n+ 2+ years of professional experience in classical ML techniques\n<br><br>\n+ 2+ years of experience in deep learning\n<br><br>\n+ 3+ years of experience with production systems\n<br><br>\n+ BS in CS, EE, Math, Statistics, Physics or related fields required\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\n+ Understanding of MVC/MVVM architecture\n<br><br>\n+ Good design skills around the user experience with the eye for design aesthetics and attention to detail\n<br><br>\n+ Fluency with at least one scripting language such as React, PHP or Python\n<br><br>\n+ Practical experience with machine learning\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form at https://careers.microsoft.com/us/en/accommodationrequest .\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}