{"job title": "Data Scientist", "company": "Microsoft", "city state": "– Bellevue, Washington", "rating": "4.1", "job description": "We are looking for talented software engineers and scientists with strong information retrieval and machine backgrounds who are passionate about making a real impact on millions of people. As a member of our team you would work in an exciting and fast-paced environment, collaborating with product teams and others across the company, including Microsoft Research (MSR). By analyzing and learning from massive data you will improve the lives and work of users around the globe by making complex tasks faster, easier and more delightful. You will work as part of a team that brings together talent in the areas of machine learning, natural language processing, information retrieval, software engineering, and trustworthy computing. We value and encourage diversity in the belief that it leads to both great workplaces and great products.<br><br>Responsibilities\n\n<ul>\n<li>Analyzing real world data and proposing novel solutions to user challenges.</li> <li>Implementing pipelines to prepare and learning from real world data.</li><li>Designing crowdsourcing pipelines for collecting reliable and unbiased data for experimentation.</li> <li>Developing, refining, and evaluating online and offline product metrics.</li> <li>Monitoring key product metrics and understanding root causes of changes.</li>\n</ul>\n\nQualifications<br><br><strong>Required:</strong>\n<ul>\n<li>PhD degree in Computer Science or Engineering.</li> <li>5+ years of experience working with any of the following languages: C#, Python, or R.</li>\n<li>2+ years of experience working with Hadoop.</li>\n<li>3+ years of experience with statistical data analysis.</li>\n</ul>\n<strong>Preferred:</strong>\n<ul>\n<li>Publications in major HCI/ML/IR/NLP conferences would be a plus. Example: CHI, NIPS, ICML, KDD, WWW, SIGIR, WSDM, ACL, EMNLP.</li> <li>A willingness to learn, share, and improve.</li> <li>Superior verbal, visual and written communication skills</li>\n</ul>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}