{"job title": "Security Analyst/Data Scientist", "company": "Microsoft Corporation", "city state": "– Redmond, WA", "rating": "4.1", "job description": "The Identity Prevention &amp; Response team is responsible for ensuring the integrity and security of the services we operate (Azure Active Directory &amp; Microsoft Account), as well as the consumer and commercial identities we manage. Each day, our detection systems and machine learning algorithms evaluate and risk score more than 10 billion logins for more than 700 million customers (including for O365, Xbox, OneDrive, &amp; Azure). In addition to ensuring the veracity of interactions powering the global digital economy, our efforts are at the core of Microsoft?s commitment to defend democracy worldwide.\n<br><br>\nWe are seeking a talented individual to augment our world-class team of investigators and data scientists. Your passion for data and security, comfort with ambiguity and acceptance of the need to deliver consistently exceptional performance under high pressure, combined with your proven ability to sift through gargantuan datasets to extract valuable insights will be critical in helping us continue to successfully achieve our mission. We are experiencing unprecedented business growth so if you are motivated by the challenge of using your skills to protect hundreds of millions of users worldwide, this job is for you!\n\n\n<ul>\n<li>*Responsibilities**</li>\n</ul>\n\n<strong>Responsibilities:</strong>\n<br><br>\n+ Respond to security incidents spanning both operational issues and customer identity compromise or fraud so as to isolate, remediate, and root cause\n<br><br>\n+ Investigate security incidents and find patterns ensuring we adapt our systems and improve automated timely detections\n<br><br>\n+ Continually evaluate and improve existing algorithms, and create new ones, to detect and prevent systemic service vulnerabilities, identity compromise, fraud, and abuse\n<br><br>\n+ Identify and analyze new data sources to find novel patterns that can be transformed into new automated detections\n<br><br>\n+ Conceptualize, implement and analyze metrics to assess the quality of our detections and improve in real time\n<br><br>\n+ Collaborate with engineering and partner teams cross-company in achieving our objectives\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nMinimum qualifications\n<br><br>\n+ A bachelor?s degree in computer science or quantitative domain related technical field\n<br><br>\n+ 2+ years' experience as a data scientist, software engineer, or security researcher\n<br><br>\nPreferred qualifications\n<br><br>\n+ Previous experience in any of the following: identity systems, security, threat intelligence, fraud, abuse\n<br><br>\n+ Experience with statistical software (R, Azure ML, etc.)\n<br><br>\n+ Knowledge of programming and relevant languages (C#, C++, Java, Python)\n<br><br>\n+ Graduate degree in computer science, machine learning, statistics, or quantitative domain\n<br><br>\n+ Strong communication skills with a demonstrated bias towards collaboration and team work\n<br><br>\n+ Proficiency in querying language/big data systems (SQL, Azure Data Lake, Hadoop, etc.) and experiencing using real-time data analytic platforms/technologies (e.g. Kafka, Spark, Cosmos DB, Cassandra)\n<br><br>\n+ Background in machine learning, expert systems, or data analytics\n<br><br>\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n<br><br>\n+ Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n<br><br>\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form at https://careers.microsoft.com/us/en/accommodationrequest .\n<br><br>\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}