{"job title": "Data Analyst - DAS", "company": "Mindshare", "city state": "– NY", "rating": "3.6", "job description": "<div>Auto req ID 17858BR</div> <div> Company GroupM</div> <div> Business Title Data Analyst - DAS</div> <div> State NY</div> <div> Job Description Company Overview\n<br><br>\nGroupM is the largest media investment company in the world – purchasing more than $104BN in billings (RECMA 2013). GroupM and its agencies employ over seventeen thousand people in four hundred offices spanning eighty-one countries.\n<br><br>\nGroupM Data &amp; Analytics is a marketing science, technology and consulting group specializing in fact-based business strategies and assessment. Our global team provides expertise in data management, advanced analytics, technology deployment and marketing effectiveness with one clear remit: help clients achieve significant and lasting improvements in marketing effectiveness and profitability. Utilizing a proprietary Data and Analytics Platform, we enable clients’ marketing organizations to monitor, evaluate and optimize media investments.\n<br><br>\nThe data and analytics organization in GroupM is responsible for managing and analyzing massive amounts of data as well as supporting the whole organization in delivering value from data. We focus on designing, developing and operating our global technology stack with four key layers of Data Marketplace, Data Management, Analytics Workbench and Application Marketplace. These products are hosted on a variety of infrastructure options including but not limited to local servers, public and private clouds and enable a suit of advanced analytics-based products, specific Data collection modules and customized Data transformation packages\n<br><br>\nPosition Overview\n<br><br>\nThe Data Analyst is expected to demonstrate: hands-on skills in data analysis and management, problem solving, analytical modeling, the ability to develop/analyze business cases. She/he demonstrates research skills, excellent oral and written communication skills, client focus, and the ability to support and enable teamwork. The candidate must be self-motivated and able to operate independently with limited guidance and direction. The Data Analyst will support the analytics Manager/Director to ensure consistent quality output on all projects.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Provide on-going analytical support utilizing data management, technology and modeling (such as market mix modeling) to address client issues regarding advertising, media, and new products.</li>\n<li>Analyze data and generate graphics and insights for use in client presentations.</li>\n<li>Assist in and formulate econometric models using regression analysis, including multi-level/hierarchical modeling.</li>\n<li>Run ad-hoc “what if scenarios” and simulations to models and evaluate media plans.</li>\n<li>Act as primary day-to-day contact on insights and analytics to digital and traditional media managers and clients</li>\n<li>Manage project timelines and deliverable schedules and share concerns about deliverables, timelines, and issues with project managers and directors.</li>\n<li>Develop presentations and present analytics &amp; insights to clients &amp; agency teams.</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Bachelor’s degree required. Master’s degree in Statistics, Economics, or Applied Math is preferred.</li>\n<li>1+ years related work experience</li>\n<li>Strong analytical skills; ability to manage, manipulate and analyze raw data, draw conclusions, and develop actionable recommendations using technology as well as statistical and econometric modeling techniques.</li>\n<li>Strong interpersonal written and verbal communication skills.</li>\n<li>Experience with database structures and data mining techniques.</li>\n<li>Ability to work in a fast-paced environment with a customer-centric focus.</li>\n<li>Knowledge of visual techniques for data analysis and presentation.</li>\n<li>Strong skills in SQL and proven experience working with at least one of the major databases platforms (SQL Server, Oracle, DB2, MySQL, Sybase, or Postgres).</li>\n<li>Fluency in SAS, R or any other advanced analytics software packages.</li>\n<li>Understanding of digital/media/marketing data sources and metrics preferred: Digital (e.g. Web, Social, Display, Search etc.); Media (e.g. buying models, CPU, Impressions, GRP); Measurement analytics, Quantitative business measures (Adstock, ROI, Churn, etc.); Statistics (Correlations, sample sizing, etc.)</li></ul></div> \n"}