{"job title": "Data Scientist", "company": "Mintigo", "city state": "– San Mateo, California", "rating": "3.4", "job description": "<strong>Description</strong>\n<br><br>\nThe Customer Insights &amp; Analytics team partners with Mintigo’s Engineering, Customer Experience, Product, Marketing and Sales organizations to generate actionable insights using Mintigo’s Predictive Marketing Platform. This role is key in reaching the company’s goals for revenue growth, customer retention and customer satisfaction.\n<br><br>\nThe ideal candidate is a technical-minded self-starter who can work well on several projects simultaneously and balance competing priorities in a fun, results-oriented and details-oriented work environment. If you are a curious and creative individual with a passion for digging into data, applying machine learning algorithms, analyzing patterns, and delivering data-driven insights to customers, we want to hear from you!\n<br><br>\n<strong>Responsibilities</strong><strong>:</strong>\n<br><br>\n· \n<br>\nUse analytical tools and algorithms to analyze customer marketing and sales data, create models and present business insights to customers\n<br><br>\n· \n<br>\nWork closely and collaboratively with the Customer Experience team to formulate data-driven recommendations and drive value for Mintigo’s SaaS platform. Analyze results and measure ROI to quantify the value.\n<br><br>\n· \n<br>\nCollaborate with the Product, Data and Engineering teams to support changing customer needs &amp; dynamic data requirements, document customer use cases and requirements for technical teams.\n<br><br>\n<strong>Required</strong> <strong>Skills</strong> <strong>&amp;</strong> <strong>Experience</strong><strong>:</strong>\n<br><br>\n· \n<br>\nBachelor’s degree in Statistics, Computer Science, Machine Learning, Industrial Engineering or Economics from a leading college/university\n<br><br>\n· \n<br>\n2-5 years of experience in data / customer analytics roles, particularly in transforming data into business insights and recommendations using analytical tools\n<br><br>\nE Proven experience with machine learning, AI and/or big-data algorithms\n<br><br>\n· \n<br>\n1-3 years of experience in a customer-facing role\n<br><br>\n· \n<br>\nStrong passion to data, taking a detail-oriented approach with outstanding organizational skills\n<br><br>\n· \n<br>\nProficiency in Python or other scripting language\n<br><br>\n· \n<br>\nAdvanced knowledge of Microsoft Excel or equivalent solution, and proven experience with data visualization tools (e.g. Tableau)\n<br><br>\n· \n<br>\nEffective communication skills: Ability to think strategically, write concisely, and explain concepts in simple language\n<br><br>\n· \n<br>\nHigh proficiency in English (spoken and written)<br><br><strong>A Plus</strong><strong>:</strong><br><br>Experience with marketing &amp; sales processes, and systems (e.g. Salesforce, Marketo)\n<br><br>\n· \n<br>\nSQL knowledge"}