{"job title": "Data Scientist", "company": "Mission Bell Manufacturing", "city state": "– Morgan Hill, CA", "rating": "3.9", "job description": "Mission Bell is the premiere destination for architectural millwork in California; our work is on display in many Bay Area companies including Google, Kaiser Permanente, Facebook, LinkedIn and Stanford University. We are looking to add a Data Scientist as part of our tech-forward team. Under the direction of the Director of IT, the Data Scientist is primarily responsible for developing data models and creating business intelligence solutions.\n<br><br>\nIf you are passionate about enhancing our data platform, creating business solutions, and utilizing creative ideas from analytics we invite you to apply to our newly opened Data Scientist position!\n<br><br>\nWHAT MISSION BELL BRINGS TO YOU:\n\n<ul>\n<li>Competitive pay</li>\n<li>Rich benefits package</li>\n<li>A growing IT department with opportunities for advancement</li>\n<li>A community environment where your ideas are valued</li>\n</ul>\nWHAT OUR DATA SCIENTIST DOES:\n\n<ul>\n<li>Extend Mission Bells data collection by working with the in-house development team on custom applications or integrating third party applications</li>\n<li>Process, clean, and verify the integrity of data used for analysis</li>\n<li>Create and maintain a business intelligence solution layer</li>\n<li>Work with business analysts across all business units to build ad-hoc queries and presentations</li>\n<li>Develop custom data models and algorithms to apply to data sets and processes</li>\n<li>Be a Mission Bell Innovator by constantly looking for opportunities to innovate and create new processes, ideas or products; innovation is the ability to recognize and stimulate unusual ideas with high potential impact</li>\n</ul>\nHERE'S WHAT YOU NEED:\n\n<ul>\n<li>Bachelors degree in related field such as IT or Computer Science</li>\n<li>3-5 years of experience in creating BI solutions or building statistical models</li>\n<li>Proficiency in SQL and some experience with SQL Server 2016</li>\n<li>Experience with statistical programming languages such as R or Python</li>\n<li>Familiarity with data visualization tools such as Power BI, Tableau or D3.js</li>\n<li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications</li>\n<li>Excellent written and verbal communication skills</li>\n</ul>"}