{"job title": "Data Scientist", "company": "Mist Systems", "city state": "– Cupertino, CA", "rating": "5.0", "job description": "<div>\n<div>Mist is the first vendor to bring enterprise-grade Wi-Fi, BLE and IoT together through a highly scalable cloud architecture. Our mission is to deliver personalized location-based wireless services by making Wi-Fi predictable, reliable and measurable. At Mist, we built the first AI-empowered platform to provide an unprecedented visibility into the user experience. Mist is the new global standard for many fortune 500 companies\n<br><br>\nMist is looking for an entrepreneurial Data Scientist to help define and develop the next generation cloud mobile analytic platform. As a Mist data scientist, you will collaborate with highly talented engineers and product managers to build the next generation of autonomous WiFi networks. You will use your deep knowledge of ML and software engineering to develop and implement scalable algorithms to process terabytes of streaming data to detect anomalies, predict problems, and classify them in real-time. In addition, you will leverage data to empower the inference engine of Mist's virtual assistant, Marvis.<br><br>Qualifications/Requirements:\n\n\n<ul>\n<li>Solid understanding of machine learning algorithms and principles</li> \n\n<li>Strong hands-on coding skills including prototyping languages such as Python and Java</li>\n<li>Great team player with excellent communication skills</li>\n<li>MS or PhD in Computer Science, Electrical Engineering, Statistics, or equivalent fields with strong mathematical background</li>\n<li>Experience with probabilistic models, time series, deep neural networks, supervised and unsupervised learning, natural language processing.</li>\n</ul>\n\nDesired Experience\n\n\n<ul>\n<li>Experience with open source systems such as Kafka, Cassandra, Storm, and the Amazon Web Services (AWS) ecosystem</li>\n<li>Experience with large scale machine learning model development for streaming data</li>\n<li>Previous work in a start-up environment</li>\n</ul>\n\n<strong>Benefits:\n<br><br>\n</strong>\n\n\n<ul>\n<li>Incredible career development opportunity in a fast-paced, dynamic, and innovative environment with loads of opportunities to learn, grow and contribute</li>\n<li>Stock options in a pre-IPO company</li>\n<li>Competitive salaries</li>\n<li>Flexible paid time off</li>\n<li>Free Medical, dental and vision insurance (and other programs!)</li>\n</ul>\n\n</div>\n</div>\n\n<br>"}