{"job title": "Data Scientist", "company": "Mitchell International, Inc.", "city state": "– San Diego, CA", "rating": "3.2", "job description": "Mitchell International, Inc. is a leading provider of information and workflow solutions to the Property &amp; Casualty Claims Industry and their supply chain partners. We solve interesting and complex problems that directly affect the customers our clients serve. We are constantly adapting to stay on the forefront of emerging technologies and we work diligently to maintain our position as a thought leader within our industry.\n<br><br>\nWe are currently seeking an experienced data scientist to join our Casualty Solutions team. In this role you will work as part of a team to evaluate, validate, and develop innovative business analytics offerings and have the opportunity to solve challenging problems and build predictive models across a broad range of Mitchell products. You will apply machine learning and other advanced analytic techniques to improve Mitchell's algorithms, workflows and core products to become more predictive. You will partner with product managers and engineers to implement your ideas in production and analysts to evaluate and validate your improvements.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nThe Data Scientist designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse “big data” and other sources to generate actionable insights and solutions for client services and product enhancement. Interacts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.\n<ul>\n<li>Leverage analytics to enhance existing products and deliver new impactful products.</li><li>Proactively identify areas where our research/algorithms can add value to clients’ decision making process.</li><li>Work with the product management and technology teams to translate customer needs into business intelligence, data insights, and predictive models.</li><li>Present findings to internal and external customers.</li><li>Promote a culture of inquiry and a highly experimental approach to understanding data.</li></ul>\n\n<ul>\n<li>Bachelor's Degree with 2-5+ years in a data science or business/system analytics role at a SaaS company preferably with experience in the health care or insurance industry or Master's Degree with 3 years of relevant experience or equivalent work experience.</li><li>Master's Degree preferred.</li><li>Solid foundation in machine learning, data structures, algorithms, and software design.</li><li>Experience with R and Python is highly desirable.</li><li>A strong working knowledge of SQL including the ability to write and troubleshoot complex SQL procedures and an understanding of Data Warehousing and ETL techniques.</li><li>Experience with the latest machine learning frameworks such as MLlib, Mahout, Scikit-learn, TensorFlow, Keras, Theano and OpenCV is desirable.</li><li>Experience with NoSQL solution development is a plus.</li> <li>Experience with SAS Analytics is a plus.</li>\n</ul>\nMitchell International, an equal opportunity employer, values the diversity of our workforce and the knowledge of our people. Mitchell will not discriminate against an applicant or employee on the basis of race, color, religion, national origin, ancestry, sex/gender, age, physical or mental disability, military or veteran status, genetic information, sexual orientation, gender identity, gender expression, marital status, or any other characteristic protected by applicable federal, state or local law."}