{"job title": "Machine Learning Scientist or Engineer", "company": "MIT Lincoln Laboratory", "city state": "– Lexington, MA", "rating": "3.9", "job description": "The Homeland Protection Systems group performs analysis to identify homeland security challenges and develop solutions to address these problems. We assess emerging technologies and their abilities to help protect and prevent threats to the United States, while considering their potential to cause harm if in the wrong hands. These assessments require us to create detailed simulations, conduct physics-based analyses, and evaluate systems in the field. Our analysts and engineers also develop prototype systems, perform demonstrations, and carry out field tests. Our research efforts include air, land, and maritime border security, critical infrastructure protection, transportation security, and disaster response.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nOur group is seeking highly motivated scientists and engineers who are interested in solving challenging technical problems in the fields of machine learning, computer vision, and signal processing. The candidate hired for this position will collaborate on a multi-disciplinary team to identify technology needs, develop candidate solutions, and quantify performance. The staff will work with experienced group members to learn about new technology and the homeland protection mission as well as develop a career growth path. In addition, the candidate will be expected to communicate with a variety of audiences including both technical and non-technical peers and sponsors. Learn more about what our team does here https://www.ll.mit.edu/r-d/homeland-protection/homeland-protection-systems.\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nMS in quantitative fields such as Machine Learning, Artificial Intelligence, Computer Vision, Applied Mathematics, Statistics, or similar technical field. In lieu of an MS degree, applicants with a BS and 3 to 5 years of experience will also be considered.\n<br><br>\nExperience with applying machine learning and/or computer vision to data sets and in programming languages/environments such as MATLAB, Python, C++, TensorFlow, etc. Applicant should have an intense curiosity to explore open questions under guidance and to acquire new skills in development platforms.\n<br><br>\nFor Benefits Information, click http://hrweb.mit.edu/benefits\n<br><br>\nMIT Lincoln Laboratory is an Equal Employment Opportunity (EEO) employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran status, disability status, or genetic information; U.S. citizenship is required.\n<br><br>\nRequisition ID: 25957"}