{"job title": "Lead. Data Scientist", "company": "MITRE", "city state": "– McLean, Virginia", "rating": "3.2", "job description": "<div><div><div><div><div><div>Join the Data Analytics team where you will provide software development, algorithm development, and data analytics (to include big data analytics, data mining, and data science) to enable data-drive decisions and insights.\n<br><br>\nExperience with analytic techniques and methods (e.g., supervised and unsupervised machine learning, link analysis, and text mining) as well as software languages is a must. Software languages and big data technologies needed include: Java, Python, R, C#, C, SAS, analytic engines, Hadoop, parallelized analytic algorithms, and NoSQL and massively parallel processing databases. The successful candidate will have the ability to formulate problems, prototype solutions, and to analyze results.\n<br><br>\n<strong>Key Functions:</strong>\n<br><br>\n• The candidate will be able to design and implement solutions for data/information integration, discovery, analysis, and visualization in large-scale data driven environments\n\n\n<ul>\n<li>Apply software systems engineering methods and tools across the system lifecycle to large and complex data systems</li>\n<li>Perform requirements engineering, and systems analysis for the integration of legacy functions and data into enterprise-level data management systems<br><br></li></ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Hands-on software development skills (Java, C++, C#, python, Javascript) with web services and web application technologies, database design and implementation (relational and NoSQL), data modeling, data analytics and visualization, and cloud-based technologies. Experience with the Map Reduce programming model and technologies such as Hadoop, Hive, and Pig is a plus.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<br>\nBS and 3 years related experience.</div>\n </div>\n</div>\n </div>\n </div>\n</div>\n<br>"}