{"job title": "Data Science Professional, Assistant Vice President", "company": "Mitsubishi UFJ Financial Group", "city state": "– NEW JERSEY-Jersey City", "rating": "3.2", "job description": "Discover your opportunity with Mitsubishi UFJ Financial Group (MUFG), the 5th largest financial group in the world with total assets of over $2.4 trillion (as ranked by SNL Financial, April 2016) and 140,000 colleagues in nearly 50 countries. In the U.S., we’re 13,000 strong, working together to positively impact every customer, organization, and community we serve. We achieve this by delivering on our values, putting people first, fostering long-term relationships built on honesty and mutual understanding, and inspiring the best in each other. This is all part of our inclusive, high-performing culture supported by Total Rewards that include our cash balance pension plan. Join a team that’s working to fulfill its vision to be the world’s most trusted financial group.<div><br><b>Data Science Professional, Assistant Vice President</b></div><div><b><br>Job Summary </b><br>Data Integration Lead with a thorough understanding of MUFG Bank products and data in required subject areas within core banking, capital markets, risk, finance, regulatory, and compliance. The Data Integration Lead will not only contribute to projects involving current state warehouse(s) by working closely with delivery teams but may also contribute to delivery of data services through a new Enterprise Data Platform (EDP) being built on AWS/cloud. Lead or contribute to the development, roll out, and testing of Informatica ETL and/or web service API based data integration between data consumers and DWH and/or EDP. Partner with source systems and downstreams to ensure timely processing and delivery of data. Works with operations staff to enhance supporting environment including systems, policies and security frameworks to ensure delivery of information to appropriate groups and business units. Implement Data Quality and GL Reconciliation solutions across portfolio of customers and financial transactions. <br><br><b>Major Responsibilities</b></div><div><ul><li>Design, document, develop, test, implement, monitor, maintain, and support Enterprise Data Warehouse and Enterprise Data Mart solutions, including subject area marts and interfaces to downstream applications.</li><li>Function as ETL SME and supply business and technical knowledge on required subject-areas and systems.</li><li>Develop and maintain complex ETL mappings, workflows, and Unix shell scripts in a data warehouse/data mart environment, based on technical specifications and other supporting documentation, using Informatica PowerCenter, Unix Shell Scripts, advanced SQL, and Tidal Enterprise Scheduler.</li><li>Perform DUT/SIT/UAT/DR/regression testing activities.</li><li>Handle user inquires and production support.</li><li>Conduct trainings and knowledge sharing sessions.</li><li>Support Data &amp; Enterprise Content Management Depart initiatives as required.</li><li>Early identification of development issues and corrective action to mitigate issues is required with these responsibilities. Contribute to technical debt reduction and DevOps.</li><li>Develop detail-level design documents from functional requirements and adhere to the development and naming standards established. </li><li>Partner with Operations Engineering, Infrastructure, and Release Management teams for deployments and support. </li></ul></div>\n<ul><li>College degree, preferably a B.S. in Computer Science, Engineering, Management Information Systems or a related field or the equivalent</li><li>Ability to lead projects as assigned and provide subject matter expertise to team members </li><li>Demonstrated ability to solve complex application and data-related problems </li><li>Excellent analytical and troubleshooting skills</li><li>Experience in Core Banking or Risk &amp; Finance domains/projects involving data warehouses and data marts is desirable </li><li>Experience in implementing complex large-scale data warehousing or data integration projects. (5 years)</li><li>Hands-on expertise in developing Informatica ETL mappings and workflows in complex large-scale data warehouse and data integration projects. (5 years)</li><li>Hands-on experience in designing relational and dimensional databases in the banking industry. (3 years)</li><li>Hands-on experience in Unix shell scripts. (5 years)</li><li>Hands-on experience in advanced SQL and advanced Excel functions. (5 years)</li><li>Hands-on experience in Tidal Enterprise Scheduler. (2 years)</li><li>Detail-oriented with excellent interpersonal, verbal and written communication, coordination, documentation, analytical, problem solving, leadership, and time management skills.</li><li>Hands-on advanced SQL and advanced Excel functions. (5 years)</li><li>Experienced in waterfall and agile SDLC methodologies. (5 years)</li><li>AWS, NoSQL, Cloud technologies knowledge and experience a big plus.</li></ul>The above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities duties and skills required of personnel so classified. <br><br>We are proud to be an Equal Opportunity / Affirmative Action Employer and committed to leveraging the diverse backgrounds, perspectives, and experience of our workforce to create opportunities for our colleagues and our business. We do not discriminate in employment decisions on the basis of any protected category. <br><br>A conviction is not an absolute bar to employment. Factors such as the age of the offense, evidence of rehabilitation, seriousness of violation, and job relatedness are considered in all employment decisions. Additionally, it's the bank's policy to only inquire into a candidate's criminal history after an offer has been made. Federal law prohibits banks from employing individuals who have been convicted of, or received a pretrial diversion for, certain offenses. <br><br>"}