{"job title": "Senior Director of Software Engineering &amp; Data Science", "company": "Moat", "city state": "– New York City, NY", "rating": "3.1", "job description": "We are looking for a director to lead and grow our data products team, an interdisciplinary group of engineers and data scientists. You would build products that ensure digital advertising is effective and transparent. Areas of focus include detecting and preventing ad fraud, helping advertisers assess website quality for millions of sites, and developing technology to make decisions using this data in real time.\n<br><br>\nAbout You\n<br><br>\n6+ years of hands-on engineering experience\n<br>\n3+ years of experience managing and coaching engineers and tech leads\n<br>\nA track record of owning large engineering projects from conception to delivery and solving open-ended challenges that require experimentation and iteration\n<br>\nThe ability to listen, teach, learn, propose ideas, build consensus, collaborate, and compromise.\n<br>\nFluency in Python and/or JavaScript\n<br>\nExperience with AWS, Linux, and cloud application architecture\n<br>\nExperience with data analysis techniques, from basic statistics to machine learning\n<br>\nFamiliarity with browsers and internet architecture\n<br>\nFamiliarity with data storage and access paradigms, including relational databases, key-value stores, and distributed queues\n<br>\nFamiliarity with distributed processing frameworks like Spark\n<br>\nExcellent attention to detail, critical thinking, tenacity, and curiosity\n<br><br>\nDetailed Description and Job Requirements\n<br><br>\nManage a team that designs, develops, troubleshoots and debugs software programs for databases, applications, tools, networks etc.\n<br><br>\nAs a director of the software engineering division, you will apply your extensive knowledge of software architecture to manage software development tasks associated with developing, debugging or designing software applications, operating systems and databases according to provided design specifications. Build enhancements within an existing software architecture and envision future improvements to the architecture.\n<br><br>\nAssists in the development of short, medium, and long term plans to achieve strategic objectives. Regularly interacts across functional areas with senior management or executives to ensure unit objectives are met. Ability to influence thinking or gain acceptance of others in sensitive situations. Demonstrated leadership and people management skills. Strong communication skills, analytical skills, thorough understanding of product development. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience."}