{"job title": "Data Scientist", "company": "Mojio", "city state": "– Campbell, CA", "rating": "4.3", "job description": "At Mojio, we're connecting the cars of today for the journeys of tomorrow. Backed by leading investors including Amazon and Deutsche Telekom, Mojio is driving the global adoption of its connected car technology via its growing portfolio of mobile network operator customers, including T-Mobile in the US, Austria and Czech Republic, Bell, Rogers and Telus in Canada, and Telekom Deutschland in Germany. With more than 7 billion miles worth of real-world driving data, we have created one of the largest and fastest-growing big data pools in the automotive industry. If you're interested in joining us on our mission to give every vehicle a voice, apply now!\n<br><br>\n<strong>Who you are</strong>\n<br><br>\nAs a <strong>Data Scientist</strong> at Mojio you will be a part of new product features from conception through deployment. You will have the opportunity to apply your knowledge of statistics and your analytical skills to mine data at scale and develop large-scale Machine Learning (ML) models to reveal customer value in data. You will support feature prototyping, and utilize industry best practices to write production-grade code. You will build data pipelines, implement ML-based analytical algorithms, and work closely with our software development team to set up back-end systems and interfaces that will deliver the next-generation analytics.\n<br><br>\n<strong>Specific job duties may include:</strong>\n\n<ul>\n<li>Prototyping and validating advanced ML and Deep Learning (DL) models and algorithms that transform big data into actionable information</li>\n<li>Providing data insight from massive amounts of data using data cleaning, data visualization, and statistical analysis tools and techniques</li> \n\n<li>Setting up and maintaining databases supporting analytics research and feature prototyping</li>\n<li>Writing production code to deliver analytics feature content as an Internet-of-Things (IoT) solution</li> \n</ul>\n<strong>Education Details</strong>\n<br>\nAn advanced degree (M.S. or Ph.D) in Data Science, Computer Science (CS), Electrical Engineering (EE), Operation Research (OR), or a comparable analytical field from an accredited institution\n<br><br>\n<strong>Location : Palo Alto, CA</strong>\n<br><br>\n<strong>Required Skills and Experience:</strong>\n\n<ul>\n<li>Expert in data mining, machine learning, deep learning, statistical modeling and data visualization techniques using data-oriented tools and languages such Python, R, and MATLAB</li>\n<li>3+ years experience or demonstrated fluency with Scala and at least one other programming language (Python, Java, C/C++/C# a plus)</li>\n<li>5+ years experience writing SQL-like as well as NoSql queries and databases</li>\n<li>Experience dealing with large amounts of unstructured data (experience with GIS data is a bonus)</li> \n\n<li>Experience setting up and using large-scale distributed data-processing frameworks such as Apache Spark and Hadoop Map-Reduce</li>\n<li>Experience working with enterprise-grade cloud computing platforms such as Microsoft Azure and Amazon AWS</li>\n<li>Demonstrated ability to develop high-quality code adhering to industry best practices (i.e., code review, unit tests, revision control)</li>\n<li>Familiarity with designing experiments and collecting data for the purpose of deriving data analytics insights and solutions</li>\n<li>Understanding of error propagation and the limitations of data subject to measurement uncertainties</li>\n<li>Work/project history reflective of a self-motivated professional who excels when given open-ended problems and broadly-defined goals, having an innate desire to discover the patterns and relationships in data that can be leveraged to provide business value</li>\n</ul>\nAll qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status, gender identity, social orientation, nor on the basis of disability.\n<br><br>\n<strong></strong>\n<br><br>\n<strong><em>Posted positions are not open to third party recruiters/agencies and unsolicited resume submissions will be considered free referrals.</em></strong>"}