{"job title": "Sr Product Dev Scientist - Coating Additives", "company": "Momentive Performance Materials", "city state": "– US NY Tarrytown", "rating": "3.8", "job description": "<b>Position Title:</b><p></p>Sr Product Dev Scientist - Coating Additives<br><b>Position Summary:</b><p></p>The Product Development Scientist works as a member of the Technology team within the Silanes Global Business Unit. As a member of the global Technology team the successful candidate will work closely with Marketing and Manufacturing teams to design and develop Organo-functional Silanes for Protective and Industrial Coatings. In addition, the candidate will establish formulation guidelines related to this product technology based on a deep understanding of the key chemical and physical interactions in Coating formulations and knowledge of the end applications. The candidate may also be involved in translations of new or existing products to other world regions and will provide technical support to the plants on an as needed basis in support of quality and or productivity projects.<br><b>Job Description:</b><p></p><ul><li>The successful candidate works on the design and evaluation of new, differentiated Organo-functional Silanes to meet the needs of the Protective Coatings Market and drive business growth for Momentive.</li><li>The candidate establishes formulation guidelines based on a solid understanding of the key chemical and physical interactions in Coating formulations and knowledge of the end applications.</li><li>This person also is responsible for ensuring utilization and development of world-class evaluation and characterization methodologies in collaboration with industry and academic leaders and with global customers in order to demonstrate the benefits of new product technologies in target applications and to develop compelling data to support product promotion in the market place.</li><li>This person works cross functionally with the Marketing and Sales teams to identify new market needs within the industry and assists in the identification of innovative silane and silicone product solutions that can meet these needs. They will provide technical support to customers as needed.</li><li>The candidate will conduct reviews and evaluations of existing patents and publications and generates new intellectual property (IP) as required.</li><li>This person will effectively manage multiple projects, ensuring clear alignment of goals and deliverables with business and market needs.</li></ul><br><b>Additional Details:</b><br> <p></p><p><b>Minimum Qualifications </b></p><ul><li>10+ years industrial experience in the coatings industry with expertise to develop formulations for a variety of coatings applications.</li><li>Possess high energy with the ability to handle diverse responsibilities, to prioritize, and to handle multiple projects simultaneously with emphasis on quality and speed.</li><li>Excellent verbal, written and presentation communication skills in English with strong interpersonal skills.</li></ul><p></p><p><b>Education Requirements </b></p><p>Master’s Degree (or higher) in Chemistry or Polymer Science</p><p></p><p>We are an Equal Opportunity, Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to gender, minority status, sexual orientation, gender identity, protected veteran status, status as a qualified individual with a disability or any characteristic protected by law.<br>In order to be considered for this position candidates are required to submit an application for employment through our career site, be at least 18 years of age, willing to take a drug test and submit to a background investigation as part of the selection process.</p><p>Candidates are required to have unrestricted authorization to work in the United States.</p><p>If currently an employee of the Company, you must have current satisfactory work performance and in most cases, have been in your current role 18 months.</p><p>Disclaimer: We are not accepting unsolicited assistance from search firms/employment agencies for this employment opportunity. Please, no phone calls or emails to any employee about this position. All resumes submitted by search firms/employment agencies to any employee of the Company via email, the Internet or in any other form and/or method without a valid written search firm agreement in place for this position will be deemed the sole property of the Company; no fee will be paid in the event a candidate is hired by the Company as a result of the unsolicited referral or through other means.</p>"}