{"job title": "Data Scientist", "company": "MoneyLion", "city state": "– New York, NY", "rating": "3.5", "job description": "<ul>\n<li>Work with members of different business divisions to generate ideas on how to use data to make processes more efficient or improve economics.</li>\n<li>Build probabilistic models to predict outcomes based on historical data.</li>\n<li>Train and test the various machine learning techniques on data sets to investigate credence to hypotheses on different business challenges.</li>\n<li>Work with engineering team members to deploy high performing candidate models to production.</li>\n<li>Formulate decisioning schedule to ensure predictions will not derail critical business metrics.</li>\n<li>Identify, monitor, and measure model performance over time.</li>\n<li>Develop dashboards to visualize findings in precise and meaningful ways.</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Undergraduate in Math, Computer Science, Statistics, or related technical field.</li>\n<li>Strong mathematical, statistical, and programming background.</li>\n<li>Must have hands on experience in machine learning, predictive analytics, and statistical modelling.</li>\n<li>Proficiency in R, Python (Jupyter, Pandas, Numpy, sklearn, etc.), and SQL.</li>\n<li>Ability formulate novel solutions to problems, communicate thought process clearly, and think within the context of larger business needs and targets.</li>\n</ul>\n\nMoneyLion is a leading mobile finance platform that empowers consumers to take control of their financial lives through free spending, saving and credit tracking tools, and smarter credit products. Founded in 2013 by a team of leading technologists and financiers, MoneyLion uses superior analytics and machine learning-based risk technology to gain a 360-degree view of its users' personal finances, enabling better underwriting and the development of tailored financial product offers. With its built-in system of social endorsements, loyalty points and rewards, MoneyLion endorses good financial behavior and habit building. MoneyLion is headquartered in New York with offices in San Francisco and Kuala Lumpur, Malaysia."}