{"job title": "Data Scientist", "company": "Monsanto Company", "city state": "– Saint Louis, Missouri", "rating": "4.0", "job description": "<div>We are seeking an exceptionally talented <strong>Data Scientist</strong> with core qualities to become an integral part of our Global Analytics Team within the Breeding Organization. The global breeding analytics team is a cutting-edge group that analyzes big data to develop predictive/prescriptive models to accelerate our companys product development.\n<br><br>\n<strong>Key Responsibilities:</strong></div><strong>\n<br>\n</strong>\n\n<ul>\n<li>Driving big data challenges in our diverse, highly dynamic group.</li> <li>Providing technical contributions in a fast-paced R&amp;D team environment to accelerate our efforts on building a data-driven product pipeline.</li> <li>Using advanced mathematical models, machine learning algorithms, operations research techniques, and strong business acumen to deliver insight, recommendations and solutions.</li> <li>Predicting and optimizing our product pipeline and improve probability of success of our products.</li> <li>Developing sustainable, consumable, accurate, and impactful reporting on model inputs, model outputs, observed outputs, business impact, and key performance indicators.</li> <li>Communicating research with peers, and with appropriate calibration to stakeholders in small and large group settings. Acquiring support and partnership from cross functional teams in the company, including engineering and IT teams at our company globally.</li> \n</ul>\n\n<strong><div>Required Skills/Experience:</div> \n\n<br></strong>\n\n\n<ul>\n<li>Minimum of Ph.D. -OR- Masters with equivalent experience. Degree may be in Computer Science, Economics, Engineering, Mathematics, Operations Research, Psychology, Physics, Statistics or related field.</li> \n\n<li>Creative, proactive, bold and out-of-box thinking.</li>\n<li> Strong business aptitude, the ability to rapidly learn new problem domains, and become conversant in the domain with subject matter experts.</li> \n\n<li>Ability to work in a matrix environment, leading &amp; influencing people at varying levels of responsibility.</li> \n\n<li>Proven ability to communicate complex analytical problem in clear, precise and actionable manner.\n<br>\n</li>\n</ul>\n<strong>Desired Skills/Experience:</strong>\n\n<ul>\n<li>Minimum of two or more years of experience coding and modeling using Python and/or R.</li> \n\n<li>Proficient in machine learning algorithms and concepts (Ensembles, Deep Learning, SVM, etc.).</li> \n\n<li>Proficient in operations research algorithms and mathematical optimization concepts.</li> \n\n<li>Prior experience in mathematical modeling, simulation, decisions analysis, stochastic models, system dynamics and/or forecasting.</li> \n\n<li>Experience with working in Linux environment and/or AWS.</li> \n\n<li>Experience with commercial optimization software (i.e., CPLEX, Xpress, Gurobi etc.).</li> \n\n<li>Experience with machine learning and deep learning packages (i.e. TensorFlow, Keras etc.).</li>\n</ul>\n\n<div>Bayer successfully completed the acquisition of Monsanto in June 2018, bringing together Monsantos leadership in seeds and plant traits with Bayers leadership in chemical and biological crop protection. By joining forces, we will create even more extensive career opportunities for talent around the world. Were a global team working to shape agriculture through breakthrough innovation that will benefit farmers, consumers, and our planet.</div>\n<br>\n<div>While we are now Bayer, we will continue to hire using separate career sites until we can integrate our career platforms. We invite you to explore the career opportunities available at the combined company by visiting advancingtogether.com/careers.</div>"}