{"job title": "Software Engineer III - Data Science (Advanced)", "company": "Montana State Fund", "city state": "– Helena, MT", "rating": "2.8", "job description": "Montana State Fund is looking for a Data Scientist to join the IT Enterprise Applications team. We are looking for a team member that will possess a passion for data and whose responsibilities include performing data wrangling by mashing up distinctive data sets, generating algorithms and models using statistical analysis, natural language processing and machine learning that will help in generating insights and predictions. Testing hypotheses through statistical inferential techniques and visualizing outcomes will also be a key aspect of this position. The ideal candidate will have excellent client and business interaction skills as well as outstanding written and verbal communication skills with expertise in using data, understanding data models and working effectively with data engineering and business teams. If the candidate has general insurance experience, that is an added plus.\n<br><br>\nIf this sounds interesting to you, please read on to learn about the essential functions, duties, and minimum qualifications for the Software Engineer – Data Science position.\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nIndependently and interdependently analyze and code complex technical solutions. Apply principles of software engineering to the design, development, maintenance, testing and evaluation of the enterprise software and systems. Provide technical leadership for highly complex business intelligence or insurance applications and projects, as well as, interact with enterprise users.\n<br><br>\n<strong>Essential Functions</strong>\n\n<ul>\n<li>Provides technical leadership for highly complex applications; defines, analyzes and creates software solutions for projects utilizing IT systems development methodology. Leads technical project teams in developing the solution design, assigns technical tasks to project teams, tracks progress, verifying completion of programming assignments according to program standards and reporting regularly. (40%)</li>\n\n<li>Develops and distributes programming specifications based on analysis. Writes code, test, maintain and enhances computer programs. (30%)</li>\n\n<li>Analyzes existing systems for improvements and evaluate proposed systems for feasibility and architectural compliance. Provides systems analysis, user support, and develops program specifications and reusable components for specific business applications. (20%)</li>\n\n<li>Provides technical expertise, advice and mentoring to other IT professionals regarding the application of complex systems analysis and design to business problems. (10%)</li>\n</ul>\n\nRequired Skills<br><br><strong>Duties</strong>\n\n<ul>\n<li>Develop application and enterprise level software solutions, evaluate enterprise requirements, analyze enterprise-wide software systems, provide solutions, and design, develop and implement applications.</li>\n\n<li>Provides technical leadership on large projects.</li>\n\n<li>Develops technical design for large projects.</li>\n\n<li>Analyze existing systems for improvements, and establish, implement and maintain specific systems, while monitoring and supervising systems performance.</li>\n\n<li>Design, develop, debug and unit test programs for commercial business applications.</li>\n\n<li>Translate business requirements into technical design documents, development and programming using software languages to meet business needs.</li>\n\n<li>Prepare application and system user documentation and conduct user training.</li>\n\n<li>Custom design specific programs for enterprise and user needs, to support business processes, provide specific technical awareness, insight and documentation as appropriate to departments and users.</li>\n\n<li>Mentor and train other developers and IT professionals and collaborate with other computer specialists to create optimum software.</li>\n\n<li>Review and provide input to other developers in design and coding.</li>\n\n<li>Analyze requirements for feasibility and user’s needs and then design, test, and develop software to meet such needs.</li>\n\n<li>Perform extensive functional testing of modules post-customization.</li>\n\n<li>Ensure that software continues to function normally through software maintenance and testing, execute production failure trouble shooting.</li>\n\n<li>Work with project teams to identify solution designs.</li>\n\n<li>Complete special projects as assigned.</li>\n\n<li>Modify existing software to correct errors, and to upgrade interfaces and improve performance.</li>\n\n<li>Develop or direct software system testing or validation procedures.</li>\n\n<li>Work with software design engineers to design tools and enhancements and write code to fulfill enterprise objectives and needs</li>\n\n<li>Consult with business or other departments on project status, proposals, or technical issues, such as software system design or maintenance.</li>\n\n<li>Analyze information to determine, recommend, and plan installation of a new system or modification of an existing system.</li>\n\n<li>Design or develop software systems, using scientific analysis and mathematical models to predict and measure outcome and consequences of design.</li>\n\n<li>Prepare reports or correspondence concerning project specifications, activities, or status.</li>\n\n<li>Confer with data processing or project managers to obtain information on limitations or capabilities for data processing projects.</li>\n\n<li>Store, retrieve, and manipulate data for analysis of system capabilities and requirements.</li>\n\n<li>Works with programmers, designers and other staff in specific technical knowledge areas to assist them in becoming familiar and competent with new skills.</li>\n</ul>\n\nRequired Experience<br><br><strong>Minimum Requirements</strong>\n\n<ul>\n<li>Requires a bachelor’s degree in Computer Engineering, Electrical Engineering, Electronics Engineering, Computer Science or other related field.</li>\n\n<li>Must have seven (7) years’ directly related IT work experience and two (2) years in a lead technical role (or equivalent combination of education and experience) in the following technologies:\n\n\n<ul>\n<li>Python for generating machine learning algorithms.</li>\n\n<li>Natural Language Toolkit for performing text analytics.</li>\n\n<li>Structured Query Language (SQL) used to generate queries.</li>\n\n<li>R or SAS for testing of hypotheses.</li>\n\n<li>R / Python / Tableau / Power BI / Qliksense used for data visualization.</li>\n\n<li>Hortonworks/Cloudera/MapR for use on big data technologies or any other big data distribution.</li>\n\n<li>Generating reports using business intelligence software like Cognos/Microstrategy OR generating data pipelines using data integration software like Informatica/IBM Data Stage.</li> \n\n<li>Equivalent current technologies will also be considered.</li>\n</ul>\n\n</li>\n</ul>\n<strong>Preferred</strong>\n\n<ul>\n<li>Master's Degree in a related field, such as Statistics or Data Science.</li>\n\n<li>Relevant certifications.</li>\n</ul>\n\nJob Location\n<br>\nHelena, US-MT\n<br>"}