{"job title": "DATA SCIENTIST", "company": "Montefiore Medical Center", "city state": "– YONKERS, NY", "rating": "3.5", "job description": "<div>The Data Science Engineer will help us discover the insight hidden in vast amounts of clinical, biological, environmental, socio-economic, operations, and business data, in order to make smarter decisions, to deliver even better health for our patients and population. The primary focus will be in applying mathematics, artificial intelligence, high performance computing, and data mining techniques, to build high quality predictive, suggestive, and descriptive analytics integrated with EMR (Epic) and other delivery of care processes and operational systems. This will include (but will not be limited to) developing big-data analytics solutions for “automated scoring using machine learning techniques”, “recommendations and decision support systems”, \"early recognition and alerting systems\", \"biosurveillance systems\", “improving and extending our existing platforms for machine learning and predictive modeling”, and developing “internal QA and validation procedures”. The objective is to improve quality of care, patients outcomes and lower cost of care, while enhancing patient safety, satisfaction and experience within Montefiore. This position will work directly with the Network Performance Group, MIT, Clinical Research Informatics, and CMO to ensure data driven decisions and Montefiore appropriate care management programs are consistently and uniformly are delivered throughout the enterprise.\n<br><br>\nEXPERIENCE\n\n\n<ul>\n<li>-------------------</li>\n</ul>\n\n<strong>REQUIRED in any of the following:</strong>\n\n\n<ul>\n<li>Verifiable experience working with health-data from EMR (preferably Epic), Clinical databases and clinical or enterprise data warehouses.</li>\n<li>Verifiable experience working with and optimizing SPARQL queries and and graph (RDF) based database (triple stores)</li>\n<li>Verifiable experience working with R and Python analytic languages</li>\n<li>Verifiable experience working with enterprise analytics platforms such as H2O.ai, KNIME, R Studio, or similar\n<br><br>\nRequired educational background:</li>\n\n<strong><li>Formal Healthcare Economics education/degree\n<br><br>\nPREFERRED:</li>\n\n</strong>\n\n<li>Experience in clinical informatics, clinical terminologies (ICD9-10, LOINC, CPT, etc).</li>\n<li>Experience working in an Agile/Scrum environment.\n<br><br>\nOTHER REQUIRED SKILLS:</li>\n<li>Excellent interpersonal and writing skills to communicate and document user interactions and requirements</li>\n<li>Strong analytical skills to analyze, categorize and translate business/user requirements to functional requirements</li>\n<li>Excellent presentation skills for demo and user training, writing skills for user documentations</li>\n<li>Demonstrated ability to take initiatives, establish/enhance business analysis procedures and improve operational efficiency\n<br><br>\n<strong>Department:</strong> Network Performance Group<strong> Bargaining Unit:</strong> Non Union<strong> Campus:</strong> MOSES<strong> Employment Status:</strong> Regular Full-Time<strong> Address:</strong> 6 Executive Plaza, Yonkers</li>\n</ul>\n\n<strong>Shift:</strong> Day<strong> Scheduled Hours:</strong> 8:30 AM-5 PM<strong> Req ID:</strong> 97150\n<br><br>\n<strong>Montefiore is an equal employment opportunity employer. Montefiore will recruit, hire, train, transfer, promote, layoff and discharge associates in all job classifications without regard to their race, color, religion, creed, national origin, alienage or citizenship status, age, gender, actual or presumed disability, history of disability, sexual orientation, gender identity, gender expression, genetic predisposition or carrier status, pregnancy, military status, marital status, or partnership status, or any other characteristic protected by law.</strong>\n<br><br>\nN/A</div>"}