{"job title": "Data Scientist", "company": "Morgan Stanley", "city state": "– New York-New York", "rating": "3.8", "job description": "<strong>Company Profile</strong>\n<br><br>\nMorgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm's employees serve clients worldwide including corporations, governments and individuals from more than 1,200 offices in 43 countries.\n<br><br>\nAs a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence and strong team ethic. Morgan Stanley can provide a superior foundation for building a professional career - a place for people to learn, to achieve and grow. A philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture.\n<br><br>\n<strong>Technology</strong>\n<br><br>\nTechnology works as a strategic partner with Morgan Stanley business units and the world's leading technology companies to redefine how we do business in ever more global, complex, and dynamic financial markets. Morgan Stanley's sizeable investment in technology results in quantitative trading systems, cutting-edge modeling and simulation software, comprehensive risk and security systems, and robust client-relationship capabilities, plus the worldwide infrastructure that forms the backbone of these systems and tools. Our insights, our applications and infrastructure give a competitive edge to clients' businesses—and to our own.\n<br><br>\n<strong>MS Investment Management (IMIT) Technology</strong>\n<br><br>\nMorgan Stanley Investment Management (IMIT) Technology exclusively partners with the Morgan Stanley Investment Management (MSIM) business division to design and develop systems and integrate vendor products to globally support full life cycle business processing. Activities include Portfolio Analysis, Risk, Trading, Operations, and Sales &amp; Marketing. Morgan Stanley Investment Management (MSIM) Technology also provides holistic support and quality assurance across the suite of applications used in the MSIM environment.\n<br><br>\n<strong>The Role</strong>\n<br><br>\nSales and Marketing are looking for an experienced Data Scientist with Machine Learning focus. The person in this role would be responsible for conducting data analysis and developing predictive models leveraging data science and machine learning to solve various business use cases, including sales prospecting, segmentation, and lead generation. We are looking for a Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company and external data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n· Work with stakeholders to identify opportunities for leveraging company data to drive business analytics solutions.\n<br><br>\n· Research and develop statistical learning models for data analysis\n<br><br>\n· Communicate results and ideas to key decision makers\n<br><br>\n· Identify valuable data sources and automate collection processes\n<br><br>\n· Undertake preprocessing of structured and unstructured data\n<br><br>\n· Analyze large amounts of information to discover trends and patterns\n<br><br>\n· Build predictive models and machine-learning algorithms\n<br><br>\n· Combine models through ensemble modeling\n<br><br>\n· Present information using data visualization techniques\n<br><br>\n· Collaborate with sales, marketing and product development teams\n<br><br>\n<strong>Skills and Experience</strong>\n<br><br>\n· Strong problem solving skills with an emphasis on sales and marketing predictive analytics.\n<br><br>\n· Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\n<br><br>\n· Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\n<br><br>\n· Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\n<br><br>\n· Excellent written and verbal communication skills for coordinating across teams.\n<br><br>\n· A drive to learn and master new technologies and techniques.\n<br><br>\n· Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.\n<br><br>\n· Experience querying databases and using statistical computer languages: R, Python, SLQ, etc.\n<br><br>\n· Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.\n<br><br>\n· Experience analyzing data from 3rd party providers: MarketMetrics, etc.\n<br><br>\n· Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.\n<br><br>\n· Experience visualizing/presenting data for stakeholders using: Business Objects, Tableau, D3, ggplot, etc.\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n· BSc/BA in Computer Science, Statistics, Applied Math, Engineering or relevant field; Graduate degree in Data Science or other quantitative field is preferred\n<br><br>\n· Proven experience as a Data Scientist or Data Analyst\n<br><br>\n· 7 years’ practical experience with SAS, ETL, data processing, database programming and data analytics\n<br><br>\n· Extensive background in data mining and statistical analysis\n<br><br>\n· Able to understand various data structures and common methods in data transformation\n<br><br>\n· Excellent pattern recognition and predictive modeling skills\n<br><br>\n· Experience with programming languages such as Java/Python an asset\n<br><br>\n· Understanding of machine-learning and operations research\n<br><br>\n· Knowledge of R, SQL and Python; familiarity with Scala, Java or C is an asset\n<br><br>\n· Experience using business intelligence tools (e.g. Tableau) and data frameworks (e.g. Hadoop)\n<br><br>\n· Analytical mind and business acumen\n<br><br>\n· Strong math skills (e.g. statistics, algebra)\n<br><br>\n· Problem-solving aptitude\n<br><br>\n· Excellent communication and presentation skills"}