{"job title": "Data Scientist", "company": "Mosaic", "city state": "– Grand Rapids, MI", "rating": "3.1", "job description": "Overview\n<br><br>\nThe Data Scientist will be a part of a team chartered to merge and mine large amounts of retail execution, sales and other relevant data to develop algorithms and production grade analytical solutions that drive decisions on what work Acosta does for its clients that delivers them and internally within Acosta most value. This position will report to the leader of this project team.\n<br><br>\nCustomer Analytics\n<br><br>\nQuantitative Analyst\n<br><br>\nResponsibilitiesEssential Functions of this Position (list in order of most important to least important):Development of analytical capabilities to serve diverse business use cases, in active collaboration with product management and technology counterparts.Cross-functional, internal and external consulting, including discovery/structuring of business problems, and exploratory analysis of candidate methods to identify promising approaches for development.Creation and maintenance of solution documentation, including data transformation, models, and solution integration.Ownership and lifecycle management for analytics capabilities working in a production environment, including computational performance, accuracy/validity, and extension to new usesQualifications\n<br><br>\n<strong>Minimum Education Requirements:</strong>\n\n\n<ul>\n<li>Graduate Degree</li>\n</ul>\n\n<strong>Experience Requirement:</strong>\n\n\n<ul>\n<li>Four to seven years of experience with programming languages like Python (preferred), R or SAS to write complex code and implement into a production environment. Must be able to develop independently and guide others within the development team.</li>\n<li>Practical experience with development, tuning, and maintaining Machine Learning capabilities at scale.</li>\n<li>Experience generating linear and/or logistic regression models. Must be able to generate complex analytic models on a large scale with no guidance. Must be able to guide others in the same.</li>\n<li>Experience with Linear / Integer Programming and/or other optimization techniques. Must be able to generate complex solvable optimization models on a large scale with no guidance. Must be able to guide others in the same.</li>\n<li>Experience with data science in Microsoft Azure or cloud environments using Spark or alternative parallel computation capabilities highly desired.</li>\n<li>CPG, sales and/or retail experience highly desired</li>\n</ul>\n\n<strong>Knowledge, Skill and Ability Requirements:</strong>\n\n\n<ul>\n<li>An understanding of different data sources, their proper uses, and their limitations. Must be able to identify data that is unclean and/or misapplied and must be able to recommend the proper methodology to fix any issues.</li>\n<li>Excellent written and verbal communication skills that allows story telling. Must be able to clearly speak English and must be able to communicate very technical procedures to a non-technical audience.</li>\n<li>Strong analytical and problem-solving skills with the ability to collect, organize, analyze, and disseminate significant amounts of information residing in large datasets.</li>\n<li>Ability to consult across various business functions to explain analytic functions and how they can be used to drive a business.</li>\n<li>Intellectual curiosity is critical.</li>\n</ul>"}