{"job title": "SQL Data Analyst, Analyst/Officer", "company": "MUFG", "city state": "– Jersey City, NJ", "rating": "3.2", "job description": "Discover your opportunity with Union BankÂ® and become a part of one of the world's leading financial groups. Union Bank is a member of Mitsubishi UFJ Financial Group (MUFG), the world's 5th largest financial group in the world with total assets of over $2.4 trillion (as ranked by SNL Financial, April 2016) and 140,000 colleagues in nearly 50 countries. In the U.S., we're 13,000 strong, working together to positively impact every customer, organization, and community we serve. At Union Bank, we aim to be the premier and most-trusted West Coast bank, serving customers with high-touch, local delivery and global capabilities as we leverage our rich, 150-year history. This is all part of our inclusive, high-performing culture supported by competitive Total Rewards, including our cash balance pension plan. Join a team that's working to fulfill its vision to be the world's most trusted financial group.<br>\n<div><strong>Job Summary:</strong></div>\n<br>The Data Analyst works with Business analysts and SME's to understand all aspects of the business data. The Data Analyst is responsible to query and profile the business data to understand how the business data is used; Data Analyst is also responsible for understanding and supporting the definition of the enterprise definitions and values for that are incorporated into the integrated data warehouse. This includes validating the definitions across the organization to make sure we have a common definitions and calculations.<br>\n<div><strong>Responsibilities:</strong></div>\n\n<ul>\n<li>Works with Business SME to identify available data sources for the business unit</li><li>Identifies existing source extracts or defines new extracts to be captured for the UBDW</li><li>Query and profile data</li><li>Understand and translate source code values</li><li>Document data quality issues</li> <li>Define data quality checks (existence, consistency, defaults, cross field) and cleansing rules</li><li>Works with the Modeling team to map data into the business data models</li><li>Prepare Source to Target data mapping documentation for developers</li><li>Able to create test data in all phases (Unit, Integration, User Acceptance, and Performance)</li><li>Support the Data Steward in understanding potential enterprise key data elements</li><li>Gathering source data definitions</li><li>Identifying enterprise level data elements</li><li>Support definition of common data elements</li><li>Validating definitions across the organization</li><li>Communicating and documenting standard data definitions</li></ul>\n\n<ul>\n<li>Bachelor degree with 2+ years of experience in\n<br>\n conducting requirement analysis, functional &amp; detail design documents\n<br>\n along with technical specs for business rules.</li> <li>Agile development experience is a must.</li><li>Work in a development environment with set deliverables\n<br>\n and a system life cycle is a must.</li><li>SQL knowledge and database queries knowledge is a must</li><li>Banking/Financial Services experience is a must.</li> <li>Banking product knowledge in either core banking\n<br>\n products (loans, deposits, forex and money market) or Capital Markets\n<br>\n products (Derivatives, Options &amp; Futures, Securitization and Fixed\n<br>\n Income) is a plus</li><li>Some knowledge of data warehousing and data integration\n<br>\n is a plus.</li> <li>Data modeling knowledge is a plus.</li>\n</ul>\nThe\n<br>\nabove statements are intended to describe the general nature and level of work\n<br>\nbeing performed. They are not intended to be construed as an exhaustive list of\n<br>\nall responsibilities duties and skills required of personnel so classified.\n<br><br>\nWe\n<br>\nare proud to be an Equal Opportunity / Affirmative Action Employer and\n<br>\ncommitted to leveraging the diverse backgrounds, perspectives, and experience\n<br>\nof our workforce to create opportunities for our colleagues and our business.\n<br>\nWe do not discriminate in employment decisions on the basis of any protected\n<br>\ncategory.\n<br><br>\nA\n<br>\nconviction is not an absolute bar to employment. Factors such as the age of the\n<br>\noffense, evidence of rehabilitation, seriousness of violation, and job\n<br>\nrelatedness are considered in all employment decisions. Additionally, it's the\n<br>\nbank's policy to only inquire into a candidate's criminal history after an\n<br>\noffer has been made. Federal law prohibits banks from employing individuals who\n<br>\nhave been convicted of, or received a pretrial diversion for, certain offenses."}