{"job title": "Data Scientist", "company": "Mystery Science", "city state": "– San Francisco, CA", "rating": "5.0", "job description": "Data Scientist<br><br>We’re looking for an experienced Data Scientist to join our Growth Team. As our first Data Scientist, you will have the opportunity to shape the team, shape our tooling, and play a key role in decisions impacting our product strategy. From the beginning of the company, we've been systematic in our testing and analysis of product experiences, and we have grown quickly thanks to a highly optimized viral referral loop. But up until now, analysis and experimentation has been handled by our growth engineers / every member of our growth team. We are ready to build out our data science capabilities. We are headquartered in San Francisco and this position is based in our office.\n<li>Do you have experience working as a Data Scientist on a disciplined growth team?</li>\n<li>Are you someone who has a deep understanding of the core principles of statistics and can explain them to a layman?</li>\n<li>Are you adept enough as an engineer that you can hop into code, fix some instrumentation, and migrate a couple database columns in order to enable the analysis you want to do?</li>\nThis is an opportunity to help fix science education for the next generation. In this role you’ll report to our Director of Growth, Huey Kwik. You’ll work closely with him, our whole product team, and our CEO—we are very collaborative in our product experimenting and analysis. Our team’s experience with growth and data comes from Facebook and Palantir, with many years of experience optimizing conversion funnels. Help us create more problem solvers by bringing a better science education to 25 million kids.\n<br><br>\n<strong>What is Mystery Science?</strong>\n<br><br>\nMystery Science has created the fastest growing science curriculum in the U.S. We’re already used by teachers in more than 20% of elementary schools in the country. We have an early product with a lot of future plans, yet our sales have already taken off. In an industry that is plagued by long sales cycle and high barriers to entry, we’ve sold thousands schools without a single sales person. We’re backed by a great group of investors including Y Combinator, Learn Capital, and Reach Capital.\n<br><br>\n<strong>If you’re looking for the basics:</strong>\n<li>$4M in funding from leading education investors</li>\n<li>Competitive salary</li>\n<li>Equity in a high-growth company</li>\n<li>401K, health care, vacation</li>\n<li>Customers who love us</li>\n…but the real perks of working at Mystery Science are the quality of the people on your team and the problem we’re solving. This is what bring us to work every day.\n<br><br>\nOn your first day at Mystery Science, you’ll meet 30 people who are passionate about science, children, and education, and who each love their respective crafts. You can meet our team here: http://mysteryscience.com/team.\n<br><br>\nWe are collecting every question children ask about the world and building out the ultimate knowledge base for kids. Our mission is to help children stay curious as they grow up. Our first product is a tool for teachers to use in the classroom. It contains a full science curriculum that makes it easy for elementary teachers to re-create scientific discoveries in the class. Thanks to support from our teachers, we’re now collecting kids’ questions and building a platform to answer every question. We’re preparing to build a visual Wikipedia for kids, enabling children to explore any question they have.\n<br><br>\nWe’re on a mission to accelerate human progress by creating more problem solvers in the next generation. We’re working on the most important infrastructure problem in the world today: our ability to solve problems. Richard Feynman explains the problem well. To paraphrase him: our modern lives are made possible by our knowledge of science and technology, yet remarkably few people have a scientific perspective on the world. At Mystery Science, we have developed a unique way to pass on knowledge to the next generation and develop children’s ability to think.\n<br><br>\nIf you’re an experienced Data Scientist with deep experience helping grow products and want to be an early member of our Growth Team, let’s talk."}