{"job title": "Data Scientist", "company": "N.F Smith &amp; Associates", "city state": "– Houston, Texas, United States", "rating": "4.2", "job description": "This Data Scientist role will be a senior technical resource that has experience in Data Modeling &amp; Analysis, Large-Scale Data Mining and customer facing experience. You will be part of the fast-pace, entrepreneurial team that focuses on enabling Big Data and digital/real-time analytical solutions leveraging transformational technologies (R Programming, Python) to deliver cutting edge solutions.\n<br><br>\n<strong>Principle Accountabilities:</strong>\n\n<ul>\n<li>Help build a foundation for state of the art technical and scientific capabilities to support a number of ongoing and planned data analytics projects. Stay on top of industry’s achievements and capabilities, in order to partner with our clients and provide forward-thinking recommendations.</li>\n<li>Working alongside machine learning experts, technologists, product managers and other informatics analysts to solve complex business problems. Responsible for identifying the data we should be collecting, devising methods of instrumenting systems to extract this information and working with technologists to develop the process to transform raw data into business insights.</li>\n<li>Investigate data visualization and summarization techniques for conveying key findings related to the applied analytics.</li></ul>\n\n\n<ul>\n<li>Maintain a good communication channel with the Project Managers, Business Analysts and Project Teams.</li>\n<li>Establish strong working relationship with business analysts to understand requirements.</li>\n<li>Analyze technical needs, requirements, and state of the client’s infrastructure design, integration, and operations with business analyst team and the client.</li> \n\n<li>Follow design models, plans, internal standards, budgets, and processes.</li>\n<li>Plan for how code will be organized; how the contracts between different parts of the system will look; and monitor the ongoing implementation of the project's methodologies.</li>\n<li>Prepare details documents like business process flows, data flow diagrams, best practice guidelines describing project phases and tasks, deployment scenario for the solution in terms of hardware and software technologies needed etc.</li>\n<li>Collaborate with Project Managers and to estimate cost involved in the solution design proposed and compare with customer's budgets; develop overall solution implementation plan.</li>\n<li>Communicate and present proposed solutions to client with detailed documents prepared.</li>\n<li>Provide support in implementing application installation, customization, and system integration.</li>\n<li>Support development teams to review codes, when in doubt</li>\n<li>Support QA teams to ensure functionalities are satisfactory and is in adherence to the design and the client requirement.</li>\n<li>Provide support for projects in case of issues in development or implementation of solutions.</li>\n<li>Follow knowledge management practice in capturing design notes, deliverables, methodologies, and solution development activities for traceability and troubleshooting purposes.</li>\n</ul>\n\n<strong>Required Skills</strong>\n<br>\n<br>\n<ul>\n<li>Advanced degree (Master’s level or higher) in mathematics, statistics, computer science, or other highly quantitative discipline is required</li>\n<li>Thorough understanding of probability and statistics, econometric time series analysis and similar</li>\n<li>Expertise in theory and practice of Machine Learning and Natural Language Processing</li>\n<li>Requires strong programming skills</li>\n<li>Experience with tools such as R Programming, Python, etc.</li>\n<li>Knowledge of big data platforms such as Hadoop, Cloudera, MapR, etc.</li>\n<li>Ability to facilitate discussion, drive consensus, and build partnership</li>\n<li>Ability to produce high quality work products under pressure and within deadlines.</li>\n<li>Ability to handle multiple tasks simultaneously and switch between tasks quickly.</li>\n<li>Ability to construct an approach/plan for the execution of priorities</li>\n</ul>"}