{"job title": "Data Scientist", "company": "Narrativ", "city state": "– New York, NY, US", "rating": "4.5", "job description": "<strong>About Narrativ</strong>\n<br>\n<div><strong>Narrativ is a NYC-based, NEA-backed tech startup that is building a better internet for shoppers. We do this with machine learning technology that rewires links at massive scale so that:</strong></div><ul>\n<li>\nAdvertisers unlock a $25B monopoly by converting Amazons static link empire into a competitive CPC marketplace</li>\n<li>\nPublishers get paid like Google rather than like a coupon site. Narrativ boosts yield 4X on link inventory with competitive bidding in content.</li>\n<li>\nConsumers find what they want at the best prices online and will never land on an out of stock or 404 page.</li>\n</ul>\n\n<div>\nWith more than one billion links rewired, Narrativ partners include Conde Nast, New York Magazine, Ulta Beauty and Nordstrom. We launched out of stealth in August 2017 and are on pace to deliver $600M in advertiser revenue in 2018. In June 2018, The World Economic Forum honored Narrativ as a Technology Pioneer for our commitment to digital sustainability.</div>\n\n<br><strong>The Job</strong><br>\n<div>\nNarrativ is looking to hire a data scientist whose work will improve the products and technology solutions that continue to drive higher revenues for our partners and make it easier for consumers to find the best products at the best prices.</div><br>\n<div>\nAs a technology company that powers more efficient advertising and marketing, we collect large amounts of data. We feed this into our real time bidding system and use it to match products across retailers so that our users have seamless shopping experiences online. In this role, you will be expected to explore the data we have collected, present key findings about the data to relevant stakeholders, develop models that explain trends in the data, and help use those models to build new features into our products. You will be our first data scientist, so youll have the opportunity to help define what that role looks like in a tight and talented team.</div><br>\n\n<div><strong>Core Responsibilities Include:</strong></div><ul>\n<li>\nExplore and visualize clickstream and product data</li>\n<li>\nDevelop models and theories to explain trends in the data</li>\n<li>\nDesign and execute experiments to question assumptions and validate theories</li> \n<li>\nClean, analyze, and select data to achieve project goals</li>\n<li>\nBuild production systems using modeling or machine learning to exploit data trends and track impact over time; ability to accurately determine cause &amp; effect relationships</li>\n<li>\nPresent clear proposals and results that combine data and actionable solutions</li>\n<li>\nEnsure data quality through the processes of sourcing, collecting, normalizing, transforming and aligning/mapping through all stages of data acquisition.</li>\n<li>\nCollaborate with colleagues on the engineering and business teams to improve our data querying infrastructure for both off and online use cases.</li> \n</ul>\n\n<br><br>\n<strong>Requirements</strong>\n\n<ul>\n\n<li>\nRelevant degree with academic experience in high level math or statistics. Proven track record of data dives that discover hidden patterns or enable error/deviation analysis a huge plus.</li>\n<li>\n5+ years experience using various machine learning techniques to model large data sets and knowledge of the parameters that affect their performance</li>\n<li>\nProficiency in command line usage and Python to implement models</li>\n<li>\nAbility to work independently on data exploration and visualization tasks</li>\n<li>\nMotivation to achieve results in a dynamic, fast-paced environment</li>\n<li>\nExceptional level of organization and strong attention to detail</li> \n</ul>\n\n<br><br>\n<strong>Why Narrativ?</strong>\n\n<ul>\n\n<li>\nWe offer incredibly competitive salaries and cover 100% of health, dental and vision.</li> \n<li>\nWe are challenging monopolies and architecting a new business model for media- the work you do here will have meaning</li> \n<li>\nWe are a profitable company that is growing rapidly without throwing cash out the window.</li> \n<li>\nWe have weekly happy hours, monthly company outings and our Slack meme game is the best in the business</li> \n<li>\nWe are committed to making a societal impact by building sustainable technology to #EndThe404 and open-sourcing many of our projects to contribute to the broader digital community.</li> \n</ul>\n\n<br>"}