{"job title": "Data Scientist", "company": "Narvar", "city state": "– San Francisco, CA", "rating": "3.8", "job description": "Narvar offers an enterprise SaaS platform that helps leading brands and retailers build lifelong relationships with their customers beyond the buy button. More than 60% of Americans online have interacted with Narvars platform. More than 400 leading retailers including brands like Nordstrom, Sephora, Patagonia, REI, GameStop use our shipment, tracking, returns and analytics products.\n<br><br>\nOur Data Team works with massive data sets. Tens of millions of transactions per month to build new products and improve all aspects of the Narvar platform. Data is at the core of our competitive advantage so the work you do has a large impact across the company, our business partners, and the lives of our end users.\n<br><br>\nAs a full stack data scientist you will write production code that solves business problems and work in a fast paced high-achievement team setting. This is an excellent opportunity to help expand the data science practice and work with talented developers and scientists.\n<br><br>\n<strong>In this role you will:</strong>\n\n<ul>\n<li>Build machine learning pipelines for use cases spanning e-commerce, consumer trends, markets, logistics, and new products.</li>\n<li>Work on real-world consumer data for image classification, time series analysis, outlier detection, etc.</li>\n<li>Work with large unstructured data.</li>\n<li>Be at the intersection of mathematics, machine learning, business, and computer science.</li>\n</ul>\n<strong>You have:</strong>\n\n<ul>\n<li>Experience with machine learning or optimization modeling and know how to create visualizations in order to tell a story.</li> \n\n<li>Data Science and Data Engineering skills. You should enjoy writing programs that run on servers and talk to databases.</li>\n<li>Experience understanding the strengths and weaknesses of different modeling approaches and can effectively reason about when to apply different combinations.</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n<li>Ph.D. in Computer Science, Statistics, Math, Science (physical or social), Engineering or similar quantitative and computation field plus <strong>3-5 years</strong> of industry experience.\n<br>\nOR</li>\n<li>MS in Computer Science, Statistics, Math, Science (physical or social), Engineering or similar quantitative and computation field plus <strong>5+ years</strong> of industry experience.</li> \n\n<li>Strong coding skills with the ability to write production quality code.</li>\n<li>Strong understanding of probability &amp; statistics, and/or machine learning, and algorithms</li>\n<li>Fluency in Python, Pandas, Spark, numpy, and machine learning packages</li>\n<li>Experience with deep generative models a plus.</li>\n<li>Experience implementing applications on Amazon AWS</li>\n<li>Experience with SQL and NoSQL databases</li>\n<li>Experience working with Linux, shell scripting</li>\n<li>Strong team orientation; excellent communication; self-starter that can balance sophistication with practicality</li>\n<li>Tag your application with your solution to an active / recently concluded Kaggle competition, to get ahead of the list. :)</li>\n</ul>"}