{"job title": "Senior Instrument Data Software Engineer", "company": "NASA Jet Propulsion Laboratory ", "city state": "– US-CA-Pasadena", "rating": "4.2", "job description": "<div>Overview\n<p> </p>\n<p></p>\n<p> </p>\n<p> </p>\n<p> New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL. Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence. </p>\nResponsibilities\n<p> </p>\n<p>Are you passionate about developing software systems and applications in support of science discovery, data-driven analysis and ground breaking research? Do you thrive in an environment motivated to answer challenging questions about our universe and where you can work on potential approaches and solutions to new and unusual problems? JPL's Machine Learning &amp; Instrument Autonomy team has an excellent opportunity for a Senior Software Engineer to bring your software development expertise and knowledge to the team of Data Scientists and Technologists in support of the research, science data processing and analysis. Our team is within JPL's Instrument Software and Science Data Systems Section which consists of multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems. The team is responsible for safely controlling JPL remote sensing instruments. Transforming data collected by these instruments into scientific measurements and preserving them for future analyses. Providing context and understanding to the measurements. Making the measurements and related information accessible to a broad and global user community. Our engineering teams build and operate high performance data processing, management and analysis systems capable of handling petabyte scale datasets to support of science discovery, research, operations and applications. They support JPL and NASA missions, as well as other science-based projects. Our research and technology development teams create new onboard and ground based technologies for data processing, analysis, modeling, reasoning, visualization, management, access and analytics that are infused into our data systems.</p>\n<p> </p>\n<p>The Machine Learning &amp; Instrument Autonomy Group uses Machine Learning (ML) and data-driven analysis to support science and engineering in all aspects of JPL’s mission, from efficient algorithms running on very constrained Mars rover onboard computers to server farms processing millions of astronomical observations per night. </p>\n<p>Our goal is making explainable, confidence-estimating systems both for space-borne autonomy and to facilitate live data exploration and decision support. Your position as Senior Software Engineer includes responsibilities for refactoring / optimizing current and future numeric ML codes for tight speed, memory, and compute requirements. You will also need to lead and enforce compliance to the best software development practices including continuous integration, documentation styles, and validation test suites. You will be working with experts in novel space-supporting ML as well as hardware teams building brand-new space-borne computing infrastructures to push the frontiers of what can be done. </p>\n<p> </p>\n<p>This opportunity will provide a JPL career path for infusing the power of ML into science, engineering, and space missions.</p>\nQualifications\n<ul>\n <li>Master's degree Computer Science or related technical discipline with typically a minimum of 4 years related experience or Bachelor's with 6 years experienc</li>\n <li>Significant knowledge/experience with C/C++ and Python languages as well as Linux development</li>\n <li>Demonstrated capability to optimize code for specific computational hardware (e.g. SIMD/GPU’s, PIM, multi-core, embedded, FPGA, etc.)</li>\n <li>Exceptional modern software engineering skills on major projects such as unit testing, end to end validation, continuous integration</li>\n <li>Emphasis on modularity, code clarity, ease of maintenance by non-developers</li>\n <li>Advanced numeric coding experience (e.g. satellite data, real-time system monitoring, autonomous systems, data pipelines, medical imaging systems)</li>\n <li>Lead software engineer skills (system design, continuous integration/DevOps, multi-tier testing, simplicity/readability, validation suites, Jenkins, Git pull requests, code review)</li>\n <li>Excellent communication skills to understand user needs, negotiate requirements, and summarize trade-offs to researchers and sponsors</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n <li>Familiarity with probability &amp; statistics and linear algebra</li>\n <li>Knowledge of some Machine Learning methods (e.g. Random Forests, SVM’s, Linear Discriminant Analysis (LDA), Logistic Regression, etc.)</li>\n <li>Experience with some Machine Learning toolkits (e.g. SKLearn, Scipy, Numpy, Apache Big Data suite, OpenCV, etc.)</li>\n <li>Architecture Experience: cloud-based &amp; distributed, stream-based, Apache Big Data suite, open source</li>\n <li>Track record of collaboration with scientists, researchers, or other non-computer-science stakeholders</li>\n</ul>\",\"educationRequirements\":\"Bachelor's\",\"datePosted\":\"2018-02-09T08:00:00.000Z\",\"title\":\"Senior Instrument Data Software Engineer\",\"occupationalCategory\":\"Software and Computing Systems\",\"@context\":\"http://schema.org\",\"url\":\"https://experienced-jpl.icims.com/jobs/8422/senior-instrument-data-software-engineer/job\"}\n\n\n<div>\n<div>Please Enable Cookies to Continue</div>\nPlease enable cookies in your browser to experience all the personalized features of this site, including the ability to apply for a job.</div>\n\n\n\n\n<div>\n\n\n\n\n<div>\n<div>\n<div>\n\n\n<div>\n\nWelcome page\n\n</div>\n\n</div>\n</div>\n<div>\n<div>\n<div>\n<div>Returning Candidate?</div>\n<div>\nLog back in!\n</div>\n</div>\n<div></div>\n</div>\n</div>\n</div>\n\n\n\n\n<div>\n<div>\n\n\n<div>\n<li>\n<div>\n<div>\n\nSenior Instrument Data Software Engineer\n</div>\n</div>\n<div>\nRequisition ID\n\n2017-8422</div>\n<div>\n</div>\n<div>\n<div>\n\n\nJob Locations\n\n\nUS-CA-Pasadena\n\n\nCategory (Portal Searching)\n\nSoftware and Computing Systems\n\n\nDiscipline Description\n\nData Science\n\n\nCareer Level\n\nLevel 3\n\n\nScheduled Hours\n\n40\n\n\nRelocation Eligibility\n\nYes\n\n\nHiring Organization : Name\n\n398J - MACHINE LEARNING AND INSTRUMENT AUTONOMY\n\n\nMinimum Years of Experience\n\n6\n\n\nEducation\n\nBachelor's\n\n\nWork Authorization\n\nU.S. Citizen or Permanent Resident\n\n\nTravel\n\n10%\n\n\nClearance Status\n\nNone\n\n\nClearance Options\n\nNone\n\n</div>\n</div>\n</li>\n</div>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOverview\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p> </p><p></p><p> </p><p> </p><p> New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL. Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence.<br> </p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nResponsibilities\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<p> </p><p>Are you passionate about developing software systems and applications in support of science discovery, data-driven analysis and ground breaking research? Do you thrive in an environment motivated to answer challenging questions about our universe and where you can work on potential approaches and solutions to new and unusual problems?<br> <br>JPL's Machine Learning &amp; Instrument Autonomy team has an excellent opportunity for a Senior Software Engineer to bring your software development expertise and knowledge to the team of Data Scientists and Technologists in support of the research, science data processing and analysis.<br> <br>Our team is within JPL's Instrument Software and Science Data Systems Section which consists of multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems. The team is responsible for safely controlling JPL remote sensing instruments. Transforming data collected by these instruments into scientific measurements and preserving them for future analyses. Providing context and understanding to the measurements. Making the measurements and related information accessible to a broad and global user community. <br> <br>Our engineering teams build and operate high performance data processing, management and analysis systems capable of handling petabyte scale datasets to support of science discovery, research, operations and applications. They support JPL and NASA missions, as well as other science-based projects. Our research and technology development teams create new onboard and ground based technologies for data processing, analysis, modeling, reasoning, visualization, management, access and analytics that are infused into our data systems.</p><p> </p><p>The Machine Learning &amp; Instrument Autonomy Group uses Machine Learning (ML) and data-driven analysis to support science and engineering in all aspects of JPL’s mission, from efficient algorithms running on very constrained Mars rover onboard computers to server farms processing millions of astronomical observations per night. </p><p>Our goal is making explainable, confidence-estimating systems both for space-borne autonomy and to facilitate live data exploration and decision support. Your position as Senior Software Engineer includes responsibilities for refactoring / optimizing current and future numeric ML codes for tight speed, memory, and compute requirements. You will also need to lead and enforce compliance to the best software development practices including continuous integration, documentation styles, and validation test suites. You will be working with experts in novel space-supporting ML as well as hardware teams building brand-new space-borne computing infrastructures to push the frontiers of what can be done. </p><p> </p><p>This opportunity will provide a JPL career path for infusing the power of ML into science, engineering, and space missions.</p>\n\n</div>\n</div>\n</div>\n\n\n\n\n\n\n\n\n\nQualifications\n\n\n\n\n\n\n<div>\n<div>\n<div>\n<ul><li>Master's degree Computer Science or related technical discipline with typically a minimum of 4 years related experience or Bachelor's with 6 years experienc</li><li>Significant knowledge/experience with C/C++ and Python languages as well as Linux development</li><li>Demonstrated capability to optimize code for specific computational hardware (e.g. SIMD/GPU’s, PIM, multi-core, embedded, FPGA, etc.)</li><li>Exceptional modern software engineering skills on major projects such as unit testing, end to end validation, continuous integration</li><li>Emphasis on modularity, code clarity, ease of maintenance by non-developers</li><li>Advanced numeric coding experience (e.g. satellite data, real-time system monitoring, autonomous systems, data pipelines, medical imaging systems)</li><li>Lead software engineer skills (system design, continuous integration/DevOps, multi-tier testing, simplicity/readability, validation suites, Jenkins, Git pull requests, code review)</li><li>Excellent communication skills to understand user needs, negotiate requirements, and summarize trade-offs to researchers and sponsors</li></ul><p><strong>Preferred Qualifications:</strong></p><ul><li>Familiarity with probability &amp; statistics and linear algebra</li><li>Knowledge of some Machine Learning methods (e.g. Random Forests, SVM’s, Linear Discriminant Analysis (LDA), Logistic Regression, etc.)</li><li>Experience with some Machine Learning toolkits (e.g. SKLearn, Scipy, Numpy, Apache Big Data suite, OpenCV, etc.)</li><li>Architecture Experience: cloud-based &amp; distributed, stream-based, Apache Big Data suite, open source</li><li>Track record of collaboration with scientists, researchers, or other non-computer-science stakeholders</li></ul>\n\n</div>\n</div>\n</div>\n\n\n<div>\n\nOptions\n\n<div>\n\n\n\n\n<div>Apply Now!Apply</div><div>Share</div><div>Share with Colleague/FriendRefer</div>\n\n\n\n\n\n\n</div>\n<div>\n\n\n<div>Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.</div>\n\n<div></div>\n<div>Share on your newsfeed</div>\n<div></div>\n\n</div>\n</div>\n\n\n\n\n\n\n\n\nConnect With Us!\n\n<div>\n<div>\n<div>\nNot ready to apply? Connect with us for general consideration.\n\n</div>\n</div>\n</div>\n\n\n\n\n<div>\n\n\n\n<div>\n<br> <br> \n JPL is an equal employment opportunity and affirmative action employer and will, whenever possible, actively recruit and include for employment members of underrepresented minority groups, females, disabled veterans, protected veterans, and otherwise qualified persons with disabilities. JPL will hire, transfer, and promote based on the qualifications of the individual to ensure equal consideration and fair treatment of all.\n <br><br>\n JPL is a VEVRAA Federal Contractor. For more information about \"EEO is the Law\" click here: http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\n <br><br>\nThe Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available at http://oiir.hq.nasa.gov/nasaecp/\n<br><br>\n If you are interested in applying for employment with Jet Propulsion Laboratory and need special assistance or an accommodation to apply for a posted position, contact our Human Resources department at (818) 354-5150 or via email at Staffing@jpl.nasa.gov. \n <br><br>\n Written requests may be mailed to: \n Jet Propulsion Laboratory, \n Attention: Staffing and Employment Programs,\n 4800 Oak Grove Drive,\n Mail Stop T1720C,\n Pasadena, CA 91109\n </div>\n </div>\n \n \n\n</div>\n\n<div>Application FAQs</div>\n\n</div>\n<div></div>\n</div>\n\n</div>"}