{"job title": "Data Scientist", "company": "Natera", "city state": "– San Carlos, CA", "rating": "3.0", "job description": "<div>\n<div><strong>POSITION SUMMARY</strong></div><br>\n\n<div>The Data Scientist participates in the design and prototyping of cutting edge algorithms for analysis of genetic data.</div><br>\n\n<div><strong>PRIMARY RESPONSIBILITIES</strong></div>\n\n\n<ul>\n\n\t<li>Analyze next-generation sequencing data ranging from single research experiments to commercial data sets of hundreds of thousands of samples.</li>\n<li>Develop Python software infrastructure to support algorithm testing and simulation studies.</li>\n<li>Contribute to research and product development efforts in the statistics group.</li>\n<li>Produce correct conclusions based on rigorous mathematical analysis and principles of statistics and probability.</li>\n<li>This role works with PHI on a regular basis both in paper and electronic form and have an access to various technologies to access PHI (paper and electronic) in order to perform the job.</li>\n<li>Employee must complete training relating to HIPAA/PHI privacy, General Policies and Procedure Compliance training and security training as soon as possible but not later than the first 30 days of hire.</li>\n<li>Must maintain a current status on Natera training requirements.</li>\n<li>Employee must pass post offer criminal background check.</li>\n</ul>\n\n<div><strong>QUALIFICATIONS</strong></div>\n\n\n<ul>\n\n\t<li>Masters degree in engineering, applied math, statistics, or equivalent with a strong foundation in probability theory and/or statistics.</li>\n<li>At least 1 year practical experience in scientific data analysis using software such as Python.</li>\n</ul>\n\n<div><strong>KNOWLEDGE, SKILLS, AND ABILITIES</strong></div>\n\n\n<ul>\n\n\t<li>Experience in using Python in data analysis.</li>\n<li>Excellent communication skills and the desire to work in a dynamic and collaborative environment.</li>\n<li>Desire to learn about human genetics and sequencing technologies.</li>\n</ul>\n\n<div><strong>PHYSICAL DEMANDS AND WORK ENVIRONMENT</strong></div>\n\n\n<ul>\n\n\t<li>Duties are typically performed in an office setting.</li>\n<li>This position requires the ability to use a computer keyboard, communicate over the telephone and read printed material.</li>\n<li>Duties may require working outside normal working hours (evenings and weekends) at times.</li>\n</ul>\n\n<div>\n<strong>OUR OPPORTUNITY</strong>\n<br><br>\nDriven by the passion for elevating the science and utility of genetic testing, Natera is committed to helping families identify and manage genetic diseases. Natera is a rapidly-growing diagnostics company with proprietary bioinformatics and molecular technology for analyzing DNA. Our complex technology has been proven clinically and commercially in the prenatal testing space and we are actively researching its applications in the liquid biopsy space for developing products with oncology applications.</div><br>\n\n<div>\nThe Natera team consists of highly dedicated statisticians, geneticists, doctors, laboratory scientists, business professionals, software engineers and many other professionals from world-class institutions, who care deeply for our work and each other. When you join Natera, youll work hard and grow quickly. Working alongside the elite of the industry, youll be stretched and challenged, and take pride in being part of a company that is changing the landscape of genetic disease management.</div><br>\n\n<div>\n<strong>WHAT WE OFFER</strong></div><br>\n\n<div>\nCompetitive Benefits. Healthy catered lunches, Premium snacks and beverages, Onsite gym with cardio and weight-training equipment, Game room with satellite TV, Onsite dry cleaning and alteration service with pick-up and delivery, Employee-organized sport leagues, Happy hours and BBQs, Generous Employee Referral program.\n<br><br>\nFor more information, visit www.natera.com.\n<br><br>\n<strong>Natera is proud to be an Equal Opportunity Employer.</strong></div></div>\n\n<br>"}