{"job title": "Medical Lab Scientist I, Data Reviewer (Temporary)", "company": "Natera", "city state": "– Austin, TX", "rating": "3.0", "job description": "<div><strong>POSITION SUMMARY</strong></div><br>\n\n<div>The Medical Laboratory Scientist I, Data Reviewer is a member of the Operations Department to review and analyze clinical test results. This individual collaborates with a team of CLS and laboratory personnel to maintain accurate records of test results and patient information, and perform any troubleshooting as needed.</div><br>\n\n<div><strong>PRIMARY RESPONSIBILITIES</strong></div>\n\n\n<ul>\n\n\t<li>Review clinical test results of molecular genetic testing received from laboratories for accuracy and translate into LIMS.</li>\n\n<li>Review and analyze raw data files in proper software and resolve routine issues.</li>\n\n<li>Verify the proper specimen analyzed for patients and reviews the test requisition forms to verify the correct tests were performed.</li>\n\n<li>Work within several laboratory information systems to review patient demographics and make corrections as needed.</li>\n\n<li>Responsible for understanding most current applicable standard operating procedures.</li>\n\n<li>Ensures compliance with all regulatory agency requirements through documentation, audits, and corrective action and follows GLP (good laboratory practice).</li> \n\n<li>Given detailed instruction, can complete additional tasks assigned by lead, supervisor, or manager in a timely manner.</li>\n\n<li>Comply with all company and department policies and procedures. This role works with PHI on a regular basis both in paper and electronic form and have an access to various technologies to access PHI (paper and electronic) in order to perform the job</li>\n\n<li>Employee must complete training relating to HIPAA/PHI privacy, General Policies and Procedure Compliance training and security training as soon as possible but not later than the first 30 days of hire.</li>\n\n<li>Must maintain a current status on Natera training requirements.</li>\n\n<li>Employee must pass post offer criminal background check.</li>\n\n<li>Performs other duties as assigned.</li>\n</ul>\n\n<div><strong>QUALIFICATIONS</strong></div>\n\n\n<ul>\n\n\t<li>1-2-year experience as an ASCP-certified Medical Technologist in a clinical laboratory environment with knowledge in molecular diagnostics.</li>\n\n<li>Bachelor degree or equivalent in Medical Technology or a life science related field.</li>\n\n<li>Current ASCP board certification in Medical Technology or California State CLS or CGMBS license (Clinical Genetics Molecular Biologist Scientist).</li>\n</ul>\n\n<div><strong>KNOWLEDGE, SKILLS, AND ABILITIES</strong></div>\n\n\n<ul>\n\n\t<li>Good organizational skills</li>\n\n<li>Good communication skills, both written and verbal</li>\n\n<li>Proficiency in Microsoft Office Suite</li>\n\n<li>Knowledge of computer skills, quality control, calibration, and instrument maintenance</li>\n\n<li>Knowledge of various DNA sequencing methods preferred.</li>\n\n<li>The ability to produce accurate work under pressure, while handling changing volumes of work, and tight deadlines. The ability to organize time and prioritize tasks.</li>\n</ul>\n\n<div><strong>PHYSICAL DEMANDS AND WORK ENVIRONMENT</strong></div>\n\n\n<ul>\n\n\t<li>This position requires the ability to use a computer keyboard, communicate over the telephone and read printed material. Duties may require working outside normal working hours (evenings and weekends) at times.</li>\n\n<li>Duties typically performed in office setting.</li>\n\n<li>Standing or sitting for long periods of time may be necessary.</li>\n</ul>\n\n<div><strong>OUR OPPORTUNITY</strong></div><br>\n\n<div>\nDriven by the passion for elevating the science and utility of genetic testing, Natera is committed to helping families identify and manage genetic diseases. Natera is a rapidly-growing diagnostics company with proprietary bioinformatics and molecular technology for analyzing DNA. Our complex technology has been proven clinically and commercially in the prenatal testing space and we are actively researching its applications in the liquid biopsy space for developing products with oncology applications.</div><br>\n\n<div>\nThe Natera team consists of highly dedicated statisticians, geneticists, doctors, laboratory scientists, business professionals, software engineers and many other professionals from world-class institutions, who care deeply for our work and each other. When you join Natera, youll work hard and grow quickly. Working alongside the elite of the industry, youll be stretched and challenged, and take pride in being part of a company that is changing the landscape of genetic disease management.</div><br>\n\n<div>\n<strong>WHAT WE OFFER</strong></div><br>\n\n<div>\nCompetitive Benefits. Healthy catered lunches, Premium snacks and beverages, Onsite gym with cardio and weight-training equipment, Game room with satellite TV, Onsite dry cleaning and alteration service with pick-up and delivery, Employee-organized sport leagues, Happy hours and BBQs, Generous Employee Referral program.\n<br><br>\nFor more information, visit <u>www.natera.com</u>.\n<br>\n<strong>\n<br>\nNatera is proud to be an Equal Opportunity Employer.</strong></div>"}