{"job title": "Clinical Lab Scientist II (4x10) 1st, 2nd and 3rd Shifts", "company": "Natera", "city state": "– San Carlos, CA", "rating": "3.0", "job description": "<div>\n<div>\n<div>\n<div><strong>POSITION SUMMARY</strong></div><br>\n\n<div>Analyzes specimens and maintains equipment in good operating condition.</div><br>\n\n<div><strong>PRIMARY RESPONSIBILITIES</strong></div>\n\n\n<ul>\n\n\t<li>Verify the proper specimen being analyzed and perform tests that need to be completed</li>\n\n<li>Analyze clinical laboratory specimens following the standard methods and procedures in an efficient manner with little to no errors</li>\n\n<li>Responsible for maintaining updated understanding and knowledge of methods performed in the lab</li>\n\n<li>Follows GLP (good laboratory practice): maintain clean and organized work space</li>\n\n<li>Completes training and other deadlines on time.</li>\n\n<li>Go-to person when lead/supervisor is not available</li>\n\n<li>Assists lead/supervisor in training new hires and/or assists lead/supervisor in training/implementation of new process changes (as needed).</li>\n\n<li>Train on specialized instructions for instruments/protocols (super users)</li>\n\n<li>Recognizes and escalates equipment malfunctions; troubleshoots common errors</li>\n\n<li>Recognizes, documents, and escalates protocol deviations in lab to lead/supervisor</li>\n\n<li>Participates in the updating of departmental standard operating procedures and database to accurately reflect the current practices.</li>\n\n<li>Ensures compliance with all regulatory agency requirements through proper documentation</li>\n\n<li>Performs quality control procedures to ensure accuracy of clinical data (if applicable)</li>\n\n<li>Maintains equipment and instruments in good operating condition</li>\n\n<li>Communicates with team and other departments (including via e-mail)</li>\n\n<li>Provides feedback on day-to-day schedule and tasks to lead/supervisor; offers suggestions/ideas for improvement</li>\n\n<li>Assists teammates in completing daily tasks</li>\n\n<li>Conducts himself/herself in a professional manner; acts as a role model/mentor to others</li>\n\n<li>Adheres to Departmental Expectations</li>\n\n<li>This role works with PHI on a regular basis both in paper and electronic form and have an access to various technologies to access PHI (paper and electronic) in order to perform the job</li>\n\n<li>Employee must complete training relating to HIPAA/PHI privacy, General Policies and Procedure Compliance training and security training as soon as possible but not later than the first 30 days of hire.</li>\n\n<li>Must maintain a current status on Natera training requirements.</li>\n\n<li>Employee must pass post offer criminal background check.</li>\n\n<li>Performs other duties as assigned.</li>\n</ul>\n\n<div><strong>QUALIFICATIONS</strong></div>\n\n\n<ul>\n\n\t<li>2-4 years of experience as a Medical Technologist or equivalent in a clinical laboratory environment.</li>\n\n<li>BS/BA degree (or equivalent) in Medical Technology, Biological Sciences, or related field</li>\n\n<li>Current California CLS license or CGMBS license (Clinical Genetics Molecular Biology Scientist)</li>\n</ul>\n\n<div><strong>KNOWLEDGE, SKILLS, AND ABILITIES</strong></div>\n\n\n<ul>\n\n\t<li>Excellent interpersonal, communication, computer, troubleshooting, and pipetting skills.</li>\n\n<li>Experience in Molecular Biology.</li>\n\n<li>Excellent oral and written communication skills.</li>\n\n<li>Word processing and data management skills.</li>\n</ul>\n\n<div><strong>PHYSICAL DEMANDS AND WORK ENVIRONMENT</strong></div>\n\n\n<ul>\n\n\t<li>Duties typically performed in BSL-2 lab setting</li>\n\n<li>Standing or sitting for long periods of time may be necessary</li>\n\n<li>Duties may require working weekends and overtime</li>\n</ul>\n\n<div><strong>OUR OPPORTUNITY</strong>\n<br><br>\nDriven by the passion for elevating the science and utility of genetic testing, Natera is committed to helping families identify and manage genetic diseases. Natera is a rapidly-growing diagnostics company with proprietary bioinformatics and molecular technology for analyzing DNA. Our complex technology has been proven clinically and commercially in the prenatal testing space and we are actively researching its applications in the liquid biopsy space for developing products with oncology applications.</div><br>\n\n<div>\nThe Natera team consists of highly dedicated statisticians, geneticists, doctors, laboratory scientists, business professionals, software engineers and many other professionals from world-class institutions, who care deeply for our work and each other. When you join Natera, youll work hard and grow quickly. Working alongside the elite of the industry, youll be stretched and challenged, and take pride in being part of a company that is changing the landscape of genetic disease management.</div><br>\n\n<div>\n<strong>WHAT WE OFFER</strong></div><br>\n\n<div>\nCompetitive Benefits. Healthy catered lunches, Premium snacks and beverages, Onsite gym with cardio and weight-training equipment, Game room with satellite TV, Onsite dry cleaning and alteration service with pick-up and delivery, Employee-organized sport leagues, Happy hours and BBQs, Generous Employee Referral program.\n<br><br>\nFor more information, visit <u>www.natera.com</u>.\n<br>\n<strong>\n<br>\nNatera is proud to be an Equal Opportunity Employer.</strong></div></div>\n</div>\n</div>\n<br>"}