{"job title": "Computer Scientist, AST, Data Analysis", "company": "National Aeronautics and Space Administration", "city state": "– Moffett Field, California", "rating": "4.4", "job description": "<div><div><div>id=\"main-content\" role=\"main\" aria-label=\"Main Job announcement content\"&gt;\n <div>\n <ul>\n <li>\n \n Videos\n \n </li>\n </ul>\n </div>\n <div>\n <ul>\n <li>\n \n Duties\n \n <div>\n \n Help\n \n Duties\n Summary\n <div>\n <p>The Advanced Computing Branch at NASA Ames Research Center is currently seeking interested applicants for the position of Computer Scientist. This position serves as the focal point of the User Services Team specifying objectives and ensuring compliance of contracts supporting the High-End Computing (HEC) control room, HEC User Accounts, and Tool Development and support.</p>\n \n Learn more about this agency\n \n </div>\n Responsibilities\n <div>\n <p>\n The computer scientist serves as the focal point of the User Services Group working with staff to provide and monitor a large and complex mix of HEC assets and provide the level-1 support to over 1,000 users located throughout the world. The computer scientist is responsible for developing tasks and implementing an effective and efficient operation, and develops plans for operation improvements.<br><br>The computer scientist provides status changes to the computing environments and determines improvements. Conducts detailed analyses of complex functions and work processes. <br><br>The scientist develops task(s) to implement the NAS accounting system, managing user allocations and tracking usage throughout the year. The scientist is responsible for generating monthly reports for each of the Mission Directorate's usage by project. Works with directorate and project personnel to handle over and/or under-utilization. <br><br>The scientist develops task(s) to generate tools that aide in the accounting or user services functions ensuring compliance with all NASA software development processes.<br><br>The scientist works with the Agency and NASA Center for Climate Simulation (NCCS) to provide a seamless environment between the two High End Computer Centers in NASA. Works with the cross-center team to develop processes, procedures, tools and reports that provides Headquarters oversight of activities between the centers.<br>\n </p>\n </div>\n\n <div>\n Travel Required\n <p>Occasional travel - Travel may be required for training or other work-related duties</p>\n </div>\n <div>\n <div>\n \n \n Supervisory status\n \n \n <p>\n No\n </p> </div>\n <div>\n \n \n Promotion Potential\n \n  <p>\n 13\n </p> </div>\n </div>\n </div>\n </li>\n <li>\n <div>\n Job family (Series)\n <p>\n \n 1550 Computer Science\n \n </p>\n </div>\n </li>\n <li>\n \n Requirements\n \n <div>\n \n Help\n \n Requirements\n Conditions of Employment\n <ul>\n <li>A one-year probationary period may be required</li>\n <li>Position subject to pre-employment background investigation</li>\n <li>As identical vacancies are identified, additional selections may be made.</li>\n <li>This position can be filled at the GS-11 or GS-12 grade level; the full performance level of the position is at the GS-13 grade level. Selectee can be promoted without further competition.</li>\n </ul>\n <div>\n Qualifications\n\n <div>\n Applicant must have one year of specialized experience equivalent to the next lower grade, which has equipped the applicant with the particular competencies needed to successfully perform the duties of the position described above.<br><br>In addition to the basic education requirements, applicants must possess one of the following:<br><br>To qualify at the GS-11 level:<br><br>One year of specialized experience is defined as professional experience equivalent to GS-09 grade level as experience in supporting computer systems and operations for high performance computers OR computational services to analyze and evaluate computing environments <br><br>OR<br><br>Completed all requirements for a doctoral degree (i.e., Ph.D. or equivalent) in an appropriate field <br><br>OR <br><br>Completion of 3 full academic years of graduate education in an appropriate field <br><br>OR<br><br>Have an equivalent combination of experience and graduate education as discussed above.<br><br>To qualify at the GS-12 level:<br><br>One year of specialized experience is defined as experience in applying analytical and evaluating methods to conduct the analyses of complex computer systems such as: high performance computers, computer operations, computational services to effectively support the management of user services functions and program operations.<br><br>\n </div>\n </div>\n\n <div>\n Education\n <p>\n <b> In order to qualify for this position you must meet Basic Education Requirement </b><br><br>Applicants must have successfully completed an undergraduate or graduate degree with a major in either a) engineering from a college or university that has ABET accredited engineering programs or b) Physical Science, Mathematics, Life Science, Computer Science, Other fields of science.<br><br>Degrees in engineering technology are not considered to be qualifying for this position.<br><br>The accreditation, type of degree, and course work taken will determine if the basic education requirements are met.<br><br>The degree must have been received in the year of, or any year subsequent to the original date of accreditation. To find out if a school has an ABET accreditation, go to ABET accredited schools<br><br>Applicants must list their majors on their resume.<br><br>ABET or Foreign accreditation requirement applies to foreign education. Applicants who have completed part or all of their education outside the U.S. must have their foreign education evaluated by an accredited organization to ensure that the foreign education is comparable to the education received in accredited educational institutions in the U.S. If selected, a written evaluation translated in English of any foreign education must be completed and provided to the Human Resources official making the offer. Please indicate in your resume that you have had your foreign education formally evaluated by the closing date of the announcement. Failure to provide this evaluation may result in your being found unqualified for the position.<br><br>Applicants must complete the following fields in USAJOBS Resume Builder, Step 2. Education section in order for education qualifications to be considered for this position:<br><br>-College/University Name<br>-State/Territory/Province/Country<br>-City/Town<br>-Degree/Level Attained<br>-Completion date<br>-Major<br>-Minor<br>-GPA<br><br>\n </p>\n </div>\n\n\n <div>\n Additional information\n <div>\n <p>Any applicant tentatively selected for this position may be required to undergo a pre-employment background investigation. Individuals who have special priority selection rights under the Agency Career Transition Assistance Program (CTAP) or the Interagency Career Transition Assistance Program (ICTAP) must be well qualified for the position to receive consideration for special priority selection. See 'How You Will Be Evaluated' for definition of well qualified. Federal employees seeking CTAP/ICTAP consideration must indicate their eligibility when applying for a position. The USAJOBS resume asks you to identify your ICTAP eligibility; the NASA Supplemental Information asks you to identify your CTAP eligibility. If you are selected for the position, you must be prepared to submit proof that you meet the requirements for CTAP/ICTAP. This includes a copy of the agency notice, a copy of their most recent Performance Rating and a copy of their most recent SF-50 noting current position, grade level, and duty location.<br><br>As a condition of employment, male applicants born after December 31, 1959, must certify that they have registered with the Selective Service System, or are exempt from having to do so under the Selective Service Law. In order to receive preference in hiring, you must clearly identify your claim for veterans preference on your resume.<br><br>NASA's Applicant Guide provides the information needed to assist you in determining whether or not you can claim 5 or 10 point veterans preference. You should not submit documents to prove your eligibility for veterans preference at this time. However, you must be prepared to submit proof of veterans preference (DD-214, and, if claiming 10-point preference, SF-15 plus proof required by that form) as requested by the Human Resources Office. Veterans preference will only be considered based on what is supported For instance, if you claim 10-point preference, but are only able to document 5-point preference, you will be considered accordingly. If you fail to provide the required documents within the stated time period, we may withdraw a job offer and/or remove you from further consideration.<br><br>Your USAJOBS account asks you to assign a name to each of your resumes. When you apply to a NASA position, we will show you the text of the resume you have submitted, but we do not maintain the name you have assigned to that resume. If you wish to keep track of that information, we recommend you make note of it at the time you apply.<br><br> <br>Fair Employment Opportunities for Applicants<br>NASA Credit for National Service<br><br>Current Federal employees must meet three months after competitive appointment restrictions by the closing date of the announcement.<br><br>Identification of promotion potential in this position does not constitute a commitment or an obligation on the part of management to promote the employee. Promotion will depend upon administrative approval and the continuing need for an actual assignment and performance of higher level duties.<br><br>The payment of relocation expenses is not authorized.<br></p>\n </div>\n Read more\n </div>\n\n <div>\n How You Will Be Evaluated\n <div>\n <p>You will be evaluated for this job based on how well you meet the qualifications above.</p>\n <p>\n NASA uses an automated system (Resumix) that matches the competencies extracted from your resume to the competencies identified by the selecting official for the position. Based on the competencies you match, you are placed in one of three categories identified as 90, 80, or 70 pt. quality categories, which are defined as:<br><br><u>90 pt. Category</u> - Tentatively meets (until subsequent confirmation upon referral) the basic qualification requirements identified in the vacancy announcement and has experience in the same or similar job that has demonstrated superior proficiency in the primary requirements of the position.<br><br><u>80 pt. Category</u> - Tentatively meets (until subsequent confirmation upon referral) the basic qualification requirements identified in the vacancy announcement and demonstrates satisfactory proficiency in the primary requirements of the position.<br><br><u>70 pt. Category</u> - Fails to meet criteria described in the 80 pt. category.<br><br>Additional application guidance is available in NASA's Applicant Guide.<br><br><u>Information for Veterans</u>: The Category Rating Process protects the rights of veterans by placing them ahead of non-preference eligibles within each category. Preference eligibles who meet qualification requirements and have a compensable service-connected disability of at least 10 percent must be listed at the top of the highest quality category, except when the position being filled is scientific or professional at the GS-09 grade level or higher.<br><br>For the purpose of the Career Transition Assistance Program (CTAP) and the Interagency Career Transition Assistance Program (ICTAP), candidates rated in the top quality category are considered well-qualified.<br><br>If you are eligible for a special program such as individual with a disability, former Peace Corps employee, returning Peace Corps or AmeriCorps VISTA Volunteer, 30% or more Disable Veterans or Veterans' Recruitment Appointment, you may apply to this announcement under the hiring authority that you are eligible for. To receive consideration under the appropriate hiring authority, you will need to check mark the appropriate category under the 'Options' tab when completing the application process. <br><br>If you are found qualified, your resume will be forwarded to the hiring manager. <br><br>For more information please visit:<br>Schedule A Hiring Authority- https://www.opm.gov/disability/PeopleWithDisabilities.asp OR http://nasajobs.nasa.gov/generalinfo/nssc.htm.<br><br>Peace Corps or AmeriCorps VISTA Volunteer- http://www.peacecorps.gov/nce <br><br>Veterans' Recruitment Appointment and 30% or more Disabled Veteran- https://www.fedshirevets.gov/job/shav/index.aspx OR https://applyonline.nasa.gov/veterans.jsp<br><br>To receive consideration, you must submit a resume and answer NASA-specific questions. The NASA questions appear after you submit your resume and are transferred to the NASA web site. If you successfully apply, USAJOBS will show your application status as 'Received'. If your status is 'Application Status Not Available', you have not successfully applied. Do not rely on a USAJOBS email to confirm successful application. Only an email from NASA confirms a successful application.\n </p>\n <p></p>\n </div>Read more\n\n <div>\n Background checks and security clearance\n <div>\n <div>\n Security clearance\n <p>\n \n Public Trust - Background Investigation\n \n </p>\n </div>\n\n <div>\n Drug test required\n <p>\n No\n </p>\n </div>\n </div>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Required Documents\n \n <div>\n \n Help\n \n Required Documents\n <div>\n <p>\n NASA's application process has been specifically developed to ensure that we only ask you for the information we absolutely need to evaluate your qualifications and eligibility. In order to apply for this position, you only need to submit your resume and answer the screening questions and supplemental information. No additional documentation is accepted at the time of application. (For example you need not submit narrative 'KSA' statements; they are not required and will not be evaluated.) In this way we allow you to focus on preparing a resume that best describes your background and abilities. For assistance in preparing your resume, consult the Applicant Guide. Nothing further is required until requested by the Human Resources Office. At that point, we may ask you to submit documentation to support statements made in your resume. For example, we may ask you to provide academic transcripts or proof of Federal employment status. If you are claiming veterans' preference, we may ask you to submit proof of veterans preference (DD-214, and, if claiming 10-point preference, SF-15 plus proof required by that form). If you fail to provide the required documents within the stated time period, we may withdraw a job offer and/or remove you from further consideration.\n </p>\n <div>\n \n If you are relying on your education to meet qualification requirements:\n \n <p>\n Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from\n schools accredited by accrediting institutions recognized by the U.S. Department of Education.\n </p>\n <p>\n Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n </p>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Benefits\n \n <div>\n \n Help\n \n Benefits\n <div>\n <p>\n A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Learn more about federal benefits.\n </p>\n <p></p>\n <p>\n Review our benefits\n </p>\n <div>\n <p>Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered.</p>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n How to Apply\n \n <div>\n \n Help\n \n How to Apply\n <div>\n <p>This vacancy is being filled through NASA STARS, an automated Staffing and Recruitment System. NASA partners with USAJOBS in providing a seamless application process. Before you begin the application process, please read the vacancy announcement carefully and have all required information available. You may begin the process of submitting your resume by clicking on the 'Apply Online' link. In order to be considered, you must submit a resume completed on the USAJOBS site. When completing your USAJOBS resume, please remember that NASA limits resumes to approximately 32,000 characters including spaces. NASA does not accept resumes uploaded to USAJOBS from a second source or documents attached through USAJOBS' document attachment feature. Once you submit your resume to NASA, you will be asked to complete a short series of additional questions. You must finish the entire process in order to have a complete application package and receive consideration. Your answers will not be saved unless you finish the entire application. You may edit a previously-submitted application, if the announcement is still open. If you are unable to apply electronically for this position, submit your resume and supplemental questions to:<br><br>National Aeronautics and Space Administration (NASA)<br>4200 Rideout Road<br>Resume Operations Center/Mailstop: HS50<br>Marshall Space Flight Center, AL 35812<br><br>DO NOT submit your resume directly to the Center advertising this vacancy. Mailed resumes must be received by the close of business on the closing date of the announcement. Hard copy resumes requirements are provided at: Hard Copy Resume Requirements. If you are a first time applicant, we recommend that you review NASA's Applicant Guide to ensure that you are providing a complete resume. Failure to submit the supplemental data and a resume that contains all of the required information may result in loss of consideration for positions in which you are interested. All applications must be received no later than midnight Eastern Time on the closing date of the announcement.</p>\n </div>\n Read more\n <div>\n Agency contact information\n \n \n Ames Jobs\n \n\n <div>\n <div>\n Phone\n <p>\n \n </p>\n\n\n Email\n <p>\n \n ARC-amesjobs@mail.nasa.gov\n \n </p>\n </div>\n <div>\n Address\n <p>\n </p>\n NASA's Resume Operations Center<br>\n 4200 Rideout Road, Mailstop HS50<br>\n Marshall Space Flight Center,\n AL \n 35812<br>\n US\n \n </div>\n </div>\n \n Learn more about this agency\n \n </div>\n\n Next steps\n <div>\n <p>\n Candidates for NASA positions are evaluated using our automated staffing and recruitment system, NASA STARS, which compares your skills and experience as described in your resume with the requirements of the position. If you are found to be a highly qualified candidate, you will be referred to the selecting official for further consideration. (In some cases, individuals with priority for special consideration must be considered and selected before other candidates.) Whether or not you are contacted for an interview depends upon the location of the position and the judgment of the selecting official. At NASA, we pride ourselves on efficient and timely recruitment actions, and you can normally expect to learn the outcome of the selection process in a fairly short period of time. In addition, to ensure that you can measure progress for yourself, NASA provides you with regularly updated information on the status of the vacancy announcement.\n </p>\n </div>Read more\n </div>\n </li>\n <li>\n \n Fair &amp; Transparent\n \n <div>\n Fair &amp; Transparent\n <p>\n The Fede</p></div></li></ul></div></div></div></div>"}