{"job title": "Data Scientist", "company": "National Debt Relief", "city state": "– New York, NY, United States", "rating": "4.1", "job description": "<strong>Who We're Looking For:</strong><br><br>We are seeking an innovative and passionate Data Scientist to join our growing team to help promote our analytical culture, while leveraging data to maximize marketing performance and deliver a best-in-class experience for the clients we serve.\n<br><br>\nThe ideal candidate will apply analytical rigor and data driven reasoning to guide the development and execution of marketing strategies and experiential initiatives across the organization. This individual will bring a sense of curiosity to seek out opportunities for improvement through internally and externally sourced data. This person will play a critical role in providing thought leadership, building statistical models to understand consumer behavior and intent, and identifying optimization opportunities across programs.<br><br>This is an opportunity to grow with a diverse team and have a measurable impact on a rapidly growing organization. It is a great fit for an entrepreneurial professional with a strong background in statistical modeling and a passion for translating data into actionable insight.\n<br><br>\nMeet some of our team members<strong>Principle Duties and Responsibilities:</strong>\n\n<ul>\n<li>Develop and implement advanced statistical models to guide business strategy and deliver incremental growth and value throughout the company.</li><li>Perform analysis of structured and unstructured data to solve complex business problems.</li> <li>Use statistical techniques to build marketing segments, evaluate scenarios, predict future outcomes, and optimize performance.</li> <li>Lead complex research and analytics projects across teams.</li><li>Research, test, and validate new modeling techniques as appropriate for specific solutions.</li><li>Present and depict recommendations so that stakeholders can make data-informed decisions.</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>5+ years of experience as a data scientist conducting data mining and building and implementing complex models in a fast-paced, marketing-driven environment.</li><li>Experience working with large internal and external data sets covering new and existing client programs to include direct mail, TV, radio, search engine marketing and email preferred.</li><li>Undergraduate degree in a quantitative discipline (i.e. Statistics, Mathematics, Computer Science or equivalent quantitative discipline), advanced degree is preferred.</li><li>Expert knowledge of SAS, R/Python and SQL or similar industry standard tools use for large-scale data analysis and modeling.</li><li>Experience linking multiple data platforms with data visualization tools is a plus.</li><li>In-depth knowledge and experience in data mining and statistical modeling techniques (regression, decision tree, time series, etc. Knowledge of optimization theory and statistical model application are also preferred.</li><li>Strong analytical and problem-solving skills with the ability to interpret large amounts of data with business insight to support growth.</li><li>Strong consultative acumen with responsibility for analytical project design, management, and presentation of results to internal and external stakeholders.</li><li>Ability to clearly present statistical solutions to non-statistical people, articulating value and insights to the business.</li><li>Strong project management skills with a proven ability to set clear goals and design detailed plan against tight timelines. Evidence of self-motivated initiatives, high productivity, and good team work is desired.</li>\n</ul>\n<strong>What We Offer:</strong>\n<br><br>\nWe believe in a team-first culture, full of rewards and recognition for our employees. We are dedicated to our employees success and growth within the company, through our employee mentorship and leadership programs.\n<br><br>\nOur extensive benefits package includes:\n<ul>\n<li>Medical, Dental, and Vision Benefits</li><li>401(k) Match</li><li>Paid Holidays, Sick Days, and Vacation</li><li>6 Weeks Paid Parental Leave</li><li>Pre-tax Transit Benefits</li><li>Discounted Gym Membership</li><li>No-cost Life Insurance Benefits</li>\n</ul>\n<strong>About National Debt Relief:</strong>\n<br><br>\nNational Debt Relief is one of the countrys largest and most reputable debt settlement companies. We are made up of energetic, smart, and compassionate individuals who are passionate about helping thousands of Americans with debt relief. Most importantly, were all about helping our customers through a tough financial time in their lives with education and individual customer service.\n<br><br>\nWe are dedicated to helping individuals and families rid their lives of burdensome debt. We specialize in debt settlement and have negotiated settlements for thousands of creditor and collections accounts. We provide our clients with both our expertise and our proven results. This means helping consumers in their time of hardship to get out of debt with the least possible cost. It can also mean conducting financial consultations, educating the consumer, and recommending the appropriate solution. Our core services offer debt settlement as an alternative to bankruptcy, credit counseling, and debt consolidation. We become our clients' number one advocate to help them reestablish financial stability as quickly as possible.\n<br><br>\nSee what Glassdoor has to say about working at National Debt Relief!\n<br><br>\n<em>National Debt Relief is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, or any other status protected by law.</em>\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}