{"job title": "Senior Data Analyst", "company": "Native Instruments", "city state": "– Los Angeles", "rating": "3.1", "job description": "<div><div><div><div></div>\n\t</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\nYou’ll work across the organization to generate the data and analysis needed to make the best decisions as we grow and innovate. You’ll be responsible for pushing the business forward on all fronts, based on insights derived from your deep understanding of our business. You’ll have exposure to our top executives with the opportunity to learn from their deep experience in music and technology as well as the opportunity to impact their decision making at a critical time as we scale the business.</div>\n </div>\n </div>\n </div>\n </div>\n </div><br>\n\n<div>\n<div>\n<div>\n<div>\n<div>\n<strong> WHAT YOU'LL DO</strong><br>\n\n<div>\n\n<ul>\n<li>Turn ambiguous questions from business partners into clear analytical problems, and solve them using data</li>\n<li>Use internal and external analytics tools, such as Heap and Google analytics, SQL, and scripting languages to access and analyze multivariate data and share data stories that make sense to business and technical audiences</li>\n<li>Create readable and informative data visualizations to communicate data insights to business stakeholders</li>\n<li>Use data to identify strategic opportunities to improve Native Instruments’ products and operations</li>\n<li>Work closely with cross-functional teams in Product, Finance, Sales and Marketing to translate findings into actions and Data Infrastructure team on defining and building central infrastructure</li>\n<li>Continuously learn and develop skills while working with our cutting-edge team of analysts and engineers</li>\n<li>Respond to ad-hoc reporting needs while ensuring data accuracy and integrity</li>\n<li>Constantly thinking of ways to improve our products and the business</li></ul></div>\n</div>\n </div>\n </div>\n </div>\n </div><br>\n\n<div>\n<div>\n<div>\n<div>\n<div>\n<strong> WHAT YOU'LL BRING</strong><br>\n\n<div>\n\n<ul>\n<li>2+ years in a data-intensive role (High growth, technology, strategy consulting, business intelligence, investment banking/private equity background)</li>\n<li>Bachelor’s degree in physics, math, statistics, psychology, data science, computer science (or equivalent training &amp; experience)</li>\n<li>Proficiency with SQL, Excel, and R or Python</li>\n<li>Strong team player who can work well across multiple cross-functional teams, including, finance, growth, product, engineering, and data teams</li>\n<li>Focus on scale - develop tooling to automate commonly requested analyses</li>\n<li>Practical experience in extracting data from various sources (e.g. REST APIs, NoSQL databases, CSV files) and preparing the data for an efficient analysis</li>\n<li>Familiar with e-commerce, online retail, music streaming, SaaS, or subscription platforms</li>\n<li>Effective communication skills: you can build the story and then tell it just as well</li>\n<li>Familiarity with Agile methodologies</li>\n<li>You have a passion for music</li></ul></div>\n</div>\n </div>\n </div>\n </div>\n </div><br>\n\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\nNative Instruments</div></div></div></div></div></div>"}