{"job title": "Data Engineer", "company": "National Oilwell Varco", "city state": "– US Texas Houston", "rating": "3.4", "job description": "<div><strong>Responsibilities include, but are not limited to the following:</strong></div><div>\n\n\n<ul>\n<li>Implement best practices for data engineering</li>\n<li>Develop processes and documentation</li>\n<li>Extract and prepare data for analysis</li>\n<li>Develop and revise model code</li>\n<li>Understand data path from source to destination</li>\n<li>Troubleshoot connectivity and data integrity issues</li>\n<li>Prepare and manage infrastructure (servers, databases etc.) for data storage</li>\n<li>Coordinate with NOV software engineers, product engineers, data scientists and other data users to define and configure DataVault tag lists</li>\n<li>Prepare reliability-centered equipment maintenance templates, including tag lists and analytical models, for deployment to rigs</li>\n<li>Coordinate efforts with field engineers and NOV cross-functional teams to ensure that rigs have the proper hardware, software, and network to collect data</li>\n<li>Develop code for automating data processing pipelines</li>\n<li>Perform other work-related tasks as required</li></ul></div>\n<br>#ZR\n<br><br>\nA minimum education of Bachelor's in Computer Science, Engineering, or related field is required.\n<br><br>\nA minimum of 2 years of experience specifically in Data Engineering is preferred.\n<br><br>\nEntry-level candidates with internships in Data Engineering are encouraged to apply.\n<br><br>\nExperience with programming language is highly preferred (ex: Python, R, Batch Scripting, Java, STEP7)\n<br><br>\nExperience with data processing is required (ex: Hadoop, Cassandra, Spark)\n<br><br>\nExcellent written and verbal communication skills\n<br><br>\nExperience in the following areas preferred:\n<br><br>\no Reading control systems documentation\n<br><br>\no Data acquisition\n<br><br>\no Data integrity\n<br><br>\no Data management: OSIsoft PI System (strongly preferred), Microsoft SQL, MongoDB\n<br><br>\no Revision management: Git, Stash\n<br><br>\no Data science platform: Domino\n<br><br>\no Data visualization: Grafana, TIBCO Spotfire, Microsoft Power BI\n<br><br>\no Server network installation, configuration, and troubleshooting\n<br><br>\nDrilling data analysis experience preferred\n<br><br>\nCandidates must be highly self-motivated and work well as part of a fast-paced, collaborative team"}