{"job title": "Data Engineer", "company": "National Renewable Energy Lab", "city state": "– Golden, CO", "rating": "3.4", "job description": "Posting TitleData Engineer .\n<br><br>\nLocationCO - Golden .\n<br><br>\nPosition TypeRegular .\n<br><br>\nHours Per Week40 .\n<br><br>\nJob Summary Design and execute state-of-the-art data systems for input data for various energy models, including electric grid operations and capacity expansion and transportation and fuels modeling. Design, implement, and document data workflows. Ensure quality of both data and archival records. Perform complex operations on large datasets, especially resource data time series. Work in a dynamic, cross-disciplinary team using cutting-edge analysis and visualization techniques. Create new capabilities to analyze scenarios and design solutions for complex challenges in sustainable energy development to solve real world energy system design problems. The successful candidate will help to develop data architecture, quality control systems, datasets, and archival systems, especially for time series resource data inputs to electric grid operations models. Duties will include: Integrating multiple data sources, models, and software tools with scientific and engineering workflows for decision support and data analysis. These workflows will include the use of distributed computing and utilization of both cloud and high-performance parallel computing (HPC) resources. Developing new methods to help researchers, clients, and stakeholders analyze and evaluate design strategies to implement sustainable energy solutions at various geographic and temporal scales. Modeling complex systems by integrating large spatio-temporal datasets of economic, demographic and energy related information. Creating visualization interfaces that enable real-time examination of design scenarios as desktop, immersive, and web frameworks to allow for design processes by stakeholders around the world. Evaluating and communicating results through written research reports for publication and presentation at seminars, participating in group meetings and seminars, and assisting in developing grant proposals for new research directions. The ideal candidate will bring a deep background in data analysis and programming skills to integrate various models and tools to solve complex design problems. The candidate will demonstrate experience in defining project requirements that balance constraints from the users, available hardware, software, framework complexity, etc. The candidate must be willing to work in an interdisciplinary field, together with computer scientists, policy analysts, and engineers, and will require excellent interpersonal and communication skills. Other required skills include: Highly proficient and extensive experience with time series resource data analysis and modeling techniques; demonstrated experience in management of large datasets, especially spatio-temporal data Strong scientific programming and algorithm development skills and demonstrated use of Python Other required programming languages: SQL, NoSQL, PostgreSQL, R for statistical analysis Demonstrated ability to produce scientific visualizations This position is in NREL’s Strategic Energy Analysis Center. See http://www.nrel.gov/analysis&nbsp;for more general information about our work and impact on the energy sector both domestically and internationally. .\n<br><br>\nRequired Education, Experience, and SkillsRelevant Master's Degree. Or, relevant Bachelor's Degree and 2 or more years of experience. General knowledge and application of scientific technical standards, principles, theories, concepts and techniques. Training in team, task or project leadership responsibilities. Intermediate abilities and knowledge of practices and techniques. Beginning experience in project management. Good technical writing, interpersonal and communication skills. .\n<br><br>\nPreferred Qualifications . Submission Guidelines Please note that in order to be considered an applicant for any position at NREL you must submit an application form for each position for which you believe you are qualified. Applications are not kept on file for future positions. Please include a cover letter and resume with each position application. .\n<br><br>\nEEO Policy NREL is dedicated to the principles of equal employment opportunity. NREL promotes a work environment that does not discriminate against workers or job applicants and prohibits unlawful discrimination on the basis of race, color, religion, sex, national origin, disability, age, marital status, ancestry, actual or perceived sexual orientation, or veteran status, including special disabled veterans. NREL validates right to work using E-Verify. NREL will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee’s Form I-9 to confirm work authorization. For additional information, click here.\n<br><br>"}