{"job title": "Digital Communications Data Analyst", "company": "National Association of Manufacturers", "city state": "– Washington, DC", "rating": "3.4", "job description": "<div><strong>Who We Are:</strong>\n<br><br>\nNAM Strategic Communications is a nationally recognized team that knows how to break through the noise and drive a message. We are savvy digital strategists and experienced spokespeople who leverage cutting-edge tactics to drive news in support of manufacturers’ agenda. Publications such as PR Week, PR News and Bulldog Reporter have hailed our innovative campaigns and top talent as the gold standard in communications and advocacy.\n<br><br>\n<strong>Your Role:</strong>\n<br><br>\nThe NAM is committed to building innovative digital content platforms as we expand our advocacy efforts and role as a leading trade association. How we use our digital presence to engage an array of audiences is critical to the organization’s success. We are looking for a Digital Communications Data Analyst to oversee, translate and make recommendations based on the company’s many sources of data relevant to our digital communications efforts.\n<br><br>\nThe Digital Communications Data Analyst is an experienced, entrepreneurial statistician who will oversee the effective setup and ongoing use of analytics systems to spot trends, document patterns and solve problems on behalf of the communications team. This role includes oversight of digital performance metrics, including site, social media, email and app analytics, in addition to key performance indicators organization-wide (such as membership conversion and growth rate) and how datasets intersect. The ideal candidate will have a background in digital analytics and business analysis, a strong track record of analyzing complex datasets to help organizations grow, and experience at an online media organization. This position reports to the Digital Managing Editor.\n<br><br>\n<strong>Make an impact in the following ways:</strong>\n\n<ul>\n\n\t<li>Oversee setup and performance of analytics systems to generate actionable insights reports and related recommendations</li>\n<li>Monitor, compile and analyze data from multiple sources, including, but not limited to, site performance analytics, SEO keyword research/trends, industry trends, social listening, email metrics, CRM metrics, competitive research/metrics and business KPIs</li>\n<li>Package information into readable, visually appealing dashboards</li>\n<li>Develop engaging, layman’s-terms presentations to report findings across the organization</li>\n<li>Provide audience growth, optimization and targeting recommendations to the digital team</li>\n<li>Help establish growth benchmarks and KPIs and lead the curation of analytics and insights reports on editorial content and audience growth</li>\n<li>Work with the media relations team to supplement the NAM’s rapid response operations</li>\n<li>Ensure that best practices are applied to achieve standards of quality, efficiency and overall alignment of data</li>\n</ul>\n<strong>Your Qualifications:</strong>\n\n<ul>\n\n\t<li>Deep expertise in developing analytics reporting and data synthesis for a complex organization</li>\n<li>Passionate, curious self-starter who pursues thorough data analysis to spot new content-related and business opportunities</li>\n<li>Comfortable talking to all levels of an organization and explaining data (and business choices/options) in layman’s terms</li>\n<li>Track record of working with internal partners from different departments to serve business objectives and provide consultative services</li>\n<li>High attention to detail; someone who triple-checks work and is confident in the end analysis</li>\n<li>Demonstrated success in driving audience growth through recommended optimizations/tests (in particular, website traffic, social media engagement and database growth)</li>\n<li>Demonstrated ability to deliver insights and recommendations based off complex datasets</li>\n<li>A proven track record of thriving in a changing work environment and adapting to new challenges/opportunities</li>\n<li>Interest in modern business issues impacting manufacturing and the industry overall</li>\n<li>Excellent verbal and written communications skills</li>\n</ul>\n<strong>Technical Skills:</strong>\n\n<ul>\n\n\t<li>Demonstrated cross-platform digital analytics knowledge, especially pertaining to website, social media and email</li>\n<li>Must have strong knowledge of statistical analysis</li>\n<li>Must have experience working within content management systems and CRM systems</li>\n<li>Must be open to learning and working within new software/platforms and encourage team members to be as well</li>\n</ul>\n<strong>Education and Experience:</strong>\n\n<ul>\n\n\t<li>B.S./B.A. degree in communications, journalism, mathematics, business administration or a related field preferred</li>\n<li>Four to six years managing data analytics</li>\n<li>Advanced experience with Excel, Google Analytics/Omniture and native and aggregated social analytics platforms, including Sprout Social and Simply Measured</li>\n<li>Experience working with CRM systems, including Salesforce, to interpret data</li>\n<li>Experience working with content management systems, including Drupal</li>\n</ul>\n<strong>Location:</strong>\n<br><br>\nWashington, D.C.</div>\n\n<br>"}