{"job title": "Specialist, Data Science", "company": "Nationwide", "city state": "– Columbus, OH", "rating": "3.6", "job description": "If youre passionate about becoming a Nationwide associate and believe you have the potential to be something great, lets talk.\n<br><br>\nNumber 54 on the Fortune Magazine 100 Best Places to Work.\n<br><br>\nJOB SUMMARY: Participates in all phases of analytic lifecycle. Analyzes trends and patterns in structured and unstructured data in support of business problem solving. Identifies and communicates meaningful insights and provides input to the project team. Will help align findings and insights to deliver business appropriate recommendations. May lead small projects. Committed to learning, development, skill maintenance, and personal improvement.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nRELATIONSHIP: Reports to Director/Manager\n<br><br>\n<strong>JOB RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Responsible for creating, packaging, and communicating analytic work (synthesis) using appropriate medium for relevant insights, including impactful story line and applicable data visualizations.</li>\n<li>Responsible for effectively synthesizing own project work</li>\n<li>Participates in the delivery of analytic work that supports business objectives and priorities.</li>\n<li>Plans and manages execution of own work, participates in planning, and delivers on commitments</li>\n<li>Applies appropriate quantitative techniques and methods to solve business problems.</li>\n<li>Responsible for building analytic applications using statistical, database, and/or general programming languages and tools.</li>\n<li>Performs other duties as assigned.</li>\n</ul>\n\n<strong>JOB REQUIREMENTS:</strong>\n<br><br>\nEducation: Undergraduate studies with post graduate studies preferred.\n<br><br>\nLicenses/Designations: N/A\n<br><br>\nExperience: Typically 3 or more years related experience with SAS, SPSS and other statistical software. Experience with problem solving in a business environment; working with large customer and/or prospect databases; working with product, geographic, demographic data to identify trends and opportunities.\n<br><br>\nKnowledge: Experience with financial services or related industry. Consulting experience, knowledgeable and experienced with the core functions of an organization (call center, billing, finance, sales, marketing, product, pricing, etc), experience with process design and mapping and continuous improvement.\n<br><br>\nSkills/Competencies: Possesses core statistics skills including an understanding of probability and its application to the analysis of data. Able to evaluate sources of variation and identify influential factors/features. Experienced with statistical process control, process monitoring and diagnostics. Modeling and Machine Learning: Experienced with advanced mathematical modeling techniques including both supervised and unsupervised learning algorithms. Proven experience building practical solutions using predictive modeling. Demonstrated knowledge of and experience with design of experiments. Ability to understand business systems (processes) and the data produced by them (how did the data get produced and is it a valid representation of the outcome being studied). Demonstrated experience structuring and solving complex business problems. Ability to translate analytic findings into actionable communications. Ability to communicate effectively in a variety of mediums with any audience. Capable of developing compelling stories and distinctive data visualizations Working knowledge of statistical software including R, SAS, SPSS, MatLab, etc. as well as Teradata, Oracle, DB2, SQL Server, Netezza, etc. Understands data structures operational vs analytical data structures, normalization, etc. and SQL Assistant, WinSQL, and Toad, etc. Knowledge of general purpose programming languages (Python, Java, C++, etc)including domain specific languages, static and dynamic languages, application design and development, test driven development, and agile practices.\n<br><br>\nValues: Regularly and consistently demonstrates the Nationwide Values and Guiding Behaviors.\n<br><br>\nStaffing Exceptions to the above minimum job requirements must be approved by the: VP and HR VP.\n<br><br>\n<strong>JOB CONDITIONS:</strong>\n<br><br>\nOvertime Eligibility: Not Eligible (Exempt)\n<br><br>\nWorking Conditions: Normal office environment. Extended and non-standard work hours based on project and customer deliverables.\n<br><br>\nADA: The above statements cover what are generally believed to be principal and essential functions of this job. Specific circumstances may allow or require some people assigned to the job to perform a somewhat different combination of duties.\n<br><br>\nJob Evaluation Activity: 11/2012 CB, PYC\n<br><br>\nAdditional Job Description\n<br><br>\nNationwide is seeking a passionate individual for the role of Specialist, Data Science, to join the Customer Insights &amp; Analytics (CI&amp;A) Predictive Analytics team as a modeler. Qualified candidates will possess an extensive knowledge of statistics and/or a proven track record of its use in real-world problem-solving. A familiarity with the principles of machine learning, applied predictive modeling, Bayesian modeling, and time series forecasting methods is preferred, and an advanced degree in Statistics or a related field is required and/or relevant experience. Subject matter expertise in areas like customer growth and retention and marketing analytics/optimization are desired.\n<br><br>\nThe candidate must be willing to work with business professionals who are not statisticians, and thus the ability to communicate highly technical material in a friendly, non-threatening manner is essential. The candidate must demonstrate a desire to create business value over all else even when the competitor is statistical elegance. Conversely, the candidate must show continual improvement of theoretical and applied skills with evidence of a desire to continue technical learning and growth both as a statistician and a business professional.\n<br><br>\nRoutine tasks for this position include building models and forecasts within Nationwide's \"Model Factory\" environment, an enterprise-class model building and deployment framework that allows rapid deployment of predictive models directly into business operations. This person will help to improve the Model Factory and its associated processes including, but not limited to, evaluation of the models in the field, refitting/retraining of existing models, and assisting with ongoing team peer education. Ad-hoc business analyses will occasionally be required, as will contributions to custom analytic software (e.g., model evaluation/selection/diagnostic techniques, design of experiment support, sampling designs, visualizations, and simulations).\n<br><br>\nExperience with R and/or Python (or a comparable statistical programming language such as SAS, SPSS, or MATLAB) and SQL, as well as familiarity with the principles of software engineering (e.g., object-oriented programming, test-driven development, usage of revision control software, etc.) is strongly desired for this position.\n\n\n<ul>\n<li>marketing</li>\n</ul>\n\n#marketing\n<br><br>\nJob ID: 54190\n<br><br>\n<strong>#</strong>"}