{"job title": "Data Scientist", "company": "Natron Energy", "city state": "– Santa Clara, CA", "rating": "5.0", "job description": "Natron seeks a data scientist to lead and assist projects for the development of data management, analysis, and visualization tools for data sets generated from designed experiments, containing electrochemical and physical data of battery materials, components, cells, modules and packs. The person in this position will work in a small team of engineers that is responsible for the collection, management, analysis, and distribution of all of the battery test data Natron generates. This person will lead the development and maintenance of existing data-analysis codebases (python, MATLAB, etc.) and database systems (SQL). They will apply statistical tools to build predictive models, which will inform battery design, production, and quality. Qualified candidates have prior industrial or significant prior academic experience writing, implementing, and maintaining robust, scaleable code systems, as well as initial set up, configuration, and maintenance of database software and hardware. Candidates should be comfortable performing infrequent, hands-on lab work related to battery testing. The person for this position has a positive attitude, collaborates well, and does what it takes to get the job done. He or she is on a mission to build a company and a product to be proud of.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n- Analyze battery test data and generate compiled data reports using existing automated MATLAB analysis tools.\n<br><br>\n- Create new analysis tools to study complex cell degradation mechanisms.\n<br><br>\n- Develop models of battery cell behavior to predict key performance metrics.\n<br><br>\n- Apply principles of electrochemical theory and statistical analysis to develop new test protocols for high volume device testing.\n<br><br>\n- Craft compelling visualizations to communicate the results of the data analysis work.\n<br><br>\n- Maintain and expand SQL database.\n<br><br>\n-Develop new SQL database interfacing tools for use by the entire engineering team.\n<br><br>\n<strong>Experience and Skills:</strong>\n<br><br>\n- Prior industrial or significant prior academic experience developing data analysis and visualization tools, as well as the hardware and software infrastructure to host, store, and organize the data.\n<br><br>\n- Strong foundation of programming fundamentals—style practices, design patterns, data structures.\n<br><br>\n- Fluent in python, with experience using packages like numpy, pandas, scikit-learn, matplotlib.\n<br><br>\n- Fluent in MATLAB, SQL, and version control tools.\n<br><br>\n- Training in statistics relevant to product development and/or manufacturing.\n<br><br>\n- Experience applying machine learning algorithms to build predictive models.\n<br><br>\n- Working knowledge of electrical circuits and/or energy storage devices such batteries preferred.\n<br><br>\n- Skills using interactive visualization tools like D3.js or Bokeh are a plus.\n<br><br>\n- Organized, thorough and has a critical eye for identifying problems.\n<br><br>\n- Effective communicator and comfortable speaking up.\n<br><br>\n- Has a do-whatever-it-takes attitude, thrives in a fast-paced start up environment and can deliver project deliverables on time.\n<br><br>\n- A bachelor’s degree or higher in a science or engineering field.\n<br><br>\n<strong>Logistics:</strong>\n<br><br>\n- Compensation: competitive with other data science positions at pre-revenue Bay Area start up companies\n<br><br>\n- Duration: permanent.\n<br><br>\n- Hours: full time."}