{"job title": "Data Scientist", "company": "Nauto", "city state": "– Palo Alto, CA", "rating": "3.6", "job description": "<div>NAUTO is an autonomous car startup on a mission to make better drivers out of us all and cities safer and more efficient. We're looking for engineering and business professionals who love to design, build and scale real-time distributed systems to join our growing team in Palo Alto.</div> <br>\n<div>Merging artificial intelligence with computer vision, NAUTOs systems detect and react to whats happening on the road ahead of a driver and within the vehicle. NAUTO algorithms sense when there is an issue on the road ahead, or a distraction within the vehicle, and helps the driver respond. NAUTO also automatically understands when a collision is about to happen, and records the scene inside and outside of the car. Then images and data about the incident are stored in the cloud, and can be shared via NAUTOs app and fleet management tools.</div> <div>NAUTO is selling to automobile OEMs, insurance providers and commercial fleets. Its systems are running on several classes of high-volume commercial vehicles. Investors in our recent A-round included Andy Rubins Playground Global, Draper Nexus and strategics such as BMW, Toyota, and Germanys largest insurer, Allianz.</div> <div>Long-term NAUTO will continue to partner with auto manufacturers to evolve its systems from an on-board safety AI into a platform that becomes the brain controlling autonomous vehicles.</div> Responsibilities:\n\n<ul>\n<li>We are looking for an exceptional and versatile data scientist to join our insurance and risk vertical. Since this role synthesizes R &amp; D work with client facing efforts, you must be comfortable working hand in hand with client insurers, including their technical and actuarial teams.</li><li>Build predictive risk models based on continuous timestamped data generated by Nauto's telematics devices installed around the world. This is an end to end effort, including data collection and cleaning, modeling and validation, and finally collaborating with engineering teams to implement models in production.</li><li>Conduct ad hoc exploratory analysis of data to validate and tune risk model inputs.</li><li>Provide data visualization and analysis to support our insurance customers.</li><li>Occasionally join customer phone calls and meetings to share you expertise with insurance customers.</li>\n</ul>\n\nExperience and Skills\n\n<ul>\n<li>2+ experience working in an analytics or data science role, or equivalent</li><li>Graduate degree in a quantitative field (mathematics, physics, economics, etc) or equivalent deep experience in data science. Ph.D. is a plus</li><li>Robust proficiency in probability, statistics, and machine learning</li><li>Proficiency with statistical packages in R or Python</li><li>Proficiency with a scripting language such as Python</li><li>Moderate proficiency with using SQL and APIs to retrieve data</li><li>Though not necessary, two or more years of business experience is a plus. Any non-technical experience is extremely valuable when working directly with clients</li>\n</ul>\n\n<strong>Perks</strong>\n\n<ul>\n<li>Ground floor opportunity with the team; shape the strategic direction of the company</li><li>The rare opportunity to change the world such that everyone around you is using the product you built to get around safely. Were not just another app, were moving real people and goods and helping to reinvent transportation and logistics</li><li>Beautiful modern work space. Many perks including cafe with meals, snacks and drinks provided</li><li>Sharp, motivated co-workers in a fun office environment</li>\n</ul>\n\n<br>"}