{"job title": "Data Scientist", "company": "Navitas Business Consulting", "city state": "– Herndon, VA", "rating": "5.0", "job description": "<div><div><div><strong><strong>Job Title:</strong></strong> Data Scientist<strong><strong>Job Type:</strong></strong> C2C/W2/1099<strong>Position ID:</strong> NAV01612<strong><strong>Post Date:</strong></strong> 08/30/2018<strong>Location :</strong> Herndon, VA<strong><strong>Skills :</strong></strong> Python,R,JAVA</div></div>\n<br>\n<div><div>Roles &amp; Responsibilities\n\n<ul>\nNavitas is hiring “Data Scientist/ Modeler” for multiple levels ranging from 2 yrs to 12 yrs of experience at multiple locations. (Washington DC, Herndon, VA, Sterling, VA, Springfield, VA)\n<br><br>\n\"U.S. Citizen only for Federal Clearance Requirement\"\n<br><br>\n<strong>Clearance Preference: (one of the below):</strong>\n\n\n<ul>\n<li>DHS CBP BI Clearance</li>\n<li>DHS BI Clearance</li>\n<li>Top Secret Clearance</li>\n</ul>\n\nExperience Preferred (one of the below)\n\n\n<ul>\n<li>CBP</li>\n<li>DHS</li>\n<li>Any Government Agency</li>\n</ul>\n\nEducation (One of the below)\n\n\n<ul>\n<li>Master s</li>\n<li>Bachelor s</li>\n</ul>\n\nJob Duties and Responsibilities \n<br><br>\nWe are seeking highly-qualified data scientists to lead the development and delivery of advanced, machine learning and predictive modelling solutions. Individuals experienced with large, structured and unstructured datasets are needed to transform, analyze, and model data for more effective decision support. Many analytical approaches are needed to support current and future work, including: data mining, clustering analysis, pattern recognition and extraction, automated classification and categorization, and entity resolution. These and many other techniques will be needed to implement risk-based targeting models of national security concern.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Lead projects with hands-on analysis and modeling, leveraging data analysis and analytical techniques and methods to solve complex business problems.</li>\n<li>Perform problem domain definition, including data identification and analysis.</li>\n<li>Extract, aggregate, manipulate, categorize, clean, and transform data associated within an identified problem space for use in predictive modeling.</li>\n<li>Perform exploratory data analysis and feature generation</li>\n<li>Identify patterns and/or anomalies in large datasets</li>\n<li>Perform automated text/data classification and categorization as well as entity recognition, resolution and extraction.</li>\n<li>Develop algorithms; train, evaluate, and deploy predictive analytics models using machine learning methods.</li>\n</ul>\n\n<strong>Key Qualifications:</strong>\n\n\n<ul>\n<li>Significant experience in developing machine learning models and applying advanced analytics solutions to solve complex business problems</li>\n<li>Proficiency in software such as: SAS Enterprise Miner, SPSS Modeler, or equivalent. </li>\n<li>Experience with SAS, R, Python, Java, and SQL languages; or similar.</li>\n</ul>\n\n<strong>Education:</strong>\n\n\n<ul>\n<li>Bachelor’s Degree (required), Master’s or Ph.D. degree (preferred) in operations research, industrial engineering, mathematics, statistics, computer science/engineering, and other related technical fields or equivalent practical experience.</li>\n</ul>\n\n<strong>Additional Desired Skills and Experience:</strong>\n\n\n<ul>\n<li>Structured data sets and databases, experience with DML, DDL, PL/SQL, XML, JSON, etc.</li>\n<li>Experience working in a team and deploying solutions in an iterative or agile software development environment is a plus</li>\n<li>Experience with behavioral analytics and risk assessment practices within national security, law enforcement, regulatory, or transportation contexts is a plus.</li></ul></ul></div>\n\n\n</div></div>"}