{"job title": "Data Scientist (TS/SCI with Polygraph)", "company": "Navstar", "city state": "– McLean, VA", "rating": "4.3", "job description": "<div><div><strong>\n<br>\nData Scientist (TS/SCI with Polygraph)</strong><br>\n\n<div>\n<div>\nLocation\n<br><br>\n<strong>\n<br>\nMcLean, VA</strong>\n</div><br>\n\n<div>\nRequired Clearance Level\n<br><br>\n<strong>\n<br>\nTS/SCI with Polygraph</strong>\n</div>\n</div>\n</div>\n\n<br>Apply Now</div><br>\n\n<div><strong>Job Summary:</strong>\n<br><br>\nWould you like to perform rewarding work while contributing to the success of an established, growing company? Navstar is an award-winning organization that has a proven track record of successfully providing IT services and solutions both as a prime and sub-contractor on mission focused IT programs. Our employees are integral players in support of mission-critical programs focused on our National Security.\n<br><br>\n<strong>Role Responsibilities:</strong>\n<br><br>\nDetermine and employ the most appropriate research design for data collection and analysis. Acquire, process, and refine large and complex data sets from various sources; utilizing computer programming where necessary. Analyze, evaluate, and assess quantitative data to contribute to or develop software tools, analytic models or reports. Conduct statistical, mathematical, geospatial modeling or data-mining analysis in partnership with other Data Scientists or Analysts. Anticipate or project possible outcomes using scenario/alternative analysis, machine learning, and other advanced analytic techniques. Identify, use and/or develop a wide range of methodologies and analytic tools to address existing or potential problems and strategies.\n<br><br>\n<strong>Required Skills:</strong>\n\n<ul>\n<li>Demonstrated on the job experience manipulating data for analysis.</li> \n\n<li>Demonstrated on the job experience constructing complex queries to analyze results using databases or data processing development environments.</li> \n\n<li>Demonstrated on the job experience aggregating results and/or compiling information for reporting.</li> \n\n<li>Demonstrated on the job experience as an all source analyst.</li> \n\n<li>Demonstrated on the job experience reviewing highly technical data from various sources.</li>\n\n<li>Working knowledge of appropriate analytic methods and methodological tools in one or more of the following areas: Applied mathematics (probability and statistics, formal modeling, computational social sciences), Computer programming (programming languages, math/statistic packages, computer science, machine learning, scientific computing), Visualization (GIS/ geospatial analysis).</li> \n\n<li>Ability to leverage multiple data management tools to organize relevant information and make decisions.</li> \n\n<li>Ability to develop comprehensive software applications, as needed.</li> \n\n<li>Ability to translate complex, technical findings into an easily understood narrative in graphical, verbal or written form.</li> \n\n<li>Ability to identify gaps and offer technical solutions based on both technical and non-technical descriptions of customer workflows and requirements.</li>\n\n<li>To be eligible for this role you must hold an active TS/SCI with Polygraph.</li>\n</ul>\n<strong>Desired Skills:</strong>\n\n<ul>\n<li>Demonstrated on the job experience with software development.</li> \n\n<li>Demonstrated on the job experience developing and documenting custom algorithms in response to customer requirements.</li> \n\n<li>Demonstrated on the job experience with SQL, R, Python</li>\n</ul>\n\n</div>\n<br>"}