{"job title": "Data Scientist", "company": "Navtech, LLC", "city state": "– Dallas, TX", "rating": "NA", "job description": "Position: Data Scientist\n<br><br>\nLocation: Dallas, TX\n<br><br>\nDuration: 6+ Months\n<br><br>\nRequired Technical Skills:\n<ul>\n<li>5‐10 years of platform software development experience</li><li>3‐5 years of experience with, understanding and knowledge of the Hadoop ecosystem and building analytic jobs in MapReduce, Pig, Hive, etc.</li><li>5 years of experience in SAS, R, Perl, Python, Java, or other languages appropriate for large scale analysis of numerical and textual data</li><li>Experience developing static and interactive data visualizations.</li><li>Strong knowledge of technical design and architecture principles.</li><li>Creating large scale data processing systems.</li><li>Driving design and code review process.</li><li>Ability to develop and program databases, query databases and perform statistical analysis.</li><li>Working with large scale warehouse and databases, sound knowledge of tuning and query processing.</li><li>Excellent understanding of entire development process, including specification, documentation, quality assurance, debugging practices and source control systems.</li><li>Ability to understand business issues as they impact the software development project.</li><li>Solves complex, critical problems related to significant and unique issues.</li><li>Ability to delve into large data sets to identify useful trends in business and develop methods to leverage that knowledge.</li><li>Strong skills in predictive analytics, conceptual modeling, planning, statistics, visualization capabilities, identification of best data sources, hypothesis testing and data analysis.</li><li>Familiar with disciplines such as natural language processing (the interactions between computers and humans) and machine learning (using computers to improve as well as develop algorithms).</li></ul>\n\n\n<ul>\n<li>provided by Dice</li>\n</ul>\n\nData Scientist,Hadoop,MapReduce,SAS,Perl,Python,Java"}