{"job title": "NBCUniversal Summer 2019 Data Science Internship", "company": "NBC Universal", "city state": "– New York, NY", "rating": "3.8", "job description": "<strong>Responsibilities</strong>\n<br><br>\nUnlike a traditional internship, the Data Science Practica (Internship) embeds future Data Scientists and Data Engineers in ongoing projects within NBCUniversal. Future Data Scientists and Engineers become active members of existing teams developing data science projects, acquiring specific responsibilities, goals and timelines which are interdependent with the goals and timelines of the teams they are embedded in. Upon completing the Practicum, future Data Scientists and Engineers will have gained experience in real-world projects on a typical data science environment, using state of the art data science tools, and broad exposure to the media industry.\n<br><br>\nQualifications/Requirements\n<br><br>\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>In pursuit of a Master's or PhD in Data Science, Computer Science, Operations Research, Statistics, Mathematics, Economics or other relevant quantitative fields</li>\n<li>Working knowledge of at least two programming languages. Examples: R, Python, Julia, Java, or Scala</li>\n<li>Cumulative GPA of 3.0 or above</li>\n<li>Must be 18 years of age or older</li>\n<li>Must be authorized to work in the United States without visa sponsorship by NBCUniversal</li>\n<li>Needs to be able to work on-site in New York, NY</li>\n<li>Internships at NBCUniversal are paid and do not require course credit</li>\n<li>Deadline: Interested applicants are encouraged to apply by February 15th, 2019</li>\n<li>Summer Program Dates: June 3rd August 9th, 2019</li>\n</ul>\n\nDesired Characteristics\n<br><br>\n<strong>Preferred Qualifications Requirements:</strong>\n\n\n<ul>\n<li>Prior experience with ML and/or statistical modelling</li>\n<li>Advanced working knowledge of statistics and its applications for inferential data analysis</li>\n<li>Familiarity with Spark, Hive and/or Hadoop</li>\n<li>Experience with data visualization techniques and concepts</li>\n</ul>"}