{"job title": "Fandango-Big Data Engineer", "company": "NBCUniversal", "city state": "– Beverly Hills, California", "rating": "3.8", "job description": "<strong>Job Title</strong>\n<br>\nFandango-Big Data Engineer\n<br><br>\n15-Nov-2018\n<br><br>\n<strong>Business Segment</strong>\n<br>\nFilmed Entertainment Group\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Work with business owners and development teams to define, develop and support data-driven applications and product prototypes.</li><li>Gather data insights related to user behavior, product usage, audience segmentation, social media, quality of services, and media consumption to drive business decisions.</li><li>Working with predictive analysts and data scientists, build scalable prototypes of machine learning algorithms, build production quality codes, manage and maintain the code base.</li><li>Work with product management and internal stakeholders to help dictate the requirements and technical design of Fandango data services and related intelligence tools.</li><li>Develop BI applications including transactional systems, mobile application development of BI products/services including Android, iOS, and/or cross platform.</li> <li>Contribute to every phase of the BI product development life cycle (design, development, testing, iteration, deployment, support and maintenance).</li><li>Other duties as assigned.</li>\n</ul>\n\n<strong>Job Number</strong>\n<br>\n<strong>43045BR</strong>\n<br><br>\n<strong>Posting Category</strong>\n<br>\nDigital Media\n<br><br>\n<strong>Country</strong>\n<br>\nUnited States\n<br><br>\n<strong>Sub-Business</strong>\n<br>\nFilm Fandango\n<br><br>\n<strong>About Us</strong>\n<br>\nAt Fandango, we love movies. From showtimes and ticketing, to engaging content and innovations in movie going- we strive to deliver the perfect movie going experience—anytime, anywhere. And to be the go-to destination for moviegoers, we think it’s all about collaboration. Anyone can build a website or app, but it takes a special group across many disciplines to create an experience that can live across multiple platforms and connected devices. Thanks to an exceptional team, we’re working hard to make Fandango a little bit better every day. Our 30 million (and growing!) online and mobile monthly visitors can now buy movie tickets at over 25,000 screens nationwide and stay for exclusive trailers, our award-winning original video series, movie reviews, celebrity interviews and more. So, if you’re looking to inspire, be inspired and work at the intersection of entertainment and technology look no further than Fandango. Visit Fandango.com/careers for a behind-the-scenes look at Fandango and follow us on LinkedIn for the latest news and updates. Fandango is an NBCUniversal Company.\n<br><br>\n<strong>State/Province</strong>\n<br>\nCalifornia\n<br><br>\n<strong>Career Level</strong>\n<br>\nExperienced\n<br><br>\n<strong>Qualifications/Requirements</strong>\n<br>\nMaster's degree in CS, MIS, Statistics, Machine Learning, Applied Mathematics, Data Mining or a related field.\n<br>\n1+ years of overall professional experience. Proven track record working on distributed, scalable, service-oriented platforms. Proven ability to deliver high quality, production ready code.\n<br>\nHands-on experience with Hadoop eco-systems (Hive, Pig, Spark, etc.).\n<br>\nHands-on experience in developing complex Talend ETL processes for integration between systems enterprise application and business analytics (Big Data / Hadoop) using Talend tools.\n<br>\nHands-on experience in programming languages Python, Java, Scala, etc.\n<br>\nExperience in data extraction, data-driven statistical modeling, analysis and supervised learning using modeling languages such as R, Stata, MATLAB, etc.\n<br>\nExperience in using Cloud services such as Amazon Web Services, Microsoft, IBM and Google Cloud.\n<br>\nExperience with Machine Learning/Deep Learning APIs, frameworks, and AI tools.\n<br>\nExperience with BI reporting tools (Tableau, MicroStrategy, SAP BusinessObjects, SSRS, etc.).\n<br>\nExpert understanding of the agile software development life cycle.\n<br>\nExcellent knowledge and expertise with SQL and Relational/Multi-dimensional Databases.\n<br>\nUnderstanding of data warehousing concepts.\n<br>\nStrong customer service and communication skills (verbal and written) to effectively interact with a diverse team of people across business and engineering.\n<br>\nMust maintain regular and acceptable attendance at such level as is determined at the company’s sole discretion.\n<br>\nMust be available and willing to work extended hours (during crunch times!) per day including occasional weekends and holidays.\n<br><br>\n<strong>Desired Characteristics</strong>\n<br>\nWillingness to dig into technical concepts/details.\n<br>\nProactive to improve products and business processes.\n<br>\nAWS certifications.\n<br>\nNaturally inquisitive and self-learner.\n<br>\nA team player.\n<br>\nStay on top of the latest innovations in data and technologies.\n<br><br>\n<strong>City</strong>\n<br>\nBeverly Hills\n<br><br>\n<strong>Notices</strong>\n<br>\nNBCUniversal’s policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable.\n<br>"}