{"job title": "Senior Marketing Data Scientist", "company": "NCSOFT", "city state": "– San Mateo, CA", "rating": "2.8", "job description": "NCSOFT's mobile publishing team is looking for a Senior Marketing Data Scientist to drive insights for our marketing and user acquisition groups. This person should feel comfortable working with all types of data, both big and small. This role will build attribution models, optimize user acquisition channels, build predictive models to guide our marketing team and help our publishing team visualize the marketing/acquisition data.\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n\n<ul>\n<li>Build standardized models for LTV, attribution and retention</li>\n<li>Define experiments to test your hypotheses</li>\n<li>Implement predictive models that allow us to move quicker for user acquisition</li>\n<li>Assist User Acquisition Managers and Product Marketing Managers by visualizing marketing data and providing recommendations for strategy</li>\n<li>Build tools and data pipelines to enable the studio to make more data-driven decisions</li>\n</ul>\n<strong>REQUIREMENTS:</strong>\n\n<ul>\n<li>Bachelor's degree in quantitative field such as mathematics, statistics, economics, physics, etc.</li>\n<li>3-5 years of experience as a Data Scientist or similar</li>\n<li>Strong SQL programming skills</li>\n<li>Proficient scripting with at least one data processing/statistical language (eg. R, Python, MATLAB)</li>\n<li>Knowledge of statistical techniques and concepts (eg. regression, properties of distributions, statistical tests and proper usage, etc.)</li>\n<li>Experience with machine learning</li>\n<li>Familiarity with Hadoop tech stack (using Hive or Pig, Spark)</li>\n<li>Experience building predictive user acquisition and marketing models</li>\n<li>Strong communication skills</li>\n<li>Strong product-focused problem solving ability</li>\n</ul>\n<strong>PLUSES:</strong>\n\n<ul>\n<li>Master's degree or above</li>\n<li>Gaming experience</li>\n<li>Experience with data visualization tools (eg. Tableau) or coding (Shiny, D3.js, plotly.js)</li>\n</ul>"}