{"job title": "Data Scientist", "company": "Neiman Marcus", "city state": "– United States-Texas-DALLAS", "rating": "3.2", "job description": "<div><b>COMPANY OVERVIEW</b></div>\n<div>For over a century, Neiman Marcus Group has served the unique needs of our discerning customers by staying true to the principles of our founders: to be the premier omni-channel retailer of luxury and fashion merchandise dedicated to providing superior service and a distinctive shopping experience in our stores and on our websites. Neiman Marcus Group is comprised of the Specialty Retail Stores division, which includes Neiman Marcus and Bergdorf Goodman, and our international brand, mytheresa.com. Our portfolio of brands offers the finest luxury and fashion apparel, accessories, jewelry, beauty, and home décor. The Company operates more than 40 Neiman Marcus full-line stores in the most affluent markets across the United States, including U.S. gateway cities that draw an international clientele. In addition, we operate 2 Bergdorf Goodman stores in landmark locations on Fifth Avenue in New York City. We also operate more than 40 Last Call by Neiman Marcus off-price stores that cater to a value oriented, yet fashion minded customer. Our upscale eCommerce and direct-to-consumer division includes NeimanMarcus.com, BergdorfGoodman.com Horchow.com, LastCall.com, and CUSP.com. Every day each of our 15,000 NMG associates works towards the goal of enabling our customer to shop any of our brands \"anytime, anywhere, and on any device.\" Whether the merchandise we sell, the customer service we offer, or our investments in technology, everything we do is to enhance the customer experience across all channels and brands.</div>\n<div> </div>\n<div> </div>\n<div> </div>\n<div>\n<div><b>\n<div><b>Job Summary</b><b> </b></div>\n<div>Neiman Marcus Group has an immediate opening for a Data Scientist reporting to a Senior Data Scientist of Advanced Analytics. This position supports the advanced analytics team in providing insights into customer behavior to enable decision making relating to promotions, events and marketing programs for all brands both in stores and online.</div>\n<div> </div>\n<div><b>Job Duties</b></div>\n<ul>\n<li>Support advanced analytics team in exploiting data in an effort to promote growth and business development via data processing in a hadoop environment</li>\n<li>Leverage state-of-the-art data processing tools and/or analytical methodologies to drive improved decisions</li>\n<li>Support the team in development and/or implement various types of predictive models, segmentation strategies, optimization algorithms, and data mining analyses with a targeted result of increasing revenue</li>\n<li>Conduct multi-channel analytics for online and integrated online/offline contexts</li></ul>\n<div> </div>\n<div><b>Job Requirements</b></div>\n<ul>\n<li>Experience in processing and performing multi-faceted analysis with customer/consumer behavior data </li>\n<li>Experience in developing or enhancing machine learning and artificial intelligence algorithms using Python, R, C , Java, Matlab</li>\n<li>Experience in working with distributed computing i.e. Hive SQL, Pig, Java Map/Reduce, Apache Spark</li>\n<li>Experience in SAS</li>\n<li>Knowledge of descriptive analytics and data visualization</li>\n<li>Exceptional standards for quality and strong attention to detail</li>\n<li>Experience with full lifecycle agile application development in supporting analytic requirement</li>\n<li>Ability to manage multiple projects and on-demand business requests simultaneously</li></ul></b></div></div>"}