{"job title": "Data Scientist", "company": "Nestle", "city state": "– Stamford, CT", "rating": "3.8", "job description": "Job Number 18005498\n<br><br>\nCompany Nestle Waters North America\n<br><br>\nLocation Stamford, Connecticut\n<br><br>\nWe are currently seeking a Data Scientist to be located in our headquarters based in Stamford, CT, reporting to the Director, Data and Insights.\n<br><br>\nAs ReadyRefresh works to transform and modernize our unique business, you will have the exciting opportunity to help design and develop the systems that we use to deploy data science solutions at scale. You will be joining our growing data and insights team to help drive business decisions. We are not just looking for someone to build ETL pipelines or a static dataset, but rather someone who will help us build the future of data and insights within a mature business. The ideal candidate will know how to understand our business model with the lens of data engineering and work to enable the business utilizing data.\n<br><br>\nKey responsibilities for this position include but are not limited to:\n\n\n<ul>\n<li>Build analytics \"products\", analysis and models to enhance how we do business across all functions including Pricing, Operations and Marketing. Validate output and track benefits throughout the course of the initiative. Train key people to execute the analysis for ongoing improvements.</li>\n<li>Partner with Marketing, Operations and Acquisition teams to find new insights in ReadyRefresh's data, and build solutions that have a direct impact on our customers and your colleagues.</li>\n<li>Communicate your findings with technical and non-technical audiences to figure out how to apply them and uncover more questions.</li>\n<li>Expertise in setting up experiments (A-B Testing etc.) - Shared responsibility for creating, maintaining and enhancing the experiments that will help validate predictions and initiatives. (Example - price change for particular segments. What is the holistic impact of the change and should we move forward with it?)</li>\n<li>Iterate rapidly and get experience on many start-to-finish projects</li>\n<li>Acquire a deep understanding of the demand drivers at select customers and ensure that the models are calibrated as needed</li>\n</ul>\n\nKey measurements for this position include but are not limited to:\n\n\n<ul>\n<li>Accuracy of models by tracking predictions vs. actual patterns and making appropriate model revisions</li>\n<li>Utilize and analyze key category, marketing and customer information as inputs to the statistical models</li>\n<li>Share best practices in order to improve output for the entire team</li>\n<li>New metrics and KPIs are established</li>\n</ul>\n\n<strong>#LI-NK1</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nKey qualifications for this position include but are not limited to:\n\n\n<ul>\n<li>Bachelor's degree with an emphasis on computer or information science, applied mathematics, physics or other technical focus</li>\n<li>Minimal to 15% travel required</li>\n<li>Excellent in data representation, computer architecture and organization</li>\n<li>Strong coding skills using Python and SQL, including standard data libraries such as pandas, SQL Alchemy etc.</li>\n<li>Needed experience with big data tools such as Hadoop, Hive, Spark, etc</li>\n<li>A good academic foundation in math, CS, OR, stats, engineering, physics, or similar analytical field. Masters preferred.</li>\n<li>3+ years related experience preferably in modeling/mining large data sets using open source technologies and languages, such as Python or R. Use statistics and machine learning as a tool to solve critical business problems</li>\n<li>Strong coding skills using both object oriented languages and SQL. Knowledge of standard data libraries such as Pandas, Tidyverse, scikit-learn, statsmodels, etc.</li>\n<li>Have deep knowledge of how to design experiments under different business conditions</li>\n<li>Exceptional analytical and problem solving skills with attention to detail, accuracy and completeness.</li>\n<li>Team-oriented approach to work.</li>\n<li>Excellent written and oral communication skills.</li>\n<li>Ability to self-manage and to make one's own decisions.</li>\n<li>Detail-oriented with excellent time management skills</li>\n</ul>\n\nThe Nestlé Companies are equal employment and affirmative action employers and looking for diversity in qualified candidates for employment."}