{"job title": "Leave of Absence Data Analyst", "company": "Nestle", "city state": "– Solon, OH", "rating": "3.7", "job description": "Job Number 18008085\n<br><br>\nCompany Nestle USA\n<br><br>\nLocation Solon, Ohio\n<br><br>\nFoods people love. The life you imagined. And the city that rocks.\n<br><br>\nWhen you partner Nestlé USA and the city of Cleveland, the result is a rich experience that offers you a fulfilling personal and professional life.\n<br><br>\nDid you know that the Cleveland metropolitan area was ranked as one of the most affordable cities in the US by Forbes Magazine? From its diverse communities to its endless arts, entertainment and sports experiences, Cleveland continues to rock.\n<br><br>\nAt our Nestlé USA Cleveland campus, located in the Solon suburb of Cleveland, you will discover the ways that Nestlé USA values and supports our employees and community. Offering you a strong culture with competitive benefits, you will have limitless opportunities to learn, and advance your career. Giving back continues to be a part of the Nestlé tradition. As the world's leading nutrition, health and wellness company, our focus is not only about nourishing our customers, it's about enriching you.\n<br><br>\nPOSITION SUMMARY:The primary responsibility of this position is to operate as the subject matter expert (SME) over the reporting and analysis process related to Leave Management through the Kronos Leave Module, Leave of Absence (LOA) Tool, SAP, and any other added leave management systems. The position provides regularly scheduled reporting and analysis findings on LOA metrics and ways to identify efficiencies and process improvements, as well as application of process improvements to current processes. This position will also manage a small caseload of leaves and LOA administration tasks as a backup to other LOA analysts.\n<br><br>\n<strong>PRIMARY RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Develop scheduled and adhoc reports and queries based on leadership, legal, HR, and</li>\n</ul>\n\nother internal stakeholder requests\n\n\n<ul>\n<li>Develop strong analytical processes that create efficiencies, process improvements, cost</li>\n</ul>\n\nsavings, and waste elimination\n\n\n<ul>\n<li>Identify compliance gaps through robust audit processes</li>\n<li>Resolve and document system-related issues reported by leave management team</li>\n</ul>\n\nmembers\n\n\n<ul>\n<li>Resolve issues from error reports and develop processes to reduce future errors</li>\n<li>Develop and deliver ongoing system training to leave management team members</li>\n<li>Lead and manage LOA team projects; duties include, but are not limited to, project</li>\n</ul>\n\nplanning, discovery, task creation and assignment, timeline management, system testing,\n<br><br>\nand implementation\n\n\n<ul>\n<li>Provide metric dashboards to leadership team members to share with business units</li>\n<li>Manage leave of absence case load of approximately 100 leave cases</li>\n<li>Fully participates in continuous improvement (NCE) and is responsible for driving</li>\n</ul>\n\nimprovements through NCE activities and initiatives.\n\n\n<ul>\n<li>Performs all other duties as assigned</li>\n</ul>\n\n<strong>SUPERVISION RECEIVED:</strong>\n<br><br>\nMinimal\n<br><br>\n<strong>SUPERVISION GIVEN:</strong>\n<br><br>\nNone\n<br><br>\n<strong>FINANCIAL/STRATEGIC IMPACT:</strong>\n<br><br>\nAssists the business in maintaining compliance with all federal, state, and local leave laws, as well as discovering and implementing efficiencies through system analysis and reporting.\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n<strong>REQUIREMENTS AND MINIMUM EDUCATION LEVEL:</strong>\n\n\n<ul>\n<li>High School diploma required, Bachelor's degree preferred, specifically in Business, HRIS,</li>\n</ul>\n\nHuman Resources, or related field\n\n\n<ul>\n<li>Strong HRIS systems understanding &amp; technical aptitude; expert level ability in Microsoft</li>\n</ul>\n\nExcel (i.e. vlookups, pivot tables, and other types of formatting/formulas) and proficient in\n<br><br>\nall other Microsoft Office applications\n<br><br>\n<strong>EXPERIENCE:</strong>\n\n\n<ul>\n<li>2+ years of experience in HR or Benefits data management, or related position; experience</li>\n</ul>\n\nmust include HR system administration, preferably within SAP or similar system preferred\n\n\n<ul>\n<li>1 year prior experience managing leaves of absence preferred</li>\n<li>Payroll experience preferred, specifically in Kronos timekeeping system</li>\n</ul>\n\n<strong>SKILLS:</strong>\n\n\n<ul>\n<li>Ability to analyze and extract data utilizing HRIS systems with attention to detail</li>\n<li>Ability to work with minimal supervision and take initiative</li>\n<li>Excellent interpersonal skills and ability to work collaboratively in a diverse, team</li>\n</ul>\n\nenvironment\n\n\n<ul>\n<li>Strong verbal and written communication</li>\n<li>Strong sense of urgency and ability to handle pressure and demands from multiple</li>\n</ul>\n\ncustomers and competing priorities\n\n\n<ul>\n<li>Ability to take on other programs, projects, and tasks as assigned with minimal disruption to</li>\n</ul>\n\ndaily activities\n\n\n<ul>\n<li>Ability to handle sensitive employee information in a confidential manner</li>\n<li>Project management and vendor management skills</li>\n<li>Ability to focus on customer needs in a fast-paced environment</li>\n</ul>\n\nThe Nestlé Companies are equal employment and affirmative action employers and looking for diversity in qualified candidates for employment."}