{"job title": "Data Scientist", "company": "NetApp", "city state": "– Waltham, MA", "rating": "3.6", "job description": "Job Summary\n<br><br>\nNetApp OnCommand Insight (OCI) is looking for a Data Scientist with deep knowledge of Machine Learning (ML) and statistical algorithms and techniques to join the team that helps the largest enterprises and organizations in the world to manage their highly complex data centers and infrastructure across private and public clouds.\n<br><br>\nThe successful candidate will have an innate curiosity and passion for gathering insights from large sets of data that can help customers thrive using OCI. Of particular interest will be time-series analysis (e.g. Bayesian methods), Natural Language processing, and general Machine Learning analysis. By reviewing the data collected by OCI and the associated use cases, the candidate will work with Product Management to generate product feature ideas that focus on using ML algorithms and techniques to enhance analytical possibilities within the product. Further, the successful candidate will have the skills to generate code level prototypes to illustrate the proposed feature concepts and will work closely with Engineering to help design, implement, and deliver necessary product execution. Experience designing and delivering software at scale in a SaaS environment is a highly desirable plus.\n<br><br>\nResponsibilities:\n\n<ul>\n\n\t<li>Apply broad and deep knowledge of ML algorithms and techniques to data collected by OCI in order to generate unique and enhanced insights for customers.</li>\n<li>Work closely with OCI product management to integrate such ideas into the product and deliver to customers.</li>\n<li>Lead work inside OCI engineering to implement and execute the delivery of ML based features.</li>\n<li>Serve as a senior architectural advisor to facilitate integration of ML algorithms and techniques in a highly scalable fashion in a SaaS environment.</li> \n</ul>\nJob Requirements\n\n<ul>\n\n\t<li>7+ years of experience in building ML based features or techniques for customer visible products.</li>\n<li>Including topics such as:\n\n\n<ul>\n\n <li>Time series analysis\n\n\n<ul>\n\n <li>Anomaly detection techniques</li>\n<li>Statistics and Bayesian methods</li>\n</ul>\n\n </li>\n<li>Deep learning algorithms LTSM, CNN, Sequence-to-Sequence</li>\n<li>Machine learning algorithms such as clustering, SVM, logistic regression</li>\n<li>Natural language processing – topic modeling, sentiment analysis , sentence classification</li>\n</ul>\n\n\t</li>\n<li>Experience with scripting languages such as Python, R, shell scripts, etc.</li>\n<li>Experience with Java is highly desirable.</li>\n<li>General experience with SaaS based product architectures and related concepts (AWS, Micro-services, distributed processing, etc.) is highly desirable.</li>\n<li>Strong communication skills. Able to convey clear and concise information to both engineers and executives at any level.</li> \n\n<li>Work collaboratively within a team environment.</li>\n</ul>\nEducation\n<br><br>\n• 8+ years of production software development experience.\n\n\n<ul>\n<li>Bachelor's or Master’s Degree, or PhD in Computer Science, Computer Engineering, or Computer Information Systems, or equivalent job experience is required.</li>\n\n</ul>"}