{"job title": "Data Scientist", "company": "Neuberger Berman", "city state": "– New York, NY", "rating": "3.6", "job description": "<strong>Summary:</strong>\n<br><br>\nSeeking a highly motivated individual with strong quantitative, analytical, and communication skills\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Analyze large, unstructured data sets to discover fundamental health of publicly traded companies.</li><li>Evaluate and analyze new data sets to model relevant financial metrics, and to generate insights/predictions that can be applied to investment strategies</li><li>Apply statistical and machine learning techniques to large data sets for data quality control, feature engineering and bias correction.</li><li>Back-testing of strategies before putting into production</li><li>Design schemas and applications to automate data mining and warehousing processes in a scalable way.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Minimum 3 years of experience in quantitative investment research</li><li>Master’s or advanced degree in finance, mathematics, statistics, econometrics, computer science, or other quantitative disciplines</li><li>Extensive programming experience in Python, R, SQL, and/or Java. Familiarity with statistical packages and large scale distributed computing (like Spark) is a plus</li><li>Functional knowledge of finance and accounting</li><li>Curious, resourceful, well-organized, and attentive to detail</li><li>Able to work independently and with minimum oversight</li><li>Strong verbal and written communication skills</li>\n</ul>\nNeuberger Berman is an equal opportunity/affirmative action employer. The firm and its affiliates do not discriminate in employment because of race, color, religion, gender, national origin, protected veteran status, disability, age, citizenship, marital or domestic/civil partnership status, sexual orientation, gender identity or expression or because of any other criteria prohibited under controlling federal, state or local law. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact onlineaccommodations@nb.com."}