{"job title": "Data Scientist", "company": "Neumeric Technologies Corporation", "city state": "– Woodlawn, MD", "rating": "4.2", "job description": "<strong>Job Description</strong>\n<br>\nWhisker Labs is seeking a data scientist to join our team extracting insights from electrical networks. This team is responsible for advancing Whisker Lab’s technology to detect early warning signs of electrical fires in homes, preventing one of the deadliest types of fires. The role will primarily focus on the design, development, and deployment of algorithms analyzing high speed real-time sensor data.\n<br>\nOur ideal candidate is a former Scientific Programmer or Software Engineer looking to transition into data analytics. A successful employee is comfortable in a startup environment and brings an energetic, creative approach to their work. They are excited to develop new methods to extract insights from big data as we develop products from the ground up. They are comfortable jumping into the deep end, expanding your skills as you go, and are eager to contribute to a project that will have a substantial, positive impact on people’s lives.\n<br>\n<strong>Responsibilities:</strong>\n<br>\nDesign and implement scalable, data-driven solutions to extract insights from high-frequency sensor data\n<br>\nDesign algorithms that create tools for building data sets, managing data pipelines, and training and validating models\n<br>\nCreating data visualizations and dashboards to inform the data science team and key stakeholders\n<br>\nParticipate in software design, production-readiness, and code reviews\n<br><br>\nYou have some, but not necessarily all, of these:\n<br>\nA degree in Mathematics, Computer Science, Statistics, Engineering, etc.\n<br>\nExcellent problem solving and analytical skills\n<br>\n6+ years analyzing and presenting insights drawn from large data sets (or equivalent combination of education and experience)\n<br>\nExperience with a *nix-based development workflow (e.g. git, SSH, Make, shell scripting)\n<br>\nCoding experience (e.g. Python, Java/Scala), fluency in Python preferred\n<br>\nExperience performing data analysis of large datasets, using analytics tools (e.g. Pandas, SQL, Spark), and preparing visualizations to explore technical and scientific questions\n<br>\nExperience with cloud ecosystems (e.g. AWS, Google Cloud)\n<br>\nExperience with signal processing and real-time processing of high-velocity time series data a plus\n<br>\nFamiliarity with C/C++ for embedded systems a plus\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br>\nPhD in a related field\n<br>\nExperience and understanding of electrical and utility infrastructure\n<br><br>\nWhisker Labs is an Equal Opportunity Employer.\n<br><br>\n<strong>Company Description</strong>\n<br>\nWhisker Labs develops sensing and software technology for home intelligence. We provide energy efficient solutions for fire hazard detection, load identification, thermodynamics, and demand response."}