{"job title": "Data Scientist", "company": "Neurable", "city state": "– Boston, MA, US", "rating": "NA", "job description": "<div>\nWe are looking for a Data Scientist to join our team. Someone who wants to embed themselves into the fabric of the company, tackling not only interesting but also meaningful challenges. Youre not going to be putting together reports, for someone to review, to then discuss, to maybe never incorporate. This isnt another fintech, big data, company. This is a chance to see your efforts directly translate into product and also impact the course of technological development. We are building towards the final frontier of technology, the brain.</div> <br>\n<div>\n<strong>Principal Duties and Responsibilities</strong>\n</div>\n\n<ul>\n\n<li>\nEnd to end hands-on ownership of machine learning systems including real-world data sets, data pipelines, model generation, training, and real-time predictions</li>\n<li>\nFiltration of time series data</li>\n<li>\nCloud-based systems (Amazon Web Services)</li>\n<li>\nBreadth of experience across Supervised/Unsupervised/Semi-supervised/Reinforcement learning</li>\n<li>\nDevelop statistical methods and models for dimensionality reduction in high dimensional problems with noise</li>\n<li>\nQuick Proof of Concept (POC) projects for noisy time series data</li>\n<li>\nPOCs should serve as learning experiences for the organization, so that they can be applied across projects in parallel effort</li>\n</ul>\n\n<br>\n<div>\n<strong>Bonus</strong></div>\n\n<ul>\n\n<li>\nExperience with biological time series data (e.g., EEG ideal)</li>\n<li>\nExperience with human subjects experimental design or data collection</li>\n</ul>\n\n<br>\n<div>\n<strong>Qualifications</strong>\n</div>\n\n<ul>\n\n<li>\nBS with 5+ years experience/MS with 3+ years /PhD with 1+ yrs in Computer Science/EE/Applied Mathematics/Computational Neuroscience or other relevant STEM field. Or just convince us why youre the person for the job.</li> \n<li>\nFluency in various machine and deep learning applications/design, especially regarding neural networks (Algorithm design, AI development, PCAs, ICAs, and ensemble methods)</li>\n<li>\nConfidence in implementing algorithms in C/C++ or Python</li>\n<li>\nExperience with scientific libraries (NumPy, SciKit-learn, SciPy, IPython, Sympy, Pandas, etc)</li>\n<li>\nMathematical, statistical, and probability inclinations with a deep understanding of AI concepts</li>\n<li>\nA track record in signal processing that includes developing, implementing, and validating signal processing algorithms (e.g., FFT, DFFT, Wavelet) for solving real-world problems</li>\n<li>\nResearch centered techniques for scalable and accurate inferences in graphical models, statistical modeling of data, large-scale combinatorial optimization, and robust decision making under uncertainty</li>\n</ul>\n\n<br>\n<div>\n<strong>Character</strong>\n</div>\n\n<ul>\n\n<li>\nYou know and can admit when something is not great. You can recognize that something you did needs improvement - no one is perfect</li> \n<li>\nComfortable in a small, intense, and high-growth environment</li> \n<li>\nYou are comfortable disagreeing with others and can respectfully work with them to reach a better solution</li>\n<li>\nDesire to create a positive change in the world</li> \n<li>\nAbility to rapidly prototype real features in a startup environment</li> \n<li>\nA hacker, if something you need doesnt exist you dont wait around - you make it</li>\n<li>\nRapidly learn and adapt to new opportunities and ideas</li> \n<li>\nGrow with the company to increase the overall whole, both from a professional and personal perspective</li> \n<li>\nYou reach past your grasp because you know you have a team that will catch you when you fall, which is not only ok - it is encouraged</li>\n</ul>\n\n<br><br>\n<strong>Compensation</strong><br>\n<div>\nSalary: $100,000.00 - $120,000.00\n<br>\nEquity Amount: To Be Discussed\n<br>\nInsurance: Top Tier Health and Dental | Neurable covers 100% of plan</div><br>\n\n<div>\nWe are looking for someone to start as soon as possible\n<br>\nWe are <em>not</em> able to provide a Visa or sponsorship\n<br>\nWe <em>can</em> provide dogs and meaningful work</div>"}