{"job title": "Research Scientist", "company": "Nevro", "city state": "– Redwood City, CA (US)", "rating": "4.3", "job description": "<div><div>\n<div>Nevro is a medical device company headquartered in Redwood City, California. We have developed HF10™ therapy, an innovative, evidence-based neuromodulation platform for the treatment of chronic pain.\n<br><br>\nWe started with a simple mission to help more patients suffering from chronic pain. At each stage of development, our research was subject to the highest levels of scientific rigor, resulting in a new therapy that has advanced the state of spinal cord stimulation (SCS).\n<br><br>\nThe Nevro® Senza® SCS System received CE mark in 2010, TGA approval in 2011, FDA approval in 2015, and is commercially available in Europe, Australia, and the United States.</div>\n</div>\n</div>\n\n<br>Overview<br>\n\n<div>\n<div>\n<div>The Research Scientist is responsible for investigating and implementing the technical and clinical vision of the advanced technology group. The scientist will also research and investigate disruptive technical and clinical opportunities including developing clinical models of efficacy. He/she will be responsible for the tactical implementation of the program and projects within the group. Lastly, he/she will also be responsible for assisting in defining market opportunities.\n<ul>\n<li>Investigate novel and disruptive technologies and clinical therapies with the objective to expand Nevro’s therapy</li><li>Assists in the exploration and evaluation of external technical and clinical opportunities and performing assessments, recommendations and technical due diligence</li><li>Works closely with other team members in designing experimental protocols, as well as the conducting and monitoring these research projects, and interpretation of results</li><li>Participates in the development and writing of integrated reports and preparation of presentations and manuscripts of scientific meetings and technical journals</li><li>Participates in design and writing of protocols, case report forms and informed consent forms for clinical trials</li><li>Performs a variety of analysis in the collection, verification, analysis, documentation and interpretation of research data</li><li>Evaluates and interprets collected data, and prepares presentations, reports and analyses describing progress, trends, and recommendations or conclusions</li><li>Identify, assess, recommend, and integrate novel technologies and/or clinical therapies</li><li>Conduct descriptive and exploratory analysis of technical and clinical data</li> <li>Define statistical tests and methods for both evaluating and generating statistical hypotheses</li><li>Work cross-functionally (e.g., business development, engineering, marketing, clinical affairs, quality, and legal) as needed to assess potential opportunities</li> </ul></div>\n</div>\n</div>\n\n<br>Role Requirements<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li>Master’s or Ph.D degree in biomedical science and/or electrical engineering required; an M.D. or advanced degree in a technical field and/or MBA preferred</li><li>5+ years experience in the medical field</li></ul></div>\n</div>\n</div>\n\n<br>Skills and Knowledge<br>\n\n<div>\n<div>\n<div>\n\n<ul>\n<li><div>Demonstrated ability to deliver on milestone based programs and projectsDemonstrated understanding of medical technologies and clinical therapies</div></li><li><div>Demonstrated knowledge and understanding of human physiology and anatomy</div></li><li><div>Demonstrated knowledge and understanding of human neurophysiology and neuroanatomy</div></li><li><div>Demonstrated ability to implement technical and clinical solutions</div></li><li><div>Demonstrated experience with observational studies and patient reported outcomes</div></li><li><div>Demonstrated ability to determine market drivers and conduct market research</div></li><li><div>Demonstrated astuteness in identifying and understanding meaningful intellectual property</div></li><li><div>Experience interfacing with external partners (e.g., physicians, consultants, companies, academia)</div></li><li><div>Demonstrated interpersonal and communication skills</div></li>\n</ul>\n<strong>#LI-DS1</strong></div>\n</div>\n</div>\n<br>"}