{"job title": "CVP - Data Scientist &amp; Insights Leader - Internal Audit Analytics", "company": "New York Life", "city state": "– New York, NY", "rating": "3.5", "job description": "<p>&nbsp;</p><p>A career at New York Life offers many opportunities. To be part of a growing and successful business. To reach your full potential, whatever your specialty. Above all, to make a difference in the world by helping people achieve financial security. It’s a career journey you can be proud of, and you’ll find plenty of support along the way. Our development programs range from skill-building to management training, and we value our diverse and inclusive workplace where all voices can be heard. Recognized as one of Fortune’s World’s Most Admired Companies, New York Life is committed to improving local communities through a culture of employee giving and service, supported by our Foundation<u>.</u> It all adds up to a rewarding career at a company where doing right by our customers is part of who we are, as a mutual company without outside shareholders. We invite you to bring your talents to New York Life, so we can continue to help families and businesses “Be Good At Life.” To learn more, please visit LinkedIn, our Newsroom and the Careers page of www.NewYorkLife.com.</p><p>&nbsp;</p><p><strong>CVP – Data Scientist &amp; Insights Leader – Internal Audit Analytics</strong></p><p>&nbsp;</p><p>New York Life Insurance Company is the largest mutual life insurance company in the United States. Founded in 1845 and headquartered in New York City, New York Life reported 2017 operating earnings of $2.06 billion. Total assets under management at year end 2017, with affiliates, totaled $586 billion.</p><p>&nbsp;</p><p>New York Life holds the highest possible financial strength ratings currently awarded to any life insurer from all four of the major ratings agencies: A.M. Best, A++; Fitch AAA; Moody’s Aaa; Standard &amp; Poor’s AA+ (Source: Individual independent rating agency commentary as of 8/1/17).</p><p>&nbsp;</p><p>Financial strength, integrity and humanity—the values upon which New York Life was founded—have guided the company’s decisions and actions for over 170 years.</p><p>New York Life also has a very active Data Science community, which the successful candidate will be a member of and can find mentors in. This community offers many technical and business presentations (from simple business analysis to advanced artificial intelligence), mini conferences, hackathons, and fully supported technical training programs.</p><p><br><strong><u>Position Overview:</u> </strong>The&nbsp;Data Scientist and Insights Leader will assist in building enhanced data analytic capability in the internal audit department to drive insight and improve assurance capabilities. The Leader must be a curious learner who can work independently and build a bridge between an array of complex data and the internal auditors to elevate the internal audit function. A candidate should have a collaborative agile mindset and sufficient experience to help chart the path and execute a multi-year roadmap with the goal of providing advanced risk assessment, insights, analytics, and elevate assurance services using data visualization tools. Longer term the role will include assessing more advanced techniques and tools.</p><p>A successful candidate will have strong business and technical acumen, as well as strong problem solving, communication, and leadership skills.</p><p>In the first six months, a successful candidate will establish quick repeatable paths to connect auditors to data and identify patterns using a data visualization tool for planning, risk assessment, and assurance work.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;<strong><u>Responsibilities:</u></strong></p><ul><li>Lead and develop data visualization capabilities in the internal audit</li><li>Operationalize insights through development of dashboards, tools, and processes</li><li>Partner with internal auditors to understand their analytical and reporting needs: translating those needs into concrete technical requirements; work closely with internal teams, using data to elevate risk assessment and assurance capabilities</li><li>Manage, design, execute continuous and ad-hoc quantitative and qualitative analysis to identify business risks; lead analysis of large, complex data sets to provide insights</li><li>Proactive analysis of business metrics to assess risk, develop actionable insights, and communicate them in an easy to digest manner</li><li>Utilize data wrangling tools to secure data and move into data visualization dashboards to provide insights</li><li>Address data needs and how data should be structured / stored, assuring compliance with regulatory and privacy requirements during design and implementation of modeling and analysis projects</li><li>Independently leads&nbsp;data analysis and modeling projects. This includes business requirements gathering, solution proposal, internal clients buy-in, data reception and processing, data analyses and modeling, reports/presentations, results review with stakeholders, and implementation support</li><li>Coordinate multiple tasks simultaneously, meeting deadlines and working productively</li></ul><ul><li>Leads analytical innovation efforts to test and recommend new advanced analytical methods, software and data sources. Shares knowledge and trains others on its adoption within internal audit</li><li>Proactively demonstrates to stakeholders how analytics can be implemented to maximize internal audit effectiveness. Provides technical support, which includes strategic consulting, needs assessments, project scoping and the preparation / presentation of analytical proposals</li><li>Develop and leverage partnerships with peer internal data science, data governance, and information technology groups as necessary to promote the data science discipline and develop solutions</li></ul><ul><li>Able to manage remote co-source resources and employees</li></ul><p>&nbsp;</p><p><strong><u>Qualifications:</u></strong></p><ul><li>8+ years of experience in insights and analytics required; business intelligence, data science or engineering experience preferred</li><li>Strong expertise in data pull and manipulation of large complex datasets and databases. Solid understanding of data modeling and data governance. Experience with Oracle and Hadoop databases including programming experience in SQL.</li><li>Strong ability to synthesize data, develop insights, and identify and translate technical findings into actionable recommendations through easy to digest communication, presentations and reports; experience with qualitative and quantitative research methodologies</li><li>Substantial programming experience with R and/or Python. Exposure to GitHub.&nbsp;</li><li>Expertise in statistical modeling techniques such as linear regression, logistic regression, tree models (Random Forests and GBM), cluster analysis, principal components, feature creation, and validation.</li><li>Experienced with data visualization tools (SpotFire &amp; Tableau)</li><li>Experienced managing a team, including both co-source resources and employees</li><li>Able to work collaboratively with multiple stakeholders and lead multiple work assignments with high standards in a fast-paced environment</li><li>Results driven, detail-oriented, demonstrate strategic thinking and creative, with roll up your sleeves approach</li><li>Must be intellectually curious, analytically rigorous, hard-working and use a practical common-sense approach to address issues</li><li>Be a critical thinker with an innovative mindset, coupled with a track record for creating solutions that are efficient, effective, and essential</li><li>Strong communication and presentation skills; written, verbal and the ability to influence and persuade; using an array of tools to tell the insight story tools</li><li>Expertise in design of experiments and its applications in business setting</li><li>Working knowledge of internal audit processes, risk management principles, and the life insurance industry preferred.</li></ul><p>&nbsp;</p><p><strong><u>Education:</u></strong>&nbsp;</p><p>BA or BS from in a quantitative field (Business, Math/ Statistics, Economics, Computer Science, Engineering, or similar). Master’s degree strongly preferred.</p><p>&nbsp;</p><p>Location: Manhattan (midtown, walking distance from Penn Station and Grand Central)</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>EOE M/F/D/V</p><p>&nbsp;</p><p>If you have difficulty using or interacting with any portions of this Web site due to incompatibility with an Assistive Technology, if you need the information in an alternative format, or if you have suggestions on how we can make this site more accessible, please contact us at: (212) 576-5811.</p>"}