{"job title": "Data Scientist", "company": "New York Times", "city state": "– New York, NY", "rating": "3.8", "job description": "<strong>Job Description</strong><br><br>The New York Times is committed to advancing the world’s most reliable and highest quality journalism through technology. Our ability to do so relies on a talented team of expert technologists who help NYT learn from a tremendous abundance of data unique to this company. The Times seeks a Data Scientist to join the Data Science Group applying machine learning methods to meet this challenge, in close collaboration with working partners across the company.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n\n<li>Reframe newsroom and business objectives as machine learning tasks that can deliver actionable insights, accurate predictions, and effective optimization.</li>\n<li>Implement and execute machine learning research with reliability and reproducibility.</li>\n<li>Communicate results and impact to newsroom and business stakeholders.</li>\n<li>Turn models into data products, collaborate with engineering teams, and integrate into process throughout The Times.</li>\n\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Technical</strong>:\n<ul>\n\n<li>PhD, MS, or 3+ years experience in computer science, applied mathematics, or other quantitative/computational discipline.</li>\n<li>2+ years experience with open source machine learning or statistical analysis tools. Familiarity with experimental design a plus.</li>\n<li>2+ years coding experience, Python preferred.</li>\n<li>Ability to communicate complex ideas in data science to relevant stakeholders.</li>\n<li>Data engineering experience, including SQL and manipulating large structured or unstructured datasets for analysis.</li>\n<li>Preferred: experience with building data products, either internal or consumer-facing.</li>\n<li>Preferred: Experience working with unstructured data and Natural Language Processing</li>\n\n</ul>\n<strong>Non-Technical:</strong>\n<ul>\n\n<li>Commitment to the The Times’ mission of delivering the world’s best and most reliable journalism.</li>\n<li>Excellent analytical and problem-solving skills</li>\n<li>Strong oral and written communication skills</li>\n<li>A passion for empirical research and for answering hard questions with data.</li>\n<li>Proven record of solving challenging problems in academia and/or industry.</li>\n<li>Eagerness to collaborate with both technical and non-technical colleagues in editorial, product management, marketing, and executive leadership groups.</li>\n<li>Ability to gauge the complexity of machine learning problems and a willingness to execute simple approaches for quick effective solutions as appropriate.</li>\n<li>Desire to join the world’s most important journalism company at a moment in history when the importance of learning from our data is transforming every aspect of the craft and practice of journalism.</li>\n\n</ul>\nPlease provide GitHub or portfolio site if available.\n<br><br>\n#LI-SO1<br><br>If you are an active employee at The New York Times or any affiliates, please do not apply here. Go to the Career Worklet on your Workday home page and View \\\"Find Internal Jobs\\\". Thank you!<br><br>The New York Times Company is an Equal Opportunity Employer and does not discriminate on the basis of an individual's sex, age, race, color, creed, national origin, alienage, religion, marital status, pregnancy, sexual orientation or affectional preference, gender identity and expression, disability, genetic trait or predisposition, carrier status, citizenship, veteran or military status and other personal characteristics protected by law. All applications will receive consideration for employment without regard to legally protected characteristics."}