{"job title": "Research Scientist V (2 positions)", "company": "New York State Psychiatry Institute", "city state": "– New York City, NY", "rating": "NA", "job description": "2 open positions for Research Scientists\n<br><br>\nThe Research Foundation for Mental Hygiene is recruiting 2 biostatisticians. The incumbents will hold an inter-disciplinary faculty appointment in the Departments of Psychiatry and Biostatistics at CUIMC.\n<br><br>\n<strong>Duties/Responsibilities:</strong>\n<br><br>\nProvide biostatistical support for collaboration with investigators in the Research Foundation for Mental Hygiene and NYSPI\n\n\n<ul>\n<li>Conduct research and seek grant funding in biostatistical methods</li>\n<li>Provide services in teaching, training, and mentoring functions; and</li>\n<li>Provide services in administrative committees.</li>\n<li>Lead the design, analysis, and reporting of results from various clinical, epidemiological, and services psychiatric research studies.</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n<br><br>\nDoctoral degree in biostatistics, statistics, or a related discipline\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\na doctoral degree in biostatistics, statistics, computer science, or a related discipline\n<br><br>\na record of independent and collaborative research; excellent written and verbal communication skills\n<br><br>\ninterest in developing and applying statistical methods to important problems in psychiatric research.\n<br><br>\nTo apply: Submit an application with cover letter and resume by January 14, 2019 through our website https://nyspi.applicantpro.com/jobs/. Only applications submitted through the RFMH website will be accepted.\n<br><br>\nThe Research Foundation is a private not-for-profit corporation and is not an agency or instrumentality of the State of New York. Employees of the Research Foundation are not state employees, do not participate in any state retirement system, and do not receive state fringe benefits. Excellent Benefits Package. Employer/Minority/Women/Disabled/Veteran Employer. VEVRAA 41 CFR 60-300.5(a) compliant."}