{"job title": "Data Scientist", "company": "Nexosis", "city state": "– Columbus, OH", "rating": "5.0", "job description": "<p><strong>About Nexosis:</strong><br>Nexosis is a venture-backed startup focused on democratizing machine learning. We are partnered with some of the best-known Fortune 500 companies to leverage data science, gain actionable insights, and answer some of their most pressing questions, including demand forecasting and timeline-based causalities.</p>\n<p><strong>About you:</strong></p>\n<p>You should be a self-starter, and a person that's naturally curious. You don't shy away from problems, or from new ideas. You are able to work independently and as part of an overall team. You will work on various research and development projects, including building statistical/machine learning models to optimize our proprietary technology.</p>\n<p><strong>What you'll be doing:</strong></p>\n<ul>\n<li>Building something new, which will require a lot of research and development</li>\n<li>Implement state-of-the-art machine learning approaches</li>\n<li>Automate and productize previously manual data science workflows into a commercial software engine</li>\n<li>\"Full-stack\" data analysis including data exploration, feature construction, modeling, and visualization</li>\n</ul>\n<p> <strong>Key Requirements:</strong></p>\n<ul>\n<li>MS in quantitative field. PhD preferred, but Not Required</li>\n<li>2+ years of experience with Machine Learning (Regression models, SVM, Factorization Machines, Clustering, Bayesian methods, Anomaly Detection, Neural Networks, etc)</li>\n<li>2+ years of experience performing statistical data analysis, preferably in an experimental or research setting</li>\n<li>Knowledge of time series algorithms (auto-regressive models, state-space models, Kalman filtering, etc.) and experience solving time series problems</li>\n<li>Comfortable with a wide set of machine learning approaches and data analysis techniques</li>\n<li>Proven track record of delivering models that answer difficult questions and solving complex problems with various amounts of data</li>\n<li>Experience building or working with automated data analysis workflows</li>\n<li>5+ years with one of the following: Python, R, C/C++, C#, Java</li>\n<li>Familiarity with data analysis packages and workflows in R and/or Python</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Health Insurance (medical, dental, and vision)</li>\n<li>Generous PTO</li>\n<li>Stock Options</li>\n<li>401K Plan Available</li>\n</ul>"}