{"job title": "Data Scientist IV", "company": "NEXTGEN GLOBAL RESOURCES", "city state": "– Walnut Creek, California", "rating": "4.6", "job description": "As an RF Engineering Data Analyst you will prove the RF systems Performance team with data modeling and creation of dashboards. You will utilize multiple databases and sources and pull info into bit sized data/info that they RF team can analyze. This is a great long term opportunity with a major carrier.\n<br><br>\n<strong>As a RF Engineering Data Analyst you will be:</strong>\n\n<ul>\n\n\t<li>Performing data analytics and applying data science techniques to improve our network’s capacity, coverage and overall service</li>\n<li>Automating data collection, reports, visualization and system updates\n\n\n<ul>\n\n <li>Creating dashboards and geolocating data to present information dynamically</li>\n</ul>\n\n\t</li>\n<li>Designing, launching and optimizing the next generation of wireless technologies\n\n\n<ul>\n\n <li>Simplifying data for team members and management</li>\n<li>Managing our network data to generate network insights</li>\n</ul>\n\n\t</li>\n</ul>\n<strong>As a RF Engineering Data Analyst you’ll need to have:</strong>\n\n<ul>\n\n\t<li>Bachelor’s degree or four or more years of work experience</li>\n<li>Experience in data analytics</li>\n<li>Experience applying Machine and Deep Learning models</li>\n<li>Data Science knowledge</li>\n<li>Willingness to work some nights</li>\n</ul>\n<strong>RF Engineering Data Analyst, Even better if you have:</strong>\n\n<ul>\n\n\t<li>A degree in electrical engineering</li>\n<li>Experience in the cellular industry\n\n\n<ul>\n\n <li>Ideally, with network experience. Experience with RF propagation tools and radio test equipment, like Ascm, DataPro, Spectrum Analyzers, Actix, Windcatcher, or RF Scanners</li>\n</ul>\n\n\t</li>\n<li>Understanding of intermodulation, distortion, interference detection, and mitigation techniques</li>\n<li>Understanding of antenna characteristics or antenna system design and selection</li>\n<li>Understanding of frequency planning constraints and requirements such as C/I, co and adjacent channel criteria</li>\n<li>Understanding of LTE, VoLTE, Evdo, or CDMA. SQL, Python and R experience</li>\n<li>Business Intelligence understanding</li>\n<li>Tableau expert level</li>\n<li>Mapping data using Google Earth, Tableau, ArcGIS or Mapinfo</li>\n</ul>\n<strong>NextGeners are Connectors.</strong>\n<br><br>\nWe thrive on ‘quality over quantity’ and put in the work building strong relationships. We create connections, discover qualities, uncover skills, and place people with accuracy. We are your true partner!\n<br><br>\n<strong>NextGeners are Collaborators.</strong>\n<br><br>\nYou’ll be working with an award-winning company who gives you direct connections to hiring managers. Our services don’t stop at the standard recruiting process. We use our expertise to tailor your resume, help improve your interview skills, and provide ongoing career support.\n<br><br>\n<strong>NextGeners give 24/7 Support.</strong>\n<br><br>\nWe are in this together. We provide around the clock availability, competitive employee benefits, and continuously check-in to make sure things are going smoothly. Check out our Glassdoor page!\n<br><br>\n#RD\n<br><br>\n#GDNG<br>\n<div>Id: 13823</div>"}