{"job title": "Data Scientist - Product", "company": "Nextdoor", "city state": "– San Francisco, CA", "rating": "4.3", "job description": "Are you passionate about using the power of technology to build community? Do you believe residents can strengthen their neighborhoods through dialog and collaboration? Would you like to join a transformative company and play a meaningful role in shaping its future? If so, we'd love to meet you.\n<br><br>\nWe are looking to hire an experienced Data Scientist to join our team. In this role, you'll help determine what data should be tracked and work with Product and Engineering to implement your vision. You will also be part of the team responsible for building and scaling our data infrastructure that will be the foundation of analytics and data science around our unique data set. You'll directly contribute to scaling our analytical abilities and will help lead us to the future of data at Nextdoor.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Conduct in-depth analysis on Nextdoor data, analyzing community growth, platform engagement, and ads performance</li>\n<li>Partner with cross-functional teams to support product development efforts (including product, design, engineering, marketing, operations, and sales)</li>\n<li>Develop and socialize best practices around metric development, A/B testing and experimentation, usage tracking and instrumentation</li>\n<li>Drive self-service for our data platform by creating and documenting data structures and sets, SQL and data tools training, and dashboard development</li>\n<li>Develop and share key strategic insights through data analysis, visualization, and story-telling</li>\n<li>Create and optimize statistical models and algorithms to help drive product and strategic decision-making</li>\n<li>Care deeply about data quality and empowering employees to leverage data to help them succeed in their careers and help Nextdoor grow and succeed</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>Advanced degree in a quantitative field, or equivalent (2+ years) experience</li>\n<li>Expert knowledge of SQL</li>\n<li>Familiarity with Python/Pandas, R, or some other computation analysis software</li>\n<li>Experience effectively presenting insights and summarizing complex data to diverse audiences through visualizations and other means</li>\n<li>Ability to understand, tackle, and communicate problems from both technical and business perspectives</li>\n<li>Innate curiosity around finding meaningful insights that inform the way we think about and develop both our product and our business strategies</li>\n</ul>\n<strong>Benefits</strong>\n\n<ul>\n<li>The opportunity to work with a collaborative and entrepreneurial team on a powerful mission to change the world, one neighborhood at a time</li>\n<li>100% company-paid health insurance premiums (medical, dental and vision) for you and your family</li>\n<li>Paid vacation and company holidays</li>\n<li>401K plan</li>\n<li>Meaningful equity for all employees</li>\n<li>Commuter benefits through Clipper card</li>\n<li>Free catered dinners during the week, Monday through Thursday</li>\n<li>Fully stocked kitchens with drinks, snacks and candy</li>\n<li>The option of an adjustable standing desk</li>\n<li>Shiny Apple products</li> \n</ul>"}