{"job title": "Associate Data Scientist", "company": "NextEra Energy, Inc", "city state": "– Juno Beach, FL", "rating": "3.4", "job description": "Requisition ID: 27584\n<br><br>\nNextEra Energy Resources is one of the largest wholesale generators of electric power and renewable energy from the wind and sun in North America.\n<br><br>\nPosition Specific Description\n<br><br>\nSmile you've found us! At NextEra Energy, our people are our greatest asset and our Data team is looking for a Data Scientists to join the organization!\n<br><br>\nThis position is responsible for developing algorithms, modeling techniques, and optimization methods that support many aspects of NextEra and FPL business. Employees in this role use knowledge of machine learning, optimization, statistics, and applied mathematics along with abilities in software engineering with a focus on distributed computing and \"Big Data\". Candidates with the following experience will be highly considered\n<br><br>\nJob Overview\n<br><br>\nThis position is responsible for developing algorithms, modeling techniques, and optimization methods that support many aspects of NextEra and FPL business. Employees in this role use knowledge of machine learning, optimization, statistics, and applied mathematics along with abilities in software engineering with a focus on distributed computing and data storage infrastructure (i.e., \"Big Data\").\n<br><br>\nJob Duties &amp; Responsibilities\n\n\n<ul>\n<li>Develops machine learning, optimization and other modeling solutions</li>\n<li>Prepares comprehensive documented observations, analyses and interpretations of results including technical reports, summaries, protocols and quantitative analyses</li>\n<li>Manipulates and analyzes data sets</li>\n<li>Performs other job-related duties as assigned</li>\n</ul>\n\nRequired Qualifications\n\n\n<ul>\n<li>Bachelor's Degree</li>\n<li>Experience: 0+ years</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>Master's Degree<br><br>SDL2017</li>\n\n</ul>"}