{"job title": "Data Scientist - You Make Data Sing", "company": "Next Tier Concepts, Inc.", "city state": "– Vienna, VA", "rating": "3.8", "job description": "<strong>Who We Are</strong>\n<br><br>\nNT Concepts is a national security solutions firm that likes to solve hard problems. It’s our thing. We do that by working with some complex clients (you’ve heard of them) on their hardest challenges. Clients with massive, complex data sets. So we get to keep learning, building, and experimenting with the latest technologies. And since life’s too short to spend with difficult people, we hire team members that not only like to solve problems, but that we like to hang out with. Working on big data solutions is as much about the team you work with, as the data itself. Even more so, in our humble opinion.\n<br><br>\n<strong>Why We’re Both Here - The Work at Hand</strong>\n<br><br>\nOne of the most exciting parts of NT Concepts is our rapidly growing data-science team. You’ll be an expert for clients, partnering closely with our team of Developers and Data Engineers to create robust machine learning solutions. You’ll bring your skills to bear to solve complex problems, provide guidance on current and emerging technologies, and drive the future of our data science enterprise. We mostly focus on exploiting geospatial data of all types (because pictures and maps are fun!) with a sprinkling of Natural Language Processing (NLP). We’ve also got some really cool technology partners that add tools to your toolkit.\n<br><br>\nWe love people who dream big, find data fascinating, and understand that’s it’s not just about data: it’s about the science behind it, and how you can use it to solve real-world problems. (Also, if you happen to have some level of talent at, say kick-ball or giant Jenga: bonus points).\n<br><br>\n<strong>Who You Are</strong>\n<br><br>\nBeyond the whole “this person is awesome and I love working with them” piece, there are a few core skills that will help you out here.\n<ul>\n<li>Data science is a dynamic and evolving profession – we’re looking for people who love to learn and find unique solutions without being micro-managed: you’ll have the freedom to try new things, test solutions and technologies, and tell us when there’s a better path.</li><li>You know your way around a cloud console and have handled some pretty large volumes of data.</li><li>You are familiar with a few machine learning frameworks, like TensorFlow or PyTorch.</li> <li>Maybe you have used enterprise products in the past for high throughput data ingestion and analysis.</li><li>Ultimately, we need someone who knows their way around data modeling, information extraction, time series forecasting, machine learning algorithms, statistical analysis, or applied mathematics. We realize that data scientists are a diverse breed and we are excited to hear how your unique combination of skills might apply to our current problem sets.</li> \n</ul>"}