{"job title": "Data Scientist, Machine Learning", "company": "Niantic", "city state": "– Sunnyvale, CA", "rating": "4.7", "job description": "Niantic’s Engineering Team is seeking a Data Scientist to analyze and predict user behavior to not only create incredible gameplay experiences, but also to help promote Niantic’s mission of bringing gameplay into the real world. You will partner with our Product Engineering teams to develop machine learning systems to analyze and predict user behavior, detect fraud and cheating, understand key gameplay behaviors, and surface product features and recommendations. You’re ideally an applied Data Scientist with a strong background in behavioral or predictive analytics and a penchant for deep learning models that deal with behavioral interpretation and response. Niantic Engineering leads the advancement of Augmented Reality (AR) and other immersive technologies while creating engaging apps for a user base in the billions. <strong>Please note, candidates must be able to start working within 6 or less weeks after receiving an offer of employment.</strong><br><br>Responsibilities\n\n\n<ul>\n<li>Leverage a dataset consisting of millions of user actions per day to create reliable algorithms that predict gameplay behavior.</li>\n<li>Design and evaluate novel approaches for handling high-volume real-time datasets.</li>\n<li>Run regular A/B tests and statistical analyses to draw conclusions on the impact of your models.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>You have a PhD in computer science, applied mathematics, or statistics with a thesis in behavioral analytics, or a thesis grounded in machine learning techniques in a related field.</li> \n\n<li>You have experience analyzing and creating empirically verifiable models based on real-world data, using multiple approaches.</li>\n<li>You have experience with a large scale or distributed programming framework (Dataflow, Spark or Hadoop) and with ML frameworks such as sklearn, TensorFlow/Caffe/PyTorch, H2O.</li>\n</ul>\n\nPlus If…\n\n\n<ul>\n<li>You have publications in a top-tier conference such as NIPS, ICLR, ICML,ECML, AAAI, AISTATS, SIGKDD, SIGMOD.</li>\n<li>You have data modeling experience on anti-fraud, social engineering projects or predictive analytics.</li>\n</ul>\n\n<strong>Join the Niantic team!</strong><br><br>Niantic is the world’s leading AR technology company, sparking creative and engaging journeys in the real world. Our products inspire outdoor exploration, exercise, and meaningful social interaction.\n<br><br>\nOriginally formed at Google in 2011, we became an independent company in 2015 with a strong group of investors including Nintendo, The Pokémon Company, and Alsop Louie Partners. Our current titles include pioneering global-control game Ingress, and record-breaking AR game Pokémon GO. Our third title, Harry Potter: Wizards Unite, is currently in development.\n<br><br>\nNiantic is an Equal Opportunity and Affirmative Action employer. We believe that cultivating a workplace where our people are supported and included is essential to creating great products our community will love. Our mission emphasizes seeking and hiring diverse voices, including those who are traditionally underrepresented in the technology industry, and we consider this to be one of the most important values we hold close.\n<br><br>\nWe're a hard-working, fun, and exciting group who value intellectual curiosity and a passion for problem-solving! We have growing offices located in San Francisco, Sunnyvale, Bellevue, Los Angeles, Tokyo, and Hamburg."}