{"job title": "Data Scientist", "company": "Niantic", "city state": "– San Francisco, CA", "rating": "4.7", "job description": "Do you want to help connect people all over the world, and work on a team building the next generation of planet scale AR games? We're looking for enthusiastic people to help our company become more data focused. Folks with the ability to be proactive, thorough, and independent but also to work effectively in a dynamic, fast-paced environment.<br><br>Responsibilities\n\n\n<ul>\n<li>Translate quantitative findings in concise and clear messages to leadership and external partners.</li> \n\n<li>Embedded within a product - you are the data guru responsible for setting and monitoring the targets, diagnosing problems, quantifying the impact, and coming up with solutions.</li> \n\n<li>Have a product first mindset that aligns with our mission, values and strategy.</li>\n<li>Drive consensus; independently deliver data insights to drive decisions to cross functional teams.</li> \n\n<li>Be a hands-on, self-starter and help the company make evidence based decisions.</li> \n</ul>\n\nQualifications\n\n\n<ul>\n<li>Expert level SQL experience; deep experience with statistical packages such as R, Stata and Matlab.</li>\n<li>Clear understanding of statistics, econometrics concepts, especially with regression and time series data.</li>\n<li>Knowledge and experience with A/B testing or randomized control trials.</li>\n<li>BA/BS in statistics, applied mathematics , economics, computer science, machine learning or related field.</li>\n<li>Graduate degree in relevant fields preferred but not required.</li>\n<li>1+ years work experience in data science or analytics role.</li>\n</ul>\n\n<strong>Join the Niantic team!</strong><br><br>Niantic is the world's leading AR technology company, sparking creative and engaging journeys in the real world. Our products inspire outdoor exploration, exercise, and meaningful social interaction.\n<br><br>\nOriginally formed at Google in 2011, we became an independent company in 2015 with a strong group of investors including Nintendo, The Pokémon Company, and Alsop Louie Partners. Our current titles include pioneering global-control game Ingress, and record-breaking AR game Pokémon GO. Our third title, Harry Potter: Wizards Unite, is currently in development.\n<br><br>\nNiantic is an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, genetic information, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.\n<br><br>\nWe're a hard-working, fun, and exciting group who value intellectual curiosity and a passion for problem-solving! We have growing offices located in San Francisco, Sunnyvale, Bellevue, Los Angeles, Tokyo, and Hamburg."}