{"job title": "Data Scientist, Tech Lead", "company": "NICE", "city state": "– Chicago, IL, United States", "rating": "3.5", "job description": "At Mattersight, Data Science Tech Leads serve as subject matter experts on the application of statistics and machine learning to their specific product line and guide data science work within that line. Data Science Tech Leads organize and conduct research, lead teams in developing internal and external software products, and execute and fine-tune existing methodology.\n<br><br>\nAt Mattersight, we help our clients make their customer experience organization better. The Predictive Behavioral Routing product matches customers with the best representative available. As a Tech Lead your focus will be the development and growth of a set of products that help identify who the best representative is. Mattersight’s vast store of interaction information including call transcripts and customer behavior data provides a fruitful dataset for the data science team. This role provides ample opportunity to flex and improve your NLP, optimization, and customer segmentation skills.\n<br><br>\nFrankly put, Machine Learning &amp; AI is exploding. That explosion is presenting all kinds of interesting avenues for our business, which is allowing our teams to grow professionally, technically and personally. This is exciting technology in an exciting space &amp; we want YOU to come join us on this adventure. If you want to grow and contribute in ways you didn’t expect, contact us today.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Analyze, report, and present on findings and behavioral trends</li>\n<li>Manipulate and analyze complex, high-volume, high-dimensionality data from varying sources</li>\n<li>Drive the collection of new data and the refinement of existing data sources</li>\n<li>Develop product offerings through careful consideration of business value and data analyses</li>\n<li>Explore high-level, undefined ideas and business problems using unstructured, raw data</li>\n<li>Manage Data Science roadmaps and work with product management to ensure alignment</li>\n<li>Improve internal processes and tools to increase efficiency and spur future product innovation</li>\n<li>Train and develop the less experienced data scientists and analysts on the team</li>\n<li>Spur future product innovation</li>\n</ul>\n\n<strong>REQUIRED EXPERIENCE AND ABILITIES</strong>\n\n\n<ul>\n<li>An advanced degree in a quantitative field or equivalent work experience and 3 or more years of data science work experience</li>\n<li>Degrees with a concentration in a quantitative discipline</li>\n<li>Familiarity with relational databases and SQL-like query languages</li>\n<li>Strong competence with the R programming language</li>\n<li>Advanced knowledge of machine learning methods</li>\n<li>Advanced knowledge of statistics</li>\n<li>Strong verbal and written communication skills, listening skills, and effective presentation skills</li>\n<li>Ability to impress internal teams and positively influence third-party partners and customers</li>\n<li>Experience in developing and deploying predictive model pipelines</li>\n</ul>\n\n<strong>NICE TO HAVES</strong>\n\n\n<ul>\n<li>Involvement in R package development</li>\n<li>Past participation in a formal research setting</li>\n<li>Expertise in NLP and/or optimization machine learning problems</li>\n<li>Experience as a part of a software organization</li>\n</ul>\n\n<strong>WHO IS NICE-MATTERSIGHT</strong>\n<br>\nHave you ever spoken with someone and felt as though you just clicked? The magical feeling you get is the result of a personality connection. NICE-Mattersight creates that feeling every day, in call centers and companies around the world, through a unique suite of enterprise software solutions.\n<br><br>\nWe have analyzed over a billion interactions for leading healthcare, travel and hospitality, financial, insurance, tech, telecom, utilities and other clients, and built more than 10 million (and counting) behavioral algorithms that leverage a world-renowned personality model. The resulting products help employees and customers have smoother, faster, more productive conversations with each other—in short, better chemistry."}