{"job title": "Sr. Data Scientist", "company": "Nielsen", "city state": "– Needham, MA", "rating": "3.6", "job description": "<div><strong>Senior Data Scientist</strong>\n<br><br>\n<strong> (Job Location: Waltham, MA) – 28729</strong>\n<br><br>\nFounded in 1923, Nielsen is the global authority on the consumer. We help over 20,000 clients, from Coca-Cola to Walmart to Apple to Disney, in 105 countries understand consumers and grow their businesses, every day. The company is organized into two areas: What Consumers Watch, serving media, telecom and tech industries; and What Consumers Buy, serving consumer goods, retail, financial services and automotive industries.\n<br><br>\n<strong>In this role, you will be responsible for:</strong>\n<br><br>\nResponsible for developing and prototyping new technology (including software applications, application platforms and systems infrastructure) to support data collection, research and analysis for the Data Science department: Define Proof of Concepts (PoCs), collaborating across multiple teams to gain consensus, interface with vendor technical leads, drive to success criteria (i.e., guide the project, pilot, or PoC towards meeting the defined set of goals that determine whether or not the outcome is a success, and ensuring that all options are exhausted to try to achieve a successful outcome), and roll out the policies and governance guidelines, instructions for use, and access to technology to the Data Science solution framework. Develop and document new technologies. Support the proliferation of open source tools and Cloud infrastructure within the Data Science department. Evolve the Data Science software development life cycle (SDLC) to incorporate code review best practices, and continuous integration/continuous delivery (CI/CD) workflows. Lead and support solutions architecture for the Platform and Tools group, including requirements gathering, code/module design, infrastructure design, architecture/process design, and SDLC best practices. Work with cross-functional teams to design, implement, and test new technologies and incorporate them into the SDLC. Design and develop platform-specific tools to lower barriers to entry and ease adoption of new technology. Lead troubleshooting and optimization efforts. Represent the Data Science department in the internal technology Center of Excellence (CoE – a group of subject matter experts across the company who lead the vision of a subject area meaning sharing experiences, dictating guidelines for future use, and paving the way for the particular subject matter to improve and evolve over time) across multiple organizations and externally at industry conferences. Guide developers in project design (software design and architecture to design how engineers should develop their codebase and architecting where this code interacts with other projects and infrastructure across the company) and best practices by dictating the guidelines that all data scientists/engineers on the projects would follow when developing code or managing infrastructure. Oversee (without supervisory authority) up to 15 analysts and data scientists for project execution and training in the use of new technologies or applications such as Python, R, AWS, Azure, and Spark by preparing and delivering training materials in collaboration with colleagues. Tools and technologies used: Python, Spark, SAS, SAS administration, AWS/Azure Cloud, and Git/Bitbucket.\n<br><br>\n#LI-DNI #IND-DNP\n<br><br>\n<strong>FOR THIS ROLE, WE ARE LOOKING FOR INDIVIDUALS THAT HAVE:</strong>\n<br><br>\nMinimum Requirements:\n<ul>\n<li>Master’s degree in computer science, engineering, management information systems, (bio)informatics or a related field with a strong quantitative focus (such as statistics or mathematics) (foreign equivalent degree acceptable), plus 2 years of experience in data engineering (the development and maintenance of data pipelines, data warehouses, and data lakes) and/or software development (would also accept a bachelor’s degree plus 5 years of post-baccalaureate, progressively responsible experience).</li> <li>This must include:\n<br>\n<strong></strong><ul><strong></strong><li><strong>2 years of experience in:</strong>\n\n<ul>\n<li>developing code, data science statistical and machine learning models, and software applications with Python and Spark;</li><li>designing and architecting technology solutions within the Hadoop ecosystem;</li><li>working with AWS/Azure;</li><li>leading Cloud migration projects;</li><li>developing infrastructure as code; and</li><li>coaching developer teams.</li></ul></li>\n\n<strong></strong><li><strong>1 year of experience in:</strong>\n\n<ul>\n<li>utilizing Git workflows within a team.</li></ul></li>\n</ul>\n</li>\n</ul>\nInvolves the opportunity to telecommute within commuting distance from Waltham, MA office, as feasible. Must be willing to travel internationally and domestically up to 2 trips per year, for up to 1 week per trip.\n<br><br>\n<em>Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.</em>\n<br><br>\n<strong>JOB TYPE</strong>: Regular\n<br><br>\n<strong>PRIMARY LOCATION</strong>: North America-US-Waltham, MA\n<br><br>\n<strong>ORGANIZATION</strong>: Technology and Engineering\n<br><br>\n<strong>SCHEDULE</strong>: Full-time\n<br><br>\n<strong>SHIFT:</strong> Day\n<br><br>\n<strong>TRAVEL:</strong> Yes</div>"}