{"job title": "Data Scientist", "company": "Nielsen", "city state": "– New York, NY", "rating": "3.6", "job description": "<strong>Data Scientist - 28724</strong>\n<br><br>\nAnalytics - USA New York, New York\n<br><br>\n<strong>The Nielsen Marketing Cloud is the leading provider of data technology powering the digital marketing ecosystem. Our customer data cloud™ provides the industry’s only unified customer profiles, which connect identities across all channels and devices – including display, video, audio, offline, mobile and smart TVs – enabling marketers to engage individuals and households with personalized messages to drive performance at scale. The Nielsen Marketing Cloud's data marketplace is the largest 3rd-party cross-device data set in the world with over 5B unique users and devices.</strong>\n<br><br>\n<strong>Nielsen brings to bear the market’s most powerful proprietary data assets, and together we are helping the world’s biggest brands make better and faster marketing and media decisions, we are permanently disrupting the landscape of audience measurement. For more information, please visit nielsen.com, or follow us: @Nielsen.</strong>\n<br><br>\n<strong>This opportunity is on the Data Science team of one of the most dynamic big data companies. The marketing cloud team has built a thriving business by accumulating thousands of data points about the online consumer.</strong>\n<br><br>\n<strong>This hands-on position reports to the Manager, Data Science, NMC Global and will take a leading role in the creation of sophisticated algorithms and data mining strategies designed to maximize the value of our data, all while playing an instrumental role in the development of eXelate’s data &amp; DMP related products and services.</strong>\n<br><br>\n<strong>Job Responsibilities:</strong>\n\n<ul>\n\n\t\n<li><strong>Play a leading role in the use of sophisticated algorithms and data mining strategies</strong></li>\n\n</ul>\n\n\n\n<ul>\n\n\t\n<li><strong>Significantly contribute to the development of eXelate’s data-related products and services</strong></li>\n\n<li><strong>Execute the company’s data mining and modeling activities in support of our clients’ online targeting and digital media marketing goals</strong></li>\n\n<li><strong>Develop and maintain ongoing data exploratory analyses against internal and client-provided data</strong></li>\n\n<li><strong>Support the business teams to solve complex analytical challenges</strong></li>\n\n<li><strong>Conduct studies, tests and use advanced data mining and modeling techniques to build solutions that optimize the quality and performance of the company’s data</strong></li>\n\n</ul>\n<strong>Requirements:</strong> (E=Essential, P= Preferred)\n\n<ul>\n\n\t\n<li><strong>E: Minimum of 3+ years relevant analytics and data mining &amp; modeling work experience</strong></li>\n\n<li><strong>E: Proven ability to develop and productionalize sophisticated data mining &amp; modeling solutions</strong></li>\n\n<li><strong>E: Working experience with relational database management system (RDBMS) and a strong knowledge of SQL</strong></li>\n\n<li><strong>E: Expert level knowledge of Python, R, Spark (SAS and/or SPSS are insufficient)</strong></li>\n\n<li><strong>E: Advanced degree in statistics, computer science, or machine-learning related fields required</strong></li>\n\n<li><strong>E: Strong English and communication skills; experience collaborating with and presenting to internal and external stakeholders</strong></li>\n\n<li><strong>E: Passion for analyzing and extracting meaning and utility from large data sets</strong></li>\n\n<li><strong>E: Good vibes, integrity, and good work ethic</strong></li>\n\n<li><strong>P: In depth knowledge of the advanced techniques and tools common to the data science world such as sparkML, Scikit-learn, Apache Giraph or Mahout</strong></li>\n\n<li><strong>P: Experience in marketing analytics, including marketing response modeling and customer segmentation, or experience in online media and the adtech ecosystem is advantageous</strong></li>\n\n</ul>\n<strong>About Nielsen:</strong>\n<br><br>\nNielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.\n<br><br>\nBy integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&amp;P 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com\n<br><br>\n<em>Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.</em>\n<br><br>\n<strong>Job Type:</strong> Regular\n<br><br>\n<strong>Primary Location</strong>: New York,New York\n<br><br>\n<strong>Secondary Locations:</strong> , , ,\n<br><br>\n<strong>Travel:</strong> Yes, 10% of the Time"}