{"job title": "Data Scientist / Tampa, FL / $75.00HR", "company": "Nigel Frank International", "city state": "– Tampa, FL", "rating": "3.0", "job description": "Data Scientist / Tampa, FL / $75.00HR\n<br><br>\nAre you serious about advancing your career, stuck in a dead end job, current project stalling, or simply just in need of change? If this is sounds like you, we need to speak. We're currently looking to fill multiple IT positions in your market.\n<br><br>\nPosition Details:<br><br>Provide advanced analytics expertise for developing and supporting predictive models and other analytic algorithms. Will demonstrate technical expertise and work in partnership with business analysts, product managers, communication experts, clinicians and others to seek answers to key business questions through application of machine learning, statistical analysis and data mining techniques.\n\n\n<ul>\n<li>Use healthcare payment, operational and clinical data and external data sets to create predictive algorithms to gain insights.</li>\n<li>Automate existing models and metrics to track production performance.</li>\n<li>Synthesize analysis and results into compelling story lines, and communicate findings.</li>\n<li>Evangelize the power of analytics and machine learning to improve business and operations.</li>\n<li>Performs other duties as assigned.</li>\n</ul>\n\n<strong>Education:</strong>\n\n\n<ul>\n<li>Required A Bachelor's Degree in Computer Science or Engineering, Information Systems, Applied Mathematics, Statistics, Operations Research or related</li>\n<li>Preferred A Master's Degree in a related field Computer Science or Engineering, Information Systems, Applied Mathematics, Statistics, Operations Research or related</li>\n</ul>\n\n<strong>Candidate Skill Requirements:</strong>\n\n\n<ul>\n<li>Required 3 years of experience in Data Science, Analytics, Statistics or comparable quantitative position</li>\n<li>Preferred 2 years of experience in Healthcare</li>\n<li>Advanced Other Deep understanding of machine learning and data mining techniques including but not limited to algorithms for NLP, image analysis, regression and classification.</li>\n<li>Advanced Demonstrated interpersonal/verbal communication skills</li>\n<li>Intermediate Demonstrated written communication skills</li>\n<li>Intermediate Ability to work as part of a team</li>\n<li>Advanced Ability to work in a fast paced environment with changing priorities</li>\n<li>Intermediate Other Familiarity with Big Data technologies</li>\n<li>Advanced Other Passion and ability to surface insights from large data sets and build a data-driven narrative</li>\n<li>Intermediate Other Experience working with large volumes of data using variety of statistical tools and techniques</li>\n<li>Advanced Other Ability to understand complex business problems and break down analytics projects into a structured approach</li>\n<li>Advanced Other Knowledge of data sources, tools, statistical principles and methodologies, and techniques</li>\n<li>Required Advanced Other Proven experience in Data Science toolsets such as Anaconda, Spark, Tensorflow, R, Python or similar</li>\n<li>Required Advanced Other Experience manipulating data in SAS, SQL, R, Python, Scala or similar</li>\n<li>Required Intermediate Other Big Data technologies such as Hadoop, Greenplum</li>\n<li>Required Intermediate Other Statistical tools such as SPSS, SAS, ScyPy, etc.)</li>\n<li>Required Intermediate Microsoft Excel</li>\n<li>Preferred Intermediate Microsoft Project</li>\n<li>Preferred Beginner Other Reporting Tools (Tableau, Cognos, D3)</li>\n<li>Preferred Intermediate Microsoft Visio</li>\n</ul>\n\nIf interested, please send your resume to Austin Curtis at a.curtis@frgconsulting.com, or contact me by phone at (813)-437-6908\n<br><br>\nFRG Consulting is the global leader for niche IT recruitment, advertising more Technology jobs than any other agency. We deal with both Partners &amp; End Users throughout North America. By specializing solely in placing niche IT candidates in the market I have built relationships with most of the key employers in North America and have an unrivalled understanding of where the best opportunities and jobs are.\n<br><br>\nI understand the need for discretion and would welcome the opportunity to speak to any IT candidates that are considering a new career or job either now or in the future. Confidentiality is of course guaranteed. - provided by Dice\n<br><br>\ndata modeling, data virtualization, blob storage, performance optimization, Java, HSRP, CCNA, CCNP, CLOUD, GLBP, CISCO, MDM constructs, Informatica, Ab Initio, SSIS, Oracle, BI, SQL, DataStage"}