{"job title": "Data Engineer", "company": "Nike", "city state": "– Beaverton, OR", "rating": "3.9", "job description": "Become a Part of the NIKE, Inc. Team\n<br><br>\nNIKE, Inc. does more than outfit the world's best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At Nike, it?s about each person bringing skills and passion to a challenging and constantly evolving game.\n<br><br>\nNike Technology designs, creates and implements the methods and tools needed to make the world?s largest sports brand run faster, smarter and more securely. Global Technology teams aggressively innovate the solutions needed to help employees navigate Nike's rapidly evolving landscape. From infrastructure to security and supply chain operations, Technology specialists drive growth through top-flight hardware, software and enterprise applications. Simply put, without Nike Technology, there are no Nike products.\n\n\n<ul>\n<li>*Description**</li>\n</ul>\n\nNike does more than outfit the world?s best athletes. We are\n<br>\na place to explore potential, obliterate boundaries, and push out the edges of\n<br>\nwhat can be. We?re looking for people who can grow, think, dream and create. We\n<br>\nthrive in a culture that embraces diversity and rewards imagination. We seek\n<br>\nachievers, leaders and visionaries. At Nike, it?s about bringing what you have\n<br>\nto a challenging and constantly evolving game.\n<br><br>\nNike Technology brings together technology and process expertise to create\n<br>\nvalue for the consumer. We deliver\n<br>\none-stop, integrated process and technology capabilities that enable Nike,\n<br>\nInc.'s businesses and brands worldwide. Our focus is on providing Lean\n<br>\nsolutions that eliminate waste, maximize consumer value, and drive profitable\n<br>\nbusiness growth.\n<br><br>\nThe Technology Operations Information &amp; Analytics Team provides reporting,\n<br>\ninformation, and data driven solutions that support informed decision making\n<br>\nacross operational and executive levels of our organization. As our _Data Engineer_ ,\n<br>\nyou will be joining the team to support existing work, engage with customers,\n<br>\nand help us to enable future state. Your willingness to learn from others, be\n<br>\nproactive, and solve problems will contribute directly to your success.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nTo make\n<br>\nit clear, we're not looking for just anyone.\n<br>\nWe're looking for someone special, someone who had these experiences and\n<br>\n<strong>clearly demonstrated these skills:</strong>\n<br><br>\n+ Willingness to learn, both independently andfrom others\n<br><br>\n+ Requirements intake, working with customers,scheduling meetings, and executing on deliverables\n<br><br>\n+ Understand requirements and use your expertiseto transform them into valuable solutions\n<br><br>\n+ Work with the team to understand architecture\n<br><br>\n+ Work with multiple data sets / sources and theirteams to enable necessary work\n<br><br>\n+ Partner with other teams and stakeholders,building key relationships\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n+ Bachelor?s degree in CIS, Computer Science, orInformation Technology\n<br><br>\n+ SQL Proficiency (1+ years)\n<br><br>\n+ Java Proficiency (1+ years)\n<br><br>\n+ Python and SSIS experience preferred, but notrequired\n\n\n<ul>\n<li>*Still Interested?**</li>\n</ul>\n\nTo\n<br>\nensure that we continue to hire competent, ethical and trustworthy individuals,\n<br>\nall candidates must successfully complete a thorough background investigation\n<br>\nprior to receiving any offer of employment from Nike.\n<br><br>\nHave\n<br>\nwe piqued your interest? Good, then a generous benefits package will only\n<br>\nsweeten the deal. We offer a stock purchase plan, 401(k), a casual work\n<br>\nenvironment, and a host of other perks we don't have room to mention here.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\nTo make\n<br>\nit clear, we're not looking for just anyone.\n<br>\nWe're looking for someone special, someone who had these experiences and\n<br>\n<strong>clearly demonstrated these skills:</strong>\n<br><br>\n+ Willingness to learn, both independently andfrom others\n<br><br>\n+ Requirements intake, working with customers,scheduling meetings, and executing on deliverables\n<br><br>\n+ Understand requirements and use your expertiseto transform them into valuable solutions\n<br><br>\n+ Work with the team to understand architecture\n<br><br>\n+ Work with multiple data sets / sources and theirteams to enable necessary work\n<br><br>\n+ Partner with other teams and stakeholders,building key relationships\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\n+ Bachelor?s degree in CIS, Computer Science, orInformation Technology\n<br><br>\n+ SQL Proficiency (1+ years)\n<br><br>\n+ Java Proficiency (1+ years)\n<br><br>\n+ Python and SSIS experience preferred, but notrequired\n\n\n<ul>\n<li>*Still Interested?**</li>\n</ul>\n\nTo\n<br>\nensure that we continue to hire competent, ethical and trustworthy individuals,\n<br>\nall candidates must successfully complete a thorough background investigation\n<br>\nprior to receiving any offer of employment from Nike.\n<br><br>\nHave\n<br>\nwe piqued your interest? Good, then a generous benefits package will only\n<br>\nsweeten the deal. We offer a stock purchase plan, 401(k), a casual work\n<br>\nenvironment, and a host of other perks we don't have room to mention here.\n<br><br>\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\n<br><br>\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.\n\n\n<ul>\n<li>*Job ID:** 00420454</li>\n<li>*Location:** United States-Oregon-Beaverton</li>\n<li>*Job Category:** Technology</li>\n</ul>"}