{"job title": "CONTRACT - Data Scientist (NTD)", "company": "Nintendo of America", "city state": "– WA-Redmond", "rating": "3.7", "job description": "<p><b>Nintendo Technology Development</b> </p>\n<p> </p>\n<div>\n<p>The worldwide pioneer in the creation of interactive entertainment, Nintendo Co., Ltd., of Kyoto, Japan, manufactures and markets hardware and software for its Nintendo Switch™ system and the Nintendo 3DS™ family of portable systems. Since 1983, when it launched the Nintendo Entertainment System™, Nintendo has sold more than 4.5 billion video games and more than 710 million hardware units globally, including Nintendo Switch and the Nintendo 3DS family of systems, as well as the Game Boy™, Game Boy Advance, Nintendo DS™ family of systems, Super NES™, Nintendo 64™, Nintendo GameCube™, Wii™ and Wii U™ systems. It has also created industry icons that have become well-known, household names, such as Mario, Donkey Kong, Metroid, Zelda and Pokémon. A wholly owned subsidiary, Nintendo of America Inc., based in Redmond, Wash., serves as headquarters for Nintendo’s operations in the Americas. For more information about Nintendo, please visit the company’s website at http://www.nintendo.com</p>\n<p> </p>\n<p><em><strong>**This is a CONTRACT position</strong></em></p>\n<p> </p>\n<p> </p>\n<p><b>DESCRIPTION OF DUTIES</b></p>\n<p><strong></strong> </p>\n<p>We are seeking a talented data scientist to help improve Nintendo’s gaming devices. The role will focus on applying data mining techniques to the vast amount of data collected from Nintendo devices in the field to help improve the performance and reliability of our gaming devices. The hire will collaborate with domain experts in different technology areas to understand problem spaces. He/She will do end-to-end analysis, including experiment design, data gathering, processing, analysis, presenting results, and making recommendations. </p></div>\n<ul>\n<li>Develop statistical algorithms for large data sets</li>\n<li>\n<div>Apply machine learning and recommendation systems techniques for digital marketing use-cases</div></li>\n<li>\n<div>Design A/B testing experiments, and do end-to-end data analysis </div></li>\n<li>\n<div>Effectively communicate with other teams, and tell stories with data</div></li>\n<li>\n<div>Collaborate with other engineering and business teams to support project needs</div></li></ul>\n<div><b>SUMMARY OF REQUIREMENTS</b></div>\n<ul>\n<li>\n<div>Experience with statistical analysis and algorithm development, data mining, and machine learning</div></li>\n<li>\n<div>Experience with Python/R and SQL</div></li>\n<li>\n<div>Excellent communication and collaboration skills</div></li>\n<li>\n<div>Masters degree in a relevant field</div></li>\n<li>\n<div>2 years of relevant work experience</div></li></ul>\n<p> </p>\n<p><em><strong>**This is a CONTRACT position</strong></em></p>\n<p> </p>\n<div>\n<div>We are an equal opportunity employer of individuals with disabilities and protected veterans....valuing diversity…celebrating strengths.<br><br></div></div>"}