{"job title": "Data Engineering", "company": "NJF Global Holdings", "city state": "– Chicago, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for an experienced Data Engineer to join their team in Chicago. The Data Engineering team is a new team tasked with building the next generation of data ingestion, processing and storage frameworks. You will be working directly with business customers to understand their processing needs and building solutions that can be repurposed across the entire organization. Team members will come up with creative solutions on tight deadlines to real world business problems that will have a significant impact to the business successes. As such, individual engineers will see and feel significant impact and responsibility.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Design, build and support the data storage and processing platforms</li>\n<li>Conduct proof of concept studies on new data technologies</li>\n<li>Build monitoring and alarming systems for production data services</li>\n<li>Build self-service tools for application teams, such as schema migration tools, data cataloging systems, etc.</li>\n<li>Design hardware and cloud infrastructure to run supported products.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Hands-on experience with some new database technologies, e.g. Cassandra, Riak, VoltDB, Druid, Vertica</li>\n<li>Some development experience - preferably in Python, Java or golang</li>\n<li>Heavy automation/DevOps background</li>\n<li>Experience running production services</li>\n<li>Excellent communication skills</li>\n<li>Ability to work in high pressure environment</li>\n</ul>\n<strong>Nice to have:</strong>\n<ul>\n<li>Experience building production Big Data services, e.g. Spark, Hadoop</li>\n<li>Experience running, administering, or conducting performance-tuning of MS SQL Server or Vertica</li>\n<li>Deep understanding of relational vs unstructured data</li>\n<li>Strong Python skills</li>\n<li>Experience working on public or private cloud infrastructure, e.g. AWS, Google, Openstack or Azure, especially their database offerings</li>\n<li>Running databases on public or private cloud infrastructure</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Bachelor’s degree or equivalent experience, preferably in engineering and/or computer science</li>\n</ul>\nIf you would like to be considered for the position of Data Engineer or wish to discuss it further please leave your details below. Your resume will be held in confidence until you connect with a member of our search team</div>"}