{"job title": "Investment Data Scientist", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is seeking an expert of Statistics for the role of Investment Data Scientist. This role will be based in New York.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Serve as expert statistician/data scientist on discretionary investment team</li>\n<li>Test research hypotheses and assumptions of portfolio manager and investment analysts by designing methodology and writing necessary code to perform back-testing, cross-validation, event studies, Bayesian data analysis, etc.</li>\n<li>Test and identify the most predictive and robust statistical, machine learning, and deep learning methods to forecast factors, features, metrics, drivers, etc. relevant to portfolio manager and investment analysts in making investment decisions</li>\n<li>With guidance from and in collaboration with portfolio manager and investment analysts help select relevant data sets</li>\n<li>Work closely with team’s data engineer/systems developer to help specify best sources, format, and delivery mechanism of data</li>\n<li>Write efficient, modular, and dependable code, packages, libraries, and scripts</li>\n<li>Ensure code is written so it is easily understood by teammates when reviewing</li>\n<li>Document all work extensively and train teammates on use of work products (e.g., custom Python libraries or R packages)</li>\n<li>Work closely with team’s data engineer/systems developer and portfolio manager to design research (e.g., backtesting software) and production (e.g., trade file creation) processes</li>\n<li>Collaborate regularly with firm’s Big Data group and other firm resources</li>\n<li>Stay abreast of new research in statistics, machine learning, and deep learning</li>\n</ul>\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>3+ years of working experience in a role that requires advanced statistical analysis</li>\n<li>Advanced degree in quantitative discipline (or 6+ years of full-time work experience using advanced statistical analysis)</li>\n<li>Be an expert in statistics (e.g., doctoral level) including time-series analysis</li>\n<li>Have strong programming skills in SQL/NoSQL and at least one of the following Python, R, or C++</li>\n<li>Good communication skills</li>\n</ul>\n<br><br>\n<strong>Education:</strong>\n<ul>\n<li>PhD in Statistics</li>\n</ul>\nIf you would like to be considered for the position of Investment Data Scientist or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}