{"job title": "Sector Data Analyst", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is seeking a Sector Data Analyst to join their New York office.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>The role will involve supporting between 6-8 portfolio managers with investment research. This will involve attending meetings with portfolio managers and working closely with them in order to develop investment strategies which are based on new types of data such as unstructured data.</li>\n<li>The data sets available are numerous and often not organized so some ETL experience is required.</li>\n<li>This role is part investment researcher and part data scientist and will involve developing data mining and visualization methods to analyze and track (publically available, non-traditional and often unstructured data) in order to predict company fundamentals (such as revenue, earnings, supply chains) before they are quarterly announced).</li>\n<li>As part of this, your role will explore new data sets to see if they can predict company fundamentals. If a signal is proven it will be used for investment decision making.</li>\n<li>The objective is not complex analysis, it is to develop insights that work and to find specific signals in noise.</li>\n</ul>\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>An analytical and data driven thinker with economic, financial intuition and business acumen.</li>\n<li>The ability to acquire, clean and merge data with Python.</li>\n<li>Ability to work with ambiguity: originated simulation and cohort analysis methodology</li>\n<li>A strong interest and desire to identify and monitor trends and patterns found in alternative datasets.</li>\n<li>A deep interest and desire to work in a sector aligned investment team.</li>\n<li>Strong stats-data analysis and programming skills in the following (Python and Numpy, Scipy, Scrapy and Excel)</li>\n<li>Strong database and data manipulations skills in SQL or NoSQL databases</li>\n</ul>\n<br><br>\nIf you would like to be considered for the position of Sector Data Analyst or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>\n<br>"}