{"job title": "Market Data Analyst", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for an experienced Market Data Analyst to join them in New York. The successful candidate will join the data curation and analytics team. The ideal candidate needs to possess working knowledge of vendor data feeds (such as Thomson Reuters, Bloomberg etc). You must also be willing to work and deal with uncertainty, work in an environment where the scope of work could change very rapidly. This is a challenging role where the candidate will come in contact with trading, surveillance and research teams across the firm.\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>Good understanding of financial markets, market data , trading , quant and hedge fund space</li>\n<li>Ability to performing complex searches within data sets (such as Thomson Reuters and Bloomberg) to determine structure of the data and availability of key indicators.</li>\n<li>Be able to identify differences in structure of various market data sources including identifying any key data attributes that might be missing.</li> \n\n<li>Understanding of market data workflows from various vendors.</li>\n<li>Serve as a key team member on complex strategic projects to ensure high quality deliverables and project recommendations.</li>\n<li>Help manage the mapping and scripting of master data flows through internal systems. Help ensure these data sets are being utilized properly in internal client applications.</li> \n\n<li>Proactively looks to improve the data infrastructure and processes, from data acquisition, through data quality and governance, to data visualization.</li>\n<li>Help identify new data sets that could be acquired or created on top of existing data sets.</li> \n\n<li>Possess high degree of adaptability and creative thinking.</li>\n</ul>\n<strong>Nice to have:</strong>\n<ul>\n<li>Familiarity with Python or other scripting languages.</li> \n\n<li>Familiarity with Unix is a plus.</li>\n</ul>\nIf you would like to be considered for the position of Market Data Analyst or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}