{"job title": "Quantitative Research Platform Engineer", "company": "NJF Global Holdings", "city state": "– Chicago, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is seeking a Quantitative Research Platform Engineer to join their Chicago office. The successful candidate will help in creating the next generation of the research platform. This team develops and optimizes the compute, cloud, and big data systems required to tackle wicked quantitative research problems at global scale.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Move massive quantitative workloads into a software-defined hybrid cloud they are creating.</li>\n<li>Write the software that seamlessly scales the environment in response to elastic and unpredictable demands.</li>\n<li>Deep dive into cloud-scale scheduling and data locality problems to optimize the environment and get things done faster</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>3+ years’ experience either: A) in a Systems/DevOps/Site Reliability Engineer role, or B) as a distributed systems developer</li>\n<li>Deep knowledge of the Linux operating system</li>\n<li>Experience automating complex environments and the accompanying tooling</li>\n<li>Highly productive in one or more of Java, Python, C++, Javascript, or Ruby</li>\n<li>String communication skills: positive collaboration with colleagues, organizing and managing ones tasks, and delivering quality work on time</li>\n</ul>\n<strong>Nice to have:</strong>\n<ul>\n<li>Experience in large compute environments such as: high-performance compute (HPC) clusters, university or lab scientific grids, or hyper-growth Cloud deployments</li>\n<li>Have used modern automation, configuration management, and container tooling such as Terraform, Puppet, Docker, Kubernetes, etc.</li>\n<li>Experience with tracing systems like Zipkin or OpenTracing or streaming platforms like Kafka, Storm, or HBase to monitor and analyze distributed environments</li>\n<li>Have managed sizable production workloads in one or more public cloud providers</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Master’s degree in a technical, engineering, or quantitative field, or equivalent experience</li>\n</ul>\nIf you would like to be considered for the position of Quantitative Research Platform Engineer, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}