{"job title": "Data Scientist/Quant Researcher", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>\n<div>Our client is searching for an experienced Data Scientist to join them in their New York office. The successful candidate will join a quantitative trading team managing systematic equity strategies. The team focuses on non-latency sensitive investment opportunities across geographies. The team is responsible for the complete lifecycle of quantitative investment process; research, development, and trading of systematic strategies. The team strongly emphasizes cutting edge innovative scientific research, and is looking to add an individual who is enthusiastic about contributing within a team environment.</div><br>\n\n<div><strong>Responsibilities:</strong></div><div>\n\n<ul>\n<li>Research, design and implement new quantitative trading strategies. This will entail generating alphas from a variety of traditional and alternative datasets using rigorous statistical methods.</li>\n<li>Build a deep understanding of the underlying datasets and be able to apply the latest scientific algorithms for statistical model development.</li>\n<li>Using the team’s custom research infrastructure for simulation, back-testing, and validation of the proposed models.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Exposure to Natural Language Processing and/or High-Performance Computing is a plus;</li>\n<li>Publications in top tier Journals focusing on any of the above topics is a plus;</li>\n<li>Strong programming skills with the ability to explore large datasets required;</li>\n<li>Excellent written and verbal communication skills to report research results/methodologies required;</li>\n<li>The preferred candidate should have at least 2-3 years of working experience within a quantitative trading/research role;</li>\n<li>Experience with quantitative investment research in Medium Frequency Trading and/or Equity Markets is required</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>MS/PhD in a technical discipline with a focus on Statistics, Optimization, Machine Learning, Artificial Intelligence, Quantitative Finance or related fields</li>\n</ul>\nIf you would like to be considered for the position of Data Scientist or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>\n</div>"}