{"job title": "Data Scientist, Tagging/ Classification", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for a Data Scientist to work in their New York office. The firm firm focuses primarily on discretionary long/short equity investing and makes significant quantitative and macro investments.If you want to join a world-class investment management organization that operates in a fast-paced, dynamic environment and rewards talent with recognition and increased responsibility, then this is the right opportunity for you.\n<br><br>\n<strong>Key Responsibilities</strong>\n<ul>\n<li>Obtain a solid fundamental knowledge into Big Data research, gaining high level exposure to multiple facets of the business including sourcing, processing, analyzing and distribution of large data inputs</li> \n\n<li>Query SQL and NoSQL databases</li> \n\n<li>Assess data quality and the appropriateness of quantitative models and their limitations</li> \n\n<li>Run scripts and other machine learning tools on unstructured and / or raw data to extract insights</li> \n\n<li>Use BI and other tools to understand trend inflections and flag data integrity issues</li> \n</ul>\n<strong>Skills and Qualifications</strong>\n<ul>\n<li>Level of experience: 4 years – 10 years’ experience</li>\n<li>Technical skills (C++, Java, Python, Statistical Modeling, SQL/NoSQL)</li>\n<li>Have a strong statistical background. The position requires data mining / manipulation of data sets to extract timely, meaningful and impactful insights.</li> \n\n<li>MS or PhD degree in a quantitative/ technical field from top tier university</li>\n<li>Programming languages (C++, Java, Python)</li> \n\n<li>Statistical modeling (R, SPSS, SAS)</li>\n<li>Strong SQL and NoSQL experience</li> \n\n<li>Ability to think creatively</li>\n<li>Ability to traverse big picture as well as finer detail</li>\n</ul>\n<strong>Must have:</strong>\n<ul>\n<li>Ability to exhibit “grit” in tackling challenges, working through impasses and thinking creatively</li> \n\n<li>Self-sufficient and able to work independently</li> \n\n<li>A strong desire to learn, particularly new methods in data science such as in machine learning and natural language processing</li> \n</ul>\nIf you would like to be considered for the position of Data Scientist, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team.</div>"}