{"job title": "Data Scientist - Investment Research", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for an experienced Data Scientist to join them in New York. They use a range of modeling techniques to generate financially-relevant predictions feeding into the firm’s systematic investment management platform, they measure the performance and impact of the predictions in a variety of settings, and further distill economic insights and thematic analyses from the data &amp; observations.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Design &amp; implement granular domain-specific indicators from data, relating them to company, industry, and macroeconomic factors.</li>\n<li>Contribute to the design of investing strategies on economic predictions through multiple investing paradigms.</li>\n<li>Manage requirements for a set of dependent data products derived from a large portfolio of integrated data feeds.</li>\n<li>Contribute to data sourcing strategy across multiple industry data verticals supporting their prediction efforts.</li>\n<li>Generate a series of economic insights research reports relating trends in the indicators &amp; predictions to investment themes.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>1-5+ years of experience in applied data analysis &amp; prediction, preferably in an industry setting</li>\n<li>Demonstrably strong data science modeling intuition and feature engineering creativity</li>\n<li>Expertise in applying statistical techniques for time-series measurement/estimation and prediction</li>\n<li>Intimate familiarity with the potential flaws &amp; fallacies in the applications of specific statistical methods</li>\n<li>Experience specifying &amp; managing requirements for datasets leveraged in your analyses</li>\n<li>Working knowledge of SQL and common data science toolkits: Python, R, Spark, Matlab</li>\n<li>Strong written &amp; verbal communication and presentation skills, with experience crafting a compelling narrative supported by data</li>\n<li>A portfolio of open-data analyses or data-driven research publications would be ideal</li>\n</ul>\nIf you would like to be considered for the position of Data Scientist, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}