{"job title": "Senior Data Scientist, Analytics and Advertising", "company": "NJF Global Holdings", "city state": "– Connecticut, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for an experienced Senior Data Scientist to join them in their Connecticut.\n<br><br>\nResponsibilities:\n<ul>\n<li>Using available data to address business questions or concerns. If a question requires additional data, work with engineers to create the required data.</li>\n<li>Serving as a resource for senior business (internal) customers, educate the firm on methodologies and define firm data requirements.</li>\n<li>Using data to develop and present recommendations on improving advertising ROI, measuring client profitability or answering business questions on optimizing marketing spend.</li>\n<li>Use data mining, model building or other analytical techniques to develop and maintain client segments.</li>\n<li>Help quantify the client lifecycle, and identify predictive factors for acquisition, retention and turnover.</li>\n<li>Lead the definition and implementation of ads quality metrics and user experience metrics.</li>\n</ul>\nRequirements:\n<ul>\n<li>10+ years experience doing quantitative analysis or statistical modeling</li>\n<li>Highly proficient in spoken and written English</li>\n<li>Knowledge in at least one of the following areas: predictive modeling, machine learning, experimentation methods</li>\n<li>Experience extracting and manipulating large datasets</li>\n<li>Development experience in any scripting language (PHP, Python, Perl, etc.)</li>\n<li>Knowledge of at least one modeling framework (e.g., SciKit Learn, TensorFlow, SAS, R, MATLAB)</li>\n</ul>\nEducation:\n<ul>\n<li>MS degree in a quantitative discipline (e.g., statistics, operations research, econometrics, computer science, applied mathematics, physics, electrical engineering, industrial engineering) or equivalent experience.</li>\n</ul>\nIf you would like to be considered for the position of Senior Data Scientist or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}