{"job title": "Quantitative Researcher, Equity Investment Research", "company": "NJF Global Holdings", "city state": "– San Francisco, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for an experienced Quantitative Researcher to join their team in San Francisco. As a member of the quantitative team you will tackle some of the toughest problems; test numerous well-formed hypotheses to arrive at precise conclusions to generate superior performance.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Conducting research and statistical analyses in the evaluation of securities</li> \n\n<li>Working with large data sets to predict and test statistical market patterns</li>\n<li>Conceptualizing strategies and developing/continuously improving proprietary tools using the highest of software design standards</li>\n<li>Novel ways of measuring and attributing performance to be directly used in identifying and implementing performance maximizing ideas</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>A background demonstrating strong analytical &amp; quantitative problem solving skills, including but not limited to Engineering, Statistical Modeling, Computer science or similar independent research.</li> \n\n<li>3+ year hands on experience in areas equities alpha research, risk/return attribution, transaction cost analysis, portfolio research or other similar areas.</li> \n\n<li>3+ year programming experience scripting in Python/Perl/Shell, Statistical language R and compiled languages C/C++ or other similar languages in a Linux environment.</li>\n<li>A commitment to excellence and rigorous attention to detail</li>\n<li>Been identified as a key contributor of ideas and output by former colleagues and employers</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Bachelor’s degree in relevant field required; MS / PhD preferred</li>\n</ul>\nIf you would like to be considered for the position of Quantitative Researcher or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}