{"job title": "Quantitative Research Lead", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is looking for a senior Quantitative Researcher to lead the company’s Quantitative Strategies Group in New York. The Research Lead will be responsible for driving the research agenda and guiding ongoing R&amp;D projects. The ideal candidate will have experience leading a QR team and/or agenda at a sophisticated trading firm. You should be able to demonstrate an ability to formulate, test, and implement research ideas quickly and robustly.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Drive the research agenda with a view to meeting medium-term trading and business objectives</li>\n<li>Manage development of research tools and applications for processing market data</li>\n<li>Direct alpha research geared towards high-volume and scalable strategies</li>\n<li>Oversee and implement strategy code to monetize findings on both sides of the order book</li>\n<li>Contribute to ongoing R&amp;D efforts for wide-ranging initiatives the team undertakes</li>\n<li>Develop and test data-centric theories aimed at understanding intraday liquidity dynamics</li>\n</ul>\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>Proficiency in C++ with demonstrable experience building large-scale production applications</li>\n<li>Proficiency in advanced data research &amp; modeling using Python and/or R</li>\n<li>Extensive knowledge and expertise designing statistical inference models and predictive analytics</li>\n<li>Extensive knowledge and experience with high-volume, high-dimensional data modeling</li>\n<li>Extensive knowledge and understanding of software engineering principles and practice</li>\n<li>Demonstrable experience leading teams, projects, and timely execution of business objectives</li>\n<li>PhD in Applied Math, Statistics, ML, Computer Science/Engineering, Physics or similar would be desired</li>\n<li>Prior experience managing quantitative trading portfolios at a reputable hedge fund or trading firm would be desired</li>\n<li>Deep insights into global financial exchange micro-structure and micro-behavior would be desired</li>\n<li>Prior experience managing or implementing Equities and/or Futures Statistical Arbitrage or HFT would be desired</li>\n<li>Experience originating alpha/strategy development in an unprecedented environment or scale would be desired</li>\n<li>Experience propelling firm-level innovation, intellectual breakthroughs, and business growth would be desired</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Graduate degree in Applied Math, Statistics/ML, Computer Science/Engineering, or similar</li>\n</ul>\nIf you would like to be considered for the position of Quantitative Research Lead or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>\n<br>"}