{"job title": "Quantitative Researcher / Strategy Developer", "company": "NJF Global Holdings", "city state": "– Chicago, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is an industry leading proprietary trading company based in Chicago that specializes in quantitative model based trading strategies. They are seeking highly talented quantitative researchers with an entrepreneurial spirit to join the strategy research team. They offer their employee’s a team environment where you can learn from leaders in the field and have the opportunity to utilize your talents for rapid career growth.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Working collaboratively with senior quantitative research analysts to develop an understanding of complex financial markets, products, and strategies</li>\n<li>Analyzing financial market data to identify patterns and potential opportunities</li>\n<li>Developing forecasts and building predictive and profitable trading models</li>\n<li>Employing in-house tools to perform strategy exploration and optimization</li>\n<li>Evolving trading strategies and methodologies to improve current systems</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Problem solvers who are driven, self-motivated, and think creatively</li>\n<li>Three or more years of experience in a related field or industry</li>\n<li>Strong problem solving and math skills and attention to detail</li>\n<li>Programming skills and understanding of basic programming concepts. Experience with C/C++</li>\n<li>Desire and interest in advancing machine learning within the trading industry</li>\n<li>Excellent written and spoken communication skills</li>\n<li>Must be motivated, dependable, and responsible</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Bachelors, Masters, or PhD in a quantitative field (Mathematics, Statistics, Physics, Engineering, Computer Science)</li>\n</ul>\nIf you would like to be considered for the position of Strategy Developer, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}