{"job title": "AltData Quantitative Researcher", "company": "NJF Global Holdings", "city state": "– California, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>One of the leading Quantitative Hedge Funds is looking for a Quantitative Researcher/Developer to join a small team based In Berkeley. The selected candidate will work in a collaborative environment and will be constantly learning on the job, innovating, and working directly with external vendors.\n<br><br>\n'Big data' is at the core of the business and the firm is looking for someone who enjoys working with complex and large scale datasets. You will apply techniques from machine learning, text analytics, NLP, computer vision and applied statistics to extract signals from large unstructured and semi-structured data sources.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Import data from the vendors, clean and store the data</li>\n<li>Work with a variety of non-tabular/numerical data sources. Help to make sense of this data and extract economic information out of non-financial data sources</li>\n<li>Build tools that will help automate the cleaning process of the data</li>\n<li>Onboard new data sources and maintain external vendor relationships</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>BS, MS, or PhD in Natural Language Processing, Computer Science, or equivalent work experience</li>\n<li>5 years experience working with production data systems, machine learning techniques, natural language processing and programming</li>\n<li>Strong Natural Language Processing experience</li>\n<li>Programming language agnostic, but preference for Python and Java</li>\n<li>Experience with Hadoop or other frameworks for working with distributed data</li>\n<li>Experience with Amazon Web Services (AWS) or Google Cloud is a plus</li>\n</ul>\nIf you would like to be considered for the position of Natural Language Processing Quant Researcher, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}