{"job title": "Quantitative Research &amp; Development Associate", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for a junior quant to join the Quantitative Strategies Group. This team seeks to identify pricing and volume dynamics in electronic markets. Insights gleaned about liquidity and market micro-behavior are used to model the price discovery process.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Build research tools and applications for processing and examining market data</li>\n<li>Perform alpha research geared towards high-volume and scalable strategies</li>\n<li>Implement strategy code to monetize findings on both sides of the order book</li>\n<li>Design and implement R&amp;D solutions for wide-ranging initiatives the team undertakes</li>\n<li>Develop and test data-centric theories aimed at understanding intraday liquidity patterns</li>\n<li>Debug, modify, and enhance in-house technologies, systems, and processes</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Proficiency in C++ including modern OOP for building scalable production applications</li>\n<li>Proficiency in suitable data research &amp; modeling language: Python, R, and possibly Matlab</li>\n<li>Firm grasp of data structures and algorithms and knowledge of their computational tradeoffs</li>\n<li>Knowledge and experience with developing robust statistical/ML models on numerical data</li>\n<li>Knowledge and understanding of software &amp; data engineering principles and practice</li>\n<li>Experience working with Linux and Windows in a production environment</li>\n</ul>\n<strong>Nice to have:</strong>\n<ul>\n<li>Automated trading experience</li>\n<li>A graduate degree in a relevant technical field</li>\n<li>Knowledge of financial markets and trading</li>\n<li>Latency-sensitive programming and optimization</li>\n<li>Large-scale data processing and familiarity with distributed computing</li>\n<li>Demonstrable experience working on large production C++ systems (10k+ lines of code)</li>\n<li>Demonstrable experience developing statistical learning algorithms in production use</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Undergraduate degree (or higher) in Computer Science/Engineering, Statistics/ML, or similar</li>\n</ul>\nIf you would like to be considered for the position of Quantitative Researcher or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}