{"job title": "Data Scientist", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for an experienced Data Scientist to join their team in Singapore. This group is responsible for the timely delivery of comprehensive and error-free data to some of the most demanding and successful systematic Portfolio Manager in the world. You will be joining a small team Data Scientists who play a vital role in ensuring the smooth day-to-day implementation of a large research infrastructure, and the live production trading of billions of dollars of capital across global capital markets, including equities, futures, options and other financial instruments.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Identification of new data sets</li>\n<li>Engaging with vendors to understand characteristics of datasets</li>\n<li>Building processes and technology tools to ingest, tag and clean datasets</li>\n<li>Analysis of datasets to generate descriptive statistics and propose potential applications of data</li>\n<li>Research of potential “alpha signals” for presentation to Portfolio Managers</li>\n<li>Monitoring and enhancing the automated data collection and cleansing infrastructure</li>\n<li>Research on new technologies for improved data management and efficient retrieval</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>At least 1 year of experience as a Data Scientist, quantitative researcher or in a similar role</li>\n<li>Experience working with large data sets, including classification, regression, distribution analysis, and predictive modeling</li>\n<li>Experience applying statistical tests to large data sets</li>\n<li>Programming skills in SQL, TSQL, SQL Server or PL-SQL</li>\n<li>Programming skills in Python and at least one of C#, C++, or Java</li>\n<li>Financial industry experience preferred but not required</li>\n<li>Experience dealing with intraday, tick and order book data a plus</li>\n<li>Strong problem solving skills</li>\n<li>Intellectual curiosity and a love of learning</li>\n<li>Attention to detail and a love of process</li>\n<li>Strong oral and written communication skills</li>\n</ul>\n<strong>Education</strong>\n<ul>\n<li>Ph.D. in computer science, mathematics, physics, statistics or another disciplines involving rigorous quantitative analysis techniques</li>\n</ul>\nIf you would like to be considered for the position of Data Scientist, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}