{"job title": "Data Engineer - Equities Data Engineer", "company": "NJF Global Holdings", "city state": "– New York, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for an experienced Data Engineer to join them in New York. This team is at the forefront of big data, stream processing and building cutting-edge tools and techniques. They have a direct impact on profitability of the firm by enabling competitive investment decisions through modern and highly scalable data acquisition and processing pipelines. High value is placed on the exchange of ideas, creativity and innovation, and they are seeking passionate technologists who thrive in an impactful, and fast-paced environment.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Understand business challenges and drive technical solutions</li>\n<li>Partner with investment professionals and data analysts/scientists to define priorities and deliver custom solutions</li>\n<li>Build robust, fault-tolerant data pipelines to cleanse, transform, enrich and model acquired data</li>\n<li>Acquire data from vendors, APIs or website scraping for analysis</li>\n<li>Enhance and extend data pipeline platforms and frameworks to accelerate data delivery</li>\n<li>Integrate data and insights into models, reports and the investment process</li>\n<li>Measure, analyse, and improve internal data quality</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li>Expertise in more than one programming languages such as Java, Scala, JavaScript, Python, R, or similar</li>\n<li>Strong database programming expertise and strong SQL skills</li>\n<li>Strong personal drive and evidence of entrepreneurial initiative</li>\n<li>Great communication skills, both written and verbal</li>\n<li>Strong Linux and broad computer science expertise</li>\n</ul>\n<strong>Nice to have:</strong>\n<ul>\n<li>Web data scraping experience</li>\n<li>Vertica, Greenplum, Redshift, BigQuery, Mongo, ElasticSearch, Hadoop experience</li>\n<li>AWS experience including EMR</li>\n<li>Machine learning and real-time preditive model execution platforms</li>\n<li>Jupyter and Anaconda</li>\n<li>PySpark and Zeppelin</li>\n<li>Data Warehousing and Modeling expertise</li>\n<li>Tableau, BI Tools, Excel</li>\n<li>Large scale text analytics processing</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Minimum Bachelor’s degree in Computer Science or related field</li>\n</ul>\nIf you would like to be considered for the position of Data Engineer, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}