{"job title": "Quantitative Research Developer", "company": "NJF Global Holdings", "city state": "– Chicago, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is searching for an experienced Quant Developer to join their Chicago office. You will be comfortable with C/C++ and at least one higher level language. It would also be preferable to have experience with distributed computing, functional programming and higher level problem solving and system architecture.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Trading and management of quant research team driven equity portfolios.</li>\n<li>Development of automated hedging &amp; portfolio optimization systems.</li>\n<li>Building simulation environments for back-testing portfolio optimization scenarios.</li>\n<li>Tie together research from different quant research groups to a production quality solution.</li>\n<li>Analysis and validation of research results and input data</li>\n<li>Research and attribution of portfolio performance and driving factors.</li>\n<li>Conduct research and statistical analyses to evaluate various financial data.</li>\n<li>Research models for risk / return improvement.</li>\n</ul>\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>C++, R, SQL/databases, any scripting languages, Linux environments</li>\n<li>Barra like multi-factor risk models</li>\n<li>Portfolio optimization</li>\n<li>Statistics strong foundation (linear regression models, matrix algebra, summary statistics and interpretation of time series data)</li>\n<li>Interest in software design and architecture</li>\n<li>Strong communication skills to collaborate with multiple individuals across teams</li>\n<li>Familiarity with usage of distributed computing (cloud, usage of farms, data storage like MongoDB, Cassandra, Spark etc) considered a plus</li>\n<li>Statistical modelling (Advanced regression models, Monte Carlo, PCA) would be a plus</li>\n<li>Machine learning would be a plus</li>\n<li>5+ years of experience in similar roles is a plus</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Degree in Computer Science or related field</li>\n</ul>\nIf you would like to be considered for the position of Quantitative Research Developer, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>\n<br>"}