{"job title": "Data Team Lead", "company": "NJF Global Holdings", "city state": "– California, United States", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\n <div>Our client is looking for a Data team lead to join their office in California. You will lead a team focused on managing data engineering efforts across the organization.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Create systems to manage all external data feeds, ensuring timeliness, availability, reliability, and correctness</li>\n<li>Build standardized data interfaces that allow for querying across diverse data sets while enforcing safeguards</li>\n<li>Build high availability systems to supply data to both analytical and live trading systems</li>\n<li>Implement data versioning standards to support research workflows</li>\n<li>Develop algorithms to address data abnormality, corruption, and gaps</li>\n<li>Design back-end data storage architectures</li>\n<li>Manage data cleaning and post-processing as well as synchronization and backups</li>\n<li>Develop expertise in procuring data and own vendor relationships</li>\n</ul>\n<br><br>\n<strong>Requirements:</strong>\n<ul>\n<li>At least five years of work experience, including in a team lead role</li>\n<li>Design expertise in large-scale data infrastructure and service-oriented architecture</li>\n<li>Demonstrated history delivering data to heterogeneous applications using modern tools</li>\n<li>Experience developing in a Linux environment with a focus on scalability, concurrency, and correctness using programming languages such as Python, Go, C/C++, and Java</li>\n<li>Track record of building research infrastructure, interacting with data scientists, and/or working on machine learning problems (preferred)</li>\n<li>Authorization to work in the United State</li>\n</ul>\n<strong>Education:</strong>\n<ul>\n<li>Bachelor’s degree in computer science or related technical field</li>\n</ul>\nIf you would like to be considered for the position of Data Team Lead or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team</div>"}