{"job title": "Data Scientist (Seasonal)", "company": "Noblis", "city state": "– US-VA-Reston", "rating": "4.0", "job description": "<div><div>\n<div>Apply experience working in the Intelligence Community on teams working in any of the fields related to Data Science such as: Information Retrieval, Text Analysis, Data Mining, Machine Learning, Intelligence Analysis, Cyber Threat Analysis, Image Analysis, Network Security, Statistical Modeling, Geo-spatial analytics, and Data Munging and Cleaning. Ability to work with datasets of different sizes and formats across multiple databases.\n<br><br>\nApply knowledge and experience with specific techniques such as: neural networks, cluster analysis, feature engineering, extraction, and reduction, web-scraping, decision trees (CART), collaborative filtering, geo-spatial analysis.\n<br><br>\nCompile results and deliver presentations to senior-level leadership. Strong communication skills and ability to present material to audiences of differing technical aptitude.\n<br><br>\nHighly Desired: R, R-shiny, R-studio, Pythin, Sci-kit, Tensorflow, Intelligence Community Experience, Machine Learning, Statistical modeling,</div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div>REQUIRED\n<ul>\n<li>1 years experience with data manipulation, analytic tools, and data visualization Algorithm development and adaptation from open-source, Visualization development (e.g., ggplot2, Tableau, d3.js, Highcharts). Up to 7 years preferred.</li><li>Experience with: PCAP data, Elastic Search, Hadoop, HDFS, git, Spark, MLLib, SQL</li><li>OS Experience/ WIndows</li><li>Required: Linux/ Windows</li><li>TS/SCI with Polygraph</li>\n</ul>\nDESIRED\n<ul>\n<li>Experience with multi-TB dataset manipulation, cleaning, querying and modeling. scikit-learn, tensorflow, R-caret. Experience curating datasets for supervised and unsupervised machine learning methods.</li><li>C, Java, R, Javascript, PhP,MatLab ,Pig, Hive, Impala, PySpark, Scala,Ruby</li><li>Windows / OS X Experience</li>\n</ul>\n</div>\n</div>\n</div>\n\n<br>Overview<br>\n\n<div>\n<div>\n<div>Noblis and our wholly owned subsidiary, Noblis ESI, are solving difficult problems that help our government and our country. We bring the best of scientific thought, management, and engineering expertise with a reputation for independence and objectivity. We support a wide range of government and industry clients in the areas of national security, intelligence, transportation, healthcare, environmental sustainability, and enterprise engineering. Learn more at noblis.org/about.\n<br><br>\nWhy work at a Noblis company?\n<br>\nOur employees find greater meaning in their work and balance the other things in life that matter to them. Our people are our greatest asset. They are exceptionally skilled, knowledgeable, team-oriented, and mission-driven individuals who want to do work that matters and benefits the public.</div>\n</div>\n</div>\n<br>"}