{"job title": "Sr. Operations Research Scientist - Supply Chain/Logistics/Transportation", "company": "Nordstrom", "city state": "– Seattle, WA", "rating": "3.6", "job description": "<strong>Job Description</strong><br><br>Nordstrom is a fashion specialty retailer founded on a simple idea: offer each customer the best possible service, quality, value and selection. At Nordstrom, providing great customer service goes beyond the selling floor. It takes a team of individuals with different talents and skills to continuously improve service and our results. Our Advanced Analytics team works in partnership with other areas of the Company to develop insights, algorithms, and data products that support decision making, products, and technologies used throughout Nordstrom. When you join our team, you are welcomed into a family dedicated to create memorable and rewarding shopping experiences for our customers.\n<br><br>\nThis is an Senior level data scientist role focusing on the area of Operations Research and Supply Chain Optimization. The ideal candidate is a creative and passionate problem-solver who thinks big, acts quickly, and is motivated to develop new approaches to optimize Nordstrom’s supply chain using quantitative and cutting-edge technology.\n<br><br>\nThe ideal candidate is a creative, collaborative and passionate problem-solver who thinks big, acts quickly, and is motivated to develop new approaches to optimizing Nordstrom’s business using quantitative techniques and cutting-edge technology.\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Engage broadly with the business to frame, structure and prioritize business problems where analytic projects or tools can have the biggest impact on Nordstrom’s business</li><li>Perform Data Analysis on large scale data sets (involving Millions of rows of data) in the context of retail and supply chain operations.</li><li>Perform large-scale optimization and statistical research, analysis, and modeling in the areas of web analytics, supply chain optimization, and forecasting</li><li>Communicate insights and recommend areas for further data discovery</li><li>Design optimization algorithms, working with colleagues to develop and deploy useful data products and data driven software as required</li>\n</ul>\n<strong>Basic Qualifications</strong>\n<ul>\n<li>Ph.D. Degree in Operations Research and/or Industrial Engineering</li><li>4+ years of professional Operations Research experience.</li><li>2+ years of experience with optimization software such as Gurobi, CPLEX, or Xpress.</li><li>2+ years of experience interfacing with senior business leaders to drive bottom line improvements.</li><li>Curiosity to discover hidden insights in large volumes of retail and supply chain data to identify actionable items.</li><li>Experience using SQL in a variety of RDMS environments</li> <li>Proficient in Programming Tools such as Python, C++ etc.</li><li>Fluency with statistical and machine learning algorithms such as decision trees, neural networks, collaborative filtering, clustering, survival analysis, graph theory, etc.</li><li>Knowledge and experience working with cloud computing solutions such as AWS, Azure</li><li>Knowledge of visualization tools such as Tableau, d3.js, Shiny</li><li>Excellent written and verbal communication skills</li>\n</ul>\n<strong>Preferred Qualifications</strong>\n<ul>\n<li>Hands-on work experience in applying Optimization/Statistics in solving supply chain problems such as network planning, transportation, inventory optimization, and/or forecasting highly preferred.</li><li>Experience defining and delivering projects in a timely manner from concept to accomplishing end results</li><li>Experience in developing Machine Learning Applications is a plus.</li><li>Experience in Deploying Operations Research/Machine Learning methodologies in a production environment.</li><li>Experience teaching and mentoring Scientists is a plus.</li><li>Experience working with NoSQL data environments and tools such as Hadoop, Spark, DynamoDB is a plus</li>\n</ul>\nSince 1901, Nordstrom has offered a wide variety of quality apparel, shoes and accessories for men, women and children at our stores across the country. We're proud to be named to Fortune™ magazine's list of '100 Best Companies to Work For.' We believe this recognition comes from our desire to empower our employees to set their sights high and deliver exceptional service to customers.\n<br><br>\nAs a Nordstrom employee, you can feel confident that your health and well-being are among our highest priorities. We offer a comprehensive, flexible employee benefits package that includes medical/vision and dental coverage, a generous merchandise discount, an employer-matched 401(K) savings and profit sharing plan and much more.\n<br><br>\nWe are an equal opportunity employer committed to providing a diverse environment.\n<br><br>\nThe above information has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.\n<br><br>\n<strong>We’ve got you covered…</strong>\n<br><br>\nOur employees are our most important asset and that’s reflected in our benefits. Nordstrom is proud to offer a variety of benefits to support employees and their families, including:\n<ul>\n<li>Health</li><li>Retirement</li><li>Time Off</li><li>Merchandise Discount</li><li>Lifework / EAP resources</li>\n</ul>\nA few more important points...\n<br><br>\nThe job posting highlights the most critical responsibilities and requirements of the job. It’s not all-inclusive. There may be additional duties, responsibilities and qualifications for this job.\n<br><br>\nNordstrom will consider qualified applicants with criminal histories in a manner consistent with all legal requirements.\n<br><br>\nApplicants with disabilities who require assistance or accommodation should contact the nearest Nordstrom location, which can be identified at www.nordstrom.com.\n<br><br>\nBy applying, you agree to our Nordstrom Careers Privacy Policy\n<br><br>\n© 2018 Nordstrom, Inc.\n<br><br>\nCurrent Nordstrom employees: To apply, log into Workday, click the Careers button and then click Find Jobs."}