{"job title": "Data Scientist", "company": "Northern Trust", "city state": "– United States, Tempe", "rating": "3.7", "job description": "<div><div><div><div><div>Are you excited about exploring hidden relations in data? Do you have a passion for training a machine to make good decisions? Northern Trust, a leader in the banking industry is looking for a Data Scientist to join the Engineering Monitoring Group’s Data Analytics Team. In this role you will be involved with using tools and technology to implement solutions that enable software system to recommend or automate data-driven decisions. This role will require the ability to perform both exploratory Data Science work as well as develop explanatory solutions and implement reactive autonomous systems.\n<br><br>\nResponsibilities:\n<br><br>\nThis role will work on the Infrastructure Data Analytics Team to create solutions which increase stability, create clarity, and reduce the operational costs of highly visible applications and software systems for Northern Trust. These solutions require the use of Big Data tools such as Splunk, ELK, and Hadoop, as well as integration with tools such as Service-Now. In order to succeed at this role a candidate should have the ability to understand modern techniques for data analysis which include but are not limited to:\n<br><br>\nUnderstanding Of:\n\n<ul>\n<li>Infrastructure components (e.g. VMs, Servers, Routers, Network Switches, Accelerators, etc.)</li> \n\n<li>Proven Diagnosis and Tuning experience, with Applications or Infrastructure Components</li> \n\n<li>Automation Tools and Techniques</li> \n</ul>\nExposure to / Plus:\n\n<ul>\n<li>Data Science tools (e.g. Splunk ITSI, Splunk Machine Learning Toolkit, Splunk Visualiztion, etc.)</li> \n\n<li>Data transformation and Conformal Mapping/Decomposition</li> \n\n<li>Statistical Analysis with R, Matlab, Octave, or other scripting language</li> \n</ul>\n\n<div>\n\n\n<ul>\n<li>7+ years of experience.</li> \n\n<li>Proven quick self-directed learner</li> \n\n<li>BA or BS in Math, CS, Engineering, Physics, or a Quantitative Science</li> \n\n<li>5+ years in an IT Infrastructure Engineering Role</li> \n\n<li>Knowledge of a Statistics and how to apply it to Infrastructure Data Ability to code in an Object Oriented Language such as Java or C++</li> \n\n<li>Ability to code in a Functional Paradigm such as Scala or Go Lang</li> \n\n<li>Ability to code in a scripting language such as SPL, Python or others</li> \n\n<li>Exposure to the areas of AI, ML, and Data Science with an ability and desire to grow.</li> \n\n<li>Good communication skills</li> \n\n<li>Team Player</li> \n</ul>\nFor more than a century, Northern Trust has worked hard building our legacy of outstanding service, expertise and integrity. From a Chicago-based bank founded in 1889, we now have more than 20 international locations and 16,500 employees globally. We serve the world’s most-sophisticated clients – from sovereign wealth funds and the wealthiest individuals and families, to the most-successful hedge funds and corporate brands.\n<br><br>\nWe burnished our reputation as a global leader delivering innovative investment management, asset and fund administration, fiduciary and banking solutions enabled by sophisticated, leading technology. And through it all, we continually laid a solid, forward-looking foundation on which future generations can continue growing and achieving greater.\n<br><br>\nAs of March 31, 2018, Northern Trust Corporation had:\n\n<ul>\n<li>$10.8 trillion in assets under custody/administration</li> \n\n<li>$8.1 trillion in assets under custody</li> \n\n<li>$1.2 trillion in assets under management</li> \n\n<li>$130 billion in banking assets</li></ul></div>\n</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}