{"job title": "Senior Scientist Bioanalytics", "company": "Novartis Group Companies", "city state": "– Morris Plains, New Jersey", "rating": "3.4", "job description": "<strong>Job Description</strong>\n<br><br>\n<strong>Job Description</strong>\n<br>\n<strong>PURPOSE</strong>\n<br>\nCoordinate and execute all activities to ensure the timely testing and release of all samples, collaborate with team in the design and execution of validation and other major projects. Provide employees with training and resources to meet or exceed customer requirements. Monitor processes and products to identify opportunities for continuous improvement. Serve as the subject matter expert on specific areas and techniques and proactively provides education technical knowledge and skills to less experienced scientists.\n<br>\n<strong>RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Perform Bioanalytical testing in support of clinical and commercial release strategies.</li>\n<li>Acts as liaison for other departments in support of non-standard testing regimes</li>\n<li>Executes and leads non-standard studies/projects as required</li>\n<li>Document results within electronic and paper based systems accordingly.</li>\n<li>Execute and supervise peer review of analytical data and archiving in lab documenta-tion systems.</li>\n<li>Support and manage tracking and trending systems, and programs which assist in the testing, evaluation and monitoring of quality, assay performance and efficiency.Train other associates in specific areas of competency.</li>\n<li>Ensure assigned analytical methods are ready to be performed when required includ-ing management of reagent and equipment inventory</li>\n<li>Ensures cleanliness of laboratory working areas</li>\n<li>Perform daily equipment startup, shutdown and equipment calibration/PQ (when re-quired)</li>\n<li>Supports external teams in qualifying new and/or replacement equipment within the laboratory</li>\n<li>Drives execution of method qualification/development &amp; optimization/transfer as gov-erned by protocols and/or under the supervision of senior lab staff.</li>\n<li>Draft under supervision protocols compliant with ICH and NVS expectations</li>\n<li>Draft presentations as required</li>\n<li>Contribute, supports and lead writing of OOS/OOE/OOT and deviation investigations.</li>\n<li>Drives designing CAPA outcomes</li>\n<li>Supports laboratory management in drafting analytical response/strategy docu-ments.</li>\n<li>Assists and supervises equipment and metrology teams in troubleshooting equipment issues</li>\n<li>Revise and/or create SOPs, forms, laboratory test records as required using appro-priate electronic systems.</li>\n<li>Follows GxP quality policies and procedures.</li>\n<li>Drives 5S and Lean projects.</li>\n<li>Support internal and external audits of facility as a recognized SME.</li>\n<li>Supports laboratory management in scheduling activities</li>\n<li>Takes on non-standard duties (i.e. HS &amp; E representative)</li>\n<li>Mentors and supports junior staff members</li>\n<li>Ensures all assigned training is completed within required time frame.</li>\n<li>Work on shifts covering daytime / evening and one or both weekend days.</li>\n<li>Performs other job duties as assigned.</li>\n</ul>\n\nMinimum requirements\n<br>\nBS or MS in Cell biology Immunology, Molecular biology, virology, biochemistry, microbiology or other related science. Prefer advanced degree\n\n\n<ul>\n<li>Minimum of 5 years experience in the pharmaceutical/Biotechnology industries conducting QC testing, release testing and coordinating the activities of a QC laboratory.</li>\n<li>Thorough knowledge of cGxP expectations</li>\n<li>Knowledge of ICH, Eur. Ph., USP and FDA and JP guidelines.</li>\n<li>Thorough general knowledge of bioassay test methods (e.g. Elisa, Flow cytometry, qPCR, cell culture)</li>\n<li>SME level knowledge of a particular area of bioanalytical testing</li>\n<li>Experience using LIMS systems</li>\n<li>Experienced in writing OOS/OOE/OOT and/or deviation investigations</li>\n<li>Knowledge of LIMS systems.</li>\n<li>Experience in supporting internal and/or external laboratory audits</li>\n<li>Advanced written and verbal communication skills</li>\n<li>Advanced experience in the use of computer based systems and applications associated with bioanalytical testing</li>\n</ul>\n\nThe Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status."}