{"job title": "Oncology Data Scientist", "company": "Novartis", "city state": "– Cambridge, MA", "rating": "3.7", "job description": "<br><b>Posting Title</b><br>Oncology Data Scientist<br><br><b></b><br>14-Aug-2018<br><br><b>Job ID</b><br>244128BR<br><br><b>Job Description</b><br>Novartis Institutes for BioMedical Research, Inc. (NIBR) is seeking a computational biologist / bioinformatics analyst to join the Novartis Oncology Bioinformatics Team. Oncology Bioinformatics provides computational biology expertise to the department, from target ID through clinical development, for both targeted and immune therapies. We work at the cutting edge of science to solve important challenges in biomedical research, making use of both publicly available and internally generated unique and expansive preclinical and clinical datasets. The successful candidate will be highly motivated, creative, and an effective collaborator.<br>Responsibilities will include:<br>• Pioneering and implementing artificial intelligence solution to biological problems<br>• Working closely with wet- and dry-lab collaborators to analyze and interpret biomedical imaging data.<br>• Supporting translational biology, model characterization, and data mining efforts to solve unmet medical needs.<br>• Implementing and developing state-of-the-art computational methods and data mining strategies to address key challenges in oncology drug discovery (e.g. drug resistance, difficult-to-drug targets, harnessing anti-tumor immunity).<br>• Formulating testable hypotheses, and collaborating in the design of rigorous experiments.<br><br><b>Minimum requirements</b><br>• Ph.D. in computational biology, statistics, computer science, biomedical informatics, biological engineering, or a related field<br>• Experience with current analysis methods for AI, particularly deep learning. Experience with convolutional neural networks and frameworks such as Keras or Tensorflow is a plus.<br>• Experience with computer vision and image analysis software such as OpenCV<br>• Experience analyzing medical imaging data. Experience with digital pathology (H&amp;E, IHC) and/or radiology preferred<br>• Familiar with fundamental concepts in molecular biology, statistics, and bioinformatics<br>• Fluency in one or more programming languages. Python is a plus.<br>• Experience with statistical methods for mining ‘omics data (genomics, epigenetics, proteomics) and/or NGS data preferred<br>• Knowledge of cancer genomics, immunology / immune-oncology, clinical and translational science preferred<br><br><b>Job Type</b><br>Full Time<br><br><b>Country</b><br>USA <br><br><b>Work Location</b><br>Cambridge, MA <br><br><b>Functional Area</b><br>Research &amp; Development <br><br><b>Division</b><br>NIBR <br><br><b>Business Unit</b><br>Oncology NIBR <br><br><b>Employment Type</b><br>Regular <br><br><b>Company/Legal Entity</b><br>NIBRI<br><br><b>EEO Statement</b><br>The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status.<br>"}