{"job title": "Senior Data Scientist", "company": "Novetta", "city state": "– Herndon, VA", "rating": "3.6", "job description": "<div>\n \n <p>\n\n\n</p>\n\n<p>Are you passionate about solving challenging problems?</p>\n\n<p>Do you thrive being a critical part of an elite team of like-minded people?</p>\n\n<p>How would you like for your next career move to take you to the next level?</p>\n\n<p>If any of this sounds appealing, look no further.</p>\n\n<p> </p>\n <p> </p>\n\n<p><strong>Job Description:</strong></p>\n\n<p>Novetta has an exciting opportunity for a self-motivated and accomplished Computer Scientist to join our entity analytics team. You will work on complex projects involving data analysis, software engineering, and deploying software in a cloud computing environment. We are looking for a flexible problem solver with significant technical experience to join a team providing unique solutions for our customers and stakeholders.</p>\n\n<p> </p>\n\n<p><strong>In this role you will:</strong></p>\n\n<ul>\n\t<li>Analyze large amounts of data</li>\n\t<li>Deploy applications on a large-scale data processing cluster using AWS technologies</li>\n\t<li>Develop algorithms and visualization tools to help stakeholders understand their data and prioritize new data sources</li>\n\t<li>Develop and maintain tools to support operations and maintenance of production and development computing clusters</li>\n</ul>\n\n<p> </p>\n\n<p><strong>Basic Qualifications:</strong></p>\n\n<ul>\n\t<li>A Bachelor’s degree in computer science or related field and a minimum of 10+ years of experience; or a Master’s degree in computer science or related field and a minimum of 5 years of experience; </li>\n\t<li>Experience in : software development/engineering including requirements analysis, software development, installation, integration, evaluation, enhancement, maintenance, testing and problem diagnosis/resolution</li>\n</ul>\n\n<ul>\n\t<li>Software development <u>or analytics</u> experience on Windows and/or Linux-based systems in Python or shell scripting or JavaScript</li>\n</ul>\n\n<p> </p>\n\n<p><strong>Desired Skills:</strong></p>\n\n<ul>\n\t<li>Software development experience with Java, Python, or other modern programming languages</li>\n\t<li>Hands-on experience with other Hadoop ecosystem products, including but not limited to: Flume, Oozie, Hive, Hbase, and Hadoop Streaming</li>\n\t<li>Background in statistical analysis, machine learning, or data science</li>\n\t<li>Experience with entity resolution products or a background in data matching theory and technologies</li>\n\t<li>Experience developing applications in AWS</li>\n</ul>\n\n<p> </p>\n\n<p><strong>Security clearance:</strong></p>\n\n<ul>\n\t<li>Active TS/SCI with Polygraph is required to start</li>\n</ul>\n <p> </p>\n\n<p><strong>So what does Novetta do?</strong></p>\n\n<p>We focus on three core areas: Cyber, Entity, and Multi-Int Analytics. Our products are focused on processing and analyzing vast amounts of data in these core areas. Our services are focused on helping our customers move from complexity to clarity. At Novetta, we bridge the gap between what our customers think they can do and what they aspire to achieve.</p>\n\n<p><strong>Our culture is shaped by a commitment to our Core Values:</strong></p>\n\n<p><strong>Integrity:</strong> We hold ourselves accountable to the highest standards of integrity and ethics.</p>\n\n<p><strong>Customer Mission Success:</strong> Customer mission success drives our daily efforts—we strive always to exceed customer expectations and focus on mission success beyond contractual commitments.</p>\n\n<p><strong>Employee Focus:</strong> We value our employees and demonstrate our commitment to them by providing clear communications, outstanding benefits, career development, and opportunities to work on problems and technical challenges of national significance.</p>\n\n<p><strong>Innovation:</strong> We believe that innovation is critical to our success – that discovering new and more effective ways to achieve customer mission success is what makes us a great company.</p>\n\n<p> </p>\n\n<p>Get a referral bonus for the great people you know! With our amazing referral program, you could be eligible to win outstanding rewards for referring qualified new hires to Novetta.<br>\n<br>\n<b>Novetta is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.</b></p>\n </div>"}