{"job title": "Data Scientist", "company": "Novetta", "city state": "– Herndon, VA", "rating": "3.6", "job description": "<div>Are you passionate about solving challenging problems?\n<br><br>\nDo you thrive being a critical part of an elite team of like-minded people?\n<br><br>\nHow would you like for your next career move to take you to the next level?\n<br><br>\nIf any of this sounds appealing, look no further.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nSupport an intelligence program focused on automated multi-INT engines for predictive and augmented intelligence. Will work on multidisciplinary teams with data scientists, SWEs, and analysts.\n<br><br>\n<strong>Basic Qualifications:</strong>\n\n<ul>\n\n\t<li>Strong communication and presentation skills</li>\n<li>High levels of curiosity, creativity, and problem solving capabilities</li>\n<li>Experience with Python</li>\n<li>Experience with image classification and object detection using a deep learning library or framework, such as Keras, fastai, Tensorflow or PyTorch</li>\n<li>Ability to work both independently and collaboratively with a team</li>\n<li>Experience working in AWS environment</li>\n<li>Educational background in data science</li>\n<li>Bachelor’s degree in technical field such as physics, statistics, image science, computer science, or related field</li>\n</ul>\n<strong>Desired Skills:</strong>\n\n<ul>\n\n\t<li>Experience applying convolution neural networks to perform object detection in satellite imagery</li>\n<li>Experience with Spark clustered computing</li>\n<li>Experience supporting Intelligence Community</li>\n</ul>\n<strong>So what does Novetta do?</strong>\n<br><br>\nWe focus on three core areas: Cyber, Entity, and Multi-Int Analytics. Our products are focused on processing and analyzing vast amounts of data in these core areas. Our services are focused on helping our customers move from complexity to clarity. At Novetta, we bridge the gap between what our customers think they can do and what they aspire to achieve.\n<br><br>\n<strong>Our culture is shaped by a commitment to our Core Values:</strong>\n<br><br>\n<strong>Integrity:</strong> We hold ourselves accountable to the highest standards of integrity and ethics.\n<br><br>\n<strong>Customer Mission Success:</strong> Customer mission success drives our daily efforts—we strive always to exceed customer expectations and focus on mission success beyond contractual commitments.\n<br><br>\n<strong>Employee Focus:</strong> We value our employees and demonstrate our commitment to them by providing clear communications, outstanding benefits, career development, and opportunities to work on problems and technical challenges of national significance.\n<br><br>\n<strong>Innovation:</strong> We believe that innovation is critical to our success – that discovering new and more effective ways to achieve customer mission success is what makes us a great company.\n<br><br>\nGet a referral bonus for the great people you know! With our amazing referral program, you could be eligible to win outstanding rewards for referring qualified new hires to Novetta.\n<br><br>\n<strong>Novetta is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.</strong></div>\n<br>"}