{"job title": "Data Engineer", "company": "Novus Partners", "city state": "– Austin, TX", "rating": "4.5", "job description": "Novus is an innovative company that is changing the way the world invests. We are a high growth, disruptive technology firm bringing big data analytics to the alternative investment industry. Our platform enables investors to consistently maximize their performance potential through discovery of true investment acumen and risk, proprietary industry insights and expertise, and effortless data management and enlightenment.\n<br><br>\nWe are looking for a Data Engineer to join the team and play a critical role in the design and implementing of sophisticated financial data feeds that serve as the foundation of our platform.\n<br><br>\n<strong><u>Background</u></strong>\n<br><br>\nWe operate in an industry in which over $120 Trillion is invested annually on behalf pension / endowment / sovereign funds, and private investors / family offices. And yet, the lack of data intelligence and insight results in much of that money being invested based purely on historic track record, with little transparency into performance acumen and / or risk management. This is our challenge and our purpose: to help investors make better investments. And in doing so, we aim to provide the single network on which trusted professionals will engage, promote, and manage their business. In short, we want to help the world invest better. And we need you.\n<br><br>\n<strong><u>Role</u></strong>\n<br><br>\nYou will report directly to our Vice President of Engineering and be based in Austin.\n<br><br>\nThe Engineering team at Novus is a fast-paced group of individuals who are passionate about improving the way the world invests. The Data Engineer will work with vast amount of securities data from many sources, and portfolio data from prominent hedge funds, fund of hedge funds and some of the most sophisticated institutional investors.\n<br><br>\nResponsibilities around client data integration include:\n\n<ul>\n<li>Help lead a green-field redesign and implementation of industry-leading ETL</li>\n<li>Lead and coordinate development efforts with our international team</li>\n<li>Applying industry best practices for database development</li>\n<li>Maintaining and performance tuning database code</li>\n</ul>\n<strong><u>Culture</u></strong>\n<br><br>\nOur culture is critical to us. It's how we push ourselves every day to do better than the day before. We expect our team members to deliver on their responsibilities, understand how each and every component of our company works to generate success, and hold themselves and their colleagues accountable to the highest standards. As a result, we will enjoy talking to you if:\n\n<ul>\n<li>You are excited to solve problems you haven't seen before \"turning every page\" to understand the domain</li>\n<li>You can work independently removing roadblocks and answering your own questions</li>\n<li>You want to solve problems quickly to satisfy your users, to get feedback &amp; iterate, and to move onto the next problem</li>\n<li>You want to make an impact</li>\n</ul>\n<strong>Qualifications, Traits &amp; Experience</strong>\n\n<ul>\n<li>B.S. in Computer Science or related discipline from top university or college. Double major or minor in Economics or Finance a plus.</li>\n<li>Experience with Python is a huge plus</li>\n<li>Working experience with Microsoft SQL Server version 2008 R2 or higher</li>\n<li>Working experience in building ad-hoc T-SQL queries, stored procedures, views, and functions</li>\n<li>Working experience with ETL.</li>\n<li>Knowledge on definitions and parameters of financial instruments, e.g. equities, fixed incomes, options, futures, swaps, forwards, etc. is a plus</li>\n<li>Interest in investments and/or the fund of funds and hedge fund industry</li>\n</ul>"}