{"job title": "Data Scientist", "company": "NRG Systems ", "city state": "– Hinesburg, VT", "rating": "3.9", "job description": "<strong></strong><div><strong>\n</strong><div><strong>\nLocation:</strong>\n<br>\n Hinesburg, VT</div>\n\n<br><div>\nEmployment Type:\n<br>\n Full-Time</div>\n\n<br><div>\nSalary:\n<br>\n<br>\n Competitive</div>\n </div>\n\n<br><div>\nJob Description\n<br>\n <div>\n<strong>Key Focus</strong>\n<br><br>\nThe Data Scientist will support product development projects that require a solid background in engineering, statistical analysis, data comprehension and/or computer science. The position focuses on developing products or services for customers that might include such things as “big data” services, extracting knowledge from disparate data streams, understanding and detecting complex machine or sensor fault modes, and proposing prognostics solutions using large datasets and other tasks as needed.\n<br><br>\nThe Data Scientist will be involved in core algorithm development for NRG products, including those related to wind turbines and meteorological sensors. The scope of responsibility will include data analysis to support product conceptualization, product definition, product design and development, operational support, test and verification, and development of services for customers. The Data Scientist will also represent NRG Systems as appropriate to influence relevant industry and market decisions.\n<br><br>\nThe Data Scientist is a full-time position in the engineering department and reports to a Functional Engineering Manager. This person will work in partnership with NRG’s dynamic engineering team to achieve goals of the department that are in line with the company strategic plan, and will embrace the high standards of NRG ethics and core values.\n<br><br>\nJob Responsibilities\n\n\n<ul>\n<li>Data structuring and analysis of large data sets, including vibration and SCADA using statistics and machine learning methodology.</li>\n<li>Data cleaning, analysis, interpretation, integration and visualization for meteorology and/or wind energy field and research datasets using various statistical and machine learning tools.</li>\n<li>Code and data processing optimization, tool and GUI development for wind resources assessment products</li>\n<li>System fault feature/signature extraction based on expert domain knowledge on discrete signal/event analysis.</li>\n<li>Systems fault pattern recognition using new/existing features.</li>\n<li>Development of system requirements, test plans and installation procedures for new sensors and systems..</li>\n<li>Development of fault detection algorithms and models for new and existing sensors and systems.</li>\n<li>Design and test of new fault detection hardware and algorithms.</li>\n<li>Product idea innovation. • Technical presentations and papers for industry conferences.</li>\n<li>Technical presentations in support of marketing NRG products.</li>\n<li>Supporting the development of document content for NRG Systems’ global industry markets.</li>\n<li>Developing intellectual property for NRG Systems.</li>\n<li>Interfacing with Suppliers and Customers.</li>\n<li>Hands-on prototyping and field testing.</li></ul></div>\n\n\n</div>\n\n<br><div>\nRequirements\n<br>\n <div>\nThe candidate should have an M.S. degree in Meteorology, Electrical Engineering, Mechanical Engineering, Engineering Statistics or Computer Science with statistical analysis background.\n<br><br>\nA minimum of 3 years of academic or industrial experience.\n<br><br>\n<strong>Technical Skills:</strong>\n\n\n<ul>\n<li>Minimum of 3 years statistical analysis skills specialized in signal processing.</li>\n<li>Expert domain knowledge with MATLAB, and proficient with Python or R</li>\n<li>Strong data science skills in big data analysis, feature extraction, pattern recognition and machine learning</li>\n<li>Advanced statistical modeling capability of mechanical component degradation.</li>\n<li>In depth knowledge of wind turbine mechanical systems helpful.</li>\n<li>Experience in system design concepts, analysis and optimization • Proficiency with engineering design tools helpful.</li>\n<li>Familiarity with industry quality standards</li>\n<li>Experience in image processing helpful</li>\n</ul>\n\n\n\n<ul>\n\n \n<li>\n Proficient skill and experience in making technical presentations</li></ul>\n\n\n<ul>\n<li>Excellent communication skills and a team player</li>\n<li>Independence, self-direction • Ability to be innovative</li>\n<li>Ability to multi-task and meet deadlines</li></ul></div>\n\n\n</div>\n\n<br>"}