{"job title": "Data Science Intern", "company": "NT Concepts", "city state": "– Vienna, Virginia", "rating": "3.8", "job description": "NT Concepts is a national security solutions firm that likes to solve hard problems. Its our thing. We do that by working with some complex clients (youve heard of them) on their hardest challenges. Clients with massive, complex data sets. So we get to keep learning, building, and experimenting with the latest technologies. And since lifes too short to spend with difficult people, we hire team members that not only like to solve problems, but that we like to hang out with. Working on big data solutions is as much about the team you work with, as the data itself. Even more so, in our humble opinion.\n<br><br>\nOne of the most exciting parts of NT Concepts is our rapidly growing data-science team. Youll bring your skills to bear to solve complex problems, work on current and emerging technologies, and drive the future of our data science enterprise. We mostly focus on exploiting geospatial data of all types (because pictures and maps are fun!) with a sprinkling of Natural Language Processing (NLP). Weve also got some really cool technology partners that add tools to your toolkit.\n<br><br>\nWe love people who dream big, find data fascinating, and understand thats its not just about data: its about the science behind it, and how you can use it to solve real-world problems.\n<br><br>\n<strong>Is this job for a good fit for you?</strong>\n<ul>\n<li>You're a rising college junior or senior with a major that fits in well in the data science world</li><li>You want to be considered for a government security clearance and have a shot at follow-on internships and full-time employment.</li><li>Data science is a dynamic and evolving profession were looking for people who love to learn and find unique solutions without being micro-managed: youll have the freedom to try new things, test solutions and technologies, and tell us when theres a better path.</li><li>You know your way around a cloud console and have handled some pretty large volumes of data.</li><li>You are familiar with a few machine learning frameworks, like TensorFlow or PyTorch.</li><li>Maybe you have used enterprise products in the past for high throughput data ingestion and analysis.</li><li>Our office is Metro accessible and is located just across Route 7 from Tysons Corner Center where youll find great shopping, dining and entertainment options.</li>\n</ul>\nJob Type: Full-time\n<br><br>\nExperience:\n<ul>\n<li>Machine Learning: 1 year (Preferred)</li>\n</ul>\nLicense:\n<ul>\n<li>U.S Citizenship (Required)</li>\n</ul>"}