{"job title": "Data Scientist Architect", "company": "nThrive", "city state": "– , US", "rating": "2.6", "job description": "As a Data Science Architect in the Solutions Organization, you will be responsible for architecting, developing and maintaining custom Data Science solutions using Machine Learning and Natural Language Processing. As an Architect, you will be responsible for making key decisions about our industry-leading Patient To Payment software solution AI architecture and technology. Your applied research and development responsibilities will include assuring scalable designs, optimizing the software solutions you create, and mentoring your colleagues.\n<ul>\n<li>Work with development team and Product Management to support strategy, customer needs, and delivery of requirements in the form of completed products.</li><li>Design and deliver scalable platforms for Machine Learning, AI, and NLP solutions.</li><li>Develop new features; maintain and enhance existing functionality for Data Science solutions including machine learning, AI, and NLP.</li><li>Provide project level leadership; communicate and coordinate development activities with management and colleagues to ensure timely product delivery.</li><li>Exhibit consistent ownership of the products to which you are assigned.</li><li>Seek development opportunities above and beyond required training.</li><li>Maintain a broad and deep knowledge of emergent trends in relevant Data Science, AI, and Software Development. Choose appropriate technologies for the problem.</li><li>Ensure quality through unit testing, code review, and performance metrics.</li><li>Own each product the team builds; and own the measurements that ensure successful execution, delivery, and support of the production product.</li><li>Provide production support in conjunction with the support organization to resolve production issues.</li><li>Share what you know with other colleagues while learning from them. Provide mentoring and technical guidance to junior members to assure the team is successful.</li><li>Travel occasionally to meet with management, colleagues, clients, or 3rd party vendors.</li><li>Protect the integrity and confidentiality of all personal health data and proprietary information.</li><li>Observe all Policies and Procedures.</li><li>Supports nThrive’s Compliance Program by adhering to policies and procedures pertaining to HIPAA, FDCPA, FCRA, and other laws applicable to nThrive’s business practices. This includes: becoming familiar with nThrive’s Code of Ethics, attending training as required, notifying management or nThrive’s Helpline when there is a compliance concern or incident, HIPAA-compliant handling of patient information, and demonstrable awareness of confidentiality obligations.</li></ul>\n\n<ul>\n<li>Master's Degree in Linguistics, Computational Linguistics, Machine Learning, Data Science, Computer Science, Statistics, Applied Mathematics, or equivalent discipline</li><li>8+ years of experience delivering software solutions solving real business problems with Data Science, Machine Learning or Natural Language Processing</li><li>Broad experience building and optimizing classification and/or regression Machine Learning models using various approaches such as LR, SVM, KNN, Neural Nets, MLPs, Random Forest, Naïve Bayes, or Decision Trees</li><li>Experience delivering scalable distributed implementations using one or more frameworks such as Spark, DASK, Mahout, Hadoop, Azure, Theano, Torch, or TensorFlow.</li><li>Fluency in at least two languages from Python, Java, Scala, C#, C++, Ruby, Perl, or similar</li><li>Experience developing software in an Agile environment</li><li>Excellent interpersonal skills coupled to strong oral and written communications</li><li>Excellent time management and self-motivation skills</li><li>Experience with cloud-based solutions</li></ul>\n\n<ul>\n<li>Ph. D in Linguistics, Computational Linguistics, Machine Learning, Data Science, Computer Science, Statistics, Applied Mathematics, or equivalent discipline is preferred</li><li>Mastery of multiple tools or frameworks such as Spark, DASK, Mahout, Hadoop, Azure, Theano, Torch, or TensorFlow</li><li>Experience with Regular Expressions</li><li>Experience with text information extraction, grammars, semantics, and morphology</li><li>Experience with parsers, tokenizers, and other text based linguistic tools</li><li>Spoken and/or written fluency with modern or ancient languages in addition to your native language</li><li>Experience with structured and unstructured data</li><li>Creativity in compensating for incomplete or sparse data</li><li>Experience managing and utilizing curated corpora &amp; ontologies</li><li>Familiarity with Test Driven Development (TDD) practices</li><li>Experience in Healthcare Information Technology</li>\n</ul>\n<strong>Be Inspired. Ignite Change. Transform Health Care.</strong>\n<br>\nFrom Patient-to-Payment, nThrive provides all the technology, advisory expertise, services, analytics and education programs health care organizations need to thrive in the communities they serve. Our colleagues share a united passion to help health care organizations strengthen their financial position, which translates to accessible, quality care for all. This passion fuels our drive to innovate and participate in community outreach through the nThrive CARES program. Our colleagues are encouraged to think differently and empowered to make a lasting impact that ensures our health care providers, and our world, are healthy and productive.#dce\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}