{"job title": "Data Scientist - Big Data", "company": "NTT DATA", "city state": "– Durham, NC", "rating": "3.1", "job description": "<strong>Req ID:&nbsp;32813&nbsp;</strong>\n<br><br>\n&nbsp;\n<br><br>\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services&nbsp;and for the people who work here.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA&nbsp;Services currently seeks a&nbsp;Data Scientist - Big Data&nbsp;to join our team in Durham, North Carolina (US-NC), United States (US).\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;<br>\n<div><strong>Day to Day job Duties:&nbsp;(what this person will do on a daily/weekly basis)</strong><strong>&nbsp;</strong></div><div>&nbsp;</div><div>Evaluate trends, characterize factors, develop predictive models, and identify optimization opportunities.</div><div>Provide accurate, timely, relevant and quality analysis that translate data into sound organizational decisions.</div><div>Research, design and prototype robust and scalable models based on machine learning, data mining, and statistical modeling to answer key business problems.</div><div>Build tools and support structures needed to analyze data, perform elements of data cleaning, feature selection and feature engineering and organize experiments in conjunction with best practices.</div><div>Work with development teams &amp; business groups to ensure models can be implemented as part of a delivered solution replicable across many clients.</div><div>Present findings to stakeholders to drive improvements and solutions from concept through to delivery.</div><div>&nbsp;</div><div><strong>Basic Qualifications: (what are the skills required to this job with minimum years of experience on each)</strong></div><div>&nbsp;</div><div>Data Scientist-Hadoop: 3-5 years</div><div>Strong skills in software prototyping and engineering with expertise in applicable programming and analytics languages (Python, R, C/C++) and various open source machine learning and analytics packages to generate deliverable modules and prototype demonstrations of their work</div><div>SQL programming skills</div><div>Experience with design and implementation of analytic models and methodologies for new applications.</div><div>Experience with data visualization tools (e.g. Tableau)</div><div>Experience with large and complex data sets</div><div>Demonstrated ability to propose novel solutions to problems, performing experiments to show feasibility of their solutions and working to refine the solutions into a real-world context</div><div>Strong analytical, written, and verbal communication skills</div><div>&nbsp;</div><div>&nbsp;</div><div>Travel: Need Locals\n<br><br>\nDegree: Bachelors in Computer Science or equivalent work experience</div><div>&nbsp;</div><div>&nbsp;</div>\n<br>\n<div><strong>Desirable Skills / Experience:</strong></div><div>&nbsp;</div><div>PhD in computer science, computer engineering or MS with 3+ years of experience in related field.</div><div>Deep knowledge of fundamentals of machine learning, data mining and statistical predictive modeling, and extensive experience applying these methods to real world problems</div><div>Desired interdisciplinary skills include big data technologies, ETL, statistics and causal inference, Deep Learning, modeling and simulation</div><div>Breadth of skills and experience in machine learning – diverse types of data, diverse data sources, different types of learning models, diverse learning settings</div><div>Experience in Healthcare domain</div>\n<br>&nbsp;\n<br><br>\n<em>This position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.</em>\n<br><br>\n<u><strong>About NTT DATA Services</strong></u>\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit nttdataservices.com to learn more.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;"}