{"job title": "Data Modeler", "company": "NTT DATA", "city state": "– Brighton, MA", "rating": "3.1", "job description": "<strong>Req ID:&nbsp;33406&nbsp;</strong>\n<br><br>\n&nbsp;\n<br><br>\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services&nbsp;and for the people who work here.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA&nbsp;Services currently seeks a&nbsp;Data Modeler&nbsp;to join our team in Brighton, Massachusetts (US-MA), United States (US).\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA&nbsp;Services currently seeks a&nbsp;Data Modeler –to join our team in Boston MA, United States (US).\n<br><br>\nThis candidate will be part of a team made up of Project Managers, Database and Web Developers, Data Modelers, DBAs, Business Analysts, Report Analysts, EDH group and ETL Specialists.&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nTHIS IS A FTE OPPORTUNITY WITH BENEFITS\n<br><br>\n&nbsp;\n<br><br>\n<strong>Role Responsibilities</strong>\n<br><br>\n- The candidate will be responsible for the design, implementation, support and maintenance of relational database model systems\n<br><br>\n- Creation/maintenance of conceptual, logical and physical data models,\n<br><br>\n- Database solution design. In this role the candidate will recommend and monitor overall standards and procedures,\n<br><br>\n- Provide solution design guidance to other technical staff, and assist in integrating various systems.\n<br><br>\n- Consult with users to determine requirements needed to guide development of the data models.\n<br><br>\n- Data warehouse expertise in OLAP and relational modeling (3NF/OLTP) with a wide repertoire of domain experiences\n<br><br>\n- Working with day to day Repository Management activities like Model Merging, User Role Creation, User Access Grants,\n<br><br>\n&nbsp;-Model Freezing and Model Version Management\n<br><br>\n-Responsible for reverse engineering and synchronizing existing legacy data models\n<br><br>\n&nbsp;\n<br><br>\n<strong>Basic qualification&nbsp;</strong>\n<br><br>\n5+ years of experience as an Architect or Data Modeler on data warehouse projects using relational and No-SQL technologies\n<br><br>\nERwin or other data modeling software\n<br><br>\n<strong>Requirements</strong>\n<br><br>\nLogical and physical data modeling experience\n<br><br>\nWorking with technical developers to strategize solutions to align with business requirements\n<br><br>\nWorking with end users/customers to understand requirements for technical solutions to meet business needs\n<br><br>\nIdentifying and initiating resolutions to customer problems and concerns associated with a data warehouse\n<br><br>\nAnalyze project requirements and developing detailed specifications\n<br><br>\nDefining standards and best practices and conducting code reviews\n<br><br>\nDeveloping service and ad hoc oriented data models\n<br><br>\n<strong>Education</strong>\n<br><br>\nBachelor’s degree or equivalent work experience\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<em>This position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.</em>\n<br><br>\n<u><strong>About NTT DATA Services</strong></u>\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit nttdataservices.com to learn more.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;"}