{"job title": "Data Scientist", "company": "NTT DATA Services", "city state": "– Dallas, TX", "rating": "3.1", "job description": "<div><strong>Req ID: 30197</strong>\n<br><br>\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services and for the people who work here.\n<br><br>\nNTT DATA Services currently seeks a Data Scientist to join our team in Dallas, Texas (US-TX), United States (US).<br>\n<div><div><div><div>Big data scientist should be expert in R language, and optionally in in different programming languages such as Scala and SQL. In addition, the need to be familiar with disciplines such as:\n<ul>\n<li>Machine learning</li><li>Conceptual modelling: to be able to share and articulate modelling;</li><li>Statistical analysis: to understand and work around possible limitations in models;</li><li>Predictive modelling</li><li>Hypothesis testing: being able to develop hypothesis and test them with careful experiments.</li>\n</ul>\n\n<div><div><div><div>Forecasting algorithms:\n<ul>\n<li>Hierarchical time series models: top-down, bottom-up</li><li>ARIMA</li><li>Exponential smoothing</li><li>Neural Networks Auto regression</li><li>Bayesian additive regression model</li><li>Pricing algorithms</li><li>Gradient Boosting Machines (GBM)</li><li>Random Forest</li><li>Elastic Net</li><li>Neural Networks</li><li>Support vector machines</li><li>Optimization algorithms</li><li>Linear Programming (LP)</li><li>Interior point methods</li><li>Statistical estimation</li><li>Genetic algorithms</li>\n</ul>\nSkills –Linux intermediate, Exposure to Hadoop HDFS and eco- system. They need to have statistical, mathematical, predictive modelling as well as business strategy skills to build the algorithms necessary to ask the right questions and find the right answers. They also need to be able to communicate their findings, orally and visually. They need to understand how the products are developed. They need to be thinkers who can ask the right (business) questions.\n<br><br>\nThey need to be able to link and mash up distinctive data sets to discover new insights. Work with potentially incomplete data sources and cleaning data sets to be able to use them.</div></div></div></div>\n<br>Day-to-day technical Challenges –</div></div></div></div><div><div><div><div>\n\n<ul>\n<li>Being able to work in a fast-paced multidisciplinary environment as in a competitive landscape new data keeps flowing in rapidly and the world is constantly changing;</li><li>Having the ability to query databases and perform statistical analysis;</li><li>Being able to develop or program databases;</li><li>Being able to work independently and guide other Junior Data Scientists.</li> </ul></div>\n</div></div></div>\n<br><em>This position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.</em>\n<br><br>\n<u><strong>About NTT DATA Services</strong></u>\n<br><br>\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\n<br><br>\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit nttdataservices.com to learn more.\n<br><br>\nNTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.</div>"}