{"job title": "Senior Big Data Engineer", "company": "NTT DATA", "city state": "– Durham, NC", "rating": "3.1", "job description": "<strong>Req ID:&nbsp;33888&nbsp;</strong>\n<br><br>\n&nbsp;\n<br><br>\nAt NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services&nbsp;and for the people who work here.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA&nbsp;Services currently seeks a&nbsp;Senior Big Data Engineer&nbsp;to join our team in Durham, North Carolina (US-NC), United States (US).\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\nAs a Senior Data Engineer, you should be an expert with data warehousing technical components (e.g. Data Modeling, ETL and Reporting), infrastructure (e.g. hardware and software) and their integration. You should have deep understanding of the architecture for enterprise level data warehouse solutions using multiple platforms (RDBMS, Columnar, Cloud). The individual is expected to be able to build efficient, flexible, extensible, and scalable ETL and reporting solutions.\n<br><br>\n&nbsp;\n<br><br>\nThe Senior Data Engineer will be responsible for finding trends in datasets and developing workflows and algorithms to help make raw data more useful to the enterprise. He or she will also be responsible for creating data acquisition strategy and develops data set processes.\n<br><br>\n&nbsp;\n<br><br>\nYou should be enthusiastic about learning new technologies and be able to implement solutions using them to provide new functionality to the users or to scale the existing platform.\n<br><br>\n&nbsp;\n<br><br>\nExcellent written and verbal communication skills are required as the person will work very closely with diverse teams. Having strong analytical skills is a plus.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Primary Responsibility</strong>\n<ul>\n<li>As a Senior Data Engineer, you must be an expert with Big Data technologies like Hadoop, Hive, Hbase, Spark, and various AWS technologies.</li><li>You will architect and drive the build out of next generation data platform.</li><li>You will build reusable code, with the ability to scale with very large data volumes.</li><li>Everything you build will need to scale and perform.</li><li>Define and lead the frameworks for compliance with data management standards for emerging technologies (streaming platforms, cloud integration, etc.)</li><li>You will drive the build out of next generation data platform.</li>\n</ul>\n<strong>General Responsibilities</strong>\n<ul>\n<li>Be part of a core team leading migration to new data technologies for unstructured, streaming and high volume data.</li><li>Overall accountability of your work and adopt established data management frameworks to prevent data lakes from becoming data swamps.</li><li>Provide senior level technical consulting to application development teams during application design and development for highly complex or critical projects</li><li>As a hands-on engineer, you will influence all architecture decisions.</li>\n</ul>\n<strong>Job Functions:</strong>\n<ul>\n<li>Provide technical leadership to build and implement data and big data solutions</li><li>Articulate pros and cons of various technologies, platforms and tools.</li><li>Demonstrated work experience with distributed, scalable Big Data programming model and technologies such as Hadoop, Hive, Pig, etc.</li><li>Demonstrated hands-on experience with at-least one of the major Hadoop distributions (Preferrably Cloudera).</li><li>Deep technical Expertise in Hadoop eco system components.</li><li>Experience designing, developing and implementing online-machine learning libraries.</li>\n</ul>\n<strong>Minimum Experience:&nbsp;</strong>\n<br><br>\n&nbsp;\n<br><br>\n8+ years’ experience in dimensional data modeling, ETL development, and Data Warehousing.\n<br><br>\nBusiness Consulting-ETL Processes: 5+ years\n<br><br>\nBIG Data ( BD)-Apache Hadoop (HDFS)-Base/Hive/Pig/Mahout/Flume/Scoop/MapReduce/Yarn: 3-5 years\n<br><br>\nCloud Dev and Migration-AWS-Analytics/DW/Redshift : 1+ year\n<br><br>\n&nbsp;\n<br><br>\nTravel: Need locals\n<br><br>\nDegree: Bachelors in Computer Science or equivalent work experience\n<br><br>\n&nbsp;\n<br><br>\n<strong>Desirable Skills:</strong>\n<ul>\n<li>Master’s degree in Information Systems or a related field.</li><li>Hadoop/Cloud Developer Certification</li><li>Experience deploying applications in a cloud environment; ability to architect, design, deploy and manage cloud based Hadoop clusters</li><li>Exposure to cloud infrastructure</li><li>Experience with Redshift and other AWS services.</li>\n</ul>\n&nbsp;\n<br><br>\n<em>This position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.</em>\n<br><br>\n<u><strong>About NTT DATA Services</strong></u>\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and NTT Group, a partner to 88 percent of the Fortune 100. Visit nttdataservices.com to learn more.\n<br><br>\n&nbsp;\n<br><br>\nNTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result.\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;"}