{"job title": "Data Scientist", "company": "Numeric Recruiting &amp; Staffing", "city state": "– Philadelphia, PA", "rating": "3.1", "job description": "SummaryProvide data management and statistical analysis in Big Data environment. Assist in development of tools and processes to manage, integrate and synthesize large data sets and deliver business rules and recommendations to functional business units and product managers\n<br><br>\nResponsibilities and Duties\n\n\n<ul>\n<li>Perform analyses, development and provide data mining in a large data warehouse environment which includes data design, database architecture, Meta data and repository creation.</li>\n<li>Extensive use data mining and data analysis tools.</li>\n<li>Review and validate data loaded into the data warehouse for accuracy</li>\n<li>Provide technical consulting to users of data warehouses and advises users on conflicts and inappropriate data usage</li>\n<li>Gather and assess business information needs and prepare system requirements</li>\n<li>Interact with user community to develop and produce reporting requirements</li>\n<li>Responsible for prototyping solutions, preparing test scripts, and conducting tests and for data replication, extraction, loading, cleansing, and data modeling for data warehouses</li>\n<li>Maintain knowledge of software tools, languages, scripts, and shells that effectively support the data warehouse environment in different operating system environments</li>\n<li>Make recommendations towards the development of new code or reuse of existing code.</li>\n<li>Responsibilities may also include participation in component and data architecture design, performance monitoring, product evaluation and buy versus build recommendations</li>\n</ul>\n\n<strong>#LI-JS1</strong>\n<br><br>\n<strong>Requirements</strong>\n\n\n<ul>\n<li>7+ years of programming/systems analysis experience</li>\n<li>5+ years of experience with business intelligence and stat tools and systems</li>\n<li>Strong experience in Relational Database Management Systems (RDBMS) and data warehouse front-end tools</li>\n<li>Extensive knowledge of data warehouse and data mart concepts</li>\n<li>Experience in systems analysis and design</li>\n<li>Solid understanding of development, quality assurance and integration methodologies</li>\n<li>BS in Computer Science, IS, or other related field. Or equivalent work experience</li>\n</ul>\n\nTechnical Skills Required\n\n\n<ul>\n<li>Stat &amp; Data Tools – Python, Machine Learning, SQL, Spark, Data Visualization</li>\n<li>Data &amp; Cloud Tools – Hadoop, AWS Big Data Stack (S3, Spark, Lambda, Presto, Athena, Kinesis, Redshift)</li>\n<li>Scripting Tools – Linux/Unix, Shell Scripts</li>\n</ul>"}