{"job title": "Data Engineer", "company": "Nytec", "city state": "– Mountain view, CALIFORNIA", "rating": "4.4", "job description": "<strong>Embrace your independence and make a difference.</strong>\n<br>\nAs a contractor, you can choose your clients and the projects you work on, but you also need to constantly cultivate your next project. At Nytec, we’ve created an ecosystem where you can increase your value as a consultant, while working on a variety of projects at top technology companies. Our talented people have solved tough problems and created innovative products at the smallest to the largest and most cutting-edge companies in the world. With Nytec, you’ll create a variety of industry- and life-changing products for our clients, using the latest technologies, across an array of industries and applications. Fun projects and meaningful work – you need to work with Nytec!\n<br><br>\n<strong>About Nytec</strong>\n<br>\nNytec is an award-winning, integrated consulting firm with over 40 years of success turning ideas into first-of-a-kind, lifestyle technology products for tier-one global and Fortune 100 companies. Our world-class designers, engineers, and manufacturing experts translate complex problems into compelling, simple solutions that deliver the ultimate user experience. Nytec’s industry-leading Client Services provide customizable talent solutions to satisfy staffing requirements, either onsite, offsite, or project-based.\n<br><br>\nTitle: <strong>Data Engineer</strong>\n<br>\nLocation: Mountain view, CA\n<br>\nDuration: Long-Term Contract\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n\n <li>Architect systems and end-to-end solutions that provide fast, efficient and reliable interfaces to heterogeneous data, meta data for internal users of the analytics infrastructure.</li>\n<li>Automate existing processes and create systems that favor self-service data consumption.</li>\n<li>Own the quality of our analytics data. Implement a robust monitoring &amp; logging framework that guarantees the traceability of inevitable incidents.</li>\n<li>Evaluate whether the best solution for each problem at hand is to build, buy or contract the work.</li>\n<li>Interface with data scientists, analysts, product managers and all other customers of the analytics infrastructure to understand their needs and expand the infrastructure as we grow.</li>\n</ul>\n\n<strong>Requirement</strong>\n\n\n<ul>\n\n <li>BS/BA in Computer Science/Engineering, or relevant technical field with 2 – 3 years of experience as software engineer and/or data engineer and/or front-end engineer and/or full-stack engineer</li>\n<li>Ability to manage data warehouse plans and communicate them to internal clients.</li>\n<li>At least 4 years of experience as a Data Engineer, or in a role that required expertise in data pipeline technologies.</li>\n<li>Strong overall programming skills, able to write modular, maintainable code and high quality code</li>\n<li>Strong in web-based programming (CSS, HTML, PHP)</li>\n<li>Experience in one or more data visualization libraries like Tableau, Plotly, InfoGram, Material Design</li>\n<li>Strong python programming specially in python machine learning and data mining libraries (SciPy, Panda, Numpy)</li>\n<li>Strong in Linux and shell-scripting</li>\n<li>Specialized experience with at least one of HDFS, EMR, Redshift, Spark, Flink, or Presto.</li>\n<li>Experience with SQL RDBMS is required.</li>\n<li>Experience in client/server, RESTFul architecture and tools like Jenkins, RunDeck</li>\n<li>Experience in basics of data mining, clustering, classification and comfortable to work with large matrices of data effectively</li>\n<li>Familiar with CUDA, Blast and machine leaning engineers like Tensorflow, Torch, PyTorch, DIGITS</li>\n</ul>\n\n<strong>Benefits</strong>\n\n\n<ul>\n\n <li>Nytec offers a full benefits package (at most major partners) including sponsored health (medical/dental/vision) plans.</li>\n<li>Referral Bonuses - Receive $500 for referring a candidate that is hired, $500 for referring a job that is filled by Nytec, or $1000 for referring the job and the candidate.</li>\n</ul>\n\n<strong>To Apply</strong> Visit <strong><u>nytec.com/careers</u></strong> <strong>or email your resume and the job title to</strong> <u>careers@nytec.com</u>\n<br><br>\n<strong>Questions?</strong> Call us at (425) 947-2676\n<br>"}