{"job title": "Asst Research Scientist", "company": "NYU Langone Health", "city state": "– New York, NY", "rating": "3.8", "job description": "<p><strong>NYU School of Medicine</strong> is one of the nation's top-ranked medical schools. For 175 years, NYU School of Medicine has trained thousands of physicians and scientists who have helped to shape the course of medical history and enrich the lives of countless people. An integral part of NYU Langone Health, the School of Medicine at its core is committed to improving the human condition through medical education, scientific research, and direct patient care. For more information, go to med.nyu.edu, and interact with us on Facebook, Twitter and Instagram.</p><p><strong>Position Summary:</strong><br>We have an exciting opportunity to join our team as a Asst Research Scientist. <br> <br> In this role, the successful candidate The Genome Technology Core (GTC) is a fee-for-service laboratory operated by the NYU Langone Medical Center as a state-of-the-art shared resource for biomedical researchers. The GTC staff members provide their knowledge and expertise in a broad variety of service-type genomics applications to the research community at NYULMC. They work closely with investigators to define optimal experimental design, develop and maintain standards for all service procedures and troubleshooting, and provide guidance and service in data management and analysis. <br> Under the direct supervision of the Director of GTC, the Assistant Research Scientist will be responsible for performing a variety of complex laboratory tasks and standardized procedures to provide high quality genomics resource support for the research community</p><p><strong>Job Responsibilities:</strong></p><ul><li>Responsible for assisting with installation, implementation and operation of highly specialized equipment and instrumentation in the GTC shared resource laboratory, including lab automation</li><li>Responsible for the sample handling, preparation, QC analysis and analytical processing to generate high quality data for further analysis and interpretation.</li><li>Accountable for own and delegated activities, including responsibility for parts of GTC operation in the absence of the Director</li><li>Participates actively in experimental design and implementation</li><li>Responsible for Genologics Clarity LIMS system</li><li>Responsible for optimizing, implementing and daily performance of standard operating procedures for the next-generation sequencing (NGS), as follows: <br>a. Illumina MiSeq and HiSeq for next-generation sequencing primary instrument operation, troubleshooting and maintenance; data management and interfacing with HPC.<br>b. 10X Genomics for next-generation sequencingprimary instrument operation and maintenance responsibilities; HPC data management <br>c. Nanostring operation and data management<br>d. Develop full workflows for DNA, RNA and custom targets library preparation and library QC for Illumina MiSeq and HiSeq2000 sequencing.<br>e. Perform qPCR analysis for library preps for all NGS workflows<br>f. Develop and optimize high throughput library preparation using lab automation.<br>g. Operation of Illumina cBotcluster generation station for the above instruments</li><li>Analysis (quality and quantity) of nucleic acids for downstream applications of next-generation sequencing, including Agilent Bioanalyzer and picogreen quantitation.</li><li>Participates actively in developing, and implementing approved new procedures, or modifications to existing policies and procedures, including ordering, and record keeping for billing purposes.</li><li>Maintains updates and shares technological knowledge.</li><li>Makes contributions to scientific papers</li><li>May make presentations of the data when appropriate</li><li>COMMUNICATION AND RELATIONSHIPS WITH OTHERS<br>1. Excels in cooperation, collaboration and communication with all NYULMC employees <br> 2. May communicate directly with PIs and other scientists, coordinates service scheduling.<br> 3. Communicates carefully with others in order to respond appropriately, to answer questions and obtains requested information.<br> 4. Communicates ideas, problems, suggestions, and messages in a timely and effective manner<br> 5. Maintains the confidentiality of all research information.</li><li>JUDGEMENT / DECISION-MAKING <br>1. Is able to recognize problems as they occur, and through the application of <br>appropriate policy/procedure, determines and/or recommends the appropriate <br>solution. Must be able to troubleshoot <br>2. Seeks guidance as necessary for the performance of duties; asks appropriate <br>questions when in doubt and utilizes reference sources/materials to ensure accuracy.<br>3. Advises appropriate personnel of situations/problems requiring intervention <br>or follow-up attention.</li></ul><p><strong>Minimum Qualifications:</strong><br>To qualify you must have a Minimum M.S. with at least two years of experience in a high throughput genome based research laboratory. Experience with NGS sequencing, library preparation and lab automation is strongly preferred. In addition to the responsibilities and duties of Assistant Research Scientist listed above, the candidate is expected to perform all general and advanced procedures within the lab with minimal or no supervision. S/he will assist in the planning of experiments as well as in the interpretation of the results. The Assistant Research Scientist is expected to train and provide supervision to junior level lab personnel in established laboratory policies, methods, and procedures. He/she is also expected to use specific software in the analysis and interpretation of the results of experiments. May be required to take responsibility for most procedures in the absence of the Director. It is expected that an Assistant Research Scientist in the Genome Technology Center has and will be continuously building both the knowledge and experience in specific areas such as Biochemistry, Molecular Biology, lab automation and genomics-oriented bioinformatics etc.</p><p><em>Qualified candidates must be able to effectively communicate with all levels of the organization.</em><br><br>NYU School of Medicine provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you'll feel good about devoting your time and your talents.<br><br>NYU School of Medicine is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online. <br>If you wish to view NYU School of Medicine's EEO policies, please click here. Please click here to view the Federal \"EEO is the law\" poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here.</p>"}