{"job title": "Data Scientist", "company": "Oath", "city state": "– Champaign, IL", "rating": "3.2", "job description": "Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.<br><br>Take Yahoo and AOL, fuse them and you get a media and technology company operating at massive global scale. It takes powerful technology to connect our combined media brands and partners with an audience of 1 billion. Nearly half of Oath's employees are building the code and platforms that help us achieve that. And we're only getting bigger. Whether you're looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process 4 trillion data points a day, what you do here will have a huge impact on our business-and the world. Want in? The largest business and financial news site in the world, with unrivaled access to data, insights and original editorial content\n<br><br>\nAbout Us\n<br><br>\nThe Advertising Data Systems team at Yahoo is responsible for providing fast, clean, and relevant data for Yahoo's advertising businesses. As data availability and scale has risen, there is a demand for providing relevant insights and models to our sales and business partners at scale.\n<br><br>\nAbout The Position\n<br>\nThis role will build on top of our world-class advertising data systems to drive new insights around campaign effectiveness, sales forecasting, and advertising platform robustness. The scientist will leverage the latest machine learning and data science techniques to produce validated solutions for us in our advertising platforms to help drive revenue and sales.\n<br><br>\nYour Day, you will spend your days doing things like:\n<ul>\n \n<li>Exploring large data sets for relationships, insights, and anomalies</li>\n<li>Building machine learning models to explain the past or predict the future</li>\n<li>Incubating data science and machine learning tools for use in the organization</li>\n<li>Working with business leaders and engineers to discuss potential new features or customer issues to investigate</li>\n<li>Helping your team figure out priorities and processes and what's next</li>\n<li>Playing with your friends in some of our local games and contests, from trivia to table tennis, puzzle building, escape rooms and more</li>\n\n</ul>\nKey Requirements\n<ul>\n \n<li>Advanced degree in Computer Science, Control Theory, Electrical Engineering, Statistics, Applied Mathematics, or a related quantitative field</li>\n<li>Excel in abstract and statistical thinking while deeply grounded in solid business judgment</li>\n<li>Skilled in interpersonal communication and relationship; ability to explain complex analytical concepts to non-experts</li>\n<li>Data Science experience to solve classification and clustering problems on the web, perform information retrieval from unstructured and semi-structured data, build supervised and semi-supervised learning solutions</li>\n<li>Core foundation in data structures and algorithms and object-oriented programming</li>\n<li>Proficient programming skills in at least one of the following languages and frameworks: Java, Python, R</li>\n<li>Experience with big data technologies such as Hadoop (Pig/Hive), Spark, or other related technologies</li>\n\n</ul>\nOath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process.\n<br><br>\nCurrently work for Oath? Please apply on our internal career site."}