{"job title": "Agricultural Scientist", "company": "Ocean Spray Cranberries, Inc.", "city state": "– Aberdeen, WA", "rating": "3.9", "job description": "Default Template Corporate<br><br><strong>AGRICULTURAL SCIENTIST</strong>\n<br><br>\nOcean Spray Cranberries, Inc. is currently looking for an <strong>Agricultural Scientist</strong> to support our Cranberry Grower-Owners in Washington. The successful candidate will work out of Ocean Sprays facility in Markham, WA and be part of a team of Ocean Spray Agricultural Scientists that serves our growers industry-wide.\n<br><br>\n<strong>Position Summary:</strong> Develop and implement research and outreach programs to support all phases of agricultural production for Ocean Spray Grower-Owners in Washington. Advise grower harvest timing and help coordinate fruit deliveries to OSCs receiving facilities. Provide support to programs/initiatives in the areas of crop supply planning and pesticide-related risk management. Coordinate efforts of University/government scientists, grower organizations and chemical industry professionals to focus on solutions to agricultural production issues.\n<br><br>\n<strong>Principal Duties and Responsibilities:</strong>\n<ul>\n<li>Provide on-farm technical support to Grower-Owners.</li><li>Conduct applied research to address key production, pest management, and environmental needs. Work collaboratively with external (e.g. university) scientists as appropriate. Manage seasonal technicians if needed.</li><li>Implement outreach programs for Grower education and to facilitate research technology transfer.</li> <li>Execute field sampling programs to support crop estimation, field inspections (supports contract management) and fruit samples for pesticide residue analysis.</li><li>Be an integral member of our team of OSC Agricultural Scientists and work collaboratively with the OSC Agricultural Operations (fruit receiving) network to ensure timely delivery of high quality fruit.</li><li>Provide IPM (Integrated Pest Management) services and formulate management recommendations based on IPM data.</li><li>Represent the Cooperative as an information resource on matters relating to the overall business.</li><li>Be familiar with the Cooperatives rules and recommendations for GrowerOwner conduct in relation to producing and delivering the crop.</li><li>Review and approve Pesticide Use Reports for individual farms.</li><li>Attend Grower Industry meetings, workshops, and gatherings.</li><li>Cooperate with university/government scientists, grower organizations, and chemical industry professionals to address issues important to the cranberry industry.</li>\n</ul>\n<strong>Decision-Making Authority/Accountability Level:</strong>\n<ul>\n<li>Development of project designs and their implementation and the execution of relevant outreach programs.</li><li>Analyze compensation for Grower-Owners where research leads to loss of crop.</li><li>Responsible for securing and approving Grower-Owners pesticide use reports prior to delivery.</li><li>Coordinate activities of external scientists/specialists to maximize positive impact on Grower-Owner on-farm profitability.</li><li>Work in conjunction with Operations personnel to execute fruit delivery programs (e.g. fresh fruit, quality audits, delivery scheduling, etc.).</li><li>This position will be required to work extended hours during harvest season.</li>\n</ul>\n<strong>Knowledge, Skill, and Ability Requirements:</strong>\n<ul>\n<li>Bachelors, M.S., or Ph.D. degree in agricultural sciences, pest management, crop management, soil science or related discipline (e.g. entomology, plant pathology, weed science, horticulture).</li><li> 3 or more years of experience in one or more of the areas stated above.</li><li>Must be self-directed and independently motivated.</li><li>Driving is required (Company vehicle provided) so candidates must have a valid drivers license in good standing.</li>\n</ul>\n<em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.</em>"}