{"job title": "innovationOchsner (iO) Behavior Scientist", "company": "Ochsner Health System", "city state": "– New Orleans", "rating": "3.9", "job description": "<strong>We've made a lot of progress since opening the doors in 1942, but one thing has never changed - our commitment to serve, heal, lead, educate, and innovate. We believe that every award earned, every record broken and every patient helped is because of the dedicated employees who fill our hallways.</strong>\n<br><br>\n<strong>At Ochsner, whether you work with patients every day or support those who do, you are making a difference and that matters. Come make a difference at Ochsner Health System and discover your future today!</strong><br><br>The iO Behavior Scientist will identify, research and aid in the implementation of the appropriate health behavior change processes and tactics in order to achieve the desired outcomes related to each project, including but not limited to patient satisfaction, improved adherence and improved health behavior. The iO Behavior Scientist will also ensure that evidence- and practice-based research supports the selected behavior change processes and are documented for each solution, and will also identify key metrics that will determine the effectiveness of the product solutions and inform future product enhancements.<br><br>innovationOchsner (iO) is looking for a Behavior Science Specialist to join its entrepreneurial, multi-disciplinary and mission-focused team that is shaping the future of healthcare. iO is an innovation lab within Ochsner Health System, Louisiana’s largest not-for-profit health system. iO’s mission is to reimagine and revolutionize the delivery and experience of healthcare and dramatically improve health outcomes using technology, data and new thinking, with a focus on digital health, advanced analytics and precision medicine. Its work includes the O Bar, Digital Medicine, Optimal Hospital and Connected MOM, and has been recognized as models by the ONC, Harvard Medical School and Harvard Business School, and Apple, among others.\n<br><br>\nThe Behavior Science Specialist will play a key role in the iO team’s design and development of interventions and tools by applying evidence- and practice-based approaches to support positive behavior change. The iO Behavior Scientist will identify, research and aid in the implementation of the appropriate health behavior change processes and tactics in order to achieve the desired outcomes related to each project, including but not limited to patient satisfaction, improved adherence and improved health behavior. The iO Behavior Scientist will also ensure that evidence- and practice-based research supports the selected behavior change processes and are documented for each solution, and will also identify key metrics that will determine the effectiveness of the product solutions and inform future product enhancements.\n<br><br>\n<strong>What you’ll do</strong>\n<ul>\n<li>Partner with cross-functional teams to identify project requirements and desired outcomes</li><li>Identify appropriate behavior change process and tactics and work with the team to implement</li><li>Ensure that evidence-based and practice-based research supports the selected behavior change processes and are documented</li><li>Identify key metrics that will determine effectiveness of product solutions and enhancements</li>\n</ul>\n<strong>What we Seek</strong>\n<ul>\n<li>Required - Masters in Psychology, Public Health, Health Informatics or other related field (PhD Preferred)</li><li>Required – A minimum 3 years of experience in the area of the development behavior change solutions, ideally including technology-based solutions (5 years preferred)</li><li>Experience developing &amp; evaluating behavior change interventions</li><li>Familiarity with user experience design is an asset</li><li>Ability to convey complex data in a meaningful way to diverse audiences</li>\n</ul>\n<strong>About Ochsner</strong>\n<br><br>\nOchsner Health System is Louisiana’s largest non-profit, academic, healthcare system. Driven by a mission to Serve, Heal, Lead, Educate and Innovate, coordinated clinical and hospital patient care is provided across the region by Ochsner's 30 owned, managed and affiliated hospitals and more than 80 health centers and urgent care centers. Ochsner is the only Louisiana hospital recognized by U.S. News &amp; World Report as a “Best Hospital” across four specialty categories caring for patients from all 50 states and more than 80 countries worldwide each year. Ochsner employs more than 18,000 employees and over 1,100 physicians in over 90 medical specialties and sub-specialties, and conducts more than 600 clinical research studies.\n<br><br>\nThe above statements describe the general nature and level of work only. They are not an exhaustive list of all required responsibilities, duties, and skills. Other duties may be added, or this description amended at any time.\n<br><br>\nOchsner is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<u>Physical and Environmental Demands</u><br><br>The physical essential functions of this job include (but are not limited to) the following: Frequently exerting 10 to 20 pounds of force to move objects; occasionally exerting up to 100 pounds of force. Physical demand requirements are in excess of those for sedentary work. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br><strong>Are you ready to make a difference at Ochsner and live our values of Patient's First, Compassion, Integrity, Excellence, &amp; Teamwork?</strong>\n<br><br>\n<strong>Ochsner Health System endeavors to make our site accessible to all users. If you would like to contact us regarding the accessibility of our website, or if you need an accommodation to complete the application process, please contact our HR Employee Service Center at 504-842-4748 (select option 1) or careers@ochsner.org. This contact information is for accommodation requests only and cannot be used to inquire about the status of applications.</strong>\n<br><br>\n​<strong>EEO is the Law links in</strong> <strong>English or Spanish.</strong>\n<br><br>\n<strong>Affirmative Action Policy Statement</strong>"}