{"job title": "innovationOchsner (iO) - Data Scientist - Benson Tower", "company": "Ochsner Health System", "city state": "– Benson, LA (US)", "rating": "3.9", "job description": "<strong>We've made a lot of progress since opening the doors in 1942, but one thing has never changed - our commitment to serve, heal, lead, educate, and innovate. We believe that every award earned, every record broken and every patient helped is because of the dedicated employees who fill our hallways.</strong>\n<br><br>\n<strong>At Ochsner, whether you work with patients every day or support those who do, you are making a difference and that matters. Come make a difference at Ochsner Health System and discover your future today!</strong><br><br>This job drives innovation within iO and across Ochsner Health System by developing computational algorithms, statistical tools, predictive models, and web applications that support 1) the measurement, evaluation, and interpretation of clinical, financial, quality and operational performance and 2) the design, implementation, and assessment of multi-faceted care, research, and population health programs that enhance the precision, personalization and cost-effectiveness of patient care. Candidates should be process-driven, detail-oriented, hands on, a fast learner and passionate about technology and healthcare.<br><br>innovationOchsner (iO) is looking for a Data Scientist to join its entrepreneurial, multi-disciplinary and mission-focused team that is shaping the future of healthcare. iO is an innovation lab within Ochsner Health System, Louisiana’s largest not-for-profit health system. iO’s mission is to reimagine and revolutionize the delivery and experience of healthcare and dramatically improve health outcomes using technology, data and new thinking, with a focus on digital health, advanced analytics and precision medicine. Its work includes the O Bar, Digital Medicine, Optimal Hospital, Connected MOM, and numerous machine leaning and AI applications, and has been recognized by the ONC, Harvard Medical School and Harvard Business School, Microsoft and Apple, among others.\n<br><br>\nThe Data Scientist will have the opportunity to utilize clinical and operational data from a standardized and consolidated database, a rarity at most health systems. Ochsner has a track record of moving quickly and implementing standardized workflows across the entire health system, and as a result, it drastically reduces the time it takes to extract meaningful data for analysis. The Data Scientist will use this data to develop computational algorithms, statistical tools, predictive models, and/or web applications that can drive operational efficiencies and save patients’ lives. Ochsner is interested in affecting change and driving outcomes. Candidates should be process-driven, detail-oriented, hands on, opinionated, a fast learner and passionate about technology and healthcare.\n<br><br>\n<strong><u><strong>Education</strong> </u></strong>\n<br><br>\nRequired – Bachelor’s Degree in data analytics, computer science, mathematics, statistics, economics, or related field.\n<br><br>\nPreferred – Master’s Degree in data analytics, computer science, mathematics, statistics, economics, or related field.\n<br><br>\n<strong><u><strong>Work Experience</strong></u></strong>\n<br><br>\nRequired – 1-3 year data analytics\n<br><br>\nPreferred – 3-5 years data analytics\n<br><br>\n<strong><u><strong>Knowledge Skills and Abilities (KSAs)</strong></u></strong>\n<ul>\n<li>Supervised modeling such as logistic regression, decision trees, SVM, neural networks.</li><li>NLP, text mining</li><li>Python and R, SQL-like query languages.</li><li>Deploying models using web services.</li><li>Effective verbal and written communication skills and the ability to present information clearly and professionally.</li><li>Must be proficient with Windows-style applications, various software packages specific to the role.</li>\n</ul>\n<strong><u><strong>Job Duties</strong></u></strong>\n<ul>\n<li>Develop and implement new machine learning models to be used in clinical, operational, and corporate areas.</li><li>Drive the collection of new data and the refinement of existing data sources.</li><li>Research new methods to improve machine learning algorithms.</li><li>Perform studies to gain deeper understanding of how patients and employees interact with the health system.</li><li>Other related duties as required.</li> \n</ul>\nThe above statements describe the general nature and level of work only. They are not an exhaustive list of all required responsibilities, duties, and skills. Other duties may be added, or this description amended at any time.\n<br><br>\nOchsner is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\n<strong><u><strong>Physical and Environmental Demands</strong></u></strong>\n<br><br>\nThe physical essential functions of this job include (but are not limited to) the following: Frequently exerting 10 to 20 pounds of force to move objects; occasionally exerting up to 100 pounds of force. Physical demand requirements are in excess of those for sedentary work. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\n<strong>Are you ready to make a difference at Ochsner and live our values of Patient's First, Compassion, Integrity, Excellence, &amp; Teamwork?</strong>\n<br><br>\n<strong>Ochsner Health System endeavors to make our site accessible to all users. If you would like to contact us regarding the accessibility of our website, or if you need an accommodation to complete the application process, please contact our HR Employee Service Center at 504-842-4748 (select option 1) or careers@ochsner.org. This contact information is for accommodation requests only and cannot be used to inquire about the status of applications.</strong>\n<br><br>\n​<strong>EEO is the Law links in</strong> <strong>English or Spanish.</strong>\n<br><br>\n<strong>Affirmative Action Policy Statement</strong>"}