{"job title": "Data Scientist", "company": "Odecee", "city state": "– Las Vegas, Nevada, United States", "rating": "3.0", "job description": "<br>\n\n<div><div>Functional Architect\n<br><br>\nQualification:<br><br>Bachelor's in engineering / Master's in Business Administration / Chartered Accountant / Bachelor's or Master's in Commerce or equivalent industry experience<br><br>Responsibility:\n<br><br>\nBusiness Planning:<br><br>• Bring knowledge and understand trends, business/technology best practices, needs and guide/advise existing engagements/give inputs to planning process across people, process, technology and data solutions/recommendations in a particular functional area (domain/technology/product/ infrastructure).<br><br>Solution Conceptualization:<br><br>• Identify pain areas, opportunities and potential solution offerings by industry/domain with business impact.\n\n\n<ul>\n<li>contribute to new solution development, develop transformation tools and templates, productivity enhancement solutions/product ideation.</li>\n<li>Lead new solution offerings development by identifying/defining use cases, writing process blueprints and walkthroughs &amp; collaborate with technology partners/support architects for offering development.</li>\n<li>Define and communicate business/technology solutions in language meaningful to stakeholders in the engagement, such as CBA, ROI, and IRR.<br><br>Project Support/Delivery:<br><br>• Active involvement and ownership of Requirements and Solution Design Phase of delivery engagements, creating the business blueprint, (too heavy.</li>\n<li>it should be a supporting role) identifying gaps and recommending development/process changes, system configuration design, creation of test scenarios, migration plans.</li>\n<li>Provide engagement oversight in areas of specialization as and when called upon.</li>\n<li>Monitor AVM SLAs , address ticket resolution escalations, and drive bestinclass process adaptation.</li>\n<li>Client Expectation Management Deliver and measure value pre, during, &amp; post delivery engagements.</li>\n<li>Ensure client satisfaction.</li>\n<li>Help customers execute organizational change programs.</li>\n<li>Develop quality deliverables with focus on qualitative and quantitative business case, value props, roadmap, ROI analysis etc.<br><br>Sales Support:<br><br>• Contribute to Account Mining &amp; Penetration efforts with active participation in customer planning process including strategic planning phase vs execution phase.</li>\n<li>Drive RFP Response &amp; Improving Quality of Response (more business value focused), structures solutions in terms of scoping, effort.</li>\n<li>Work with SME groups across domains/products to provide a complete end to end solution, including estimates and definition of critical factors, assumptions, and risks.</li>\n<li>Contribute to transformational and consulting deals vs staff aug.</li>\n<li>Drive oral presentations to the customers in area of domain/product expertise.<br><br>Client Management/Relationship Management:<br><br>• Proactively develop relationships with functional owners.</li>\n<li>Navigate client's organization to identify the right sponsors for a given solution.</li>\n<li>Support alignment with third party vendor in an engagement wherever applicable (don't think this should appear here).</li>\n<li>Support Expectation Management, Client Satisfaction Management, and Risk Management.</li>\n<li>Deliver and measure value pre, during, and post engagement and communicate to stakeholders.<br><br>Market Scan &amp; Brand Building (Added Opportunity Identification):<br><br>• Bring working knowledge of customer business domain and/or product within a specific industry vertical/domain.</li>\n<li>Conduct secondary research on domain/industry specific solutions.</li>\n<li>Bring an understanding of competitive landscape.</li>\n<li>Identify key trends and forecasts in the given area of domain/industry.</li>\n<li>Prepare collateral, publications, technology papers etc for distribution.</li>\n<li>Work with account teams to develop and deliver new logos.</li>\n<li>Work on opportunity identification, prioritization and input to the qualification process.</li>\n<li>Contribute to GTM activities with partners, vendors, industry analysts etc through active mindshare gain Webinars, White papers, speaking events etc.<br><br>Knowledge Management:<br><br>• Contribute TL, Design, PoV, tools, templates, case studies etc artifacts into the knowledge management repository.</li>\n<li>Ensure all engagement artifacts are stored on knowledge repositories.</li>\n<li>Conduct quality review of KM artifacts prior to posting.<br><br>People Management:<br><br>• Active participation in recruitment activities identify and hire.</li>\n<li>Coaching &amp; Mentoring junior talent.</li>\n<li>Conducting midyear and YEA feedback sessions.</li>\n<li>Goal and expectation setting for new and existing resources.</li>\n<li>Motivate through rewards and recognition, organize team events/initiatives.</li>\n<li>Conduct Engagement Performance Reviews.</li>\n<li>Demonstrate understanding and skillful handling of people issues.</li>\n<li>Identify skill gaps and create training courses around domain/product areas.</li>\n<li>Work with the Academy to plan the training calendar.</li></ul></div>\n<br>Technical Skills<br>\n<div> <strong>SNo</strong> <strong>Primary Skill</strong> <strong>Proficiency Level *</strong> <strong>Rqrd./Dsrd.</strong></div> <div> 1 Python PL1 Required</div>\n<br>Domain Skills<br>\n<div> <strong>SNo</strong> <strong>Primary Skill</strong> <strong>Proficiency Level *</strong> <strong>Rqrd./Dsrd.</strong></div> <div> 1 COTS Products(T&amp;H Hotels) NA Required</div>\n<br>* Proficiency Legends<br>\n<div> <strong>Proficiency Level</strong> <strong>Generic Reference</strong></div> <div> PL1 The associate has basic awareness and comprehension of the skill and is in the process of acquiring this skill through various channels.</div> <div> PL2 The associate possesses working knowledge of the skill, and can actively and independently apply this skill in engagements and projects.</div> <div> PL3 The associate has comprehensive, in-depth and specialized knowledge of the skill. She / he has extensively demonstrated successful application of the skill in engagements or projects.</div> <div> PL4 The associate can function as a subject matter expert for this skill. The associate is capable of analyzing, evaluating and synthesizing solutions using the skill.</div>\n<br>Job Location : Las Vegas, Nevada, United States\n<br><br>\nEmployee Status : Full Time Employee\n<br><br>\nShift : Day Job\n<br><br>\nTravel : No\n<br><br>\nJob Posting : Aug 31 2018\n<br><br>\nCognizant US Corporation is an Equal Opportunity Employer Minority/Female/Disability/Veteran. If you require accessibility assistance applying for open positions in the US, please send an email with your request to CareersNA2@cognizant.com\n<br><br>\nAbout Cognizant<br>\n<div>Cognizant is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant, a member of the NASDAQ-100, is ranked 195 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us on Twitter: USJobsCognizant.</div> <div>Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.</div></div>\n"}