{"job title": "Data Scientist", "company": "Odesus", "city state": "– Los Angeles, CA", "rating": "4.1", "job description": "<em>Research, design, develop, test, and deploy machine learning systems. Research, develop and enhance quantitative models (predictive, sentiment, time series, topic modeling, spell check, etc.) using NLP and machine learning to build AI searches System within the scope of job Recruiting; Utilize statistical natural language processing to mine unstructured data, and create insights; analyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analyses. Cluster and analyze large amounts of user generated content and process data in large-scale environments using Hadoop, Spark, and MapReduce. Research and develop methods to support use cases focused on Big Data and Advanced Business Analytics. Research and perform text mining, generate and test working hypotheses, prepare and analyze historical data and identify patterns. Research methods for improving ranking for a job listing within a search, define and research and implement features to optimize search experiences. Using data and predictive algorithms to find the best solution in order to increase user engagement and search revenue and influence the company’s overall strategy. Obtaining data and converting it so it can be processes (e.g. Variable Identification, Univariate Analysis, Bi-variate Analysis, Missing values treatment, Outlier treatment, Variable transformation, Variable creation). Using algorithms to create models with respect to the problem to be solved (e.g. test the model in a limited deploy for a part of the traffic).</em>\n<br><br>\n<em>Requirements: U.S. or foreign Master’s degree or equivalent in Computer Science or a related field and 1 year of experience as a Data Scientist or a related occupation.</em>\n<br><br>\n<em>Mail resume to ODESUS INC, Attn: Operations, 11766 Wilshire Blvd, #400, Los Angeles, CA 90025</em>"}