{"job title": "Developer/Data Modeler", "company": "Ohio Health", "city state": "– Dublin, OH", "rating": "2.5", "job description": "<strong>Position Summary</strong>\n<br><br>\nThe Developer/Data Modeler supports the design and development of enterprise data models at OhioHealth across Data Management and Enterprise Analytics. They will be responsible for design and implementation of the robust data management environment through database modeling and architecture enabling of data transfer, reporting, and analytics.\n<br><br>\n<strong>Minimum Qualifications</strong>\n<br><br>\nMINIMUM QUALIFICATIONSEducation: Bachelor's DegreeField of Study: Computer Science, Computer Info Sys, Info Tech or related field Field of Study: A combination of education, training &amp; experience may be considered in lieu of degree SPECIALIZED KNOWLEDGE:KIND &amp; LENGTH OF EXPERIENCE:8 10 years of experience in DW development roles3 - 5 years of experience in the development of DW modelling (near full-time focus) 3 5 years of experience in ETL Development\n<br><br>\nAdditional Job Information\n<br><br>\nMAJOR RESPONSIBILITIES &amp; ESSENTIAL FUNCTIONS:\tBuild and maintain architectural design of conceptual/logical/physical data models.\tEstimate new work and perform impact analysis of changes to data models.\tDrive data standard creation, and ensures data modeling standards are followed.\tBuild ETL objects when not fully assigned on data modeling tasks.\tAble to support adhoc requests for business or IT (Ex. one-time data needs or questions about Data Quality). Strong experience/understanding of SQL server backend data structures, indexing, performance optimization.\tAble to work independently, with very little supervision. Required: Embarcadero ER/Studio or similar modeling tool experience Healthcare experience EPIC data model Data Vault experience Understanding of SQL Server Security Principals, User Setup, DB Roles Experience with migration / synchronization of SQL Objects across multiple environments Experience with defining/maintaining Data Access methods (Ex. Role-based, Masking) Experience with defining where metrics are calculated across data layers Nice to have: Experience developing in Informatica PowerCenter Prior experience with Data Quality tools Prior experience with Master Data Management tools\n<br><br>\nScheduled Hours Per Week\n<br><br>\n<strong>40</strong>\n<br><br>\nShift\n<br><br>\nday\n<br><br>\nEqual Employment Opportunity\n<br><br>\nOhioHealth is an equal opportunity employer and fully supports and maintainscompliance with all state, federal, and local regulations. OhioHealth does not discriminateagainst associates or applicants because of race, color, genetic information, religion, sex, sexual orientation, gender identity or expression, age,ancestry, national origin, veteran status, military status, pregnancy, disability, marital status, familial status, or othercharacteristics protected by law. Equal employment opportunity is extended to all persons in allaspects of the associate-employer relationship including recruitment, hiring, training, promotion,transfer, compensation, discipline, reduction in staff, termination, assignment of benefits, and anyother term or condition of employment."}