{"job title": "Data Scientist", "company": "OhMyGreen", "city state": "– Burlingame, CA", "rating": "3.9", "job description": "<strong>About Us</strong>\n<br><br>\nOur mission is to empower people to lead healthy and blissful lives. We bring delicious and nutritious drinks and snacks into the office workplace, where people spend a majority of their lives. We seek out the healthiest and tastiest foods to ensure our customers are happy, healthy and more productive.\n<br><br>\nAs a Data Scientist at Oh My Green, you will develop meaningful insights for our businesses and platforms (including quantified self, analytics, and personalized recommendation features). You will have the opportunity to work with a very talented team of engineers and designers.\n<br><br>\n<strong>The Role</strong>\n\n<ul>\n<li>Translating data insight into recommendations</li>\n<li>Researching market and product improvement opportunities</li>\n<li>Demonstrating how oh my green influences consumer behavior</li>\n<li>Develop sales material and strategies with business development, product and marketing teams</li>\n<li>Evangelizing data science tools and implementing new technologies as needed</li>\n</ul>\n<strong>About You</strong>\n\n<ul>\n<li>3 - 5+ years of professional experience</li>\n<li>Quantitative Degree – such as Statistics, Computational Linguistics, Physics, Computer Science, Economics, etc. MS/PhD preferred</li>\n<li>Researching market and product improvement opportunities</li>\n<li>Proficient in Sql, Python, and R</li>\n<li>Strong business acumen and problem-solving skills</li>\n<li>Extremely strong business analytics and product intuition</li>\n<li>Strong and persuasive communication skills</li>\n<li>Experience with Machine Learning or NLP a plus</li>\n<li>Startup experience a plus</li>\n</ul>\nFull benefits are available; including 100% coverage for medical, dental and vision premiums, short and long-term disability, life insurance, 401k, unlimited PTO, personal &amp; professional growth trainings, in-office massages and a fully stocked kitchen with healthy snacks and beverages!\n<br><br>\nThis is a perfect way to get your foot into the door at a fast growing startup company. We've been around for over two years and our customers love what we do. Our cultural values are FORCE (fun, open, respectful, collaborative, and excellent). If you are passionate about your health, organic food, nutrition and wellness and are looking for a fast-paced, fun place to work with a vibrant culture, we want you to join our team!"}