{"job title": "Data Scientist - Predictive Modeling", "company": "Oliver Wyman", "city state": "– New York, New York", "rating": "4.2", "job description": "<p>Oliver Wyman is a global leader in management consulting. With offices in 50+ cities across 26 countries, Oliver Wyman combines deep industry knowledge with specialized expertise in strategy, operations, risk management, and organization transformation. Our 4700+ professionals help clients optimize their business, improve their operations and risk profile, and accelerate their organizational performance to seize the most attractive opportunities. Oliver Wymans thought leadership is evident in our agenda-setting books, white papers, research reports, and articles in the business press. Our clients are the CEOs and executive teams of the top Global 1000 companies. </p>\n<p>Visit our website for more details about Oliver Wyman: www.oliverwyman.com </p>\n<p><b>Job Overview:</b></p>\n<p>Oliver Wymans Knowledge Services (KS) team has developed tools that support the capture of deliverables &amp; intellectual capital from client engagements, introduce Oliver Wyman consultants to proprietary knowledge, support new business development, and visualize knowledge use and performance across the company.</p>\n<p> </p>\n<p>In this role, you will be responsible for designing statistical algorithms, advanced analytics, and for maintaining a coherent data strategy for Knowledge Services. You will partner with our product analysts, reporting analyst, and developers as the team implements product enhancements &amp; leads the department toward data-centric management. </p>\n<p>This role requires strong collaboration and planning across global, regional and local teams, specifically with the Knowledge Services product analysts, practice knowledge managers, the Information Technology team (as new enhancements leverage data), and others across Group to ensure alignment and deliver results.</p>\n<p><b> </b></p>\n<p><b>Key Responsibilities:</b></p>\n<ul>\n<li>\n<div><b></b>Design algorithms for OWs knowledge &amp; collaboration platform (connecting colleagues to content, predictive content analysis, etc.)</div></li>\n<li>\n<div>Work alongside developers &amp; product analysts to bring algorithmic &amp; predictive features to our knowledge &amp; collaboration platform</div></li>\n<li>\n<div>Contribute to design &amp; oversee implementation of metrics that guide business decision-making across practices</div></li>\n<li>\n<div>Oversee implementation of Knowledge Services data strategy &amp; work with departments across the firm to design and develop a leverageable data layer<b></b></div></li></ul>\n<p><b> </b></p> Qualifications<p><b>Experience Required:</b></p>\n<ul>\n<li>\n<div><b></b>Bachelors Degree in Computer Science, Engineering, Mathematics, or similar technical field</div></li>\n<li>\n<div>A minimum of one year work experience in a software environment(product management or development)</div></li>\n<li>\n<div>UX experience a plus</div></li>\n<li>\n<div>Must have unrestricted authorization to work in the United States.</div></li></ul>\n<p><b> </b></p>\n<p><b>Skills and Attributes:</b> </p>\n<ul>\n<li>\n<div>Strong analytical and problem-solving skills</div></li>\n<li>\n<div>Creative and forward thinking</div></li>\n<li>\n<div>Proactive and responsive</div></li>\n<li>\n<div>Self-starter who has an appetite for learning and is driven to excel and grow</div></li>\n<li>\n<div>Ability to work independently and juggle multiple deadlines</div></li>\n<li>\n<div>Ability to interact with people at all levels of the organization and be part of a collaborative global team</div></li>\n<li>\n<div>Ability to synthesize complex concepts into concise talking points</div></li></ul>\n<p><b> </b></p>\n<p><b>Technical Skills:</b></p>\n<ul>\n<li>\n<div><b></b>Strong mathematical / statistical analytics capabilities</div></li>\n<li>\n<div>Strong knowledge in at least one of the following fields: machine learning, natural language processing, algorithm design</div></li>\n<li>\n<div>Strong in one or more query languages (SQL, Hadoop, or BigQuery, etc.)</div></li></ul>\n<p> </p>\n<p> </p>\n<p>.</p> NEW008AT-en NEW008AT"}