{"job title": "Business Intelligence Analyst", "company": "Olympus Corporation of the Americas", "city state": "– Center Valley, PA", "rating": "3.5", "job description": "Analyst, Business Intelligence\n<br><br>\n13-Aug-2018\n<br><br>\n<strong>Work Location</strong>\n<br>\nHeadquarters OAI\n<br><br>\n<strong>Job Description</strong>\n<br>\nAre you looking for a company that cares about people’s lives and health, including yours? At Olympus, we help make people’s lives healthier, safer and more fulfilling, every day. We’re currently looking for a Business Intelligence Analyst to join us in our Center Valley office.\n<br><br>\n<strong>Let’s inspire healthier lives, together.</strong>\n<br><br>\nOlympus Financial Services (FIS) is a leading provider of equipment and technology financing solutions. The FIS Operations department is responsible for administering lease documentation, coordinating transaction fulfillment and managing a portfolio of $550MM in leased assets. The group works cross functionally with Sales, Marketing, Salesforce Enablement &amp; Finance teams to design flexible programs and promotions while ensuring economic returns are aligned with Olympus’ business goals and customer’s needs. The Business Intelligence Analyst (BIA) is responsible for data analysis of opportunities and portfolio characteristics to improve portfolio level pricing, streamline transaction flow and achieve efficiencies through development of automated solutions. He/she will require an individual with strong data mining &amp; analytical skills, familiarity with financial structures and a proven record of successfully coordinating cross-functional teamwork to achieve critical deliverable timelines. In summary, the BIA applies best practices for the collection, integration, analysis, and presentation of information to management to support better business decision making. The incumbent has strong communication skills.\n<br><br>\n<strong>Job Requirements:</strong>\n<br>\n<strong>REQUIRED QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Minimum of 3 years Business Analysis experience, preferably in a financial related field (Banking, Leasing, Financial Services).</li>\n<li>Minimal travel requirements. Travel not ordinarily required; however, overnight travel 1-2 times a year may be necessary for national sales meetings, leasing industry events or business unit business reviews. No international travel.</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Bachelor’s Degree or equivalent knowledge.</li>\n<li>Solid knowledge with report writer, SQL and querying tools required.</li>\n<li>Must have advanced Microsoft Access, Excel, PowerPoint skills.</li>\n<li>Sharepoint skills are a plus. Strong financial planning and analysis skills.</li>\n<li>Understanding of Lease &amp; Financial Contract Structures.</li>\n<li>Knowledge of lending and leasing.</li>\n<li>Strong business acumen.</li>\n<li>Solid understanding of financial modeling.</li>\n<li>Strong problem solving skills</li>\n<li>Outstanding communication skills (oral and written) and ability to sell ideas Team-oriented, collaborative and flexible</li>\n<li>Results-oriented and self-motivated with a commitment to excellence</li>\n<li>Creative, lateral thinker with ability to deal with ambiguity and uncertainty</li>\n<li>Strong sense of urgency and the ability to work under tight deadlines</li>\n\n<strong><li>Competencies:</li>\n\n</strong>\n\n<li>Ability to multi-task and desire to learn.</li>\n<li>Must be detail oriented and able to work under pressure.</li>\n<li>Demonstrates initiative and critical thinking.</li>\n<li>Delivers high quality work and communicates effectively.</li>\n<li>Demonstrating Tenacity and Perseverance: Maintains high levels of energy and enthusiasm over an extended amount of time; does not give up when faced with challenging obstacles; completes what he/she starts; sees projects through to the end - *Maintaining Objectivity: Able to see issues from multiple perspectives; acknowledges and controls for existing assumptions and beliefs that might influence his/her views</li>\n<li>Solving Complex Problems: Breaks down large problems into smaller, more manageable components; identifies key factors that influence the viability of different solutions; clarifies information needed to solve problems</li>\n<li>Working with Financial Information: Understands how financial information is used to guide business decisions; develops accurate financial forecasts; considers decisions from a financial perspective</li>\n<li>Working with Ambiguity: Achieves forward progress in the face of poorly defined situations and/or unclear goals; able to work effectively with limited or partial information.</li>\n</ul>\n\n<strong>We realize work isn’t just a job to you.</strong>\n<br><br>\nIt’s a big part of your life, but not the only part. That’s why we offer competitive salaries, a robust 401(k) program, annual bonus program and comprehensive medical benefits, as well as tuition reimbursement, flexible schedules, parental and adoption leave, on-site services and Colleague Affinity Networks — so you can be ready for where life can take you.\n<br><br>\n<strong>Company URL</strong>\n<br>\nOlympus America Inc\n<br><br>\n<strong>Auto req ID</strong>\n<br>\n<strong>4033BR</strong>\n<br><br>\n<strong></strong>"}