{"job title": "Senior Business Intelligence Analyst", "company": "Olympus Corporation of the Americas", "city state": "– Brooklyn Park, MN", "rating": "3.5", "job description": "<br><b></b><br>Analyst, Sr., Business Intelligence<br><br><b></b><br>02-Aug-2018<br><br><b>Work Location</b><br>Brooklyn Park GYR ACMI Inc <br><br><b>Job Description</b><br>Are you looking for a company that cares about people’s lives and health, including yours? At Olympus, we help make people’s lives healthier, safer and more fulfilling, every day. We’re currently looking for a Sr. Business Intelligence Analyst to join us in our Brooklyn Park, MN office.<br> <br><strong>Let’s inspire healthier lives, together.</strong><br><br>The Senior Business Intelligence Analyst is required to support Business Intelligence activities for OSTA (and globally as needed). The incumbent will support the OSTA sales analytics, managing global trends that affect the business, and supporting intelligence monitoring efforts. He/She will play a pivotal role in ensuring data is delivered in an accurate and user friendly mechanism to the user/requester and that it is later available to the OSTA and Olympus teams with a format that can be accessed and understood by individuals that did not conduct the research (summary of approach, all sources cited, assumptions, etc). The incumbent will also play a primary role to fulfill requests from assigned BU Strategy Committee. This is a new position and the result of his/her work will fill knowledge gaps for the BU, MBC’s and International SBCs. The incumbent will report to the Business Intelligence Manager and will be responsible for supporting research and analysis activities required for product development and launch activities, strategy development and lifecycle management. He/She will work together with the Upstream Leader to define the right customer input plan for each project or initiative requested and they will help the teams/requestors plan and budget for these activities. He/She will drive the outlining and fine tuning of the scope of work of all major customer input initiatives utilizing outside firms and provide direction for smaller scale activities as needed. The Sr. Business Intelligence Analyst will be responsible for all BI deliverables that are part of the new Business Requirements process with minimal support. In this position, the he/she will need to be a strong collaborator and make recommendations and drive research initiatives that help the business make strong, data-driven decisions. The incumbent should be able to review large amounts of data from primary and secondary sources and distill them into actionable insights. The Senior Analyst must Develop a very good understanding of the clinical usage, market needs, market trends, competitive forces and existing and future technologies for the clinical disciplines supported by the role. The incumbent will develop and maintain a deep understanding of tools and resources available to support global research, customer input and strategy development initiatives. He/She will work closely with Upstream Marketing, but also collaborate with Downstream Marketing, Global BI teams and other stakeholders as needed.<br> <br><br><b>Job Requirements:</b><br><strong>REQUIRED QUALIFICATIONS:</strong><br><br>* Bachelor's Degree in Marketing, Marketing Research, Finance, Accounting, MIS, CIS, or related field is required.<br><br>* Minimum of 6 years of total business experience is required.<br><br>* Minimum of 3 years of proven experience in a research/market intelligence/Business Intelligence role within the Medical Device field is required; Minimum of 3 years of experience as a Business Intelligence Analyst is preferred.<br><br><strong>PREFERRED QUALIFICATIONS:</strong><br><br>* Advanced knowledge of Business Intelligence software platforms, e.g., Microstrategy. <br><br>* Proven Experience managing primary research projects, selecting &amp; working with research agencies.<br><br>* Expert knowledge of Excel and other database management systems.<br><br>* Strong presentation skills.<br><br>* Ability to lead and report on all assignments.<br><br>* Significant ability to balance service aspects of role while simultaneously drive to self developed solutions.<br><br>* Strong command of the English language to proofread and write as needed.<br><br>* Ability to thrive as independent worker or in a team environment as a valued contributor or an influential leader.<br><br>* Expert knowledge of MS Office software applications, and proven experience building presentations tailored to different level audiences.<br><br>* Knowledge of Marketing Research principles with ability to become internal expert.<br><br>* Demonstrated writing and business correspondence skills, written and verbal.<br><br>* Strong analytical skills and ability to analyze spreadsheets and reports.<br><br>* Excellent spelling, grammar and proof-reading skills.<br><br>* Proven experience building market models at different stages of research projects.<br><br>* Project management skills and the ability to multitask with detailed follow-through on deadlines.<br><br>* Self-starter with a sense of ownership and urgency.<br><br>* Above-average creative problem solver.<br><br>* Good relationship building skills.<br><br>* Ability to learn and grasp medical procedures and related technologies.<br><br>* Flexible, team player.<br><br><br><br><strong>We realize work isn’t just a job to you.</strong><br> <br>It’s a big part of your life, but not the only part. That’s why we offer competitive salaries, a robust 401(k) program, annual bonus program and comprehensive medical benefits, as well as tuition reimbursement, flexible schedules, parental and adoption leave, on-site services and Colleague Affinity Networks — so you can be ready for where life can take you.<br> <br><br><b>Company URL</b><br>Olympus Surgical Technology America <br><br><b>Auto req ID</b><br>3998BR<br><br><b></b>"}