{"job title": "Data Scientist", "company": "ON Semiconductor", "city state": "– Phoenix, AZ", "rating": "3.6", "job description": "Job Overview\n<br><br>\nWe are looking for a data scientist to help grow ON?s\n<br>\nBusiness Intelligence &amp; Analytics team capabilities from descriptive to\n<br>\npredictive. This is an unprecedented, blue ocean opportunity to impact a group,\n<br>\nan information technology (IT) organization, and a growing, $5.8B enterprise that\n<br>\nrecognizes the need to evolve.\n<br><br>\nOperating in VUCA (volatile, uncertain, complex, and\n<br>\nambiguous) environments, you?ll build business partnerships, educate senior\n<br>\nexecutives, create predictive models, and influence enterprise decisions.\n<br>\nFortunately, no pre-existing data science legacies exist to shackle your\n<br>\nstrategies or tactics.\n<br><br>\nIs our blue ocean the one you seek?\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n<br><br>\nThe successful candidate will\n<br><br>\n+ Collaborate with business partners to identify &amp;align on significant business challenges\n<br><br>\n+ Rapidly prototype / operationalize predictivemodels to deliver impactful &amp; actionable insights that address saidchallenges\n<br><br>\n+ Educate senior business leaders on the accuracy,completeness, and value of predictive model insights\n<br><br>\n+ Evangelize, educate, and drive consensusfor predictive models and their associated roadmaps to business partners,information technology (IT), and other stakeholders\n<br><br>\n+ Design &amp; deliver IT data scienceprogram to help transform analytics capabilities from descriptive to predictive\n<br><br>\n+ Participate in annual operating plan&amp; capital budget generation &amp; management\n<br><br>\n+ Participate in staff activitystatus, problem resolution, prioritization, and project planning\n<br><br>\n+ Establish and maintain effectivecommunication and relationships within ON and 3 rd party suppliers\n<br><br>\n+ Develop, analyze, and optimize predictiveanalytics roadmap based on accuracy, effectiveness, scalability,future-proofing, cost, and efficiency\n<br><br>\n<strong>Competencies</strong>\n<br>\n<strong>and Skills:</strong>\n<br><br>\n+ Bachelor?s degree in data science,business analytics, engineering, artificial intelligence, information systems,applied/traditional statistics, mathematics, computer science, computerengineering, information technology, or a related field.\n<br><br>\n+ Optional: Master?s degree in theaforementioned\n<br><br>\n+ 3 years? experience working withbusiness partners to identify &amp; align on significant businesschallenges\n<br><br>\n+ 3 years? experience prototyping / operationalizing predictive models to deliver impactful&amp; actionable insights\n<br><br>\n+ 1 years? experience training orteaching data science principles and practices\n<br><br>\n+ Must work effectively in VUCAenvironments\n<br><br>\n+ Must work with little or no directsupervision\n<br><br>\n+ Must work with all levels of theorganization\n<br><br>\n+ Excellent communication anddocumentation skills\n<br><br>\nCareer Benefits of Working at ON Semiconductor:\n<br><br>\n+ Global, multi-cultural company with internationalcollaboration and travel opportunities\n<br><br>\n+ Work with highly-skilled team members across multipleinfrastructure and applications disciplines\n<br><br>\n<strong>ON</strong>\n<br>\nSemiconductor (Nasdaq: ON) is driving energy efficient innovations, empowering\n<br>\ncustomers to reduce global energy use. The company is a leading supplier of\n<br>\nsemiconductor-based solutions, offering a comprehensive portfolio of energy\n<br>\nefficient power management, analog, sensors, logic, timing, connectivity,\n<br>\ndiscrete, SoC and custom devices. The company?s products help engineers solve\n<br>\ntheir unique design challenges in automotive, communications, computing, consumer,\n<br>\nindustrial, medical, aerospace and defense applications .\n<br>\nON Semiconductor operates a responsive, reliable, world-class supply chain and\n<br>\nquality program, a robust compliance and ethics program, and a network of\n<br>\nmanufacturing facilities, sales offices and design centers in key markets\n<br>\nthroughout North America, Europe and the Asia Pacific regions. For more\n<br>\ninformation, visit http://www.onsemi.com at http://www.onsemi.com/ .\n\n\n<ul>\n<li>*Job:** _IT_</li>\n<li>*Title:** _Data Scientist_</li>\n<li>*Location:** _AZ-Phoenix_</li>\n<li>*Requisition ID:** _1806116_</li>\n</ul>\n\nON Semiconductor is an Equal Employment Opportunity Employer and prohibits discrimination on the basis of age, race, color, religion, gender, sexual orientation, national origin, citizenship, protected veteran status, disability status, or any other federal, state or local protected classes. ON is committed to providing equal employment opportunity to qualified individuals, regardless of protect class status."}