{"job title": "Data Scientist (Analytics)", "company": "Opendoor", "city state": "– San Francisco, CA", "rating": "4.4", "job description": "<div><strong>About Opendoor</strong></div><div>At Opendoor, were on a mission to make it simple to buy and sell homes. The traditional process is broken, with an average home taking over 90 days to sell and costing thousands of dollars. We make buying and selling home stress-free and instant. Weve built an exceptional team, have raised over $600 million from top-notch investors and are growing fast, buying and selling more than $100 million of homes per month.</div><br>\n<div>Were seeking an exceptional Data Scientist to join us to work on our core products such as our seller and buyer experiences, internal tools and pricing algorithms. You will drive data-informed decisions for the business and guide our product direction with your insights.</div><br>\n<div>Day to day you will understand business impact product decisions, using a combination of statistical modeling and business intuition to uncover insights from our data, and build processes generate robust metrics for teams to track to.</div>As a Data Scientist you will:\n\n<ul>\n<li>Partner with product, engineering, operations and finance teams to find opportunities, make smart trade-offs, and understand customer impact of new features</li><li>Use data to inform, influence, support, and execute our product decisions</li><li>Craft statistical models to gain insights from data and communicate results to partners</li><li>Build pipelines to automate generation of metrics to guide the business</li><li>Become a domain expert in real-estate</li>\n</ul>\n\n<strong>Were looking for teammates who bring:</strong>\n\n<ul>\n<li>3+ years of relevant work experience</li><li>Comfort and experience building complex SQL queries</li><li>Deep understanding of statistics(e.g., hypothesis testing, regressions)</li><li>Familiarity with ETL design and analytics workloads, preferably experience in building maintainable pipelines</li><li>Highly self-motivated with the desire to solve open-ended problems</li><li>Resourcefulness, pragmatism and ability to drive business impact</li><li>Strong verbal, written, and interpersonal communication skills</li>\n</ul>\n\n<strong>Bonus points:</strong>\n\n<ul>\n<li>You have experience in experimental design and interpretation</li><li>You love delighting customers with honest, transparent products and experiences</li>\n</ul><br>\n\n<div><strong>Opendoor values Openness</strong></div><div>Our team celebrates our diverse backgrounds. We believe that being open about who we are and what we do allows us to be better. Individuals seeking employment at Opendoor are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, sexual orientation, gender identity or other protected status under all applicable laws, regulations, and ordinances.</div>"}