{"job title": "Data Scientist", "company": "Opendoor", "city state": "– San Francisco, CA", "rating": "4.4", "job description": "<div><p></p><div><b>About Opendoor</b></div><div><br></div><div>At Opendoor, we’re on a mission to make it simple to buy and sell homes. The traditional process is broken, with an average home taking over 90 days to sell and costing thousands of dollars. We make buying and selling a home stress-free and instant. We’ve built an exceptional team, have raised over $300 million from top-notch investors and are growing fast, buying and selling more than $100 million of homes per month.</div><div><br></div><div><br></div><div>We’re seeking an exceptional Data Scientist to join us in building data products at the core of the company. We build valuation models, predictive modeling infrastructure, and lead growth experiments. Day to day, it’s a mix of machine learning, crowdsourcing, exploratory data analysis, feature extraction, and software engineering.</div><p></p></div><div><div>As a Data Scientist you will:<ul><ul><li>Improve our industry-leading home valuation model using millions of real-estate transactions and complementary datasets</li><li>Rapidly prototype features and predictive models</li><li>Build ML pipelines in production</li><li>Identify, research, and analyze new data sources to improve model accuracy</li><li>Become a domain expert in real-estate</li><li>Coordinate with product, engineering, and operations to understand impact and trade-offs of modeling improvements</li></ul></ul></div></div><div><div>We’re looking for teammates who bring:<ul><ul><li>Commitment to rigorous analysis and production-quality code</li><li>Passion for building solid data infrastructure</li><li>A love of tackling complexity in real-world datasets such geo data and transaction data</li><li>Experience in one of Python, R, Java, Scala, Julia; if R or Julia, candidate must be able to make algorithms scale</li><li>Familiarity with basic classes of ML algorithms, concepts in feature extraction and selection</li><li>Ability and desire to communicate your analysis with clarity and precision</li><li>Resourcefulness and pragmatism</li></ul></ul></div></div><div><div>Bonus points:<ul><ul><li>Competition experience in data mining or machine learning</li><li>You love delighting customers with honest, transparent products and experiences</li><li>Experience with GIS data</li></ul></ul></div></div><div><p></p><div><b>Who you’ll work with:</b></div><div><br></div><div><b>Ian Wong - </b>Ian is an Opendoor co-founder who cares about mixing good math with good engineering to solve hard problems. He previously built fraud detection systems at Square and products at Prismatic.</div><div><br></div><div><b>Nelson Ray - </b>Nelson is a data scientist who was formerly on the AdWords team at Google. He enjoys food, wine, and experimentation. He hosts Opendoor’s blind wine tastings and will rank your performance based on the KL Divergence.</div><div><br></div><div><b>Brian Bloniarz - </b>Brian's interested in any problem where computers, data and the real world meet. He's built automated trading systems in stocks and now in houses [hint: houses are more interesting].</div><div><br></div><div><b>… and the rest of </b><b>our team</b><b>!</b></div><div><br></div><div><b>Opendoor values Openness</b></div><div><br></div><div>Our team celebrates our diverse backgrounds, being open about who we are and what we do allows us to be better. Individuals seeking employment at Opendoor are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, sexual orientation, gender identity or other protected status under all applicable laws, regulations, and ordinances.</div><div><br></div><div>This position is for employment at will and not for any definite time period.</div><div><br></div><p></p></div>"}