{"job title": "Data Scientist", "company": "OpenSlate", "city state": "– New York, NY", "rating": "3.1", "job description": "As Data Scientist at OpenSlate, you will examine and process statistical metadata sourced from both public and private APIs to assist our clients in making better marketing decisions. You will utilize your skills in statistics to derive new metrics and processing methodologies for existing data as well as determining how data from new sources could be useful. You will work closely with the data science and engineering team to improve computational efficiency of existing software, develop new data models, and discover new data stories within our existing database.\n<br><br>\nKey requirements include:\n\n<ul>\n<li>Excellent communication skills when working with other team members to translate business problems to actionable tools, insights and models</li>\n<li>MS or PhD in Mathematics, Statistics, or other applicable field of \u2028study or equivalent work experience</li>\n<li>Experience solving problems using statistical and quantitative tools</li> \n\n<li>Experience developing statistical models and analysis using text and numerical data</li>\n<li>Strong statistical skills</li>\n<li>Strong programming skills in python</li>\n<li>Experience using scikit-learn or TensorFlow</li>\n<li>Understanding of database technologies and the ability to \u2028formulate complex queries to extract data</li>\n<li>Ability to examine large quantities of data, derive useful patterns, and turn that \u2028observation into practical code</li>\n<li>Being a goal-oriented self-starter</li>\n<li>Possession of an enthusiastic and curious mind</li> \n\n<li>A team player who enjoys collaborating with others</li>\n</ul>\nIdeal candidates will also have:\n\n<ul>\n<li>Advanced programming skills, preferably with Python \u2028</li>\n<li>Advanced competence in SQL\u2028</li>\n<li>Experience applying NLP to data science problems</li>\n<li>Familiarity navigating a command line environment in *nix-based systems</li>\n<li>Prior exposure to distributed data platforms such as Apache Spark, Hadoop, Hive, Pig, Cassandra, EMR, Redshift</li>\n<li>Experience building data visualizations to illustrate complex concepts</li>\n</ul>\n\n<br>"}