{"job title": "Data Engineer (Python)", "company": "OpenSlate", "city state": "– New York, NY", "rating": "3.1", "job description": "As Data Engineer you’ll be working on our data processing pipeline: collecting, analyzing and transforming billions of data points in order to make this data accessible to our Data Science and Application Engineering teams. You’ll be using your experience building large-scale data systems to design processes that scale up as our data grows and allow us to utilize our infrastructure efficiently.\n<br><br>\n<strong>Responsibilities</strong>:\n\n<ul>\n<li>Designing and building scalable systems that can collect, store, retrieve and transform data coming from a variety of different sources including APIs, Postgres, Solr, S3, message queues and Apache Cassandra.</li>\n<li>Selecting appropriate data storage and retrieval methods and technologies.</li>\n<li>Designing data-structures and optimizing queries that deal with millions of rows of data.</li>\n<li>Creating reusable and maintainable code, automated tests and clear documentation.</li>\n<li>Optimizing your code to run in a high-performance real time environment that generates billions of data points a day.</li>\n<li>Supporting the software and systems you write and deploy in our production environment.</li>\n<li>Collaborating across engineering, product and data teams to solve technical and business issues.</li> \n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>4+ years experience building and scaling Python-based data processing systems in a Linux environment.</li>\n<li>Expertise working with Apache Spark clusters.</li>\n<li>Experience working with data originating from multiple sources: RDBMS, APIs, text files, messages queues.</li>\n<li>Expertise working with RDBMS, including schema design, writing SQL for complex multi-table queries and optimizing query performance.</li>\n<li>Experience writing automated tests for your own code, as well as data validation tests to ensure accuracy.</li>\n<li>Expertise in using Git and Git branching models.</li>\n<li>You enjoy working as a part of a collaborative team and demonstrate an open mindset.</li>\n<li>Strong communication skills: able to clearly articulate, defend and document design decisions and work with a cross-discipline team.</li>\n<li>A love of problem solving and a sense of imagination.</li>\n</ul>\n<strong>Other valuable skills:</strong>\n\n<ul>\n<li>Experience working with distributed data stores like Cassandra or Hadoop HDFS.</li>\n<li>Experience with Spark ML or Spark Streaming.</li>\n<li>Experience working with message queues, like RabbitMQ or Kafka.</li>\n<li>Experience designing schemas for efficiently indexing and searching content in Solr or Elasticsearch.</li>\n<li>Familiarity with AWS (specifically EC2, EBS, and S3)</li>\n<li>Experience in ad technologies and/or the online advertising space.</li>\n</ul>\n\n<br>"}