{"job title": "Data Scientist/Sr. Data Scientist, Credit Cards", "company": "Oportun. Inc", "city state": "– San Carlos, CA", "rating": "3.6", "job description": "Oportun is a financial technology company founded in 2005. Our mission is to provide affordable loans that help people with little or no credit history establish credit and build a better future. Oportun uses advanced data analytics and technology to “score” and lend money to individuals who other lenders consider “unscorable” because of their limited credit history.\n<br><br>\nBetween our first loan in 2006 and March 2018, Oportun disbursed more than $5 billion in 2+ million affordable loans. During that time, Oportun customers also saved more than $1.1 billion in interest and fees by choosing an Oportun loan instead of one of the alternatives that are widely available to people with little or no credit history.\n<br><br>\nIn recognition of Oportun’s goals of increasing economic opportunity for our clients, promoting community development, and serving low-income or underserved communities, Oportun was certified by the United States Department of Treasury as a Community Development Financial Institution or CDFI.\n<br><br>\nOportun is a great place to work if you are as enthusiastic about helping others as you are about your own professional development and career. As our CEO Raul Vazquez says, <em>“Earning a paycheck to support yourself and your family is critical. Satisfying career ambitions is rewarding. <strong>But there is no greater privilege than having a challenging job where you are growing and learning professionally, while having a strong positive impact on the lives of others… And that is what we do here every day</strong>.”</em>\n<br><br>\n<strong>SUMMARY:</strong>\n<br><br>\nWe are growing our world-class team of mission-driven, entrepreneurial Data Scientists who are passionate about broadening financial inclusion by untapping insights from non-traditional data. Be part of the team responsible for developing and enhancing Oportun’s core intellectual property used in scoring risk for underbanked consumers that lack a traditional credit bureau score. In this role you will be on the cutting edge working with large and diverse (i.e. data from dozens of sources including transactional, mobile, utility, and other financial services) alternative data sets and utilize machine learning and statistical modeling to build scores and strategies for managing risk, take-up rates and fraud. You will also drive growth and optimize marketing spend across channels by leveraging alternative data to help predict which consumers would likely be interested in Oportun’s affordable, credit building loan product.\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n<ul>\n<li>Develop risk, profitability, fraud and targeting models used to support rapid growth across multiple channels (mobile/web, mail, telesales, in-store)</li><li>Discover insights from a myriad of data sources to understand and influence consumer financial behavior</li><li>Develop new complex features to be used to build next generation of machine learning models by combining techniques and business acumen</li><li>Drive business strategy and company growth rates by leveraging advanced analytics</li><li>Recommend analytic solutions to increase Oportun’s marketable universe and identify profitable prospects</li><li>Collaborate with Data Engineering and Production Platform Engineering teams to roll out build new models, strategies or verification methods</li><li>Design and build credit risk and marketing analytics infrastructure for managing risk/marketing</li><li>Support direct marketing program for consumers that lack a traditional bureau score</li><li>Communicate and partner with third party data vendors</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>Master’s degree in Statistics, Mathematics, Computer Science, Engineering, or Economics (Bachelors’ degree with significant relevant experience will be considered)</li><li>Bachelor’s degree in Statistics, Mathematics, Computer Science, Engineering, Economics, Business, or other quantitative discipline</li><li>3+ years of coding experience using open source machine learning toolset within Python, H2O, SAS and/or Spark environments</li><li>3+ years of experience leveraging machine learning techniques such as Gradient Boosting, Logistic Regression, and Decision Trees, among others</li><li>3+ years of experience preparing and leveraging data for models and actionable analyses</li><li>3+ years of analytical experience in financial services, consulting, data science, or risk management</li><li>A relentless problem solver, out of the box thinker, and proven track record to drive business results in a timely manner</li><li>Excellent written and oral communication skills</li><li>Familiarity with big data toolset such as Spark / Hadoop</li><li>Experience working with AWS or other cloud based platforms is a plus</li><li>Experience with experimental designs a plus</li><li>Comfortable in a high-growth, fast-paced, agile environment</li>\n</ul>"}