{"job title": "Data Scientist", "company": "Optoro", "city state": "– Washington, DC", "rating": "4.5", "job description": "Optoro is a fast-growing technology company that is revolutionizing the retail industry. Every year, more than 15% of retail goods are returned or simply never sell. This creates tons of unnecessary waste and costs retailers billions.\n<br><br>\n<strong>Our mission is to</strong> <strong>eliminate all waste from returns.</strong> Our technology platform connects every returned item to its best home, thereby increasing profitability for retailers, giving consumers great deals, and reducing environmental waste.\n<br><br>\nBacked by some of the top investors in the country - including Kleiner Perkins, Revolution Growth, and UPS - Optoro is powered by its collaborative, unconventional, and resourceful employees who love solving big problems. We are looking for individuals with similar creativity and energy to help build a lasting company focused on the triple bottom line.\n<br><br>\nOptoros Data Science team is responsible for turning our massive data resources into actionable insights that inform our products and business processes. Our team values creativity, willingness to embrace new methods and technology, and the ability to solve problems independently.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Develop statistical models via supervised and unsupervised machine learning, statistical analysis, and other predictive modeling techniques that address business challenges.</li>\n<li>Manipulate complex, high-volume, high-dimensionality data from varying sources to provide insights into enhancing Optoros SmartDisposition algorithm and pricing algorithms.</li>\n<li>Identify trends and systematic patterns within datasets that illuminate strategic enhancements to business processes.</li>\n<li>Monitor results of deployed algorithms for accuracy, drift over time, and robustness to new data.</li>\n<li>Design and execute A/B and multi-armed bandit tests of business logic.</li>\n<li>Produce reports and data visualizations using Tableau and other tools.</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>Strong mathematical and statistical background; B.A. (graduate degree preferred) in a relevant quantitative field (e.g. applied mathematics, statistics, physics, computer science, operations research); or 3+ years experience in a relevant role.</li>\n<li>Deep understanding of data analysis, machine learning, and data communication across multiple domain areas.</li>\n<li>Experience with the Python statistical programming stack (NumPy, pandas scikit-learn, etc). We also welcome candidates who come primarily from an R background but want to learn Python.</li>\n<li>Ability to deal with ambiguity in a fast-paced, dynamic environment.</li>\n<li>Proven experience thinking creatively about challenging, analytical problems.</li>\n<li>Experience with eCommerce, economic theory, Ruby on Rails, Airflow, Kafka, and PostgreSQL are all a plus!</li>\n</ul>\nOptoro is an equal opportunity employer."}