{"job title": "Data Scientist", "company": "Optym", "city state": "– Gainesville", "rating": "4.4", "job description": "Data Scientist<div><ul><li>Full Time</li><li>Gainesville</li><li>Posted 6 days ago</li></ul><div> <p> Website <strong>Optym</strong></p></div><div><p>We are looking for a data scientist that will help us discover the information hidden in vast amounts of data and help us make smarter decisions to deliver even better products. Your primary focus will be in applying data mining techniques, doing statistical analysis, and building high quality prediction systems integrated with our products.</p><p><strong>Essential Functions</strong></p><ul><li>Feature Selection, Creating and Optimizing Machine Learning Algorithms using Machine Learning Techniques.</li><li>Applying Machine Learning/Data mining Algorithms using state-of-the-art methods like SVM, Neural networks, Mixture models etc. in Real World Datsets in Transportation Industry.</li><li>Experimenting with data using third party sources when required.</li><li>Performing Model Selection Among various Models to Get optimal Result.</li><li>Preparing and Cleaning Up Data.</li><li>Pattern recognition, Statistical Inference, and model estimation using big data sources</li><li>Apply regression (linear, nonlinear, logistic), decision trees, cluster analysis and other machine learning algorithms</li></ul><p><strong>Technical Competencies</strong></p><ul><li>Thorough knowledge of machine learning techniques and algorithms.</li><li>Industry or Academic Experience in one of The Languages: R, MatLab or Python (Preferably Python)</li><li>Proficiency in query Languages like hive, pig or SQL.</li><li>Preferred Experience with NoSQL databases like Mongodb.</li><li>Good Skills in Applied Math., such as Probability Distributions, Statistical Testing, Regression, etc.</li><li>Solid Programming Skills in One Of the Languages: C#, Java, C++.</li></ul><p><strong>Required Education and Experience: </strong>MS. or Ph.D. degree in Computer Science, Statistics, Operations Research, Mathematics, Machine Learning</p></div><div> <div> Full name<div> </div> Email address<div> </div> Phone Number<div> </div> Current Location (optional)<div> </div> Willing to relocate to Gainesville, Florida?<div> YesNo </div> Please select your degree level<div> BachelorsMastersPh.D.Other </div> Name of University:<div> </div> Graduation Date (Expected or Completed):<div> (MM-YY) Can be future or past</div> Total years work experience<div> </div> LinkedIn Profile (optional)<div> </div> Resume / CV:<div><div></div> (PDF or Word formats only ) max file size: 4MB </div> Cover Letter (optional)<div><div></div> (PDF or Word formats only ) max file size: 4MB </div><p> </p></div></div></div>"}