{"job title": "Principal Data Scientist - Cloud Platform Data Analytics Group", "company": "Oracle Corporation UK Ltd", "city state": "– Redwood City, California", "rating": "NA", "job description": "Principal Data Scientist - Cloud Platform Data Analytics Group\n<br><br>\n<strong>18000Z3Q</strong>\n<br><br>\nOur mission is to understand the end-to-end journey of our PaaS customers through the phases of learn, try, buy and use. We model both users and their behavior in order to improve the design of PaaS products and ****************, giving the business critical insights it needs to track the success of our designs. We gain the insights by analyzing behavioral data from Adobe Analytics, Infinity Analytics, and other available data. We also plan to conduct A/B and multivariate (A/n) testing to evaluate design alternatives.\n<br><br>\nData Scientist Responsibilities\n<br><br>\nWorking with stakeholders to define the questions that need to be answered with the data.\n<br><br>\nAnalyzing and modeling data to answer business questions.\n<br><br>\nDesigning and analyzing A/B (A/n) testing.\n<br><br>\nCreating scripts in R and/or Python to create repeatable analyses.\n<br><br>\nCreating dashboards and other reporting.\n<br>\nData Scientist Qualifications\n<br><br>\nKnowledge of predictive modeling and machine learning.\n<br><br>\nStrong knowledge of statistical concepts. A strong understanding of regression is a must.\n<br><br>\nExcellent data visualization skills.\n<br><br>\nBA/BS or Master's degree with emphasis on coursework of a quantitative nature (e.g., Statistics, Computer Science, Engineering, Mathematics, Data Sciences).\n<br><br>\nExperience working with large-scale distributed data systems.\n<br><br>\nExcellent written and verbal communication skills.\n<br><br>\nSolid business acumen including the ability to discern which problems are important to solve for the business.\n<br><br>\nAbility to articulate and explain data in writing or verbally to stakeholders and executives in a clear and concise way.\n<br><br>\nFamiliarity with statistical software (e.g. R, Python).\n<br><br>\nSome familiarity with the Hadoop ecosystem.\n<br><br>\nExperience working with large analytics platforms.\n<br><br>\nDesigns, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse big data sources to generate actionable insights and solutions for client services and product enhancement.\n<br><br>\nInteracts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.\n<br><br>\nLeading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. 8 years relevant work experience. BS/BA preferred.\n<br><br>\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\n<br><br>\nBusiness Operations\n<br><br>\nUS-CA,California-Redwood City\n<br><br>\nUS-WA,Washington-Seattle\n<br><br>\nRegular Employee Hire\n<br><br>\nOracle"}