{"job title": "Senior Data Scientist | Product Development", "company": "Oracle", "city state": "– California-San Francisco", "rating": "3.4", "job description": "Designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse “big data” sources to generate actionable insights and solutions for client services and product enhancement.\n<br><br>\nInteracts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.\n<br><br>\nJob duties are varied and complex utilizing independent judgment. May have project lead role. 5 years relevant work experience. BS/BA preferred.\n<br><br>\n<strong>Oracle will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco's Fair Chance Ordinance.</strong>\n<br><br>\n<strong>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.</strong><br>\n\n<div>Senior Data Scientist - R&amp;D Product Team</div> <div>Oracle Utilities Global Business Unit</div><div>Reston, Virginia office</div> <br>\n<div>We are looking for a Senior Data Scientist to join the R&amp;D team within the Utilities Product Group. In this role you will work with software developers and other data scientists to build and grow the foundational analytics, as well as new product functionalities for the DataRaker platform leveraging its 100TB of cloud-hosted data. The Data Science team works cross-functionally with software developers, data scientists, product managers, and client success managers to ensure our product is robust and can deliver high impact value to utilities.</div> <br>\n<div>We use a combination of technologies, platforms, libraries, and our proprietary tools, to research, build and test our product’s core analytics. Position reports to the Sr. Director of Development.</div><br>\n<div><strong>Responsibilities</strong></div><div></div><div> Materially contribute to the research, test, and deployment of a diverse set of data science models.</div><div> Work closely with peers, within and outside the team, to build the best models using the most appropriate ML techniques and approaches.</div><div> Collaborate with members of the engineering, delivery analytics, and other Utilities data science teams.</div><div> Deliver compelling products that provide considerable customer value.</div><div> Become recognized inside and outside engineering as a subject matter expert.</div><br>\n<div><strong>About You</strong></div><div></div><div>\n\n<ul>\n<li>5 years experience as a software engineer or data scientist working in Python, Java, or Scala.</li><li>Experience building large scale operational models running on Spark.</li><li> Deep knowledge or one or more notebook environments like Zeppelin or Jupyter.</li><li> A solid engineer who’s comfortable working with data scientists or vice-versa.</li><li> Experience working in agile environments and can lead a team through daily stand ups, estimation, and other agile processes.</li><li> Ability to take ownership of product areas that you touch and encourage your team to do the same.</li><li> Communicates well with engineers and non-engineers alike.</li><li> Embraces the use of cutting edge technology.</li></ul></div>\n<br>"}