{"job title": "Data Scientist - Global IT Team", "company": "Oracle", "city state": "– Reston, VA", "rating": "3.4", "job description": "Designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse big data sources to generate actionable insights and solutions for client services and product enhancement.\n<br><br>\nInteracts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.\n<br><br>\nAcknowledged authority within the Corporation. Acts as a leader of large-scale company initiatives. Viewed by peers as a leader and top contributor and by line management as a key business partner. 10 plus years experience. BA/BS degree preferred.\n\n\n<ul>\n<li>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.*</li>\n</ul>\n\n<strong>ORACLE'S GLOBAL IT TEAM</strong>\n<br><br>\nData Scientist\n<br><br>\nOracle's Business Enterprise and Strategy (BES) delivers several critical services to the entire Global IT (GIT) organization encompassing key areas such as Business Relationship Management, Vendor Engagement, Communications, M&amp;A and Enterprise Architecture.\n<br><br>\nWe are looking to fulfill a key Data Scientist role to build-out a recommendation system based on statistical models and BI analysis. The Data Scientist will be responsible for creating reports and findings to be presented to GIT Leadership Team (LT) by exposing assumptions, validation work, and ROI/ business case formulation that can be easily understood. The ideal candidate can demonstrate excellent communications skills needed for cross-departmental collaboration.\n<br><br>\n<strong>_</strong>\n<br><br>\n<strong>_</strong>\n<br><br>\nThe candidates will be reporting to the Senior Director of Vendor Engagement and will focus on accurate data generation while leveraging existing Oracle and Open Source tools. This is in support of the GIT vision of Cloud First deployments.\n<br><br>\n_Responsibilities Include:_\n<br><br>\n<strong>__</strong>\n<br><br>\nUnderstanding of statistical models, linear algebra, clustering and classification__\n<br><br>\nAutomated scoring using machine learning techniques__\n<br><br>\nData wrangling, data hygiene, and data cleansing techniques\n<br><br>\nModeling complex problems, discovering IT/partner/customer insights and identifying opportunities with visualization techniques using Business Intelligence and similar tools\n<br><br>\nUnderstanding of Oracle Cloud technologies including Oracle and Non-Oracle workloads__\n<br><br>\nData modeling and Data Lake utilizing Hadoop and ingestions of structured, semi-structured, and non-structured data\n<br><br>\n_Requirements_\n<br><br>\nKnowledge and hands-on usage Python and database; Oracle SQL__\n<br><br>\nKafka/Cloudera stack experience\n<br><br>\nOpen Enterprise R or other statistical engineering tools for isolated use case analysis\n<br><br>\nData modeling and Data Lake utilizing Hadoop and ingestion of structured, semi-structured, and non-structured data\n<br><br>\nFamiliarity of statistical tests, distributions, maximum likelihood estimator\n<br><br>\nData wrangling, data hygiene, and data cleansing techniques\n<br><br>\nProficient at integrating and preparing large, varied datasets, designing specialized database and computing environments, and communicating results\n<br><br>\nUnderstanding of Oracle Cloud technologies including Oracle and non-oracle workloads\n<br><br>\nImprove and extend the features along with integration to external systems\n<br><br>\n<strong>Plus:</strong>\n<br><br>\nFamiliar with Oracle Streaming Analytics\n<br><br>\nFamiliar with Oracle tools including Golden Gate, Autonomous DB, Autonomous Analytics, Advanced Analytics on DB\n<br><br>\nPrior experience with Data Analytics, Visualization, and BI tools, preferably to include Predictive, Graph, Spatial, Semantic\n<br><br>\n<strong>Other requirements:</strong>\n<br><br>\nBS/BA degree with a Math focus preferred\n<br><br>\n8-10 years of experience with a BI tool and Statistical Analysis\n<br><br>\nOver 5 years with BI, Data Modeling, Statistical Analysis, SQL\n<br><br>\nProven written communication skills such as publishing blogs, success stories and marketplace listings\n<br><br>\nAbility to adapt to changes quickly\n<br><br>\nPreferred location: Denver, Boulder area, CO\n<br><br>\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\n\n\n<ul>\n<li>*Job:** **Business Operations*</li>\n<li>*Organization:** **Oracle*</li>\n<li>*Title:** *Data Scientist - Global IT Team*</li>\n<li>*Location:** *United States*</li>\n<li>*Requisition ID:** *18001847*</li>\n</ul>"}