{"job title": "Data Scientist / ML Developer", "company": "Oracle", "city state": "– Redwood City, California", "rating": "3.4", "job description": "<strong><br><br>Preferred Qualifications</strong>\n<br><br>\nThe Database Security Group is chartered to provide a comprehensive portfolio of security solutions to ensure data privacy, protect against insider threats, and enable regulatory compliance for both Oracle and non-Oracle databases. Oracle is the leader and pioneer in database security. Our group continues to innovate and extend the lead on our competitors. Security is essential for businesses and consumers in the information age.\n<br><br>\nOur team within the Database Security Group is responsible for the Oracle Audit Vault and Database Firewall product and Audit Cloud Service. Oracle Audit Vault and Database Firewall consolidates and collates audit data and monitors Oracle and non-Oracle database traffic to detect and block threats. It also provides comprehensive reporting capabilities by consolidating audit data from databases, operating systems, directories, and other sources.\n<br><br>\nOracle Audit Vault and Database Firewall (AVDF) is growing rapidly and we want to expand into new areas such as Cloud and Machine learning based Anomaly detection. To help focus in these areas, we are looking for a Consulting Member of Technical Staff to join our team.\n<br><br>\nResponsibilities:\n<li> Provide Technical leadership, hands-on development for building Anomaly detection/Analytics service</li> <li> Mentor, guide and provide design and code reviews for other engineers</li> <li> Work closely with Product Management, QA and other cross functional teams in all phases of product development</li>\nRequirements:\n<li> Bachelors or Masters degree in Computer Science or related fields is required</li> <li> 8+ years of experience developing Enterprise software/Cloud products</li> <li> 3+ years experience building machine learning based Anomaly detection/Analytics service</li> <li> Strong development experience with Java is required</li> <li> Hands-on Cloud product development experience is desirable</li> <li> Exposure to Data Science concepts desirable</li> <li> Experience with statistical languages and packages, such as R, SAS, Matlab is a plus</li>\n<strong><br><br>Detailed Description and Job Requirements</strong><br><br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n<br><br>\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. Define specifications for significant new projects and specify, design and develop software according to those specifications. You will perform professional software development tasks associated with the developing, designing and debugging of software applications or operating systems.\n<br><br>\nProvide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 more years of software engineering or related experience.\n<br><br>\n<strong> Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.</strong>\n<br><br>\n<strong> Job</strong>\n<br><br>\n:Product Development"}