{"job title": "Principal Software Developer - Data Engineering", "company": "Oracle Corporation UK Ltd", "city state": "– Boulder, Colorado", "rating": "NA", "job description": "Principal Software Developer - Data Engineering\n<br><br>\n<strong>18001EAQ</strong>\n<br><br>\nWe are looking for a seasoned Java engineer to join our Data Engineering group as part of the Oracle Social Cloud. The ideal candidate would have strong leadership abilities and be an expert in the Java ecosystem. The position requires the candidate to design interfaces, build libraries, and construct effective test suites for processing data at scale. If you would love an opportunity to write solid Java, and perhaps author a framework, then this may be a great place for you. The ideal candidate would have a strong drive to write production quality Java code and to solve problems found in the analysis of the social media stream. A curiosity for new techniques and technologies are a requirement, e.g., Scala, machine learning, Flink. Our Product Our platform helps clients understand in real time what is being said about their brands online. This means that we ingest and analyze huge quantities of social media data and news. We have developed a custom data processing pipeline and a proprietary text analytics engine, but to meet customer demands, we are continually evolving these technologies. As we increase the amount of data processed and the sophistication of our analytics services, exciting challenges lie ahead. See this site for further information: *************************************************************** The Technology Stack Our team uses technologies such as Dropwizard, Solr/Lucene, a variety of NLP techniques, Latent Semantic Analysis (LSA), HBase/Hadoop, Spark, Flink, Akka, Redis as well as other \"big data\" technologies in addition to our own in-house technology stacks. The successful candidate is expected to get up to speed on processing lots of data using a combination of Java libraries in a Linux environment. Essential Skills, Knowledge, Abilities, and Background\n<br>\nBS/MS in Computer Science or related field\n<br>\n4+ Years in Software Development\n<br>\n2+ Years as Team lead / Manager role\n<br>\nProficient in modern, core Java\n<br>\nExperience in working with APIs\n<br>\nInterest / experience in big-data technologies such as Hadoop, HBase, Flink, Kafka, Dropwizard\n<br>\nFamiliarity with Linux tools and environment Preferred Qualifications\n<br>\nFamiliarity with Scala libraries and how they interact with Java\n<br>\nFamiliarity with machine learning algorithms, tools and libraries\n<br>\nExperience in technologies such as Akka or other cluster-based technologies Work is non-routine and complex, involving the application of advanced technical skills in the area of specialization. MS degree or equivalent experience relevant to functional area is required. 4 years of software engineering experience is highly preferred. Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\n<br><br>\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n<br><br>\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.\n<br><br>\nWork is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.\n<br><br>\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\n<br><br>\nProduct Development\n<br><br>\nUS-CO,Colorado-Boulder\n<br><br>\nRegular Employee Hire\n<br><br>\nOracle"}