{"job title": "Principal Data Scientist - Marketing Cloud", "company": "Oracle", "city state": "– Charleston, SC", "rating": "3.4", "job description": "Designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse big data sources to generate actionable insights and solutions for client services and product enhancement.\n<br><br>\nInteracts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.\n<br><br>\nLeading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. 8 years relevant work experience. BS/BA preferred.\n<br><br>\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\n\n\n<ul>\n<li>_Principal Data Scientist - Oracle Marketing Cloud_*</li>\n<li>Our mission:*</li>\n</ul>\n\nAs the leading marketing platform provider, our mission is to help companies target and reach their customers not he right channel, at the right time, with the right message - leading to desired outcomes. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for marketers who use our tools and services.\n\n\n<ul>\n<li>Our team:*</li>\n</ul>\n\nWe are a rapidly growing and highly capable product &amp; engineering team building the most popular marketing tools on the planet. Every day, over 1000 brands send a Billion emails and count on us to create precise and impactful targeting capabilities, personalization, customization, and optimize these marketing campaigns on many fronts. With engineering hubs in Redwood Shores, Portland, Toronto, Boulder, London, Bangalore, and Hyderabad, we are helping our customers acquire new customers, engage and re-engage existing customers, and drive their businesses towards growth.\n\n\n<ul>\n<li>Your role:*</li>\n</ul>\n\nAs a Data Scientist at Oracle Marketing Cloud (OMC) your role is to follow the data. Analyze, visualize, and model targeting, customization, personalization, and optimization related data. You will build and implement machine learning models to make timely decisions. You will have access to unparalleled resources within OMC to grow and develop both personally and professionally.\n<br><br>\nWe are looking for a mixture between a statistician, scientist, machine learning expert and engineer: someone who has passion for building and improving Internet-scale products informed by data. The ideal candidate understands human behavior and knows what to look for in the data, and can work closely with the engineering and product management teams to solve complex problems with unique data, analysis, algorithms, and insights.\n\n\n<ul>\n<li>About you and your impressive experience* -</li>\n<li>Ph.D. or M.S. in a quantitative field such as Computer Science, Statistics, or Mathematics</li>\n<li>Minimum 2-4 years of professional industry experience in data science</li>\n<li>Expertise in machine learning and statistical modeling</li>\n<li>Experience in Ad:tech or Mar:tech space is a plus</li>\n<li>Passion to answer Product/Engineering questions with data</li>\n<li>Strong ability to code in various languages, use big data platforms, extract and analyze data.</li>\n<li>We get excited about candidates who have this distinguished background:*</li>\n<li>Have full stack experience in data collection, aggregation, analysis, visualization, productionization, and monitoring of data science products</li>\n<li>Are proficient in small data modeling work: Python, R, Julia, Octave</li>\n<li>Are proficient in big data modeling work: Hadoop, Pig, Scala, Spark</li>\n<li>Can fish for data: SQL, Pandas, Oracle</li>\n<li>Deploy data science solutions: Java, Python, C</li>\n<li>Communicate concisely and persuasively with engineers and product managers.</li>\n</ul>\n\n/As part of Oracle s employment process candidates will be required to complete a pre-employment screening process, after a conditional offer has been extended/\n\n\n<ul>\n<li>*Job:** **Business Operations*</li>\n<li>*Organization:** **Oracle*</li>\n<li>*Title:** *Principal Data Scientist - Marketing Cloud*</li>\n<li>*Location:** *United States*</li>\n<li>*Requisition ID:** *18001DKT*</li>\n</ul>"}