{"job title": "Senior Machine Learning Engineer for a Global Consumer Device company", "company": "OSI Engineering", "city state": "– San Jose, CA", "rating": "4.9", "job description": "<strong>JOB DESCRIPTION:</strong>\n<br>\nSeeking a Senior Machine Learning Engineer for a Global Consumer Device company in San Jose, CA\n<br><br>\nOur Client is looking for a software engineer who will have the opportunity to work with cutting-edge technologies for future generation of display systems and devices. As a software engineer, you will help to build the next generation of machine learning systems by designing novel algorithms to solve computer vision and machine learning problems.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Participate in cutting-edge research in machine learning and computer vision applications.</li>\n<li>Apply expert software development skills to a wide range of ML-related coding projects.</li>\n<li>Develop solutions for real-world problems.</li>\n</ul>\n\n<strong>Must Have Skillsets:</strong>\n\n\n<ul>\n<li>MS degree in Computer Science, Computer Engineering or a related technical discipline.</li>\n<li>3+ years of experience in software development with machine learning and/or computer vision.</li>\n<li>Expertise and experience in computer vision (feature extraction, segmentation, color, shape and texture analysis, object detection).</li>\n<li>Excellent programming skills for python and C++.</li>\n<li>Prior working experience in one of deep learning frameworks, such as PyTorch, Caffe(2), Tensorflow, etc.</li>\n<li>Proven track record of achieving significant results.</li>\n</ul>\n\n<strong>Desired Skillsets:</strong>\n\n\n<ul>\n<li>2+ years of experience applying machine learning to solving real-world problems.</li>\n<li>Experience in OpenCV, and/or scikit-learn.</li>\n<li>Experience working with large volumes of real-world noisy image data.</li>\n<li>Specific computer vision skills in object detection, and classification is plus.</li>\n</ul>\n\nType: 6+ months\n<br>\nLocation: San Jose, CA\n<br><br>\n<strong>CONTACT INFORMATION:</strong>\n<br>\nAlan Bui\n<br>\nalan@OSIengineering.com\n<br>\n(408) 550-2800 x106\n<br>\n<strong>OSIJOBS</strong>"}