{"job title": "Data Scientist", "company": "Other Agencies and Independent Organizations", "city state": "– Washington, DC (US)", "rating": "NA", "job description": "<div><div><div><div>\n <ul>\n <li>\n \n Duties\n \n <div>\n \n Help\n \n Duties\n Summary\n <div>\n <p>The Directorate of Digital Innovation (DDI) is at the forefront of defining the future of digital expertise within the CIA. DDI focuses on developing the workforce with cutting-edge skills, investing in IT infrastructure, and modernizing the way the Agency does business. DDI officers help accelerate the integration of innovative methods and tools to enhance the CIA's cyber and digital capabilities on a global scale and ultimately help safeguard our nation. Learn more about the Directorate of Digital Innovation at https://www.cia.gov/offices-of-cia/digital-innovation/<br>\n<br>\nAs a Data Scientist for the CIA, you will organize and interpret data to inform US decision makers, drive successful operations and shape CIA technology and resource investments. Through CIA's global mission, the Agency has access to unique and highly specialized data sets. You will work with advanced hardware, software and techniques to develop computational algorithms and statistical methods that find patterns and relationships in large volumes of data. Data Scientists clearly communicate their conclusions to a diverse audience and become experts through Agency-sponsored continuing education, attendance at academic and technical conferences as well as collaboration with the Intelligence Community.<br>\n<br>\nFor further information and to apply, please visit: https://www.cia.gov/careers/opportunities/science-technology/data-scientist.html</p>\n \n Learn more about this agency\n \n </div>\n Responsibilities\n <div>\n <p>\n <u><strong>KEY REQUIREMENTS</strong></u>\n\n</p><ul>\n\t<li>US citizenship required (dual national US citizens are eligible).</li>\n\t<li>All positions require relocation to the Washington, DC metropolitan area.</li>\n\t<li>All applicants must successfully complete a thorough medical and psychological exam, a polygraph interview, and a comprehensive background investigation.</li>\n\t<li>All applicants must generally not have used illegal drugs within the last twelve months. The issue of illegal drug use prior to twelve months ago is carefully evaluated during the medical and security processing.</li>\n</ul>\nFor further information and to apply, please visit: https://www.cia.gov/careers/opportunities/science-technology/data-scientist.html<br>\n<br>\n<u><strong>MAJOR DUTIES</strong></u><br>\n<br>\nFor further information and to apply, please visit: https://www.cia.gov/careers/opportunities/science-technology/data-scientist.html\n <p></p>\n </div>\n\n <div>\n Travel Required\n <p>Occasional travel - Occasional Travel to/from various locations within the Washington Metropolitan Area may be required.</p>\n </div>\n <div>\n <div>\n \n \n Supervisory status\n \n \n <p>\n No\n </p>\n </div>\n <div>\n </div>\n </div>\n </div>\n </li>\n <li>\n <div>\n Job family (Series)\n <p>\n \n 0356 Data Transcriber\n \n </p>\n </div>\n </li>\n <li>\n \n Requirements\n \n <div>\n \n Help\n \n Requirements\n Conditions of Employment\n \n <p>\n .\n </p>\n <div>\n Qualifications\n\n <div>\n <strong>Minimum Qualifications:</strong>\n\n<ul>\n\t<li>Bachelor's degree.</li>\n\t<li>Experience in a science, technology, engineering or mathematics (STEM) related field, such as:\n\t<ul>\n <li>Computational social science.</li>\n <li>Computer science.</li>\n <li>Data analytics.</li>\n <li>Economics.</li>\n <li>Engineering.</li>\n <li>Geospatial analysis.</li>\n <li>Mathematics.</li>\n <li>Operations research.</li>\n <li>Quantitative finance.</li>\n <li>Statistics.</li>\n\t</ul>\n\t</li>\n\t<li>GPA of at least 3.0 on a 4.0 scale.</li>\n\t<li>Experience with real world data through thesis research, internships, or work experience.</li>\n\t<li>Creativity.</li>\n\t<li>Initiative.</li>\n\t<li>Integrity.</li>\n\t<li>Leadership abilities.</li>\n\t<li>Problem solving skills.</li>\n\t<li>Ability to work in a diverse team environment.</li>\n</ul>\n<strong>Desired Qualifications:</strong>\n\n<ul>\n\t<li>Advanced degree in a data science equivalent field or sub-field.</li>\n\t<li>Experience working with data rich problems through research or programs.</li>\n\t<li>Experience with computer programming or user experience/user interface.</li>\n\t<li>Ability to successfully complete projects with large or incomplete data and provide solutions.</li>\n\t<li>Strong written and verbal communication skills.</li>\n</ul>\nFor further information and to apply, please visit: https://www.cia.gov/careers/opportunities/science-technology/data-scientist.html\n </div>\n </div>\n\n <div>\n Education\n <p>\n</p><ul>\n\t<li>Bachelor's degree.</li>\n\t<li>Experience in a science, technology, engineering or mathematics (STEM) related field, such as:\n\t<ul>\n <li>Computational social science.</li>\n <li>Computer science.</li>\n <li>Data analytics.</li>\n <li>Economics.</li>\n <li>Engineering.</li>\n <li>Geospatial analysis.</li>\n <li>Mathematics.</li>\n <li>Operations research.</li>\n <li>Quantitative finance.</li>\n <li>Statistics.</li>\n\t</ul>\n\t</li>\n\t<li>GPA of at least 3.0 on a 4.0 scale.</li>\n</ul> <p></p>\n </div>\n\n\n <div>\n Additional information\n <div>\n <p>For further information and to apply, please visit: https://www.cia.gov/careers/opportunities/science-technology/data-scientist.html<br>\n<br>\nEvery career at the CIA is a rewarding one. In addition to serving your country with the certainty that your work makes a difference, the CIA offers a comprehensive benefits package to reflect the dedication and contributions of our employees.<br>\n<br>\n<strong>Higher starting salary possible depending on experience level.</strong><br>\n<br>\nFor more information on CIA Careers, visit https://www.cia.gov/careers/</p>\n </div>\n Read more\n </div>\n\n <div>\n How You Will Be Evaluated\n <div>\n <p>You will be evaluated for this job based on how well you meet the qualifications above.</p>\n <p>\n You will be evaluated for this job based on how well you meet the qualifications of the specific position to which you are applying. To view this position's requirements, visit https://www.cia.gov/careers/opportunities/science-technology/data-scientist.html\n </p>\n <p></p>\n </div>Read more\n\n <div>\n Background checks and security clearance\n <div>\n <div>\n Security clearance\n <p>\n \n Top Secret/SCI\n \n </p>\n </div>\n\n </div>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Required Documents\n \n <div>\n \n Help\n \n Required Documents\n <div>\n <p>\n The following items must be attached to your on-line application (PDF format preferred):\n</p><ul>\n\t<li>Resume.</li>\n\t<li>Cover letter in which you specify your qualifications for this position. Please address why you want to work in this role and what differentiates you from other applicants.</li>\n\t<li>Unofficial transcripts for all degrees.</li>\n\t<li>A writing sample, five (5) pages MAXIMUM, single spaced, technical or analytic paper that focuses on your current area of expertise or interest and is related to your interest in positions at CIA. You can excerpt longer papers.</li>\n</ul>\n <p></p>\n <div>\n \n If you are relying on your education to meet qualification requirements:\n \n <p>\n Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from\n schools accredited by accrediting institutions recognized by the U.S. Department of Education.\n </p>\n <p>\n Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n </p>\n </div>\n </div>\n </div>\n </li>\n <li>\n \n Benefits\n \n <div>\n \n Help\n \n Benefits\n <div>\n <p></p>\n <p>\n Review our benefits\n </p>\n </div>\n </div>\n </li>\n <li>\n \n How to Apply\n \n <div>\n \n Help\n \n How to Apply\n <div>\n <p>To be considered for CIA employment, you must apply online at <u>https://www.cia.gov/careers </u><br>\n <br>\nFor more information on the application instructions, please visit our Application Instructions page at <u>https://www.cia/careers/application-process/application-instructions/ </u></p>\n </div>\n Read more\n <div>\n Agency contact information\n \n \n Human Resources\n \n\n <div>\n <div>\n Phone\n <p>\n 0000000000\n </p>\n\n\n Email\n <p>\n \n CAREERS@ucia.gov\n \n </p>\n </div>\n <div>\n Address\n <p>\n </p>\n Central Intelligence Agency<br>\n Mail Not Accepted<br>\n Washington,\n DC <br>\n US\n \n </div>\n </div>\n \n Learn more about this agency\n \n </div>\n\n Next steps\n <div>\n <p>\n Our goal is to respond to each applicant within a 45 day period. However, the CIA receives thousands of applications each month and, unfortunately, we are not able to contact everyone within that timeframe. If you have not heard from us within 45 days, we will not be offering you a position at this time.<br>\n<br>\nIf there is interest in your application, CIA recruiters will initiate contact with you by phone or email. Emails from CIA recruiters will have a .gov extension. Please check your email spam filter settings or spam folder to ensure receipt of these emails.<br>\n<br>\nBe prepared to undergo a thorough background investigation examining your life's history, your character, trustworthiness, reliability and soundness of judgment. We also examine your freedom from conflicting allegiances, potential to be coerced, and willingness and ability to abide by regulations governing the use, handling and the protection of sensitive information. The Agency uses the polygraph to check the veracity of this information. The hiring process also includes a thorough mental and physical medical examination in relation to performing essential job functions.<br>\n<br>\nFor more information on the application process, please visit Application Process at <u>https://www.cia/careers/application-process/ </u>\n </p>\n </div>Read more\n </div>\n </li>\n <li>\n \n Fair &amp; Transparent\n \n <div>\n Fair &amp; Transparent\n <p>\n The Federal hiring process is setup to be fair and transparent. Please read the following guidance.\n </p>\n Equal Employment Opportunity Policy\n <div>\n <p>\n The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.\n </p>\n <ul>\n <li>\n \n Equal Employment Opportunity (EEO) for federal employees &amp; job applicants\n \n </li>\n </ul>\n </div>Read more\n Reasonable Accommodation Policy\n <div>\n <p>\n Federal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application and hiring process should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.\n </p>\n <p>\n A reasonable accommodation is any change to a job, the work environment, or the way things are usually done that enables an individual with a disability to apply for a job, perform job duties or receive equal access to job benefits.\n </p>\n <p>\n Under the Rehabilitation Act of 1973, federal agencies must provide reasonable accommodations when:\n\n </p><ul>\n <li>An applicant with a disability needs an accommodation to have an equal opportunity to apply for a job.</li>\n <li>An employee with a disability needs an accommodation to perform the essential job duties or to gain access to the workplace.</li>\n <li>An employee with a disability needs an accommodation to receive equal access to benefits, such as details, training, and office-sponsored events.</li>\n </ul>\n <p></p>\n <p></p>\n <p>\n You can request a reasonable accommodation at any time during the application or hiring process or while on the job. Requests are considered on a case-by-case basis.\n </p>\n <p>\n Learn more about disability employment and reasonable accommodations or how to contact an agency.\n </p>\n\n\n </div>Read more\n\n Legal and regulatory guidance\n <ul>\n <li>\n Financial suitability\n </li>\n <li>\n \n Social security number request\n \n </li>\n <li>\n \n Privacy Act\n \n </li>\n <li>\n \n Signature and false statements\n \n </li>\n <li>\n \n Selective Service\n \n </li>\n <li>\n \n New employee probationary period\n \n </li>\n </ul>\n </div>\n </li>\n </ul>\n </div>\n\n\n <p>\n This job originated on www.usajobs.gov. For the full announcement and to apply,\n visit www.usajobs.gov/GetJob/ViewDetails/494082100.\n Only resumes submitted according to the instructions on the job announcement listed at www.usajobs.gov will be considered.\n </p>\n \n </div>\n \n \n </div>\n</div>\n\n\n<div>\n <div>\n <div>\n <div>\n View Map\n </div> \n <div>\n \n Please wait while map is being generated.\n \n <p>\n \n </p>\n </div>\n <div>\n \n Close\n \n </div>\n </div>\n </div>\n</div>\n\n<div>\n <div>\n <div>\n <div>\n Beginning of a dialog window for the agency announcing this job. It begins with a heading 2 called \"Learn more about Field Operating Offices of the Office of the Secretary of the Army\". Escape will cancel and close the window.\n </div>\n <div>\n <p>\n Learn more about\n </p>\n \n Central Intelligence Agency\n \n </div>\n <div>\n\n <p>\n \n </p>\n <div>\n <div>\n Agency contact information\n \n \n Human Resources\n \n <div>\n <div>\n Phone\n <p>\n 0000000000\n </p>\n Email\n <p>\n \n CAREERS@ucia.gov\n \n </p>\n </div>\n <div>\n Address\n <p>\n </p>\n Central Intelligence Agency<br>\n Mail Not Accepted<br>\n Washington <br>\n DC <br>\n US<br>\n \n </div>\n </div>\n \n Learn more about this agency\n \n </div>\n\n </div>\n </div>\n\n <div>\n \n Close\n \n </div>\n </div>\n </div>\n</div>\n<div>\n <div>\n <div>\n <div>\n Beginning of a dialog window for your session has expired. Escape will cancel And close the window.\n </div>\n <div>\n Your Session is About to Expire!\n </div>\n <div>\n <div>\n <div>\n <p>Your USAJOBS session will expire due to inactivity in three minutes. \n Any unsaved data will be lost if you allow the session to expire. \n Click the button below to continue your session.</p> \n </div>\n </div>\n </div>\n <div>\n Logoff\n Stay Logged In\n </div>\n <div>\n \n Close\n \n </div>\n </div>\n </div>\n</div>"}