{"job title": "Data Scientist", "company": "Otsuka", "city state": "– Princeton, NJ", "rating": "3.7", "job description": "Post-doctoral scientist/Research Fellow will support translational research and/or technology development for drug discovery and clinical development, clinical trial operational efficiencies, digital assessments and health products, and other intelligent scientific/innovation information management tools. This is a short-term position for approximately 1 year and can be extended for an additional term upon satisfactory progress.\n<br><br>\n<strong>Additional Responsibilities:</strong>\n<ul>\n<li>Support translational research in the CNS and oncology disease areas on the identification of prognostic and predictive digital/molecular/imaging biomarkers, characterization of disease and its progression, and identifying/development of new assays towards diagnostics/algorithms that enable personalized/precision medicine by guiding targeted, individualized use of therapies to the patients that will benefit the most.</li><li>Develop innovative AI/machine learning/NLP/Signal Processing/Logic/statistics and mathematical modeling methods to provide therapeutic insights by leveraging internal, external and real world data sources. Experienced in graphical modeling (Bayesian networks, Hidden Markov modeling) and/or deep learning.</li><li>Guide evidence based product development by extracting market intelligence from such real-world data sources through knowledge representation and pattern recognition.</li>\n</ul>\nRequired:\n<br><br>\nMust have been awarded or working towards an advanced degree (PhD/Masters students) in life sciences, computational sciences or engineering. The candidate must have demonstrated application of advanced computational techniques to life sciences or healthcare problems or must have built technology solutions/platforms which have potential applications in healthcare settings.\n<ul>\n<li>Demonstrated knowledge and experience of application of AI/Machine learning/Robotics/Signal Processing/Scientific Computation/Human Computer Interface/Logic tools, Graph and Network algorithms and Semi-/Non-Parametric Statistical methods and software tools to real world data problems that are multi-scale, longitudinal and heterogeneous in nature</li><li>Must be agile to grow in new directions, work with a team of scientists and practitioners from different functional areas to solve problems in pharmaceuticals. Must be able to bring insights to stakeholders with ability to extract therapeutic intelligence by leveraging internal, external and real world data sources.</li><li>Demonstrated ability to use knowledge of most recent techniques, and develop new methodologies</li><li>Excellent software development skills, esp. in rapid prototyping</li><li>Established publication record in peer reviewed journals/conference proceedings.</li><li>Good programming skills in R/Python/MATLAB/Julia and C++/Java/Scala/Clojure/GO, etc.</li><li>Knowledge of and experienced in working with public databases and real world databases</li><li>Proficient in cloud technologies AWS/Google cloud/Azure or Openstack - Hadoop, Pig/Hive, Spark distributed computing platforms/analytics</li><li>Proficient in Visualization tools like D3 and others</li><li>Strong knowledge of SQL and NoSQL databases is helpful</li><li>Experienced in version control systems (SVN, GIT, Mercurial)</li><li>Experienced in Unix/Linux operating systems</li><li>Excellent communication skills</li>\n</ul>\nPlus (good to have skills)\n<ul>\n<li>Healthcare and Life Sciences experience is not mandatory. In fact, experience in gaming, human-computer interaction, AI/Machine Learning applied to various industries is highly desirable.</li><li>Strong knowledge of CNS and Oncology disease areas is highly desirable</li><li>Excellent knowledge of programming patterns and different types of programming languages like functional, declarative, rule, event, real-time, reactive etc., is highly desirable.</li>\n</ul>\nOtsuka Pharmaceutical Company is a global healthcare company with the corporate philosophy: “Otsuka-people creating new products for better health worldwide.” Otsuka researches, develops, manufactures and markets innovative products, with a focus on pharmaceutical products to meet unmet medical needs and nutraceutical products for the maintenance of everyday health.\n<br><br>\nIn pharmaceuticals, Otsuka is a leader in the challenging area of mental health and also has research programs on several under-addressed diseases including tuberculosis, a significant global public health issue. These commitments illustrate how Otsuka is a “big venture” company at heart, applying a youthful spirit of creativity in everything it does.\n<br><br>\nOtsuka Pharmaceutical Company is a subsidiary of Otsuka Holdings Co., Ltd. headquartered in Tokyo, Japan. The Otsuka group of companies employed 45,000 people worldwide and had consolidated sales of approximately USD 11 billion (€ 9.9 billion) in 2016.\n<br><br>\nAll Otsuka stories start by taking the road less travelled. Learn more about Otsuka Pharmaceutical Company on its global website at www.otsuka.co.jp/en. Learn more about Otsuka in the U.S. at www.otsuka-us.com.\n<br><br>\n<strong>Disclaimer:</strong>\n<br><br>\nThis job description is intended to describe the general nature and level of the work being performed by the people assigned to this position. It is not intended to include every job duty and responsibility specific to the position. Otsuka reserves the right to amend and change responsibilities to meet business and organizational needs as necessary.\n<br><br>\nOtsuka is an equal opportunity employer. All qualified applicants are encouraged to apply and will receive consideration for employment without regard to their protected veteran or disabled status, or any protected status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}