{"job title": "Data Scientist", "company": "Outbrain", "city state": "– New York City", "rating": "4.3", "job description": "<div><div>\n<strong>Data Scientist (Sphere)</strong><br><br>The Data Scientist role is for the Sphere team, a new initiative within of Outbrain that operates independently and autonomously, almost like a stand-alone startup. If Outbrain is the “forward” button of the web, recommending the next best article for you, Sphere’s vision is to become the “home” button for the billion of users Outbrain reaches. In our effort to get there, we are re-imagining how people discover and consume content, and building products that connect them with information that they care about from the sources that they trust. We look for people who are as passionate about this vision as we are!\n<br><br>\nWhile the Sphere team operates like a startup, it has access to the vast amount of data logged by Outbrain. With a reach of more than billion users, and more than 308 recommendation served every month, we have a lot to work with. We are looking for an experienced Data Scientist to help us define, measure, analyze and act on our data to build immersive content-driven experiences.<br><br>Responsibilities\n\n<ul>\n\n<li>Design, build, and maintain analyses and performance visualizations for the Sphere product initiative.</li>\n<li>Mine and analyze data streams from various sources, both internal and external, to drive optimization and improvement of KPIs, and make product recommendations based on the data insights.</li>\n<li>Assess the effectiveness and accuracy of new data sources and data gathering techniques.</li>\n<li>Develop custom data models and algorithms to apply to data sets.</li>\n<li>Use predictive modeling to increase and optimize user engagement and retention.</li>\n<li>Develop an A/B testing framework and test model quality.</li>\n<li>Develop processes and tools to monitor and analyze model performance and data accuracy.</li>\n\n</ul>\n\n<strong>Requirements</strong>\n\n<ul>\n\n<li>5+ years of hands-on experience building data products powered by machine learning and/or optimization algorithms in non-academic environments.</li>\n<li>Ability to break down and understand complex business problems, define a solution and implement it using advanced quantitative methods.</li>\n<li>Meaningful experience with, and deep technical understanding of, statistical analysis, machine learning (classification, regression, unsupervised, reinforced, etc.), predictive modeling, and optimization algorithms.</li>\n<li>Strong programming skills with an emphasis on libraries for cleaning, exploring and visualizing data.</li>\n<li>Strong oral and written communication skills, especially around analytical concepts and methods.</li>\n<li>Strong work ethic, and intellectual curiosity.</li>\n<li>Masters or Doctoral degree in a quantitative field (e.g., mathematics, computer science, physics, economics, engineering, operations research, quantitative social science).</li>\n\n</ul>\n\nNice To Have\n\n<ul>\n\n<li>Experience in Recommendation Systems</li>\n\n</ul>\n<u><strong>About Outbrain</strong></u>\n<br>\nOutbrain is the brains—and technology—behind those recommendations that can be seen throughout online articles, helping people digitally discover the content most interesting to them. Headquartered in New York City, with a global presence across 16 offices, Outbrain was founded to narrate the web. Top publishers—including CNN, Fox News, and ESPN—utilize Outbrain's technology to redefine their digital landscapes, while top marketers utilize the platform to interact with untapped audiences. Outbrain currently serves more than 308 billion monthly recommendations to readers, and is paving the way in native advertising innovations.\n<br><br>\nThe brainy culture that ignites the halls of Outbrain has even been industry-recognized and awarded ‘Best Tech Work Culture’ in 2018 by Tech In Motion.\n<br><br>\nInterested in discovering what’s next for your career at Outbrain?</div>\n</div>"}