{"job title": "Data Scientist", "company": "P3 North America", "city state": "– Irvine, CA, United States", "rating": "3.5", "job description": "Are you someone who enjoys designing, developing and implementing business intelligence solutions, then look no further than P3! As a global consulting, management and engineering services company, we develop and implement innovative solutions to today’s complex technology challenges and industry changes that help our clients succeed at every stage.\n<br><br>\nAs a Data Scientist, you will work closely with our clients to help them solve complex problems by analyzing terabytes of data. By taking initiative, you will help drive technical prototypes and proofs of concept. This will include understanding current client needs, identifying modeling/algorithm solutions, creating applicable data science solutions around customer outcomes and delivering value back to our clients.\n<br><br>\n<strong><em>A Day in the Life:</em></strong>\n<ul>\n<li>Work with the data analytics team to define and implement machine learning solutions or advanced analytics use cases for Fortune 500 clients</li><li>Always curious about data, constantly asking questions about extracting key insights to understand the domain</li><li>Manage data received from multiple sources and cleanse data as needed</li><li>Integrate data from multiple sources and develop data storage solutions</li><li>Develop data analytics model for descriptive and predictive analytics using client provided data</li><li>Manage the data quality feedback loop so that all issues are corrected in a timely manner</li><li>Create visualization dashboards to draw insights and recommendations for clients</li>\n</ul>\n<strong><em>What You Have:</em></strong>\n<ul>\n<li>Bachelor’s or Master’s Degree in Computer Science, Engineering, Mathematics, or a related field is preferred</li><li>At least 1 year Data Analytics or IT implementation project experience</li><li>Software experience with R and/or Python</li><li>Understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests …etc.</li><li>Able to apply statistics skills, such as distributions, statistical testing, regression…etc. into understanding key features of the data</li><li>Familiar with data cleaning/processing techniques via R or Python</li><li>Strong communication skills with the ability to initiate high level discussions with the client</li>\n</ul>\n<strong><em>What you might also have:</em></strong>\n<ul>\n<li>Automotive IoT architecture and solution experience</li><li>An entrepreneurial mindset and has the ability to work independently or within a team</li><li>The ability to think critically and understand complex processes</li><li>Previous client facing project experience</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}