{"job title": "Data Scientist", "company": "Paccar", "city state": "– Mt. Vernon", "rating": "3.2", "job description": "<div>Requisition Summary\n<br><br>\nPACCAR Technical Center Advanced Analytics is looking for a Data Scientist interested in all aspects of the data science cycle. A successful candidate will be curious, self-driven, analytical and excited to play with data.\n<br><br>\nCompany Information\n<br><br>\nPACCAR is a Fortune 500 company established in 1905. PACCAR Inc is recognized as a global leader in the commercial vehicle, financial, and customer service fields with internationally recognized brands such as Kenworth, Peterbilt, and DAF trucks. PACCAR is a global technology leader in the design, manufacture and customer support of premium light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates and also provides customized financial services, information technology and truck parts related to its principal business.\n<br><br>\nWhether you want to design the transportation technology of tomorrow, support the staff functions of a dynamic, international leader, or build our excellent products and services, you can develop the career you desire with PACCAR. Get started!\n<br><br>\nDivision Information\n<br><br>\nThe PACCAR Technical Center provides engineering excellence to the truck, engine, and winch divisions of PACCAR Inc through innovative product development and testing. The Technical Center is located in the Skagit Valley about 65 miles north of Seattle, Washington.\n<br><br>\nJob Functions / Responsibilities\n\n<ul>\n\n\t<li>Solve business problems using advanced statistical techniques including but not limited to regression/logistic regression, bootstrapping, decision trees, gradient boosting, neural network, clustering &amp; binning, time series forecasting, and market basket analysis</li>\n<li>Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations</li>\n<li>Build and operationalize data pipelines, analytical tools and decision support models</li>\n<li>Creatively identify and pursue predictive analytics opportunities to solve business problems and drive value</li>\n<li>Implement data science best practices</li>\n<li>Define and evaluate key metrics and understand what moves them and why</li>\n<li>Ownership of conceptualizing, developing, and maintaining dashboards and visualizations</li>\n<li>Strategize on making analyses easily repeatable and accessible</li>\n<li>Proactively identify and develop expertise in new technologies, methodologies, and techniques</li>\n<li>Communicating technical ideas to non-technical stakeholders by translating complex findings and results into a compelling narrative</li>\n</ul>\nQualifications\n<br><br>\n<strong>Required Qualifications &amp; Skills</strong>\n\n<ul>\n\n\t<li>Bachelors in a quantitative field, Master’s degree is a plus, and 2+ years of industry experience</li>\n<li>Solid understanding of analytics techniques and statistics</li>\n<li>Ability to write clean and concise code, especially in R</li>\n<li>Knowledge and experience of writing and tuning SQL</li>\n<li>Experienced performing thorough exploratory analysis</li> \n\n<li>Ability to partner with cross-functional teams using strong written and verbal communication</li>\n<li>Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment</li>\n<li>Initiative on solving problems and completing tasks in a reasonable time frame</li>\n<li>Strong written and verbal communication skills</li>\n<li>Positive, can-do attitude</li>\n</ul>\n<strong>Preferred Qualifications &amp; Skills</strong>\n\n<ul>\n\n\t<li>Experience with Warranty Analytics and/or Diesel Engines a plus</li>\n<li>Experience in model building</li>\n<li>Python, C # or Java programming skills</li>\n<li>Knowledge of non-relational database systems</li>\n<li>Hadoop, Spark, MapReduce, Hive</li>\n</ul>\nEducation\n<br><br>\nBachelors in a quantitative field, Master’s degree is a plus, and 2+ years of industry experience\n<br><br>\nAdditional Job Board Information\n<br><br>\nPACCAR is an Equal Opportunity Employer/Protected Veteran/Disability.</div>\n<br><strong>Nearest Major Market:</strong> Seattle\n<br>\n<strong>Nearest Secondary Market:</strong> Everett\n<br>\n<strong>Job Segment:</strong> \n<br>\n Database, Scientific, Scientist, Engineer, Product Development, Engineering, Technology, Science, Research"}