{"job title": "Field Applications Scientist (FAS), Tristate (NY, NJ, &amp; CT), or PA", "company": "Pacific Biosciences", "city state": "– NY", "rating": "3.4", "job description": "<div>Title: Field Applications Scientist (FAS)\n<br>\nLocation: Tri-State (NY, New Jersey, CT), or PA, United States\n<br><br>\nPacific Biosciences is seeking a Field Applications Scientist (FAS) with a strong customer focus to support installations, training, validation, and implementation for customers and collaborators using SMRT sequencing technology with the Sequel &amp; PacBio RS instrumentation.</div><br>\n\n<div>\nThe ability to communicate with customers both pre- and post-sales, interact with marketing, internal support and development, and communicate results to diverse audiences are important aspects of this role. In addition, pre-sales and post-sales activities will be conducted in conjunction with our Sales organization.</div><br>\n\n<div>This individual will be working in a fast-paced commercial environment, interacting with customers as well as other scientists and engineers from a wide variety of backgrounds. This individual is a partner to the customer in the understanding and analysis of data derived through the use of our 3rd generation sequencing platform.</div><br>\n\n<div>The position will be based within the East Coast in NY, NJ, CT, or PA of the United States. The candidate must live near an international airport.\n<br><br>\n<strong>Responsibilities:</strong></div><strong>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Assist customers in designing and conducting experiments to effectively utilize the Sequel &amp; PacBio RS instrument in their laboratories</li>\n<li>Work with Technical Support team to provide timely technical and application assistance in response to customer inquiries</li>\n<li>Work with Account Managers to identify business opportunities, understand customer research needs, and position appropriate PacBio products and solutions</li>\n<li>Assist Sales team in conducting scientific presentations to internal and external audiences for pre- and post-sales activities</li>\n<li>Work with Market Development team to define/develop models for competitive positioning of Single Molecule Sequencing Real-Time (SMRT) technology</li>\n<li>Develop and maintain positive relationships with customers and key opinion leaders in assigned territory</li>\n<li>Be a customer-minded individual with the empathy to understand customer concerns</li>\n<li>Able to efficiently problem-solve and overcome technical challenges in the field</li>\n<li>Team player who can effectively integrate internal and field-based activities across functions to support customer requirements</li>\n<li>Assess the customers experimental needs and implement training, experimental designs, and analytical approaches to ensure customer success and communicate results to appropriate internal teams</li>\n<li>Assist in the development of technical documentation and training presentations</li>\n<li>Provide scientific and applications feedback to R&amp;D, Product Marketing, and Sales teams. Work with these teams to continually improve workflows associated with 3rd generation sequencing in order to support the use of the PacBio RS platform.</li>\n</ul>\n\n<div><strong>Position Requirements:</strong></div>\n<ul>\n\n\t<li>Minimum of a Masters degree or equivalent experience (Ph.D. preferred) in Molecular Biology/Genetics, Biochemistry, Bioinformatics, Computational Biology, Statistics, Computer Science, or in a Life Science or Engineering field</li>\n<li>3+ years of experience in field applications and pre-/post-sales customer support; and in installation, training, validation, implementation, and application of next-generation DNA sequencing instruments and assays</li>\n<li>Experience in operating next-generation DNA sequencing instruments and assays</li>\n<li>Experienced in molecular biology/molecular genetics, and biochemistry laboratory techniques</li>\n<li>Experienced in analysis of next-generation DNA sequencing data</li>\n<li>Knowledgeable in bioinformatics tools to support next-generation DNA sequencing</li>\n<li>Experienced with common DNA sequence analysis tools and workflows such as sequence alignment, genome visualization, comparative genomics, sequence/structural variation discovery, and epigenetics</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Excellent oral presentation skills</li>\n<li>Experienced in conducting scientific presentations to internal and external audiences for pre- and post-sales activities</li>\n<li>Familiarity with the scientific publication process and associated experimental design requirements</li>\n<li>Excellent troubleshooting abilities</li>\n<li>Demonstrates excellent documentation skills; exhibits thoroughness and attention to detail to ensure that job tasks are completed with a high level of quality</li>\n<li>Ability to work independently and collaboratively with other field team members</li>\n<li>Ability and willingness to travel up to 75% of the time</li>\n<li>Lives near an international airport and possesses a valid drivers license</li>\n<li>Strong time management, organizational and planning skills are essential</li>\n</ul>\n\n<div>All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status, or on the basis of disability, gender identity, and sexual orientation.</div>"}