{"job title": "Genomic Data Scientist", "company": "Pairwise", "city state": "– Raleigh, North Carolina", "rating": "NA", "job description": "US-NC-Raleigh-Durham\n<br><br>\n<strong>Job ID</strong> 2018-1139\n<br>\n<strong># of Openings</strong> 1\n<br>\n<strong>Category</strong> Scientist\n<br><br>\n<strong>Overview</strong>\n<br><br>\nPairwise believes healthy food should be affordable, convenient, and sustainable. We believe gene editing can be used to accelerate plant breeding in leveraging the natural genetic diversity in agricultural crops to address global food challenges. We are bringing the benefits of these new innovations both to producers and directly to consumers through the produce aisle of their local grocery store. Located in the Raleigh-Durham metro area, Pairwise was formed in 2017 and has plans to add about 100 employees over the next year to help meet our aggressive product development goals.\n<br><br>\nPairwise is looking to hire motivated and collaborative scientists into its R &amp; D organization to help achieve a broad set of scientific goals and be part of developing our scientific strategy. We currently a role for a genomic data scientist who is interested in leveraging machine learning and signal processing methods to understand the genome. This role will play a key part in helping to distill meaning and insight from large genomic, genetic and phenotypic data sets. We are looking for a scientist with a PhD or equivalent level of training and the ability to work independently and as part of the team. Your contribution will be critical to helping Pairwise meet a set of aggressive targets and building a culture where science can be fun.\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>PhD or equivalent experience in Computer Science, Statistics, Computational Biology or related fields</li><li>Demonstrate experience building and applying machine learning and optimization algorithms</li><li>Strong track record of scientific innovation, formulating research, and developing and executing novel systems and tools</li><li>Demonstrated ability to deliver scientific results in a cross functional environment</li><li>Remain current in genomics and machine learning literature</li>\n</ul>\n\n<strong>PM18</strong>\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Build predictive and prescriptive models for various genomics problems at Pairwise</li><li>Design and collaborate with bioinformaticians and molecular biology teams to collect training data sets</li><li>Use novel algorithmic approaches to solve biological problems</li><li>Work with the Data Engineering team to deploy models in a scalable form to the cloud</li><li>Collaborate across multifunctional teams to find new insights and drive the innovation culture</li><li>Collaborate with universities and other scientific organizations to bring diverse thought into Pairwise</li><li>Strong communication skills to present work to diverse audiences</li>\n</ul>\nPI105651796"}