{"job title": "Data Engineer, Internal", "company": "Palantir", "city state": "– New York City, New York", "rating": "4.4", "job description": "A World-Changing Company\n<br><br>\nAt Palantir, we're passionate about building software that solves problems. We partner with the most important institutions in the world to transform how they use data and technology. Our software has been used to stop terrorist attacks, discover new medicines, gain an edge in global financial markets, and more. If these types of projects excite you, we'd love for you to join us.\n<br><br>\nThe Role\n<br><br>\nIn partnership with product engineering leaders and data end users, Data Engineers are responsible for building out Palantir's internal data infrastructure, iterating on data pipeline improvements, and measuring their impact across Palantir. Data Engineers are given direct ownership of key areas of focus for Palantir's business, and delivering meaningful outcomes is their primary measure of success. Our internal data customers span the company and work across numerous business areas and teams, including: business development, product development, human resources, finance, and security.\n<br>\nIn addition to developing reliable data pipelines for our end users, Data Engineers are also responsible for providing timely, data-driven, and actionable feedback to the engineering teams that build Palantir's next generation data platform. This feedback is crucial for Product Development teams to improve workflows and performance.\n<br><br>\nCore Responsibilities\n<br><br>\nYou will be an engineer.\n<br>\nYou will write code to transform noisy real-world data into high-signal models that stand the test of time.\n<br><br>\nYou will be an archeologist.\n<br>\nYou will excavate the hidden insights in Palantir's internal data that will accelerate our business strategy. At your fingertips is Palantir's cutting-edge data management, integration, and analytical platform; you'll work to eliminate common data management obstacles such as data duplication, questionable data provenance, and fragmented collaboration.\n<br><br>\nYou will be an entrepreneur.\n<br>\nYou will come to understand the nature of how Palantir operates, and proactively identify new areas of investment for the business.\n<br><br>\nYou will be an expert.\n<br>\nYou will be an expert on the breadth of Palantir product offerings, and come to learn the ins and outs of the Palantir platform to drive best in class methods for ingestion, structure, and transformation.\n<br>\nWhat We Value\n<br><br>\nIntellectual curiosity and creativity.\n<br>\nA background in science or engineering, especially in fields such as Mathematics, Physics, Computer Science, or Software Engineering.\n<br>\nFamiliarity with data structures, storage systems, cloud infrastructure, data modeling, and other technical tools.\n<br>\nExcellent communication skills.\n<br>\nComfort in a fast-paced environment, and the ability to consistently revise your approach in response to new information.\n<br>\nProficiency with programming languages such as Python, Java, or similar languages.\n<br>\nPreferred\n<br><br>\nFamiliarity with containers (Docker) and orchestration (Kubernetes)\n<br>\nExperience working with a cloud provider (AWS/Azure/GCE)\n<br>\nKnowledge of infrastructure automation tools such as HashiCorp offerings\n<br>\nPrevious experience with advanced analytics, such as data science or other business analysisPalantir is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. Please see the United States Department of Labor's EEO poster and EEO poster supplement for additional information.\n<br>\nIf you need assistance or an accommodation due to a disability, you may contact us at ***************************."}