{"job title": "Staff Data Scientist", "company": "Panasonic Avionics", "city state": "– Pleasanton, CA", "rating": "3.4", "job description": "We are looking for a <strong>Data Scientist to be</strong> a key contributor responsible for designing, developing and maintaining aerospace operational models specific to the Panasonic Avionics Corporation product suite including inflight consumer engagement platforms and inflight connectivity systems.\n<br><br>\n<strong>Major Responsibilities include;</strong>\n<br><br>\n<strong>Data Science</strong>\n\n<ul>\n<li>Advance team’s capability to bring vision to life, support roadmap development and prioritization, which may include items like a strategic KPI framework, customer portfolio optimization and planning, strategic site analysis (segments and pathing), measurement and attribution, AI platform evaluation and journey analytics</li><li>Continuously innovate by staying abreast of and bringing recommendations on the latest tools and techniques (and evaluate options) associated with consumer personalization, AI/Machine learning, real time decisioning, and digital analytics.</li><li>Iterate quickly in an agile development process.</li><li>Support projects from start to finish &amp; produce data-driven results with appropriate techniques to answer key business questions</li><li>Use machine learning and predictive modeling to develop data driven solutions that drive substantial business value in key PAC product areas.</li><li>Program and support analytic solutions to improve and optimize business performance and minimize risk.</li><li>Program and support machine learning algorithms for model training and deployment.</li><li>Lead junior team members to develop solutions.</li>\n</ul>\n\n<strong>KNOWLEDGE/SKILL REQUIREMENTS</strong>\n\n<ul>\n<li>Understands department’s mission and vision and the ability to execute on that vision</li><li>Able to define the correct data, analysis and interpretation to achieve complex design and marketing initiatives.</li> <li>Experience with cloud solutions for products and services.</li><li>Experience with designing, building and managing large scale ML and analytics platforms</li><li>Proven technical ability with a variety of tools including SQL, Python and R. Commanding knowledge of statistics and or machine learning techniques. Applications in the game industry a plus.</li><li>Knowledge of advanced statistical techniques suitable for analysis of highly skewed populations</li><li>Proven experience in predictive analytics, segmentation, experimental design and related areas</li><li>Experience designing, deploying and maintaining cloud based big data technology stacks (Amazon Redshift experience preferred)</li><li>Experience with traditional Business Intelligence relational database modeling, tools and processes</li><li>Familiarity with the design and implementation of data telemetry systems</li>\n</ul>\n\n<strong>EDUCATION/EXPERIENCE REQUIREMENTS</strong>\n\n<ul>\n<li>BS in Statistics, Operations Research, Economics or similar degree with a focus on statistical methodology</li><li>10 years+ experience in data science and analytics environment; should include experience in consumer/CRM analytics methods, measurement, attribution, test planning and rapid testing, strong knowledge of media analytics and addressable media measurement and testing, digital analytics, some B2B2C experience or knowledge, omni-channel lifecycle marketing orientation</li><li>Strong communication and collaboration skills with ability to build consensus and drive cross-functional teams forward to execution against project goals and timelines</li><li>Experience with statistical modeling, machine learning, digital analytics, media analytics.</li><li>In depth specialization in mathematical analysis methods, predictive modeling, statistical analysis, machine learning, and technologies like Python, R and Hadoop. Or equivalent experience.</li><li>Experience with time-series models Bayesian modeling, Generalized Linear Models and/or Limited Dependent Variables</li><li>Expertise with R, SAS, Python, Hadoop, DMPs, and digital platforms</li><li>Proven ability to design and code new algorithms from scratch#LI-POST</li>\n</ul>"}