{"job title": "Data Scientist", "company": "Panjiva", "city state": "– Cambridge, MA", "rating": "4.1", "job description": "<strong>Solve important and challenging problems</strong>\n<br>\n\n<br>\nWe’re looking for someone that can help us to solve the data challenges that we know we have, as well as help to identify new opportunities to leverage our data. You’ll be working with a variety of teams across the company: engineering, business development, sales, and design to explore exciting and meaningful problems.\n<br><br>\nWe’re looking for someone who can leverage a wide array of machine learning and statistical techniques at scale. Responsibilities will include helping us develop the next generation of our product, as well as analysis of our internal metrics to assist the company in making a wide variety of data-driven decisions. Our team uses a range of tools including R, Ruby, and SQL to communicate and visualize results.\n<br><br>\n<strong>At Panjiva, you’ll work on:</strong>\n\n\n<ul>\n\n<li>\nFuzzy matching and clustering of data, at scale</li>\n<li>\nNatural language processing, robust to messy text and multiple languages</li>\n<li>\nImputation of missing data</li>\n<li>\nNetwork analysis</li>\n<li>\nInference of company structures</li>\n<li>\nAnomaly detection</li>\n<li>\nShipment trend prediction and modeling</li>\n<li>\nOptimization of search weightings</li>\n<li>\nPredictive modeling of customer acquisition and retention</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n\n<li>\nB.S, M.S, or Ph.D. in a quantitative field, or equivalent experience</li>\n<li>\nDeep statistical knowledge and a broad understanding of analytical and machine-learning techniques</li>\n<li>\nTrack record of providing valuable insights into large, highly multidimensional datasets</li>\n<li>\nExperience with a scripting language, such as Python with NumPy / SciPy or R, and the ability to use it to perform complex analyses of large data sets</li>\n<li>\nBasic understanding of relational databases</li>\n<li>\nStrong ability to communicate and visualize findings</li>\n</ul>\n\n<strong>Nice-to-Haves</strong>\n\n\n<ul>\n\n<li>\nSolid understanding of relational databases, including advanced query techniques</li>\n<li>\nBackground in text analysis / information retrieval algorithms</li>\n<li>\nExperience building production software</li>\n<li>\nFamiliarity with Ruby, Postgres</li>\n<li>\nFamiliarity with libsvm</li>\n<li>\nExperience with C++ or a similar highly performant language</li>\n<li>\nFamiliarity with large-scale, distributed data processing techniques (Hadoop, Pig, Hive, etc.)</li>\n<li>\nStartup experience</li>\n</ul>\n\n<strong>Perks and Benefits</strong>\n\n\n<ul>\n\n<li>\nCompetitive salary and stock options</li>\n<li>\nBuild or buy your dream computer</li>\n<li>\nKendall Square office twenty-five feet from the Red Line T stop</li>\n<li>\nNineteen days of Paid Time Off (PTO) and 10 paid holidays annually</li>\n<li>\nWeekly tech talks</li>\n<li>\nHealth, dental, and vision insurance</li>\n<li>\n401(k) plan</li>\n<li>\nHacker Continuing Education Wednesdays i.e., craft beer tasting, ping pong lessons</li>\n<li>\nRegular off-site retreats where everybody helps to set company direction and strategy</li>\n<li>Work with a talented, focused, driven team in a growing company with opportunity for advancement and career development</li>\n</ul>\n\n<strong>How to apply</strong>\n<br>\n\n<br>\nTo apply, email jobs+datascience at panjiva.com with:\n\n\n<ul>\n<li>Your resume (and, if you have it, your blog, GitHub, etc. handles)</li>\n<li>A description of an exciting project you’ve tackled in the past, with, if possible, an example of code from that project</li>\n<li>A paper you think is exciting, with an explanation of what makes you excited about it</li>\n</ul>\n\nAbout Panjiva\n<br>\n\n<br>\nPanjiva's technology creates insight from messy global trade data to provide powerful search, analysis, and visualizations of more than a billion shipping records from nearly every country in the world. Our platform is used by more than 3,000 customers—Fortune 500 companies, startups, government agencies, hedge funds, among others—in over 100 countries to find new suppliers and customers, monitor supply chains, make investment decisions, and much more. Better insight into global trade means better decision making and stronger connections between companies and governments around the world.\n<br><br>\nJoin our team as we revolutionize a key and fascinating part of the world economy!\n<br><br>\nNOTE: Panjiva is an EOAA. Panjiva takes affirmative action to employ and advance in employment qualified individuals with disabilities. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity or physical or mental disabilities."}