{"job title": "Data Scientist II", "company": "Parallon", "city state": "– Nashville, Tennessee", "rating": "2.7", "job description": "<strong><br><br>Description</strong>\n<br><br>\n<strong> About HCA</strong>\n<br><br>\nNashville-based HCA is one of the nation's leading providers of healthcare services, operating 171 locally managed hospitals and 119 freestanding surgery centers in 20 states and the United Kingdom. With its founding in 1968, HCA created a new model for hospital care in the United States, using combined resources to strengthen hospitals, deliver patient-focused care and improve the practice of medicine. HCA has conducted a number of clinical studies, including one that demonstrated that full-term delivery is healthier than early elective delivery of babies and another that identified a clinical protocol that can reduce bloodstream infections in ICU patients by 44 percent. HCA is a learning healthcare system that uses its more than 27 million annual patient encounters to advance science, improve patient care and save lives.\n<br><br>\nData Science is a new function within CDM focusing on utilizing our data resources to improve the clinical and operating performance of HCA. This team is focused on identifying such opportunities and working with the wider organization to operationalize them. Data Scientist II is the level position in this specialty intended for an individual of 3+ years experience.\n<br><br>\nThe role of the data scientist is to use mathematics, programming and visualization to discover, in partnership with the business, opportunities and insights arising from HCA data systems. This role is firmly customer facing, with an expectation of constant contact, communication and iteration with both clinical and business customers to define questions, explore solutions and present results. As such the data scientist must be comfortable and capable of clearly communicating the nature and results of complex analytics to non-technical users in written, spoken and visual means.\n<br><br>\nOn the technical front the data scientist must be comfortable with 'data wrangling'. That is, the ability to identify, and extract raw data from primary transactions systems such as databases. Thereafter they must possess basic skills in programming to manage, transform and integrate with other datasets, in preparation for analytics. Typically this is performed in scripting languages such as Python.\n<br><br>\nThe analytic skills required are based principally in machine learning and statistics. The data scientist must have a working knowledge of regression and classification techniques such as logistic regression, boosting, SVM and neural networks. Moreover, the data scientist must understand the scientific process of hypothesis generation and testing, in particular data oriented discovery methodologies such as cross validation. Typically, these functions are performed in a mathematical environment such as R, MATLAB or SAS, proficiency with which is assumed.\n<br><br>\n<strong> Duties and Responsibilities</strong>\n<li> Ensure a standardized and consistent approach relating to CDM participation and implementation in all phases of the data science life cycle.</li>  <li> Partners with colleagues and customers to achieve meaningful discussions regarding data outputs and feedback on usage activities to improve CDM output.</li>  <li> Can extract data from primary sources reliably. Familiar with some HCA data architectures.</li>  <li> Broaden skillset from initial to complementary: developers will hone skills in the basics of statistics/machine learning and statisticians will hone skills in programming and databases.</li>  <li> Develop expertise in working with clinical, operational and financial data.</li>  <li> Participate in team code reviews and testing.</li>  <li> Write and test software in a variety of languages and platforms to rapidly reach solutions.</li>  <li> Design and execution of unit and system tests.</li>  <li> Holds discussions and prepares materials for colleagues and superiors. Leads debate and problem solving. Builds consensus.</li>  <li> Forms discussions groups and leads meetings on topics. Encourages and seeks out opinions within and beyond team.</li>  <li> Uses formal methodologies to understand and solve complex problems.</li>  <li> Determines root causes, and applies the scientific method to test, validate and reformulate hypotheses. Forms recommendations.</li>  <li> Treats change and new situations as opportunities for learning or growth.</li>  <li> Focuses on the beneficial aspects of change and speaks positively about the change to others.</li>  <li> Tries to understand changes in work tasks, situations, and environment as well as the logic or basis for change.</li>  <li> Demonstrates the ability to help others adapt to change and to personally adapt to various work environments.</li>  <li> Member of professional/community group related to data science and maintains strong internal and external network of peers.</li>  <li> Compares and synthesizes multiple sources, bearing accuracy, omission and error in mind.</li>  <li> Escalate to and collaborate with Data Science Manager on program issues and risks to identify solutions.</li>  <li> Other duties assigned as necessary, to support CSG, Data &amp; Analytics.</li>  <strong> Qualifications</strong> <li> Strong analytical and technical skills with ability to analyze issues, assess technical risks, and recommend sound solutions in a timely manner.</li>  <li> Basic programming experience, preferably in a dynamic language such as Clojure, Python, PySpark, or Ruby. Solid SQL development experience with an understanding of the relational model.</li>  <li> Experience with BI tools such as Tableau, QlikView or MicroStrategy.</li>  <li> Basic understanding of NoSQL databases and Big Data environments (Hadoop and its ecosystem).</li>  <li> Understanding of statistical techniques (regression and hypothesis testing) and model fitting processes (cross validation).</li>  <li> Exposure to machine learning techniques, such as boosting, SVMs and neural networks.</li>  <li> Adeptness to learn new assignments, technologies, and applications quickly and manage multiple assignments simultaneously.</li>  <li> Ability to network with corporate and field contacts. Frequent inter-departmental contact and presentations. Independently works with customers on a 1:1 basis, as well as in teams.</li>  <li> Works independently with general supervision and acts as a resource for colleagues with less experience. Work is evaluated to ensure objectives are met.</li>  <li> Exercises judgment in selecting and adapting methods and techniques for obtaining solutions.</li>  <li> Possesses the ability to make decisions which may deviate from established policy due to special circumstances.</li>  <li> Possesses interpersonal skills to work in a high profile and fast paced team.</li>  <li> Technical aptitude to learn and adapt to new industry applications and tools.</li>  <li> Some travel required.</li>  <li> Typical work week hours can vary depending on workload and project deliverables.</li>  <strong> Education and Experience</strong> <li> Bachelors degree required; Masters degree preferred.</li>  <li> Experience in healthcare preferred.</li>  <li> 3+ years of relevant work experience required.</li>\n\n<strong><strong>:</strong>\n<br></strong>"}