{"job title": "Data Scientist", "company": "Parsec Media", "city state": "– New York, NY", "rating": "5.0", "job description": "We’re looking for a Data Scientist to join our team in NYC. Proficiency with Python and a mastery of SQL are key, as well as an understanding of machine learning techniques.\n<br><br>\nAs Data Scientist, you'll be joining a team that values collaboration and creativity. We encourage people to learn and put their skills to the test. The ideal candidate has strong attention to detail and is passionate about research that tackles complex problems.\n<br><br>\n<strong>What you’ll do:</strong>\n<ul>\n <li>Work with our Head of Data Science to formulate Parsec’s data into a clear and concise story</li>  <li>Help to develop and quickly test optimization models in production code</li> <li>Support campaign management teams with data-driven insights based on millions of behavioral data points each day</li> \n</ul>\n<strong>Why this job is important:</strong>\n<br><br>\nParsec’s time-based data allows for a more efficient and transparent ad marketplace, cutting down on waste and prioritizing user experience. You’ll be working with hundreds of millions of data points a day, quickly iterating the optimization methods that further campaign efficiency and effectiveness and fuel the world’s first attention-based platform.\n<br><br>\n<strong>What you’ll learn:</strong>\n<br><br>\nYou’ll become an expert in manipulating massive amounts of data, influencing decision making within tens of milliseconds. Working cross-functionally with engineering, client services, marketing, and sales, you’ll learn to interpret raw, early-stage data and form compelling narratives, communicating our story and mission as the first attention-based marketplace.\n<br><br>\n<strong>Requirements</strong>\n<ul>\n <li>Fluency with Python and a strong understanding of relevant libraries (including scikit-learn, NumPy, SciPy, pandas, etc.)</li> <li>Strong SQL skills and experience working with large data stores</li> <li>Experience in statistical analysis and machine learning techniques</li> <li>Experience working with bayesian methods</li>\n</ul>\n<strong>Nice to have:</strong>\n<ul>\n <li>Previous adtech or data science experience</li> <li>PhD in Psychology, Physics, Statistics, Neuroscience, or MS in Data Science or Math plus 2 years experience</li> <li>Strong written communication skills and an interest in publishing results</li>\n</ul>\nAbout Parsec:<br><br>Parsec is the first marketplace for advertising sold on attention metrics. We're making a positive impact on digital media by addressing the root causes of waste and fraud with incentives for relevant and high-quality advertising.\n<br><br>\nParsec was created by a group of senior advertising execs and seasoned entrepreneurs who've built agencies, digital publishers and ad tech companies.\n<br><br>\nWe're headquartered in NYC and have offices in Los Angeles, Chicago and London.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nThis is an opportunity to work with a smart team in a fast-paced environment using cutting-edge technology to transform one of the most inefficient markets in the world - digital advertising.\n<br><br>\nWe offer equity, benefits, competitive pay and a strong company culture.\n<br><br>\nParsec is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}