{"job title": "Research Scientist II", "company": "Parsons", "city state": "– Aberdeen, MD", "rating": "3.5", "job description": "Research Scientist II\n<br>\nAberdeen Proving Ground, MD\n<br><br>\nAre you an experienced Researcher who thrives in a fast-paced environment working with teams in a support role? Imagine yourself working on top level critical network defense missions alongside other seasoned professionals. Parsons is now hiring top Research Scientists with a passion for innovation and solving mission critical challenges.\n<br><br>\nParsons' extensive experience in this field, combined with your technical knowledge, will propel your career forward. Training, mentorship and the opportunity for advancement will keep you engaged and challenged. We need our researchers to be versatile, display leadership qualities and be enthusiastic to tackle new challenges.\n<br><br>\nIf you are passionate about science and engineering, this is your chance to join in Parsons' team supporting the Army Research Laboratory at Aberdeen Proving Ground, MD.\n<br><br>\nCandidate will work with a team to investigate programmable networks in the context of tactical mobile computing platforms . Study programmable networks, classical and quantum, as an enabler for adaptive computing, especially using simulations to analyze network performance, understand algorithms, understand hardware performance, and to understand the effects of computational complexity on algorithm and network performance. Examples of network simulation environments that may be used are the open source Network Simulator 3 (NS-3), the Army tool EMANE, and Mininet. Conduct algorithm testing in MATLAB in its virtual network environment before deploying algorithms in a more realistic simulation environment using higher fidelity network and environment representations. (Experience with NS-3, EMANE or Mininet is not required.)\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n <li>Implement and test algorithms in MATLAB</li> <li>Incorporate algorithms in a generalized code and optimize algorithm performance</li> <li>Conduct network simulations to assess algorithm performance in a more physically realistic environment</li> <li>Run hardware simulations to understand performance impact on a network</li> <li>Conduct compiler simulations to understand computational complexity</li> <li>Assess the limitations of the MATLAB network environment</li> <li>Customize software solutions to meet research and analysis objectives</li> <li>Perform basic analytics on simulation data</li> <li>Prepare and present</li>\n</ul>\n\n<strong> Qualifications:</strong> \n<br><br>\n<ul>\n <li>Bachelors' degree in Engineering, Computer Science, Mathematics or related field; Master's degree preferred</li> <li>At least 2 years of related professional experience with one or more of C++, Java, Python programming languages required</li>  <li>Experience with MATLAB a plus</li> <li>Experience with machine learning, such as the Tensorflow framework, a plus</li> <li>Good written and verbal communication skills</li> <li>Due to the sensitivity of customer related requirements, U.S. Citizenship is required.</li> <li>Applicants selected for employment will be subject to a federal background investigation and may need to meet additional eligibility requirements for access to classified information or materials.</li>\n</ul>\n\n<strong>\n<br>\nReady for action? We're looking for the kind of people who see this opportunity and don't hesitate to act. Parsons is a leader in the world of technical services. We hire people with a broad set of technical skills who have proven experience tackling some of the greatest challenges. Take your next step and apply today.\n<br><br>\nParsons Referral Plan\n<br><br>\nMaybe this opportunity isn't the right fit for you, but you know someone who is? Why not join our Parsons external referral program? When you refer other top professionals and they are hired, you are rewarded with an incredible financial incentive. Help us find top talent!</strong>\n<br><br>"}