{"job title": "Data Scientist", "company": "PayJoy", "city state": "– San Francisco, CA, US", "rating": "5.0", "job description": "<div>\nPayJoys mission is to make smartphones affordable for everyone in the world. Our unique technology enables people who lack credit to purchase their first smartphone on an installment plan.</div> <br>\n<div>\nAs a Data Scientist at PayJoy, you will join a small but passionate team that is using data, machine learning, PayJoys patented mobile technology and gumption to rewrite the rules that currently govern who on this planet can access a smartphone. You will be an early member of a team that has its eyes on something big. You will research, design, develop, validate, deploy and monitor machine-learning models that span multiple geographies, each with their own product, credit, and business applications. You will apply your skill set in automation and AI to collaborate on initiatives across product, engineering, marketing, and operations teams, or anything else that you know or believe you could learn faster than anyone else on the team. You will work with everyone in the company to ensure that they understand (in human terms) what the data is whispering to you. The ideal candidate will not only possess all of these skills, but will also recognize that humility and empathy for our user drive a better product and forge a stronger team.</div> <br>\n<div>\n<strong>Responsibilities</strong></div><ul>\n\n<li>\nDesign and select features, tune optimized ML classifiers and track them in production</li>\n<li>\nMine data using state-of-the-art methods</li>\n<li>\nStrategically expand PayJoys data using 3rd party information when it exists</li>\n<li>\nMethodically enhance data collection procedures to discover high value information</li> \n<li>\nProcess, clean, and verify the integrity of data used for analysis</li>\n<li>\nBuild lightning fast ad-hoc analysis with concise and actionable results</li>\n<li>\nCreate automated anomaly detection and tracking systems</li>\n</ul>\n\n<br>\n<div>\n<strong>Skills and Qualifications</strong></div><ul>\n\n<li>\nMasters or Ph.D. in Engineering or Statistics related fields</li>\n<li>\nExcellent understanding of machine learning techniques and algorithms</li>\n<li>\nExcel with data science toolkits in Python or R</li>\n<li>\nProficiency querying data in SQL, Redshift, and Spark</li>\n<li>\nApplied statistical skills including test design, probability theory and time-series</li>\n<li>\n5+ years professional experience building algorithms and automated systems</li> \n<li>\nExperience in Lending/Finance or FinTech is a plus</li>\n</ul>\n\n<br>\n<div>\nAs part of PayJoy, you will have the opportunity to work on meaningful projects that immediately impact our customers, work alongside seasoned and fun-loving professionals, and contribute to a startup that is experiencing rapid growth.</div><div>\n<strong>About PayJoy</strong></div><div>\nPayJoy started in 2015 offering smartphone financing options to the 80 million under-served Americans and immigrants who lack any options to finance their first smartphone. We are now serving customers in the US, Mexico, India, and Indonesia and launching in more countries across Asia and Africa, with the ultimate goal of bringing 1 billion people into the modern digital, mobile economy for the first time.</div><br>\n<div>\nWe are a team of 70+ (and growing) with experience from Stanford, MIT, Google, Amazon, Uber, Facebook, McKinsey, Kiva, and Citibank, funded by top FinTech investors.</div><div>\nPress: TechCrunch Huffington Post Wall Street Journal Union Square Ventures Medium Investopedia</div> \n<br>"}