{"job title": "Big Data Engineer", "company": "PayPal", "city state": "– San Jose", "rating": "3.7", "job description": "Job Description Summary:<p></p>PayPal’s Global Data Science organization is in charge of developing unique, best-of-breed ML/AI algorithms using cutting-edge technologies. We are looking for a motivated and experienced big data engineer, to join a highly skilled team of experienced professionals, which believe in best-of-breed software craftsmanship, clean and elegant coding, using the right tool for the job, and always exploring and learning new technologies and approaches.<p></p><p>Job Description:</p><p>We are looking for an experienced Data Engineer to help develop new projects on Hadoop big data platform..</p><p></p><ul><li>Be responsible for practicing technical design, developing new functionality and maintaining existing components</li><li>Deep dive into PayPal’s world class risk systems and algorithms and work side by side with data scientists and analysts on data centric analytic solutions</li><li>Contribute to PayPal’s efforts to fight Fraud, using advanced algorithms and technology, while deploying the code you develop into PayPal’s live systems, and having a true global effect</li></ul><p></p><p>Requirements:</p><ul><li>B.S. in computer sciences or equivalent</li><li>At least 8 years solid server-side development with Java</li><li>Solid knowledge of basic algorithms</li><li>A passion for developing robust, scalable software systems</li><li>Strong OOP skills, ability to analyze requirements and prepare design<ul><li>Hands on experience with common open-source and Java EE technologies</li><li>Spring</li><li>SQL, JDBC/ORM, JMS</li><li>App servers / Servlet containers</li><li>Maven/Git/Continuous integration</li></ul></li></ul><p></p><p>Advantage:</p><ul><li>Experience working in agile methodology</li><li>Experience working on Big Data platform</li><li>Experience working on front end technologies</li><li>Experience working both in startups and in large companies</li><li>Good communication skill to global business and technical partners</li><li>Highly motivated, goal driven, Can-do approach</li><li>Innovative, entrepreneurial, team player, ability to multi-task</li></ul><p></p><p>Subsidiary:</p>PayPal<p></p><p>Travel Percent:</p>0<p></p><p>Primary Location:</p>San Jose, California, United States of America<p></p><p></p><p></p><p>Additional Locations:</p><p></p><p></p>Masters Degree or Equivalent<p></p><p></p><p></p><p></p><p><b>We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.</b></p><p></p><p></p><p><b>Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.</b></p>"}