{"job title": "Principle Credit Data Scientist", "company": "PayPal", "city state": "– San Jose", "rating": "3.6", "job description": "Job Description Summary:<br><br>• Develop and validate cutting-edge, industry leading credit risk models using advanced data mining and machine learning techniques.\n\n\n<ul>\n<li>Collaborate with business, product, other data scientists and engineers to formulate innovative solutions to experiment and implement advanced data mining techniques</li>\n<li>Lead all aspects (development, communication and implementation) of complex, high impact credit model projects</li>\n<li>Lead and mentor junior data scientists in the team</li>\n<li>Be the subject matter expert on Credit and Credit Model development</li>\n<li>Work closely with legal, compliance, model governance and model risk management to take models through the approval process</li>\n<li>Work with large volumes of data; extract and manipulate large datasets using standard tools such as Python, Hadoop, SPARK, R, SQL &amp; SAS</li>\n<li>Analyze data covering a wide range of information from user profile to transaction history. Identify new risk patterns through data mining</li>\n<li>Communicate complex concepts and the results of the analyses in a clear and effective manner through creative visualization<br><br>Job Description:</li>\n\n</ul>\n\n\n<ul>\n<li>Develop and validate cutting-edge, industry leading credit risk models using advanced data mining and machine learning techniques.\n\n\n<ul>\n<li>Collaborate with business, product, other data scientists and engineers to formulate innovative solutions to experiment and implement advanced data mining techniques</li>\n<li>Lead all aspects (development, communication and implementation) of complex, high impact credit model projects</li>\n<li>Lead and mentor junior data scientists in the team</li>\n<li>Be the subject matter expert on Credit and Credit Model development</li>\n<li>Work closely with legal, compliance, model governance and model risk management to take models through the approval process</li>\n<li>Work with large volumes of data; extract and manipulate large datasets using standard tools such as Python, Hadoop, SPARK, R, SQL &amp; SAS</li>\n<li>Analyze data covering a wide range of information from user profile to transaction history. Identify new risk patterns through data mining</li>\n<li>Communicate complex concepts and the results of the analyses in a clear and effective manner through creative visualization</li>\n</ul>\n<strong>Qualification</strong></li>\n\n</ul>\n\n\n<ul>\n<li>Advance degree (MS or PhD) in science or engineering field with 6+ years of relevant experience (Credit or Credit Modeling experience a huge plus)</li><li>Strong problem-solving and communication skills</li><li>Have a passion for working on big data and professional experience in data mining, statistical analysis, predictive modeling and data manipulation.</li><li>Strong Unix background and programming experience in C/C++, or Java, and skills in scripting languages such as Perl or Python. Familiar with various Machine Learning algorithms and Statistical methods</li><li>SQL and Hadoop / Other Big Data skills preferred</li><li>Experience in consumer credit risk or other financial services</li>\n</ul>\nSubsidiary:<br><br>PayPal<br><br>Travel Percent:<br><br>0<br><br>Primary Location:<br><br>San Jose, California, United States of America<br><br>Additional Locations:\n<br><br>\n<strong>We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.</strong>\n<br><br>\n<strong>Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.</strong>"}