{"job title": "Head-Data Science Operational Excellence", "company": "PayPal", "city state": "– San Jose", "rating": "3.7", "job description": "Job Description Summary:<br><br>We are looking for an experienced leader to head the Data Science Operational Excellence team. This team owns all aspects of Portfolio, Program, and Process management for our 300+ strong Global Data Sciences organization, constantly seeking opportunities to improve how we operate.<br><br>Job Description:\n<br><br>\nAs our Global Data Sciences team (GDS) grows in size, responsibilities, and complexity, we are expanding our Operational Excellence team, and looking for the right leader to head that function. GDS delivers a varied suite of data solutions across multiple technologies, leveraging the very-Big Data sets of PayPal and cutting-edge Machine Learning algorithms to directly impact the company’s bottom line and customer experience.\n<br><br>\nThe Operational Excellence team supports GDS constant strive for improvement, assuring timely deliveries of complex projects, tracking and measuring our performance, aligning plans with our partners across the company, and much more.\n<br><br>\nThe head of the O.E. team would be responsible for:\n<ul>\n<li>Leading a global team of technical program managers</li><li>Manage, track, and report the group’s portfolio (several hundred solutions annually)</li><li>Own the group’s operational KPIs, and constantly improving their results</li><li>Drive and enhance our planning cycles</li><li>Manage dependencies and interfaces with partner-teams in the company</li><li>Define, own, and enhance any relevant process in our organization</li><li>Other OE activities as needed</li>\n</ul>\n<strong><u>Required Skills and Experience</u></strong>\n<ul>\n<li>An experienced manager of teams in similar domains</li><li>A trust-building people-person with strong communication skills</li><li>Proven experience in a global, multi-cultural, environment; Managing people outside the U.S. a plus</li><li>Experience in large corporations and/or technology companies. Data technology or data science domains – a big plus</li><li>Knowledgeable with the domain’s common tools and software, and industry’s best practices</li><li>Higher education degree in relevant fields (CS/data) is a plus</li><li>Fluent in Agile methodologies, official certifications a plus</li><li>Forward-thinking leader, always striving to improve and learn, and not afraid of the details</li>\n</ul>\nSubsidiary:<br><br>PayPal<br><br>Travel Percent:<br><br>0<br><br>Primary Location:<br><br>San Jose, California, United States of America<br><br>Additional Locations:\n<br><br>\n<strong>We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.</strong>\n<br><br>\n<strong>Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.</strong>"}