{"job title": "Artificial Intelligence Innovation Hub Data Scientist Manager", "company": "PCO Innovation", "city state": "– VA - Norfolk", "rating": "3.9", "job description": "<ul>\n<li>Job description</li>\n\n<br><br>\n</ul>\n\n<div>\n<div>Join Accenture Digital and leave your digital mark on the world, enhancing millions of lives through digital transformation. Where you can create the best customer experiences and be a catalyst for first-to-market digital products and solutions using machine-learning, AI, big data and analytics, cloud, mobility, robotics and the industrial internet of things. Your work will redefine the way entire industries work in every corner of the globe.</div>\n<br>\n<div>You’ll be part of a team with incredible end-to-end digital transformation capabilities that shares your passion for digital technology and takes pride in making a tangible difference. If you want to contribute on an incredible array of the biggest and most complex projects in the digital space, consider a career with Accenture Digital.</div>\n<br>\n<div><strong>Analytics</strong> professionals create new insights from predictive statistical modeling activities that target and deliver value to our clients.</div> \n<br>\n<div>The <strong>Data Science Manager</strong> manages, architects and analyzes big data in order to build data driven business insights and high impact data models to generate significant business value. Creates models and processes to collect, distill and interpret data with a view to aid better, more informed decision making. Examines and explore data from multiple disparate sources with the goal of discovering insights which in turn can provide competitive advantage for our clients.</div>\n<br>\n<div><strong><u>Job Description</u></strong></div>\n<br>\n<div><strong>Analytics</strong> professionals use quantitative methods to derive actionable insights and outcomes from data.</div>\n<br>\n<div>A professional at this position level within Accenture has the following responsibilities:\n<br>\nIdentifies, assesses and solves <strong>complex business problems</strong> for area of responsibility, where analysis of situations or data requires an in-depth evaluation of variable factors.\n<br>\nClosely <strong>follows the strategic direction</strong> set by senior management when establishing near term goals.\n<br>\nInteracts with <strong>senior management</strong> at a client and/or within Accenture on matters where they may need to gain acceptance on an alternate approach.\n<br>\nHas<strong> some latitude</strong> in decision-making. Acts independently to determine methods and procedures on<strong> new assignments</strong>.\n<br>\nDecisions have a major day to day impact on<strong> area of responsibility</strong>.\n<br>\nManages <strong>large - medium sized teams</strong> <strong>and/or work efforts</strong> at a client or within Accenture.</div></div>\n\n<br>+ Basic qualifications<br>\n\n<div>\n<div><strong><u>BASIC QUALIFICATIONS</u></strong></div>\n<br>\n<div>Minimum 5 years of experience in data science and use of statistical methodologies.</div> \n<br>\n<div>Minimum 5 years of experience capturing, assessing and making recommendations, including reviewing data for completeness and consistency, analyzing and interpreting data.</div>\n<br>\n<div>Minimum 3 years of designing algorithms to address technical problems</div>\n<br>\n<div>Minimum 3 years of developing machine learning methods, including familiarity with techniques in clustering, regression, regression, optimization, recommendation, and other.</div>\n<br>\n<div>Strong quantitative and analytical skills with minimum 3 years of experience with data science tools, including Python, R, Scala, Julia, or SAS.</div> \n<br>\n<div>Bachelor’s degree in data science and related disciplines as mathematics, statistics, computer science, physics, or related fields.</div> \n<br>\n<div><strong><u>Preferred Qualifications</u></strong></div>\n<br>\n<div>Master’s degree preferred.</div>\n<br>\n<div><strong><u>Professional Skill Requirements</u></strong></div>\n<br>\n<div>Proven ability to build, manage and foster a team-oriented environment Proven ability to work creatively and analytically in a problem-solving environment Desire to work in an information systems environment Excellent communication (written and oral) and interpersonal skills Excellent leadership and management skills</div>\n<br>\n<div>Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture.\n<br><br>\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n<br><br>\nAccenture is a federal contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.\n<br><br>\nEqual Employment Opportunity\n<br>\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n<br><br>\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n<br><br>\nAccenture is committed to providing veteran employment opportunities to our service men and women.</div></div>\n<br>"}