{"job title": "Data Scientist", "company": "Pearson", "city state": "– Centennial, CO", "rating": "3.1", "job description": "Data Scientist\n<br><br>\nDescription\n<br><br>\nAt Pearson, we're committed to a world that's always learning and to our talented team who makes it all possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always re-examining the way people learn best, whether it's one child in our own backyard or an education community across the globe. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology and each other to surpass these boundaries we create seeds of learning that become the catalyst for the world's innovations, personal and global, large and small.\n<br><br>\n<strong>About:</strong>\n<br><br>\nWe are looking for a Data Scientist specializing in Deep Learning Methods to join Pearson's AI Products and Solutions team. Our mission is to enable the development of AI-first, outcome-driven products to improve learning experiences. The position provides the opportunity to engage in cutting-edge research on a cross-functional team and contribute to developing products that have an impact on millions of learners around the globe.\n<br><br>\nIn this role, you'll have the opportunity to:\n\n\n<ul>\n<li>Develop capabilities that contribute to the field of machine learning, using complex data sources including emerging content types and technology-based student interactions.</li>\n<li>Execute on research and development to implement state of the art techniques such as deep learning, and reinforcement learning in educational applications.</li>\n<li>Work collaboratively with team members and other stakeholders to build functional prototypes leading to new products and businesses.</li>\n</ul>\n\n<strong>##</strong>\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\nWe are looking for a Data Scientist with:\n\n\n<ul>\n<li>Experience working with deep learning frameworks (e.g. TensorFlow, pyTorch)</li>\n<li>Experience designing, developing and implementing novel deep learning techniques</li>\n<li>M.S. in CS or a related field or relevant experience.</li>\n<li>Demonstrable advanced coding skills using Python.</li>\n<li>A knack for creative problem solving and willingness to learn new technologies and skills.</li>\n</ul>\n\n<strong>Nice to Have:</strong>\n\n\n<ul>\n<li>Ph.D. in CS or a related field or relevant experience.</li>\n<li>Experience deploying models into production applications.</li>\n<li>Experience writing unit-tests for deep learning models.</li>\n<li>Experience with Computer Vision and or Natural Language Processing a plus.</li>\n<li>Experience or interest in learning C</li>\n</ul>\n\n<strong>#LI-TM</strong>\n<br><br>\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.\n<br><br>\nPrimary Location: US-CO-Centennial\n<br><br>\nWork Locations: US-CO-Centennial-2154 East Commons 2154 East Commons Avenue Centennial 80122\n<br><br>\nJob: Research and Development\n<br><br>\nOrganization: Global Product\n<br><br>\nJob Type: Standard\n<br><br>\nShift: Day Job\n<br><br>\nJob Posting: Nov 14, 2018\n<br><br>\nJob Unposting: Ongoing\n<br><br>\nSchedule: Full-time Regular\n<br><br>\nReq ID: 1813690\n<br><br>\nPearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply."}