{"job title": "Senior Machine Learning Engineer", "company": "Pearson", "city state": "– Boulder, CO", "rating": "3.1", "job description": "**Senior Machine Learning Engineer**<br> <br> <br> <br>**Description**<br> <br> <br> <br>At Pearson, we?re committed to a world that?s always learning and to our talented team who makes it all possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always re-examining the way people learn best, whether it?s one child in our own backyard or an education community across the globe. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology ? and each other to surpass these boundaries ? we create seeds of learning that become the catalyst for the world?s innovations, personal and global, large and small.<br> <br> <br> <br>**Senior Machine Learning Engineer**<br> <br> <br> <br>We have an excellent opportunity on our automated scoring team for a versatile, experienced **Senior Machine Learning Engineer** who thrives in a collaborative, problem solving and solution delivery environment. Working closely with a small team of experts,you will have a unique opportunity to play a leading role in migrating machine learning based solutions from R&amp;D to product-level operational delivery.<br> <br> <br> <br>The team at Pearson offers a unique environment for extremely skilled and motivated thinkers. Our culture is highly charged with people who are passionate about a cause, using technology to enhance students? educational experiences.<br> <br> <br> <br>Learn more about what we do here:<br> <br> <br> <br>http://www.pearsonlearningnews.com/automated-scoring-5-things-to-know-and-a-history-lesson/<br> <br> <br> <br>**Responsibilities:**<br> <br> <br> <br>Working in a small-team, you will create and deliver commercial software services that automatically evaluate student writing. Primary responsibility is to create, test, and maintain machine-learning based services used in a variety of assessment and learning situations from K-20 and beyond.<br> <br> <br> <br>What we?re looking for:<br> <br> <br> <br>+ A programming expert with a passion for machine learning and operational delivery<br> <br> <br> <br>What you'll do:<br> <br> <br> <br>+ Use machine learning techniques to develop scalable solutions for scoring written responses to essay and short answer questions<br> <br>+ Establish scalable, efficient, automated processes to develop, validate, implement, and monitor machine learning models<br> <br>+ Work with other software and data engineers to produce high quality production code.<br> <br> <br> <br>**Qualifications**<br> <br> <br> <br>What would make you a good fit:<br> <br> <br> <br>+ Strong coding &amp; analytics skills including proficiency in python and Linux<br> <br>+ Expert grasp of Computer Science/Engineering including data structures, data modeling, algorithms, distributed systems and software design.<br> <br>+ Proficiency at querying SQL and NoSQL databases and ability to build and maintain processes to retrieve and integrate data from various sources.<br> <br>+ Experience with Web Application Development including HTTP, REST, DevOps.<br> <br>+ Experience with Cloud Development (e.g. Amazon EC2, Docker, Kubernetes)<br> <br>+ Track record of producing machine learning models and production infrastructure at scale<br> <br>+ Strong verbal and written communication skills including the ability to interact effectively with colleagues of varying technical and non-technical abilities<br> <br>+ Passionate about agile software processes, data-driven development, reliability, and systematic experimentation<br> <br>+ Masters degree or higher preferred<br> <br>#LI-JDM<br> <br> <br> <br>Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.<br> <br> <br> <br>**Primary Location:** US-CO-Boulder<br> <br> <br> <br>**Work Locations:** US-CO-Boulder-4940 Pearl East 4940 Pearl East Circle Suite 200/201/204 Boulder 80301<br> <br> <br> <br>**Job:** Technology<br> <br> <br> <br>**Organization:** Assessments School<br> <br> <br> <br>**Employee Status:** Regular Employee<br> <br> <br> <br>**Job Type:** Standard<br> <br> <br> <br>**Shift:** Day Job<br> <br> <br> <br>**Job Posting:** Nov 15, 2018<br> <br> <br> <br>**Job Unposting:** Ongoing<br> <br> <br> <br>**Schedule:** Full-time Regular<br> <br> <br> <br>**Req ID:** 1815009<br><br>Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply."}