{"job title": "Polymer Scientist (Engineer/Technologist)", "company": "Penn Color", "city state": "– Hatfield, PA", "rating": "4.2", "job description": "<strong>WHO WE ARE</strong>\n<br><br>\n<strong><em>Penn Color is the most diverse manufacturer of color concentrates in the United States and a global leader within our industry. We have a rare and unique 50-plus year history of growth, stability and success that stems from our leadership, our exceptional workforce and our attention to our customers. We remain family owned to this day, we maintain a culture based on traditional values and we continue to project a very promising, long-term outlook. If you are looking to join a cohesive team and contribute your expertise in a meaningful manner, we should be your employer of choice!</em></strong><br><br><strong>Now hiring for our new, state of the art, Plastics and Technology Research &amp; Development Center!</strong>\n<br><br>\n<strong>Penn Color is constantly growing and we are looking for our next great hire to join our R&amp;D team in our plastics laboratory that specializes in the coloration and physical properties of plastics. W</strong><strong>e offer a friendly environment that invests in your future and values your contributions.</strong>\n\n\n<ul>\n\n\t<li>We will consider both experienced professionals as well as recent grads (will provide significant training)</li>\n\n<li>The large majority of this role will be conducting bench work with the remaining time being spent interacting with Production, Quality Control and Customers</li>\n\n<li>You will be working hands-on with polymers, additives, pigments and operating processing equipment that will include single and twin screw extruders, injection molders, blow molders, two roll mills, etc.</li>\n\n<li>Your Education should include a BS degree in a related science field, polymers preferred (will consider an Associate’s degree or certification in plastics related discipline with equivalent experience)</li>\n</ul>\n\n<strong>As an integral part of our R&amp;D team, you will:</strong>\n\n\n<ul>\n\n\t<li>Work directly with R&amp;D staff from our customers to develop new innovative products for them</li>\n\n<li>Evaluate and formulate products being used in the manufacturing of plastic products</li>\n\n<li>Conduct analyses on existing product lines (i.e., perform analyses to resolve customer issues)</li>\n\n<li>Employ a variety of dispersion techniques commonly utilized in experimentation (extrusion, injection molding, blow molding, etc.)</li>\n\n<li>Ability to learn or have knowledge of the following test equipment, including but not limited to, Melt Flow and Rheology, UV Vis, Spectrophotometers, Differential Scanning Calorimetry (DSC) and Thermo Gravimetric Analysis (TGA)</li>\n\n<li>Utilize various laboratory instrument software (X-Rite, Data Color, etc.)</li>\n\n<li>Prepare small batch samples for direct customer sampling</li>\n\n<li>Scale up products from laboratory to production</li>\n\n<li>Work collaboratively in teams to brainstorm solutions to both short term and long term opportunities and maintain good working relationships with all team members</li>\n\n<li>Prepare reports to include findings, observations and next steps</li>\n\n<li>10-20% travel may be required (conferences and customer visits)</li>\n\n<li>Other duties as assigned</li>\n</ul>\n\n<strong>We offer competitive compensation, excellent medical benefits and a 401K with company match. We are a stable company that makes decisions for the long term (and not by the fluctuation of a stock price!).</strong> \n<br><br>\n<strong>Find out more…</strong>go ahead and submit your resume!<br><br><em>Penn Color, Inc. is an Equal Employment Opportunity employer. We adhere to a policy of making employment decisions without regards to race, color, religion, sex, age, disability or any other protected categories. It is our intention that all qualified applicants be given an equal opportunity and that selection decisions be based on job-related factors.</em>"}