{"job title": "Healthcare Data Analyst - PSHMG PRG PLN/MGT RPT/FAC IMPR", "company": "Penn State Milton S. Hershey Medical Center", "city state": "– Hershey, PA", "rating": "3.5", "job description": "Penn State Health Milton S. Hershey Medical Center\n<br><br>\nLocation: US:PA:Hershey\n<br><br>\nWork Type: Full Time\n<br><br>\n<strong>FTE: 1.0</strong>\n<br><br>\nShift: Days\n<br><br>\nHours: Days\n<br><br>\n<strong>JOB SUMMARY:</strong>\n<br><br>\nThe Healthcare Data Analyst is responsible for customer-focused reporting and analytical support to the leadership in the Penn State Health System. Support the day-to-day activities required in all areas of planning and business development relative to developing, directing, and communicating new or expanded clinical and business opportunities. Facilitates the development and maintenance of data collection, analysis, and reporting of internal data and external market and environmental data to assist leadership in making sound business decisions. The Healthcare Data Analyst also promotes data integrity through using and developing standards based measures. This position is within the department of Program Planning, Management Reporting and Facilities Improvement of the Penn State Health Academic Medical Group.\n<br><br>\n<strong>MINIMUM QUALIFICATIONS:</strong>\n<br><br>\nBachelor's Degree in Business, Mathematics, Statistics, and/or Healthcare Management required.\n<br><br>\nThree (3) years of experience in Strategic Planning, Reporting, or Data Analysis required.\n<br><br>\nAnalytical experience required.\n<br><br>\nStrong Excel skills (pivot tables, v-lookups, graphing, macros and VBA scripting) required.\n<br><br>\n<strong>KNOWLEDGE, SKILLS, &amp; ABILITIES:</strong>\n<br><br>\nStrong communication skills, analytical skills and understanding of the academic health environment required.\n<br><br>\nStrong Microsoft Suite tools experience (especially Excel and Access) required.\n<br><br>\nKnowledge of relational databases and querying techniques (e.g. SQL).\n<br><br>\nPractical knowledge of planning and business development and analysis techniques required.\n<br><br>\nAbility to manage multiple projects simultaneously and work under pressure required.\n<br><br>\nExcellent computer, organization, and project management skills.\n<br><br>\nCapacity to quickly adapt to changes in both technology and business environments.\n<br><br>\nAbility to troubleshoot technical and functional problems.\n<br><br>\nExceptional written and oral communication skills.\n<br><br>\nAbility to produce clear, written operational instructions and supporting documentation.\n<br><br>\n<strong>PREFERRED QUALIFICATIONS:</strong>\n<br><br>\nMBA/MHA preferred.\n<br><br>\nHealth planning or hospital experience preferred.\n<br><br>\nIf chosen for this position, you may be required to pass a Post Offer Employment Physical Exam in accordance with the measurements listed in the Work Task Analysis (WTA) report. This job description is a general outline of duties performed and is not to be misconstrued as encompassing all duties performed within the position. All individuals (including current employees) selected for a position will undergo a background check appropriate for the position's responsibilities.\n<br><br>\nPenn State Health is an equal opportunity, affirmative action employer, and is committed to providing employment opportunities to all qualified applicants without regard to race, color, religion, age, sex, sexual orientation, gender identity or expression, national origin, disability or protected veteran status. If you are unable to use our online application process due to an impairment or disability, please call 717-531-8440 between the hours of 8:30 AM and 4:30 PM, Eastern Standard Time, Monday - Friday, email hrsolutions@pennstatehealth.psu.edu or download our Accommodation Instructions for Job Applicants PDF for more detailed steps for assistance.\n<br><br>\nUnion:Non Bargained"}