{"job title": "Healthcare Data Scientist", "company": "People Force Consulting Inc", "city state": "– Jacksonville, FL", "rating": "NA", "job description": "People Force Consulting is looking for <strong>Data Scientist</strong> with Healthcare Domain experience for our direct client based in Florida.\n<br><br>\nPlease find the JD below.\n<br><br>\n<strong>Note: Bachelors Degree copy is must for submission along with visa copy and photo id.</strong>\n<br><br>\n<strong>Data Scientist</strong>\n<br><br>\n<strong>Jacksonville, FL</strong>\n<br><br>\n<strong>Long Term</strong>\n<br><br>\n<strong>Mandatory Skills:</strong>\n<br><br>\n· 7-10 years of experience in Data Analysis\n<br><br>\n· Postgraduate qualification in Statistics (OR Computer Science) from a premier institute\n<br><br>\n· Having hands-on experience on advanced analytics concepts and algorithms (e.g. Regression analysis Logistic Regression/Decision Tree, Monte Carlo methods, Survival Analysis, Simulation, Random Forest, Time series analysis etc.)\n<br><br>\n· Exposure to tools – SPSS, SAS, R, Python\n<br><br>\n· Excellent communication skills\n<br><br>\n· Excellent critical thinking and problem-solving skills\n<br><br>\n· High motivation, good work ethic and maturity\n<br><br>\n<strong>Job Responsibilities / Role:</strong>\n<br><br>\n· Developing advanced algorithms that solve problems of large dimensionality in a computationally efficient and statistically effective manner\n<br><br>\n· Implementing statistical and data mining techniques e.g. hypothesis testing, machine learning, and retrieval processes on a large amount of data to identify trends, patterns and other relevant information\n<br><br>\n· Expert on creating predictive models using SAS Enterprise Miner\n<br><br>\n· Knowledge of databases, data modeling, data normalization etc. is a must\n<br><br>\n· Collaborating with clients and other stakeholders to effectively integrate and communicate analysis finding\n<br><br>\n· Providing guidance and project management support to the Associates on the team\n<br><br>\n· Evaluating emerging datasets and technologies that may contribute to our existing analytical platforms\n<br><br>\n· Establish the scope of the project, lead internal communication with stakeholders, and ensure delivery of the project per commitment.\n<br><br>\n· Contributing to the thought leadership of the company by helping in researching the evolving topics and publishing them\n<br><br>\n· Healthcare knowledge especially claims &amp; member data is a very preferable<br><br>- provided by Dice\n<br><br>\nHealthcare experience, SPSS, SAS, R, Python, SAS Miner, Predictive Modelling, etc"}