{"job title": "Data Scientist - Security Número de Empleo: 159290BR -", "company": "PepsiCo, Inc.", "city state": "– Plano, Texas", "rating": "3.4", "job description": "<strong> Auto req ID:</strong> 159290BR\n<br>\n<strong> Street Address:</strong> United States - TX - Plano - 5600 Headquarters Dr - 75024-5838\n<br><br>\n<strong> <strong> Job Description</strong></strong>\n<br><br>\n<strong> Data Scientist Security</strong> \n<br><br>\nThe Data Scientist in Security will deliver industry-leading analytics solutions that protect PepsiCo information and assets globally against unauthorized access, security risks, data loss, and cyber attacks.\n<br><br>\nThis role will design and develop data models using machine learning to solve key security problems, and help mature PepsiCo's security analytics strategy, partnering with PepsiCo stakeholders across all organizational levels to implement and manage a portfolio of security analytics platforms. The Data Scientist will have strong analytical and communication skills, fostering relationships across organizations and serving as a key Security Engineering point of contact.\n<br><br>\n<strong>\n<br>\nResponsibilities:</strong>\n<li> Delivers large, complex long-term analytics driven projects involving multiple technologies and vendors with broad implications for the IT architecture</li> <li> In partnership with security analysts and incident response teams, develops strategies and actionable plans for enablement and continuous improvement of security analytics capabilities</li> <li> Develops tactical plans for security analytics and detection solutions</li> <li> As a subject matter expert, influences technology solutions to maximize threat detection benefit while adhering to secure design principles and utilizing PepsiCo methodology, best practices and policies</li> <li> Stays current with the industry, security standards/best practices and relevant industry trends</li> <li> Determines, tracks and monitors key metrics to mitigate risks to PepsiCo and remediates when necessary</li>\n<strong> <strong> Qualifications/Requirements</strong></strong>\n<br><br>\n<strong> Education:</strong>\n<li> Bachelors degree in Computer Science, Statistics or related fields; Masters degree preferred</li> <strong> Experience:</strong> <li> Four or more years of data analytics experience</li> <li> Proficiency in at least one of the following programming languages: Python, R, Java or Scala</li> <li> Experience with machine learning toolkits such as Scikit-learn and Weka</li> <li> Experience with big data frameworks such as Hadoop and Spark</li> <li> Two or more years of experience in Information Security preferred</li> <li> Strong analytical and communication skills</li> <li> Demonstrated effectiveness working across multiple business units to achieve results</li> <strong> Relocation Eligible:</strong> Not Eligible for Relocation\n<br>\n<strong> Job Type:</strong> Regular\n<br><br>\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.\n<br><br>\nPepsiCo is an Equal Opportunity Employer: Female / Minority / Disability / Protected Veteran / Sexual Orientation / Gender Identity\n<br><br>\nFor San Francisco Bay Area: Our Company will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco Police Code Sections 4901 - 4919, commonly referred to as the San Francisco Fair Chance Ordinance.\n<br><br>\nIf you'd like more information about your EEO rights as an applicant under the law, please download the available EEO is the Law &amp; EEO is the Law Supplement documents. View PepsiCo EEO Policy\n<br><br>\nPlease view our Pay Transparency Statement"}