{"job title": "Data Scientist", "company": "Perspecta Labs", "city state": "– Washington, District of Columbia", "rating": "NA", "job description": "Overview:<div><div><div>Every day at Perspecta, we enable hundreds of thousands of people to take on our nations most important work. Were a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nations most complex challenges. We continually push ourselvesto respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.\n<br><br>\nAs the innovation hub of Perspecta, Perspecta Labs is molding the future of emerging technologies. We refuse to think inside the box. Our experts conduct leading research in machine learning, artificial intelligence (AI), mobile communications and internet of things (IoT) technologies that provides customers with transformative insights and real-time situational intelligence. With your finger on the pulse of next-gen technology, youll be rewarded in many waysnot only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.\n<br><br>\nPerspectas talented and robust workforce14,000 strongstands ready to welcome you to the team. Lets make an impact together.\n<br><br>\nPerspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories</div> </div></div>Responsibilities:<div><div><div>Description of the project: The demand for analysis of data sets, data analytics and text analytics is growing with the expanding streams of available data. The projects are designed to provide enterprise analysis, analytical software, tools, dashboards, reports and analytical data support to the customer, all based on the methods and models developed by financial economists.</div> </div></div>Qualifications:<div><div><div>Minimum qualifications: - Masters degree in computer science, statistics, or applied mathematics - 4 years' experiencein creating machine learning pipelines to derive insights from data (i.e., from data aggregation and cleaning, to using machine learning techniques) - Familiarity with unsupervised (e.g., clustering), semi-supervised (e.g., label propagation), and supervised learning (e.g., ensemble classifiers) algorithms, and when it is appropriate to use each - Deep experience in creating, managing, and analyzing large datasets - Familiarity with contemporary scripting languages such as Python and R, the Hadoop computational ecosystem, Oracle relational databases, and the Linux/UNIX operating system Preferred qualifications: - Knowledge of deep learning paradigms and architectures</div> </div></div>"}