{"job title": "Journeyman - Data Scientist", "company": "Perspecta Inc.", "city state": "– Springfield, VA", "rating": "3.0", "job description": "Journeyman - Data Scientist Apply Job ID 2015-41217 Location Springfield, Virginia, United States Clearance Top Secret/SCI w/Poly\n<br><br>\n<strong>Overview:</strong>\n<br><br>\nEvery day at Perspecta, we enable hundreds of thousands of people to take on our nation's most important work. We're a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation's most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselvesto respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.\n<br><br>\nPerspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many waysnot only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.\n<br><br>\nPerspecta's talented and robust workforce14,000 strongstands ready to welcome you to the team. Let's make an impact together.\n<br><br>\nPerspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nInvolved in the analysis of unstructured and semi-structured data, including latent semantic indexing (LSI), entity identification and tagging, complex event processing (CEP), and the application of analysis algorithms on distributed, clustered, and cloud-based high-performance infrastructures. Exercises creativity in applying non-traditional approaches to large-scale analysis of unstructured data in support of high-value use cases visualized through multi-dimensional interfaces. Handle processing and index requests against high-volume collections of data and high-velocity data streams. Has the ability to make discoveries in the world of big data. Requires strong technical and computational skills - engineering, physics, mathematics, coupled with the ability to code design, develop, and deploy sophisticated applications using advanced unstructured and semi-structured data analysis techniques and utilizing high-performance computing environments. Has the ability to utilize advance tools and computational skills to interpret, connect, predict and make discoveries in complex data and deliver recommendations for business and analytic decisions. Experience with software development, either an open-source enterprise software development stack (Java/Linux/Ruby/Python) or a Windows development stack (.NET, C#, C++). Experience with data transport and transformation APIs and technologies such as JSON, XML, XSLT, JDBC, SOAP and REST. Experience with Cloud-based data analysis tools including Hadoop and Mahout, Acumulo, Hive, Impala, Pig, and similar. Experience with visual analytic tools like Microsoft Pivot, Palantir, or Visual Analytics. Experience with open source textual processing such as Lucene, Sphinx, Nutch or Solr. Experience with entity extraction and conceptual search technologies such as LSI, LDA, etc. Experience with machine learning, algorithm analysis, and data clustering. Conceive and prepare thorough, well articulated tactical or strategic data science products (e.g., technical articles, visualizations, graphics, and intelligence reports) that summarize the methods and results of data science solutions. Design a range of research projects, data collection and methodologies. Identify and appropriately evaluate a wide range of existing methods, models and algorithms in familiar domains for a variety of mission driven problems; recognizing the capabilities and limitations of methods. Identify, retrieve, manipulate, relate and/or exploit multiple structured data sets from various sources. Identify problems to which data science can be applied and initiate appropriate solutions.Qualifications:\n<br><br>\nJourneyman - Full-performance level, expected to work with minimal oversight. Personnel considered competent in their trade with 3 years of greater but less than 10 years of experience. A bachelors degree in a field related to the support service may count for up to four years of experience. Journeyman should be fully capable of meeting most services without direction and expected to assist apprentice level personnel in learning their trade. Government and/or contractor personnel may perform quality control assurance checks on their work but should not find significant errors. Journeyman level are expected to collaborate with government and contractor personnel in NGA and the IC in the performance of services. Such collaboration should provide accurate technical information that contributes to analytical synergy that is better than the sum of the individual parts and expected to regularly provide division level support and may periodically be called upon to provide support at the office level. Demonstrated good oral and written communication skills."}