{"job title": "Principal Data Scientist, Drug Safety", "company": "Pfizer Canada Inc.", "city state": "– Groton, Connecticut", "rating": "3.8", "job description": "The DSRD data operations group primary objective is the building and accelerating the reuse of cross domain data and information that enables portfolio decision making. This position will be responsible for working with the data operations lead and other members of the data group within DSRD in executing the strategy developed by the lead and SOE LT.\n<br><br>\n<strong> ROLE RESPONSIBILITIES</strong>\n<li> This position will be using their expertise to support the data operations lead in navigating the existing data framework within DSRD, identify ongoing data initiatives within DSRD and across WRD, and develop new solutions. Will be closely working with partners outside of DSRD such as Business Technology and external vendors.</li> <li> This position will provide technical leadership and expertise required to develop solutions that are geared towards streamlining the data aggregation process, enabling DSRD global line leads and scientists within the lines with access to data in a timely manner and provides high throughput solutions for data visualization.</li> <li> This position will be responsible for creating and sustaining innovative approaches to analyze, transfer, map, catalog, search, configure, and integrate data and information for reuse. Will also be the resident expert of the data systems that are utilized by DSRD and be a close advisor to the data operations lead.</li> <li> Will be responsible for extending and enhancing the current visualization capabilities of the current set of data within DSRD and across WRD.</li>\n<strong> Education:</strong>\n<br><br>\nBachelor or (Master or PhD) (preferred) Degree in Biological Sciences, IT, or related field.\n<br><br>\n<strong> Required:</strong>\n<li> At least 5 years relevant data management, mining, visualization, analysis or reporting experience</li> <li> At least 5 years relevant database programming experience in SQL, SAS, or R, Python programming</li> <li> At least 3 years relevant experience with data visualization tools (SpotFire preferred)</li> <li> Good interpersonal and communication skills needed to interact with business groups globally as well as technical delivery and support teams</li> <li> Ability to present technical information to a non-technical, scientific audience</li> <li> Ability to build and maintain strong relationships with internal technology partners and external vendors</li>\n<strong> Preferred:</strong>\n<li> All or part of relevant experience working with Biopharmaceutical (non)clinical data</li> <li> Solid understanding and experience on Artificial Intelligence, Natural Language Processing, or machine learning projects</li> <li> Knowledge of (non)clinical drug research, development and global regulatory submission processes</li> <li> Relevant experience working in the Amazon Web Service (AWS) environment</li> <li> Thorough understanding of CDISC regulatory requirements and relevant data standards. CDISC knowledge and experience are preferable.</li>\nSome (5-10%) travel within US to DSRD sites\n<br><br>\n<strong> EEO &amp; Employment Eligibility</strong>\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\n<strong> Sunshine Act</strong>\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care providers name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong> Other Job Details</strong>\n<br><br>\nAdditional Location Information: Cambridge, MA and La Jolla, CA\n<br><br>\nEligible for Employee Referral Bonus\n<br><br>\nEligible for Relocation\n<br><br>\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}