{"job title": "Big Data and AI Engineer", "company": "Pfizer", "city state": "– La Jolla, CA", "rating": "3.9", "job description": "As a member of the Pfizer Analytics Lab team, a component of Pfizer's Business Technology organization, the Data Engineer will join a team of highly collaborative data scientists &amp; engineers dedicated to leveraging data and advanced analytics to create a healthier world. This team member will contribute their dynamic perspective and knowledge to data engineering and advanced analytics, inspire colleagues and peers to develop and implement critical data driven solutions within Pfizer's drug discovery efforts.\n<br><br>\nSpecifically, this group is focused on developing a set of capabilities designed to enable highly efficient exploration, experimentation, and rapid hypothesis generation based on internal, public, and commercially available datasets to continue supporting Pfizer's data driven, forward thinking approach to data science\n<br><br>\nDay-to-day, the Data Engineer will\n\n\n<ul>\n<li>Build services and tooling around \"scraping\" databases, loading logs, fetching data from external stores or APIs</li>\n<li>Automate data consumption from other source systems, files etc.</li>\n<li>Collaborate with other engineering, cloud infrastructure , security and product management teams to understand requirements and develop highly scalable system designs and architecture</li>\n<li>Integrate new data management technologies and software engineering tools into existing structures</li>\n<li>Create custom software components and analytics applications</li>\n<li>Employ a variety of languages and tools to marry systems together</li>\n<li>Participate in the assessment of new technologies as well as identifying next-generation solution architectures.</li>\n<li>Develop efficient analytic pipelines that include components related to data acquisition, exploratory analysis, feature engineering, modeling, and interactive storytelling.</li>\n<li>Shared-ownership of advancing team's data engineering capabilities through the ability to implement and execute on state-of-the-art approaches</li>\n<li>Co-develop re-usable components that will serve as the foundation for a scalable approach for Pfizer's analytic maturation</li>\n<li>Partner with other Business Technology teams to define and execute technology POCs using innovative technologies to advance Pfizer's analytic capabilities</li>\n<li>Directly engage with key business stake-holders (Director level)</li>\n<li>Informal leadership of project teams comprised of Associate/Sr. Associate level colleagues</li>\n</ul>\n\n<strong>QUALIFICATIONS</strong>\n<br><br>\nBachelor's Degree in Computer Science, Operations Research, physics, applied mathematics, statistics required\n<br><br>\nAdvanced Degree in Computer Science, Operations Research, physics, applied mathematics, statistics or related field strongly preferred\n\n\n<ul>\n<li>5 years' experience working as a Data/ML Engineer</li>\n<li>3 years working with semi-structured and unstructured data</li>\n<li>2 years working in a cloud based ecosystem, preferably Amazon Web Services.</li>\n<li>Ability to thrive in a fast-paced multi-disciplinary environment; with the ability to effectively communicate with a diverse audience</li>\n<li>Ability to create technical examples, prototypes, and demonstrations based on rapidly changing data sets</li>\n<li>Excellent written and verbal communication skills</li>\n</ul>\n\nTechnical Qualification\n<br><br>\nProven experience in at least two of the three following categories:\n<br><br>\nData Science / Machine Learning\n\n\n<ul>\n<li>Expertise with general-purpose statistics/machine learning algorithms and at least one of the following sub-disciplines: Natural Language Processing, Deep Learning, Network Analysis.</li>\n<li>Expertise with the implementation of algorithms within Python, R or Scala</li>\n<li>Expertise with model tuning, validation and evaluation</li>\n</ul>\n\nData Engineering\n\n\n<ul>\n<li>Expertise with SQL development, database administration and performance tuning</li>\n<li>Expertise with data manipulation and extraction using modern programming languages (Java, C++, C#, Python, Scala, Spark, etc.)</li>\n<li>Experience with Unix/Linux development package management, knowledge of filesystems, performance monitoring/troubleshooting</li>\n<li>Experience with sourcing data from APIs; experience building APIs is a plus</li>\n<li>Experience with a variety of data stores for unstructured and columnar data as well as traditional database systems, for example, ElasticSearch, MongoDB, Cassandra, HBase, MySQL, Postgres and Vertica</li>\n</ul>\n\nMachine Learning Engineering\n\n\n<ul>\n<li>Experience building production implementations of data science and engineering pipelines</li>\n<li>Building and running high throughput real-time and batch data processing pipelines using Spark, Flink, Storm, Kafka or equivalent technologies</li>\n</ul>\n\nEEO &amp; Employment Eligibility\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\nSunshine Act\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong>Other Job Details:</strong>\n\n\n<ul>\n<li>Eligible for Employee Referral Bonus</li>\n<li>This position can sit in La Jolla, CA, New York, NY or Collegeville, PA</li>\n</ul>\n\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}