{"job title": "Senior Associate Scientist, Spectroscopist / PAT Support", "company": "Pfizer", "city state": "– Groton, MA", "rating": "3.9", "job description": "The Senior Associate Scientist will join the SPECTech Group whose mission is to elevate the understanding of process operations through the appropriate use of integrated PAT technology, multivariate data analytics and advanced process control in support of drug substance and drug product development and manufacturing. The candidate with help with the development of FAST platform technologies by utilizing appropriate sensors and online analytics. The candidate will work with vibrational spectroscopy instruments, perform multivariate data analytics and draw appropriate conclusions from various experiments.\n<br><br>\n<strong>ROLE RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Collaborate with project team to monitor reactions to enhance process understanding.</li>\n<li>Assist with instrument support, calibration and installation across the Pfizer suite of activities in support of drug substance synthesis.</li>\n<li>Support the development of FAST platform technologies by utilizing PAT approaches for process monitoring.</li>\n<li>Contribute to the data analyses of reactions, drawing appropriate conclusions and summarizing in oral and written communications as needed.</li>\n</ul>\n\n<strong>BASIC QUALIFICATIONS</strong>\n\n\n<ul>\n<li>BS/MS Degree and 0-3 years of experience in Analytical Chemistry or Engineering.</li>\n<li>Knowledgeable in vibrational spectroscopy (NIR, IR, Raman, UV-Vis) as well as understanding of other analytical techniques such as MS, NMR, HPLC and GC.</li>\n</ul>\n\n<strong>PREFERRED QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Microsoft Office, Matlab, or other chemometrics software is desirable.</li>\n<li>Engineering experience: unit operations, process engineering, and continuous manufacturing is a plus.</li>\n<li>Strong computer, scientific, and organizational skills.</li>\n<li>Excellent communication (oral and written) and attention to detail.</li>\n<li>Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude.</li>\n<li>Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies.</li>\n</ul>\n\n<strong>NON-STANDARD WORK SCHEDULE, TRAVEL OR ENVIRONMENT REQUIREMENTS</strong>\n<br><br>\nRole may require some off-hour availability to provide remote support for design, implementation, and/or system troubleshooting for operations in other time zones.\n<br><br>\nEEO &amp; Employment Eligibility\n<br><br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\nSunshine Act\n<br><br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n<br><br>\n<strong>Other Job Details:</strong>\n\n\n<ul>\n<li>Last Date to Apply for Job: December 31, 2018</li>\n<li>Eligible for Employee Referral Bonus: yes</li>\n<li>Eligible for Relocation Package: yes</li>\n</ul>\n\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}