{"job title": "Associate Scientist, Diagnostic Assays", "company": "Pfizer", "city state": "– Pearl River, New York", "rating": "3.9", "job description": "The position requires analyst participation in both diagnostic and antibody detection assays, including but not limited to assay development and clinical testing. The position also requires keeping current on documentation related to various work activities. The job involves performing other tasks as assigned related to specimen testing and functional assays using aseptic techniques. As an integral member of our dynamic team, the incumbent must have a strong work ethic and be highly collaborative with the other group members. All of the above includes practicing laboratory safety at all times and adherence to GLP compliance.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Perform all functions to support assay development, qualification, validation, and analysis of non-clinical and clinical samples.</li>\n<li>Perform assays to support critical assay reagent testing, assay development/ troubleshooting.</li>\n<li>Collect, collate and analyze data on a per project basis to support troubleshooting, qualification and other lab projects.</li>\n<li>Assist in ordering supplies from internal inventory and order/prepare reagents/supplies necessary for assay work. Assist in updating and writing documents associated with assays, including information/data archiving, SOPs and status reports.</li>\n<li>Satisfactorily completes all GLP and safety training in conformance with Departmental requirements.</li>\n<li>Stay current on all departmental and corporate training.</li>\n<li>Performs other tasks as assigned.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br>\n<strong>Education &amp; Experience:</strong>\n<br>\nBachelor's degree and 2 years relevant experience, or a Master's degree.\n<br><br>\n<strong>Technical Skills Requirements:</strong>\n<br>\nLaboratory experience in a biology, immunology and/or microbiology. Knowledge of Luminex technology, mammalian cells, automated instruments and aseptic techniques is a plus. Familiar with input of data into a database using LIMS software.\n<br><br>\nThe incumbent will be trained on required Policies, Practices, and Procedures needed to support work responsibilities. Proficiency in the use of Word, Excel, PowerPoint and Graphpad Prism® and relevant scientific software is desirable. Good verbal and written communication skills are required.\n<br><br>\n<strong><strong>EEO &amp; Employment Eligibility</strong></strong>\n<br>\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\n<br><br>\n<strong>Sunshine Act</strong>\n<br>\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\n\n<ul>\n<li><strong>Last Date to Apply for Job:</strong>  December 1, 2018</li>\n</ul>\n\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.\n<br>"}