{"job title": "Senior Scientist I, DMPK", "company": "Pharmacyclics", "city state": "– Sunnyvale, CA", "rating": "2.4", "job description": "<div><div> <p>Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer. <br>\n<br>\nMore than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer. </p>\n\n<p>To learn more about us, please visit us at http://www.pharmacyclics.com/</p>\n\n<p><strong>General Position Summary/Purpose: </strong> </p>\n\n<p>Provide in vitro ADME support to Pharmacyclics drug discovery and development projects. Conceive and implement novel experimental approaches to answer in vitro ADME questions in support of drug discovery and development projects. Investigate, develop, validate or optimize existing and new methods for solving project related scientific issues. Work closely with bioanalytical and PK scientists, and report into drug metabolism function, integrating DM and PK data to support preclinical development of drug candidates and regulatory submissions. Contribute to project science in the area of DMPK, by developing productive collaborations and communications with other groups across scientific disciplines.</p>\n\n<p> </p>\n\n<p><strong>Key Accountabilities/Core Job Responsibilities:</strong></p>\n\n<ul>\n<li>Routinely demonstrate scientific initiative and creativity in research or development activities.</li>\n<li>Highly autonomous and productive in performing laboratory research requiring only minimal direction from supervisor. </li>\n<li>Demonstrates high proficiency across a wide range of in vitro ADME technologies and capable of initiating new areas of investigation that are scientifically meaningful and can be incorporated into a research or development program.</li>\n<li>Maintain a high level of productivity in the lab.</li>\n<li>Primary author of publications, presentations, regulatory documents or inventor of patents.</li>\n<li>Understand and adhere to corporate standards regarding code of conduct, safety, appropriate handling of materials, controlled substances, radioactive compounds and GxP compliance.</li>\n<li>Cell culture experience and capable of performing bi-directional permeability studies using Caco2, MDCK or similar cell lines.</li>\n<li>Working knowledge of drug transporter sciences, and capable of performing and interpreting in vitro drug transporter studies (substrate and inhibitor) in recombinant cell lines or hepatocytes.</li>\n<li>Knowledgeable and capable of conducting in vitro assays (CYP induction, CYP inhibition, protein binding, CYP phenotyping, metabolite profiling, CYP enzyme kinetics), data analysis and generating reports. </li>\n<li>Proficient in operating and trouble-shooting HPLC-tandem Mass spectrometer (LC-MS/MS). </li>\n<li>Effectively manage numerous tasks/projects simultaneously to meet internal/external deadlines while maintaining organizational integration within DMPK team</li>\n<li>Capable of organizing and presenting scientific plans, data analysis, formulating conclusions and designing follow-on experiments. </li>\n</ul>\n\n<p> </p>\n\n<p><b>Qualifications:</b> <b> </b></p>\n\n<ul>\n<li>Bachelor’s Degree or equivalent education and typically 10 years of experience, Master’s Degree or equivalent education and typically 8 years of experience, PhD with 1-3 years.</li>\n<li>Possess thorough theoretical and practical understanding of DMPK.</li>\n<li>Demonstrated ability to learn, understand and master new experimental techniques and act as a mentor for others.</li>\n<li>Ability to multitask and work within timelines.</li>\n<li>Demonstrated scientific writing skills and strong verbal communication skills.</li>\n<li> LC/MS/MS assessment of metabolism using unlabeled and radiolabeled test compounds. </li>\n<li> Ability to fully operate, maintain and troubleshoot Mass spectrometers, HPLC/UPLC systems, auto sampler and data software systems. Capable of optimizing conditions for quantitation and chromatographic separation of analytes in biological samples.</li>\n<li> Ability to effectively work in a team environment.</li>\n</ul> </div></div><div> <p>Equal Opportunity Employer Minorities/Women/Veterans/Disabled</p> </div><div><div> <br></div></div>"}