{"job title": "2019 University Intern - Data Scientist/Engineer", "company": "Phillips 66", "city state": "– Houston, TX", "rating": "3.5", "job description": "IT ALL STARTS WITH <strong>YOU.</strong> DISCOVER AN INTERNSHIP THAT <strong>SETS YOU APART.</strong>\n<br><br>\nInternships are a great way for us to get to know you and for you to get to know our company. We will offer you the same types of challenging assignments as our full-time hires and you will participate in our company-wide internship program:\n<br><br>\n<strong>Opportunities may include:</strong>\n\n<ul>\n<li>Attending orientation and training events, field trips, social activities, weekly seminars and opportunities to meet and interact with functional leaders</li> \n\n<li>Participating in performance reviews with your manager, who will provide coaching and guidance throughout your internship, as will your assigned mentor</li> \n\n<li>Giving a presentation about your work assignment and projects, as well as well what you learned from the internship program</li>\n</ul>\n<strong>Data Science Analytics</strong> is interdisciplinary, requiring programming and IT skills, math and statistics knowledge, and scientifice expertise. Our Data Scientists/Engineers work on challenging, high-value projects across all Phillips 66 business units.\n<br><br>\nAn <strong>internship with Phillips 66 Analytics &amp; Reporting</strong> is more than a summer job that will look good on your resume. Its an excellent opportunity to roll up your sleeves and make important contributions as a valued member of our team. You will not only enhance your knowledge, but will also learn how it applies and impacts the energy business on a daily basis. Youll gain first-hand experience in the energy industry and participate in other activities that are based on service, networking, and learning. Your summer experience will include:\n\n<ul>\n<li>Solve business proplems using data driven analytical approaches including machine learning, statistics, modeling, and artificial intelligence</li> \n\n<li>Implement models in Microsoft Azure, AWS, Hana, and other systems, including open source data science tools.</li> \n\n<li>Build end-to-end solutions to solve high value business needs in a sustainable, innovative manner</li> \n\n<li>Network with professionals at all levels in the company</li> \n\n<li>Learn about the Oil &amp; Gas industry and the extensive use of technology that makes it possible</li> \n\n<li>Work at our headquarters in Houston, Texas</li>\n</ul>\n<strong>Requirements for a Phillips 66 Internship:</strong>\n<br><br>\n<strong>Basic/Required:</strong>\n\n<ul>\n<li>Legally authorized to work in the job posting country</li> \n\n<li>Pursuing a Masters degree in Analytics, Data science or Engineering</li> \n\n<li>Scheduled to graduate from a Masters degree program August 2019 or later</li> \n\n<li>Available for a minimum of twelve continuous weeks</li>\n</ul>\n<strong>Preferred:</strong>\n\n<ul>\n<li>A minimum cumulative GPA of 3.0 on a 4.0 scale</li> \n\n<li>Previous internship or co-op participant in related industry</li> \n\n<li>Previous internship with Phillips 66</li> \n\n<li>Phillips 66 SHIELD Scholar recipient</li> \n\n<li>Willing to work in any of our operating locations</li> \n\n<li>Proficiency in R or Python and familiarity with data science packages in that language</li> \n\n<li>Understanding of Computer Science fundamentals in object-oriented design, data structures, algorithm design, and problem solving</li> \n\n<li>Familiarity with Agile Development</li>\n</ul>\n<strong>Competencies</strong>\n<br><br>\nAt Phillips 66, while \"what\" we do may be very different from person to person, there's a \"how\" that connects all of us. It is how we work, how we collaborate and how we succeed together. It's this shared \"how\" that our competency framework describes in detail. We call it the Keys to Success because it can unlock the potential within us all.\n<br><br>\nKeys to Success\n\n<ul>\n<li>Assoc: AdaptabilityAdapt And Learn</li> \n\n<li>Assoc: Building Collaborative RelationshipsForm Relationships</li> \n\n<li>Assoc: CommunicationCommunicate Openly</li> \n\n<li>Assoc: JudgmentApply Sound Logic</li> \n\n<li>Assoc: Results OrientationSeek Process Improvement</li>\n</ul>\n<strong>To apply and be considered:</strong>\n\n<ul>\n<li>You must apply through your university prior to university deadlines (if applicable) AND</li> \n\n<li>Apply online by going to http://www.p66oncampus.jobs at http://www.p66oncampus.jobs/ and complete the entire application process</li> \n\n<li>Attach an electronic copy of your resume and unofficial transcript</li>\n\n<li>Answer all prescreening questions and provide your eSignature</li>\n</ul>\nCandidates for regular U.S. positions must be a U.S. citizen or national, or an alien admitted as permanent resident, refugee, asylee or temporary resident under 8 U.S.C. 1160(a) or 1255(a)(1). Individuals with temporary visas such as E, F-1, H-1, H-2, L, B, J, or TN or who need sponsorship for work authorization now or in the future, are not eligible for hire.\n<br><br>\n<strong>Phillips 66 is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities</strong>\n<br><br>\n<strong>About Phillips 66</strong>\n<br><br>\nPhillips 66 is a diversified energy manufacturing and logistics company. With a portfolio of Midstream, Chemicals, Refining, and Marketing and Specialties businesses, the company processes, transports, stores and markets fuels and products globally. Phillips 66 Partners, the company's master limited partnership, is an integral asset in the portfolio. Headquartered in Houston, the company has 14,500 employees committed to safety and operating excellence. Phillips 66 had $52 billion in assets as of March 31, 2018. For more information, visit www.phillips66.com or follow us on Twitter @ Phillips66Co at http://twitter.com/phillips66Co and @ p66oncampus at http://twitter.com/p66oncampus .\n<br><br>\n<strong>Requisition ID:</strong> 47977\n<br><br>\n<strong>Department:</strong> Information Technology\n<br><br>\n<strong>Location:</strong> United States - Texas - Houston\n<br><br>\n<strong>Job Field:</strong> Internships, Graduate Positions, and Student Programs\n<br><br>\n<strong>Technical Requisition:</strong> No"}