{"job title": "Data Scientist", "company": "Philips", "city state": "– Pleasanton", "rating": "3.4", "job description": "Job TitleData Scientist<p></p>Job Description<p><b>In this role, you have the opportunity to lead a dynamic and innovative Technology group with cutting edge solutions in Artificial Intelligence and Neuroscience: </b>This role will be part of the newly formed Philips Neuro business unit which is focused on delivering more definitive diagnosis and better therapy guidance in patients suffering from some of the most challenging and impactful neurologic disorders including Epilepsy, Stroke, TBI, etc. Our business unit is part of the Emerging Business group which acts as a new business incubator inside of the larger Philips HealthTech umbrella. We have an unrelenting focus on driving innovation from scientific research to clinical solutions. The group has both a strong scientific research group and a product development team that will translate the research innovation work into meaningful product introductions, new market developments, and transform the way neurology is done today. </p><p></p><p><b>You are responsible for: </b></p><ul><li>Develop analysis and models based on various medical data, including EEG waveforms, other physiological data, metadata to develop algorithms that solve problems for neurological disorders</li><li>Apply an in-depth understanding of advanced mathematical concepts, ML/DL and statistics</li><li>Creates data collection models that generate insight</li><li>Contributes to the development of data platform and governance standards</li><li>Drive data science thought leadership to healthcare</li></ul><p></p><p><b>You are part of</b></p><p>An opportunity to work with Philips Neuro, an emerging business unit that is focused on “Better Science, Better Care”. This group will drive the thought leadership for integration of AI and Neuroscience to develop new ways to measure/monitor and treat. It brings world class technologies in High Density EEG, and multimodal analysis with Medical Imaging modalities (i.e., MRI/CT) and delivers solutions that will have a direct impact on patient care. You will be part of a nimble team of highly skilled professionals, who value a great work-life balance</p><p></p><p><b>To succeed, you should have the following skills and experience:</b></p><ul><li>PhD or Masters in a quantitative discipline: Computer Science, Statistics, Applied Mathematics, Operations Research, Engineering</li><li>Minimum 3 years' experience as a Data Scientist</li><li>Strong programming experience in Python, if not MATLAB or Java</li><li>Working knowledge of health care systems and healthcare terminology</li><li>Expert in analyzing large complex, multi-dimensional data sets with a variety of tools</li><li>Ability to thrive and demonstrate constant applied learning in highly complex, interdisciplinary, and dynamic work environment</li><li>Ability to proactively identify opportunities and solve challenging business problems with a variety of data tools in a fast-paced, collaborative environment.</li><li>Ability to use predictive analytics and classical modeling techniques for statistical inference and creation of data insights.</li><li>Ability to work in a variety of data environments, e.g., Hadoop HDFS, SQL, Mongo, etc.</li></ul><p>Desired:</p><ul><li>Expertise in neuroscience</li><li>Experience in Artificial Intelligence technologies and deep familiarity with key tools, technologies in AI</li><li>Experience in a global matrix organization / multi-site development environment</li></ul><p></p><p><b>In return, we offer you:</b></p><p>Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the <u>health continuum</u>. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways. Learn more by <u>watching this video</u>.</p><p>To find out more about what it’s like working for Philips at a personal level, visit the <u>Working at Philips page </u>on our career website, where you can read stories from our <u>employee blog</u>. Once there, you can also learn about our <u>recruitment process</u>, or find answers to some of the <u>frequently asked questions</u>.</p><p></p><p>To find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there, you can also learn about our recruitment process, or find answers to some of the frequently asked questions.</p><p>Philips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.</p><p>As an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.</p><p></p>Contact<p><b>If you forgot your password, you can click the Forgot Password button on the Sign In screen to reset it. In case of technical difficulties, please send an email to </b>careersite@philips.com<b>. </b><br>(Note: To ensure fairness and legal compliance in our recruitment processes, only technical issues will be monitored through the above inbox. Please do not submit resumes or applications to this email, as they will not be reviewed. Only applications received through the online application process will be considered.)</p>"}