{"job title": "Data Scientist", "company": "Phreesia", "city state": "– New York, NY", "rating": "3.8", "job description": "<strong>The</strong> <strong>Role:</strong><br><br>Phreesia is looking for an experienced and hands-on Data Scientist to join our growing Data Science Team; someone with extraordinary analytical and technical skills who is familiar with the entire lifecycle of a data science project, from data modeling, exploration, model selection, evaluation, and deployment.\n<br><br>\nYou will be joining a team of especially smart, humorous, quick-witted, and dedicated coworkers, all passionate about data and improving patient access to healthcare. You will be responsible for building data products for internal consumption, near real-time business intelligence tools, and predictive models. We are looking for someone with years of experience partnering with business stakeholders, translating their needs into technical solutions and answers, and then building and delivering those solutions.<br><br><strong>You will:</strong>\n\n\n<ul>\n<li>Leverage Phreesia's massive and ever-growing dataset to build data products that provide actionable business insights</li>\n<li>Propose new Machine Learning models to improve our existing products, as well as devise and build models for new opportunities</li>\n<li>Navigate and use diverse machine learning stacks in (e.g. Python, R, Keras) and make good decisions about which to use to solve a problem.</li>\n<li>Use NLP techniques to parse, process and structure textual data</li>\n<li>Quickly prototype ideas and solve complex problems by adapting creative approaches.</li>\n<li>Build customized dashboards for internal and external clients.</li>\n<li>Ensure new projects are tracked properly throughout their life cycle.</li>\n<li>Write clean, well-tested, code that will stand the test of time.</li>\n<li>Be an expert communicator: You could summarize your daily progress in a tweet.</li>\n</ul>\n\n<strong>What you will need:\n<br><br>\n</strong>\n\n\n<ul>\n<li>2+ years of experience in an operational Data Science role.</li>\n<li>Demonstrable professional command of Machine Learning and Data Science toolsets such as Python (Numpy, Scipy, Pandas, Scikit-learn), R (dplyr, tidyverse, ggplot).</li>\n<li>M.Sc. or Ph.D in computer science, engineering, statistics, computational linguistics, or other quantitative field or relevant equivalent professional experience</li>\n<li>Understanding of and demonstrable experience using statistical principles to communicate results (experimental design, a/b testing and other frameworks).</li>\n<li>Ability to collaborate with Data Scientists and Data Engineers to propose, test, validate, evaluate, and deploy Machine Learning Models.</li>\n<li>Hands on experience using Apache Spark in a professional context</li>\n<li>Strong SQL skills</li>\n<li>Hands-on experience and understanding of Graph and/or search Databases (e.g. neo4j, elasticsearch) is a plus</li>\n<li>Healthcare experience and a basic understanding of clinical terms is a plus</li>\n<li>Experience building knowledge graphs and representations is a plus</li>\n</ul>\n<em>We strive to provide a diverse and inclusive environment and are an equal opportunity employer.</em>"}