{"job title": "Data Scientist", "company": "Pinnacle Partners", "city state": "– Indianapolis, IN", "rating": "3.0", "job description": "<strong>Data Scientist</strong>\n<br><br>\n<strong>Up to $125K</strong>\n<br><br>\n<strong>DC778521919</strong>\n<br><br>\nPinnacle Partners is assisting their client in their search for a Data Scientist to add to their growing team located in the Greater Chicago or Indianapolis area. Our client is seeking an individual who will be responsible for all machine learning and artificial intelligence throughout the organization. This in an excellent opportunity to join a growing team and work with the latest and greatest technologies.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<ul>\n\n<li>Leverage large sets of unstructured and structured data to form tactical and strategic insights.</li>\n<li>Cooperate with data and analytic teams to set approaches, objectives, and work plans.</li>\n<li>Research and assess new analytical approaches, solutions, and methodologies.</li>\n<li>Form and validate statistical forecasting tools and models.</li>\n<li>Interpret and communicate analytic results to non-analytical and analytical executive decision makers and business partners.</li>\n\n</ul>\n<strong>REQUIRED SKILLS</strong>\n<ul>\n\n<li>Advanced degree (Masters at a minimum).</li>\n<li>2+ years’ experience in advanced analytics and machine learning model development and validation.</li>\n<li>2+ years’ demonstrated experience working on analytic-based projects and delivering results within scope, funding, and duration.</li>\n<li>2+ years’ experience leading projects and interacting with non-technical users to explain modeling results and meaning.</li>\n<li>Working experience with a statistical package and various programming languages such as Java, Python, R, C++, Matlab, SAS, and etc.</li>\n<li>Standard classification and regression techniques experience, including feature selection, dimension reduction, and hypothesis testing.</li>\n<li>Solid communication skills with the ability to explain modeling results to non-technical users.</li>\n<li>Capacity for a high degree of autonomy and out-of- the-box thinking.</li>\n\n</ul>\n<strong>TERMS</strong>\n<br><br>\nThis is a direct hire role with a salary up to $125K. They offer excellent benefits including full medical benefits, 401K match, PTO and great work life balance."}