{"job title": "Data Scientist", "company": "Pinterest", "city state": "– San Francisco, CA, US", "rating": "4.2", "job description": "As a data scientist on Pinterest's team, you love data and want to use it to improve people’s lives. You’ll use your engineering, data wrangling, and analytical expertise to influence the direction of the product with your data-driven feature ideas. You’ll work closely with A/B experiment owners to ensure that their experiments run successfully and will partner with our data engineering team to build the data pipelines and dashboards that enable feature owners to make informed decisions about their own experiments. You'll jump into analysis on everything from latency and availability to new user experience to marketing channels, turning terabytes of raw logs into insights.<br><br>\n<strong>What you’ll do :</strong>\n<br>\nAsk and answer questions on key components of our product\n<br>\nCollect, analyze, and synthesize findings from data\n<br>\nCollaborate closely with product, engineering, and user research teams\n<br>\nProvide thought leadership on metrics, features, and products to the entire company\n<br>\nDrive the collection of new data and the understanding of existing data sources\n<br>\nAnalyze and interpret the results of A/B experiments and improve our experiment tools\n<br>\nHelp data users throughout the company improve their data literacy\n<br>\n<strong>What we’re looking for :</strong>\n<br>\nOver 2 years' experience in data analysis focused on product changes\n<br>\nPassion for using data to drive key product and business decisions\n<br>\nAbility to manipulate large data sets with high dimensionality and complexity\n<br>\nBelief in reproducible analysis, e.g. via R or IPython\n<br>\nFluency in SQL and at least one scripting language such as Python\n<br>\nEnthusiasm for rapid analysis in a fast-paced environment\n<br>\nFamiliarity with or willingness to learn large-scale distributed computing tools (Hadoop, Hive, etc.)\n<br>\nThe uncanny ability to identify unreasonable results\n<br>\nA well-tuned sense of skepticism\n<br>\nExcellent oral and written communication skills\n<br>\nAttention to detail and commitment to high-quality results"}