{"job title": "Data Scientist", "company": "Piper Enterprise Solutions", "city state": "– Mclean, VA 22102", "rating": "3.6", "job description": "JOB DESCRIPTION<br><br>Piper Companies is currently looking for a <strong>Data Scientist</strong> in <strong>McLean, VA</strong> for one of the largest credit unions in the country for mortgages, automobile loans, credit cards, and checking.\n<br><br>\n<strong>Responsibilities for the Data Scientist include:</strong>\n\n<ul>\n\n\t<li>Interact with and advise Management regarding credit risk issues; formulate product strategy recommendations, and evaluate the risk in the overall loan portfolio</li>\n<li>Autonomous end-to-end statistical model creation, Including but not limited to identifying objectives, compiling data, sampling/prepping data, feature selection, model comparison/selection, deployment and monitoring</li>\n<li>Ensure adequate internal control processes around model development, implementation and validation are established</li>\n<li>Develop, monitor and maintain of custom risk scorecards. Recommend and implement model changes to improve performance of credit functions</li>\n<li>Apply intermediate to advanced knowledge of financial processes and procedures, and routine modeling theories and techniques to create effective modeling solutions for a single or multiple business functions</li>\n</ul>\n<strong>Qualifications for the Data Scientist include:</strong>\n\n<ul>\n\n\t<li>1+ years of experience in related work building statistical models, and advanced data analysis</li>\n<li>Master’s degree or PhD candidate in Mat, Economics, Statistics and/or Data Science</li>\n<li>Experience with Logistic Regression, Linear Regression, Time Series Analysis, Decision Trees, and Cluster Analysis</li>\n<li>Advanced programming skills to include knowledge of statistical programs (e.g. SQL, SAS, SPSS, R, Python)</li>\n<li>Must be eligible for full-time employment</li>\n</ul>\n<strong>Compensation for the Data Scientist include:</strong>\n\n<ul>\n\n\t<li>Salary range: $80,000 - $130,000</li>\n<li>Full Benefits: Cigna Healthcare, MetLife Dental, VSP Vision, 401K with Voya and Paid Time Off</li>\n</ul>\nPlease send resumes to John Gray at jgray@pipercompanies.com\n<br><br>\nKeywords:\n<br><br>\nData science, data scientist, data, math, economics, modeling, data models, credit union, credit, loans, mortgages, SAS, R, Python, statistics, stats, PhD, masters, linear, regression, time series, logistics, cluster analysis, benefits, vacation, 401K"}