{"job title": "Data Scientist,Financial Services", "company": "Planet Green Search", "city state": "– New York, NY", "rating": "NA", "job description": "<ul>\n<li>Our Client is a leading online platform that provides innovative borrowing solutions to deserving customers. The company, headquartered in New York City, was founded by people who truly understand debt and want to help consumers get ahead to achieve financial success.</li>\n\n\n<li>\n<div>Our client, continues to innovate the lending process, allowing consumers to get started in minutes and access funding as quickly as tomorrow.</div>\n\n<br><strong></strong><div><strong>\nBackground</strong>:</div>\n\n<br>\n<br>\n<div>Consumer Lending start-up seeks an intellectually curious, collaborative data scientist/Sr. data scientist to work as a statistician and data miner. As a Data Scientist, you will use analytical, statistical and programming skills to collect, analyze and interpret large data sets. Then you use this information to develop data-driven solutions to risk and fraud strategy. This role will report to Chief Risk Officer.</div><br>\n\n<div><strong>Qualifications:</strong></div><div> Medical, Dental, and Vision Benefits</div>\n\n\n<ul>\n<li>401(k) match</li>\n\n<li>Paid Holidays, Sick Days, and Vacation</li>\n\n<li>6 weeks paid parental leave</li>\n\n<li>Pre-tax Transit Benefits</li>\n\n<li>Discounted Gym Membership</li>\n\n<li>No-cost Life Insurance Benefits</li>\n\n<li>Mine and analyze data from internal database and external vendor data to drive optimization and improvement of credit and Fraud strategy</li>\n\n<li>Research and Evaluate new data vendors and make recommendation on vendor selections</li>\n\n<li>Develop custom data models and algorithms to apply to data sets</li>\n\n<li>Use predictive modeling to optimize varies business across the organization including Marketing, Risk, and Operations</li>\n\n<li>Develop processes and tools to monitor and analyze model performance and data accuracy</li>\n\n<li>Be a self-starter and create data-backed recommendations to help Sr. manger make strategic business decision</li>\n\n<li>Masters or PhD in Mathematics, Statistics, Econometrics, Operation Research, Industrial Engineering or Computer Science is required.</li>\n\n<li>5+ years of experience manipulating data sets and building statistical models.</li>\n\n<li>Experience using statistical computer languages (SAS, Python, SQL, R) to manipulate data and draw insights from large data sets.</li>\n\n<li>Experience creating and using advanced machine learning algorithms and statistics: clustering, decision tree learning, neural networks, regression, simulation, etc. and understand their real-world advantages/drawbacks.</li>\n\n<li>Experience in statistical and data mining techniques: Random Forest, Boosting, Decision Trees, text mining, social network analysis, etc.</li>\n\n<li>Excellent written and verbal communication skills for coordinating across teams</li>\n\n<li>Consumer Lending Experience is required.</li>\n\n<li>Present the analyses, findings and recommendations to broader audience including senior leaders across the organization.</li>\n</ul>\n\n</li>\n</ul>"}