{"job title": "Scientist", "company": "Planet Pharma", "city state": "– Lexington, MA", "rating": "4.1", "job description": "<div>Job ID: BH60547\n<br><br>\nCategory: Scientist, Scientific, Quality Control (QC)\n<br><br>\nIndustry: Pharmaceutical<br>\n<div>\n<div>\n<div><strong>Summary:</strong>\n<br><br>\nPrimary duties of this position will include serving as a lead for various technical aspects of the QC areas. Position will provide both subject matter expertise as well as technical leadership on activities such as method related projects (ex. method transfers and validations), investigations, quality events, data analysis and trending, key program oversight (ex. reference standard program), and cross-functional interaction on various teams to enable appropriate overall QC support on projects and programs, as well as external coordination to contract organizations. Position will also assist in managing departmental and/or cross-functional teams occasionally.\n<br><br>\n<strong>Discretion/Latitude:</strong> \n<br>\nWorks autonomously and receives general instructions on new assignments.\n<br>\nProposes technical strategies and frequently discusses soundness of technical judgment and reviews progress in meeting objectives and timelines with supervisor.\n<br>\nOperates under compliance requirements. May independently refer to or seek guidance on policies and practices.\n<br><br>\n<strong>Impact:</strong> \n<br>\nExerts some influence on the overall objectives and long-range goals of the organization. Erroneous decisions or failure to achieve objectives would normally have a serious effect upon the administration of the organization.\n<br><br>\n<strong>Specific QC Focus Areas:</strong>\n<br><br>\n<u>Technical Support:</u> \n<br>\nArea is focused on various technical projects in support of the GMP laboratories, such as but not limited too automation support, method projects activities (ex. method transfer and validation support activities method remediation and troubleshooting, method monitoring), critical reagents and reference standard programs, global technical oversight program, cell bank adventitious agent safety testing.\n<br><br>\nRequires knowledge and proficiency in the design, execution, and validation of analytical techniques used in the laboratory such as HPLC, SDS-PAGE, Capillary Electrophoresis, Potency and Bioassays. Ability to troubleshoot method performance and propose corrections is essential.<br><br>Requirements:<br><br><strong>Knowledge:</strong> \n<br>\nUnderstands and applies advanced scientific principles, theories, concepts, practices and standards to process and product development. Keeps current with scientific knowledge in areas of expertise. Provides input to the development of new scientific knowledge.\n<br>\nStands accountable and systematically operates with the desired outcomes in mind to consistently deliver high quality results for work assignments and personal objectives.\n<br>\nEffectively plans activities and anticipates difficulties in delivering results.\n<br>\nNurtures network built on trust and respect beyond immediate circle of established relationships. Gains quick access to relevant parties and information using effective communication.\n<br>\nAddresses partners’ business issues and concerns beyond immediate needs. Assimilates different points of view to enhance collaboration. Is an active and reliable team player.\n<br>\nActively seeks ways to improve current systems and processes related to own activities.\n<br>\nMaintains focus and professionalism amongst frequently changing situations, circumstances and priorities.\n<br>\nProactively and systematically seeks and applies best practices for problem-solving and gap identification beyond one’s comfort level. Expands problem-solving abilities by assimilating new effective approaches.\n<br>\nUnderstands companies business, objectives and operations and how own activities fit within the company strategy.\n<br>\nApplies knowledge of product development and biotech industry to decision making and proactively reaches out to others for perspective and guidance\n<br><br>\n<strong>Key Skills:</strong> \n<br>\nMS Office, LIMS, SAP, Trackwise, compliance and strong science understanding\n<br><br>\n<strong>Education and Experience Requirements:</strong>\n\n<ul>\n\n\t<li>BA/BS in relevant scientific discipline with a minimum of 8 years relevant industry experience.</li> \n</ul>\n<strong>Additional Specific Experience:</strong> \n<br>\nTechnical expert in one or more analytical technologies.\n<br>\nKnowledge of theories, principles and techniques of relevant scientific areas and basic understanding of industry practices and standards.\n<br>\nExcellent communication, interpersonal and organizational skills.\n<br>\nProactive at keeping current with literature and latest technologies.\n<br>\nAbility to work well both independently and in a team environment.\n<br>\nAbility to prioritize work and multitask.\n<br>\nConducts work in compliance with cGMPs, safety and regulatory requirements.</div>\n </div><br>\n\n<div>\n<div>\n<div>\nType:\n<br>\n Temp/Contract\n<br>\n Location:\n<br>\n Lexington, MA<br>\n\n <div>\nApply Now</div>\n </div>\n </div>\n </div>\n </div>\n </div>\n<br>"}