{"job title": "Data Scientist (Multiple Levels)", "company": "Plume", "city state": "– Palo Alto, CA", "rating": "5.0", "job description": "At Plume, data driven decisions are at the heart of all our products. The Plume Data Platform enables massively scalable, real time event processing of billions of events to enable real-time business intelligence, machine learning based insights, and personalized engagement solutions for millions of households.\n<br><br>\n<strong>The Opportunity:</strong>\n<br><br>\nAs a Senior/Lead Machine Learning Software Engineer on the Plume Data team, you will build a real time, highly scalable, and resilient stream processing ecosystem on top of Apache Spark, Kafka, Keras, Tensorflow and Redshift. This is a unique ground-floor opportunity for self-motivated individuals to architect, implement and evolve a mission critical cutting-edge software platform.\n<br><br>\n<strong>What you will do:</strong>\n\n<ul>\n<li>Design and implement critical, highly scalable systems and algorithms to run analytics, workflow and machine learning</li>\n<li>Improve Scalability, Reliability and performance of our Streaming Data Pipelines built on top of Kafka and Spark</li>\n<li>Help drive the Design and Architecture of next generation Cloud Machine Learning platform</li>\n<li>Design methods to derive Data Insights via efficient and effective feature learning for challenging problems</li>\n</ul>\n<strong>Who we're looking for:</strong>\n\n<ul>\n<li>You have experience designing and implementing large scale distributed systems for Stream and Batch processing</li>\n<li>Your idea of fun is reading the Google Millwheel paper, and you get excited debating the merits of Flink versus Spark</li>\n<li>You have designed creative models to derive actionable insights from complex datasets</li> \n\n<li>You have a passion for creating new products, including being comfortable with ambiguity</li>\n<li>BS/MS/PhD in Computer Science or equivalent work experience</li>\n<li>Strong background in computer science algorithms</li>\n<li>Contributions to relevant open source projects is a plus</li>\n</ul>\n\n<div>\n<div>\n</div>\n</div>\n<br>"}