{"job title": "Data Scientist", "company": "Pluralsight", "city state": "– South Jordan, Utah", "rating": "4.2", "job description": "Company Description<br><br>Founded in 2004 and trusted by Fortune 500 companies, Pluralsight is the technology learning platform organizations and individuals in 150+ countries count on to innovate faster and create progress for the world.\n<br><br>\n<strong>Working at Pluralsight</strong>\n<br><br>\nAt Pluralsight, we believe everyone should have the opportunity to create progress through technology. That everyone should have access to the skills of tomorrow. That technology can make the world a better place. Through the work we do everyday, we empower the people who power our world.\n<br><br>\nAnd we dont let fear, egos or drama distract us from our mission. Were adults, and we treat each other that way. We have the autonomy to do our jobs, transparency to eliminate office politics and trust each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission, we are one.<br><br>Job Description<br><br>Do you have a passion for using data to drive decisions and inform the direction of products that impact the lives of people every day? Are you motivated to help decision makers unearth new possibilities and solutions for complex questions and challenges?\n<br><br>\nAs a Data Scientist for the Data Insights and Analytics team at Pluralsight, you will have the opportunity to see a direct link between your effort and corresponding business critical questions, insights, and outcomes. You will be part of an established team of top-notch, collaborative data scientists working on a breadth of challenges across the company and you will be working with a cutting-edge data platform.\n<br><br>\n<strong>You accomplish this by:</strong>\n<ul>\n<li>Interact with key internal business stakeholders to understand strategic questions and determine the appropriate technical approach</li><li>Develop innovative analytical solutions to business problems using statistical, mathematical, machine learning, or other quantitative methodology</li><li>Analyze large and complex datasets, interpret trends and patterns, and distill findings into actionable insights</li><li>Effectively communicate results, findings, and insights from complex analyses to any audience, particularly to company leaders</li><li>Collect, process and cleanse data from a wide variety of sources. Transform and convert unstructured data set into structured data for analysis</li><li>Develop and implement predictive models, machine learning algorithms, and/or optimization models</li><li>Distill the assumptions, general approach, and output of solutions based on mathematical algorithms or models to business partners and company leaders, eliminating black box distrust</li>\n</ul>\n\n<div><strong>You'd be a great fit if your experience looks like this:</strong></div><div>\n\n<ul>\n<li>Strong foundational knowledge of statistics and machine learning theories and techniques, particularly stochastic modeling, time series, operations research, and/or econometrics</li><li>Excellent critical thinking, problem solving, and analytical skills</li><li>Strong capability to manipulate and analyze complex, high-volume data from a variety of sources</li><li>Mastery of one or more scientific programming languages (R or Python)</li><li>Fluency in SQL and relational databases (e.g. PostgreSQL, SQL Server) and experience with big data platforms (Spark, Hive, Impala, Kafka, etc.)</li><li>Demonstrated experience delivering effective data visualization solutions (e.g. Shiny apps, D3, Tableau)</li><li>Excellent communication skills and the ability to serve as an analytic translator</li><li>Ability to problem solve independently and prioritize work based on anticipated business value</li><li>M.S. or Ph.D in Applied Math, Operations Research, Computer Science, Engineering, Computational Finance, Economics or other relevant quantitative discipline</li></ul></div>\n\n<br>"}