{"job title": "Data Scientist", "company": "Plymouth Rock Assurance", "city state": "– ", "rating": "4.0", "job description": "<div>The Plymouth Rock Company is the holding company for a group of insurance companies and is headquartered in Boston. It employs 1,500 people and writes and services over $1.billion in personal lines premium in New England and New Jersey. Plymouth Rock was founded in 1982 on the premise that combining extraordinary underwriting rigor, unparalleled customer service, and teamwork by passionate, driven professionals will lead to high levels of sustainable success. These core values that were the foundation of our company continue to serve us well. We offer a stimulating and highly collegial work environment\n<br>\n<strong>&nbsp;</strong>\n<br>\nInvention and Innovation in the insurance industry relies heavily on predictive modeling. In this role, you will be set on a constant “treasure hunt” for new data sources to apply the latest techniques for modeling to. You will have unparalleled opportunity to apply state-of-the-art machine learning techniques to real world datasets. You will work with highly intelligent and accomplished individuals who understand and value technical challenges. You will work on a team of PhD level statisticians to create ground-breaking predictive models using new analytical techniques that determine insurance pure premiums, customer life time value, customer buying behaviors and other related topics. This work will be used in setting pricing, underwriting, marketing, policy and claims service, fraud detection and product design strategies for the Plymouth Rock group of Companies. The role is not simply research: you will be part of a tactical team driving the profit and customer growth of an assigned business segment. The analysis and modeling will be tested via implementation both broadly and on a pilot basis to allow us to learn and refine our approaches in rapid succession.\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong><u>Data Analysis:</u> \n<br>\n</strong>\n<br>\nYou will work with internal and external data to understand and accurately predict:\n\n<ul>\n<li>Expected insurance losses;</li><li>Shopping behavior;</li><li>Retention behavior;</li><li>Most compelling value propositions;</li> <li>Awareness and consideration of brand;</li><li>Quote and conversion rates;</li> <li>Retention and lifetime customer value</li><li>Contribution to overall margin;</li><li>Appropriate and actuarially sound risk pooling;</li><li>Loss cost and claim frequency trends / inflation;</li><li>Customer satisfaction;</li><li>Routing and service step-by-step design;</li><li>Fraud detection and handling strategy;</li><li>“Unpriced risk” existence and tracking; and</li><li>Other drivers of success you identify worthy of analysis.</li>\n</ul>\n\nYou will need to find and understand various internal and external data sources as well as obtain and cleanse such data to make it usable and to extract, clean, and manipulate large datasets (structured and unstructured) for model building. You will develop illicit hypothesis from internal personnel regarding key variables and test those hypotheses using available data. You will design, build and append to a data warehouse and DataMart connecting data with common categorical and identifying descriptors, and make the data and your derived analytical measures to production systems, underwriters and other personnel.\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong><u>Modeling:</u>\n<br>\n</strong>\n<br>\nYou will develop and enhance models used in a variety of contexts within the product management structure of Plymouth Rock by utilizing both <u>statistical methods</u> (Generalized Linear Models, Mixed Effects Models, Ridge, Lasso, etc.) and <u>machine learning</u> techniques (Gradient Boosted Trees, Random Forests, Deep Learning, etc.).. You will stay current on the latest machine learning and big data trends and be responsible for advancing the modeling capabilities within Plymouth Rock and transferring those advancements to other personnel.\n<br>\n<strong>&nbsp;</strong>\n<br>\n<strong><u>Implementation:</u>\n<br>\n</strong>\n<br>\nYou will facilitate the application of models developed considering the regulatory, distribution and competitive contexts within which we operate. This will include ensuring that models are well understood, the implications are appropriately assessed, implementation plans are defined, validation of results are undertaken and adjustments are made rapidly. You will work with business sponsors and IT teams to implement analytic solutions.\n<br>\n<strong>&nbsp;</strong>\n<br>\n&nbsp;The successful candidate will have the following attributes:\n<br>\n<strong>&nbsp;</strong>\n\n<ul>\n<li>An advanced degree in mathematics, machine learning, economics, statistics or a related field.</li><li>Knowledge of new and innovative modeling and statistical techniques – a relevant specialty is preferred.</li><li>Detail orientation – attention and desire to work on large data “crunching” projects.</li><li>Strong written and oral communication skills and a proven ability to communicate technical concepts to both technical and non-technical audiences.</li><li>High standards for the work products delivered.</li><li>Creative thinker with the ability to synthesize information from various sources and apply that information to concrete business problems.</li><li>Ability to influence and guide across departmental boundaries.</li><li>Flexibility and resiliency characteristic of a professional.</li><li>Ability to work with and understanding of the merits of various data structures.</li><li>Proficiency with the latest modeling software and techniques, such as <u>SAS,</u> <u>R, Python or</u> <u>Tableau</u><u>.</u></li><li>A desire -- enthusiasm -- to “change the game.”，passionate about tackling sample bias, over-fitting, variable selection, missing values, etc.</li><li>Ability to understand the need to balance predictive power, interpretability, and ease of implementation.</li></ul></div>\n<br>"}