{"job title": "Data Scientist", "company": "PNC Financial Services Group", "city state": "– Pittsburgh", "rating": "3.4", "job description": "<strong>Position Title</strong>\n<br>\nData Scientist\n<br><br>\n22-Aug-2018\n<br><br>\n<strong>Auto req ID</strong>\n<br>\n<strong>300169BR</strong>\n<br><br>\n<strong>HR Job Code</strong>\n<br>\n102218 Data Scientist\n<br><br>\n<strong>Job Profile</strong>\n\n<ul>\n<li>Performs analytical tasks on vast amounts of structured and unstructured data to extract actionable business insights.</li><li>Participates in the data gathering, data processing and data mining of large and complex datasets.</li><li>Develops algorithms using advanced mathematical and statistical techniques like machine learning to predict business outcomes and recommend optimal actions to management.</li><li>Runs analytical experiments in a methodical manner to find opportunities for product and process optimization. Assists in the presentation of business insights to management using visualization technologies and data storytelling.</li><li>May partner with Data Architects, Data Analysts, Data Engineers and Visualization Experts to develop data-driven solutions for the business.</li>\n</ul>\n\n<strong>Position City</strong>\n<br>\nPA - Pittsburgh\n<br><br>\n<strong>Line of Business</strong>\n<br>\nRisk Management\n<br><br>\n<strong>Building Location</strong>\n<br>\nPAA46 - Three PNC Plaza\n<br><br>\n<strong>Job Type</strong>\n<br>\nRegular\n<br><br>\n<strong>Total Hours Per Week</strong>\n<br>\n<strong>40</strong>\n<br><br>\n<strong>Job Status</strong>\n<br>\nFull Time\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nPNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law\n<br><br>\n<strong>Location(s)</strong>\n<br>\nOH - Cleveland, PA - Pittsburgh\n<br><br>\n<strong>Required Education and Experience</strong>\n<br><br>\nRoles at this level typically require a university / college degree, with 3+ years of relevant / direct industry experience. Certifications are often desired. In lieu of a degree, a comparable combination of education and experience (including military service) may be considered.\n<br><br>\n<strong>Job Specific Competencies</strong><br><br><strong>Data Architecture - Working Experience</strong>\n<ul>\n<li>Knowledge of and ability to design blueprints on how to integrate data resources for business processes and functional support.</li>\n</ul>\n<strong>Information Capture - Working Experience</strong>\n<ul>\n<li>Knowledge of the methods, channels and processes to obtain needed information; ability to identify, capture and document relevant business information in an auditable, organized, understandable and easily retrievable manner.</li>\n</ul>\n<strong>Modeling: Data, Process, Events, Objects - Extensive Experience</strong>\n<ul>\n<li>Knowledge of and the ability to use tools and techniques for analyzing and documenting logical relationships among data, processes or events.</li>\n</ul>\n<strong>Prototyping - Working Experience</strong>\n<ul>\n<li>Knowledge of and ability to implement prototyping disciplines, tools and techniques in evolutionary models within the target environment.</li>\n</ul>\n<strong>Query and Database Access Tools - Working Experience</strong>\n<ul>\n<li>Knowledge of and the ability to use, support and access facilities for extracting and formatting a database management system.</li>\n</ul>\n<strong>Disruptive Innovation - Working Experience</strong>\n<ul>\n<li>Knowledge of concepts, principles, and approaches of disruptive innovation; ability to adopt the knowledge into related processes and practices.</li>\n</ul>\n<strong>Machine Learning - Working Experience</strong>\n<ul>\n<li>Knowledge of principles, technologies and algorithms of machine learning; ability to develop, implement and deliver related systems, products and services.</li>\n</ul>\n<strong>Data Mining - Working Experience</strong>\n<ul>\n<li>Knowledge of tools, techniques and practices in data mining technologies used to acquire essential business information.</li>\n</ul>\n\n<strong>Core Competencies</strong><br><br><strong>Manages Risk - Working Experience</strong>\n<ul>\n<li>Assesses and effectively manages all of the risks associated with their business objectives and activities to ensure activities are in alignment with the bank's and unit's risk appetite and risk management framework.</li>\n</ul>\n<strong>Customer Focus - Extensive Experience</strong>\n<ul>\n<li>Knowledge of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions, and ability to leverage that information in creating customized customer solutions.</li>\n</ul>\n\n<strong>Position Overview</strong>\n<br><br>\nAt PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. As a Data Scientist within PNC's Enterprise Data Management organization, you will be based in <strong>Pittsburgh, PA or Cleveland, OH.</strong>\n<br><br>\nAs a Data Scientist the person will be:\n\n\n<ul>\n<li>Helping the team members and the Business Segments in building Risk Models (Operational, Credit and Market) and machine learning models from development through testing and deployment of millions of customers</li>\n<li>Connecting to external data sources and APIs to discover interesting trends</li>\n<li>Designing rich data visualizations to communicate complex ideas to customers or company leaders</li>\n<li>Researching and recommending latest technologies on the fields of data science and financial services analytics</li>\n<li>Competency with Machine Learning and prediction algorithms using open source tools, such as Python or R, as well as Big Data analytics tools, such as Hadoop, Spark, to conduct analyses.</li>\n<li>Writing programs to clean, prepare and analyze large, messy structured and unstructured data sets.</li>\n</ul>"}