{"job title": "Senior Manager, Data Science", "company": "Porch", "city state": "– Seattle", "rating": "4.3", "job description": "<div><div>\nBack to all current positions</div>\n\n<br><div> Senior Manager, Data Science</div> <div> Location: <strong>Seattle</strong></div> <div> Department: <strong>Engineering</strong></div> <div><div> Description</div> <div> At Porch, we are reinventing the way homeowners connect with professionals to get work done on their home. Are you passionate about building data-driven products? Do you enjoy leading teams to solve challenging puzzles? If so, join our team.\n<br><br>\nWe understand that the first step to a successful home project and a happy homeowner starts with finding the right pro. Our Data Science team is at the center of the matching process and as the leader of that team you will focus on integrating real-time predictive models with our products to ensure that homeowners are connected with the most qualified contractors in order to maximize long-term value for the customer and Porch. You will lead a team of data scientists, analysts, and engineers to build scalable solutions to complex problems across the organization. You will play the driving role to bring together engineering, business, data science, and analytics to go after the biggest opportunities to impact revenue, customer happiness, and operational scalability. If you are highly analytical, enjoy working on teams, and have a strong intellectual curiosity to solve customer problems, the Data Science team at Porch just might be the place for you.\n<br><br>\nThe right candidate will possess strong communication skills and a demonstrated ability to identify new opportunities and drive solutions forward. You should have extensive experience with data mining, statistical modeling, and machine learning techniques and an interest in leading a technical team in a hands-on capacity.\n<br>\n\n<br>\nResponsibilities:\n\n\n<ul>\n<li>Prioritize work across your team to support broader business initiatives</li>\n\n<li>Establish roadmap to improve scalability of data pipelines and modeling infrastructure</li>\n\n<li>Collaborate with product teams to deliver solutions that enhance the customer experience and improve efficiency of user acquisition</li>\n\n<li>Optimize matching systems that connect homeowners and professionals</li>\n\n<li>Own pro-search algorithms and natural language processing classifiers</li>\n\n<li>Provide hands-on technical guidance to data scientists and analysts to encourage technical growth and ensure proper application of standard methodologies</li>\n\n<li>Responsible for the performance of data science products with a keen understanding of the levers to provide increased value</li>\n</ul>\n\nPreferred Qualifications:\n\n\n<ul>\n<li>Master's degree or Ph.D. in statistics, econometrics, physics, mathematics, or similarly quantitative field</li>\n\n<li>6+ years of work experience in data analysis, applied statistics, machine learning, or econometrics</li>\n\n<li>2+ years leading teams of 5 or more</li>\n\n<li>Strong technical background, experience working with scalable data systems</li>\n\n<li>Proficiency with SQL and at least one scripting language (R, Python, etc.)</li>\n\n<li>Hands-on experience with a broad range of modeling techniques</li>\n\n<li>Track record of focusing on the right results and delivering against critical goals</li>\n\n<li>Shown experience working in Scrum teams to define, build, and ship products</li>\n\n<li>Proven ability to move fast in an entrepreneurial environment</li>\n</ul>\n\nAbout Porch\n<br>\n\n<br>\nPorch sprang to life to take on an age-old, recurring problem; with a vision to connect homeowners with the highest quality home improvement professionals, and realize the potential of every home. Porch delivers high quality project requests to professionals which make up the $300 billion home improvement market. Porch’s mission is to ensure every home project gets done right, and every customer has a great experience. We aim to build a lasting brand that delivers a simple solution with delightful results.\n<br><br>\nPorch was founded by a successful duo of entrepreneurs and is fueled by our experienced leaders and their team of techies who build beautiful products, have passionate customer focus, and put team before self. Based in Seattle, Porch is backed by Valor Equity Partners, Lowe’s Home Improvement, and celebrity handyman, Ty Pennington.</div>\n</div><div></div><br>\n<strong></strong><div><strong>\n</strong><div><strong> \n<div>Previous Applicants:</div>\n<br>\n</strong>\n<br>\n<strong><div>Email:</div>\n<br>\n</strong>\n<br>\n<div><strong>Password:</strong></div><div>\nIf you do not remember your password click here.</div>\n</div> </div></div>"}