{"job title": "F117 Logistics Program Management Senior Data Analyst", "company": "Pratt &amp; Whitney", "city state": "– East Hartford, CT", "rating": "3.6", "job description": "<strong>Businesses</strong> PRATT &amp; WHITNEY <strong>Job ID</strong> 75139BR <strong>Date posted</strong> 10/19/2018 <strong>City</strong> East Hartford <strong>State</strong> Connecticut <strong>Country</strong> US\n<br><br>\nThe Pratt and Whitney F117 Logistics Program Management (LPM) organization has an open position for a Senior Data Analyst to support our Technical, Materials, Operations, Forecasting and Controls and Accessories Repair teams. Over the last 20 years of the F117 program, significant transactional data has been captured in SAP, Operational Data Bases, and standalone Access Data Bases. This position will be responsible for providing data analysis support to the F117 LPM team using information captured in these systems. A key component of this position is to provide coaching and mentoring to all members of the team to increase the overall proficiency and understanding of accessing and using data from sources listed in the Experience / Qualification section. For projects with impact across P&amp;W, the selected candidate will coordinate with the IT Organization to obtain funding and manage the projects.\n<br><br>\nCurrent and planned projects that this position will be working on are:\n\n<li> Controls and Accessories Repair Management</li>\n<li> Scrap and Repair Data Analysis and Decision Making</li>\n<li> F77 Part Requirements Management</li>\n<li> F117 Materials Item Manager Analysis Tools</li>\n<li> Request for Sales Credit IT Project\n<br><br>\n<strong>Qualification:</strong>  Required:</li>\n\n\n\n<li> Bachelors degreed candidates must have 7+ years of experience in developing and deploying business intelligence tools related to operations, supply chain, and/or aftermarket; Masters degreed candidates must have 5+ years of the same experience</li>\n<li>5+ years with Business Objects, MS Access and Excel, Oracle, and/or Business Warehouse.</li>\n<li>5+ years experience with of SAP master data and SAP ODM Tables\n<br><br>\n<strong>Preferred:</strong></li><strong>\n\n</strong>\n\n<li> Strong customer relationship, communication, and teamwork skills a must.</li>\n<li> Coaching and mentoring skills to increase the knowledge and skill level of the F117 Logistics Program Management organization.\n<br>\n<strong>Education:</strong>  Required: BA/BS degree\n<br>\nPreferred: A degree in computer science, management information systems, industrial engineering, or related field; MA/MS deree\n<br><br>\n<strong>PWRSR</strong>\n<br><br>\nUnited Technologies Corporation is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.</li>"}