{"job title": "Data Scientist - Operations Research Scientist", "company": "Praxair", "city state": "– New York-Tonawanda", "rating": "3.5", "job description": "<div>Praxair, Inc. is a leading industrial gas company in North and South America and one of the largest worldwide. With market capitalization of approximately $40 billion and 2017 sales of $11 billion, the company employs over 26,000 people globally and has been named to the Dow Jones World Sustainability Index for 15 consecutive years. Praxair produces, sells and distributes atmospheric, process and specialty gases, and high-performance surface coatings.</div>\n<div> </div>\n<div>Our products, services and technologies are making our planet more productive by brining efficiency and environmental benefits to a wide variety of industries, including aerospace, chemicals, food and beverage, electronics, energy, healthcare, manufacturing, primary metals and many others.</div>\n<div> </div>\n<div><b><u>POSITION QUALIFICATION SUMMARY:</u></b><br>The Data Scientist/Operations Research Scientist will be a member of the Business and Supply Chain Optimization team and a member of Praxair Digital organization. In this role, they will apply advanced analytics, machine learning and operations research techniques to solve challenging business problems. The project portfolio will impact all aspects of Praxair's business. Project opportunities will include but are not limited to data visualization, data management, advanced analytics, predictive modeling and supply chain/logistics optimization. The candidate will be asked to combine an understanding of business problems with data based decision making to significantly impact operating profit. </div>\n<div> </div>\n<div>The professional will be involved in the development of analytics applications from proposal through commercialization, and be expected to work closely with the Operations and Business Organizations. As a result, he/she will need to develop credible business cases for new applications, actively participate in the technical development, and lead multi-disciplinary project execution teams. He/She will also be expected to stay abreast of new technology developments in their field of expertise, and actively contribute ideas for new programs.</div>\n<div> </div>\n<div><b><u>KEY ACCOUNTABILITIES:</u></b></div>\n<ul>\n<li>\n<div>Involved in technology development from concept initiation through commercialization, and be expected to work closely with the business units. </div></li>\n<li>\n<div>Actively participate in the technical development, and lead the project execution which, in some cases, will involve multidisciplinary teams. </div></li>\n<li>\n<div>Stay abreast of new technology developments in their field of expertise, and actively contribute ideas for new programs.</div></li>\n<li>\n<div>Support new application development as well as maintaining and improving existing applications.</div></li></ul>\n<p><strong><u>(SALARY AND JOB LEVEL COMMENSURATE WITH EXPERIENCE)</u></strong></p>\n<div><b><u></u></b> </div>\n<div><b><u>BASIC QUALIFICATIONS:</u></b></div>\n<ul>\n<li>\n<div>MS or higher in Engineering or Operations Research with a graduate level concentration in advanced analytics, machine learning, data science and/or operations research</div></li>\n<li>\n<div>2 years industrial experience in the above areas</div></li>\n<li>\n<div>Demonstrate high levels of enthusiasm and leadership capability with the ability to champion new ideas and technology</div></li>\n<li>\n<div>Advanced knowledge of R / Python, as well as experience in platforms such as MATLAB, SPSS, or SAS.</div></li>\n<li>\n<div>Excellent verbal and written communication skills</div></li>\n<li>\n<div>Ability to travel up to 25&gt; </div></li>\n<li>\n<div>Must be able to interface with internal business partners, external vendors and customers from a variety of cultures and business backgrounds</div></li></ul>\n<div><b><u>PREFERRED QUALIFICATIONS:</u></b></div>\n<ul>\n<li>\n<div>5 years of relevant industry experience</div></li>\n<li>\n<div>A PhD with a concentration in analytics, machine learning, data science and/or operations research</div></li>\n<li>\n<div>Knowledge and understanding of the industrial gases industry</div></li>\n<li>\n<div>Advanced IT skills and experience in application development and database management, as well as familiarity with agile development practices</div></li>\n<li>\n<div>Experience in developing applications in BI platforms (Tableau, Power BI etc.)</div></li></ul>"}