{"job title": "Data Scientist", "company": "Premex Inc.", "city state": "– Durham, North Carolina", "rating": "3.3", "job description": "Data Scientist\n<br><br>\nWe are currently seeking an experienced Data Scientist to join our team in Durham, NC 27703\n<br><br>\n<strong>About the Role:</strong>\n<br>\nWe are an analytical and biostatistical services company aimed to animal and human nutrition industries, as well as to the agricultural sector producers and their supply chain and customers. Our main goal is to add value at these industries´ data collection management processes by using cutting-edge statistical and computer techniques. These techniques allow us to discover hidden knowledge in your data supporting substantial improvements in decision-making.\n<br>\nOur products enable our customers to find specific relationships between variables that affect their activity. From this knowledge, the entrepreneur gets a privileged position to make decisions on matters that affect the business production and profitability.\n<br><br>\nAdditionally, data consolidation of companies from different geographies and production techniques add to our products a highly relevant analytical potential that is not easy to get working independently.\n<br><br>\n<strong>What You'll Do:</strong>\n\n\n<ul>\n<li>Selecting and integrating any Big Data tools and frameworks required to provide requested capabilities</li>\n<li>Implementing ETL process</li>\n<li>Monitoring performance and advising any necessary infrastructure changes</li>\n<li>Defining data retention policies</li>\n<li>Participate in the development of data bases in important projects that are assigned by the Director</li>\n<li>Provide ideas of applied solutions to a market need given</li>\n<li>Make technical decisions on data analysis</li>\n<li>This position works with our Intelligent Nutrition team, Asimetrix team and D &amp; I members</li>\n<li>Collaborates with Universities, suppliers and associations</li>\n</ul>\n\n<strong>Our Ideal Candidate:</strong>\n\n\n<ul>\n<li>Bachelors degree in Computer Science, Statistics, Informatics, Information Systems or another quantitative field</li>\n<li>1-2 years of related experience</li>\n<li>Experience with integration of data from multiple sources</li>\n<li>SQL experience a plus but not required</li>\n<li>Experience with object-oriented/object function scripting languages: Python, Java, C++, Scala, a plus</li>\n</ul>\n\n<strong>Skills and Abilities:</strong>\n\n\n<ul>\n<li>Excellent verbal and written communication skills</li>\n<li>Strong business acumen</li>\n<li>Analytical abilities</li>\n<li>Innovative and Self-motivated</li>\n</ul>\n\n<strong>What We offer:</strong>\n\n\n<ul>\n<li>Excellent Benefits</li>\n</ul>\n\n<strong>To Apply:</strong>\n<br>\nPlease submit your resume via the \"APPLY NOW\" button\n<br><br>\n<strong>Keywords:</strong>\n<br>\nSpark, NoSQL databases, such as HBase, Cassandra, MongoDB, Hadoop, Spark, Kafka, HSE, Quality, BPM, HACCP, FAMI-QS, ISO 14000, BASC, OEA,"}