{"job title": "DATA WAREHOUSE SYSTEM ANALYST-SENIOR - HEALTH EDGE", "company": "Presbyterian Healthcare Services", "city state": "– Albuquerque, NM, US", "rating": "3.5", "job description": "<strong>About Us</strong>\n<br><br>\nPresbyterian Healthcare Services is a locally owned, not-for-profit healthcare system of eight hospitals, a statewide health plan and a growing multi-specialty medical group. Founded in New Mexico in 1908, it is the state’s largest private employer with approximately 11,000 employees.\n<br><br>\nPresbyterian’s story is really the story of the remarkable people who have chosen to work here. Starting with Reverend Cooper who began our journey in 1908, the hard work of thousands of physicians, employees, board members, and other volunteers brought Presbyterian from a tiny tuberculosis sanatorium to a statewide healthcare system, serving more than 700,000 New Mexicans.\n<br><br>\nWe are part of New Mexico’s history – and committed to its future. That is why we will continue to work just as hard and care just as deeply to serve New Mexico for years to come.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nType of Opportunity: Full Time\n<br><br>\nFTE: 1.000000\n<br><br>\nExempt: Yes\n<br><br>\nWork Schedule: Days\n<br><br>\nLocation: Rev Hugh Cooper Admin Center\n<br><br>\n<strong>Requirements:</strong>\n<br>\nBachelor s degree in related technical/business area plus 4 years of IT or business experience. 6 years of additional experience can be substituted in lieu of degree\n<br><br>\n<strong>Summary:</strong>\n<br>\nUnder general direction, works in a data warehouse environment which includes data design, database architecture, metadata and repository creation. Provides direction and guidance to less experienced team members. Reviews data loaded into the data warehouse for accuracy. Responsible for the development, maintenance, and support of an enterprise data warehouse system and corresponding data marts. Troubleshoots and tunes existing data warehouse applications. Conducts research into new data warehouse applications and determines viability for adoption. Assists in establishing development standards. Evaluates existing subject areas stored in the data warehouse. Incorporates existing subject areas into an enterprise model. Creates new or enhanced components of the data warehouse.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nBenefits are effective day-one (for .45 FTE and above) and include:\n<ul>\n\n<li>Competitive salaries</li>\n<li>Full medical, dental and vision insurance</li>\n<li>Flexible spending accounts (FSAs)</li>\n<li>Free wellness programs</li>\n<li>Paid time off (PTO)</li>\n<li>Retirement plans, including matching employer contributions</li>\n<li>Continuing education and career development opportunities</li>\n<li>Life insurance and short/long term disability programs</li>\n\n</ul>\n<strong>About New Mexico</strong>\n<br><br>\nNew Mexico’s unique blend of Spanish, Mexican and Native American influences contribute to a culturally rich lifestyle. Add in Albuquerque’s International Balloon Fiesta, Los Alamos’ nuclear scientists, Roswell’s visitors from outer space, and\n<br><br>\nSanta Fe’s artists, and you get an eclectic mix of people, places and experiences that make this state great.\n<br><br>\nCities in New Mexico are continually ranked among the nation’s best places to work and live by Forbes magazine, Kiplinger’s Personal Finance, and other corporate and government relocation managers like Worldwide ERC.\n<br><br>\nNew Mexico offers endless recreational opportunities to explore, and enjoy an active lifestyle. Venture off the beaten path, challenge your body in the elements, or open yourself up to the expansive sky. From hiking, golfing and biking to skiing, snowboarding and boating, it’s all available among our beautiful wonders of the west.\n<br><br>\nAA/EOE/VET/DISABLED. PHS is a drug-free and tobacco-free employer with smoke free campuses."}