{"job title": "APPLICATION PROGRAMMER INTERMEDIATE - IT ENTERPRISE DATA WAREHOSE", "company": "Presbyterian Healthcare Services", "city state": "– Albuquerque, NM, US", "rating": "3.5", "job description": "<strong>About Us</strong><br><br>Presbyterian Healthcare Services is a locally owned, not-for-profit healthcare system of eight hospitals, a statewide health plan and a growing multi-specialty medical group. Founded in New Mexico in 1908, it is the state’s largest private employer with approximately 11,000 employees.\n<br><br>\nPresbyterian’s story is really the story of the remarkable people who have chosen to work here. Starting with Reverend Cooper who began our journey in 1908, the hard work of thousands of physicians, employees, board members, and other volunteers brought Presbyterian from a tiny tuberculosis sanatorium to a statewide healthcare system, serving more than 700,000 New Mexicans.\n<br><br>\nWe are part of New Mexico’s history – and committed to its future. That is why we will continue to work just as hard and care just as deeply to serve New Mexico for years to come.\n<br><br>\nType of Opportunity: Full Time Exempt\n<br><br>\nWork Schedule: Weekday Schedule Monday-Friday\n<br><br>\nShift: 1\n<br><br>\nLocation: Albuquerque, NM: Rev Hugh Cooper Center\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nBachelor’s degree in related technical/business area plus 2 years of IT or business experience. 6 years of additional experience can be substituted in lieu of degree. Detailed understanding of Computer Science principals, programming languages/tools, debugging/troubleshooting techniques and Computer Operations. Detailed capability to analyze information, determine software design requirements and then design, develop, test/debug and implement software components. Detailed capability to document software design as well as run time/operations instructions and recovery/restart procedures.\n<br><br>\n<strong>Preferred Requirements:</strong>\n<br><br>\nThis position is focused on ETL Development for the Enterprise Data Warehouse.\n<br><br>\n· Dimensional Data Modeling and related physical database design\n<br><br>\n· Extract, Transform and Load program design\n<br><br>\n· Extract, Transform and Load program development using various software tools\n<br><br>\n· On-going production support\n<br><br>\nA working knowledge of Oracle Warehouse Builder, Oracle Data Integrator and/or PL/SQL, as well as Dimensional Modeling, is needed. The primary DBMS technology used in the EDW environment is an Oracle 11g DBMS, but we draw/extract data from other Oracle, SQL Server and text based files.\n<br><br>\n<strong>Summary:</strong>\n<br><br>\nUnder general supervision, modifies moderately complex applications programs from detailed specifications. Codes, tests, debugs, documents, and maintains those programs. Competent to work on most phases of applications programming activities, but requires instruction and guidance in phases.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nProvides basic support for definition/refinement of business requirements and for quality assurance/acceptance testing efforts\n<br><br>\nDesigns, develops, tests and debugs software components of low complexity\n<br><br>\nProvides implementation, production and upgrade support for software components of low complexity\n<br><br>\nDevelops both internal IT and user documentation\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nBenefits are day-one effective, and include:\n<br><br>\n· Competitive salaries\n<br><br>\n· Full medical, dental and vision insurance\n<br><br>\n· Flexible spending accounts (FSAs)\n<br><br>\n· Free wellness programs\n<br><br>\n· Paid time off (PTO)\n<br><br>\n· Retirement plans, including matching employer contributions\n<br><br>\n· Continuing education and career development opportunities\n<br><br>\n· Life insurance and short/long term disability programs\n<br><br>\n<strong>About New Mexico</strong>\n<br><br>\nNew Mexico’s unique blend of Spanish, Mexican and Native American influences contribute to a culturally rich lifestyle. Add in Albuquerque’s International Balloon Fiesta, Los Alamos’ nuclear scientists, Roswell’s visitors from outer space, and Santa Fe’s artists, and you get an eclectic mix of people, places and experiences that make this state great.\n<br><br>\nCities in New Mexico are continually ranked among the nation’s best places to work and live by Forbes magazine, Kiplinger’s Personal Finance, and other corporate and government relocation managers like Worldwide ERC.\n<br><br>\nNew Mexico offers endless recreational opportunities to explore, and enjoy an active lifestyle. Venture off the beaten path, challenge your body in the elements, or open yourself up to the expansive sky. From hiking, golfing and biking to skiing, snowboarding and boating, it’s all available among our beautiful wonders of the west.\n<br><br>\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, national origin, sexual orientation, gender identity, marital status, disability, protected veteran status, or any other characteristic protected by law. Presbyterian Healthcare Services is a drug-free and tobacco-free employer with smoke free campuses."}