{"job title": "Machine Learning Engineer", "company": "price.com", "city state": "– San Francisco, CA, US", "rating": "NA", "job description": "<div>\nJob Description</div><br>\n<div>\nWe are looking for an experienced machine learning engineer to join us at Price.com to help us build the most comprehensive that allows you to seamlessly shop across all marketplaces</div><br>\n<strong></strong><div><strong>\nQualifications</strong>:</div>\n\n<br>\n\n<ul>\n\n<li>\nShould have a degree in quant heavy disciplines like Statistics, Engineering, Mathematics etc</li>\n<li>\nShould possess critical thinking abilities</li>\n<li>\nHands on experience with handling large scale text data</li>\n<li>\nKnowledge of word embedding concepts like word2vec and TF-IDF</li>\n<li>\n2-3 years experience with text classification and clustering algorithms like Naïve Bayes, SVM, k-means, kNN, Random Forests, xgboost and their implementation in R/Python</li>\n<li>\nExperience with statistical concepts like Hypothesis tests, probability distributions and statistical tests like ANOVA, F-statistic, Tuckey test etc</li>\n<li>\nKnowledge of supervised and unsupervised machine learning algorithms like Random Forests, Naïve Bayes, SVM, k-means, Neural Networks etc.</li>\n<li>\nKnowledge of model validation methods like accuracy, precision, recall, F-score, AUC etc.</li>\n<li>\nShould be fluent in either Python or R. Hands-on experience with Python libraries like scikit-learn, numpy, scipy and pandas</li>\n<li>\nExperience working on AWS machines</li>\n<li>\nExperience with deploying neural network models on text data using tensorflow, keras etc.</li>\n<li>\nKnowledge of deploying a model using pickling and deploying a web app via Django/Flask would be a plus</li>\n</ul>\n\n<div><strong>Responsibilities:</strong></div><ul>\n<li>\nPrototype, validate and deploy machine learning/predictive models. Integrate some of the modules with Price.com product to make it more comprehensive</li>\n<li>\nOwn, manage and use the data coming from various products/channels at Price.com</li>\n<li>\nIdeate the business problems which can be solved through available data. Devise an analytics plan and implement them to solve those problems</li>\n<li>\nReport to product managers/leads</li>\n<li>\nLiaise and work in unison with Data Engineering and Product teams</li>\n</ul>"}