{"job title": "Distinguished Data Scientist", "company": "Priceline.com", "city state": "– Norwalk, CT", "rating": "3.4", "job description": "We're excited that you are interested in a career with us. For all <strong>current employees</strong>, please use the internal portal to find jobs and apply.\n<br><br>\nExternal candidates are required to have an account before applying. When you click Apply, returning candidates can log in or new candidates can quickly create an account to save/view applications.\n<br><br>\nThe Priceline Technology Team is seeking a Distinguished Level Scientist to join our team.\n<br><br>\nAs a Distinguished Data Scientist, you will provide data science and machine learning leadership to guide our technology direction and product vision and achieve tactical and strategic business objectives. Additionally, you will be a mentor to our other data science team members who will be looking up to you for technical and thought leadership.\n<br><br>\nYou will be a key member of the Data Services team, reporting to VP of Data Services. You will not only be expected to develop models; but come up with what questions need to be asked and problems need to be resolved. This requires a very deep knowledge of data science models and machine learning algorithms and implementations.\n<br><br>\nWe don’t just want someone who exudes enthusiasm and is totally personable, but who can extract patterns and generate hypotheses from large and discrete data sets to drive our analytic efforts. A knowledge of hospitality business will be immensely helpful; but not a constraint for you with all the technical acumen. You can report to either our Norwalk, CT headquarters or our Manhattan office.\n<br><br>\nYou Must Have:\n<br><br>\nPassion for innovation and excellence in data science and machine learning area\n<br><br>\nAdvanced degree in Statistics or related quantitative discipline\n<br><br>\n10+ years experience in statistical methodology, multivariate analysis, statistical modeling, data mining, text mining and other analytics\n<br><br>\n5+ years in various models and techniques in machine learning\n<br><br>\nAbility to explain the outcomes of the models in plain English\n<br><br>\nStrong experience automating and scheduling the complete model development process\n<br><br>\nExperience with data flows at extremely high volumes (Petabyte scale)\n<br><br>\nStrong command over Python or R; preferably both.\n<br><br>\nStrong SQL and scripting skills\n<br><br>\nGood understanding of back-end software engineering concepts\n<br><br>\nExperience with the most common NoSQL data stores\n<br><br>\nLeading by example, provide direction"}