{"job title": "Senior Data Scientist -- NYC", "company": "Primer Ai", "city state": "– New York City", "rating": "4.3", "job description": "<div><div>The <strong>Senior Data Scientis</strong>t roles on the Solutions Architecture team will work with executives and leadership at customer organizations to understand their challenges and identify opportunities for Primer’s suite of technologies to support their needs. You will utilize your machine learning expertise to define, prototype, deploy, and maintain NLP/NLG solutions at Primer.</div> <br>\n<div>Your goal – to build the machines that can tell stories to anyone in the world. This role will be focus on working with Financial Services customers and bringing NLP/NLG to the banking industry with a variety of applications.</div><br>\n<div><strong>The organization: Solutions Architecture</strong></div><div>Primer is an artificial intelligence company that organizes and analyzes text-based data sources, and generates analyst-grade natural language summaries for a variety of industries. Our objective is to help our customers understand the world around them ‐‐ whether it is emerging geopolitical events, development of a product line or area of research, or monitoring a portfolio of companies’ financial performances.</div><br>\n<div>The Solutions Architecture team is a jack-of-all-trades organization that serves as the interface between the customers and the company. Our charter is: (1) scope and deploy Primer’s suite of NLP/NLG solutions to our customers; (2) prototype new technologies and concepts to meet the needs of the customer; (3) maintain our current customer relationships and seek opportunities to improve customer usage and satisfaction; and (4) channel customer feedback and usage patterns back to Primer to drive future product development.</div>\n</div><div><div>Responsibilities\n\n<ul>\n\n\n<ul>\n<li>Support the ideation and implementation of solutions and feature sets for the customers, partner with Primer’s product and engineering organizations to create and deliver.</li><li>Act as a full-stack everything: data scientist, engineer, and customer liaison for Primer.</li> <li>Partner with product and engineers at Primer to identify and prioritize new feature and algorithmic development based on customer engagement and feedback.</li><li>Build ways to analyze and understand customer engagement and product performance through modeling and data visualization.</li></ul>\n</ul>\n\n</div>\n</div><div><div>Requirements\n\n<ul>\n\n\n<ul>\n<li>M.Sc. or Ph.D. in computer science, engineering, statistics, computational linguistics, or other quantitative field.</li><li>3+ years of professional experience in the areas of developing and deploying machine learning and NLP-based solutions.</li><li>Hands-on experience with machine learning and NLP tools and libraries including Numpy, Scipy, Scikit-learn, SpaCy, NLTK, Tensorflow, Keras.</li><li>Proven experience working with a variety of data sets, framing customer problems and use cases, building data science models, and analyzing product usage.</li><li>Understanding of NLP topics: event and topic detection, relation, and extraction; pattern detection; entity recognition; semantic role labeling; and clustering and classification models.</li><li>Ability to think about solutions from a customer perspective, establish conceptual connections between requirements and solutions.</li><li>Experience working with AWS, the Elastic stack, and Docker.</li><li>Excellent communication skills – you will be the face of Primer to customers’ organizations.</li></ul>\n</ul>\n\n</div>\n</div><div><div>What We Offer\n\n<ul>\n\n\n<ul>\n<li>Collaborative environment with abundant cross-team interactions and learning</li><li>Opportunity to tackle previously unsolved problems in Natural Language Processing, Natural Language Generation, and other fields</li><li>Exposure to very interesting data (e.g. news, scientific publications, financial documents, communications and other long form content)</li><li>Products motivated directly by current clients with analysts in high-impact roles</li><li>The satisfaction of taking products and new features through from their initial genesis to incorporation in a deployed product</li><li>Rapidly growing company, with opportunities for growth into either further technical leadership or team management positions</li><li>Fun, puzzle-loving office in the SF Financial District</li></ul>\n</ul>\n\n</div>\n</div>"}