{"job title": "Data Analyst", "company": "Princeton Information Ltd", "city state": "– Purchase, NY", "rating": "3.7", "job description": "Job Description: Job Description Summary<br>\" Work closely with Client Products &amp; Innovation team around the world to architect, develop, and maintain advanced reporting and data visualization capabilities on large volumes of data in order to support Core analytics and reporting needs of various products, markets and services.<br>\" Work with cross functional teams (Products, Finance, Operations and Technologies) in the pursuit of building best in class analytical infrastructure<br>\" Effectively use tools to manipulate large-scale databases, synthesizing data insights<br>\" Use knowledge of the application of business intelligence tools to provide hands-on support for information product development and custom analytical project delivery that satisfies and retains a global client base.<br>\" Translate business requirements into tangible solution specifications and high quality, on time deliverables<br>\" Create repeatable processes to support development of modeling and reporting<br>\" Apply quality control, data validation, and cleansing processes to new and existing data sources<br>\" Support User Acceptance Testing for production applications; comply with all Client internal policies and external regulations<br><br><br>Experience in data mining, data analytics, data reporting,<br><br>\"Financial Institution or a Payments experience a plus<br>\"Experience translating business challenges into technical solutions<br>\"Experience in implementing (hands-on) technical solutions using statistical and data tools<br>\"SQL coding (can code and willing to code)<br>\"Experience with data visualization tools such as Tableau, Domo, PowerBI a plus<div> <p><strong>Princeton Information</strong> is one of the nation's top five privately-held IT consulting firms, in business since 1985. Princeton Information services a clientele of primarily Fortune 500 companies nationwide. With annual revenues over $120 million, Princeton Information operates across the US from multiple regional offices.</p><p><strong>Our Commitment to Our Consultants</strong></p><p>As a privately held company, Princeton Information is solely committed to the success of clients and consultants - not to any shareholders. PI's success is grounded in the relationships we build with our consultants. We seek the best people; provide career path counseling; as well as the most challenging opportunities in business and in IT. As part of its culture of loyalty and commitment to its consultants, Princeton Information is committed to doing all we can to ensure our consultants have the best possible search, placement and work experience possible. </p><p><strong>Our Services</strong></p><p>Working with one Princeton Recruiter will gain you access to over 500 open requirements with the top clients in the US across all industries (finance, insurance, pharmaceutical, commercial, telecom, media, manufacturing) nationwide. Our local recruiters have in-depth knowledge of our clients and opportunities. They will work with you to find you the best possible opportunities for you and your career.</p><p><strong>Our Relationships</strong></p><p>Our relationships with our clients, as well as our consultants, are critical to our success! We have a robust sales organization that ensures that Princeton has the inside track on what attributes a person needs in order to be successfully placed and engaged at our clients. We know the technical and non-technical skills that our clients are looking for and we ensure that you are educated about the client prior to your interview with them. Princeton is committed to going above and beyond to ensure that each meeting you have with a client is a successful one! </p></div> - provided by Dice<br><br>(DATA ANALYST OR DATA ANALYSIS OR ANALYSIS OR ANALYSIS ) AND(SQL ) AND (CODING ) AND (REPORT OR REPORTING ) AND(DATA MINING OR DATA ANALYTICS ) AND(BANK OR BANKING OR FINANCE OR FINANCIAL )"}