{"job title": "Data Scientist", "company": "Procter &amp; Gamble", "city state": "– Cincinnati", "rating": "4.0", "job description": "Do you enjoy design research and analytic frameworks? How would you like to turn on your creative genius and problem-solving alongside business leadership? If this sounds like fun, we are looking for someone with your skills and abilities.\n<br><br>\nAs a Data Scientist, you'll be using Big Data and advanced analytics to direct the engagement of our business leaders. You will be collaborating actively across functional partners and senior management to accomplish various project objectives. We need someone who can execute research and analytics, including data source identification, processing, model/algorithm development. Ultimately you will be turning insights into actionable recommendations which will drive business value creation.\n<br><br>\nWe need someone who is technically capable as a Data Scientist. You will get your hands dirty in the data, demonstrating artificial intelligence and analytic tools (R, Python, Scala, Spark, TensorFlow, Hadoop, KNIME, etc.) to unlock business building insights in our mountains of data. You will need to be adept at demonstrating such technologies for solving ad hoc business problems, innovating on potential future solutions, and working with technology partners to translate your innovations into robust, scaled, analytic solutions.\n<br><br>\nAt P&amp;G, Data Scientists are Business Leaders, an effective communicator, self-motivated, and able to drive insights into actions that improve P&amp;G’s business results. Your Business knowledge, interpersonal/communication skills are therefore a must to thrive in a multi- functional leadership team.\n<br><br>\nWe desire someone who is passionate about analytics. Your analytic skills are the foundation of this role. The ability to mine terabytes of data, derive actionable insights, and then translate those insights into business improving action is essential in our work. You will need to be the primary evangelist to the business for the power of predictive analysis and develop business cases to illustrate the potential for change in decision-making that occurs when you begin to anticipate what will happen, versus just reflecting on what has occurred.\n<br><br>\nWHAT ARE OUR QUALIFICATIONS?\n<br><br>\nAre you a leader who is pursuing or has graduated with a Master Degree in a quantitative field (Operation Research, Computer Science, Engineering, Applied Math, Statistics, Analytics, etc.) or have equivalent work experience?\n<br><br>\nIf you are a good fit for the Data Scientist (Masters or Experienced) position, you will have:\n<br><br>\n- Proven leadership in applying and scaling Analytic techniques to deliver actionable insights from data (in academics or in industry)\n<br><br>\n- Strong written and verbal communication skills to influence others to take action\n<br><br>\n- Demonstrated ability to handle multiple priorities\n<br><br>\n- Good social skills, self-motivated, dynamic and can-do attitude\n<br><br>\n- Strong enthusiasm and curiosity about the intersection of business and technology\n<br><br>\n- (Preferred) Experience in disrupting current business practices in CPG or related industries to help crafting a new go-to-market models.\n<br><br>\n- Preferred Experience with Analytical Tools/Applications including:\n<br><br>\n- Unix/Linux\n<br><br>\n- Big Data Ecosystem: Hadoop, Spark, MapReduce, SQL, Hiv\n<br><br>\n- Scientific Computing: R, Python, C , Java, Scala,\n<br><br>\n- High-Performance Parallel and Distributing Computing\n<br><br>\n- Deep Learning frameworks: Keras, Tensorflow\n<br><br>\n- Data Visualization\n<br><br>\n- Data Management Systems\n<br><br>\n- Business Intelligence tools: such as KNIME, Tableau\n<br><br>\nJust so you know:\n<br><br>\n- All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, disability status, age, sexual orientation, gender identity and expression, marital status, citizenship, HIV/AIDS status or any other legally protected factor.\n<br><br>\n- Applicants for U.S. based positions are generally required to be eligible to work in the U.S. without the need for current or future sponsorship. Except in rare situations based on Procter &amp; Gamble's sole discretion, Procter &amp; Gamble does not sponsor candidates for permanent residency. Any exceptions would be based on the Company's specific business needs at the time and place of recruitment as well as the particular qualifications of the individual.\n<br><br>\n- Procter &amp; Gamble participates in e-verify as required by law.\n<br><br>\nQualified individuals will not be disadvantaged based on being unemployed.<br>\n<div>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, disability status, age, sexual orientation, gender identity and expression, marital status, citizenship, HIV/AIDS status or any other legally protected factor.</div>\n<br>\n<strong></strong><br>\n\n<div>Immigration sponsorship is not available for this role. As a general matter, Procter &amp; Gamble does not sponsor candidates for nonimmigrant visas or permanent residency. However, Procter &amp; Gamble may make exceptions on a discretionary basis. Any exceptions would be based on the Company's specific business needs at the time and place of recruitment as well as the particular qualifications of the individual.</div>\n<br>\n<strong></strong><br>\n\n<div>Procter &amp; Gamble participates in e-verify as required by law.</div> \n<br>\n<div>Qualified individuals will not be disadvantaged based on being unemployed.</div>\n<br>"}