{"job title": "Data Scientist", "company": "ProEnlist", "city state": "– Tempe, AZ", "rating": "NA", "job description": "<div><strong>Job description:</strong></div><div>According to Forbes, Data Scientist has been named the best job in America for three years running. The same article continues, DevOps Engineer is the second-best job in 2018. This position blends the best of both by providing real world application of data science disciplines to solve and automate infrastructure business objectives. Skills developed in this position cover the full spectrum including data science, analytical thinking, data visualization, communication and team work. In this role you will be implementing solutions that enable software system to recommend or automate data-driven decisions. This is a rare opportunity to work with an experienced group of professionals in the top two career fields out there.</div>\n\n<br><strong><div>Responsibilities:</div>\n<br>\n</strong>\n<br>\n<div><strong>This role will work on the Infrastructure Data Science Team to create solutions which increase stability, create clarity, and reduce the operational costs of highly visible applications and software systems for Northern Trust. These solutions require the use of Big Data tools such as Hadoop, Splunk, and ELK, as well as integration with tools such as Service-Now. In order to succeed at this role a candidate should have the ability to understand modern techniques for data analysis which include but are not limited to:</strong></div><strong>Qualifications:</strong>\n<br>\n<strong>Minimum skills:</strong>\n\n\n<ul>\n<li>5+ years of experience</li>\n<li>Predictive modeling (eg: neural networks, logistic regression, variable reduction, imputation)</li>\n<li>Statistical Analysis with R, Python, or other scripting language</li>\n<li>Linux command line (eg: Bash, AWK, Perl, Sed)</li>\n<li>Familiar with RDBMS concepts</li>\n<li>Data visualization (eg: ggplot, Python, Splunk, Tableau, Excel)</li>\n<li>Proven quick self-directed learner</li>\n<li>Good communication skills</li>\n<li>Team Player</li>\n<li>BA or BS in Math, Computer Science, Engineering, Physics, or a related field</li>\n<li>Exposure to the areas of AI, ML, and Data Science with an ability and desire to grow</li>\n</ul>\n\n<strong>Preferred Skills:</strong>\n\n\n<ul>\n<li>Machine learning libraries (eg: Tensor Flow, Keras)</li>\n<li>Hadoop (Hive, Impala, MapReduce)</li>\n<li>Cloud (AWS, Azure)</li>\n<li>IT Infrastructure Engineering exposure</li>\n<li>Regular expressions</li>\n<li>Infrastructure components (e.g. VMs, Servers, Routers, Network Switches, Accelerators, etc.)</li>\n<li>Diagnosis and Tuning experience, with Applications or Infrastructure Components</li>\n<li>Predictive modeling (eg: Bayesian inference, time series forecasting, signal detection, queuing optimization, clustering, survival analysis)</li>\n<li>Splunk Machine Learning Toolkit, Data visualization in Splunk</li>\n<li>Ability to code in an Object Oriented Language such as Java or C++</li>\n<li>Data transformation and Conformal Mapping/Decomposition</li>\n</ul>"}