{"job title": "Marketing Data Scientist", "company": "Profiles", "city state": "– Fairfax, VA", "rating": "4.2", "job description": "<div><div>A global consulting firm headquartered in<strong> Vienna, VA</strong>&nbsp;is expanding their data team and looking for a Marketing Data Scientist&nbsp;to help develop best-in-class strategies and recommendations for their&nbsp;clients.\n<br><br>\nThe Marketing Data Scientist will&nbsp;perform a wide variety of data-driven tasks to uncover actionable insights&nbsp;including&nbsp;segmentation, media spend, promotions, program participation data, year-on-year trends, external variables, and macroeconomic factors. The&nbsp;Marketing Data Scientist will also own the modeling and forecasting of additional key marketing metrics to develop marketing strategies and recommendations.\n<br><br>\n<strong>Marketing Data Scientist Responsibilities:</strong><br><br><u> <li>Develop statistic models to describe the relationship between any business-relevant independent and dependent variables.</li> <li>Marketing forecast development -- analyze all available existing data sets to determine which variables are more predictive of marketing awareness building and lead generation performance.</li> <li>Analyze the effectiveness of marketing campaigns and tactics such as looking at CTR, conversion rates, open rates, and participation in programs.</li> <li>Identification of opportunities for process improvement and innovative solutions to marketing analytics challenges.</li> <li>Partner&nbsp;with IT to create automated processes to ingest and cleanse data from multiple data sources, partners, and vendors.</li> <li>Work with IT to develop and maintain databases that support marketing analysis.</li>\n\n<strong>Marketing Data Scientist Requirements:&nbsp;</strong>\n<ul>\n <li>MS/BS in a technical field: Economics, Statistics, Computer Science, Engineering or related discipline.</li> <li>3+ years of experience in a combination of business intelligence / marketing analytic roles.</li> <li>Strong demonstrated quantitative and qualitative research skills using standard statistical software such as SAS, R, Stata.</li> <li>Experience with data visualization technologies, such as Tableau, a plus.</li> <li>Strong organizational skills and customer service focus.</li> <li>Experience in implementing and streamlining data processes, including marketing automation efforts plus experience with non-theoretical, \"messy\" datasets.</li> <li>Builds and maintains relationships with users to ensure buy-in and adoption of processes and solution.</li> <li>Team player with the ability to work in a fast-paced environment.</li>\n</ul>\n<strong>About Profiles</strong>\n<br><br>\nAn award-winning Marketing and Creative Technology staffing agency, Profiles places the highest caliber candidates in Fortune 500 companies and successful organizations across the country. Our experienced recruiters focus on candidates drawn from the top 20% of job seekers nationwide. Profiles professionals are available for contract, contract-to-hire, and direct hire positions. Headquartered in Baltimore, MD, Profiles has regional offices in Philadelphia, Richmond and Washington D.C.\n<br><br>\nHave you considered a contract position? Profiles offers the following benefits: competitive salary; 401(k) plan; weekly paycheck and bonus pay; health, vision and dental insurance; online software and soft skill training.\n<br><br>\nNew job opportunities are listed daily –&nbsp;<u>www.careerprofiles.com</u>.\n<br><br>\nD123D</u></div></div>"}