{"job title": "Data Scientist", "company": "Progressive Leasing", "city state": "– Draper, Utah", "rating": "4.3", "job description": "Progressive is blazing a path at the intersection of Leasing and Technology and we have an exciting new opening for a <strong>Data Scientist</strong> in our Draper, Utah office.\n<br><br>\nAs a Data Scientist, you will blend analytics, data mining, machine learning, and software engineering to build algorithms that will result in massive improvements to the way we do business. You will be responsible for developing and improving key decision systems and predictive models to drive maximum business impact. You will develop a profound understanding of our customers, business processes, products, and financials by studying the data that describe each of these elements of our business. You will be at the forefront of this rapidly evolving field and have the opportunity to develop your own tools and technologies as you do. Most importantly, youll be part of a team that forms the backbone of a fast-growing company at the forefront of an exciting, growing industry.\n<br><br>\n<strong>What You'll Do:</strong>\n<ul>\n<li>Build, maintain, and improve key decision systems and predictive models that are key to Progressive Leasings competitive advantage</li><li>Explore new data sources both internal and external to Progressive and use findings to further improve and optimize model performance</li><li>Design, implement, and read in-market experiments testing new algorithms, technologies, and processes to better serve our customer and stay ahead of the competition</li><li>Recommend and support strategic business changes through rigorous analytics, deep understanding of the business, and creative problem solving</li><li>Identify, evaluate, and help implement emerging advanced analytics technologies and methods</li><li>Be part of a collegial, fast-growing team of like-minded data scientists who work and play together, and who love what they do and where they do it!</li>\n</ul>\n<strong>Minimum Experience &amp; Qualifications:</strong>\n<ul>\n<li>Masters degree in a quantitative or technical field (Math, Statistics, Engineering, Economics, Physics, Computer Science, etc.)</li><li>Experience with data exploration and machine learning tools such as those found in R or Python</li><li>Demonstrated ability applying advanced statistical modeling techniques to solve problems</li><li>Ability to craft rigorous research / evaluation design approaches, based upon understanding of clients' research needs</li><li>Advanced knowledge and experience with querying languages (SQL, etc.)</li><li>Understanding of modern software development and engineering practices including scrum/agile, Git, and DevOps</li><li>Track record of achieving business results through creative problem solving and careful implementation</li>\n</ul>\n<strong>Compensation, Perks &amp; Benefits:</strong>\n<ul>\n<li><div>Competitive Compensation</div> </li><li><div>Full Health Benefits - Medical/Dental/Vision</div></li><li><div>401k, Paid Time Off and Tuition Reimbursement</div></li><li><div>Full Service Gym, Game and Lounge Area, Basketball Court</div></li><li><div>Free Healthy Snacks and Refreshments</div></li><li><div>Subsidized Public Transit</div></li><li><div>Fun and Relaxed Work Environment</div></li>\n</ul>\n\n<br><br><strong>WHO IS PROGRESSIVE LEASING?</strong>\n<br><br>\nFounded in 1999, Progressive Leasing, a wholly-owned subsidiary of Aarons Inc. [NYSE: AAN], is a steadily growing company already surpassing $1B in revenue. Our scalable customer payment software products provide lease-purchase technology solutions through 26,000+ retail locations in 45 states.\n<br><br>\n<em>Progressive Leasing does not discriminate in any aspect of employment on the basis of race, color, religion, national origin, ancestry, gender, sexual orientation, gender identity and/or expression, age, veteran status, disability, or any other characteristic protected by federal, state, or local employment discrimination laws where Progressive Leasing does business. All new hires must pass a pre-employment criminal background check and drug test.</em>"}