{"job title": "Data Scientist", "company": "Progrexion", "city state": "– Salt Lake City, Utah", "rating": "3.3", "job description": "<li>ID 2018-3054</li>\n\nPos. Category Client Service\n<br><br>\nLocation : City Salt Lake City\n<br><br>\nLocation : State/Province UT\n<br><br>\nCreated Date 8/24/2018\n<br><br>\nType Regular Full-Time\n<br><br>\nOverview\n<br><br>\nBased in Utah, Idaho, and Arizona, Progrexion leads the credit repair industry with groundbreaking technologies and services that help consumers access and understand information contained in their credit reports, verify whether that information is fair, accurate and substantiated, and correct inaccuracies with individual creditors, other data furnishers and the national credit bureaus. Progrexion technology and services are used by Lexington Law, an independently-operated law firm, and ****************, its wholly-owned subsidiary.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nThe ideal candidate is a business leader and strategist with a proven ability to solve complex business problems and drive increased revenue and customer loyalty using expertise in statistics, data acquisition and analytics. He or she will prioritize and lead cross-functional analytics projects with creativity and attention to detail. This leader will partner with other executives to evangelize and implement key data discoveries to improve our business. He or she will have strong academic credentials in mathematics or statistics, a passion for using data to solve business problems, and a proven track record in delivering business results using data science.\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Proven track record in using data management, modeling, analytics, and statistics to solve complex business problems and drive revenue and client loyalty.</li>\n<li>Advanced degree in a quantitative area (economics, statistics, mathematics) or MBA combined with a strong quantitative background.</li>\n<li>5+ years performing data analysis, with at least one year experience with a top tier business management consultancy or large, publicly traded corporation (2000+ employees).</li>\n<li>Influencer - excellent communicator, with ability to enroll and engage business partners and executives.</li>\n<li>Collaborator - work with other analytics teams and information technology to find opportunities to share research, leverage new data sources, expand analytics techniques and build data infrastructure.</li>\n<li>Experience with data environments like Hadoop, AWS, Azure.</li>\n<li>Experience with modeling/analytics tools/language like SAS, R, Knime.</li>\n<li>Proficient using SQL to obtain data for analysis.</li>\n<li>May be required to manage one or more data scientists and assist in their training and development.</li>\n</ul>\n\n<strong>#CB</strong>\n<br><br>\nNot ready to apply? Connect with us for general consideration.\n<br><br>\nSkills/Requirements\n<br><br>\nJob Reference #: 3054\n<br><br>\n<strong>Job Status:</strong>\n<br><br>\nDate Posted: 8/24/2018\n<br><br>\n<strong>Pay Rate:</strong>\n<br><br>\nRecruiter and Available Location Information\n\n\n<ul>\n<li>, Salt Lake City, UT 84101</li>\n</ul>"}