{"job title": "Data Science Internship", "company": "Project Concern International", "city state": "– San Diego, US-CA", "rating": "3.7", "job description": "This is an exciting opportunity to gain valuable work experience at an international development non-governmental organization (NGO) using your skills in data analysis and data science. PCI generates a lot of data through ongoing project monitoring, through one-off surveys during baseline/midterm/endline evaluations, or through research projects. While PCI has a robust monitoring, evaluation, learning and research (MERL) team, applying approaches and techniques from data science will be a new discipline for PCI. The primary goal of this internship will be to apply data analysis and data science methodologies across datasets to generate new analyses, predictive models and learnings for PCI. The analysis will answer questions such as: what factors are likely to predict positive or negative results within a given type of programming (such as female economic empowerment, or HIV/AIDs prevention); what demographic and socioeconomic variables are common for participants who complete and succeed in a program; and, what types of interventions are likely to lead to the most impact. The intern will work with the MERL and technical units to identify research questions and related datasets to mine, develop and test hypotheses, and document the methodologies used and results.\n<br><br>\nAdditional goals of the internship are to develop documentation and strategies around the future use of data science approaches across PCI and collaborate with the Director of Global Information and Communication Technology (ICT) on identifying opportunities for the future use of technology for data science, such as machine learning. The end result of the internship will be to deliver: 1) at least one research project; 2) documentation on what role data science, machine learning and AI can play at PCI, and what processes and infrastructure PCI needs to put in place; and 3) a presentation to the MERL team on research findings and recommendations for data science work. The intern will report to a Technical Advisor in PCI’s MERL unit.\n<br><br>\n<strong>DUTIES &amp; KEY TASKS:</strong>\n\n<ul>\n<li>Work with the technical and MERL teams to identify research topics and hypotheses to test using existing datasets</li>\n\n<li>Conduct a literature review on project documentation to familiarize yourself with PCI project and monitoring and evaluation methodologies and goals</li>\n\n<li>Develop an analysis plan to include key objectives, datasets used and proposed analytical methods for at least one research project</li>\n\n<li>Identify existing datasets and perform exchange-transform-load processes to match up the different datasets</li>\n\n<li>Mine data and test hypotheses using statistical analysis methodologies to generate insights, learnings, and predictive models that can be applied to existing and future PCI projects</li>\n\n<li>Create dashboards and other ways to visualize the results using data visualization software</li>\n\n<li>Document the process, tools and results of the analysis in a research report</li>\n\n<li>Meet with various PCI staff across technical teams to understand future data analysis and data science needs. Document a scope of work and recommendations for a future data science/scientist role at PCI</li>\n\n<li>Work with the Director of Global ICT to scope out the potential role that data warehousing, machine learning and AI can play at PCI in the future. Draft a memo describing how PCI might use these technologies within projects and across the organization</li>\n\n<li>Deliver a final presentation to the MERL team on the research project, lessons learned and recommendations</li>\n</ul>\n<br><br>\n<strong>QUALIFICATIONS:</strong>\n\n<ul>\n<li>Must be current BA or Masters student in statistics, data science or a related field</li>\n\n<li>Proven interest in biostatistics/epidemiology</li>\n\n<li>Demonstrated experience or interest in international NGOs, international aid and development or non-profit organizations</li>\n\n<li>Experience in using data analysis or data science techniques to mine datasets and test research hypotheses</li>\n\n<li>Proficiency in one or more statistical analysis software packages, such as STATA or R</li>\n\n<li>Proficiency in using data visualization tools, experience with Microsoft Power BI preferred</li>\n\n<li>Experience with data warehousing, machine learning and AI preferred</li>\n\n<li>Experience with SQL preferred</li>\n\n<li>Demonstrated ability to write and present high quality research reports</li>\n\n<li>Ability to think creatively about the use of data science in a new context</li>\n\n<li>Comfortable meeting with a variety of PCI staff, including management, and leading conversations around the future use of data science at PCI</li></ul>\n\n\n<ul>\n<li>Self-motivated and able to deliver work on time</li>\n\n<li>A passion for the mission and values of PCI</li>\n</ul>\n<strong>SCHEDULE:</strong>\n\n<ul>\n<li>We are looking for dedicated individuals willing to commit approximately 250 hours completed over up to 12 weeks, depending on university requirements and the intern’s availability</li>\n</ul>\n<br><br>\n<strong>HOW TO APPLY:</strong>\n<br><br>\nIf you feel you would be a good fit for this opportunity, please include the following:\n\n<ul>\n<li>Cover letter specifying which volunteer/intern opportunity you are interested in, why you are a good fit for the position, and start/end dates of estimated availability</li></ul>\n\n\n<ul>\n<li>Resume or CV</li>\n</ul>\nPlease apply ASAP as we will accept applicants on a rolling basis. Ideally, internships will begin by September 4, 2018.\n<br><br>\n<strong>ABOUT PCI:</strong>\n<br><br>\nFounded in 1961, PCI is an international development and humanitarian assistance organization dedicated to promoting community health and integrated development worldwide. PCI is headquartered in San Diego, CA, and currently operates in 16 countries in Asia, Africa, and the Americas. Sectoral focus areas include humanitarian assistance and disaster risk management; health and nutrition; water and sanitation; food and livelihood security; and disease prevention and mitigation. With a staff of over 800 around the world, PCI serves approximately 11.5 million people annually.<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nSan Diego, US-CA\n<br>"}