{"job title": "Data Scientist", "company": "ProKarma", "city state": "– Portland, OR", "rating": "3.5", "job description": "<strong>Description</strong>\n<br>\nProKarma is currently seeking a Data Scientist to join our team as a full-time employee in Portland, OR!\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Interviewing key project stakeholders, documenting findings and making detailed recommendations</li><li>Assess and frame the business problem, success criteria, and risks</li><li>Acquire and blend disparate data sources, which could be any format of internal structured, unstructured, external, or high volume sources</li><li>Exploratory data mining &amp; analysis</li><li>Guide clients through processes to identify meaningful predictors and then engineer representative features into the data set</li><li>Understand best practices on core set predictive use cases &amp; be familiar with model libraries</li><li>Understands CRISP-DM methodology</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Minimum 3 years of relevant data science experience</li><li>Ph.D. or Master’s Degree in operations research, applied statistics, data mining, machine learning, physics or a related quantitative discipline preferred</li><li>Experience with Hive SQL and Spark and/or Python and/or Scala</li> <li>Deep understanding of statistical and predictive modeling concepts, machine-learning approaches, clustering and classification techniques, and recommendation and optimization algorithms</li><li>Strong analytical and problem-solving skills</li><li>Excellent written and verbal communication skills</li>\n</ul>\n\nIn order to provide equal employment and advancement opportunities to all individuals, employment decisions at ProKarma are based exclusively on merit.  ProKarma does not discriminate in employment opportunities or practices on the basis of race, color, religion, sex, national origin, age, or any other characteristic protected by law.  \n<br>"}