{"job title": "JPC 3824 - Data Analyst", "company": "Prolim Global", "city state": "– Auburn Hills, MI", "rating": "3.1", "job description": "<strong>Job Description</strong>\n\n\n<ul>\n<li>Share</li>\n<li>Share</li>\n<li>Email</li>\n<li>Facebook</li>\n<li>Twitter</li>\n<li>Linkedin</li>\n<li>Print</li>\n</ul>\n\nABAP Developer\n<br><br>\nDimondale, Michigan - United States | Posted - 11/13/18\n<br><br>\nApply Apply without Registration\n<br><br>\nOverview\n<br><br>\nPROLIM Global Corporation (www.prolim.com) is currently seeking ABAP Developer for location Dimondale, MI for one of our top client.\n<br><br>\n<strong>Job Description:</strong>\n\n\n<ul>\n<li>Experienced in handling work deliverables in multi-vendor collaborative environments.</li>\n<li>Experienced in Conversion, Mapping &amp; Migration of Legacy data using conversion programs.</li>\n<li>Experienced in BAPI'S, BADI'S, USER EXITS and Enhancement point implementation (Implicit, Explicit) using Switch Framework.</li>\n<li>Experienced in SAP ERP Analysis, ABAP Design, Development and Implementation.</li>\n<li>Experience with SAP Fiori, Screen Personas, Gateway, SAPUI, OData technologies in implementing and extending standard SAP Fiori Apps.</li>\n<li>Extensive experience in ABAP Reporting includes Interactive, classical, ALV Reports and Dialog Programming.</li>\n<li>Extensive experience in BRF+ development of applications, functions, rulesets, expressions and actions.</li>\n<li>Extensive experience with BRF+ class generation and verification.</li>\n<li>Extensive experience in Performance tuning of large\\ huge data and complex program for the SQL Statements (looping, Joins, Index).</li>\n<li>Experience working with SAP through Customer Messages (OSS note searches and creating the customer message).</li>\n<li>Experience with all kinds of SAP standard native tools like Trace/New SAT etc.</li>\n<li>Extensive experience in ALE/IDOC/EDI Interfaces.</li>\n<li>Experienced in Banking Interface EDI (BOA/CITI Bank Prior day BAI/BAI2 File etc.)</li>\n<li>Experienced in designing and developing, Data Dictionary Objects, Data Elements, Domains, Structures, Views, Lock objects, Search helps.</li>\n<li>Experienced in formatting the output of SAP documents with multiple options modifying standard layout sets in SAP Scripts, Smart forms &amp; Adobe Forms.</li>\n<li>Experienced in ABAP WebDynPro development.</li>\n<li>Experience in working in Implementation, Upgrade, Maintenance and Post Production support projects.</li>\n<li>Strong experience in SAP life-cycle implementation, Maintenance and support projects in SAP R/3.0, 4.5b, 4.6B, 4.6C, 4.7, ECC6.0, IS Retail and IS Utility.</li>\n<li>Experienced in Web service implementation in SAP, XML file structure, Contivo Mapping tools &amp; Web SOAP UI.</li>\n<li>Experienced in creating and updating Technical Design Documentation.</li>\n<li>Ability to interact with all levels of the user community and project team and able to handle multiple request.</li>\n<li>Excellent Interpersonal and Communication skills. Highly self-motivated, goal-oriented individual who is committed to using and demonstrating strong analytical and problem solving skills, with the ability to follow through on projects from inception to completion.</li>\n</ul>\n\n<strong>Required Skills</strong>\n\n\n<ul>\n<li>ERP SAP R/3 3.6 C, 4.7, ECC 5.0, ECC 6.0 SAP CRM 7.0</li>\n<li>Mobility SAP Mobile Applications with SUP middleware</li>\n<li>Net Weaver Technologies Object Oriented ABAP</li>\n<li>Programming Languages ABAP/4, Dynamic ABAP, PL/SQL, C, C++</li>\n<li>RDBMS Oracle 7/8, MS Access</li>\n<li>ABAP/4 tools DDIC, Application Hierarchy, Transport Organizer, Area menu</li>\n<li>Interface tools ALE, EDI, IDOC, RFC, BAPI and SAP Workflow</li>\n<li>Tools Control M, SOAP UI, File Zilla, SOAMANAGAER, HP Magic and APSE (HCL Tool for development tracker)</li>\n<li>Ticketing Tools HPQC (HP Quality Centre)</li>\n<li>Function Module Exit, User Exit Screen exit, Menu Exit, Field exit, BADIs Dialog Programming, RF Screen development, Screen Painter, Menu Painter</li>\n<li>Data Communication Batch Input, Call Transaction, LSMW, BAPI</li>\n<li>Analysis tools ABAP debugger, Runtime analysis, SQL Trace, Code Inspector. Performance tuning of ABAP</li>\n<li>Reporting Tools - Classical &amp; Interactive Reporting, ALV Grid, SAP Scripts, ABAP Query, Smart Forms</li>\n<li>BRF+ Application, Rulesets, etc development experience</li>\n</ul>\n\nAbout PROLIM Corporation\n<br><br>\nPROLIM is a leading provider of end-to-end IT, PLM and Engineering Services and Solutions for Global 1000 companies. They understand business as much as technology, and help their customers improve their profitability and efficiency by providing high value technology consulting, staffing, and project management outsourcing services.\n<br><br>\nTheir IT and PLM consulting offerings include; Advisory, PLM Software/Services, Program Management, Solution Architecture Training/Staffing, Cloud Solutions, Servers/Networking, Infrastructure, ERP Practices and QA Services. Engineering services include Data Translation, CAD/CAM/CAE, Process &amp; Product Engineering, Prototyping, and Testing/Validation within a wide range of markets and industries."}