{"job title": "Data Analyst", "company": "Prolim Infosystems Pvt Ltd.", "city state": "– Auburn Hills, Michigan", "rating": "NA", "job description": "Overview PROLIM Global Corporation (**************) is currently seeking Data Analyst for location Auburn Hills , MI for one of our top client. Description and Project: This Data Integrator role will be more of a Data Analyst/Business Analyst. Need to have the requirement and example gathering skills of a BA as well as strong Data Mapping background. They are migrating data from the multiple CRM applications (MS Dynamics/Trio/CIS/Excel within DB2, Microsoft SQL Server technologies). They will be mapping Fields/Data from one system for migration to the Salesforce Platform. They will meet with the Business and lead discussions on these Mapping Exercises, the output will be a Technical Mapping Document (Excel) that will be shared with the Data team to execute the migration. The Data team will use tools like Workbench and SF DataLoader. The Date Integrator will review data using IBM Data Studio, Excel as well as Salesforce tools like Workbench and Salesforce Data Loader. These tools are not required but will be helpful. They have access to Informatica but a separate team does the migration process from the tool. Experience with Informatica is helpful but not necessary. They are not using Apex, lightening, or Visual Force. They will not be doing any coding. The Data Integrator will also need to be knowledgeable (Mid-Level) in SQL and/or ideally SOQL which is a Salesforce proprietary query language. Requirements: Must have a strong background as a Data Analyst. Must have strong requirement and example gathering experience. Must have strong data migration skills. Must have expert level Excel knowledge, strong MS SQL Server. They also use SQL and/or SOQL which is a Salesforce proprietary query language. Extensive experience with documentation and data mapping. Need to have a strong understanding of databases, schemas, and intermediate SQL Server skills. Need to be familiar with how to properly join tables inner join, outer join, etc. Strong knowledge of product mapping. MUST have excellent communication skills. Will be interacting with multiple teams and business partners. Will run meetings with members of the business as well as meetings with the technology side. Skype is the primary tool for meetings but in-person meetings also take place. Preferred: SalesCloud or Service Cloud knowledge/experience is helpful but not necessary. Should be familiar with the objects and fields within Salesforce environments. Experience within an Agile environment is a huge bonus but not required. Industry experience/knowledge is a huge bonus but not required. Apply online for immediate consideration, please send your updated resume and contact info via email ************************ About PROLIM Corporation PROLIM is a leading provider of end-to-end IT, PLM and Engineering Services and Solutions for Global 1000 companies. They understand business as much as technology, and help their customers improve their profitability and efficiency by providing high value technology consulting, staffing, and project management outsourcing services. Their IT and PLM consulting offerings include; Advisory, PLM Software/Services, Program Management, Solution Architecture Training/Staffing, Cloud Solutions, Servers/Networking, Infrastructure, ERP Practices and QA Services. Engineering services include Data Translation, CAD/CAM/CAE, Process &amp; Product Engineering, Prototyping, and Testing/Validation within a wide range of markets and industries."}