{"job title": "Data Scientist", "company": "Proofpoint", "city state": "– Draper, UT", "rating": "3.2", "job description": "<div><div> <div>\n<p>At Proofpoint, we have a passion for protecting people, data, and brands from today’s advanced threats and compliance risks. We hire the best people in the business to:</p>\n\n<ul>\n<li>Build and enhance our proven security platform</li>\n<li>Blend innovation and speed in a constantly evolving cloud architecture</li>\n<li>Analyze new threats and offer deep insight through data-driven intel</li>\n<li>Collaborate with customers to help solve their toughest security challenges</li>\n</ul>\n\n<p>We are singularly devoted to helping our customers protect what matters most. That’s why we’re a leader in next-generation cybersecurity—and why more than half of the Fortune 100 trust us as a security partner.</p>\n</div>\n\n<div>\n<p><strong>The Role </strong></p>\n\n<p>Do you have a passion for applying machine learning to hard problems in new application areas? Do you keep up with the latest on GANs, ResNets, CNNs, RNNs, and Deep Reinforcement Learning but have also mastered the classics like SVM and Random Forest? Are you looking for the opportunity to work with a great team that combines algorithm design, software engineering, and domain knowledge into products that are first of their kind? If so, we are looking for you. We need a Data Scientist who will work on a cross-functional team to help uncover cyber threats hidden in large amounts of data. Your primary focus will be applying your skills in various areas like NLP, graph mining, computer vision, and predictive analytics to help us build products for a variety of cyber security needs.</p>\n\n<p><strong>Your day-to-day </strong></p>\n\n<ul>\n<li>Feature engineering, building and optimizing classifiers, applying machine learning and deep learning expertise</li>\n<li>Blending data from disparate sources, mining the resulting data lake to build models</li>\n<li>Contributing tested code to the team’s git repo and working with engineering to implement models efficiently</li>\n<li>Processing, cleansing and verifying integrity of data used for analysis</li>\n<li>Conducting ad-hoc analysis and innovation around data visualization </li>\n</ul>\n\n<p><strong>What you bring to the team</strong></p>\n\n<ul>\n<li> Excellent understanding of machine learning algorithms, processes, tools and platforms including:\n\n<ul>\n <li>Supervised methods - Naïve Bayes, Logistic Regression, SVM, ConvNet, LSTM, Siamese Networks, etc.</li>\n <li>Unsupervised methods - K-means, DBSCAN, T-SNE, Spectral Clustering, SOM, LSH, etc.</li>\n <li>Toolkits - numpy, scipy, scikit-learn, tensorflow, pytorch, keras, genism, vowpal wabbit, etc.</li>\n <li>Python proficiency</li>\n</ul>\n</li>\n<li>Great communication skills, ability to explain predictive analytics to non-technical audience</li>\n<li>Proficiency in data exploration techniques and tools, e.g. SQL, Hive, etc.</li>\n<li>Excellent statistics, linear algebra, and optimization skills</li>\n<li>MS in Statistics, Machine Learning, Applied Physics or Computer Science (or technical degree with commensurate industry experience). PhD preferred</li>\n</ul>\n</div>\n\n<p><strong>Why Proofpoint</strong></p>\n\n<p>As a customer focused and driven-to-win organization with leading edge products, there are many exciting reasons to join the Proofpoint team. We believe in hiring the best the brightest and cultivating a culture of collaboration and appreciation. As we continue to grow and expand globally, we understand that hiring the right people and treating them well is key to our success! We are a multi-national company with locations in 10 countries, with each location contributing to Proofpoint’s amazing culture!</p>\n\n<p>#LI-DNP</p> </div></div><div><div> <br></div></div>"}