{"job title": "Formulation Scientist", "company": "Proteus Digital Health", "city state": "– Hayward, CA, United States", "rating": "3.3", "job description": "<strong>The Company:</strong>\n<br><br>\nProteus Digital Health® is enabling a new category of pharmaceuticals: Digital Medicines. These include widely used drugs, formulated so they communicate when they have been ingested; a wearable patch that detects medicines and captures physiologic response; mobile applications to support patient self-care and physician decision-making; and data analytics to serve the needs of health system managers. The ingestible sensor and wearable patch at the heart of digital medicines were approved by the U.S. FDA in 2012, and also have regulatory clearances in the European Union and China. The company has more than 450 issued patents that protect this enabling technology.\n<br><br>\nProteus Digital Health is privately held by investors that include Carlyle, Essex Woodlands, Kaiser Permanente®, Medtronic®, Novartis®, Otsuka, and ON Semiconductor®.\n<br><br>\n<strong>The Products:</strong>\n<br><br>\nProteus Digital Health partners with health systems across the United States to provide Proteus Discover®, a digital medicines program that measures medication treatment effectiveness and helps physicians, care teams, and patients improve clinical outcomes. Proteus Discover provides the tools and data needed for health organizations to build patient engagement, efficiency, and measurement into the delivery of care, and an opportunity to mitigate the high costs of uncontrolled diseases.\n<br><br>\nIn November 2017, the FDA granted its first approval of a fully-integrated digital medicine, Abilify MyCite®. Abilify MyCite is a drug-device combination product of Otsuka Pharmaceutical’s aripiprazole, an atypical antipsychotic, embedded with Proteus’ ingestible sensor that communicates with a wearable sensor patch, smartphone application, and the healthcare provider’s portal.\n<br><br>\n<strong> Join Us:</strong>\n<br><br>\nCome to join our unique collection of innovative scientists, engineers, market makers, designers, doctors, pharmacists, developers, clinicians, and other digital health industry pioneers, and assist us to achieve our compelling vision, “Healthcare for Everyone, Everywhere.”\n<br><br>\nLearn more about what we do (video): https://www.youtube.com/watch?v=G0LR_g0Iw48 and follow us on Twitter @ProteusDH and LinkedIn.\n<br><br>\nFurther information is available at<strong> www.proteus.com.</strong>\n<br><br>\n<strong>Primary Responsibilities:</strong>\n<ul>\n<li>Plan and oversee development studies including use of design of experiments techniques</li><li>Build and test prototypes, both hands-on and via coordination with support functions and demonstrate full knowledge of the documentation that governs these operations. (e.g. Standard Operating Procedures, Work Instructions, Batch Records, Log Books, etc.)</li><li>Troubleshoot issues during prototype production; act as first responder to all issues</li><li>Perform data analysis, determine root cause of failures, and provide recommendations to engineering staff</li><li>Create and maintain clear documentation of experiments and manufacturing process instructions</li><li>Plan and oversee execution of stability studies</li><li>Collaborate with operations, quality control, engineering, facilities and maintenance personnel to realize goals</li><li>Partner with Automation Engineering to realize scale-up goals through new equipment and process introductions</li><li>Lead process transfers and train personnel to new or revised processes</li><li>Execute equipment and process qualifications</li><li>Participate in continuous improvement projects</li><li>Record and maintain documentation in support of Quality System</li>\n</ul>\n<strong>Desired skills:</strong>\n<ul>\n<li>Hands-on experience with manual and automated production tools</li><li>Experience with pharmaceutical process equipment required (mixing, blending, rotary press, packaging and test equipment)</li><li>Knowledge of Design of Experiments (DOE), LEAN, Six Sigma, or other continuous improvement techniques preferred</li><li>Structured problem solving skills</li><li>Ability to prioritize work for self and collaborate with production team</li><li>Excellent verbal and written communication</li><li>Experience of working in a GMP clean room environment</li><li>Good understanding of the requirements within drug and device cGMPs required.</li><li>Experience conducting equipment, process, and cleaning qualifications/validations (IQ/OQ/PQ/PV)</li>\n</ul>\n<strong>Education / Qualifications:</strong>\n<ul>\n<li>Formulation Scientist\n\n<ul>\n<li>Bachelor’s or Master’s Degree in technical field (Pharmaceutics, Engineering, Materials Science) required</li><li>BS degree with 3-4 years</li><li>MS degree with 1-2 years in developing solid oral dose formulations or drug-device combination products preferred.</li></ul></li>\n<li>Familiar with computer systems (DOE, data analysis, Microsoft Office, databases, computer-aided design) preferred</li>\n</ul>\n<strong>Physical Requirements:</strong>\n<ul>\n<li>Hands-on use of engineering tools and machinery, and experience with both.</li><li>Occasional lifting and physical labor.</li><li>Complete plant/office mobility.</li>\n</ul>"}