{"job title": "Data Scientist", "company": "Providence Health &amp; Services", "city state": "– Renton, WA", "rating": "3.4", "job description": "<strong>Description:</strong>\n<br><br>\n<strong>Providence is calling a Data Scientist to Providence Health &amp; Services Portland, OR. Seattle, WA or Renton, WA may be a possibility but Portland is strongly preferre</strong> <strong>d.</strong>\n<br><br>\nWe are seeking a Data Scientist to\n<br><br>\nprovide strong analytical support for advanced analytical projects supporting\n<br><br>\nthe Providence system. This includes using creativity to solve data and\n<br><br>\nanalytical strategic and research problems. The Data Scientist will\n<br><br>\ncreate databases, conduct appropriate analyses and present data and information\n<br><br>\nin an innovative format for interpretation by organizational leaders.\n<br><br>\n<strong>In this position you will:</strong>\n\n<ul>\n<li>Use creativity to solve data and analytical problemsfor the organization.</li>\n\n<li>Visualize complex data into an easy to understandformat for interpretation by leaders across the organization.</li>\n\n<li>Create appropriate databases from data needed foranalyses, including the electronic medical record, as well as survey,patient-entered data, hospital, and health plan data.</li>\n\n<li>Use Creative ability to evaluate and assess availablerelevant data sources (both internal and publicly available data) to bringthem together for the given study/project.</li>\n\n<li>Communicate with diverse stakeholders across theorganization. Tailor findings and outputs to different stakeholder groups.</li>\n\n<li>Participate on all applicable project teams to assistin defining the necessary outcome data to collect and sources forcollecting that data.</li>\n</ul>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Required qualifications for thisposition include:</strong>\n\n<ul>\n<li>Bachelors degree in Healthcare, analytical ormathematical areas.</li>\n\n<li>3 years of experience in data analysis, advancedstatistical analysis or predictive analytics.</li>\n\n<li>Professional experience in the healthcare industry.</li>\n</ul>\n<strong>Preferred qualifications for thisposition include:</strong>\n\n<ul>\n<li>Masters degree in analytical sciences (statistics,finance, public health, epidemiology, hard/soft science).</li>\n</ul>\n<strong>About the department you will serve.</strong>\n<br><br>\nProvidence Strategic and Management Services provides a variety of functional and system support services for all eight regions of Providence Health &amp; Services from Alaska to California. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise.\n<br><br>\n<strong>We offer a full comprehensive range of benefits - see our website for details</strong>\n<br><br>\nhttp://www.providenceiscalling.jobs/rewards-benefits/\n<br><br>\n<strong>Our Mission</strong>\n<br><br>\nAs expressions of Gods healing love, witnessed through the ministry of Jesus, we are steadfast in serving all, especially those who are poor and vulnerable.\n<br><br>\n<strong>About Us</strong>\n<br><br>\nProvidence Health &amp; Services is a not-for-profit Catholic network of hospitals, care centers, health plans, physicians, clinics, home health care and services guided by a Mission of caring the Sisters of Providence began over 160 years ago. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law.\n<br><br>\n<strong>Schedule:</strong> Full-time\n<br><br>\n<strong>Shift:</strong> Day\n<br><br>\n<strong>Job Category:</strong> Information Technology\n<br><br>\n<strong>Location:</strong> Oregon-Portland\n<br><br>\n<strong>Other Location(s):</strong> Washington-Renton\n<br><br>\n<strong>Req ID:</strong> 176635"}