{"job title": "Data Scientist", "company": "Prudential", "city state": "– United States-New Jersey-Newark", "rating": "3.5", "job description": "If your skills reside at the intersection of analytics, technology, business and innovation, then we have a unique and exciting opportunity for you!\n<br><br>\nPrudential Financial is looking for a high-energy Data Scientist to join our diverse team of Engineers, Economists, Computer Scientists, Mathematicians, Physicists, Statisticians and Actuaries tasked with mining our industry-leading internal data to develop new analytics capabilities for our businesses.\n<br><br>\nThe role requires a rare combination of sophisticated analytical expertise; business acumen; strategic mindset; client relationship skills, project management; and a passion for generating business impact. This is an exciting opportunity to be a part of a strategic initiative that is evolving and growing over time.\n<br><br>\nPrimary responsibilities for this position include leading, designing, building, testing and presenting forward-thinking, high-impact Data Science projects focused on strategic business initiatives.\n<br><br>\nPrudential Financial employs 48,000 across the US, Asia, Europe and Latin America providing insurance, investment management and other financial products that are vital to the wellbeing of our customers and their families in over 30 countries. Prudential is reinvigorating Newark’s downtown area with our new Prudential Tower and Hain building development. Newark is Prudential’s Global Headquarters with over 5,000 employees across four downtown locations. We’re located a short walk or shuttle ride from Newark’s Penn and Broad Street Stations: a direct train ride or short drive (with free parking) from most of Northern and Central New Jersey and New York City.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Develop and maintain consultative relationships with key business stakeholders</li>\n<li>Identify, source, transform and join public, proprietary and internal data sources</li>\n<li>Model large structured and unstructured data sources (e.g. financial transactional, time-series, text, speech/audio and image)</li>\n<li>Implement advanced statistical methods for prediction and optimization including a wide variety of machine learning technologies (logit, regression, decision trees/forests, boosted models, clustering, etc.) for purposes including explorative analysis, survival analysis, segmentation, prediction and recommendation systems</li>\n<li>Perform analysis and implement solutions that maximize business impact</li>\n<li>Prepare and present written and verbal reports to key stakeholders</li>\n<li>Some domestic travel may be required</li>\n<li>Execute all aspects of an advanced analytical project under guidance</li></ul>\n\n\n<ul>\n\n<strong><br>\n<div>Advanced degree (Masters or Ph.D.) in Mathematics, Statistics, Engineering, Econometrics, Physics, Computer Science, Actuarial, Data Science, or comparable quantitative disciplines</div>\n\n<strong><br>\n<div>Master’s degree graduates should additionally have at least one year of industry experience with responsibility for developing advanced quantitative, analytical, statistical solutions</div>\n\n<strong><br>\n<div>Hands-on experience applying a wide variety of statistical machine learning techniques to real world problems spanning analysis, predictive modeling and optimization on structured and unstructured data</div>\n\n<strong><br>\n<div>Experience using tools such as Python, R, Matlab, SAS, SPSS or equivalent for statistical modeling of large data sets</div>\n\n<strong><br>\n<div>Well-developed written and oral communication skills with ability to present complex statistical concepts to non-analytical stakeholders (Excel, Word and PowerPoint are a must)</div>\n\n<strong><br>\n<div>Software engineering experience in C/C /C#/Java/Scala or similar object oriented or functional languages is highly regarded but not a prerequisite</div>\n\n<strong><br>\n<div>M.B.A. when combined with advanced quantitative degree is highly regarded but not a prerequisite</div>\n\n<strong><br>\n<div>Prior academic or industry research experience is highly regarded but not a prerequisite</div>\n\n<strong><br>\n<div>Prior exposure to financial services or insurance industry may be helpful but is not a prerequisite</div> \n</strong></strong></strong></strong></strong></strong></strong></strong></strong></ul>"}