{"job title": "Data Scientist", "company": "PTP", "city state": "– Gold River, CA", "rating": "4.0", "job description": "<strong>About Us</strong>\n<p>We are a growing company with a solid customer base, excellent compensation and benefits, and a collaborative yet flexible work environment. If you enjoy challenging projects, using new technologies to deliver innovative business solutions, and you're interested in working for an entrepreneurial company, we may have a home for you.</p>\n<p>PTP is looking for a <strong>Data Scientist</strong> to join our Customer Experience practice. At PTP, we value aptitude and creativity as well as experience. We are a diverse organization and are looking for bright, passionate and committed professionals who strive to be the best at what they do.</p>\n<p><u><strong>Responsibilities</strong></u></p>\n<ul>\n<li>Use machine learning techniques to create scalable solutions for business problems</li>\n<li>Analyze and extract key insights from rich stores of customer data</li>\n<li>Implement highly innovative models for predictive learning for applications like recommendations and targeting</li>\n<li>Establish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation</li>\n<li>Research and implement novel machine learning algorithms for new business problems</li>\n</ul>\n<p><u><strong>Requirements</strong></u></p>\n<ul>\n<li>PhD. in Computer Science with a focus on machine learning</li>\n<li>Track record of having developed novel machine learning algorithms, SIGKDD/ICML/NIPS</li>\n<li>Hands-on experience in predictive modeling and analysis over large volumes of data</li>\n<li>Strong problem solving ability</li>\n<li>Strong programming skills in C/C++ or Java</li>\n<li>Experience with R/SAS/SPSS</li>\n<li>Experience with SQL and MPP databases</li>\n<li>Experience with large scale distributed programming paradigms – experience with the Hadoop stack(HDFS/MR/Pig/Hive)</li>\n<li>Familiarity with AWS and other cloud-based technologies that can be used with large mapReduce efforts</li>\n<li>Experience in free-text analytics / natural language processing (NLP)</li>\n<li>Excellent written and verbal communication and skills</li>\n</ul>\n<p>Compensation is DOE and is extremely competitive.</p>"}