{"job title": "Advanced Risk Compliance Analytics Manager", "company": "PwC", "city state": "– New York, NY", "rating": "3.7", "job description": "A career in our Analytics Data Assurance practice, within Risk Assurance Compliance and Analytics services, will provide you with the opportunity to assist clients in developing analytics and technology solutions that help them detect, monitor, and predict risk. Using advanced technology, were able to focus on establishing the right controls, processes and structures for our clients to ensure that decisions are based on accurate information and assure that information provided to third parties is accurate, complete, and can be trusted.\n<br><br>\nOur team helps business leaders navigate evolving risks by staying ahead of uncertainty by developing smart infrastructure and harnessing data through analytics. As a part of the team, youll help us develop cost effective technology solutions that focus on delivering relevant, actionable intelligence that executives need to understand operations and manage critical risks.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nAs a Manager, youll work as part of a team of problem solvers with extensive consulting and industry experience, helping our clients solve their complex business issues from strategy to execution. Specific responsibilities include but are not limited to:\n<ul>\n<li>Proactively assist in the management of a portfolio of clients, while reporting to Senior Managers and above</li><li>Be involved in the financial management of clients</li><li>Be actively involved in business development activities to help identify and research opportunities on new/existing clients</li><li>Contribute to the development of your own and teams technical acumen</li><li>Develop strategies to solve complex technical challenges</li><li>Assist in the management and delivering of large projects</li><li>Train, coach, and supervise staff</li><li>Keep up to date with local and national business and economic issues</li><li>Continue to develop internal relationships and your PwC brand</li>\n</ul>\n<strong><u>Job Requirements and Preferences</u></strong>:\n<br><br>\n<strong><u>Basic Qualifications</u></strong>:\n<br><br>\n<strong>Minimum Degree Required</strong>:\n<br>\nBachelor Degree\n<br><br>\n<strong>Required Fields of Study</strong>:\n<br>\nAccounting, Management Information Systems, Management Information Systems &amp; Accounting, Statistics, Mathematical Statistics, Mathematics, Engineering\n<br><br>\n<strong>Minimum Years of Experience</strong>:\n<br>\n5 year(s) of consulting, data analysis, compliance, internal audit or risk experience or military/intelligence community leadership experience.\n<br><br>\n<strong><u>Preferred Qualifications</u></strong>:\n<br><br>\n<strong>Degree Preferred</strong>:\n<br>\nMaster of Business Administration\n<br><br>\n<strong>Preferred Knowledge/Skills</strong>:\n<br>\nDemonstrates extensive knowledge and/or a proven record of success as a team leader in the following areas:\n\n\n<ul>\n<li>Operating in a professional services firm or large enterprise as a consultant, auditor or business process specialist; or the equivalent of industry or military/intelligence community experience;</li>\n<li>Identifying and obtaining new service opportunities and taking the opportunities through the sales cycle, including the following: defining resource requirements, project workflow, budgets, and billing and collection;</li>\n<li>Identifying and addressing client needs, including developing and sustaining client relationships;</li>\n<li>Leading of teams to generate a vision, establish direction and motivate members, create an atmosphere of trust, leverage diverse views, coach staff, and encourage improvement and innovation;</li>\n<li>Performing on project teams and providing deliverables involving multiphase data analysis related to the evaluation of compliance and risk issues; - Identifying risk requirements and data sources, as well as understanding how to create decision-oriented deliverables;</li>\n<li>Evaluating business processes, compliance and risk, the leadership to exercise oversight over projects involving database concepts, including building relationships between data sources and tables, grouping data, and producing cohesive analyses;</li>\n<li>Leveraging data manipulation and analysis technologies inclusive of Microsoft SQL Server, SQL, Oracle, and/or DB2;</li>\n<li>Understanding of IT architecture and solution development through the use of R, Python, Java, C# or other programming languages; and,</li>\n<li>Understanding of compliance systems and technology such as Spotfire, Tableau, Microsoft BI, and Qlikview.</li>\n</ul>\n\nDemonstrates extensive abilities and/or a proven record of success as a team leader in the following areas:\n\n\n<ul>\n<li>Creating a positive environment by monitoring workloads of the team and respecting the work-life quality of team members, providing feedback in a timely manner, and keeping leadership informed of progress and issues;</li>\n<li>Working seamlessly in a virtual environment to complete projects with team members based in various locations, domestically and globally;</li>\n<li>Identifying and addressing client needs, including developing and sustaining meaningful client relationships and understanding the client's business;</li>\n<li>Utilizing project management skills in relation to data management projects, including developing project plans, budgets, and deliverables schedules;</li>\n<li>Thinking creatively and using individual initiative, and flexibility in prioritizing and completing tasks;</li>\n<li>Researching and analyzing pertinent client, industry, and technical matters;</li>\n<li>Approaching clients and team members in an organized and knowledgeable manner and delivering clear requests for information; and,</li>\n<li>Utilizing negotiation and persuasion skills to sell potential opportunities, including a proven track record with identifying and converting potential engagement opportunities and developing market presence.<br><br>All qualified applicants will receive consideration for employment at PwC without regard to race; creed; color; religion; national origin; sex; age; disability; sexual orientation; gender identity or expression; genetic predisposition or carrier status; veteran, marital, or citizenship status; or any other status protected by law. PwC is proud to be an affirmative action and equal opportunity employer.</li>\n</ul>"}