{"job title": "Senior Technical Data Analyst", "company": "Pyramid Consulting", "city state": "– Plano, TX", "rating": "3.8", "job description": "<strong>Job Description</strong><br>\n\n <div>\nImmediate need for a <strong>Senior Technical Data Analyst</strong> with experience in the <strong>IT</strong> Industry. This is a <strong>12</strong><strong> months</strong> contract opportunity with long-term potential located in <strong>Plano, TX.</strong> Please review the job description below:\n<br><br>\n<strong>Job ID: 17-12402</strong>\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Gathering functional requirements, developing technical specifications, and project planning.</li>\n<li>Align overall strategies and reconcile competing priorities across organization.</li>\n<li>Design and develop ETL/ELT jobs across multiple platforms and tools including Informatica, Vertica, Hadoop, and Amazon Web Services (AWS).</li>\n<li>Data Modeling for Data Warehouse Environments.</li>\n<li>Roughly 60-75% hands-on coding.</li>\n<li>Resolve defects/bugs during QA testing, pre-production, production, and post-release patches.</li>\n<li>Work cross-functionally with various Client teams: Product Development, Product Management, Project Management Office, Sales, Care, Data Architects, Shared Data Services, Data Scientists, Business Data Analysts and fellow Technical Data Analysts.</li> \n</ul>\n\n<strong>Qualifications</strong> <strong>and Technology Experience:</strong>\n\n\n<ul>\n<li>Minimum 5 years of experience with developing and administering ETL/ELT processes with Informatica Power Center.</li>\n<li>Minimum 3 years of experience with developing applications on MPP Columnar Analytics Data Warehouse Environments such as Vertica, GreenPlum, and RedShift.</li>\n<li>Strong SQL experience with creating complex queries.</li>\n<li>Minimum 5 years of experience with scheduling and monitoring jobs using Enterprise Schedulers such as Tidal, Autosys etc.</li>\n<li>Minimum 5 years of experience with Shell scripting on Linux / Unix environments.</li>\n<li>Familiarity with NoSQL database environments such as Cassandra.</li>\n<li>Experience working on Amazon Web Services (AWS) is a plus.</li>\n<li>Solid communication skills: Demonstrated ability to explain complex technical issues to both technical and non- technical audience.</li>\n<li>Strong understanding of Data Warehousing principles and Data Modeling.</li>\n<li>BS/MS in Computer Science or equivalent work experience.</li>\n</ul>\n\nOur client is a leading <strong>IT</strong> Industry and we are currently interviewing to fill this and other similar contract positions. Qualified candidates should apply online for immediate consideration.</div>\n\n<br>"}