{"job title": "Data Scientist", "company": "Pyramid Consulting, Inc", "city state": "– Omaha, NE", "rating": "3.7", "job description": "Our client is in immediate need for a talented <strong>Data Scientist;</strong> with experience in the <strong>IT</strong> Industry. This is a <strong>Full Time Permanent Job</strong> and is located in <strong>Omaha, NE.</strong> Please review the job description below and contact me ASAP if you are interested.\n<br><br>\n<strong>Job ID: [18-</strong> <strong>32331]</strong>\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nWe are looking for Data Scientists with the capability to perform independent statistical and machine learning research/ projects. If you are a problem solver with a curiosity for exploring new techniques and technologies in AIML (Artificial Intelligence &amp; Machine Learning) space. Individuals should be able to break down business problems into smaller components and implement ML approaches to empower the end business decisions\n<br><br>\n<strong>Key Responsibilities</strong>\n<br><br>\n• Intermediate to expert level proficiency and thorough understanding of at least one of the upcoming technologies like deep learning, NLP, image processing, recommender systems\n<br><br>\n• Intermediate to expert level proficiency in statistical/ML predictive techniques such as regression, Bayesian methods, tree-based learners, SVM, RF, XGBOOST etc\n<br><br>\n• Working experience and statistical clarity in traditional algorithms like time series modeling, dimensionality reduction, SEM, GLM, GLMM, clustering and related areas\n<br><br>\n• Experience of working on a project end-to-end: problem scoping, data gathering, EDA, visualizations, modeling and insights\n<br><br>\n• Collaborate with business and data owners to formulate problems whose solution would be impactful to the business\n<br><br>\n• Strong hands on skill in Python using libraries like NLTK, SkLearn, Keras, Pandas, Matplotlib, Seaborn etc\n<br><br>\n• Good to have Experience working with large data sets and tools like MapReduce, Hadoop, Hive, etc and programming algorithms that are currently not available in distributed environment.\n<br><br>\nOur client is a leading<strong> IT</strong> organization and we are currently interviewing to fill this and other similar contract positions. Qualified candidates should apply NOW for immediate consideration.\n<br><br>\nIf you are interested in this position, please apply online for immediate consideration.\n<br><br>\n."}