{"job title": "Data Science Consultant", "company": "Pyramid Consulting", "city state": "– Charlotte, NC", "rating": "3.8", "job description": "<strong>Job Description</strong><br>\n\n <div>\nImmediate need for a talented <strong>Data Science Consultant</strong> with experience in the <strong>Utility Industry</strong>. This is a <strong>2+ Months</strong> contract opportunity with long-term potential and is located in <strong>Charlotte, NC.</strong> Please review the job description below.\n<br><br>\n<strong>Job ID: 18-11515</strong>\n<br><br>\n<strong>Key Responsibilities:</strong> \n\n\n<ul>\n<li>This position is responsible for business consulting activities for the Analytics Competency Center within various Client business units as the primary interface.</li>\n<li>As a liaison to Information Technology in order to: Serve as an expert in translating complex data into key strategy insights and valuable actions.</li>\n<li>Client business narratives told by the data and present them to other scientists, business stakeholders, and managers at various levels.</li>\n<li>Develop and test heuristics.</li>\n<li>Create and run models.</li>\n<li>Perform data exploration and data mining.</li>\n<li>Create business intelligence, dashboards, visualizations, and/or other advanced analytics reports to adequately tell the business narrative and offer recommendations that are practiced, actionable, and have material impact, in addition to being well-supported by analytical models and data.</li> \n</ul>\n\n<strong>Key Requirements and Technology Experience:</strong>\n\n\n<ul>\n<li>Graduation from a four-year college or university with a degree in statistics, physics, mathematics, engineering, computer science, or management of information systems.</li>\n<li>Work experience in addition to degree: 3-5 years.</li>\n<li>Working knowledge of statistics, programming and predictive modeling.</li>\n<li>Working knowledge of code writing.</li>\n<li>Previous experience working in data mining or natural language processing.</li>\n<li>Strong critical thinking skills and the ability to relate them to the products or services the company is producing.</li>\n<li>Understanding of and ability to use programming languages like Python and SQL (Structured Query Language).</li>\n<li>Strong knowledge of basic and advanced prediction models. Data mining knowledge that spans a range of disciplines.</li>\n<li>Strong exploratory analysis skills.</li>\n<li>Excellent verbal and written communication skills as well as the ability to bridge the gap between data science and business management.</li>\n<li>Exceptional organizational skills and is detail oriented.</li>\n<li>Mastery of statistics, machine learning, algorithms and advanced mathematics.</li>\n</ul>\n\nOur client is a leading<strong> Utility Industry</strong> and we are currently interviewing to fill this and other similar contract positions. If you are interested in this position, please apply online for immediate consideration.</div>\n\n<br>"}