{"job title": "Senior Data Architect", "company": "Pyramid Consulting", "city state": "– Plano, TX", "rating": "3.8", "job description": "<strong>Job Description</strong><br>\n\n <div>\nImmediate need for a talented <strong>Senior Data Architect</strong> with experience in the <strong>Banking and Financial Industry</strong>.This is a <strong>06+ Months</strong> contract opportunity with long-term potential and is located in <strong>Plano, TX.</strong> Please review the job description below.\n<br><br>\n<strong>Job ID:</strong> <strong>18-29696</strong>\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Build products that better connect data analysts, business analysts, and data scientists and enable them to focus more time on analysis and less and pulling and manipulating data</li>\n<li>Interact regularly with associates in our marketing and analytics group to understand their biggest painpoints and develop ideas to address them</li>\n<li>Develop full-stack applications with a focus on backend micro services and open source technologies using docker, AWS, and Python</li>\n<li>Architect and implement highly scalable, high performing distributed applications using Python</li>\n<li>Build new MicroServices/APIs in Python</li>\n<li>Work with product owners to understand desired application capabilities and testing scenarios</li>\n<li>Work with a high-performing agile team to design, develop, test, implement, and support technical solutions across a full-stack of development tools and technologies</li>\n<li>Work directly with existing open source projects, such as Jupyter and Airflow and actively participate in those communities</li>\n<li>Build cutting edge tools that are unique and build up your patent portfolio</li>\n<li>Provide technical leadership in terms of architecting applications, mentoring developers, making smart technology decisions, etc.</li>\n<li>Evaluate new technologies and stays current on industry best practices</li>\n<li>Leverage designated innovation time to work on your passion project that will help , take the next step in technology!</li>\n</ul>\n\n<strong>Key Responsibilities and Technology Experience:</strong>\n\n\n<ul>\n<li>Bachelors Degree or military experience</li>\n<li>At least 4 years of experience designing, developing and delivering cloud native applications</li>\n<li>At least 2 years of experience developing, deploying, and connecting RESTful services</li>\n<li>At least 2 years of experience using AWS or other cloud provider</li>\n<li>At least 2 years of Python in a software engineering environment</li>\n<li>At least 4 years of Python in a software engineering environment</li>\n<li>At least 2 years of demonstrated experience developing or contributing to open source projects</li>\n<li>At least 2 years of experience with Jupyter or Airflow</li>\n<li>At least 1 year of experience with SQL</li>\n<li>Experience deploying to ECS or Kubernetes</li>\n<li>Quick learning and excellent problem solving</li>\n<li>Understanding of basic Networking and databases</li>\n</ul>\n\nOur client is a leading<strong> Banking and Financial Industry</strong> and we are currently interviewing to fill this and other similar contract positions. If you are interested in this position, please apply online for immediate consideration.</div>\n\n<br>"}