{"job title": "Data Scientist", "company": "Quantum Reservoir Impact", "city state": "– Houston, TX, United States", "rating": "3.8", "job description": "Data Scientist<br><br><strong>Job Location</strong> USA-TX-HOUSTON\n<br><br>\n<strong>Position Type</strong> Full-Time<br><br>DESCRIPTION<br><br>At QRI, we are developing data-driven products to solve complex industry problems at the speed-of-light. We leverage the most recent advancements in technology and combine them with the brain-power of industry experts to create truly unique and valuable software. Our software engineering workflow is extremely high-paced and collaborative. We are looking to expand our agile technology team to include several more data scientists. As a <em>Data Scientist</em>, you would be responsible for creating lean solutions to machine learning problems, parallel computing opportunities, batch processing of large data sets, and possibly web scraping, virtual reality programming, and computer vision efforts. You should be willing to work on various projects at the same time, and thrive in a high-paced environment.\n<br><br>\nAdditional responsibilities and expectations:\n<ul>\n<li>Processing, cleaning, and quality check of data used in QRI technologies</li><li>Performing statistical analysis</li><li>Comfortable with basic CRUD operations and designing APIs for efficient data consumption</li><li>Adapt at determining opportunities for new data acquisition. This could be from a public data source (e.g., web scraping) or from an existing private database with an inflexible design.</li><li>Selecting features and building/optimizing classifiers using machine learning</li><li>Building prediction systems to be integrated with QRI technologies</li><li>Excellent technical writing technique</li><li>Work with full-stack developers and data engineers to explain product workflow, technical considerations, data models, API efficiencies</li>\n</ul>\n\nQUALIFICATIONS\n\n<ul>\n<li>BSc (MSs recommended) with GPA &gt;= 3.5 in Computer Science, Mathematics or related fields.</li><li>Excellent understanding of machine learning techniques and algorithms (e.g., clustering, Decision Forests, SVM, etc)</li><li>Excellent statistics skills (e.g., distributions, statistical testing, regression, etc.)</li><li>Skilled and creative team player also able to work independently in a complex and dynamic environment.</li><li>Be prepared with a demo of recent project work.</li></ul>\n<br>\n<strong>TECHNOLOGIES WE LOVE:\n<br>\n</strong>\n\n<ul>\n<li>MATLAB, Python, R, JavaScript, Spotfire, MySQL, MongoDB</li><li>Recommended: share your GitHub profile with us!</li>\n</ul>\n\n<strong>WHAT WE VALUE:\n<br>\n</strong>\n\n<ul>\n<li>You're excited to work with others in complex and dynamic systems environments.</li><li>You have a constant desire to grow and develop, to learn the cutting edge of new technology.</li><li>You thrive in a fast-paced environment.</li><li>You care about great design, in your code and technical architecture.</li><li>You are comfortable with both large-scale and iterative development styles.</li><li>You enjoy working with others, but are also an independent programmer.</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}