{"job title": "Data Scientist", "company": "Quartet", "city state": "– New York, NY", "rating": "3.5", "job description": "<div><strong>Company Description:</strong></div><div>Quartet is a pioneering technology company connecting physical and mental care to improve peoples health and quality of life. We are building a collaborative technology platform that brings together physicians, mental health providers, and insurance companies to effectively improve patient outcomes and drive down healthcare costs. Our data-driven platform identifies high-need patients and facilitates access to personalized care. Backed by $92MM in venture funding from top investors like GV (formerly Google Ventures) and Oak HC/FT, Quartet is headquartered in NYC and is currently operating in several markets across the US -- Pennsylvania, Massachusetts, Louisiana, Washington, Northern California, and New Jersey.</div><br>\n<div><strong>Role Description:</strong> </div><div>As a Data Scientist at Quartet, you will work in collaboration with other data scientists, bioinformaticians and platform engineers. In this role, you will build machine learning models and recommendation services to enable our applications to suggest timely and appropriate behavioral health care interventions for patients.</div><br>\n<div>You'll work with datasets that include millions of detailed medical, pharmacy, lab claims, EHR, and application data. You will help with development and validation of new algorithms that enhance our system in terms of scalability, reliability and accuracy.</div> <br>\n<div>The ideal candidate will be an entrepreneurial, motivated data scientist who is well-versed in data analysis and algorithm implementation and eager to learn new things and make an impact on the industry. Health data experience is a plus, but it's not necessary.</div> Responsibilities\n\n<ul>\n<li>Work with an interdisciplinary technical team to develop statistical models in Quartets platform.</li><li>Apply data mining and machine learning techniques to develop better personalization and recommendation for patients and doctors needs.</li><li>Design and develop effective models, features, and algorithms involving multiple datasets - user activity, EHR, ADT, medical claims, pharmacy claims, lab test claims etc.</li><li>Derive insights from descriptive analysis that drive a data-informed process for experimenting with new products to improve patient outcomes.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Experience building high quality data products.</li><li>4+ years experience as a data scientist, software engineer with predictive modeling, or similar experience of solving real problems with data mining and machine learning techniques.</li><li>PhD or Masters Degree in computer science, machine learning, applied statistics, physics, or a related quantitative discipline.</li> <li>Proficiency in building Machine Learning (supervised and unsupervised) models and recommendation systems.</li><li>Strong knowledge of mathematical fundamentals: probability theory, linear algebra and statistics.</li><li>Ability to execute, starting from problem definition, to a working implementation.</li><li>Ability to clearly communicate across disciplines and work collaboratively.</li> <li>Proficiency in Python and code versioning systems like git.</li><li>Expertise with data science toolkits like scikit-learn and pandas.</li> <li>Knowledge of software architectures and tools such as Scala, Hadoop.</li><li>Familiarity working in a Linux server-based environment.</li>\n</ul>\n\nBenefits and perks of working at Quartet include:\n\n<ul>\n<li>Medical, dental, vision and life insurance</li><li>Enhanced mental health benefits</li><li>Paid membership to One Medical</li><li>Pre-tax health, transit and dependent care flexible spending accounts</li><li>Fee-free 401(k) program</li><li>Unlimited vacation and sick leave, and competitive family leave policy</li><li>Amazing office with stocked kitchen, weekly yoga, meditation services and regular company gatherings</li><li>Working with some of the most talented and mission-driven minds in the industry!</li>\n</ul><br>\n\n<div><strong>Employee Benefits for Quartet include:</strong> Unlimited vacation, volunteer opportunities, catered lunches, snacks, team events and outings, full medical, dental + vision coverage, generous parental leave, commuter benefits, 15 free therapy sessions + unlimited copay reimbursements for mental healthcare, 401K, ESPP, gym benefits.</div> <br>\n<div><strong>Want to know what Quartet life is like?</strong> Click here to meet our team.</div> <br>\n<div>Quartet is committed to building a diverse team and fostering an inclusive culture, and is proud to be an equal opportunity employer. We embrace and encourage our employees' differences in race, religion, color, national origin, gender, family status, sexual orientation, gender identity, gender expression, age, veteran status, disability, pregnancy, medical conditions, and other characteristics. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Quartet does not accept unsolicited headhunter and agency resumes. Quartet will not pay fees to any third-party agency or company that does not have a signed agreement with Quartet.</div> <br>\n<div>Please note: Quartet interview requests and job offers only originate from quartethealth.com email addresses (e.g. jsmith@quartethealth.com). Quartet will also never ask for bank information (e.g. account and routing number), social security numbers, passwords, or other sensitive information to be delivered via email. If you receive a scam email or wish to report a security issue involving Quartet, please notify us at: security@quartethealth.com.</div><br>\n<div><strong>Have someone to refer?</strong> Email talent@quartethealth.com to submit their details to us.</div>"}