{"job title": "Forensic Scientist - Lenexa, KS req", "company": "Quest Diagnostics Incorporated", "city state": "– Lenexa, KS", "rating": "3.4", "job description": "Forensic Scientist - Lenexa, KS req17372\n<br><br>\nSchedule: Tuesday - Saturday 12:00 pm - 8:30 pm\n<br><br>\nLook for more than answers. Patients and Physicians rely on our diagnostic testing, information and services to help them make better healthcare decisions. These are often serious decisions with far reaching consequences, and require sensitivity, tact and a clear dedication to service. It's about providing clarity and hope.\n<br><br>\nAs a Lab Technician you will work for the world leader in the industry, with a career where you can expand your skills and knowledge. You'll have a role where you can act with professionalism, you can inspire colleagues, and you can care about the work we do and the people we serve.\n<br><br>\nAt Quest, Lab Technicians play an essential role in our success and in the services we provide. As a career, we offer a unique opportunity to develop your career with the #1 Diagnostic Lab in the US. We are tech driven, and we're creating the lab of the future an environment where you can deliver cutting edge diagnostics and help us drive new discoveries and breakthroughs.\n<br><br>\n<strong>Basic Purpose:</strong>\n<br><br>\nThe Forensic Scientist I works within the Forensic Toxicology Laboratory and cooperates with and responds to direction from the Supervisor and/ or Group Lead on achieving work objectives. This position reports to and is managed and evaluated by the Department Supervisor. This position is responsible for all aspects of testing of donor specimens including specimen preparation and instrument operation.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Maintain chain of custody of forensic specimens and follow approved sample handling procedures.</li>\n<li>Maintain competency in the following areas: follow all written procedures in departmental SOP, prepare and verify performance of all new reagents, ensure that all required calibrators and quality control samples are included in each batch, demonstrate good analytical technique with minimal failed loads, capable of performing routine maintenance</li>\n</ul>\n\nof equipment utilized in area of responsibility, capable of programming sequence table for sample analysis, capable of basic data review.\n\n\n<ul>\n<li>Maintain legible and complete documents.</li>\n<li>Maintain clean and organized work area.</li>\n<li>Perform and document checks of temperature dependent equipment.</li>\n<li>Participate in completion of method and/or instrument validation studies to quality standards.</li>\n<li>Participate in validation of new calibrators, controls and new or modified analytical procedures.</li>\n<li>Maintain acceptable productivity &amp; quality levels, and notify Supervisor and/or Group Lead of equipment or production problems.</li>\n<li>Complete assigned continuing education activities and competency verification checks.</li>\n<li>Follow the direction of the Supervisor and/or Group Lead and adhere to all company and department policies.</li>\n<li>Complete all required quality control and quality assurance documentation related to job function.</li>\n<li>Follow work schedule as defined by the Supervisor.</li>\n<li>Maintain professional work environment.</li>\n<li>Other duties as assigned by the Supervisor.</li>\n</ul>\n\n<strong>Supervision Exercised:</strong>\n<br><br>\n<strong>N/A</strong>\n<br><br>\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Education Preferred:</strong>\n<br><br>\nBachelor of Science or Art degree with a minimum of fifteen (15) semester hours in Chemistry, fifteen (15) semester hours in Biology, and three (3) semester hours of Mathematics; or applicable regulatory requirements.\n<br><br>\n<strong>Work Experience:</strong>\n\n\n<ul>\n<li>Minimum of one (1) year laboratory experience preferred</li>\n<li>Knowledge of methods and procedures used by the laboratory preferred</li>\n</ul>\n\n<strong>Physical and Mental:</strong>\n\n\n<ul>\n<li>Ability to perform routine and repetitive motions, such as pipetting</li>\n<li>Ability to stand or sit for long periods of time</li>\n</ul>\n\nOther: N/A\n<br><br>\nAll requirements are subject to possible modifications to reasonably accommodate individuals with disabilities. Quest Diagnostics is an Equal Opportunity Employer: Women / Minorities / Veterans / Disabled / Sexual Orientation / Gender Identity or Citizenship."}