{"job title": "Analytics Manager", "company": "Quigley-Simpson", "city state": "– Los Angeles, CA", "rating": "3.1", "job description": "<p><strong>Overview:</strong></p>\n<p>We are looking for an Analytics Manager who always keep the customer first in mind, who insist on continuing to learn every day, who thrives in a highly collaborative work environment and who when presented with a challenge, won't quit until they find a solution.</p>\n<p> </p>\n<p>The Analytics Manager will be responsible for performing omni-channel research, analysis and insights reporting of vertical market trends, competitor analysis, potential and existing customer analysis, and campaign performance analysis. They will examine a campaign's ROI/ROAS, identify new market opportunities, perform extensive data and market research, analyze marketing metrics to identify cause and effect relationships. Identify positive financial outcomes to increase profitability, analyze competitors, meet with clients to ascertain marketing goals, generate reports that analyze competition and customers and offer insights about product potentials.</p>\n<p> </p>\n<p>This position requires extensive experience with online (Web, Display, SEM, Mobile, Social, etc.), consumer-facing properties and a deep understanding of analytics, good user experiences, and what drives conversion and retention. Additionally, experience with offline media analytics (TV, radio, Out-of-Home, Direct Mail, etc.) is a major plus. Knowledge and experience with both quantitative and qualitative data analysis skills, data visualization techniques, and insights development and are needed to a wide range of internal and client stakeholders.</p>\n<p> </p>\n<p>The Manager, Analytics will be a member of the agency Analytics Center of Excellence. This individual will work in a fast-paced environment as part of multi-disciplinary project teams delivering best-in-class science-based business and analytics solutions to the organization and its clients.</p>\n<p> </p>\n<p>This team member will contribute to marketing analytics requirements development, on-going campaign insights reporting, media tagging and implementation support and quality assurance testing.</p>\n<p> </p>\n<p>The Manager, Analytics must have proficiency using a variety of web and media platforms including but not limited to web analytics, search engine marketing, CRM/eCRM, social media marketing, advertising platforms.</p>\n<p><strong> </strong></p>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>3+ years business or marketing analytical work experience</li>\n<li>Excellent written and verbal communication, particularly the ability to effectively communicate to non-technical audiences regarding technical matters</li>\n<li>Experience with one or more of the following analytics platforms - Adobe Analytics, Google Analytics, Coremetrics (Certifications are a plus)</li>\n<li>2+ years’ experience with data visualization tools (Tableau/DOMO/Excel/Qlikview/ETC.)</li>\n<li>Experience providing analysis and insights for one or more of the following: web and search traffic; email messaging statistics; and social media trends; offline media impact</li>\n<li>Experience conducting ROI analysis, optimization insights and reporting for one or more of the following advertising mediums: television, radio, digital (display advertising, search marketing, online video, social advertising)</li>\n<li>Working knowledge in one of these programming languages: JavaScript, JQuery, SQL, or HTML</li>\n<li>Proficiency with Optimizely, Adobe Target, Google Content Experiments, or an equivalent tool</li>\n<li>Experience using social media monitoring services, such as Radian6, Netbase, Crimson Hexagon, or Sysomos</li>\n<li>Experience analyzing and reporting on ad serving platforms like: Adwords, DoubleClick/DART, Atlas, Eyeblaster etc.</li>\n<li>Has successfully managed projects through partnerships with cross-functional teams, both internal and external</li>\n<li>Ability to work well with a team environment</li>\n<li>Highly detail oriented and organized with the ability to multi-task and work in a very fast paced environment</li>\n<li>Proficient in statistical methodologies including linear, binary and logistic regression and other statistical models using R, Stata, or SPSS is a major plus</li>\n<li>BS/BA in Statistics, Quantitative methods, Math, Computer Science, or Marketing or equivalent experience; Master’s degree preferred</li>\n</ul>\n<p> </p>\n<p><strong>Responsibilities include</strong></p>\n<ul>\n<li>Understand and/or define the Key Performance Indicators (KPIs) of campaigns and marketing activities and derive relevant metrics, targets, and data collection strategies, including but not limited to SEO, SEM, Display Advertising, E-Mail Marketing, Social Media Marketing and Offline Channels (TV, Radio, Out-Of-Home, etc.)</li>\n<li>Analyze collected data and present results, including hypothesis development</li>\n<li>Perform analytical “deep dives” as needed</li>\n<li>Monitor and provide optimizations recommendations for omni-channel campaigns</li>\n<li>Design and conduct A/B testing and make recommendations for optimization</li>\n<li>Create and conduct statistical analysis on various datasets</li>\n</ul>"}