{"job title": "Senior Data Scientist", "company": "Quizlet", "city state": "– San Francisco, CA", "rating": "4.8", "job description": "Senior Data Scientist<br><br>Quizlet's mission is to help students (and their teachers) practice and master whatever they are learning. Every month over 30 million active learners from 130 countries practice and master more than 200 million study sets on every conceivable topic and subject. We are developing new learning experiences by modeling how students learn and by drawing upon knowledge acquisition, retention, and tracing pedagogy in cognitive science. We are always seeking to help students master any subject by optimizing study efficiency and engagement.\n<br><br>\nQuizlet is looking for an experienced, technically proficient, and highly entrepreneurial individual to work with our product and engineering teams and develop actionable, data-driven insights to support our user experience, product quality, and revenue growth efforts. We have a LOT of data - study activity, performance, clickstream, demographic, subscriber datayou name it. We've logged over 30 billion answers, 8 billion flashcards, and 20 billion study sessions. We have huge opportunities to leverage this data to improve engagement (active user growth), product quality (existing and new features), educational effectiveness (how users learn), and also grow our paid subscriber base.\n<br><br>\nIn this very hands-on role, you'll make this happen at both a conceptual and execution level. You'll be an early member of the data team at a brand that's already well on its way to serving a billion students and teachers across the globe. Quizlet is a leading company in education technology with proven traction and huge growth ahead. Our business model is strong and got us to profitability before raising venture capital money. Come help us scale one of the fastest growing and highest quality consumer learning brands, as we develop innovative simple-to-use study tools that help students everywhere. Quizlet is a fun and unique company in a truly exciting phase of its growth.<br><br>The Role\n\n\n<ul>\n<li>Drive greenfield research in learning science, specifically knowledge acquisition and retention</li>\n<li>Identify and programmatically extract content taxonomies from our study material</li>\n<li>Stay up to date on cognitive science, psychometrics, and machine learning literature and evangelize methods to the company</li>\n<li>Contribute to our open source machine learning framework</li>\n<li>Build growth and revenue forecasting models</li>\n<li>Present at conferences, publish blog posts, and write papers to collaborate with others tackling the same problems</li>\n</ul>\n\nRequired Qualifications\n\n\n<ul>\n<li>Computationally intensive Masters or Ph.D. preferred, 5+ years of experience in industry as a data scientist otherwise</li>\n<li>A practical mindset and excitement to work on knowledge acquisition, retention, and educational engagement projects</li>\n<li>Prior industry experience working with data on large internet (ideally consumer) businesses</li>\n<li>A solid academic understanding of statistics and machine learning</li>\n<li>Self-motivated and proactive: demonstrated ability to prioritize, execute and follow through on key projects and tasks</li>\n<li>Strong communication skills: able to distill complexity and communicate insights clearly</li>\n<li>Strong technical skills, including SQL and Python. Familiarity with libraries like sklearn, gensim, TensorFlow, and Jupyter development flows are desirable.</li>\n<li>You know what it means to work in a small company where every person is doing big, meaningful things - and you want to do this!</li>\n<li>Passion for education and/or doing good in the world - you're excited about the impact your work could have on the lives of students and teachers every day.</li>\n</ul>\n\nQuizlet's Team Culture<br><br>We are here to make education better and more accessible. We strive to improve the lives of students and teachers at every stage and in every setting. We have a bias for action, take initiative, and hustle to deliver results. We make informed decisions whenever possible but are unafraid to take calculated risks on great ideas to promote learning. We embrace challenges and see effort as the path to mastery. We're constantly seeking opportunities to learn and we embrace curiosity. Quality matters at Quizlet, and we hold the bar high on everything we do. We sweat the details and take personal accountability and pride in anything that carries the Quizlet name. We speak up, jump in and work with each other to fix problems, and never say \"that's not my job.\" We treat each other with honesty and respect, encourage vigorous debate, and seek critical feedback. We value diversity, humility, transparency, and collaboration as the best paths to our success as individuals, as a team, and as a company.\n<br><br>\nQuizlet's success as an online learning community depends on a strong commitment to diversity, equity and inclusion. We are actively working to build a team that is representative of the diverse communities we serve, and an open, inclusive work environment where all employees can thrive. As an equal opportunity employer and a tech company committed to societal change, we welcome applicants from all backgrounds. Women, people of color, members of the LGBTQ+ community, individuals with disabilities, and veterans are strongly encouraged to apply. Come join us!"}