{"job title": "Data Scientist (Market Design)", "company": "Quora, Inc.", "city state": "– Mountain View, CA", "rating": "4.6", "job description": "<div><div>Quora is looking for an experienced professional with deep familiarity with and passion for market design problems to join its Data Science team.</div><br>\n<div>Quora is a marketplace for knowledge, with complex interactions between many different types of users and content. How the needs of those users are balanced, and how well incentives are aligned between individuals and the platform, are critical issues to growing the community and achieving our mission as a company. Additionally, Quora's monetization engine is unlocking new opportunities to incentivize behavior and grow the platform on a regular basis, and doing so effectively requires expert attention to the economic issues at play.</div><br>\n<div>Quora's first market design-focused data science role is a hands-on role, perfect for someone interested in combining experience thinking about scaled market design problems with the technical expertise and desire to dive, head-first, directly into the data on a daily basis. This is not a research role—we don't write papers—but the data scientist should expect major product decisions to constantly be made off their work, to teach and have their expertise shape the work of others, and to be directly involved in the decision making process on the product areas they work on with the Head of Product and CEO, among others.</div><br>\n<div>Quora's outsized commitment to data is visible in everything we do, from our rigor-driven experimentation and launch processes to the backgrounds of our leaders (including approximately half the Product Management team and the Head of Product being former full-time data scientists). In joining Quora's strong, independent data team, a successful candidate should expect to both benefit from and work to advance our culture of rational decision making.</div></div><div><div>Things we look for include:\n\n<ul>\n\n\n<ul>\n<li>B.S., M.S., Ph.D. in a scientific or quantitative field. Many candidates who fit well for this role will have an advanced degree in Economics or a similar field, but it is not a strict requirement</li><li>3+ years work experience, with 1+ years working directly on scaled market design problems</li><li>Excellent statistical intuition and knowledge of various analytical approaches</li><li>Curiosity and passion for Quora</li><li>Superb communication skills and ability to explain your ideas clearly</li><li>Proficiency in SQL</li><li>Familiarity with Python or a similar scripting language</li><li>Passion for learning and always improving yourself and the team around you, including enthusiasm for other data scientists learning from your experience</li><li>Experience in working with large data sets and distributed computing tools (Hive, Redshift)</li></ul>\n</ul>\n\n</div>\n</div>"}