{"job title": "Data Scientist - New Grad", "company": "Quora, Inc.", "city state": "– Mountain View, CA", "rating": "4.6", "job description": "<div><div>Because Quora is such a data-driven company, our data scientists play a central role in the product development process by uncovering key insights from our data. As a data scientist, you'll work closely with engineers, product designers, and product managers to devise appropriate measurements and metrics, design randomized controlled experiments, build visualizations, and tackle hard, open-ended problems. You'll also develop tools and infrastructure to scale and automate the analyses that enable rapid product iteration. Quora has a wide range of rich data, giving you ample room for exploration and creativity. Examples of some projects our data scientists have worked on include modeling our long-term growth, improving the relevance and personalization of the homepage feed, and exploratory factor analysis of user behavior. We use a variety of tools--primarily Python and SQL--to analyze data and communicate results with the rest of the company.</div><br>\n<div>While Quora's data scientists come from a variety of backgrounds, including chemical engineering, mathematics, and physics, we all share a love for data and continuous learning. Especially in your first role post-graduation, we realize that mentorship is important for professional growth and development. Every data scientist has a mentor and weekly 1:1s with their managers to get feedback and ensure things are going well.</div> <br>\n<div>For examples of data science work, see Quora's Data blog: https://data.quora.com/</div></div>\n\n<br><strong></strong><div><strong></strong><div><strong>Things we look for include:</strong>\n\n<ul>\n\n\n<ul>\n<li>B.S., M.S., Ph.D. in a scientific or quantitative field, for example: Statistics, Computer Science, Physics or Cognitive Science</li><li>Excellent statistical intuition and knowledge of various analytical approaches</li><li>Curiosity and passion for Quora</li><li>Superb communication skills and ability to explain your analysis clearly</li><li>Proficiency in SQL</li><li>Proficient with Python or similar scripting language</li><li>Experience in working with large data sets and distributed computing tools (Hive, Redshift) is a plus</li><li>Passion for learning and always improving yourself and the team around you</li></ul>\n\n\n</ul>\n\n</div></div><div><div>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</div> </div>"}