{"job title": "Data Scientist", "company": "Quotient Technology Inc.", "city state": "– Cincinnati, OH, United States", "rating": "3.0", "job description": "<strong>Position Summary</strong>\n<br>\nAs Data Scientist with Quotient Technology, you will be responsible for quantifying deep understanding of consumer behavior patterns and motivations through analysis of consumer response to product and marketing strategies and tactics. The right candidate will utilize advanced data mining and statistical techniques to drive this empirical understanding and surface optimization and product enhancement insights and opportunities.\n<br><br>\nYou will be a key member of the Analytics &amp; Research team, delivering critical data-driven insights across the organization as well as to our clients and partners. You will utilize Quotient’s extensive first party and third party data to evaluate the performance of media, promotions and advertising and its attributed impact on consumer behavior and sales. Collaborating with members of Product, Engineering, Sales and Operations you will contribute to the analytics product lifecycle of strategy, design, development, test and delivery of data-driven products and techniques to further optimize our analytic offerings. As a part of this team, you will collaborate on a portfolio of solutions focused on enhancing consumer experience and generating revenue across personalized promotion, media and advertisement recommendations, targeting, measurement and insights.\n<br><br>\n<strong>Position Responsibilities:</strong>\n<br>\n· Identify and assess key opportunity areas where data and science can enhance and improve existing products, by increasing efficiency of processes and accuracy of model/analytical results\n<br>\n· Develop detailed plans for achieving desired analytics deliverables and product goals, including impact assessment to revenue and labor costs\n<br>\n· Devise, develop, test and deploy new data models to expand current solution packages\n<br>\n· Effectively engage and partner with other analytic team members, engineering, product management and sales to drive the implementation of models in an efficient and scaled manner\n<br>\n· Drive the production of analytic capabilities in data management, modeling and algorithms\n<br>\n· Be an innovator with demonstrated ability to craft a data science vision, get people excited by ideas and get them quickly to market via existing or new products\n<br><br>\n<strong>Position Qualifications:</strong>\n<br>\n· MS in Computer Science, Statistics, Applied Mathematics, AI, or related areas\n<br>\n· Experience in applying data and science to improve products and services\n<br>\n· Experience in the consumer web, consumer goods or retail functional areas preferred\n<br>\n· Solid and proven background in data mining, statistical analysis, segmentation and modeling\n<br>\n· Ability to grasp complex concepts and develop clear, concise, synthesized recommendations backed by data and analyses\n<br>\n· Experience in manipulating large data sets and analyzing them to identify actionable insights\n<br>\n· Fluency in analytical tools such as R (preferred), SAS, etc.\n<br>\n· Understanding of programming languages like SQL, C/C++/Java and scripting languages like Perl/Python\n<br>\n· Experience in designing, executing and measuring A/B tests for optimization models\n<br>\n· Exceptional collaborative, communication and presentation skills with the ability to work well across the organization driving overall shareholder value\n<br>\n· Strong initiative, high energy, hands-on and impeccable integrity\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}