{"job title": "Data Scientist", "company": "Qventus", "city state": "– Mountain View, CA", "rating": "4.8", "job description": "<div><div>Want to unlock insights from data to help doctors and nurses?</div><div>Apply to be on our data science team!</div><br>\n<div>Have you ever found yourself or a loved one waiting hours and hours in a hospital Emergency Room to get care? Did you ever feel there weren't enough nurses to take care of all the patients in your area of the hospital? Or have you ever had a surgery scheduled for months in the future that needed to happen sooner? Unfortunately our healthcare system is full of these types of operational problems. Qventus is looking for data scientists who can help redefine how healthcare systems work. Our work saves lives and helps hospitals cut tens of millions of dollars in operational costs, while improving the quality of care they’re able to deliver.</div></div><div><div>Examples of problems you may solve\n\n<ul>\n\n\n<ul>\n<li>Predicting spikes of incoming patients that could overload a hospital and suggesting solutions</li> <li>Modeling patient flow through the hospital and better schedule nurses and doctors</li><li>Identifying and notifying staff of patients who appear to be ‘slipping through the cracks’ of the care process</li><li>Help identify patients who might be high risk for readmission in to the health system</li></ul>\n</ul>\n\n</div>\n</div><div><div>Requirements\n\n<ul>\n\n\n<ul>\n<li>Have 4 to 8+ years of experience working directly with data or industry experience</li><li>Be comfortable with Python and its data centric libraries (numpy, scipy, etc), and SQL.</li><li>Have Machine Learning / Stats chops</li><li>Not only possess the ability to work with data but also to build systems around it</li><li>Have a passion for making our healthcare system work better!</li></ul>\n\n</ul>\n\n</div>\n</div><div><div>The role is a full-time position and will be based out of Mountain View. We all deeply care about improving healthcare for patients across the country while having fun working with each other. As such to be a good fit for the company we will look for:\n\n<ul>\n\n\n<ul>\n<li>Passion to use your coding skills to solve real and hard problems</li> <li>Ready to 'step outside' your role to help teammates</li> <li>Highly dependable</li> <li>Capable of independent execution</li> <li>Mature and an excellent listener</li></ul>\n</ul>\n\n</div>\n</div><div><div>Apply if you are interested in helping us fix healthcare!</div></div>"}