{"job title": "Product Data Scientist", "company": "Qventus", "city state": "– Mountain View, CA", "rating": "4.8", "job description": "<div><div><strong>The Company</strong></div><div>Qventus is a real-time decision-making platform for hospital operations. Our mission is to simplify how healthcare operates, so that hospitals and caregivers can focus on delivering the best possible care to patients.</div><br>\n<div>We use artificial intelligence and machine learning to create products that help nurses, doctors, and hospital staff anticipate issues and make operational decisions proactively.</div><br>\n<div>Qventus works with leading public, academic and community hospitals across the United States. The company was recognized by the 2016 Fierce Innovations Awards in Healthcare and by Healthcare Informatics as a 2017 Innovator Award winner.</div><br>\n<div><strong>The Role</strong></div><div>We’re looking for a product data scientist to join our product team. You will use your background in analytics and causal inference (e.g. statistics, econometrics and experimental design) to measure and understand the entire impact chain of our product, from performance of our algorithms, through nudges and recommendations made to hospital staff, to the actions they take and the operational impact those actions have.</div><br>\n<div>You’ll work closely with our product, design &amp; engineering teams to help drive the insights you derive into tangible results in our product portfolio. You’ll also be a resource for our go-to-market teams to help explain key concepts to our customers and prospects, and on occasion write blog posts / white papers that advance our thought leadership position in the market. You will be integral in developing our core methodology for how we measure success.</div><br>\n<div>This is a high impact role that will drive innovation in our product and high impact in the market.</div></div><div><div>Responsibilities\n\n<ul>\n\n\n<ul>\n<li>Create visibility for us and our clients by measuring causal effects throughout our product</li><li>Facilitate our product, design, and engineering teams’ laser focus on outcomes</li><li>Explore our data to find leverage points and opportunities</li><li>Build and tell robust analytics stories</li><li>Advise our customer success and go-to-market teams on what works, why, and how to drive further success</li></ul>\n</ul>\n\n</div>\n</div><div><div>Qualifications\n\n<ul>\n\n\n<ul>\n<li>M.S / Ph.D. (or equivalent experience) in statistics, economics, social sciences, or related field</li><li>Proficiency in R or Python</li><li>Comfort with SQL and dashboarding tools</li><li>At least 2 years industry experience working with rich datasets</li><li>Ability to explain complex analyses to a variety of audiences</li><li>A love for the big picture and a healthy obsession with the details</li><li>Deep curiosity and a passion for real-world impact</li></ul>\n</ul>\n\n</div>\n</div>"}