{"job title": "Persistent Infrared (PIR) Scientist/Developer", "company": "Radiance Technologies", "city state": "– Dayton, Ohio, United States", "rating": "3.7", "job description": "Tracking Code\n<br><br>\nHR7150\n<br><br>\nJob Description<br><br>Radiance Technologies is an employee-owned company with benefits that are unmatched by most companies in the Dayton OH area. Employee ownership, generous 401K, full health/dental/life/vision insurance benefits, interesting assignments, educational reimbursement, competitive salaries and a pleasant work environment combine to make Radiance Technologies a great place to work and succeed.\n<br><br>\nThe PIR Scientist/developer will assist with the development and improvement of techniques and procedures for the processing, exploitation, and dissemination (PED) of data from PIR sensors and other GEOINT sensors as needed. This includes supporting the development, transition and integration of new data analysis algorithms, and transition of emerging analytical capabilities to a PIR intelligence production environment. Engineer/developers in these positions will work collaboratively with other GEOINT and MASINT Engineers to develop advanced intelligence production processes on a new system framework.\n<br><br>\nThe work is in support of the Space and Missiles Center (SMC) at Los Angeles AFB, CA. Work location will be at NASIC, Radiance facilities, or some combination of both.\n<br><br>\n<strong>Desired Qualifications</strong>\n\n<ul>\n<li>Understanding of PIR exploitation software such as Palette, Purveyor, etc</li>\n\n<li>Experience working with intelligence community and/or DoD classified sensor data</li>\n\n<li>Knowledge of Apache Mesosphere and Docker algorithm packetization</li>\n</ul>\n\nRequired Skills\n\n\n<ul>\n<li>Bachelor’s degree in Engineering, Physics, or other related technical field</li>\n\n<li>Proficient with engineering codes to include Matlab and/or IDL</li>\n\n<li>Ability to work independently or in a team environment</li>\n\n<li>Strong technical writing and oral communication skills</li>\n\n<li>Current Secret clearance is required with eligibility for Top Secret/SCI</li>\n</ul>\n\nRequired Experience\n\n\n<ul>\n<li>5+ years of experience with development/development of system architectures to include cloud data processing</li>\n\n<li>Knowledge of data analysis, sensor modeling, and/or development of algorithms.</li>\n\n<li>Knowledge of infrared phenomenology and physical characteristics</li>\n\n<li>Knowledge and experience in infrared sensor data collection, processing, exploitation, and dissemination processes and techniques.</li>\n</ul>\n\nJob Location\n<br><br>\nDayton, Ohio, United States\n<br><br>\nPosition Type\n<br><br>\nFull-Time/Regular"}