{"job title": "Geospatial Data Specialist", "company": "Radiant Solutions", "city state": "– US-VA-McLean", "rating": "4.6", "job description": "Responsibilities<br><br>We are looking for an immediate candidate to fill a full-time role at a Customer site as a geospatial data specialist. This person will join a team that has been consistently recognized by the Customer for their exceptional contributions. The contractor team consists of a wide range of skillsets including imagery analyst, developers, and data specialists who work with the Customer analysts to apply cutting edge analytic methods to solve our nation’s most pressing intelligence questions. This is a unique team that thrives on innovation and new technology. The opening is for a geospatial data specialist to support these cutting edge methodologies and tool development with data procurement, curation, analysis, formatting, and storage. The individual should enjoy working with people and will proactively search for base data layers and specialized data sets to support analysts' projects through existing repositories and through forging new relationships with other data providers. The person should have knowledge and experience with using geospatial data sources from industry, academia, the intelligence community, military, and the scientific community. The individual will work with collections staff to craft requirements and coordinate efforts. The candidate must have extensive experience using ArcGIS. The individual will also manage all of the group's geospatial data holdings in Oracle and Postgres.\n<br><br>\nSome responsibilities include, but are not limited to:\n\n<ul>\n\n <li>Partnering with analysts for creative problem solving of geospatial data issues</li> \n\n<li>Proactive searching for data in non-obvious locations, building relationships with data providers</li> \n\n<li>Map layout creation for finished intelligence production</li> \n\n<li>Determine analysts' data needs and make them aware of new data offerings</li> \n\n<li>Convert data into usable formats for analysis</li> \n\n<li>Cataloging new data acquisitions and maintaining catalogs and metadata</li> \n\n<li>Ensure proper formatting for existing data library</li> \n\n<li>Publish geospatial datasets into web environment</li>\n<li>Monitor allocated memory space</li>\n</ul>\n\nQualifications<br><br>Required Qualifications:\n\n<ul>\n\n <li>Degree in geographic information systems or a related field</li>\n<li>8-12 years’ experience in geospatial or data analysis</li>\n<li>Proficiency in ArcGIS and/or open source equivalents</li>\n<li>Motivated, self-starter initiative</li>\n<li>Versatile geospatial skills to assist with data editing, manipulation and visualization</li> \n</ul>\n<strong>To be qualified, you must be a US Citizen and must have an active or previous history of TS/SCI with Polygraph.</strong>\n<br><br>\n#cjpost<br><br>Overview<br><br>Join our company whose purpose is to help national security and commercial organizations understand and navigate our changing planet. Radiant Solutions provides multi-source data collection, enrichment, and analytic capabilities that reveal unique geospatial information and insights where and when it matters most.\n<br><br>\nNo other company has such strong roots in geospatial with our level of scale and a strong commercial mindset. We are well known for delivering innovative capabilities across the entire geospatial intelligence value chain. Our combined team of over 1,000 aerospace engineers, geospatial analysts, weather and ocean experts, software developers, data scientists, and DevOps engineers apply disruptive technologies and our unique intellectual property to both national security and commercial problems.\n<br><br>\nWe offer an excellent comprehensive benefits package including medical, dental, life, and short/long-term disability insurance, vacation and sick leave, 401(k) retirement plan, flexible spending account, and tuition assistance.\n<br><br>\nRadiant Solutions values diversity in the workplace and is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law."}