{"job title": "Quality Assurance Scientist, Complaint Handling", "company": "Radiometer", "city state": "– Miami, FL", "rating": "3.3", "job description": "<ul>\n<li>Receive and process complaints escalated from internal and external customers related to products manufactured and or distributed and serviced by the company in a manner consistent with all laws and regulations for medical devices.</li>\n<li>Generate and analyze customer feedback (CF) data to improve product reliability and performance for our customers.</li>\n<li>Possess understanding of risk management concepts and is capable of assessing product risks across unit of work.</li>\n<li>Independently and collaboratively evaluate information, reports, and data and provide recommendations for process improvements.</li>\n<li>Bachelor's degree with 3 years in Science or Engineering discipline, or relevant years of Quality/Regulatory Affairs experience</li>\n<li>Able to make judgment calls using combination of knowledge of regulations, knowledge of technology, critical thinking, and interpretation of intent of the regulations.</li>\n<li>Ability to drive results, foster teamwork, handle pressure, and provide feedback</li>\n<li>Able to apply extensive technical expertise and has full knowledge of other related disciplines.</li>\n<li>Ability to perform detail-oriented work with a high degree of accuracy.</li>\n<li>Proven ability to work cross-functionally in a team based environment.</li>\n<li>Proficient in MS Office Suite of products.</li>\n<li>Willingness to be flexible and adaptable to changing priorities.</li>\n<li>Excellent oral and written technical communication skills.</li>\n<li>Effective analytical and problem solving skills.</li>\n</ul>\n\nAt Danaher, we are dedicated to building and sustaining a truly diverse and inclusive culture. These are not just words on a pageDiversity and Inclusion is a top priority for the company, and it ties deeply to each of our core values. Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.\n\n\n<ul>\n<li>LI-TH1.</li>\n</ul>"}