{"job title": "Junior Data Scientist TS SCI", "company": "Radiant Solutions", "city state": "– US-VA-Herndon", "rating": "4.6", "job description": "Responsibilities<br><br>Radiant Solutions is growing and we are looking for motivated data evangelists who are passionate about delivering new and innovative solutions for our customers. The ideal candidate needs limited direction, is passionate about technology and is curious about earth sensing and the new space economy.\n<br><br>\nWhat you'll get to do;\n<br><br>\nYou will be applying the latest machine learning techniques to extract insights from geospatial data.\n<br><br>\nYou will have access to an enormous corpus of training data and will work to build the best models through bake-offs, hyperparameter searching, and incremental learning techniques.\n<br><br>\nYou will quantitatively assess model performance and document the overall life-cycle.You will work with other members of the data science and engineering teams to improve data science products and experiences.\n<br><br>\nAdditionally, you will be developing rapid prototype solutions as needed for the focused collection, parsing, managing, analyzing, and visualizing large sets of disparate data to extract meaningful insights.<br><br>Qualifications<br><br>What you'll need to have;\n\n<ul>\n\n <li>2-5 years' experience designing, implementing, training, evaluating, and optimizing algorithms based on state-of-the-art machine learning techniques</li>\n<li>Experience with applying deep learning for computer vision and natural language processing.</li>\n<li>Experience with major deep learning framework such as Caffe, CNTK, Theano, Torch, and Tensorflow.</li>\n<li><strong>Active TS/SCI</strong> (poly desired)</li>\n</ul>\n#cjpost<br><br>Overview<br><br>Join our company whose purpose is to help national security and commercial organizations understand and navigate our changing planet. Radiant Solutions provides multi-source data collection, enrichment, and analytic capabilities that reveal unique geospatial information and insights where and when it matters most.\n<br><br>\nNo other company has such strong roots in geospatial with our level of scale and a strong commercial mindset. We are well known for delivering innovative capabilities across the entire geospatial intelligence value chain. Our combined team of over 1,000 aerospace engineers, geospatial analysts, weather and ocean experts, software developers, data scientists, and DevOps engineers apply disruptive technologies and our unique intellectual property to both national security and commercial problems.\n<br><br>\nWe offer an excellent comprehensive benefits package including medical, dental, life, and short/long-term disability insurance, vacation and sick leave, 401(k) retirement plan, flexible spending account, and tuition assistance.\n<br><br>\nRadiant Solutions values diversity in the workplace and is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law."}