{"job title": "Data Engineer", "company": "Rakuten", "city state": "– San Mateo", "rating": "2.6", "job description": "<div><div><div><div><div><div>Rakuten, Inc. is the largest e-commerce company in Japan, and third largest e-commerce marketplace worldwide. Rakuten seeks to empower merchants to deliver Omotenashi, a hospitality mindset, which helps sellers create lasting relationships with customers.</div><br>\n<div>At Rakuten, we offer competitive salaries, benefits, annual bonuses, a stocked kitchen (including catered breakfast and lunch daily), and a dynamic office environment in San Mateo, CA. We love investing in our people and when it comes down to it, we think our entire team is pretty awesome. As a technology focused company, we understand the importance of an energizing atmosphere that promotes collaboration and innovation.</div><div></div><div><strong>The Role:</strong></div><div>Working as part of the Global Data Office you will be part of the team that provides data platform services and data science solutions at global scale. Leveraging diversity of data sources owned by Rakuten group companies, you will deliver technology to effectively collect, manage, and provide group-wide data. You will proactively identify business needs from various companies and implement advanced analytics solutions to create business value.</div><div></div><div><strong>Responsibilities:</strong></div>\n\n<ul>\n<li>Work with stakeholders throughout the organization to create and maintain highly scalable data pipelines and data systems</li><li>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and big data technologies</li><li>Build processes supporting data transformation, data structures, metadata, dependency and workload management</li><li>Standardize and implement solutions across Rakuten group in an efficient, scalable manner</li><li>Collaborate with business managers, engineers, and R&amp;D teams to effectively identify new opportunities and systemize development operations/process</li><li>Follow trends in modern technology and propose innovative approaches</li>\n</ul>\n\n<strong><div>Minimum Qualifications:</div>\n<br>\n</strong>\n\n<ul>\n<li>Bachelors/Masters in Computer Science or related field</li><li>5+ years of software development experience</li><li>Solid design skills and experience building end-to-end data pipeline solutions</li><li>Solid background in SQL, and programming languages like Python, Java, etc.</li><li>Knowledge of a variety of big data technologies (HDFS, Hive, Spark, Beam, Kafka, Storm, etc.) and their advantages/drawbacks</li><li>Knowledge of JSON, XML and Linux</li><li>Self-motivated, team-oriented, responsible, and reliable with a positive attitude and strong communication skills</li> \n</ul>\n\n<strong><div>Preferred Qualifications:</div>\n<br>\n</strong>\n\n<ul>\n<li>Strong analytic skills related to working with unstructured datasets</li><li>Knowledge of internationalization, character sets and locales</li><li>Excellent knowledge of object oriented development and API design</li></ul></div>\n</div>\n </div>\n </div>\n</div>\n<br>"}