{"job title": "Data Scientist", "company": "Rakuten", "city state": "– San Mateo", "rating": "2.5", "job description": "<div><div><div><div><div>Rakuten, Inc. is the largest e-commerce company in Japan, and\n<br>\nthird largest e-commerce marketplace worldwide. Rakuten seeks to empower\n<br>\nmerchants to deliver Omotenashi, a hospitality mindset, which helps sellers\n<br>\ncreate lasting relationships with customers.\n<br><br>\nAt Rakuten, we offer competitive salaries, benefits, annual\n<br>\nbonuses, a stocked kitchen (including catered breakfast and lunch daily), and a\n<br>\ndynamic office environment in San Mateo, CA. We love investing in our people\n<br>\nand when it comes down to it, we think our entire team is pretty awesome. As a\n<br>\ntechnology focused company, we understand the importance of an energizing\n<br>\natmosphere that promotes collaboration and innovation.\n<br><br>\n<strong>The Role:</strong>\n<br><br>\nWorking as part of\n<br>\nthe Global Data Office you will be part of the team that provides data science\n<br>\nsolutions and data platform services at global scale. Leveraging diversity of data sources owned\n<br>\nby Rakuten group companies, you will deliver technology to effectively collect,\n<br>\nmanage, and provide group-wide data. You will proactively identify business\n<br>\nneeds from various companies and implement advanced analytics solutions to\n<br>\ncreate business value.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\n· Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.\n<br><br>\n· Retrieve data required for analyses from internal/external sources while ensuring data quality\n<br><br>\n· Perform statistical analyses and build machine-learning models to deliver insights\n<br><br>\n· Prioritize data science solutions development opportunities to create maximum business value\n<br><br>\n· Build and test solution prototypes to demonstrate potential value to management\n<br><br>\n· Standardize and implement solutions across Rakuten group in an efficient, scalable manner\n<br><br>\n· Collaborate with business managers, engineers, and R&amp;D teams to effectively identify new opportunities and systemize development operations/process\n<br><br>\n· Follow trends in modern technology (AI) and propose innovative approaches\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<br><br>\n· Masters in Computer Science, Mathematics, Statistics, or related field\n<br><br>\n· 2+ years of experience as a data scientist\n<br><br>\n· Experience building end-to-end data pipeline solutions.\n<br><br>\n· Solid background in SQL, and a statistical computer language (Python, R).\n<br><br>\n· Knowledge of a variety of machine learning techniques (GLM/regression, decision tree learning, boosting, deep neural networks, text mining, etc.) and their advantages/drawbacks\n<br><br>\n· Ability to identify, summarize, and visualize business issues\n<br><br>\n· Self-motivated, team-oriented, responsible, and reliable with a positive attitude and strong communication skills\n<br><br>\n<strong>Preferred Qualifications:</strong>\n<br><br>\n· PhD in Computer Science, Physics, Mathematics, Statistics, Engineering, or relevant field\n<br><br>\n· Vast experience in industry application of statistics for data analysis (hypothesis testing, Bayesian analysis, time series analysis, experimental design, power and sample sizes, etc.)\n<br><br>\n· Experience with big data tools (Hadoop, Hive, etc.)\n<br><br>\nAny unsolicited resumes/candidate profiles submitted through our website or to personal email accounts of employees of Rakuten USA are considered property of Rakuten USA and are not subject to payment of agency fees.</div>\n</div>\n </div>\n </div>\n</div>\n<br>"}