{"job title": "Research Scientist", "company": "Randstad Life Sciences", "city state": "– North Chicago, IL", "rating": "NA", "job description": "<strong>job summary:</strong>\n\n\n<ul>\n<li>We are seeking a highly talented and motivated Associate Scientist II to join our High Throughput Screening (HTS) group.</li><li>The HTS group focuses on assay development, optimization, and execution of in vitro biochemical and cell based screens in collaboration with multiple therapeutic areas.</li>\n</ul>\n\nlocation: North Chicago, Illinois\n<br><br>\njob type: Contract\n<br><br>\nsalary: $25.00 - 27.94 per hour\n<br><br>\nwork hours: 9 to 5\n<br><br>\neducation: Bachelors\n<br><br>\n<strong>responsibilities:</strong>\n\n\n<ul>\n<li>The successful candidate will be responsible for executing robust in vitro screens (biochemical and cell-based) and delivering high quality data utilizing common HTS tools as well as novel approaches.</li><li>In this role, the Scientist will work closely with HTS and project team members to implement in vitro screening strategies as part of the overall project plan.</li><li>In addition, the preferred candidates skills should complement the groups emphasis on complex disease relevant cellular and phenotypic assay formats.</li><li>The Scientist will partner closely with project team leads to develop relevant cellular models and assay readouts.</li><li>The candidate should play an active role in communicating and collaborating with scientists across Company to advance projects through day to day interactions, presentation of data, and interpretation of results.</li><li>The Scientist must be capable of working independently while contributing and participating in a team environment and must have excellent oral and written communication skills.</li>\n</ul>\n\n<strong>qualifications:</strong>\n\n\n<ul>\n<li>Masters Degree or Bachelors Degree in Biology, Biochemistry, Pharmacology, Enzymology or related field with 2+ years of prior experience in a drug discovery laboratory setting working as part of a multi-disciplinary team</li><li>Strong scientific foundation in the understanding and implementation of a wide range of biochemical and cell-based assays and readouts</li><li>Able to think critically and creatively across multiple disciplines and have demonstrated the ability to solve research problems with experience in standard in vitro assays (e.g. HTRF, FP, ELISA, FLIPR etc.), including assay development, optimization, and troubleshooting</li><li>Adaptability and the ability to rapidly learn new techniques</li><li>Able to analyze and report data concisely and rigorously</li><li>Ability to multi-task and successfully interact with a diverse team of scientists to deliver results meeting the needs of various stakeholder groups</li> <li>Preferred Experience:\n\n<ul>\n<li>Computational skills enabling automated data acquisition and analysis, and familiarity with related software applications (MS Access, Spotfire)</li><li>Experience in cell culture and cell based assay development</li><li>Familiarity in the use of automation and HTS instrumentation</li></ul></li>\n</ul>\n\nskills: Assay Development, Assay Method, Assay Verification<br><br>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<br><br>Company Description:<br><br>Randstad is a $22.5 billion global provider of HR services and the second largest staffing organization in the world. From temporary staffing to permanent placement to in-house, professionals, search &amp; selection, and HR Solutions, Randstad holds top positions around the world and has approximately 31,100 corporate employees working from its nearly 4,700 branches and in-house locations in 40 countries.\n<br><br>\nWe are a company built on a deep network of expertise that crosses industries and geographies. We recognize that talent comes in different forms, that every business has its unique challenges and opportunities. And our recruiting experts are skilled at marrying talent and business—identifying the ideal professionals for an organization’s culture and its teams, its needs and its goals."}