{"job title": "Data Engineer - Req", "company": "Raymond James", "city state": "– Saint Petersburg, FL", "rating": "3.7", "job description": "Description\n<br><br>\n<strong>About Us:</strong>\n<br><br>\nFounded in 1962, Raymond James Financial, Inc. is a Fortune 500 diversified holding company providing financial services to individuals, corporations and municipalities through its subsidiary companies engaged primarily in investment and financial planning, in addition to capital markets and asset management. Headquartered in Florida, Raymond James Financial has approximately 7,500 financial advisors in 3,000 locations throughout the United States, Canada and overseas. With 119 consecutive quarters of growth and Service 1st culture, Raymond James Financial aims to be the premier alternative to Wall Street.\n<br><br>\nThis position can be based out of either of these locations- St. Petersburg, FL, New York City, Denver, CO.\n<br><br>\n<strong>About the role:</strong>\n<br><br>\nData Engineer works in the Data Engineering team and has primary responsibility of building Enterprise Data Integration solutions by working on enterprise class data integration initiatives. The Data Engineer will be responsible for building solutions which are flexible, performant and scalable. Demonstrates subject matter expertise and is able to integrate domain knowledge with an understanding of overall strategy and impact. Data Engineer is the primary on the most complex or escalated issues and may provide direction, guidance and mentoring to team members. Applies specialized business knowledge and technical skills to significant deliverables and projects that involve multiple IT departments, business units that have enterprise impact. Data Engineer should be able to explore newer technology options, if need be, and must have a high sense of ownership over every deliverable.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Builds scalable and reliable Data Integration solutions which are flexible, scalable and elastic.</li>\n<li>Develops low latency Data Integration solutions to provision data near real time for multiple consumers.</li>\n<li>Collaborates with Data Engineers, Data Architects and Service developers to build optimal and efficient ETL and Database code.</li>\n<li>Produces dynamic, data driven solutions to support the strategic business goals.</li>\n<li>Focus on designing, building, and launching efficient and reliable data infrastructure to scale and compute to meet business objectives.</li>\n<li>Help develop an enterprise scale Data Lake</li>\n<li>Design and develop new systems and tools to enable folks to consume and understand data faster</li>\n<li>Supports ETL Batch processing.</li>\n<li>Provides on-call support of Data Integration Batch processes on a rotating basis and other on-call as required.</li>\n<li>Produces dynamic, data driven solutions to support the strategic business goals.</li>\n<li>Performs other duties and responsibilities as assigned.</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>EXPERIENCE PREFERRED/REQUIRED</strong>\n\n\n<ul>\n<li>Minimum of a Bachelor's degree in Computer Science, MIS or related degree and seven (7) years of relevant development or engineering experience or combination of education, training and experience.</li>\n<li>Expert/Advanced level experience with ETL Tools, ODI preferably.</li>\n<li>Expert Level experience with Oracle as a Database Platform.</li>\n<li>Deep experience in SQL tuning, tuning ETL solutions, physical optimization of databases.</li>\n<li>Experience or understanding of programming languages like Python, Java, R etc.</li>\n<li>Experience or understanding of Big Data Platforms.</li>\n<li>Financial Services Industry knowledge is a plus.</li>\n<li>May occasionally work a non-standard shift including nights and/or weekends and/or have on-call responsibilities.</li>\n</ul>\n\n<strong>Licenses/Certifications:</strong>\n\n\n<ul>\n<li>None required.</li>\n</ul>\n\n<strong>COMPETENCIES</strong>\n\n\n<ul>\n<li>Analysis: Identify and understand issues, problems and opportunities; compare data from different sources to draw conclusions.</li>\n<li>Communication: Clearly convey information and ideas through a variety of media to individuals or groups in a manner that engages the audience and helps them understand and retain the message.</li>\n<li>Exercising Judgment and Decision Making: Use effective approaches for choosing a course of action or developing appropriate solutions; recommend or take action that is consistent with available facts, constraints and probable consequences.</li>\n<li>Technical and Professional Knowledge: Demonstrate a satisfactory level of technical and professional skill or knowledge in position-related areas; remains current with developments and trends in areas of expertise.</li>\n<li>Building Effective Relationships: Develop and use collaborative relationships to facilitate the accomplishment of work goals.</li>\n<li>Client Focus: Make internal and external clients and their needs a primary focus of actions; develop and sustain productive client relationships.</li>\n</ul>"}