{"job title": "Data Scientist", "company": "Raytheon", "city state": "– Dulles, Virginia", "rating": "3.7", "job description": "<strong>Cyber Security Data Scientist</strong>\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nRaytheon is searching for a Data Scientist who will support our programs design and development teams for our DHS customer. The data scientist must be an expert in the cyber security industry and preferable have experience with data analytics and business intelligence. The ideal candidate is adept with big data, data analysis and data migration for structured and unstructured data in both SQL and NoSQL data stores. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to successfully accomplish our mission.\n<br><br>\n<strong>Responsibilities:</strong>\n<ul>\n<li>Interface with multiple teams, our customer and stakeholders regarding cyber security data science</li><li>Analyze how cyber security data is gathered, stored and used within cyber security organizations</li><li>Run advanced statistics on cyber security data using probabilities, regressions, quantitative and categorical methodologies</li> <li>Create white papers and trade studies for cyber security, data analytics and business intelligence industries</li> <li>Understand and predict data trends and patterns in the cyber security industry</li><li>Work closely with our data analytics teams to create analytics and visualization solutions</li>\n</ul>\n\n<strong>Required Skills:</strong>\n\n<ul>\n<li>Must have a Top Secret Clearance with SCI Eligibility (SSBI within the last 5 years)</li><li>U.S. Citizenship required</li><li>Must have a cyber security background, with an understanding of how data is gathered, stored and used in within cyber security organizations</li><li>Understand and predict data trends and patterns in the cyber security industry</li><li>Extensive experience analyzing cyber security data</li><li>Java and Python programming</li><li>PL/SQL, T-SQL scripts and procedures</li><li>Oracle, Hadoop, Solr and Elasticsearch</li><li>JBOSS, Apache, RESTful services and SOAP</li><li>Windows, RHEL and VMWare</li><li>Big data ingest, storage and migration</li><li>Relational DBMS and Lucene reverse indexing schema creation</li><li>Data architecture, federation &amp; mining</li><li>Data statistics and analysis using R, Python, etc.</li><li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.)</li><li>Experience supporting a technology strategy / roadmap</li><li>Possess great communication skills, both oral and written</li><li>Must work well in an agile team environment as well as independently</li><li>Must exhibit good time management skills, independent decision making capability; focus on customer service</li><li>Ability to work with peers, management and stakeholders to successfully meet our customers mission</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n<ul>\n<li>Experience data engineering support to DHS, DOD or intelligence Customers</li><li>Previously been a cyber security analyst for at least 5 years</li><li>Previously been a data scientist for at least 7 years</li><li>Data analytics and business intelligence experience for at least 5 years</li><li>Understanding of Certification and Accreditation (NIST 800-53) processes as they apply to database technologies</li><li>Big data experience with both SQL and NoSQL data stores for at least 7 years</li><li>Experience with Map/Reduce technologies</li><li>Experience with business process development and deployment</li><li>Trained in Six Sigma methodology</li><li>ITIL knowledge and certification</li>\n</ul>\n\n<strong>Required Certifications:</strong>\n\n<ul>\n<li>DODI 8570.1 Compliance at IAT Level II certification (GSEC, CompTIA Security+, SCNP or SSCP)</li>\n</ul>\n\n<strong>Desired Certifications:</strong>\n\n<ul>\n<li>DODI 8570.1 Compliance at IAT Level III certification (CISA, GSE, SCNA, CISSP (or Associate) or GCIH)</li><li>Cloudera Certified Professional (CCP): Data Scientist</li><li>CCDH: Cloudera Certified Developer for Apache Hadoop</li><li>CCAH: Cloudera Certified Administrator for Apache Hadoop</li><li>CCSHB: Cloudera Certified Specialist in Apache HBase</li><li>CSSLP Certified Secure Software Lifecycle Professional</li>\n</ul>\n\n<strong>Required Education &amp; Experience:</strong>\n\n<ul>\n<li>Minimum of 22 years of related experience without a BS/BA in a related field</li><li>Minimum of 10 years of related experience with a BS/BA in a related field</li><li>Minimum of 8 years of related experience with a MS/MA in a related field</li><li>Minimum of 6 years of related experience with a PhD in a related field</li>\n</ul>\nCybersecurity &amp; Special Missions (CSM) provides cybersecurity and advanced intelligence solutions that strengthen our global customers' critical infrastructures, information systems and mission.\n<br><br>\nDOMinoIIS<br><br>113692<br><br>Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}