{"job title": "Data Scientist, RBC Amplify", "company": "RBC", "city state": "– Jersey City, New Jersey", "rating": "3.7", "job description": "<p><strong>What is Amplify? </strong></p><p> </p><p>RBC Amplify is an intensive summer innovation program that will push you to solve real business challenges that could disrupt our company and beyond. If youre a bright mind with fresh ideas, top of your class, own the hackathon circuit and are passionate about innovation, we want you!</p><p> </p><p><strong>What is the opportunity?</strong></p><p> </p><p>As a Data Scientist you will collaborate, innovate, ideate and build in a flexible, start-up environment.</p><p>You will tackle real RBC business challenges as a member of a cross-functional team of specialists (think: business, UX/UI design, big data, and programming) by developing a product that you pitch to stakeholders at the end of the summer.</p><p>Over the course of the program you will have access to subject matter experts, coaches, mentors, as well as technical and professional training to bring your idea to life.</p><p> </p><p><strong>What will you do?</strong></p><p> </p><ul><li>Immerse yourself in a business challenge with an intense focus on collaboration to develop an innovative product.</li><li>You will be challenged to step outside your comfort zone, and bring your teamwork, communication and collaboration skills to help your team succeed.</li><li>You will be expected to design, create and deliver a fully functional prototype to RBC that solves a real business need.</li><li>You will play an integral role in engaging your critical thinking, time management and leadership skills within your team.</li><li>Design, troubleshoot and develop your product.</li><li>Work with subject matter experts, mentors, executive sponsors (technology and business) to build your product.</li><li>Exposure to design thinking, agile development and other tools, technologies and methodologies.</li><li>Executive presentations, developing strategy and communications for your project.</li></ul><p> </p><p><strong>What do you need to succeed?</strong></p><p> </p><p><strong>Must have</strong></p><ul><li><strong>Must be currently enrolled in a post-secondary institution, graduating between August 2019 and June 2020 (College, Undergrad, Master's or PhD).</strong></li><li>Familiarity with statistical methods.</li><li>Programming skills and knowledge of Python and R languages.</li><li>Familiarity with data cleaning, data mining, and machine learning.</li><li>Excellent interpersonal and highly developed communication skills (verbal and written).</li><li>Creative and analytical thinker who is self-driven and capable of working in a fast paced environment.</li><li>Excellent teamwork and collaboration skills.</li><li>Ability to challenge the status quo, and think outside the box to develop solutions.</li></ul><p> </p><p><strong>AND one or more of the following: </strong></p><ul><li>Experience with deep-dive analytics, predictive modelling or algorithms.</li><li>Experience with machine learning, pattern intelligence, computational mathematics, bioinformatics or artificial intelligence.</li><li>Experience with natural language processing.</li></ul><p> </p><p><strong>Nice to have</strong></p><ul><li>Experience with hackathons.</li><li>Expressed interest or previous experience in the financial industry or FinTech.</li><li>Practical experience in web or mobile development.</li><li>Experience in agile or design thinking methodologies or frameworks.</li></ul><p> </p><p><strong>Whats in it for you?</strong></p><p> </p><ul><li>A unique summer experience with the chance to develop a career at RBC.</li><li>Team up with students from diverse backgrounds and build lasting professional relationships.</li><li>Engage with leaders who support your development through coaching and learning opportunities.</li><li>Be a part of a dynamic, collaborative, progressive and high-performing team.</li><li>Contribute to real projects that can make a difference and have a lasting impact at RBC.</li><li>Tons of opportunity to grow specific skills for your future</li><li>An all-around fun, innovative, and comfortable work environment where casual clothing is the norm.</li></ul><p> </p><p><strong>Amplify2019</strong></p><p><strong>Inclusion and Equal Opportunity Employment</strong></p><p> </p><p><strong>RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally-protected factors. Disability-related accommodations during the application process are available upon request.</strong></p>"}