{"job title": "Biophysical Scientist I SPR", "company": "Reaction Biology", "city state": "– Malvern, PA", "rating": "3.2", "job description": "<strong>POSITION DESCRIPTION:</strong>\n<br><br>\nReaction Biology Corp (RBC), a Malvern PA - based pharmaceutical research company, seeks a scientist with experience in SPR analysis\n<br><br>\n<strong>JOB RESPONSIBILITIES:</strong>\n\n<ul>\n<li>Complete various SPR assays for external customers with high-quality data and in a time-efficient manner</li>\n\n<li>Establish new SPR assay platforms</li>\n\n<li>Mange multiple projects and deliver timely results</li>\n\n<li>Interact directly with customers in order to understand their requests, to trouble shoot assay problems and to propose/pursue solutions</li>\n\n<li>Screen and characterize small molecule compounds and determine the mode of compound action</li>\n\n<li>Be able to utilize literature and internal data sets to design and test target modulation hypotheses</li>\n</ul>\n<strong>REQUIRED KNOWLEDGE, SKILLS, AND ABILITIES:</strong>\n\n<ul>\n<li>MS or equivalent in biochemistry and biophysics or related discipline, with 3+ years of SPR working experience</li>\n\n<li>PhD or equivalent in biochemistry and biophysics or related discipline, with 1+ years of SPR working experience</li>\n\n<li>Demonstrated in-depth understanding of SPR theory and proficiency in assay development, optimization, kinetic profiling and library screening of small molecules</li>\n\n<li>Attention to detail</li>\n\n<li>Collaborative and proactive attitude with excellent written and oral communication skills</li>\n\n<li>Flexibility to accommodate rapidly changing priorities and deadline</li>\n\n<li>Ability to work in a team-based environment</li>\n</ul>\nThe work environment is casual; however, professional behavior, a collaborative attitude, attention to detail and the ability to meet deadlines are absolute requirements.\n<br><br>\nFinally, all employees are obligated to meet the highest standards with respect to honesty, accuracy, conflict of interest, intellectual property rights, confidentiality and respect for information sources and readers.\n<br><br>\nReaction Biology Corporation (RBC), located in Malvern, PA, is a contract biomedical research organization (CRO) with proprietary technology. Benefits include health insurance, 401-K plan, stock options and paid vacations. RBC is an equal opportunity employer."}