{"job title": "Research Scientist – Biophysical Assays", "company": "Reaction Biology Corp", "city state": "– Malvern, PA", "rating": "3.2", "job description": "Job Description<br><br>Reaction Biology Corp (RBC), a Malvern PA - based pharmaceutical research company, seeks a scientist with experience in biophysical analysis<br><br> <br><br>Principal Responsibilities:<br><br>• With minimum of supervision, the candidate should be able to design, develop and execute a variety of biophysical based assays, including SPR, ITC, Thermal shift etc.<br><br>• Independently design and elucidate small molecules’ mechanism of actions towards a variety of biological targets. <br><br>• Interact directly with customers to understand their requests, trouble shoot assay problems and propose/pursue solutions.<br><br>• Screen and characterize small molecule compounds and determine the mode of compound action.<br><br>• Be able to utilize literature and internal data sets to design and test target modulation hypotheses.<br><br>• <br><br>Qualifications:<br><br>• MS or equivalent in biochemistry and biophysics or related discipline<br><br>• With 3+ years of working experience<br><br>• Ideal candidate would have demonstrated proficiency in assay development, optimization, and screening with small molecules.<br><br>• Attention to detail, and organization skills are critical<br><br>• Collaborative and proactive attitude with excellent written and oral communication skills<br><br>• Flexibility to accommodate to rapidly changing priorities and deadline<br><br>• Ability to work in a team-based environment<br><br><br>The work environment is casual; however, professional behavior, a collaborative attitude, attention to detail and the ability to meet deadlines are absolute requirements.<br><br>Finally, all employees are obligated to meet the highest standards with respect to honesty, accuracy, conflict of interest, intellectual property rights, confidentiality and respect for information sources and readers."}