{"job title": "Data Scientist (Senior - Principal levels)", "company": "realtor.com", "city state": "– Santa Clara, CA", "rating": "3.7", "job description": "<div>\n<strong>At realtor.com, we process terabytes of data every day, and transform that data into information that powers decisions for millions of home buyers, renters, dreamers, and real estate professionals. We aim to radically simplify home buying/selling and help more people achieve the American dream on our realtor.com website and mobile apps.</strong></div><br>\n\n<div>\n<div>We seek a very seasoned<strong> Data Scientist</strong> with lead experience to join our budding data science program and develop it to its full potential. As a key member of the data product team, you will be responsible for the development of innovative concepts, research, predictive modeling, and machine learning algorithms. You will serve as a mentor for the junior data scientists on the team and provide oversight on their individual projects.</div><br>\n\n<div><strong>Responsibilities:</strong></div>\n<ul>\n<li>Perform exploratory analysis on Move's wealth of data including consumer web and mobile behavior and North America's most comprehensive and up-to-date listings and properties data set.</li>\n<li>Effectively partner with product and engineering teams to build new data driven and machine learning based features in our professional software and lead monetization products to enable real state professionals be more productive and effective in serving the needs of home shoppers.</li>\n<li>Help improve the scope our datasets by identifying new data collection and procurement opportunities on an ongoing basis</li>\n<li>Drive A/B, multivariate tests and design of experiments to facilitate testing of new product and design features, with focus on improving engagement, retention, and conversion.</li>\n<li>Select, apply, and tune a diverse set of tools to coherently solve challenging business goals</li>\n<li>Create automated learning systems that gracefully scale to increasing complexity and expectation</li>\n<li>Develop predictive, explanatory models and machine learning algorithms</li>\n<li>Generate descriptive visualizations and presentations to communicate insights</li>\n<li>Mentor a team of data scientists on data exploration, machine learning and developing data-based products</li>\n<li>Work with a sense of ownership and urgency, advocate for experimentation based, agile culture.</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>MS or PhD in statistics, mathematics, computer science, quantitative analysis, economics or related field is required.</li>\n<li>7+ years of relevant experience in data science, data analytics, or applied statistics,</li>\n<li>5+ years experience with machine learning, data mining, statistical modeling tools and underlying algorithms</li>\n<li>5+ years' experience in R, Perl, Python, Spark, or other languages and frameworks appropriate for large scale analysis of numerical, textual, image, and video data</li>\n<li>Strong skills in data gathering, massaging and featurization</li>\n<li>Working experience with relational databases and SQL</li>\n<li>Experience with experiment design and A/B and multivariate tests</li>\n<li>Experience and proven track record developing online data products</li>\n<li>Strong creative thinking and problem solving skills</li>\n<li>Excellent oral and written communication and presentation skills</li> \n</ul>\n#LI-JM2</div>\n<br>"}