{"job title": "Data Scientist", "company": "Recorded Future", "city state": "– Boston, MA", "rating": "3.9", "job description": "Want to be part of shaping the future? Our breakthrough ability to unlock insights from the web radically improves intelligence and cyber threat visibility for our commercial customers. We're a high-energy, fast-paced, and fast-growing company. You'll need the ability to understand and adapt to rapid product and technology developments, as we improve our products in close partnership with customers. You'll have the support of a seasoned executive management team and world-class investors.\n<br><br>\n<strong>This Role:</strong>\n<br><br>\nRecorded Future is a guardian of the internet. We defend against cyber attacks by analyzing the open web, deep web, and dark web. Our harvesting pipeline reads over 700,000 web sources, and our real-time multilingual natural language processing technology takes that content from raw text to alerts and visualizations in minutes.\n<br><br>\nThe Data Science team takes ownership of this unique dataset. We're looking to implement the next level of language modeling in our data with techniques like word2vec and semantic entity analysis. We're looking for smart and ambitious people with a strong engineering foundation and a quantitative mindset to help us take this on. You will join a team of motivated people working on a tough problem, and help us shine a light into the dark corners of the internet.\n<br><br>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Technical education: BA, BS, MS, or PhD in Computer Science or related discipline, with a strong academic record.</li>\n<li>Natural language processing: Experience with word2vec, Glove embeddings, or similar techniques. You love finding meaning in massive quantities of text data connected to real human problems and you know how to write the code that makes that happen.</li>\n<li>Programming: Solid Python programming and comfort with developing production code.</li>\n<li>Excellent communication: Your clarity of thought is always apparent in your crisp and articulate emails, Slack chats, phone calls, and in-person conversations.</li>\n<li>Bonus if you have experience or interest in the area of cybersecurity.</li> \n</ul>\nWe realize we can only succeed with a team of very smart and passionate people. If you're looking to work in a unique environment with ambitious, dedicated colleagues, the chance to collaborate with fantastic users and customers, then we have a lot in common! You'll also be equipped with top technology, enjoy trips, \"the best\" coffee, great food and fun. We offer competitive compensation, including stock options and a full range of benefits, as well as a great culture, commitment to professional development and social responsibility.\n<br><br>\n<strong>Don't forget to check out our Podcast!</strong> Join the Recorded Future team, special guests, and our partners from the CyberWire to learn everything you want to know (and maybe some things you'd rather not know) about the world of cyber threat intelligence. All episodes are free and available on iTunes, GooglePlay, and Stitcher."}