{"job title": "Data Scientist, Machine Learning", "company": "Recurly", "city state": "– San Francisco, California", "rating": "3.9", "job description": "Recurly is a well established technology driven SaaS based company in the recurring billing space. As a data scientist at Recurly, you get to collaborate with a team of talented data scientist &amp; analysts, product managers, engineers, and marketing managers to deliver innovative product solutions and research that will continue to solidify Recurly’s market position. Not only will you explore, connect, and produce insights with our data to grow Recurly’s business, but you will also build models and algorithms that get incorporated into our core product offering. There is a lot more we can do with the volume of data we have, and you’ll play a key role from conception to launch.\n<br><br>\nAs a data scientist at Recurly, you get to collaborate with a team of talented data scientist &amp; analysts, product managers, engineers, and marketing managers to deliver innovative product solutions and research that will continue to solidify Recurly’s market position. Not only will you explore, connect, and produce insights with our data to grow Recurly’s business, but you will also build models and algorithms that get incorporated into our core product offering. There is a lot more we can do with the volume of data we have, and you’ll play a key role from conception to launch.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Collaborate with engineers and product managers to produce statistical models and algorithms that get incorporated into our product. Here’s an example of something we launched recently: https://blog.recurly.com/using-machine-learning-to-optimize-subscription-billing</li>\n<li>Solve internal and external business problems by reframing them to enable algorithmic solutions; have a keen eye towards automating the process and output for common topics.</li>\n<li>Understand the breadth and depth of Recurly’s data set to create internal and external facing analyses and insights.</li>\n<li>Be a champion of data hygiene and establish processes to ensure high data integrity and quality.</li> \n\n<li>Publish blog posts and research articles; represent Recurly in public speaking engagements and business reviews with merchants.</li>\n<li>Drive growth with business results in mind, not analysis for analysis sake.</li>\n<li>Mentor and collaborate with other team members to grow our internal domain knowledge.</li>\n<li>Be an expert on subscription business related metrics and champion those metrics within the company.</li> \n\n<li>Identify patterns, troubleshoot issues, and have a holistic understanding of Recurly’s data structure.</li>\n<li>Continually refine business acumen and establish domain / industry vertical expertise.</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>Masters in a quantitative field (e.g. Data Science,Statistics, Operations Research, Computer Science, Mathematics).</li>\n<li>At least 3 to 5 years of relevant working experience, with at least 3 years as a data scientist.</li>\n<li>Experience building production grade Machine Learning models and deploying those models into production.</li>\n<li>Strong written and verbal communication skills.</li>\n<li>Expert knowledge and demonstrable experience with Python or R and SQL.</li>\n<li>Strong user empathy to understand the real question behind a business request.</li>\n<li>Experience and awareness of multiple statistical models and know when to apply one and not the other. Ability to explain why is key.</li>\n<li>Experience in leveraging proper data to communicate insights in an easy to understand manner.</li>\n<li>Know how to prioritize work and have the intuition to avoid analysis paralysis.</li>\n<li>Team oriented and able to collaborate with other stakeholders within the company to take an idea from conception to launch.</li>\n</ul>\n<strong> Preferences</strong>\n\n<ul>\n<li>Background in fintech and subscription businesses, as well as credit card and alternative payment method transactions.</li>\n<li>Working knowledge of Redshift, Git, AWS, and Scala.</li>\n<li>PhD in Statistics or Computer Science with a Machine Learning focus.</li>\n</ul>\n<strong>About Recurly</strong>\n<br><br>\nRecurly, Inc. provides enterprise-class recurring billing management for thousands of subscription-based SaaS, Media, Digital Service, Data Publishing, and many horizontal businesses worldwide. Businesses like AccuWeather, Sling.tv, Groupon, JibJab Media, HubSpot, Asana, LinkedIn, and Zillow depend on Recurly’s ability to deliver recurring billing automation. Since its launch in January of 2010, Recurly has deployed subscription billing for thousands of companies throughout North America and Europe. Recurly, Inc. is PCI-DSS Level 1, SAS 70 / SSAE 16 Compliant, and operates in compliance with the data protection practices outlined in the E.U. Safe Harbor Agreement. To learn more about us visit https://recurly.com/"}