{"job title": "Data Scientist", "company": "Red Arch Solutions", "city state": "– DC", "rating": "4.9", "job description": "***Active SECRET Clearance Required***\n<br><br>\nRed Arch Solutions is a proven and effective small business integrator and consultant, recognized as a leading provider of IT development to the Federal Government, and primarily focused within the Intelligence Community.\n<br><br>\nRed Arch is seeking a Data Scientist to support the Defense Intelligence Agency.\n<br><br>\nThe scope of this contract relates to the management of an Agile development of an Integrated Mission Management (IMM) Framework. The effort will require the decomposition of requirements into weighted user stories that the software team can use; the examination of existing databases; and the orchestration (standing up and closing down) of the SCRUMS.\n<br><br>\n<strong>Responsibilities/Job Function</strong>\n<ul>\n<li>Responsible for all data management and administration. This includes the successful execution of all data management and all relevant data operations including data migration, master data management, data clean up, and establishing quality expectations.</li><li>Support daily scrum, sprint planning, sprint demo, and and retrospective meetings.</li><li>Support the development of the data management layer and a multi-echelon ISR global exchange of metadata and data between service Intelligence Centers, CCMDs, and the Distributed Common Ground System using approved enterprise standards.</li><li>Manage the data holdings within the IMM framework so that they are discoverable via API and represented in a catalog of holding that will also provide details on schemas and field meanings (e.g. data definition).</li><li>Respond to Requests for Support and deliver support to IMM mission partners.</li><li>Provide data-source, data-integration, and data sciences support to enable applied analytical capabilities.</li><li>Support the design of a methodology and continuously improve the acquisition and integration of IMM related data sources for ingestion into the IMM DaaS component.</li><li>Identify IMM supporting data sources and provide advice, guidance, tracking, reporting, and technical solutions for ingestion.</li><li>Document the operational processes that are a part of Mission IT systems, tools, and applications. This includes development and maintenance of procedures associated with data interfacing, ingestion, migration, data cleansing, deprecation, etc.</li></ul>\n\n<ul>\n<li>Mandatory Security Clearance Requirement: SECRET</li><li>Knowledge of agile methodology and frameworks like SCRUM, Kanban, SAFe, etc.</li><li>Experience writing code in languages such as Python, Java, and Pearl</li><li>Good communications skills</li><li>A Bachelor’s Degree from an accredited institute in an area applicable to this position (e.g. information systems, computer science, math, or engineering) and eight (8) years of relevant technical experience</li>\n\n<ul>\n<li>An additional four (4) years of relevant technical experience may be substituted for the Bachelor’s Degree</li></ul></ul>\n\n<ul>\n<li>Certified Analytics Professional</li>\n</ul>\n<strong>Red Arch Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, national origin, age, marital status, disability, or protected veteran status. Red Arch Solutions takes affirmative action in support of its policy to advance in employment individuals who are minorities, women, protected veterans and individuals with disabilities.</strong>"}