{"job title": "Data Scientist", "company": "Red Circle", "city state": "– Chicago, IL, US", "rating": "4.2", "job description": "<div>\nFetch is a Madison, Wisconsin-based technology company located in the heart of downtown Madison. Our company currently provides two mobile applications in the mobile grocery market - Shop Fetch and Fetch Rewards - in both the Android and iOS platforms. The mission of Fetch is to provide easy access to the information and technology necessary for people to enjoy every stage in the life of food (inspiration, planning, purchasing, preparation, and of course ... eating). Founded in 2013 and growing, Fetch is looking for a Data Scientist to help us change how large consumer brands engage with consumers.</div><br>\n\n<div>\n<strong>Job Description</strong>\n</div>\n<br>\n<div>\nThe Data Scientist will work closely with the VP of Analytics to ensure our projects are successfully implemented. They will partner with the Client Service teams to help create Analytical Solutions that help our clients get rich insights from our unique data repositories that include Fetch app usage data, shopper transaction data and other shopper / product dimensions. They will be a key member of our analytics team, conceptualizing and carrying out analyses that demonstrate the datas value and building algorithms that elevate the platform. Success in this role requires a driven problem-solver that is prepared to design and develop solutions.</div><br>\n\n<div>\n<strong>Some of what you will be doing</strong>\n</div>\n\n<ul>\n\n<li>\nCreate Python programming modules for custom insights required by our clients. Leverage statistical analysis to understand what is acceptable versus outliers.</li>\n<li>\nDrive actionable insights from data and present them through client-facing Tableau and/or Microsoft Powerpoint in a compelling manner</li>\n<li>\nContribute to Data Exploration needed to enhance the cleanliness and effectiveness of our data sources</li>\n<li>\nCreate well documented coding and analytics packets to ensure reusability as the team expands.</li>\n<li>\nContribute to Analytics Data Management by understanding and implementing the right level of summary tables needed to answer repeated business questions, working off Big Data platforms like Spark, AWS, etc.</li>\n</ul>\n\n<br>\n<div>\n<strong>A snapshot of what you have done of the last couple years</strong>\n</div>\n\n<ul>\n\n<li>\nProgramming skills in Python</li>\n<li>\nIndustry experience within the Retail/CPG/Shopper domain and data</li> \n<li>\nFamiliarity with the works of Spark, AWS S3</li> \n<li>\nFamiliarity with the Retail/CPG/Shopper domain and data</li> \n<li>\nFamiliarity with Tableau or experience with any other visualization tool</li> \n<li>\nComfortable working in a fast-paced environment</li>\n<li>\nStrong written/verbal communication and presentation skills.</li>\n</ul>"}