{"job title": "Data Scientist", "company": "Red Gate Group LTD", "city state": "– Reston, VA", "rating": "4.3", "job description": "<strong>POSITION:</strong> Data Scientist\n<br><br>\n<strong>LOCATION:</strong> Reston, VA\n<br><br>\n<strong>DEPARTMENT</strong><strong>:</strong> JIDO\n<br><br>\n<strong>CLEARANCE:</strong> Active TOP SECRET with Sensitive Compartmented Information (SCI) access\n<br><br>\n<strong>Description</strong>\n<br><br>\n- Develop and operationalize innovative Big Data software solutions in direct support of an unconventional warfare client.\n<br><br>\n- Perform as a data scientist, helping the team on a distributed scalable Big Data store, including Apache Accumulo, Apache Hadoop, MapReduce programming and technologies, and real-time data processing with Apache Spark.\n<br><br>\n- Participate in the development of machine learning, data mining, and statistical or graph-based algorithms designed to fuse and analyze massive data sets.\n<br><br>\n- Use expertise to ensure the proper implementation and usage of employed algorithms and bring in cutting-edge innovations from industry and academia.\n<br><br>\n- Leverage knowledge of requirements analysis, installation, integration, evaluation, enhancement, maintenance, testing, and diagnosis or resolution.\n<br><br>\n- Conduct software development, software integration, statistical analysis, modeling, and simulation all in a rapid DevOps environment.\n<br><br>\n- Sync across functional teams, ensuring data science is supporting mission-focused analytic teams and work with rapid prototyping teams on site to deploy new data science capabilities through existing toolsets.\n<br><br>\n<strong>Basic Qualifications</strong>\n<ul>\n<li>3+ years of experience with high-level languages, including Java</li> <li>2+ years of experience with distributed scalable Big Data storage, including Accumulo, Cloudbase, HBase, or Bigtable</li> <li>Experience in MapReduce programming with Apache Hadoop, the Hadoop Distributed File System (HDFS), and processing large data stores</li> <li>Experience with a real-time, large-scale data processing engine, including Apache Spark</li><li>Experience with using Agile software development methods in a DevOps environment</li><li>Experience with developing solutions and integrating and extending free and Open-source software (FOSS) or COTS products</li> <li>Ability to exhibit flexibility, initiative, and innovation when dealing with ambiguous and fast-paced situations</li> <li>TS/SCI clearance in JPAS</li> <li>BA or BS degree</li> \n</ul>\n<strong>Additional Qualifications</strong>\n<ul>\n<li>Experience in working with various intelligence disciplines, including GEOINT, HUMINT, MASINT, OSINT, and SIGINT and comprehension of the data and tools associated with these disciplines</li> <li>Experience with intelligence or operations analysis in the DoD or intelligence community</li> <li>Experience with deploying applications in a Cloud environment</li> <li>Experience with designing and developing automated analytic software, techniques, and algorithms</li> <li>Experience with open source software, including GeoWave and MapReduce Geo (MrGEO)</li><li>Security+ or CISSP and DoD 8570 Compliance Certifications</li> <li>Clearance: TS/SCI clearance in JPAS is required.</li>\n</ul>"}