{"job title": "Data Scientist", "company": "Red Ventures", "city state": "– Charlotte, NC", "rating": "3.0", "job description": "<strong>Data Scientist</strong>\n<br><br>\nRed Ventures is a digital consumer choice platform and digital marketing company based in Charlotte, North Carolina. Through deeply integrated brand partnerships and consumer-facing assets, Red Ventures connects online customers with products and services across high-growth industries including home services, financial services, and healthcare. Data drives everything at Red Ventures. We are maniacal about metrics and in a continuous race to find ways to mine, manipulate and collect data that will give us a significant advantage over our competition.\n<br><br>\nThe Data Science team at Red Ventures is a tight-knit, fast-paced and even faster-growing team working with a large amount of complete and powerful data. From identifying the right consumer audience, creating personalized experience, to recommending the products/services that best fit each customer's needs, the Data Science team at Red Ventures drives growth for every aspect of our multi-billion dollar business.\n<br><br>\nAs a Data Scientist, you will be expected to create innovative solutions to solve business problems by using advanced machine learning, statistical modeling and optimization techniques and turning them into real world solutions for decision making online or offline. You will own data science project(s) end-to-end with limited guidance.\n<br><br>\n<strong>WE ARE LOOKING FOR:</strong>\n\n<ul>\n<li>2+ year experience as a data scientist in digital marketing, e-commerce or financial services, or MS/Phd degree in STEM with specialization in machine learning, statistical modeling and optimization</li>\n<li>Expert knowledge of machine learning, predictive modeling, statistics and data science in general. Knowledge and experience in marketing channel optimization, customer behavior/journey modeling and prediction, product recommendation systems, online testing and etc. is highly desired</li>\n<li>Proficiency in one or multiple data science programing languages such as R, Python and Spark</li>\n<li>Capability of communicating effectively with business and data science leaders on project status, timeline and technical results</li>\n<li>Proficient at collecting and mining data from disparate data sources, and willing to dig deeper and understand the process that creates the data</li>\n<li>Analytical and detail oriented with the ability to prioritize, execute and deliver projects on time</li>\n<li>Capable of translating business opportunities into data science problems and defining the right project scope and performance metric to measure success</li>\n<li>Must be comfortable with unstructured, fast moving and constantly evolving high growth environment</li>\n<li>Committed team player who is proactive, takes ownership over the success of their projects, and works hard to support those around them</li>\n<li>Applied experience with machine learning on large datasets</li>\n</ul>\n<strong>WHAT'S IN IT FOR YOU?</strong>\n\n<ul>\n<li>Solve business critical problems inside a company that has a strong culture of measurement, testing, and optimization across all facets of its marketing and customer acquisition activities</li>\n<li>Integrate cutting-edge machine learning techniques with technology that drives millions of decisions a day</li>\n<li>See your contributions make a material impact to a business's bottom line</li>\n</ul>\n<strong>About Red Ventures:</strong>\n<br><br>\nRed Ventures is a multi-billion-dollar portfolio of digital companies that specializes in bringing consumers and brands together. Through bespoke technology, integrated digital commerce and sales, distinguished partnerships, data science, and original content from the company's proprietary brands and marketplaces, Red Ventures provides better end-to-end consumer experiences throughout the buying cycle. Headquartered in the Charlotte metro area, Red Ventures has more than 3,600 employees globally in offices across the US, UK, and Brazil."}