{"job title": "Data Scientist", "company": "Regulatory DataCorp", "city state": "– King of Prussia, PA, US", "rating": "3.1", "job description": "<strong> Data Scientist\n<br>\nDIGITAL SCREENING OFFICER (DSO) PLATFORM</strong>\n<br><br>\nRDC is looking for a Senior Data Scientist to augment our existing team. Responsibilities would include using data science techniques to improve RDC’s world-class risk and compliance protection services. We assist our global network of clients in identifying banned/suspected persons and organizations. We work towards strengthening fraud protection, ensuringregulatory compliance, managing supply and distribution risk, and protecting brand equity of our clients.\n<br><br>\nWe are looking for someone adept at using large data sets to find opportunities for product and process optimization. They should have a proven track record of applying data mining/data analysis methods to complex real-world problems. Experience using a variety of data tools, building and implementing models, using/creating algorithms, and creating/running simulations is all essential. The new hire will drive RDC's business results with their data-based insights and work with stakeholders to improve business outcomes. Our ideal candidate is someone comfortable leading and working with other team members as well as working independently.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n\n <li>Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions using machine Learning/NLP</li>\n\n<li>Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies</li>\n\n<li>Assess the effectiveness and accuracy of new data sources and data gathering techniques</li>\n\n<li>Coordinate with different functional teams to design and deploy machine Learning/NLP models to production and maintain/monitor performance</li>\n\n<li>Train deep learning models with internal and external datasets</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n\n <li>3 – 7 years of experience manipulating data sets and building statistical models either in academia or industry</li>\n\n<li>BS, MS or Ph.D. in one of the following disciplines: Statistics/Mathematics, Computer Science, Physics, or a closely related field</li>\n\n<li>Knowledge of advanced statistical techniques and concepts (model selection and hypothesis testing, statistical inference etc.) and experience applying them to real-world problems</li>\n\n<li>Knowledge of machine learning techniques (e.g. supervised, unsupervised, neural networks, deep learning) and their real-world advantages/drawbacks</li>\n\n<li>Experience with at least one Deep Learning framework such as TensorFlow, Theano, Keras, Torch etc.</li>\n\n<li>Understanding of natural language processing, information retrieval, and data mining techniques</li>\n\n<li>Nice to have experience with NLP tools such as NLTK, spaCy, CoreNLP, OpenNLP, GATE, Gensim etc.</li>\n\n<li>Experience with databases and big data tools such as Hadoop/Spark, MSSQL, MongoDB etc.</li>\n\n<li>Experience with data visualization tools, such as Matplotlib/Seaborn, ggplot, D3.js, Tableau etc.</li>\n\n<li>Fluent in Python, Scala, or R to manipulate and draw insights from large data sets</li>\n\n<li>Programming experience using languages with object-oriented features such as Java, C/C++.</li>\n\n<li>Can write clean and well documented code. Has good technical writing and verbal communication skills.</li>\n</ul>\nUnfortunately, at this time we are unable to offer H1-B sponsorship."}