{"job title": "Data Scientist", "company": "REI", "city state": "– Kent, Washington", "rating": "3.9", "job description": "<div>What's cool about this job\n<br>\n <div><div><div>As a Data Scientist at REI, you will have the opportunity to work on rich, cross-functional data sets and influence the long term evolution of our analytics capability. You should have excellent technical, business and communication skills and be able to translate key business questions into data acquisition processes, data sets, statistical models and analysis that answer those questions.</div><br>\n<div>You will drive regular deep, topical analyses on a broad range of strategic and tactical questions ranging from customer relationship management to web analytics and supply chain. This versatile role leverages an understanding of statistical modelling, combined with technical aptitude and business understanding to build capacity and insights, enabling REI to deliver outstanding customer experiences. The ideal candidate is a self-starter with a wide range of technical &amp; analytical skills, and is highly proficient in turning data discoveries into cogent, actionable insights.</div><br>\n<div>\n\n<ul>\n<li>As an early team member, you will play a key role in the genetic coding of a data science practice by shaping the technology and vision of our team</li><li>Display an infectious intellectual curiosity and fortitude, with a deep commitment to learning and applying to solve critical business problems and push the boundary of our capabilities</li><li>Thrive in an environment of flux and uncertainty by applying equal parts scientific objectivity and intellectual ingenuity to solving problems and proving out hypothesis and long-held beliefs</li><li>Proactively develop new metrics and studies to quantify the value of different aspects of business processes and consumer behavior</li><li>Translate analytic insights into concrete, actionable recommendations for business or product improvement</li><li>Proficiency at querying relational databases (SQL) and ability to automate and maintain processes to pull &amp; integrate data from multiple, heterogeneous sources</li><li>Translate and effectively communicate future business needs into requirements that inform enterprise analytics platform strategy</li><li>Integration of internally and externally produced unstructured, semi-structured, and relational data sources</li><li>Build and maintain processes to acquire, transform, and curate multiple types of data necessary for analysis and insights</li><li>Possess strong writing, data visualization and communication skills with the ability to communicate complex quantitative analysis in a clear, precise, and actionable manner to senior executives.</li><li>Have a strong passion for answering hard questions with data and demonstrated ability to conceptualize, incubate, and implement new ideas across multiple levels of the organization</li><li>Revel in the complex, but seek to simplify and clarify in your analysis and communications</li><li>Other Duties as Assigned: May perform other ‘ancillary’ duties as assigned including but not limited to work such as coordination of testing, tuning, troubleshooting, business consultation, training and organizational change management.</li></ul></div>\n</div>\n</div></div><br>\n\n <div>\nBring your passion and expertise\n<br>\n <div><div><div>\n\n<ul>\n<li>5+ years of related work experience as a data scientist, predictive analyst, statistician, or quantitative analyst</li><li>Demonstrated ability to self-educate and learn while doing in a highly complex, ambiguous, and rapidly changing environment.</li><li>Strong experience in developing sound analytics-based solutions to business problems</li><li>Hadoop knowledge/Experience, Map Reduce, HBASE/HIVE, Basic Spark</li><li>Proficiency in at least one modern programming language and a statistical programming language, Python &amp; R preferred</li><li>Deep experience with SQL and relational data models along with stout visualization (Tableau, D3, etc) and MS (Excel, VBA, etc.) skills</li><li>Excellence in applying analytical rigor &amp; technical proficiency to the business environment</li><li>Proficiency in communicating complex technical and analytical concepts to non-technical audiences and flexing communication styles to meet the needs of the audiences across all levels of the organization</li><li>Previous experience in a multi-channel retail environment</li></ul></div>\n</div>\n</div></div><br>\n\n <div>\nWhy you'll love it here\n<br>\n <div><div>REI Information Technology is a team of creative and smart technologists who work in a collaborative environment to build business value through technology. And, we have the support of a great company to tackle some dynamic challenges that will keep REI relevant for years to come. If you have a passion for the outdoors and want to be a part of innovating retail technology, this job is for you.</div></div></div><br>\n\n<div>At REI we offer an enviable work environment that has been recognized on the \"100 Best Companies to Work For\" list since the award's inception – 20 years in a row! Sure, we work hard, but it’s balanced with time off to play—a strategy that works for us as we continue to grow and thrive. Want to enjoy a workplace where you can be yourself, be heard and be respected while having a job that challenges you? This is the place.\n<br><br>\nWith more than 140 retail locations (and growing), REI offers unique competitive benefits to its more than 12,000 employees, including healthcare, gear and apparel discounts, free equipment rentals and challenge grants to help employees reach personal outdoor goals, generous retirement plan contributions, public transit subsidy, adoptions assistance, paid sabbaticals, and more.\n<br><br>\nREI is an Equal Opportunity Employer</div><br>\n\n<div>\nApply\n<br>\n Back to job search\n<br>\n <div>\n\n\n<ul>\n\n \n<li>\n Share\n\n</li>\n</ul>\n\n </div>\n</div>\n<br>"}