{"job title": "Data engineer", "company": "Relay Network", "city state": "– King of Prussia, PA", "rating": "3.6", "job description": "<div><strong>Sr. Data Engineer</strong>\n<br><br>\n<strong>Who We Are</strong>\n<br><br>\nRelay is a technology company that connects businesses and people through a unique private messaging application. Our mission is to create more valuable and lasting customer relationships by changing the way businesses communicate. Millions of people use Relay every month to connect and communicate with businesses within healthcare, financial services, insurance, cable, energy, travel and hospitality, and more.\n<br><br>\n<strong>Who you are</strong>\n<br><br>\nRelay Network LLC, a start-up located in Radnor PA, is looking for a Sr. Data Engineer to join our fast-paced and growing technology team. Day to day you will collaborate with the business to create, maintain and enhance BI-based reporting. The role will also be responsible for servicing ad-hoc data requests and to explore Relays rich data to unlock additional business value. This is a great opportunity for the right person to join a talented Technology team, grow their skills and earn broader opportunities for career growth.\n<br><br>\n<strong>Duties and Responsibilities</strong>\n<ul>\n<li>Ownership of Business Intelligence and Data Warehouse layers</li><li>Collaborate with business and technology personnel to develop, maintain and enhance dashboards and data exploration views in Business Intelligence software (e.g. Looker)</li><li>Build and optimize data warehouse and data marts utilizing star or snowflake schemas (OLAP)</li><li>Maintain and enhance ETL and ELT Processes</li><li>Develop repeatable processes and scalable reports</li><li>Optimize queries for fast data retrieval or to minimize processing time on large data</li><li>Triage and/or analyze data defects and propose solutions to rectify issues</li><li>Service ad-hoc data requests from the business and technology</li><li>Assist in the testing of reports and processes for accuracy, integrity and scalability</li><li>Proactively research potential data issues to assure data quality</li><li>Work with business to champion and enforce data quality across Business Intelligence applications</li><li>Explore and assess new reporting or data query technologies</li>\n</ul>\n<strong>Qualifications</strong>\n<ul>\n<li>Bachelors Degree (ideally in Computer Science) or relevant experience</li><li>5+ Years Experience Developing and Managing Data Warehousing and Business Intelligence</li><li>Experienced in Amazon Redshift</li><li>Experience in Python or other scripting languages</li><li>SQL Expert</li><li>Data Warehouse experience with star and snowflake schemas</li><li>Strong communication and interpersonal skills</li><li>Strong problem-solving skills</li><li>Highly motivated and passionate about data</li><li>Experience with AWS Services such as Kinesis and Lambda a plus</li><li>Experience with big data a plus</li><li>Experience working in start-up environments a plus</li>\n</ul>\n<strong>Here are some of the things that we offer:</strong>\n<ul>\n<li>Very competitive salary</li><li>Stock options/grants</li><li>Bonus opportunity</li><li>401k with matching</li><li>Opportunity to work on leading-edge technology with really smart people</li><li>Chance to collaborate on a product that is used by Fortune 100companies and tens of millions of their customers</li><li>Work hard, play hard culture that rewards for performance</li><li>Great health benefits that are subsidized</li><li>Unlimited vacation time</li><li>4-time winner of <em>Best Places to Work in Philadelphia</em>award</li><li>2018 PACT award winner,<em>Top emerging tech product in Phila</em></li>\n</ul>\nIf this sounds good, wed love to talk with you.</div>"}