{"job title": "Data Scientist", "company": "RELX Group", "city state": "– New York, New York, United States", "rating": "3.5", "job description": "<div><div><div><div><div>With a rich history spanning 130 years, Elsevier is the fourth largest digital paid content provider in the world behind Google, Bloomberg, and China Telecom. Elsevier provides unparalleled content and innovative information solutions to facilitate scientific and medical research. Our cutting-edge technology platforms enable scientists, health professionals, and research students to make critical decisions, enhance productivity, and improve outcomes. Our award winning Digital Information Analytics help progress science, advance Healthcare and improve performance. We employee over 1100 of the world’s best technologists around the globe.\n<br><br>\nDo you have a passion for analyzing big data and do you have an understanding of bibliometrics or scientometrics? This is your new career opportunity.\n<br><br>\nWe are looking for a creative, technical, analytical and ambitious individual with a strong personal drive to contribute to the further growth and professionalization of the Research Intelligence suite to support the overall Elsevier Research Platforms strategy and growth ambitions.\n<br><br>\nResearch Intelligence is a set of workflow solutions, tools and analytics serving research administrators, senior executives and policy makers at research institutions, funding bodies and governments in addressing various needs around performance measurement, recruitment and securing funds. The Research Intelligence Data Science team is responsible for providing tools and services in the form of analytical reports, customized datasets and bespoke (web) portals. The demand for these solutions has increased tremendously over the last couple of years.\n<br><br>\nAs a Data Scientist, you are responsible for developing new analytic reports for external clients like Ministries, Funding Bodies and Scientific Institutions. You will bring new insights, a specific benchmark or other relevant analysis which helps the decision-making process for our clients. You are a technical database expert, with strong data analytical skills who likes to apply technology to solve data questions. Our offerings are versatile and flexible and your resourcefulness using all sorts of technologies to analyze, develop, produce and disseminate data (for instance through developing web portals or APIs) is key to success.\n<br><br>\nYou will work in close collaboration with your colleagues in Data Science and Analytical Services to build and maintain our data infrastructure, and provide analytical output to other team members and clients directly. You will also connect and work with Product Management, Product Marketing, Business Development, Strategy, Operations, Solution services, other internal stakeholders, business partners and clients. You will report to the team lead Data Science and this position is based in Amsterdam.\n<br><br>\n<strong>Your responsibilities</strong>\n<br><br>\n1. Content processing\n<br><br>\nMaintaining and indexing the data sources Elsevier uses in our Analytical offering, e.g. Scopus Citation index, Usage data, OECD. Where necessary, enhance data to better linking and comprehensiveness of coverage.\n<br><br>\n2. Analytics\n<br><br>\nUsing data housed by Data Science, execute custom, ad-hoc analytics in close cooperation with the Analytical reporting team. Develop new analytical capabilities for SciVal.\n<br><br>\n3. Delivery\n<br><br>\nProvide analytical output to the Analytics reporting team, aiding charting and further use of the data to meet the client’s request. Delivery has a wide variety of platforms and formats, e.g. large data sets, spreadsheets and dedicated web portals to be built for client use.<br>\n<div><strong>What you should bring</strong>\n<br><br>\n•University Degree in IT or equivalent\n<br><br>\n•5+ years of relevant experience in data analysis, using relational databases, ETL processes, and analytical reporting preferably in publishing or media industry\n<br><br>\n•Experience in using Big Data tools is preferred, proven experience in dealing with large (big) data sets and database platforms is required\n<br><br>\n•Understands the research world and agendas of Institutions, Governments and Funding bodies with regard to research performance evaluations, planning and funding\n<br><br>\n•Solid and proven analytical skills, combining strong eye for details with a good holistic view\n<br><br>\n•Able to understand clients’ needs and to convert them into clear technical requirements\n<br><br>\n•Decision Making – Identifying and understanding issues, problems, and opportunities and using effective approaches for choosing a course of action or developing appropriate solutions\n<br><br>\n•Persuasive - able to connect different functional units to deliver timely high quality results and excellent communication and presentation skills\n<br><br>\n•Organized and clear approaches in addressing market needs, flagging risks, developing and executing resolution plans\n<br><br>\n<strong>What we offer</strong>\n<br><br>\nA competitive base salary + bonus plan based on territory revenue\n<br><br>\nFull benefits package, including;\n<br><br>\n◦Insurance: Health, Dental, Life, Accident, Pet, etc.\n<br><br>\n◦Retirement: 401(K) plan, including a company match and Employee Stock Purchase\n<br><br>\n◦Disability: Long-term, short-term\n<br><br>\n◦Work / Life balance: Volunteer programs, Tuition and Adoption Assistance\n<br><br>\n◦Paid Vacation, Personal and Sick days as well as paid holidays\n<br><br>\n◦For additional information, please inquire<br>\n<div>Upon acceptance of this role, the selected internal candidate will be required to sign a Restrictive Covenants Agreement which includes Non-Solicitation, Non-Disclosure and for certain roles a Non-Competition Agreement as a condition of placement into the role.</div>\n<br>Elsevier is a global information analytics business that helps institutions and professionals progress science, advance healthcare and improve performance for the benefit of humanity. We help researchers make new discoveries, collaborate with their colleagues, and give them the knowledge they need to find funding. We help governments and universities evaluate and improve their research strategies. We help doctors save lives, providing insight for physicians to find the right clinical answers, and we support nurses and other healthcare professionals throughout their careers.\n<br><br>\nElsevier provides digital solutions and tools in the areas of strategic research management, R&amp;D performance, clinical decision support, and professional education; including ScienceDirect, Scopus, SciVal, ClinicalKey and Sherpath. Elsevier publishes over 2,500 digitized journals, including The Lancet and Cell, more than 35,000 e-book titles and many iconic reference works, including Gray's Anatomy. Elsevier is part of RELX Group, a global provider of information and analytics for professionals and business customers across industries.\n<br><br>\nElsevier employs over 7,000 people in more than 70 offices worldwide. We are an employer of choice, attracting and developing talented and creative people who thrive in a challenging and fast-paced environment. We offer an excellent compensation and benefits package as well as a real opportunity for career growth in a growing organization. Elsevier is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. If a qualified individual with a disability or disabled veteran needs a reasonable accommodation to use or access our online system, that individual should please contact 1.877.734.1938 or accommodations@relx.com.</div>\n</div>\n</div>\n </div>\n </div>\n</div>\n\n<br>"}