{"job title": "Data Scientist", "company": "Rent the Runway", "city state": "– New York, NY", "rating": "3.4", "job description": "<strong>About Rent the Runway:</strong>\n<br><br>\nRecently named #9 on CNBC's Disruptor 50 list for 2018, Rent the Runway is transforming the $1.7 trillion global fashion industry by introducing clothing rental as a utility for women. We have pioneered the closet in the cloud and believe that every person globally will soon have a subscription to fashion. Since our launch in late 2009, we have raised $210M from top-tier investors and built one of the most beloved brands on earth. We are proud to be both a profitable and high-growth business, with a loyal 8 million strong customer base who share the experience of renting as being empowering and smart.\n<br><br>\nOur 1000+ employees have a revolutionary spirit that permeates our culture. We've built - proprietary technology, a one-of-a-kind reverse logistics operation, stores of the future, a viral brand, relationships with hundreds of fashion brands - and we are obsessed with continuing to game change our customer experience.\n<br><br>\nWe are also trying to revolutionize entrepreneurship itself - proving that diverse teams produce outsized impact. The Rent the Runway Foundation, which our two co-founders launched together in 2015, helps thousands of female entrepreneurs build and scale their own businesses with the mission of increasing the number of high growth women-led companies.\n<br><br>\n<strong>About the Position:</strong>\n<br><br>\nRent the Runway has a complex data ecosystem that spans web and infrastructure logs, transactions and recurring subscription behavior, and tracking each inventory unit and throughput of our home grown reverse logistics rental operations.\n<br><br>\nData systems power critical business decisions - from inventory assortment to operational efficacy, from marketing actions to personalized website features and customer experience enhancements - and we want to scale the data science function across all these vectors.\n<br><br>\n<strong>In this role, you would:</strong>\n\n<ul>\n<li>Mine the data ecosystem &amp; find fruitful signals</li>\n<li>Develop and deploy performant algorithms powering applications \n\n\n<ul>\n<li>Examples of applications include consumer-facing recommendation engines, inventory allocation systems, and internal apps for inventory buying and customer experience</li> \n</ul>\n\n</li>\n<li>Do bleeding-edge work including optimizing how products fit customers (unsolved as of yet), using AI techniques for inventory buying, and real-time streaming/model computations.</li> \n</ul>\n<strong>You should have:</strong>\n\n<ul>\n<li>Strong academic background in Computer Science, Mathematics, Physics or a related quantitative/engineering field</li>\n<li>Experience developing software or data products, particularly in Python, our go-to language. \n\n\n<ul>\n<li>We also use packages like R for modeling efforts. Java is main language for our back-end systems.</li>\n</ul>\n\n</li>\n<li>Passion for data and its ability to drive serious business impact</li>\n<li>Ability to work independently and take responsibility in a function that is growing in strength but is also core to the company's growth</li> \n</ul>"}