{"job title": "Data Scientist", "company": "Reorg Research", "city state": "– New York, NY", "rating": "4.4", "job description": "<div><div>Reorg Research provides breaking news and market-moving intelligence along with cutting-edge technology and data for hedge funds, investment banks and law firms. We are changing the way that professionals access opaque or complex information, and we are always looking for bright minds to join us on that mission.</div><br>\n<div>Reorg Research is one of the fastest growing start-ups in NYC and we are changing the way professionals access and understand complex information and data in their daily lives. In addition to being one of leading emerging platforms for financial intelligence, Reorg consumes numerous data feeds to help drive our editorial process and provide better access for our customers. With the ever-increasing size of our data and our goal to expand, develop, and refine our data sets and information streams, we are looking for a passionate individual to take our technology offering to new heights. Our goal is to build tools, systems, and models that will extract relevant, meaningful, and actionable information from our data sets with the goal to make our customers and our internal stakeholders better at their jobs. We believe that by combining very powerful technologies with sophisticated business professionals we can unlock billions of dollars of value for our users across a wide variety of job functions.</div></div><div><div>Responsibilities\n\n<ul>\n\n\n<ul>\n<li>Build a foundation of state of the art technical and scientific capabilities to enhance our cutting edge financial intelligence</li> <li>Propose, build, and execute various data science models to leverage existing data to improve business and create new business avenues utilizing unstructured data</li><li>Work on the complex problems at the intersection of finance and technology</li><li>Collaborate with the product and technology teams to contribute to the advanced data analytics and product development efforts</li><li>Apply Data Science principles to solve practical, real world problems</li></ul>\n</ul>\n\n</div>\n</div><div><div>Requirements\n\n<ul>\n\n\n<ul>\n<li>M.S. in a quantitative field</li> <li>3+ years of professional experience as a Data Scientist</li><li>NLP experience is a must</li><li>Experience with unstructured text data and performing tasks such as text mining, sentiment analysis, language modeling, classification, and information retrieval tasks</li><li>Proficient in R and Python</li><li>Familiar with SQL and NoSQL</li></ul>\n</ul>\n\n</div>\n</div><div><div>Reorg Research provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Reorg Research complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training</div></div>"}