{"job title": "Data Scientist Machine Learning", "company": "Resolute Staffing", "city state": "– San Carlos, CA", "rating": "NA", "job description": "Job DescriptionData Scientist - Machine Learning AI\n<br><br>\nJoin this burgeoning Fintech platform as a Data Scientist. This role will tackle some of the hardest questions facing advertisers and user acquisition teams today, starting with those involving our Direct Mail program (which also happens to be our largest acquisition channel)! Such questions include:\n\n\n<ul>\n<li>How do you build predictive models to target the audiences most likely to need and get approved for loans?</li>\n<li>Using 200 million rows of data with cookie-level information about every interaction a user has with our platform, how do you estimate the impact of each online and offline impression a person receives on the individuals ultimate conversion?</li>\n<li>How do you incorporate future spend decisions as you advise the team on the best way to allocate more than $50 million in annual spend across online, offline acquisition channels this month?</li>\n<li>How do you build an infrastructure that will allow for regular and efficient testing of new, alternative datasets?</li>\n<li>Which dimensions are most valuable in a clustering analysis to design creative and targeting strategies?</li>\n<li>How do you design experiments to test the marginal impact of each piece of mail on different customer segments, then use your findings to build actionable targeting models?</li>\n<li>To Bayesian or to frequentist? That is the question.</li>\n</ul>\n\nExpectations\n\n\n<ul>\n<li>Experience building predictive statistical and/or machine learning models</li>\n<li>Comfort working as a full-stack growth analyst to scope projects, write and functionalize code, run tests, surface and visualize results, and monitor outcomes</li>\n<li>Ability to contextualize complex model outputs into actionable business decisions and experiments</li>\n<li>Advanced R, SQL and/or Python abilities</li>\n<li>Minimum of Bachelors degree in statistics, mathematics, computer science or related field</li>\n<li>4+ years of experience in a related technical field</li>\n</ul>\n\nThis is a full-time role, with a growing FinTech start-up.\n<br><br>\nCompany DescriptionBurgeoning FinTech company with its own proprietary AI"}