{"job title": "Data Scientist", "company": "Restoration Media", "city state": "– Irvine, California", "rating": "4.7", "job description": "Company Description<br><br>Based in Irvine, CA with an engineering office in Buenos Aires, Restoration Media (\"RM\") is a data driven recruitment marketing company which owns and operates a network of job search sites called CareerCentric. We provide jobseekers with relevant job recommendations via email, mobile and desktop experiences. Employers utilize our performance based recruitment platform to source qualified candidates in the US and UK.\n<br><br>\nRestoration Media provides a fun and productive work environment where quality work is fueled by innovation, creativity and the desire to serve our clients and partners. RM firmly believes that the strength of an organization resides in the members of its team. Each of RMs employees reaps the benefits of working in an environment replete with opportunities to learn and grow with challenging projects as well as support toward continued professional development.\n<br><br>\nInc. 5000 | 2010, 2012, 2013, 2014, 2015, 2016, 2017\n<br><br>\nOC Business Journal Fastest Growing Private Companies | 2012, 2013, 2015, 2017\n<br><br>\nBest Places to Work in Orange County | 2013, 2015\n<br><br>\nPrincipals only. Recruiters, please do not contact.<br><br>Job Description<br><br>Restoration Media is looking for a Data Scientist to join our growing business to provide expertise on statistical and mathematical concepts for key projects across the business. The ideal candidate will apply and inspire the adoption of advanced data science and analytics as well as oversee and mentor other members of the data team.\n<br>\nThe Data Scientist will leverage the businesss data to enhance business stakeholders capabilities for overall goal achievement. The Data Scientist role is instrumental in helping the business continue to grow in its current markets and evolve into new market verticals through an analytical and data-driven approach.<br><br>Qualifications<br><br><strong>Responsibilities</strong>\n<ul>\n\n<li>Collaborate with and guide business stakeholders through key data related projects and initiatives.</li>\n<li>Optimize search engine result relevancy.</li>\n<li>Maximize sponsored content exposure.</li>\n<li>Improve click distribution on job content across employers.</li>\n<li>Establish optimal email engagement strategies and methods.</li>\n<li>Identify pivotal events in the user journey to improve user experience and lifetime engagement.</li>\n<li>Build and oversee job taxonomy.</li>\n<li>Develop user profiles to increase relevancy of engagement.</li>\n<li>Build lead scoring and categorization algorithm.</li>\n<li>Create predictive model for ISP behavior.</li>\n</ul>\n\n<ul>\n\n<li>Support and mentor members of the data team.</li>\n\n</ul>\n\n<div><strong>Skills &amp; Experience</strong>\n<ul>\n\n<li>Masters degree in Statistics, Machine Learning, Mathematics or Computer Science</li>\n<li>PhD preferred</li>\n<li>Experience working with large scale data sets</li>\n<li>Intuitive understanding of machine learning algorithms, supervised and unsupervised modeling techniques</li>\n<li>CS/algorithm background and excellent understanding on how to apply advanced knowledge to solve real-world problems</li>\n<li>Exploratory data analysis (prefer R knowledge)</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Strong analytical skills</li>\n<li>Strong management skills</li>\n<li>Knowledge of a scripting language like Python or Ruby</li>\n</ul></div>\n\n<br>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines."}