{"job title": "Data Scientist", "company": "Retail Solutions, Inc.", "city state": "– Mountain View, CA", "rating": "3.3", "job description": "<strong>Company Overview</strong>\n<br><br>\nRSi is a leading provider of retail data science based analytics and a big data management platform which helps top retailers and CGP companies manage their supply chain and marketing initiatives to drive sales results. Using machine learning, streaming analytics and predictive models, we are the go-to cloud based; peta-scale SaaS data management platform in the retail space. Join our team as a Data Scientist and join a global innovative technology leader headquartered in Silicon Valley.\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nThe Data Scientist will drive and participate in the design and implementation of algorithms working with the retail and supply chain data. This needs knowledge of statistical modeling, data mining, and machine learning concepts, and includes understanding business requirements, conducting advanced data analysis, designing algorithms, providing algorithm specifications and also the corresponding tweaking/tuning guidelines.\n<br><br>\nThe Data Scientist is responsible for helping on defining and performing advanced analyses against large and varying data sets related to retail sales and operations in support of various Retail Solutions customer driven solution creation. The objective of these analyses will be to answer important business questions and should result in input parameters and/or new algorithms to be leveraged in highly-sophisticated analytic applications. This individual will work closely with a team of product manager, R&amp;D, and software engineers to provide the solution.\n<br><br>\nRSi is growing rapidly, and the work atmosphere is team-oriented and knowledge-intensive: motivated professionals are highly appreciated.\n<br><br>\n<strong>Responsibilities and Duties</strong>\n\n<ul>\n<li>Analyze the various data sets, based on the business goal, find the characteristics of the data and create proper advanced models for them.</li>\n<li>Develop and implement algorithms to solve business problems.</li>\n<li>Tweaking/tuning the model for better accuracy, performance, etc.</li>\n</ul>\n<strong>Qualifications and Skills</strong>\n\n<ul>\n<li>Master Degree or higher in Statistics with courses completed on the Machine Learning, Statistics, Prediction algorithms and/or related areas.</li>\n<li>2+ years of Working experiences on industrial analytical areas especially big data analytics (Statistical Modeling, Machine Learning and Predictive Analysis).</li>\n<li>Knowledge and experiences in the supply chain area is very preferred.</li>\n<li>Having knowledge on the Statistics, Predictive Analysis and Modeling, Machine Learning and/or related areas, and having projected completed on those areas.</li>\n<li>Familiar with R programming, can use R to create analysis programs using linear regression, pattern recognition, machine learning methods.</li>\n<li>Having basic SQL knowledge and skills, can write SQL queries for retrieving the data from the data repository DB.</li>\n<li>Having data visualization and representation skills.</li>\n<li>Experience developing data-driven analytical models of various operations / policies.</li>\n<li>Fluent oral and written communication skills in English.</li>\n<li>A team-worker, willing to work with colleagues.</li>\n</ul>\n<strong>ABOUT RETAIL SOLUTIONS, INC.:</strong>\n<br><br>\nRetail Solutions, Inc. (\"RSi\") develops and delivers a comprehensive suite of award-winning software-as-a-service (SaaS) solutions that turn Retailer downstream data, such as point-of-sale (POS), supply chain, merchandiser feedback and category data, into actionable visibility into the store and onto the shelf for their suppliers.\n<br><br>\nRSi, the largest and fastest-growing company in the Retail Execution Management field, has more experience with processing customer-specific retailer data than any other company. Retailers and consumer product goods (CPG) companies trust Retail Solutions to grow sales, reduce out-of-stocks, improve promotion execution and effectiveness, maximize retail operation productivity and foster collaborative relationships in the retail industry to improve product availability for the end-consumer.\n<br><br>\nRSi serves more than 500 CPG Companies, including 23 of the top 25 global consumer goods companies, and processes data from more than 175 leading retailers in the Americas and Europe.\n<br><br>\nRetail Solutions, Inc. is headquartered in Mountain View, CA and has offices in Providence, RI, Bentonville, AR, Minneapolis, MN, Chicago, IL, Brentford, UK, Paris, France, Munich, Germany, Pune, India, and Shanghai, China. RSi is an equal opportunity employer."}