{"job title": "Sr. Analyst, Business Operations (BizOps) Data Science", "company": "RetailMeNot", "city state": "– Austin, Texas", "rating": "4.3", "job description": "<div>RetailMeNot is looking for a full-time, Senior BizOps analyst to join us at our awesome headquarters, located in the heart of beautiful, downtown Austin.</div><div><br></div><div>Do you have a real passion for solving complex technical problems at scale? Enjoy constantly learning and implementing new technologies? Love telling cool stories from data and getting significant results? Then read on!</div><div><br></div><div>Our Business Operations (BizOps, for short) team is built from experts in statistical analysis and data lifecycle. We take pride in our dynamic and fun environment in which we constantly learn from each other to develop our skills. As part of the team, you will uncover insights from rich and powerful big data. You will work with teams across RMN to use quantitative analysis, data mining, and machine learning techniques to understand understand our customers and our business all while being mentored by a team of great technical talent. In this role, you will unearth trends and shifts in user behavior with our rich internal data and disseminate these trends within the company and beyond. You will also advocate the RMN brand by delivering new, exciting, and relevant trends to internal consumers.</div>Who You Are:<ul><li>B.S in math, statistics, engineering, economics or equivalent technical or analytic field.</li><li>2+ years of relevant experience in data science, business analytics, business operations or decision support.</li><li>2+ years experience with SQL.</li><li>2+ years experience implementing models with Python or R, and the associated modeling packages (numpy, scipy, scikit-learn or equivalent)</li><li>A history of success solving business problems using quantitative models, for example: Regression (Linear/Logistic, Lasso, Ridge, Decision Trees), Classification (Naive Bayes, Decision Trees, SVM, kNN, etc.), and Clustering (k-means).</li><li>Problem-driven, and Curious. Youre naturally curious, and inspired by hard, fuzzy, and ill-defined problems. </li><li>Tech Savvy, not Tech Driven. You love new technology and algorithms in order to solve critical business problems. You arent afraid to learn new approaches when you need them, and you have a good sense of when to use the appropriate tool for the job.</li><li>Clever and Tenacious. You can find a way around obstacles, and are creative when it comes to tackling them.</li><li>Great Communicator. You know how to tailor your approach to your audience. You have solid communication skills, whether in a one on one setting or in front of executives.</li><li>You aren't afraid to challenge the status quo. Youre not intimidated by status and judge ideas on their merit. </li></ul>What You'll Do:<ul><li>Help us understand how our users are interacting with our products, how their interactions grow and evolve over time, and across platforms, and why they stop coming back</li><li>Propose ways to optimize/improve our content strategy to drive the deeper engagement </li><li>Find novel ways to leverage &gt;1PB of data to uncover new revenue opportunities and drive the product roadmap forward</li><li>Develop and share new data products for expedited downstream analysis and application</li><li>Solve complex business problems through building statistical models from data and metadata</li><li>Drives strategic and tactical planning discussions and collaborates directly with stakeholders at all levels </li><li>Gathering requirements and delivering comprehensive analytics solutions, and providing business partners at all levels data-driven recommendations which determine our strategic direction</li></ul>Who We Are:<ul><li>We value diverse perspectives and believe this translates into stronger products and a better workplace</li><li>We have an open, casual, fun and upbeat environment where you are given a lot of responsibility and the freedom to make a huge impact</li><li>We have lots of intelligent people to work with and learn from</li><li>We have a great open vacation policy</li><li>We'll provide you with food, food, and more food</li><li>We believe in giving prizes, bonuses, and recognition for doing what you love</li></ul><div><b>Rewards</b></div><div>We offer an opportunity to be an integral part of a company that eagerly pursues disruption in its space to continue to drive innovation and lead the competition. Benefits of being an employee of RetailMeNot, Inc. include, but are not limited to the following:</div><div><br></div><div>- Competitive base &amp; bonus packages; salary negotiable</div><div>- Long Term Incentive Plan</div><div>- Performance based rewards &amp; recognition for your hard work and service</div><div>- Very competitive benefits packages, including best-in-class parental leave</div><div>- Open &amp; flexible PTO</div><div>- Cell phone &amp; gym membership reimbursements</div><div>- Fully stocked break room &amp; onsite catered breakfasts &amp; lunches multiple days/week</div><div><br></div><div><b>About Us</b></div><div>RetailMeNot, Inc. is a leading digital savings destination connecting consumers with retailers, restaurants and brands, both online and in-store. The company enables consumers across the globe to find hundreds of thousands of digital offers to save money while they shop or dine out. </div><div><br></div><div><b>U.S. Equal Employment Opportunity/Affirmative Action Information </b></div><div>Individuals seeking employment at RetailMeNot, Inc. are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation. You are being given the opportunity to provide the following information in order to help us align with federal and state Equal Employment Opportunity/Affirmative Action record keeping, reporting, and other legal requirements.</div>"}