{"job title": "Senior Data Scientist", "company": "RetailMeNot", "city state": "– Austin, Texas", "rating": "4.3", "job description": "<div>At RetailMeNot we believe that gaining valuable insights using our data is core to our future success. Our Data Science team is seeking a Senior NLP Data Scientist to drive search-oriented modeling and automated language processing to make savings opportunities more discoverable by consumers.</div><br>\n<div>In this role you will collaborate with a multidisciplinary team of data scientists, software engineers, data engineers, business analysts, product managers, and other internal customers to find the best opportunities to apply data science in RetailMeNot's business. You will lead key initiatives through development, iterative experimentation, and productization of winning solutions. We can provide you access to large-scale master and analytics data sets; in return you will see the application and impact of your work to millions of users.</div><br>\n<div>Do you love working with people, taking on these new challenges, working in an energizing environment and using data to tackle large and impactful problems? We have tons of work to be done, so lets get started.</div>Who You Are\n\n<ul>\n<li>You have an MS/PhD in NLP, computational linguistics, machine learning, applied mathematics, or related quantitative field or a related technical discipline</li><li>You have a deep knowledge of natural language processing, text mining and statistics</li><li>Have a track record of building scalable and robust personalized search engines preferably in the retail space</li><li>You bring specific experience in Neural Networks, preferably RNNs, LSTMs and Deep Learning</li><li>You have experience with Topic Modeling, Parsing, Semantic Composition and Relationship Extraction</li><li>Experience in productization of machine learning algorithms</li><li>You have the ability to apply a pragmatic approach to problem solving, establishing conceptual connections to data sources, understanding relationships among data, and comfort with uncertainties/approximations</li><li>You have great communication and collaboration skills</li>\n</ul>\n\nWhat You'll Do\n\n<ul>\n<li>You'll use machine learning and NLP techniques to design and develop system for search</li><li>You'll design and implement scalable algorithms and models, as well as repeatable workflows</li><li>You'll develop and code software programs, algorithms and automated processes to interpret unstructured textual data from various sources and contexts</li><li>You'll communicate effectively to different audiences, both technical and non-technical, through good storytelling and data visualization</li><li>You'll mentor junior engineers/scientists on data science techniques, process, and new technologies</li><li>Stay ahead of new technologies. Technologies we use today include: TensorFlow, Spark, JanusGraph, Python, and Elasticsearch</li>\n</ul>\n\nWho We Are\n\n<ul>\n<li>We have an open environment where engineers are given a lot of responsibility and the freedom to make a huge impact</li><li>We have lots of smart people to work with and learn from</li><li>We work on large scale challenges with a variety of technologies</li><li>We have a great open vacation policy</li><li>We'll provide you with food, food, and more food</li><li>We believe in giving prizes, bonuses, and recognition for doing what you enjoy</li>\n</ul>\n\n<div><strong>Rewards</strong></div>\n<br>\n<div><strong>We offer an opportunity to be an integral part of a company that eagerly pursues disruption in its space to continue to drive innovation and lead the competition. Benefits of being an employee of RetailMeNot, Inc. include, but are not limited to the following:</strong></div><li>Competitive base &amp; bonus packages; salary negotiable</li>\n<li>Long Term Incentive Plan</li>\n<li>Performance based rewards &amp; recognition for your hard work and service</li>\n<li>Very competitive benefits packages, including best-in-class parental leave</li>\n<li>Open &amp; flexible PTO</li>\n<li>Cell phone &amp; gym membership reimbursements</li>\n<li>Fully stocked break room &amp; onsite catered breakfasts &amp; lunches multiple days/week</li>\n\n<br>\n<div><strong>About Us</strong></div><div>RetailMeNot, Inc. is a leading digital savings destination connecting consumers with retailers, restaurants and brands, both online and in-store. The company enables consumers across the globe to find hundreds of thousands of digital offers to save money while they shop or dine out.</div> <br>\n<div><strong>U.S. Equal Employment Opportunity/Affirmative Action Information</strong> </div><div>Individuals seeking employment at RetailMeNot, Inc. are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation. You are being given the opportunity to provide the following information in order to help us align with federal and state Equal Employment Opportunity/Affirmative Action record keeping, reporting, and other legal requirements.</div>"}