{"job title": "Data Scientist", "company": "Return Path", "city state": "– Broomfield, CO, United States", "rating": "4.4", "job description": "<strong>Who is Return Path?</strong><br><br>Return Path is the expert in deliverability. Every day, our customers trust our data and insights to help them optimize their email marketing. Partnered with best-in-class email service providers, we help marketers take their email programs to the next level by driving more response and increasing revenue.\n<br><br>\nAt Return Path, we know email.\n<br><br>\nThrough the Return Path Data Exchange, weve brought together the worlds most comprehensive source of data from the email ecosystem. We partner with more than 70 providers of mailbox and security solutions, covering 2.5 billion inboxesapproximately 70 percent of the worldwide total. Also feeding into this data platform is our consumer network of more than 2 million consumers, delivering unparalleled insight into user behavior, brand affinity, and consumer preferences.\n<br><br>\nOnce youre an employee here, this is a place where youll be challenged, inspired, rewarded, and transformed.\n<br><br>\n<strong>The Impact Youll Have</strong><br><br>We are looking for a Data Scientist to join the Analytics team. The Data Scientist role is responsible for modeling complex problems, discovering insights, and identifying and effectively communicating opportunities. You should have advanced analytic skills; be proficient at integrating and preparing large, varied datasets; algorithm creation; exceptional python coding; and communicating results. You will work closely data scientists, analysts, engineers, product management, marketing, and service. This is an exciting opportunity to work collaboratively with others and cross functional teams with high growth potential.<br><br><strong>Role Objectives</strong>\n\n<ul>\n<li>Identify, quantify, and track effectiveness of relevant algorithms and processes for data-driven solutions; code those identified to produce actionable results</li><li>Design, build, and extract large and complex data sets while thinking strategically about uses of data and how data use interacts with data design</li><li>Structure analysis with efficiency and repeatability in mind</li><li>Document and share thought process, code, and conclusions</li><li>Collaborate with cross-functional teams to craft algorithmic and data-driven solutions</li><li>Perform exploratory data analysis to provide insight into business questions; summarize in graphs, charts, or other visual representations</li><li>Work with engineering teams to integrate algorithms and data into our solutions</li><li>Work with Product Management and service</li><li>Consistently communicate on status of project deliverables</li><li>Stay well-informed about the standards and technology of the email industry</li>\n</ul>\n<strong>What does it take to be successful in this role?</strong>\n<br><br>\nA strong desire to work in a highly collaborative environment, have excellent communication skills, and be very comfortable with rapid change and uncertainty. Youll be highly accountable for success in a supportive environment that values creative thinking and fast results. You should be comfortable describing complex ideas to non-technical partners.\n<ul>\n<li>You have 3+ years of experience in a quantitative or computing field such as math/stats, computer science, machine learning</li><li>Achieve defined project goals within project deadlines; dedicatedly communicate status and raise issues as needed</li><li>Experience and eagerness to mine data for product development, client support, and marketing support</li><li>Strong statistical background and an understanding of how to apply statistical methods to machine learning</li><li>Algorithm development such as regression, decision trees, neural networks, and reinforcement learning</li><li>You have strong Python programming skills to perform data science tasks</li><li>Comfortable using varied platforms and applications such as:</li><li>SQL</li><li>Python</li><li>Linux/Solaris</li><li>Is comfortable routinely handling and processing terabytes of data</li><li>Experience with AWS and Spark is a plus</li>\n</ul>\nIn addition to the above, you are a good fit if you demonstrate:\n<ul>\n<li>Desire for Personal/Professional Growth</li><li>Professionalism</li><li>Execution</li><li>Critical Thinking</li><li>Positive Impact</li><li>Sense of humor</li>\n</ul>\n\n<strong>People First</strong><br><br>At Return Path, we are building an extraordinary company that helps people and businesses communicate more reliably, effectively, and securely. We put people first, do the right thing, and succeed together.\n<br><br>\nWe have a strong belief that our people are the most important part of our business. We incorporate this philosophy into our practices and we live it every day. This means we have generous traditional benefits and take a lot of time to focus on quality management and leadership development. We also strive to ensure each person in the company is in the right job, knows how his or her job contributes to the overall company mission, and has a clear sense of career growth and direction. We have great employee retention over the years because people love coming to work here and really feel like they're part of something special.<br><br><strong>Do the right thing</strong><br><br>The Return Path experience is a two-way exchange. We expect you to give us your best every day, and you can expect the same from us. In exchange for your talent, your energy, and your unique contributions, we will strive to give you what you need to live a balanced, healthy life. This means more than competitive pay and benefitsit means offering the freedom and flexibility to create your ideal experience inside and outside the office.<br><br>For more information visit www.returnpath.com<br><br>Return Path is proud to be an equal opportunity employer. We are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}