{"job title": "Data Science Analyst", "company": "Revionics", "city state": "– Austin, TX", "rating": "3.7", "job description": "Role and Responsibilities:\n<br><br>\nRevionics has an immediate opening on our Science Services team for a Data Science Analyst. This individual will work in a fast-paced environment as part of multi-disciplinary project teams to deliver analytic services to retailers. The successful candidate will bring a balance of creative problem solving, hands-on data skills and practical analytic skills to the organization. Experience in Retail Analytics or a related Analytic field is required. Strong communication and presentation skills highly desired.\n<br><br>\nThe Data Science Analyst's responsibility is to support the Science Services team to:\n\n<ul>\n\n\t<li>Develop a solid understanding of Revionics' core set of science services and of the science behind Revionics' solutions.</li>\n\n<li>Execute and deliver analytical services to customers by the deadline. Examples of services include Data Validation, Key-Value Item identification, Market Basket Analysis, Store Zone Clustering, etc.</li>\n\n<li>Execute, analyze and refine Revionics' demand models and forecasts using advanced hindcast holdout sample and modeling techniques.</li>\n\n<li>Perform Value Measurement analysis for existing customers to demonstrate the value of our price optimization solution</li>\n\n<li>Automate and improve reusability &amp; efficiency of existing science services using a combination of Python, SQ, and in-house software tools.</li> \n\n<li>Work with Price Strategy Consultants, Project Managers, Systems Engineers, and Client Partners in the delivery of science solutions.</li>\n\n<li>Work closely with the Science development team when necessary for collaboration, support and to integrate software tools such analytic workflow engines, data validation &amp; testing scripts, data visualization tools, reusable analytic workflow scripts, etc.</li>\n</ul>\nRequirements:\n\n<ul>\n\n\t<li>Masters (preferred) in Operations Research, Econometrics, Mathematics, Physical Sciences or equivalent,</li>\n\n<li>Strong quantitative, mathematical and analytic skills and ability to understand the use of statistical solutions to business problems</li>\n\n<li>Strong data skills including experience with data validation and outlier identification methodologies</li>\n\n<li>SQL and relational databases skills (MS SQL Server, Oracle, etc.)</li> \n\n<li>Experience with analytic scripting languages applications (Python highly desired, R, MatLab, Alteryx.)</li> \n\n<li>Data visualization skills (Excel, Tableau (highly desired)) and the ability to present complex information to technical and non-technical audiences.</li>\n\n<li>Strong communication and presentation skills</li>\n</ul>\nPreferred Candidate Attributes:\n\n<ul>\n\n\t<li>Proficiency with Python, JuPyter notebooks, SciPy, numPy</li>\n\n<li>Familiarity with Retail or a similar industry (supply chain, financial, credit, etc.)</li>\n\n<li>Proficiency in Visualization Business Intelligence applications (Tableau, Alteryx, etc.)</li>\n\n<li>Familiarity with statistical regression and modeling techniques (least squares, maximum likelihood, Bayesian estimation.)</li>\n\n<li>Familiarity with Classification and Clustering methods (K-means, Non-hierarchical, etc.)</li>\n\n<li>Software development languages tools (C++, C#, Java)</li>\n\n<li>Familiarity with data load and ETL / Automation tools (Informatica, etc.)</li>\n</ul>\n<strong>Who We Are:</strong>\n<br><br>\n<strong>Predictive. Prescriptive. Profitable Retailing.</strong>\n<br><br>\nWe provide SaaS-based pricing, promotion, markdown and space solutions. Retailers in all segments across the world adopt our self-funding model to improve top-line sales, demand, and margin. Our customers gain that competitive edge and improve their value proposition while outmaneuvering competitor price aggressiveness.\n<br><br>\nDuring the days of first-generation price optimization solutions, at a time where science in retail was viewed as voodoo, our founder Jeff Smith nurtured the concept that there could be a better way. He went on to form Revionics around that new-generation vision, and to this day we remain committed to his goal: To help retail businesses and everyday users solve complex pricing challenges leveraging the latest machine learning science with a completely transparent process, usable in an intuitive way that fits into retailers' normal business flows.\n<br><br>\n<strong>Our company success is based on our 4 foundational pillars:</strong>\n\n<ul>\n\n\t<li>A SaaS-based architecture for fast ROI</li>\n\n<li>Productized, transparent science</li>\n\n<li>Machine Learning algorithms that continue to evolve with changing market conditions and shopper behaviors for built-in future proofing</li>\n\n<li>A supportive culture focusing on both our people and customers' well-being.</li>\n</ul>\n<strong>Our Core Values:</strong>\n\n<ul>\n\n\t<li>Integrity: <em>Be honest, dependable and complete</em></li>\n<li>Transparency: <em>Anticipate questions and give clear, usable answers</em>.</li>\n\n<li>Continuous Improvement: <em>Be relentless about improvement for ourselves and our customers</em></li>\n<li>Curiosity: <em>Shine lights in dark corners; seek to ensure we know what we don't know</em></li>\n<li>Accountability: <em>Own the problem and the solution</em></li>\n<li>Dedication: <em>Don't stop until the numbers are right and systems are up</em></li>\n<li>Humility: <em>Put the</em> <em>spotlight on our customers, not ourselves</em></li>\n</ul>"}