{"job title": "Senior Data Scientist", "company": "Rice University", "city state": "– Houston, TX (US)", "rating": "4.5", "job description": "<div>\nPosting Details\n<br>\n <div>\n<div>\nPosition Information\n<br>\n <div>Job Title Senior Data Scientist</div> <div>Department Texas Policy Lab</div> <div>Full Time/Part Time Full-Time</div> <div>Requisition Number S19167</div> <div>Open Date 09/21/2018</div> <div>Close Date</div> <div>Salary Information<br><br>Salary Commensurate with Experience and Qualifications</div> <div>Work Schedule<br><br>Monday through Friday, 8 a.m. to 5 p.m.; some late evenings may be required including some weekends.</div> <div>Benefits Eligible Yes</div> <div>Eligible for Overtime No</div> <div>Position Summary<br><br>Texas Policy Lab (TPL) is seeking a senior data scientist. The successful candidate will work with other members of TPL and faculty at Rice University to contribute to analytical projects involving large administrative and survey-generated datasets. S/he will identify opportunities where frontier data analytic techniques (predictive modeling, machine learning etc.) can be useful to address policymaker needs, execute these projects and communicate the results to a non-technical audience. S/he will work with and/or manage a team to import, manipulate, and merge large datasets. S/he will devise strategies to automate the process of importing, exporting and linking datasets arriving from various government agencies.\n<br><br>\nTPL provides Texas state and local government agencies with science driven results to help inform how policy is developed and implemented in Texas. In close collaboration with those agencies, we produce scientific, independent, timely evaluations of current social and economic programs and new program initiatives. These long-term partnerships will improve Texas state and local government capacity to utilize data, scientific evidence and technology in policy-making and resource allocation. The Texas Policy Lab draws on the expertise of Rice University faculty and its own professional research staff.</div> <div>Education Required PhD or other Doctoral Degree</div> <div>Concentration / Degree Type<br><br>Doctoral degree in a relevant field (computer science, mathematics, statistics, economics, finance etc.).</div> <div>Substitution for Education Requirement<br><br>Experience may not be substituted for the education requirement.</div> <div>Education Preferred</div> <div>Experience Required No experience required</div> <div>Type of Experience</div> <div>Substitution for Experience Requirement<br><br>.</div> <div>Experience Preferred<br><br>- Scholarly work in predictive modeling or machine learning.\n\n\n<ul>\n<li>Scholarly work using administrative data collected from multiple sources.</li>\n<li>Demonstrable interest in public policy.</li>\n<li>Ability to articulate data science methods and approaches a non-technical audience.</li>\n<li>Research interest in a substantive public policy area, such as criminal justice, child protective services, health, education or others.</li></ul></div> <div>License/Certification Required</div> <div>License/Certification Preferred</div> <div>Skills Required<br><br>- Excellent listening, verbal and written communication, analytical, and research skills\n<li>Superior scientific and numerical skills with meticulous attention to details and accuracy</li>\n<li>Proficient and comprehensive knowledge of information management, knowledge management and publication management</li>\n<li>Ability to work in a team environment, to participate actively, to collaborate and to motivate others in the lab</li>\n<li>Excellent critical thinking , technical, data collection and interviewing skills</li>\n<li>Excellent statistical and graphical analysis skills</li>\n<li>Ability to maintain quality, safety and / or infection control standards</li>\n<li>Ability to plan and schedule effectively</li></div> <div>Skills Preferred<br><br>- Expertise, as demonstrated by advanced coursework or other relevant experience, in predictive modeling, machine learning and statistics.\n<li>Demonstrable expertise in determining the appropriate analytic approaches and computing techniques given the data availability and research question.</li>\n<li>Strong programming skills in statistical and/or computational programs.</li>\n<li>Ability to translate problems policymakers face into tractable, quantitative problems that can be insightfully addressed using data.</li>\n<li>Expertise and creativity in visualizing, analyzing, and communicating insights from data.</li>\n<li>Knowledge of frontier data science techniques and experience in their applications.</li>\n<li>Experience in importing, linking, reshaping and managing large administrative datasets.</li></div> <div>Internal / External Contacts<br><br>- Will work closely and report to the Executive Director.\n<li>Will work closely with research scientist(s).</li>\n<li>Frequent contact with TPL research team and staff members, including non-TPL technical staff on campus.</li>\n<li>Will have regular contact with various TPL and Rice University personnel including local and state entities from which TPL will acquire data.</li></div> <div>Physical Demands<br><br>- Must be able to work at a computer terminal for extended periods of time.\n<li>Must be able to move about campus and go to various TPL sites.</li></div> <div>Working Conditions<br><br>- Monday-Friday, standard 40 hour work week.\n<li>Some late evenings and/or weekends required to meet TPL deadlines.</li></div> <div>Security Sensitive Yes</div> <div> Special Instructions to Applicants<br><br>Salary expectations must be included in the cover letter.</div> <div>Quick Link for Posting http://jobs.rice.edu/postings/16861</div> </div>\n\n<br>\n\n\n<div>\nJob Duties\n<br>\n <div>Job Duty Name Essential Functions</div> <div>Description of Job Duty<br><br>- Conducts complex independent specialized research and experiments\n\n\n<ul>\n<li>Collects, tracks and analyzes data using spreadsheets and databases</li>\n<li>Communicates the results of research through verbal presentations, written reports, and written articles submitted for publication</li>\n<li>Responsible for leading a team of research personnel</li>\n<li>Monitor research budget</li>\n<li>Assists in the administration of research project</li>\n<li>Performs all other duties as assigned</li></ul></div> </div>\n\n\n\n</div>\n </div>\n\n<br>Applicant Documents\n<br>\n <div>\n</div>"}