{"job title": "Data Scientist", "company": "Rice University", "city state": "– Houston, TX (US)", "rating": "4.5", "job description": "<div>\n Posting Details\n <p></p>\n <div>\n <div>\n \n \n Position Information\n <p></p>\n \n <div>Job Title Data Scientist </div><div>Department Texas Policy Lab </div><div>Full Time/Part Time Full-Time </div><div>Requisition Number S19168 </div><div>Open Date 09/21/2018 </div><div>Close Date </div><div>Salary Information <p>Salary Commensurate with Experience and Qualifications</p> </div><div>Work Schedule <p>Monday through Friday, 8 a.m. to 5 p.m.; some late evenings may be required including some weekends.</p> </div><div>Benefits Eligible Yes </div><div>Eligible for Overtime No </div><div>Position Summary <p>Texas Policy Lab (TPL) is seeking a data scientist. The successful candidate will work with other members of TPL and faculty at Rice University to contribute to analytical projects involving large administrative and survey-generated datasets. S/he will apply frontier data analytic techniques (predictive modeling, machine learning etc.) to address policymaker needs. S/he will import, manipulate, and merge large datasets. S/he will devise and implement strategies to automate the process of importing, exporting and linking datasets arriving from various government agencies.</p>\n<p>TPL provides Texas state and local government agencies with science driven results to help inform how policy is developed and implemented in Texas. In close collaboration with those agencies, we produce scientific, independent, timely evaluations of current social and economic programs and new program initiatives. These long-term partnerships will improve Texas state and local government capacity to utilize data, scientific evidence and technology in policy-making and resource allocation. The Texas Policy Lab draws on the expertise of Rice University faculty and its own professional research staff.</p> </div><div>Education Required Bachelor's Degree </div><div>Concentration / Degree Type <p>In a relevant field (computer science, mathematics, statistics, economics, finance etc.).</p> </div><div>Substitution for Education Requirement <p>Experience may not be substituted for the education requirement.</p> </div><div>Education Preferred <p>Master’s degree in a relevant field.</p> </div><div>Experience Required No experience required </div><div>Type of Experience </div><div>Substitution for Experience Requirement </div><div>Experience Preferred <p>- Experience in application of predictive modeling or machine learning. <br>\n- Experience in manipulating administrative data collected from multiple sources.<br>\n- Demonstrable interest in public policy.<br>\n- Ability to communicate complex techniques and methods with other researchers.<br>\n- Interest in a substantive public policy area, such as criminal justice, child protective services, health, education or others.</p> </div><div>License/Certification Required </div><div>License/Certification Preferred </div><div>Skills Required <p>- Good listening, verbal and written communication, analytical, and research skills. <br>\n- Excellent scientific and numerical skills with meticulous attention to details and accuracy.<br>\n- Ability to work in a team environment, to participate actively, to collaborate and to motivate others in the lab.<br>\n- Good critical thinking, technical, data collection and interviewing skills.<br>\n- Good statistical and graphical analysis skills.<br>\n- Ability to maintain quality, safety and / or infection control standards.<br>\n- Ability to plan and schedule effectively.</p> </div><div>Skills Preferred <p>- Expertise, as demonstrated by advanced coursework or other relevant experience, in predictive modeling, machine learning and statistics.<br>\n- Demonstrable expertise in determining the appropriate analytic approaches and computing techniques given the data availability and research question. <br>\n- Strong programming skills in statistical and/or computational programs. <br>\n- Knowledge of frontier data science techniques and experience in their applications. <br>\n- Experience in importing, linking, reshaping and managing large administrative datasets.</p> </div><div>Internal / External Contacts <p>- Will work closely and report to the research scientist(s).<br>\n- Frequent contact with the TPL research team and staff members.<br>\n- Will have regular contact with various Rice University personnel and other stakeholders, including local and state entities from which TPL will acquire data.</p> </div><div>Physical Demands <p>- Must be able to work at a computer terminal for extended periods of time.<br>\n- Must be able to move about campus and go to various TPL sites.</p> </div><div>Working Conditions <p>- Monday-Friday, standard 40 hour work week<br>\n- Some late evenings and/or weekends required to meet TPL deadlines</p> </div><div>Security Sensitive Yes </div><div> Special Instructions to Applicants <p>Salary expectations must be included in the cover letter.</p> </div><div>Quick Link for Posting http://jobs.rice.edu/postings/16863 </div>\n </div>\n <div>\n \n \n Job Duties\n <p></p>\n \n <div>Job Duty Name Essential Functions </div><div>Description of Job Duty <p>- Conducts specialized research and experiments<br>\n- Collects, tracks and analyzes data through the use of spreadsheets and databases<br>\n- Communicates results through verbal presentations, written reports, and written articles submitted for publication in conjunction with PI<br>\n- May assist in the administration of research project<br>\n- Performs all other duties as assigned</p> </div>\n </div>\n </div>\n </div>\n \n Applicant Documents\n <div>\n <b></b></div>"}