{"job title": "Data Scientist/Software Programmer (NOAA/STAR)", "company": "Riverside Technology, inc.", "city state": "– College Park, MD", "rating": "4.0", "job description": "Riverside Technology, inc. (Riverside), recognized internationally for providing innovative engineering, science, and information technology solutions to Federal and state agencies, private companies and international organizations, has an immediate opportunity for a Data Scientist/Software Programmer working on site at NOAA/NESDIS/STAR in College Park, Maryland.\n<br><br>\n<strong>POSITION</strong>\n<br><br>\nRiverside is seeking a junior to mid-level Data Scientist/Software Programmer to support NOAA’s Center for Satellite Applications and Research (STAR) and will work with atmospheric scientists on a variety of projects. In light of the explosive volume of data currently being received from satellites (a trend only expected to grow in the future) from NOAA and NOAA sources, this position will explore using Artificial Intelligence–based techniques (as well as other advanced techniques) for satellite remote sensing, radiative transfer modeling, surface emissivity modeling, data assimilation and data fusion, to produce a global, high resolution product, that exploits all data efficiently. The work will range from developing product assessment tools, to designing and developing scientific algorithms and applications including visualization, code integration, porting, testing and debugging, releasing and maintaining operational code and documenting software applications in both standard and High Performance Computing (HPC) environments.\n<br><br>\n<strong>Requirements</strong>\n<ul>\n <li>Bachelor’s degree in computer science, information systems, or software engineering; Masters Degree desired</li> <li>2+ years of experience in Data Science, Software Development</li> <li>Experience with advanced numerical methods including artificial intelligence, machine learning and neural networks including applicable programming tools such as Google’s TensorFlow, Keras would be a plus</li> <li>Proficiency in computer programming languages including Fortran 90/95, C,C++, JAVA, advanced statistical and display tools</li>  <li>Proficiency in web-based languages and scripts including JavaScript, PHP, CSS, and HTML is desired</li> <li>Experience with Linux platform, including shell scripting</li> <li>Experience with scripting languages such as Perl or Python</li> <li>Experience working with large environmental datasets, visualization and scientific code is desired</li> <li>Experience using software configuration management tools in an operational software team environment (such as Subversion, git, PVCS, etc.)</li> <li>Ability to effectively communicate technical information and work status accurately and reliably to project leads and managers</li> <li>US citizen preferred; Must be able to obtain and maintain a national agency check and background investigation after hire</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nRiverside is an Equal Opportunity Employer offering very competitive compensation and exceptional employee benefits."}