{"job title": "Data Scientist", "company": "RiverPoint", "city state": "– Kansas City, Missouri", "rating": "4.0", "job description": "<div>We’d love to talk to you about being a part of our Data Science discipline and Predictive Analytics team. Our group turns data into understanding by being active, educational, and supportive of every conversation about data and delivers innovative and actionable insights from complex datasets from broad and “squishy” requirements.</div>\n<br>\n<div><strong>The team is responsible for delivering data related objectives within team and Product Ecosystem by:</strong></div><ul><li>Working with high availability, fault tolerant, high performance, scalable systems.</li><li>Performing data exploration, statistical analysis, and modeling on how the world uses / engages our clients and our mobile products.</li><li>Creating data structures to support automation of analysis / modeling.</li><li>Providing opinionated feedback to management regarding data related technologies</li>\n</ul>\n\n<div>Technically our team needs</div>\n\n<ul>\n<li>Strong developers with Linux command line tools &amp; Python scripting (including Jupyter, Pandas, Scikit-learn, SciPy + NumPy.)</li><li>noSQL (i.e. ElasticSearch) and RDBMS (SQL Server, PostgreSQL and general OLTP)</li><li>AWS Redshift MPP (big bonus) and/or general OLAP expertise.</li>\n</ul>\n\n<div><strong>You’ll need familiarity with the following:</strong></div><ul><li>Strong statistical and modeling ability.</li><li>Working with very large data sets too large to fit into memory.</li><li>Linear/Logistic Regression and other linear ML techniques.</li><li>Non-linear Graph, neural networks, and other forms of non-linear ML.</li><li>Creating and maintaining multi-faceted Data Warehouse and dimensional design concepts.</li>\n</ul>\n\n<div>All the “plus stuff”</div>\n\n<ul>\n<li>Job Scheduling with Airflow.</li><li>Apache Spark.</li><li>Vowpal Wabbit (VW) framework.</li><li>Analyzing large-scale Personally Identifiable Information.</li><li>Scala and/or Java programming languages.</li><li>MSC or BSC in Information Technology / Data Science / Statistics or related.</li>\n</ul>\n\n<div>About Us</div><div>We are a fast-growing technical services company specializing in CRM, reputation management, lead generation, data mining, social and other solutions that serves a multi-billion dollar industry. Our solutions are built using cutting edge data science, mobile, web and cloud technologies.</div><div>Team members work in a highly collaborative environment and each contributor is expected to voice their ideas as we improve current and launch new products. We offer a competitive compensation &amp; benefits package, but more importantly we are dedicated professionals who learn and grow from one another, celebrate each other’s accomplishments and foster an environment that makes you work rewarding.</div><br>"}