{"job title": "Sr. Global Channel Analytics Manager", "company": "Riverbed Technology Ltd", "city state": "– San Francisco, California", "rating": "3.4", "job description": "<li>Sr. Global Channel Analytics Manager</li>\n\nJob Locations US-San Francisco\n<br>\nReq No. 2018-4655\n<br>\nCategory Sales\n<br><br>\nCompany Overview\n<br>\nWith a powerful combination of Digital Experience, Cloud Networking, and Cloud Edge solutions, Riverbed - The Digital Performance Company - provides a modern IT architecture for the digital enterprise, delivering new levels of operational agility and visibility, while dramatically accelerating business performance and outcomes. As businesses transform digitally and experiment with new technologies, they partner with Riverbed to push boundaries, increase performance, and rethink possible.\n<br><br>\nRiverbed is a pre-IPO opportunity with over $1 billion in revenue and 30,000+ customers - including 98% of the Fortune 100 and 100% of the Forbes Global 100.\n<br><br>\nAbout this Position\n<br>\nTitle: Sr. Global Channel Analytics Manager\n<br>\nLocation: San Francisco, CA\n<br><br>\nThe Sr. Global Channel Analytics Manager is a position at Riverbed, reporting to the SVP, Commercial Sales and Channel Strategy. A results-oriented individual that will have an integral responsibility include implementation and establishment of systems and processes to ensure accurate data capture, reporting and business intelligence analytics to support Commercial and Channel objectives. This individual will define, develop and deliver key reports, dashboards, tools and systems needed to offer quick and accurate business analytics for executive stakeholders, channel sales, and partners. Must have expertise in collecting data and able to analyze the data for business outcome decisions.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Rapidly analyze data sets from different sources; identify data relationships, business rules, data characteristics and business process gaps.</li>\n<li>Using data quality processes profile sales data domains, identify exceptions and resolve.</li>\n<li>Drive the creation of reports, dashboards and partner scorecards based on stakeholder requirements</li>\n<li>Manage data management related projects; work with cross-functional stakeholders to define and prioritize requirements, partner with IT to execute projects.</li>\n<li>Monitor project progress by tracking activity; resolving problems; publishing progress reports; recommending actions.</li>\n</ul>\n\n<strong>Knowledge/Skills Required:</strong>\n\n\n<ul>\n<li>Strong Analytical and communication skills. Proven track record of answering business questions using a quantitative, data-driven, analytical approach.</li>\n<li>Knowledge of data management principles and methodologies such as data quality, data governance and master data management and the application of those skills at an enterprise level</li>\n<li>Proven project management experience</li>\n<li>Ability to present complex information in an understandable and compelling manner</li>\n<li>Experience in visual data presentation &amp; data mining techniques and procedure</li>\n<li>Minimum of 5 years of experience with at least one data analysis &amp; visualization tool</li>\n<li>BI Analytics software (OBIEE, Tableau, Business Objects, Business Intelligence Cloud)</li>\n<li>Minimum 1 year experience with SFDC report and dashboard creation</li>\n<li>Advanced Excel skills</li>\n<li>Basic SQL</li>\n</ul>\n\nAbout Riverbed\n<br>\nIf you are a high-achiever who wants to be part of a dynamically growing, billion dollar plus company, then you should look closely at Riverbed. We offer the rewarding experience of working with the best minds in the industry that are changing the world through cutting edge technology and applications. The company has been recognized multiple years for attracting and retaining today's top talent as a great place to work by Glassdoor, Fortune magazine's 20 Great Workplaces in Tech and by numerous other publications.\n<br><br>\nLearn more at ****************.\n<br><br>\nRiverbed is proud to be an affirmative action (AA) and equal employment opportunities (EEO) employer. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.\n\n\n<ul>\n<li>LI-TC1</li>\n</ul>\n\nOptions"}