{"job title": "Cybersecurity Research Scientist", "company": "Riverside Research Institute", "city state": "– Dayton OH", "rating": "4.1", "job description": "<div>\nReturning Candidate? Log back in to the Career Portal and click on 'Job Browsing/History' and find the job you're looking for.</div><br>\n\n<div> 2018-009-OIC: Cybersecurity Research Scientist</div>\n<br>\n<div> \n<div> Directorate Open Innovations Center</div> <div> Location Dayton Research Center-OH</div> </div>\n\n<li>Riverside Research is seeking a motivated individual to join our Trusted and Resilient Systems research group to work on ground-breaking research to solve pressing problems in the Cybersecurity. The position will support both externally funded research efforts and, given Riverside Research’s long-standing position as a not-for-profit research institute, will support internally funded, revolutionary research in Cybersecurity. Ongoing research in the group includes security for cloud computing, embedded systems, and formal analysis.</li>\n\n<div><strong>Job Responsibilities:</strong></div><div> •\tConduct research in assessing and protecting cloud computing and embedded systems\n\n\n<ul>\n<li>Assist in developing formal validation system for security policies</li>\n<li>Software engineering, including capturing requirements, implementing methods in source code, and developing test cases</li>\n<li>Document results in technical reports, conference/journal proceedings, and presentations</li>\n<li>Other duties as assigned</li></ul></div>\n\n\n<div><strong>Qualifications:</strong></div><div> •\tMasters Science in Computer Science, Computer Engineering, Information Technology, or closely related field\n\n\n<ul>\n<li>Demonstrated proficiency with multiple programming languages</li>\n<li>Demonstrated experience conducting research in cybersecurity such as (but not limited to) software/system vulnerability analysis, cloud computing, cryptography</li>\n<li>Must be able to work both independently and in a team</li>\n<li>Superior communication skills, written and verbal</li>\n</ul>\n\nHighly Desired\n\n\n<ul>\n<li>Two+ years of work experience in research and software development, or a Ph.D. in a relevant field</li>\n<li>Experience with writing and presenting research in conferences or journals</li>\n<li>Willing to write proposals and securing external funding for Cybersecurity research</li>\n</ul>\n\nU.S. Citizenship Required and Eligibility to Obtain a Security Clearance</div> <div> Riverside Research strives to be one of America’s premier providers of independent, trusted technical and scientific expertise. As we continue to add experienced, technically astute staff, we are looking for highly motivated, talented team members that can help our DoD and Intelligence Community (IC) customers continue delivery of world class programs. As a not-for-profit, technology-oriented Defense Company, we believe service to customers and support of our staff is our mission. Our goal is to serve as a destination company by providing an industry-leading, positive, and rewarding employee experience for all who join us. We aspire to be a valued partner to our customers and to earn their trust through our unwavering commitment to achieve timely, innovative, cost-effective and mission-focused solutions.\n<br><br>\nAll positions at Riverside Research are subject to background investigations. Employment is contingent upon successful completion of a background investigation including criminal history and identity check.\n<br><br>\nThis contractor and subcontractor shall abide by the requirements of 41 CFR 60-741.5(a). This regulation prohibits discrimination against qualified individuals on the basis of disability, and requires affirmative action by covered prime contractors and subcontractors to employ and advance in employment qualified individuals with disabilities.\n<br><br>\nThis contractor and subcontractor shall abide by the requirements of 41 CFR 60-300.5(a). This regulation prohibits discrimination against qualified protected veterans, and requires affirmative action by covered contractors and subcontractors to employ and advance in employment qualified protected veterans.</div>\n<br>\n<div> Apply Now</div>"}