{"job title": "Scientist IV", "company": "RJ Reynolds Tobacco Co", "city state": "– Winston-Salem, NC", "rating": "3.2", "job description": "Reynolds American Incorporated is positively transforming the tobacco industry. Were a family of companies that strives for success in everything we do. The future inspires us because our people are igniting the breakthroughs that are redefining the ways adult tobacco consumers enjoy tobacco in the 21st century.\n<br><br>\nWhen other companies talk about growth, they only talk about size. At RAI, we focus on the growth of our people. We take pride in each others growth and well-being throughout our careers. We invest in your career and total well-being because we know our companies succeed when our people thrive.\n<br><br>\nAt the RAI companies youll have the opportunity to work on iconic brands and revolutionary products by collaborating with visionary, principled and passionate people every day.\n<br><br>\nThis position is with RJ Reynolds Tobacco Companythe second-largest U.S. tobacco company. The company's brands include Newport, Camel and Pall Mall.\n<br><br>\nThe position will be in the Tobacco Heated Products (THP) group within the RJRT Next Generation Products Product Development R&amp;D organization, specifically the Electric Tobacco Heated Products (ETHP) team. The role will support the development and delivery of compliant products in full alignment to RAI/BAT Next Generation Products (NGP) strategy. This will involve development of the products, sub-components, materials and knowledge required to deliver superior sensorial performance and consumer acceptability coupled with acceptable analytical determinations. The role will also require collaboration with BATs NGP organization for future product development. Products will span both US market applications and international export projects.\n<br><br>\nThe scientist must be strong in project management, possess strong leadership skills, and with minimal to moderate guidance, manage intra and inter-departmental project teams to execute against aggressive timelines. The individual must possess strong interpersonal skills with the ability to establish collaborative relationships. He/she must be capable of utilizing sound scientific principles to provide innovative solutions to complex problems. Strong communication skills are required to interact effectively with peers, management, external vendors, and BAT counterparts.\n<br><br>\nPrincipal Duties &amp; Responsibilities include:\n\n<ul>\n\n\t<li>Design prototypes which meet market needs, interpret sensory and analytical test results using sound scientific principles</li>\n<li>Collaborate cross functionally with various groups to develop new blends/components and new materials, insure product/process scale up and commercialization. Interact with outside vendors as necessary.</li>\n<li>The ability to multi-task numerous work streams at the same time, under demanding timelines.</li>\n<li>Insure internal business and regulatory process compliance in development and implementation of new/modified products.</li>\n<li>Prepare data/information to support regulatory product submissions.</li>\n<li>Prepare and publish results/reports as required.</li>\n</ul>\nRequired Knowledge and Experience:\n\n<ul>\n\n\t<li>Bachelors degree in a technical field.</li>\n<li>Leadership and problem solving skills.</li>\n<li>Ability to manage numerous, simultaneous and complex work activities.</li>\n<li>Analytical and intuitive interpretation skills.</li>\n<li>Excellent interpersonal and teamwork skills.</li>\n<li>Highly effective written/oral communication and presentation skills.</li>\n<li>Proficient in Microsoft Office software.</li>\n</ul>\nStrongly Preferred:\n\n<ul>\n\n\t<li>A minimum of three years experience in a consumer products industry.</li>\n<li>Vapor and/or electric device product development experience.</li>\n<li>Functional proficiency in PDM and with PPDP.</li>\n<li>Experience with FDA regulatory submissions.</li>\n</ul>\nThe Ideal Candidate will possess:\n\n<ul>\n\n\t<li>Have some measure of relevant experience/expertise with products incorporating an electric heating device.</li>\n<li>Previous experience with design, development, and troubleshooting electrical devices.</li>\n<li>Ability to drive collaborative efforts cross-functionally and externally with outsourced vendors.</li>\n<li>Ability to work and make decisions with minimal supervision.</li>\n<li>Ability to contribute to development of key strategies at the department level.</li>\n<li>Excellent project management, time management and team collaboration skills.</li>\n<li>Demonstrated effective oral and written communication skills.</li>\n<li>Demonstrated interpersonal skills of dependability, reliability, and credibility.</li>\n</ul>\n<u>Compensation/Targeted Bonus</u>\n\n<ul>\n\n\t<li>Competitive Annual Salary</li>\n<li>Targeted Annual Bonus</li>\n<li>Relocation assistance available for those who qualify.</li>\n</ul>\n<u>Benefit Summary</u>\n<br><br>\n<em>Our company offers very competitive compensation and benefit plans, including:</em>\n\n<ul>\n\n\t<li>401(k) plan that offers opportunity to save on pre- and post-tax basis up to 50 percent of eligible compensation. Company matches 100 percent of employee pre-tax/Roth (401k) contributions up to six percent</li>\n<li>Comprehensive health- and welfare-benefits package</li>\n<li>Eleven paid company holidays annually, plus a generous paid vacation plan based on length of service</li>\n<li>Company-paid sick and personal days, funeral leave and jury duty leave</li>\n<li>Confidential personal financial counseling service</li>\n<li>On-site health clinics and fitness centers</li>\n<li>A matching grants program that enables employees to direct and double their donations to qualifying charitable organizations of their choice</li>\n<li>Health-care advocacy service</li>\n<li>Volunteer service opportunities</li>\n<li>Federal credit union membership through Allegacy Federal Credit Union</li>\n<li>Extensive training opportunities</li> \n</ul>\n<strong>ABOUT OUR ORGANIZATION:</strong>\n<br><br>\nReynolds American Inc. is an indirect, wholly owned subsidiary of British American Tobacco p.l.c., and the U.S. parent company of R. J. Reynolds Tobacco Company; Santa Fe Natural Tobacco Company, Inc.; American Snuff Company, LLC; Niconovum USA, Inc.; Niconovum AB; R. J. Reynolds Vapor Company; Lorillard Licensing Company, LLC; and Reynolds Brands, Inc..\n<br><br>\nReynolds American Inc. and its affiliated companies is an Equal Opportunity / Affirmative Action Employer.\n<br><br>\n<strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.</strong>\n<br><br>\nOur organization offers a level of challenge, responsibility and creativity for motivated employees that stands apart from the crowd.\n<br><br>\nWe are also committed to employing a diverse workforce and valuing different perspectives, experiences and talents to maximize the company's potential for successfully achieving its business objectives.\n<br><br>\n-----------------------------------------------------------------------------------------------------------------------------------------------------------\n<br><br>\n<strong><u>Only</u></strong> applicants requiring reasonable accommodation for any part of the application and hiring process should contact us directly.\n<br><br>\nTelephone: 262-439-1893\n<br><br>\nEmail: TalentAcquisition@RJRT.com"}