{"job title": "Machine Learning Engineer", "company": "Robert Half", "city state": "– Stanford, CA", "rating": "3.3", "job description": "This dating application company is looking for a leader to help grow a team double in size and grow the platform to a more sophisticated machine learning scale. Work Culture: Working with an forward thinkers of a team. You?ll be surrounded by great minds with a goal to make it better. Comprehensive health coverage, competitive salary, 401(k) match Unlimited vacation Daily catered lunch and dinner, endless supply of refreshments, free massages, and social events\n\n\n<ul>\n<li>*Technology doesn't change the world. People do.**</li>\n</ul>\n\nAs a technology staffing firm, we can't think of a more fitting mantra. We're extreme believers in technology and the incredible things it can do. But we know that behind every smart piece of software, every powerful processor, and every brilliant line of code is an even more brilliant person.\n\n\n<ul>\n<li>*Leader among IT staffing agencies**</li>\n</ul>\n\nThe intersection of technology and people ? it's where we live. Backed by more than 65 years of experience, Robert Half Technology is a leader among IT staffing agencies. Whether you're looking to hire experienced technology talent or find the best technology jobs, we are your IT expert to call.\n<br><br>\nWe understand not only the art of matching people, but also the science of technology. We use a proprietary matching tool that helps our staffing professionals connect just the right person to just the right job. And our network of industry connections and strategic partners remains unmatched.\n<br><br>\nApply for this job now or contact our branch office at 888.674.2094 to learn more about this position.\n<br><br>\nAll applicants applying for U.S. job openings must be authorized to work in the United States. All applicants applying for Canadian job openings must be authorized to work in Canada.\n<br><br>\n? 2018 Robert Half Technology. An Equal Opportunity Employer M/F/Disability/Veterans.\n<br><br>\nBy clicking 'Apply Now' you are agreeing to Robert Half Terms of Use.\n\n\n<ul>\n<li>Req ID:* 00420-9501611664</li>\n<li>Functional Role:* Application Development Mgr</li>\n<li>Country:* USA</li>\n<li>State:* CA</li>\n<li>City:* Stanford</li>\n<li>Postal Code:* 94020</li>\n<li>Compensation:* $400,000.00 to $500,000.00 per year</li>\n<li>Requirements:* Responsibilities: Work with big data (1.6B+ user swipes per day) Work on exciting problems for recommendations to improve the user experience Develop data-driven approaches to understand user profiles Design deep learning models for computer vision and natural language processing Design and implement state-of-the-art machine learning algorithms in distributed machine learning frameworks such as Spark Requirements: A minimum of a Master's Degree in Computer Engineer or related field 2+ years professional experience Hands-on experience in designing and building highly scalable distributed ML models Proficiency in Python, SQL Bonus Points: In-depth knowledge of deep neural networks, classification techniques, computer vision, and natural language processing Experience with big data frameworks such as Spark and Hadoop. Experience with AWS Proficiency in deep learning framework: Tensorflow, Keras, etc. A strong record of publications in top conferences such as NIPS, ICML, and KDD.</li>\n</ul>"}