{"job title": "Sr. Data Engineer", "company": "Robert Half", "city state": "– Sunnyvale, CA", "rating": "3.3", "job description": "We are looking for a Data Engineer who will design build data pipelines for handling real-time data streams and integrating with machine learning models. Its a long term contract opportunity. Please send resumes to suman.sandhu@rht.com - 408-271-9063\n\n\n<ul>\n<li>*Technology doesn't change the world. People do.**</li>\n</ul>\n\nAs a technology staffing firm, we can't think of a more fitting mantra. We're extreme believers in technology and the incredible things it can do. But we know that behind every smart piece of software, every powerful processor, and every brilliant line of code is an even more brilliant person.\n\n\n<ul>\n<li>*Leader among IT staffing agencies**</li>\n</ul>\n\nThe intersection of technology and people ? it's where we live. Backed by more than 65 years of experience, Robert Half Technology is a leader among IT staffing agencies. Whether you're looking to hire experienced technology talent or find the best technology jobs, we are your IT expert to call.\n<br><br>\nWe understand not only the art of matching people, but also the science of technology. We use a proprietary matching tool that helps our staffing professionals connect just the right person to just the right job. And our network of industry connections and strategic partners remains unmatched.\n<br><br>\nApply for this job now or contact our branch office at 888.674.2094 to learn more about this position.\n<br><br>\nAll applicants applying for U.S. job openings must be authorized to work in the United States. All applicants applying for Canadian job openings must be authorized to work in Canada.\n<br><br>\n? 2018 Robert Half Technology. An Equal Opportunity Employer M/F/Disability/Veterans.\n<br><br>\nBy clicking 'Apply Now' you are agreeing to Robert Half Terms of Use.\n\n\n<ul>\n<li>Req ID:* 00420-9501613400</li>\n<li>Functional Role:* Database Developer</li>\n<li>Country:* USA</li>\n<li>State:* CA</li>\n<li>City:* Sunnyvale</li>\n<li>Postal Code:* 94085</li>\n<li>Compensation:* DOE</li>\n<li>Requirements:* Responsibilities: ? Design Build data pipelines for handling real-time data streams and integrating with machine ? learning models. ? Understand and analyze large, complex data sets to identify anomalies and data quality issues. ? Design and Build Data quality and anomaly detection framework for IoT timeseries data. ? Build data pipeline with Apache Spark in Java and Python and Google Cloud Platform DataProc. ? Work with cross functional stakeholders to assist with their data needs via optimal reusable ? data pipelines. Qualifications ? We are looking for a candidate with 7+ years of experience in a Data Engineer role, with ? Bachelor or Master?s degree in computer science or related field. ? Highly Proficient in Java programming language with Python programming skills as a huge ? plus. ? 3+ years of hands on experience in building and optimizing big data pipelines using Apache ? Spark in Java and Python programming languages. ? 2+ years of hands on experience of building integrating data pipelines with machine learning ? models. ? 1+ years of experience with Google Cloud Platform esp. Google Pub-Sub, Big Query, Data Proc, ? Data Flow, Cloud Storage. ? Highly desirable to have experience on data quality analysis and detection. ? Experience with big data tools: Kafka, Cassandra, Hadoop, Storm and Spark</li>\n</ul>"}