{"job title": "Data Analyst", "company": "Robert Half", "city state": "– Laguna Niguel, CA", "rating": "3.3", "job description": "OfficeTeam is seeking multiple data analysts to help the logistics and supply chain department of a large company in south Orange County. As a growing company we are assisting in the on boarding of multiple temporary candidates. Please find the responsibilities for this position below: - Assist with large masses of data - Responsible for searching for item numbers and inputting into Oracle - Process electronic faxed orders - Coordinate with necessary partnerships to ensure the most success - Maintain daily updates of order lines - Create order requests<br><br>OfficeTeam is the world's leader in professional staffing for office support jobs, focusing exclusively on the temporary and temporary-to-full-time placement of professionals in the administrative field. We are faster at finding you work because of the depth of our client network. Specifically, our professional staffing managers connect with thousands of hiring managers in North America every week to find your office support job opportunities. We evaluate all of our OfficeTeam temporaries' skills and match them with the needs of top employers in their area.<br><br>Apply for this job now or contact us today at 888.981.6731 for additional information.<br><br>All applicants applying for U.S. job openings must be authorized to work in the United States. All applicants applying for Canadian job openings must be authorized to work in Canada.<br><br>? 2018 OfficeTeam. A Robert Half Company. An Equal Opportunity Employer M/F/Disability/Veterans.<br><br>By clicking 'Apply Now' you are agreeing to Robert Half Terms of Use.<br><br>*Req ID:* 00760-9501615964<br><br><br>*Functional Role:* Account Executive/Staffing Manager<br><br><br>*Country:* USA<br><br><br>*State:* CA<br><br><br>*City:* Laguna Niguel<br><br><br>*Postal Code:* 92677<br><br><br>*Compensation:* $16.00 to $16.00 per hour<br><br><br>*Requirements:* - Any experience in shipping or supply chain would be helpful - Experience on Oracle would be helpful - Minimal administrative experience is necessary - Need to have a high attention to detail - Ability to work with a large sum of data If you are interested please send your resume to kristina.hughes@officeteam.com"}