{"job title": "Big Data Engineer", "company": "Robert Half", "city state": "– Los Angeles, CA", "rating": "3.3", "job description": "Robert Half is working closely with a company in El Segundo on filling and expanding their Data Engineer position. ***For immediate consideration, please email resumes directly to Ali Scott at ali.scott@rht.com*** Title: Big Data Engineer Target Salary: <br>**Technology doesn't change the world. People do.**<br><br>As a technology staffing firm, we can't think of a more fitting mantra. We're extreme believers in technology and the incredible things it can do. But we know that behind every smart piece of software, every powerful processor, and every brilliant line of code is an even more brilliant person.<br><br>**Leader among IT staffing agencies**<br><br>The intersection of technology and people ? it's where we live. Backed by more than 65 years of experience, Robert Half Technology is a leader among IT staffing agencies. Whether you're looking to hire experienced technology talent or find the best technology jobs, we are your IT expert to call.<br><br>We understand not only the art of matching people, but also the science of technology. We use a proprietary matching tool that helps our staffing professionals connect just the right person to just the right job. And our network of industry connections and strategic partners remains unmatched.<br><br>Apply for this job now or contact our branch office at 888.674.2094 to learn more about this position.<br><br>All applicants applying for U.S. job openings must be authorized to work in the United States. All applicants applying for Canadian job openings must be authorized to work in Canada.<br><br>? 2018 Robert Half Technology. An Equal Opportunity Employer M/F/Disability/Veterans.<br><br>By clicking 'Apply Now' you are agreeing to Robert Half Terms of Use.<br><br>*Req ID:* 00320-0010730607<br><br><br>*Functional Role:* Network Engineer<br><br><br>*Country:* USA<br><br><br>*State:* CA<br><br><br>*City:* Los Angeles<br><br><br>*Postal Code:* 90045<br><br><br>*Compensation:* $90,000.00 to $120,000.00 per year<br><br><br>*Requirements:* 1. Big Data frameworks with Hadooop, Spark, MapReduce, HDFS, Hive, Sqoop, etc... 2. ETL/ELT and reporting/analytic tools 3. Developing data engineering using Python, Java or any similar programming or scripting languages 4. Experience with RESTful web services, open API development, SOA concepts ***For immediate consideration, please email resumes directly to Ali Scott at ali.scott@rht.com***"}