{"job title": "Data Scientist", "company": "Robert Half", "city state": "– San Mateo, CA", "rating": "3.3", "job description": "Security Data Scientist San Mateo, CA FTE, Direct Hire We?re a leading cybersecurity startup protecting over 200 companies from sophisticated cybersecurity attacks. Our machine learning platform identifies dynamic threats through 12 advanced models which profile network threats, allowing them to be quarantined, investigated, or destroyed. Our tech stack : Front End : Ember.js Backend : Rails Database : PostgreSQL, Elastic Search Infrastructure : Amazon Web Services Data Analytics : Java, Python Data Pipeline: Elastic Cache, Kinesis, Lambda (our version of ELK) RESPONSIBILITIES: Work with internal and external stakeholders to identify opportunities to advance our products and services Develop statistical models and train machine learning models to identify sophisticated security threats Develop models to visualize real time data for cross functional teams Utilize modern and emerging software packages to stay on the cutting edge of threat identification REQUIREMENTS: 5+ years of data science for a high volume software company 1+ year of experience preferred from a real time analytics environment Extensive experience with Python, R, SAS, scikit-learn, and other tools Deep knowledge of predictive analytics Experience working with large data architectures For immediate consideration, send your resume to: Kyle Grimm Lead Recruiting Manager kyle.grimm@rht.com<br><br>**Technology doesn't change the world. People do.**<br><br>As a technology staffing firm, we can't think of a more fitting mantra. We're extreme believers in technology and the incredible things it can do. But we know that behind every smart piece of software, every powerful processor, and every brilliant line of code is an even more brilliant person.<br><br>**Leader among IT staffing agencies**<br><br>The intersection of technology and people ? it's where we live. Backed by more than 65 years of experience, Robert Half Technology is a leader among IT staffing agencies. Whether you're looking to hire experienced technology talent or find the best technology jobs, we are your IT expert to call.<br><br>We understand not only the art of matching people, but also the science of technology. We use a proprietary matching tool that helps our staffing professionals connect just the right person to just the right job. And our network of industry connections and strategic partners remains unmatched.<br><br>Apply for this job now or contact our branch office at 888.674.2094 to learn more about this position.<br><br>All applicants applying for U.S. job openings must be authorized to work in the United States. All applicants applying for Canadian job openings must be authorized to work in Canada.<br><br>? 2018 Robert Half Technology. An Equal Opportunity Employer M/F/Disability/Veterans.<br><br>By clicking 'Apply Now' you are agreeing to Robert Half Terms of Use.<br><br>*Req ID:* 00420-0010722970<br><br><br>*Functional Role:* Business Analyst<br><br><br>*Country:* USA<br><br><br>*State:* CA<br><br><br>*City:* San Mateo<br><br><br>*Postal Code:* 94401<br><br><br>*Compensation:* DOE<br><br><br>*Requirements:* Python"}