{"job title": "Senior Data Scientist", "company": "Roku", "city state": "– Los Gatos, CA", "rating": "2.9", "job description": "<strong><u>About Roku:</u></strong>\n<br><br>\nRoku pioneered streaming to the TV. We connect users to the streaming content they love, enable content publishers to build and monetize large audiences, and provide advertisers with unique capabilities to engage consumers. Roku streaming players and Roku TV models are available around the world through direct retail sales and licensing arrangements with TV brands and pay TV operators.\n<br><br>\n<strong><u>The Role:</u></strong>\n<br><br>\nAt Roku, data is at the center of everything we do. Our passion for data, has made us a leader in the world of data-driven decision-making. Leveraging data, the Data Science and Analytics team delivers insight driven outcomes at scale to help Roku improve performance. We hire individuals with a passion for data, discovery and innovation to drive results by providing actionable customer-centric insights. The Senior Data Science will distill stakeholder needs into precise data science problem statements, define the scope of data-driven solutions, apply latest techniques in AI/ML/DL to build solutions that power business decision making and drive adoption of these solutions.\n<br><br>\n<strong><u>Responsibilities:</u></strong>\n\n<ul>\n<li>Lead a team of data scientists to explore &amp; process data from disparate sources and generate actionable insights and evaluate tools &amp; cutting-edge AI/ML/DL techniques to build predictive modeling solutions that improve business outcomes</li></ul>\n\n\n<ul>\n<li>Translate machine learning results, business value and insights to stakeholders in plain, business-centric language with easy-to-understand visualization to set expectations and drive adoption</li>\n<li>Build end-to-end data pipeline solutions and whenever appropriate, partner with data engineers to validate and deploy solutions in an efficient, sustainable and usable manner</li></ul>\n\n\n<ul>\n<li>Manage the design, execution, and analysis of A/B or multivariate testing programs; driving rigor, building a testing culture and enhancing measurement capabilities throughout the organization</li>\n<li>Drive the use of data science methods to generate and test hypotheses and performing analytical deep-dives to identify problems, opportunities and actions required</li>\n</ul>\n<strong><u>Qualifications:</u></strong>\n\n<ul>\n<li><strong>Technical</strong>: You have a fundamental understanding of statistical modeling / predictive analysis / machine learning / deep learning / optimization. You have hands-on experience developing data science solutions, from concept to production, and selecting the right tool for the job at hand. You can work in Python, R, Spark, Scala. Familia with Dockers, Kafka, APIs, SQL. You understand modern cloud computing. You have experience prototyping and implementing data science solutions in an enterprise.</li>\n<li><strong>Innovation</strong>: You continually research and evaluate emerging technologies. You stay current on published state-of-the-art algorithms and models. You design and run experiments, research new algorithms, and find new ways of optimizing risk, profitability, and customer experience. You obsess over model improvement, stability, risk and governance. Fundamentally, you disrupt &amp; deliver a better way, consistently.</li>\n<li><strong>Production</strong>: You develop and implement data products that the business (as your customer) can seamlessly integrate into decision making. You proactively analyze customer needs and drive towards impactful business outcomes.</li>\n<li><strong>Leadership</strong>: You are tenacious and are always moving the ball forward.</li>\n<li><strong>Communication</strong>: You communicate complex ideas clearly and simply.</li></ul>\n\n\n<ul>\n<li><strong>Experience</strong>: You have a bachelor's degree or higher. You have 3+ years of experience in a data science field.</li>\n<li><strong>Education</strong>: You have strong educational credentials in Math, Statistic, Economics, Computer Science or related quantitative field</li>\n</ul>\n\n#LI-SS1"}