{"job title": "Data Scientist", "company": "Root Level Technology", "city state": "– Coconut Creek, FL", "rating": "NA", "job description": "<div>Root Level Technology is looking for an experienced and talented Senior Frontend Developer to join our team. In this role, you will be working on various projects for an array of applications taking advantage of emerging Cloud Technologies.\n<br><br>\n<strong>Responsibilities:</strong></div><strong>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Daily delivery of work inside the PM tool</li>\n<li>Adhering to best practice development practices</li>\n<li>Attending all sprint ceremonies on a consistent and timely manner</li>\n<li>Meeting delivery deadlines on assigned work</li>\n</ul>\n\n<strong><div>\nMinimum Qualifications:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Experience with Spark, Scala or Python</li>\n<li>Avro or protobuff, Hive</li>\n<li>Knowledge of multiple algorithms, such as random forest, regression trees etc.</li>\n<li>Hands on experience with AWS, Azure and/or GCP in a production environment</li>\n</ul>\n\n<strong><div>\nThe Ideal Candidate:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Deals well with ambiguous or undefined problems; ability to think abstractly and guide others</li>\n<li>Comfortable performing requirements analysis, interfacing with stakeholders of various levels and documenting solutions</li>\n<li>Excellent interpersonal skills</li>\n<li>Energetic team player who works well across boundaries and readily adapts to change and enjoys rapid development</li>\n<li>Is confident in their skills, abilities and is willing to share their knowledge, while learning from others.</li>\n</ul>\n\n<div>\n<strong>About Us</strong>\n<br><br>\nRoot Level Technology is a cloud strategy partner. We are the seamless extension of your development and programming teams. We provide a concierge-style support experience for every client, no matter the size. We are an agile shop at the core, with a focus on Continuous Integration and Continuous Deployment. We are the hold your hand, wake us up at midnight, 5-star, real deal support clients have always wanted.\n<br><br>\n<strong>Whats in it for you?</strong>\n<br><br>\nAn Amazing company that is GROWING QUICKLY!\n<br><br>\nComplete ownership and accountability over the role and function area\n<br><br>\nYou get to work with a fun/interesting group of people.\n<br><br>\nReal transparency into the rest of the company</div>"}