{"job title": "Data Scientist - Operations / Products", "company": "RPM ReSearch", "city state": "– Iowa, United States", "rating": "NA", "job description": "Data Scientist Operations / Products<br><br>Location: Des Moines Iowa<br><br>Year(s) Experience: 5-10<br><br>Bonus potential,<br><br>Join a large global leader as a Quantitative Scientist<br>responsible for the corporate involvement of data management,<br>digital platform development, prototyping, and problem-solving<br>initiatives for matrix organization. In this role, you will use<br>advanced mathematical models, operations research techniques,<br>simulation, quantitative genetics and strong business acumen to<br>deliver insight, recommendations, and solutions for Product<br>Development science and business problems. You will formulate and<br>apply mathematical modeling and other optimizing methods to<br>develop and interpret information that assists management with<br>decision making and policy formulation.<br><br>Play a crucial role in leading world-class quantitative genetics,<br>computational biology, logistics and distribution capacity<br>planning and diagnostics, network design, flow path modeling, and<br>operations research on regional and global levels. Help drive<br>decisions that optimize total cost, lead time on strategic and<br>tactical, and more opportunistic levels. You will present<br>compelling, validated stories to all levels of the organization,<br>including peers, senior management, and internal customers to<br>drive both strategic and operational changes in the business.<br><br>Qualifications:<br><br>--- MS or BS in Engineering, Math, Physics, Systems or related<br>with 5+ years experience in quantitative data science,<br>statistics, and data management supporting Product Development<br>and Operations Research for global operating companies.<br>--- Advanced degree in statistics, data science, or computational<br>biology<br>--- Experience with machine learning algorithms and statistical<br>techniques are highly desired<br>--- Expertise in many of the following: Monte Carlo simulations,<br>decisions analysis, stochastic models, system dynamics and<br>forecasting<br>--- Experience and passion for identifying and solving analytical<br>problems involving big data sets using quantitative approaches to<br>generate insights from data<br>--- Experience with commercial optimization software (i.e.,<br>CPLEX, Xpress, Gurobi etc.) is desired<br>--- Experience with statistical programming packages like R,<br>MATLAB and Python required<br>--- Experience in using MIP/LP/IP/QP optimization packages in<br>either of R/Python/Matlab is highly desired<br><br>Responsibilities:<br><br>--- Serve as a resource for experimental design, quantitative<br>genetics and data analysis methodologies for target Product<br>Development scientists<br>--- Maintain expertise in the proper application and use of<br>computational tools for the management of materials, data<br>management and analysis, and reporting<br>--- Serve as subject matter expert for the ongoing development<br>and optimization of critical computational applications<br>--- Serve as the user support for users within the defined<br>workgroup, for proper application and use of computational tools<br>for the management of materials, data management and analysis,<br>and reporting<br>--- Conduct regular new user and refresher training on selected<br>computational tools<br>--- Communicate opportunities for improvement of computational<br>applications to the development or maintenance teams, based on<br>personal use or user feedback<br>--- Prepare and conduct training to R&amp;D community on relevant<br>topics of statistics and data science<br><br>For More Information Apply or Contact Brad McMillan at<br>704-946-8209 or Brad@RPMResearch.Solutions"}