{"job title": "Data Scientist", "company": "RS Energy Group", "city state": "– Location: Conshohocken, PA", "rating": "5.0", "job description": "<div><strong>Title: Data Scientist</strong>\n<br><br>\n<strong>Location: Conshohocken, PA</strong>\n<br><br>\n<strong>Type: Full Time</strong>\n<br><br>\n<strong>Start Date: Immediately</strong>\n<br><br>\n<strong><u>Data Scientist</u></strong>\n<br><br>\nRS Energy Group is a data-driven organization specializing in the delivery of advanced analytics, research and data science to the most advanced investors and producers in the world. We work in an innovative, fast-paced and dynamic environment, with interdisciplinary teams focused on leveraging cutting-edge technology, data and machine learning to uncover unique investment ideas and provide solutions for producers. Headquartered in Calgary, we have offices in Houston, New York, Los Angeles and Philadelphia.\n<br><br>\nThis <strong>Data Scientist</strong> position based in our <strong>Conshohocken, PA</strong> office includes the opportunity to work closely with domain Subject Matter Experts in applied statistics and data science techniques, creativing solutions to some of the most interesting challenges faced in the analysis of oil and gas assets today.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Build statistical and mathematical solutions to approach business problems in the oil &amp; gas industry.</li>\n<li>Build prototypes and productize advanced predictive modeling and machine learning tools.</li>\n<li>Work together with Data Engineers and Software Developers to evaluate the technical trade-offs of tools to build simple, yet robust, data science pipelines.</li>\n</ul>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Excellent understanding of machine learning techniques and algorithms are required such as regression, decision trees, ensemble methods, dimensionality reduction, clustering, regularization and cross-validation.</li>\n<li>Solid programming skills and experience designing prototypes using Python (NumPy, pandas).</li>\n<li>Experience in multivariate analysis and modeling solutions.</li>\n<li>Experience in implementing optimization methods or deep learning.</li>\n<li>Demonstrated ability to conduct independent research utilizing large data sets.</li>\n</ul>\n<strong>Additional Qualifications (not required):</strong>\n\n<ul>\n<li>Quantitative background with advanced degrees (Master +) in Statistics, Computer Science, Informatics, Data Science, Mathematics or Actuarial Science or equivalent experience.</li>\n<li>Experience building large scale data science pipelines.</li>\n<li>Familiarity with details of implementing algorithms on multi-core CPUs, clusters (MPI), GPUs, heterogeneous clusters, distributed frameworks (e.g. Spark, Hadoop).</li>\n<li>Strong written and verbal communication skills required with an ability to simply explain complex information.</li>\n</ul>\nRS Energy Group offers a competitive salary, a generous benefits package, and an unbeatable work environment. This is a great time to join our organization!\n<br><br>\nRS Energy Group is an equal opportunity employer. By embracing diversity, we gain strength through our people.\n<br><br>\nTo learn more, please visit our website at <strong>www.rseg.com</strong></div>\n<br>"}