{"job title": "Data Scientist", "company": "Rubicon Global", "city state": "– Atlanta, GA", "rating": "4.3", "job description": "<strong>Description:</strong>\n<br><br>\nReporting to the Product Manager Data &amp; Analytics, the data scientist will support the translation of big data into internal and external dashboards &amp; reports and create models to drive company performance. This role will play an integral part in building Rubicon's competitive advantage through leveraging data for unique customer and vendor insights.\n<br><br>\n<strong>Duration: Full-time</strong>\n<br><br>\n<strong>Location: Atlanta, Georgia</strong>\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Develop machine learning models.</li>\n<li>Dive into large, complex real-world datasets and produce innovative analysis and predictive models.</li>\n<li>Conduct statistical analysis of big data to develop insights from the measured performance metrics, and contribute to root cause analysis and resolution of identified performance gaps</li>\n<li>Work with mapping / routing tools (ex. ArcGIS) to create optimized routes for haulers.</li>\n<li>Propose and prioritize changes to reporting and create additional metrics and processes based on program changes and customer requirements</li>\n<li>Support efforts to ensure data integrity across all platforms and departments</li>\n<li>Contribute to idea generation for additional process improvements and automation</li>\n<li>Work closely with the rest of the Rubicon team to create ad-hoc reports to support timely business decisions and project work</li>\n</ul>\n<strong>Preferred Experience/Qualifications:</strong>\n\n<ul>\n<li>Bachelor's degree in Mathematics, Computer Sciences, Engineering or a related field from a four-year college or university; or five years dashboard development experience</li>\n<li>Ability to work effectively with IT and internal customers to mine the right data sources efficiently and accurately</li>\n<li>Proficient SQL skills and mastery of at least one statistical analytics tool; ideally with experience in Microsoft Dynamics, Microsoft SQL server, Microsoft Access, R, SPSS and Tableau (or any business intelligence tools)</li>\n<li>Experience with building and maintaining GIS models using ESRI's products.</li>\n<li>Proven statistical skills and an ability to use hard data and metrics to back up assumptions, develop business cases, and complete root cause analyses</li>\n<li>A clear passion for learning new business analysis techniques independently and continuously</li>\n<li>Understanding of BI best practices/methodologies, relational database management concepts, dimensional data modeling, data warehouse concepts and reporting techniques</li>\n<li>Ability to work directly with end users to ensure results meet their needs</li>\n<li>Strong interpersonal skills, capable of writing recommendations and interacting with company personnel on complex topics</li>\n<li>Ability to present clear, concise reporting on concurrent projects and issues</li>\n<li>Effective verbal and written communication skills</li>\n</ul>\n<strong>About Rubicon Global</strong>\n<br><br>\nRubicon Global is a technology company that provides waste, recycling, and smart city solutions to businesses and governments worldwide. It develops and deploys a full suite of cloud-based solutions to help its customers and network of independent waste haulers work towards more sustainable waste and recycling practices, uncover cost savings, and improve operations through data analytics. Using its proprietary technology platform, Rubicon helps its partners find economic value in their waste streams and confidently execute on their sustainability goals, always with an eye towards those solutions that have long-term economic viability. The company has over 1,000,000 service locations worldwide, is headquartered in Atlanta, GA, and has core teams in New York City and San Francisco. Rubicon is a Certified B Corporation and was named a Great Place to Work in 2018. Learn more at www.RubiconGlobal.com.\n<br><br>\n<strong>Rubicon Global is a Certified B Corp and an Equal Employment Opportunity/Affirmative Action Employer. We also maintain a Drug-Free Workplace.</strong>"}