{"job title": "Principal Research Scientist", "company": "Ruby Plants", "city state": "– San Leandro, CA", "rating": "NA", "job description": "Ruby Plants seeks to accelerate photosynthesis to ensure food security for all and clean the planet’s air. We are building a team of experts from hardware, molecular biology, machine learning, distributed systems and biochemistry dedicated to making a world-changing impact.\n<br><br>\nWe are hiring principal level research scientists to lead development in two ways:\n\n<ul>\n<li>our discovery pipeline – the protocols, assays, and techniques</li>\n\n<li>the photosynthetic trait development – definition and biological foundations</li>\n</ul>\n<strong>As a principal research scientist, you will drive the research vision of the company</strong> by defining the protocols for gene editing, propagation, and phenotyping. You will define the research agenda, breaking down huge problems into measurable milestones. You will organize the research effort to align with the companies goals.\n<br><br>\n<strong>You will inform the development of photosynthesis as a trait with fundamental biological knowledge.</strong> You will leverage your existing knowledge to drive the research process and teach others to fill their knowledge gaps. When unknowns are encountered, you will design and carry out experiments to determine the fundamental knowledge to continue development.\n<br><br>\n<strong>You will research and implement fundamental advances in cell-based plant research</strong>. Plant science can be slow. We are currently developing a novel mechanism for research in protoplasts that enables orders of magnitude research speed up. You will be the biological voice in this interdisciplinary effort.\n<br><br>\n<strong>You will work within an interdisciplinary team of machine learning, software, and hardware engineers</strong> to develop novel high throughput, low cost assays. Ruby Plants is an integrated science company – we realize that the most fundamental and valuable advances humanity makes come from the combination of diverse skills and world views. We carry out this vision by composing small teams with distinct backgrounds.\n<br><br>\n<strong>As a Principal research scientist, you will help recruit others to your team.</strong> You will help source candidates from relevant academic and private institutions. You will conduct interviews and hiring meetings. You understand that to achieve success, we must invest in our people as much as our technology.\n<br><br>\n<strong>You will drive acquisition of novel technology by informing machine purchasing decisions.</strong> You will identify key suppliers in a scientifically informed manner.\n<br><br>\n<strong>Valuable experience and knowledge:</strong>\n\n<ul>\n<li>CRISPR/CAS9 experience</li>\n\n<li>Development of novel optical / microfluidic / molecular assays</li>\n\n<li>High throughput sequencing</li>\n\n<li>Molecular plant biology</li>\n\n<li>Microfluidic-based assays</li>\n\n<li>Protoplast protocols including production and regeneration</li>\n\n<li>The biology and chemistry of the photosynthetic apparatus</li>\n\n<li>High throughput phenotyping</li>\n\n<li>Plant development and morphology</li>\n\n<li>Plant tissue culture including tissue culture of agronomic crops such as maize and soybean</li>\n</ul>\nWhile we expect principal research scientists to bring valuable expertise, it isn't necessary to have all of the above skills – we expect that you will develop new talents as they are needed. There is enormous opportunity for personal growth given outsized impact.\n<br><br>\nWe are funded and well connected in Silicon Valley. We offer competitive salaries and significant company equity. We have a small team, but big ambitions.\n<br><br>\nTo apply, please email charles@rubyplants.com with a CV, and a few sentences on why you're interested."}