{"job title": "Marketing Data Analyst", "company": "RumbleOn", "city state": "– Coppell, TX", "rating": "5.0", "job description": "RumbleOn is seeking a highly motivated, self-starter to be our next Marketing Data Analyst! This position will handle analytics for our fast-paced, cutting edge company with regards to marketing initiatives, sales, and overall company goals; including the areas of list strategy, development and segmentation, list aggregation, campaign performance analysis, and forecasting and reporting as it relates to business planning.\n\n\n<ul>\n<li>Do you have a deep understanding of quantitative and qualitative market analysis?</li>\n<li>Do you have experience writing SQL Queries and creating visualizations of key data points?</li>\n<li>Are you experienced in the Digital Marketing landscape?</li>\n</ul>\n\nIf yes, join our growing e-Commerce company that is taking the powersports industry by storm! We are a group passionate, driven, hard-working people who like to have fun! We offer a laid back environment where your ideas are heard, your talents are valued, and you are surrounded by amazingly supportive people!\n<br><br>\nThe ideal candidate will have a demonstrated ability to use data to advise the Marketing Director and Stakeholders on how best to drive business results and maximize and optimize lead acquisition through our Digital Advertising Channels. This candidate must blend a high proficiency in accessing and manipulating data with a strong ability to turn data into strategic insights and recommendations. The role requires deep knowledge of customer acquisition, marketing automation, and list segmentation in order to identify effective lead segments at the right time, to deliver maximum ROI, as well as match-back customer journeys that are tied to company goals.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Provide data-driven analysis to uncover and articulate key insights and recommendations to various stakeholders in the organization</li>\n<li>Focus on segmentation, data quality and enrichment, and reporting while identifying a high volume of quality contacts (prospects) that ultimately drive sales leads.</li>\n<li>Perform universe segmentation; use data to advise marketing managers and director, sales and leadership team on how best to drive business results and maximize lead acquisition and conversion</li>\n<li>Determine more cost-effective means to deliver on marketing objectives through use of marketing automation, by identifying most effective segments and channels</li>\n<li>Continually monitor leads based on engagement levels, sales cycle length, deal source, and other criteria</li>\n<li>Monitor and track effectiveness of all campaign efforts and channel attribution</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>Bachelor's degree Preferred but not Required if you have proven experience.</li>\n<li>3+ Years' Experience in Marketing Data Analysis and working with Digital Marketing teams and campaigns</li>\n<li>Must be proficient in utilizing, visualizing and building dashboarding tools</li>\n<li>Must be able to write SQL Queries and Join Data Tables</li>\n<li>Google Analytics Certification</li>\n<li>Must have a background in, or have worked in Digital Focused Marketing Teams</li>\n<li>Experience with business data analysis and forecasting, universe segmentation, customer acquisition, email marketing, marketing automation, CRM and campaign analysis</li>\n<li>Report creation experience with business intelligence tools</li>\n<li>1-2 Years Experience with Domo (strongly preferred)</li>\n<li>Experience with Hubspot (a plus)</li>\n</ul>\n\n<strong>Benefits</strong>\n<br><br>\n<strong>What RumbleOn Offers You:</strong>\n<br><br>\nA fun, relaxed, and casual work environment with awesome people by your side working as a team to ensure the entire group's success! Plus...\n\n\n<ul>\n<li>Healthcare, Dental, &amp; Vision Insurance (RumbleOn pays 100% of employees medical premium!!!)</li>\n<li>Competitive compensation packages based on experience and skills</li>\n<li>Competitive Vacation/PTO (12 PTO days year 1, plus 7 Paid Holidays for a total of 19 days year 1!)</li>\n<li>Close knit, open, inviting startup environment where you can make your mark and where your ideas are heard!</li>\n<li>Employee discounts on purchases</li>\n<li>Fully stocked kitchen with drinks and snacks all day</li>\n<li>Fun company events</li>\n<li>The opportunity for growth and a solid long term career...we promote from within!!</li>\n<li>And more</li>\n<li>All applicants must pass pre-employment testing to include: background checks, MVR, and drug testing in order to qualify for employment*·</li>\n</ul>\n\nApply for this job\n<br><br>\n(function () { var conversion = false; var script = document.createElement('script'); script.type = 'text/javascript'; script.src = 'https://www.linkedin.com/mjobs/awli/awliWidget'; script.async = true; script.defer = true; if (!conversion) { script.onload = function onAwliScriptLoad() { $(function () { Workable.awli = new Workable.Awli( JSON.parse(\"{\\\"inApplicationForm\\\":false,\\\"applicationFormUrl\\\":\\\"https://rumbleon.workable.com/jobs/866302/candidates/new\\\"}\") ); }); } } document.head."}