{"job title": "Data Scientist", "company": "Runbook Company", "city state": "– Woodland Hills", "rating": "5.0", "job description": "Job Duties &amp; Responsibilities\n\n<ul>\n<li>Bring Creativity to Data products.</li><li>Analyze transaction data.</li><li>Build models to predict possible finance operation inconsistencies.</li><li>Use machine learning methods to perform transaction matching (matching algorithms).</li><li>Cleanse raw data for use in models.</li><li>Perform data munging, data mining, clustering &amp; classification methods, pattern recognition.</li><li>Comfortable with Statistics, Calculus &amp; Multivariate analysis.</li><li>You will work closely with a small R&amp;D team with Product Managers, Data Engineers &amp; Analysts. The R&amp;D team will experiment with the data and come up with POC's.</li><li>Familiar with SQL, Python, R, Spark MLib, AWS, SQL Server, Redshift.</li><li>Most of the data currently lives in SQL Server. We are experimenting with AWS Redshift as well. Python for coding and someone with experience with Spark MLib &amp; Machine learning is a big plus.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li>Extensive experience solving analytical problems using quantitative approaches.</li><li>Comfort manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources.</li><li>A strong passion for empirical research and for answering hard questions with data.</li><li>A flexible analytic approach that allows for results at varying levels of precision.</li><li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner.</li><li>Familiarity with relational databases and SQL</li><li>Expert knowledge of an analysis tool such as R, Matlab, or SAS</li><li>Strong working knowledge of financials</li><li>Acquired skills would include Data Warehousing, ETL, BI, Data Mining, and Machine Learning.</li><li>Strong written and verbal skills – able to explain the work in plain language</li><li>MS or Ph.D. in Computer Science or other quantitative disciplines</li>\n</ul>"}