{"job title": "Research Bioengineer/ Neuroimaging Research Scientist", "company": "Rush University Medical Center", "city state": "– Chicago, Illinois", "rating": "3.8", "job description": "As part of a major expansion in multimodal in-vivo and ex-vivo brain MRI research in aging and dementia, the Rush Alzheimer’s Disease Center (RADC) at Rush University is seeking highly motivated candidates for three Neuroimaging Research Scientist (staff) positions.\n<br><br>\n<strong>Position Highlights:</strong>\n\n\n<ul>\n<li>This group publishes high impact research based on the most clinically detailed and extensive collection of resources in aging and dementia in the world.</li>\n<li>The successful applicants will develop, implement and apply advanced image analysis techniques on in-vivo and ex-vivo multimodal brain MRI data from large community cohorts of older adults with a plethora of available risk factor, clinical, omics, and post-mortem data.</li>\n<li>You will work in a multidisciplinary, team-based environment including 30 faculty members and a staff of more than 100 - biomedical engineers, MR physicists, neurologists, neuropsychologists, neuropathologists, biostatisticians, epidemiologists, computational neuroscientists.</li>\n</ul>\n\n<strong>Position Responsibilities:</strong>\n\n\n<ul>\n<li>Develop and implement novel image analysis techniques for in-vivo and ex-vivo multimodal brain MRI data (including, but not limited to, longitudinal analysis of brain MRI data, integration of functional and structural information, analysis of functional and structural brain networks, development of MR-based biomarkers).</li>\n<li>Apply advanced image analysis techniques on brain MRI data from a large aging cohort, and combine MRI data with a plethora of available risk factor, clinical, and post-mortem data.</li>\n<li>Develop and maintain quality control procedures and documentation.</li>\n<li>Work closely with physicists, engineers, neurologists, neuropsychologists, neuropathologists, biostatisticians, computational neuroscientists on imaging projects on aging.</li>\n<li>Support manuscript and grant-writing efforts.</li>\n<li>Assist in the training and supervision of other staff in appropriate use of new techniques.</li>\n</ul>\n\n<strong>Position Qualifications Include:</strong>\n\n\n<ul>\n<li>Ph.D. degree in Biomedical Engineering, Electrical Engineering, Medical Physics, Computer Science or related discipline</li>\n<li>Excellent skills and experience in one or more of the following areas are highly desirable: a) advanced analysis of functional connectivity MRI signals, b) network-based functional and structural brain analysis, c) machine learning, d) MRI of brain microstructure using diffusion imaging and/or MR relaxometry.</li>\n<li>Experience in quantitative susceptibility mapping, susceptibility-weighted imaging, MR perfusion, longitudinal analysis of brain MRI data, and integration of functional and structural information is a plus.</li>\n<li>Strong programming skills.</li>\n<li>Excellent communication and analytical skills.</li>\n<li>Ability to prioritize and manage own work.</li>\n<li>A clear interest in collaborative, multidisciplinary teamwork.</li>\n<li>Highly-motivated, enthusiastic and detail-oriented.</li>\n<li>Ability to work independently.</li>\n</ul>\n\n<strong>Company Highlights:</strong>\n\n\n<ul>\n<li>Ranked among the top academic medical centers in the country, Rush University Medical Center is an outstanding place to enhance your career. Everything we do centers on one goal: improving patient care.</li>\n<li>The Association for the Accreditation of Human Research Protection Programs (AAHRPP) has awarded Rush full accreditation for three years. Rush is one of the first academic medical centers in Illinois to receive this accreditation.</li>\n<li>Rush offers a competitive salary, and valuable healthy living benefits including: health, dental and vision to help you maintain and improve your health. Rush also offers several ways to invest in your future.</li>\n</ul>\n\nRush is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics."}