{"job title": "Clinical Laboratory Scientist (CLS/MT) or Clinical/Medical Laboratory Technician (MLT)", "company": "Rutland Regional Medical Center", "city state": "– Rutland, VT", "rating": "3.2", "job description": "<ul>\n<li>Clinical Laboratory Scientist (CLS/MT)</li>\n</ul>\n\nThe Clinical Laboratory Scientist/Technologist (CLS/MT) accurately performs, calculates and reports selected laboratory tests and maintains laboratory equipment. This is a generalist rotator position involving multiple departments and shifts, including weekend and holiday rotations. The CLS/MT works successfully both independently and as part of a team.\n<br><br>\nMinimum Education\n\n\n<ul>\n<li>Bachelor's Degree in Clinical Laboratory Science (CLS) or a related healthcare field, which includes an internship in a clinical laboratory setting.</li>\n</ul>\n\nMinimum Work Experience\n\n\n<ul>\n<li>Clinical Laboratory experience preferred.</li>\n<li>Experience with quality improvement, quality control, equipment maintenance and laboratory safety is desired.</li>\n<li>Experience in chemistry, hematology, blood bank, microbiology, phlebotomy are desirable.</li>\n</ul>\n\nRequired Licenses/Certifications\n\n\n<ul>\n<li>A MLS, CLS, or MT registration or certification preferred, will consider a candidate that is ASCP-BOC, AAB or NCA registry eligible within six months of employment.</li>\n<li>Technical certification by an appropriate laboratory agency within one year of hire.</li>\n</ul>\n\nRequired Skills, Knowledge, and Abilities\n\n\n<ul>\n<li>Complies with regulatory requirements, OSHA/VOSHA Standard Precautions; practices personal and hospital safety and complies with confidentiality policy.</li>\n<li>Communicates patient information to physicians, office staff, and hospital employees. Acts as clinical laboratory information resource to all customers groups.</li>\n<li>Ability to accurately transcribe and verbalize patient data.</li>\n</ul>\n\nClinical/Medical Laboratory Technician(CLT/MLT)\n<br><br>\nThe Clinical/Medical Laboratory Technician accurately performs, calculates and reports selected laboratory tests and maintains laboratory equipment. The CLT/MLT recognizes abnormal results and instrument or quality control problems. They will notify a supervisor or lead tech and follow preset policies and procedures to recheck these findings.\n<br><br>\nMinimum Education\n\n\n<ul>\n<li>Associates Degree in Medical Laboratory Science (MLT/CLT)</li>\n</ul>\n\nMinimum Work Experience\n\n\n<ul>\n<li>Clinical Laboratory experience preferred.</li>\n<li>Experience with quality improvement, quality control, equipment maintenance and laboratory safety is desired.</li>\n<li>Experience in chemistry, hematology, blood bank, microbiology and/or phlebotomy are desirable.</li>\n</ul>\n\nRequired Licenses/Certifications\n\n\n<ul>\n<li>Medical Laboratory certification required, MLT ASCP-BOA, MLT AAB or CLT NCA.</li>\n<li>Technical certification by appropriate laboratory agency within one year of hire.</li>\n</ul>\n\nRequired Skills, Knowledge, and Abilities\n\n\n<ul>\n<li>Complies with regulatory requirements, OSHA/VOSHA Standard.</li>\n<li>Precautions; practices personal and hospital safety and complies with confidentiality policy.</li>\n<li>Communicates patient information to physicians, office staff, and hospital employees. Acts as clinical laboratory information resource to all customers groups. Ability to accurately transcribe and verbalize patient data.</li>\n<li>Excellent customer service skills.</li>\n<li>Demonstrated moderate knowledge of basic computer skills</li>\n</ul>"}