{"job title": "Data Scientist", "company": "Ryan Specialty Group", "city state": "– United States", "rating": "3.5", "job description": "Ryan Specialty Group (RSG) is an international specialty insurance organization that provides innovative solutions for brokers, agents and insurance carriers. The RSG family includes a wholesale brokerage operation, RT Specialty (RT), and a collection of managing general underwriting companies within RSG Underwriting Managers (RSGUM). RSG was founded by Mr. Patrick G. Ryan, the retired Chairman and CEO of Aon Corporation. A highly regarded insurance veteran, Mr. Ryan saw the need for a specialty organization devoted exclusively to creating sophisticated insurance and risk management solutions for a select group of hard-to-place risks. With its mission of delivering measurable value, RSG is committed to providing specialty insurance services, proven leadership, outstanding industry experience and quality services in all of our exchanges with retail agents and brokers, and insurance carriers worldwide.\n<br><br>\nRyan Specialty Group is looking for a Data Scientist to join our team in Chicago, IL. We are a fast paced, energetic, and rapidly growing organization that offers a great opportunity for someone interested in further developing their career.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nThe Data Scientist will be a strategic partner to key RSG business units, leveraging both internal and external data sources to drive operational, business, and strategic decisions. They will build upon existing internal data warehouses and explore, standardize, and optimize new data sources to bring business insights across the organization.\n<br><br>\n<strong>Essential Functions:</strong>\n\n\n<ul>\n<li>Evaluate internal and external data sources, through the review of data validity, accuracy, completeness, consistency, and uniformity.</li>\n<li>Work with underwriters, actuarial, operations, and IT to understand and prioritize various data sources.</li>\n<li>Leveraging statistical and predictive modeling methodologies to gain further insight (Analytical).</li>\n<li>Build/(Own/Buy) data visualization tools, to enable underwriters to understand new data source/elements and provide feedback on their observations.</li>\n<li>Partner with underwriting and actuarial to create new underwriting, pricing, risk selection, and coverage rules around new data elements.</li>\n<li>Aid in the creation of operational workflow diagrams, to implement new data sources in insurance and underwriting platforms, based on projected coverage and accuracy of applicable data elements.</li>\n<li>Aggregate data from different sources.</li>\n<li>Clean and map data to common framework.</li>\n<li>Own and maintain relationships.</li>\n</ul>\n\n<strong>Education/Experience/Skills:</strong>\n\n\n<ul>\n<li>Degree in a Data Science or related field (mathematics, statistics, actuarial science, computer science).</li>\n<li>Two (2) or more years of data analysis experience, preferably in insurance industry.</li>\n<li>Ability to work with large data sets, and create processes for efficient analysis and management of data.</li>\n<li>Strong business acumen required; insurance acumen preferred. Ability to make connections between data and business strategies.</li>\n<li>Software experience: Data visualization: Experience with Tableau or similar data visualization software, strongly preferred.</li>\n<li>Data manipulation: Advanced experience with SQL and Excel required, Alteryx or similar software a plus.</li>\n<li>Data Transformation ETL Tools, data normalization.</li>\n<li>Predictive modeling experience: Experience with RapidMiner, R, Python, SAS a plus required.</li>\n<li>Strong analytical skills, work-ethic, including ability to follow-up, focus on details, and take on initiatives.</li>\n<li>Strong general business knowledge both tactical and commercial.</li>\n<li>Excellent interpersonal, presentation, and communication skills.</li>\n</ul>\n\nDisclaimer\n<br><br>\nRyan Specialty Group is an Equal Opportunity Employer\n<br><br>\nTo apply: https://ryan-specialty-group-llc.contactrh.com/jobs/9064/27469003"}