{"job title": "Associate Data Scientist", "company": "S&amp;P Global Ratings", "city state": "– New York, NY", "rating": "3.1", "job description": "<strong>The Team:</strong> The Data science team is a newly formed applied research team within S&amp;P Global Ratings that will be responsible for building and executing a bold vision around using Machine Learning, Natural Language Processing, Data Science, knowledge engineering, and human computer interfaces for augmenting various business processes.\n<br><br>\n<strong>The Impact:</strong> This role will have a significant impact on the success of our data science projects ranging from choosing which projects should be undertaken, to delivering highest quality solution, ultimately enabling our business processes and products with AI and Data Science solutions.\n<br><br>\n<strong>Whats in it for you:</strong> This is a high visibility team with an opportunity to make a very meaningful impact on the future direction of the company. You will work with senior leaders in the organization to help define, build, and transform our business. You will work closely with other senior scientists to create state of the art Augmented Intelligence, Data Science and Machine Learning solutions.\n<br><br>\n<strong>Responsibilities:</strong> As an Associate Data Scientist you will be responsible for building AI and Data Science models. You will need to rapidly prototype various algorithmic implementations and test their efficacy using appropriate experimental design and hypothesis validation.\n<br><br>\n<strong>Basic Qualifications:</strong> BS in Computer Science, Computational Linguistics, Artificial Intelligence, Statistics, or related field.\n<br><br>\n<strong>Preferred Qualifications:</strong> Experience with Financial data sets, or S&amp;Ps credit ratings process is highly preferred.\n<br><br>\nKnowledge and working experience in one or more of the following areas: Natural Language Processing, Machine Learning, Question Answering, Text Mining, Information Retrieval, Distributional Semantics, Data Science, Knowledge Engineering\n<br><br>\nTo all recruitment agencies: S&amp;P Global does not accept unsolicited agency resumes. Please do not forward such resumes to any S&amp;P Global employee, office location or website. S&amp;P Global will not be responsible for any fees related to such resumes.\n<br><br>\nS&amp;P Global is an equal opportunity employer committed to making all employment decisions without regard to race/ethnicity, gender, pregnancy, gender identity or expression, color, creed, religion, national origin, age, disability, marital status (including domestic partnerships and civil unions), sexual orientation, military veteran status, unemployment status, or any other basis prohibited by federal, state or local law. Only electronic job submissions will be considered for employment.\n<br><br>\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n<br><br>\nThe EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdfdescribes discrimination protections under federal law."}