{"job title": "Data Scientist", "company": "Saba Software", "city state": "– Dublin, California, California", "rating": "3.4", "job description": "<p>We are looking for a passionate, methodical, driven individual that will use our enterprise systems to translate data into information. Transforming that information into insights that will help the business make quick, accurate decisions.</p>\n<p>The data scientist will report to the Director of Data Governance and works closely with decision makers on a daily basis to provide guidance and tactical input on executing our data strategy. This individual will develop, maintain and control all aspects of corporate/global data.</p>\n<p>Responsibilities</p>\n<ul>\n<li>Ability to work collaboratively with a cross functional group of business/departmental stakeholders to understand and prioritize business and information needs, then translating those needs into data processes</li>\n<li>Acquire data from primary or secondary data sources and maintain databases/data systems</li>\n<li>Responsible for data mapping sessions with stakeholder groups across the company</li>\n<li>Management of data assets and ensuring that they are in compliance with data governance standards</li>\n<li>Interpret data, analyze results using statistical techniques and provide ongoing reports</li>\n<li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality</li>\n<li>Data Scientists work closely with clients, data stewards, project/program managers, and other IT teams to turn data into critical information and knowledge that can be used to make sound organizational decisions.</li>\n<li>Present back their findings to the business by exposing their assumptions and validation work in a way that can be easily understood by their business</li>\n<li>Develops usage and access control policies and systems in collaboration with the data</li>\n</ul>\n<ul>\n<li>Work with ETL / data quality / BI / metadata tools</li>\n<li>Process confidential data and information according to guidelines and privacy legislations</li>\n<li>Train and assist colleagues in accessing and interpreting data and analysis results</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>Proven 5+ years of working experience as a data scientist or business data analyst</li>\n<li>Technical expertise regarding data models, database design development, data mining and segmentation techniques</li>\n<li>Identifies what data is available and relevant, including internal and external data sources, leveraging new data collection processes</li>\n<li>Strong knowledge of and experience with reporting packages (business objects etc), databases (sql etc), programming (xml, javascript, or etl frameworks)</li>\n<li>Knowledge of statistics and experience using statistical packages for analyzing datasets (excel, spss, sas etc)</li>\n<li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li>\n<li>Adept at queries, report writing and presenting findings</li>\n<li>Familiar with formal CAB (Change advisory board) change management process, including communication and project management methodology</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Competencies</p>\n<ul>\n<li>Honesty and integrity are at the heart of everything you do.</li>\n<li>You are not afraid to learn and get your hands dirty by jumping right in and learning the world of Saba, the systems we use and how the business will get value from our data analysis</li>\n</ul>\n<ul>\n<li>Excellent critical thinking, investigative/analytical skills and strong follow-through capabilities.</li>\n<li>Strong verbal and written communication skills; ability to communicate effectively with all levels within the organization and with external stakeholders. Effectively express ideas and convey information in business writing, conversations and interactions with others.</li>\n</ul>\n<ul>\n<li>Ability to set goals and prioritize work with cross functional groups</li>\n<li>Change advocate Identifies and acts upon opportunities for continuous improvement</li>\n<li>Gathers and analyzes information or data on current and future trends of best practice. Seeks information on issues impacting the progress of organizational and process issues.</li>\n</ul>\n<p>Saba is an Equal Employment Opportunity Employee. If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact Saba Software at (650) 581-2659 for assistance. <br><br>Excellent Benefits:<br>We offer all employees a comprehensive benefit plan, 401K, generous vacation/time off and much more.<br><br>Saba does not accept resumes from headhunters, placement agencies or other suppliers that have not signed a formal agreement with us. Our supplier base is restricted to specified hiring needs. Therefore, any resume received from an unapproved supplier will be considered unsolicited, and Saba will not be obligated to pay a referral or placement fee.<br><br>ABOUT SABA:<br><br></p>\n<p>Saba helps organizations transform the way they work by enabling the continuous learning, engagement and development of everyone in their people network, including employees, partners, and customers. Supporting the new world of work, Saba delivers learning, performance, succession, career development, workforce planning and compensation solutions that incorporate modern technologies such as social, collaboration, mobile and gamification. Saba solutions are based on the Saba Cloud platform, a highly scalable architecture that exceeds industry scalability, performance, and security standards. With 2,200 customers and 31 million users around the globe, Saba helps the world’s best-known and most innovative brands adapt to the future of work by continuously developing, engaging and inspiring their people. In turn, these smart, innovative and forward-looking organizations push Saba to continuously innovate, improve and scale solutions and technologies to help them deliver business results and achieve business transformation. Fifty-one percent of the Fortune 100 rely on Saba to manage their mission-critical learning and talent management processes. Saba's customer base includes major global organizations and industry leaders in financial services, life sciences and healthcare, high tech, automotive and manufacturing, retail, energy and utilities, packaged goods, and public sector organizations.</p>\n<div> </div><br> Apply Now!"}