{"job title": "Lead Data Scientist", "company": "Safeway Inc", "city state": "– PLEASANTON, CA", "rating": "2.9", "job description": "<strong>Company:</strong>\n<br>\nSafeway Inc-001\n<br><br>\n<strong>Job Title:</strong>\n<br>\nLead Data Scientist\n<br><br>\n<strong>Address:</strong>\n<br>\n5918 STONERIDGE MALL RD, PLEASANTON, California 94588\n<br><br>\nJob Description:<br><br>Albertsons-Safeway Company is one of the largest food and drug retailers with 2,300+ stores. The Albertsons-Safeway family of brands includes some of the most prominent brands in food retailing, with a growing base of loyal shoppers. Thanks to the professionalism, diversity, spirit and friendliness of our people, we have locations across the U.S.\n<br><br>\nThe Information Technology Department has an opening for a Lead Data Scientist. This position is located in Pleasanton, California.\n<br><br>\nPosition Purpose\n<br><br>\nAs a Lead Data Scientist, you will be responsible for leading our company's data and analytics initiatives, while supporting our various product and business teams in making better decisions. You will have the opportunity to analyze and derive insights from the millions of consumer interactions we record each day. A qualified candidate must enjoy working with large data sets and relying on business acumen to form and test hypotheses.\n<br><br>\nYou'll be working on projects that drive value to our company and helping others optimize their work. To be successful in this role, you will have a deep passion for building data driven products, ability to communicate product vision and have demonstrated the experience in leading and execute complex projects.\n<br><br>\nKey Responsibilities include, but are not limited to:\n\n<ul>\n<li>Lead data science/analytics initiatives and a Group of Data Sciences Engineers as they grow to deliver solutions to a variety of problems ranging from forecasting to yield optimization to performance diagnosis</li>\n<li>Run regular A/B experiments, gather data, perform statistical analysis, draw conclusions on the impact to senior management</li>\n<li>Work with product and business teams to determine how best to present data &amp; insights to customers and executive audiences.</li>\n<li>Work with engineering to ensure data is being collected efficiently &amp; accurately.</li>\n<li>Lead the design of machine learning models.</li>\n<li>Design analytics reports and dashboards for the internal business team as well as enterprise and SMB customers.</li>\n<li>Proficiency with SQL queries, columnar data stores, ML tools, and similar BI tools</li>\n<li>Work with large volumes of data; extract and manipulate large datasets using standard tools such as Python, Hadoop, SPARK, R, SQL</li>\n<li>Interact cross functionally and with senior management, and external customers and vendors to accomplish departmental projects.</li>\n</ul>\nQualifications:\n\n<ul>\n<li>Master's degree (preferably in statistics, econometrics, computer science, engineering or another technical field.)</li>\n<li>Minimum 5 years' experience in a technical role related to data science or data analysis.</li>\n<li>Experience shipping relevance models or analytics for consumer products</li>\n<li>Experience with large-scale data, NLP, collaborative filtering, sentiment analysis</li>\n<li>Experience working within an engineering and product teams</li>\n<li>Strong problem-solving skills and excellent communication skills</li>\n</ul>\nHow to Apply: Interested candidates are encouraged to submit a resume by visiting careersatsafeway.com\n<br><br>\nDiversity is fundamental at Albertsons-Safeway. We foster an inclusive working environment where the different strengths and perspectives of each employee is both recognized and valued. We believe that building successful relationships with our customers and our communities is only possible through the diversity of our people. A diverse workforce leads to better teamwork and creative thinking, as well as mutual understanding and respect<em>.</em>\n<br><br>\nThe Albertsons-Safeway policy is to provide employment, training, compensation, promotion and other conditions of employment without regard to race, color, religion, sexual orientation, gender identity, national origin, sex, age, disability, veteran status, medical condition, marital status or any other legally protected status.\n<br><br>\nWe support a drug-free workplace -- all applicants offered a position are required to pass a pre-employment drug test before they are hired.\n<br><br>\nAN EQUAL OPPORTUNITY EMPLOYER"}