{"job title": "Data Modeler", "company": "Sagence", "city state": "– Chicago, IL", "rating": "4.6", "job description": "<p><strong>Data Modeler</strong></p>\n<p><strong>Company Description: <br> </strong>Sagence is a management advisory firm dedicated to helping our clients optimize the value of their data assets. From thinking to doing, Sagence works with leading institutions in the acquisition, evaluation, development and management of their critical data assets and in the application of analytics to discover new insights, shorten time-to-value, and drive competitive advantage.</p>\n<p><strong>Job Overview:</strong></p>\n<p>Sagence is looking for experienced Data Modelers to help us build and enhance our client’s data capabilities and create a competitive advantage. Listed below is an overview of the position requirements as well as the characteristics of our successful professionals.</p>\n<p><strong><em>Requirements:</em></strong></p>\n<ul>\n<li>Advanced knowledge of modeling techniques for conceptual, logical and physical data models</li>\n<li>Advanced knowledge of modeling normalized data structures and manipulating data</li>\n<li>Familiarity with multiple database platforms such as Oracle, DB2 and SQL Server</li>\n<li>Understanding of the different data storage/access models (transactional, data staging, operational data store, data warehouse, data mart, data federation) and choose the model(s) appropriate for the client. Ability to work with data modeling and repository toolsets (including ERwin and other metadata management toolsets) to create work products</li>\n<li>Understanding of the characteristics of various data types (structured versus unstructured)</li>\n<li>Knowledge of data format standards, including industry standards (e.g. XMI for interchange of XML)</li>\n<li>Experience with Agile methodologies</li>\n<li>Ability to define business requirements</li>\n<li>Ability to mentor and perform knowledge transfer to support team</li>\n</ul>\n<p><strong><em>Tools and Technology:</em></strong></p>\n<p>Proficient at leveraging tools and technology to drive value for clients. Illustrative tools include the following;</p>\n<ul>\n<li> Data modeling tools (e.g., ERWin, ER/Studio, IBM Data Architect)</li>\n<li>Database management systems (e.g., MYSQL, SQL Server, Oracle, Teradata)</li>\n<li>ETL tools (e.g. Informatica, DataStage, Goldengate)</li>\n</ul>\n<p><strong><em> </em></strong></p>\n<p><strong><em>Consulting Acumen:</em></strong></p>\n<ul>\n<li>Strong decision making, project management, and communication skills</li>\n<li>Demonstrated ability in engaging and communicating with stakeholders, across both business and technology functions</li>\n<li>Strong technical, strategic and business analysis skills with the ability to solve complex problems</li>\n</ul>\n<p><strong><em> </em></strong></p>\n<p><strong><em>Industry Experience:</em></strong></p>\n<ul>\n<li>Prior professional experience in a management consulting environment or client facing role is preferred, but not required</li>\n<li>Knowledge and experience working within Financial Services, Insurance, Healthcare or Technology is preferred</li>\n</ul>\n<p><strong><em> </em></strong></p>\n<p><strong><em>General:</em></strong></p>\n<ul>\n<li>Must be currently authorized to work in the US on a full-time basis. Sagence does not provide sponsorship for work visas.</li>\n<li>2-3+ years of professional experience working in a related role</li>\n<li>Must be collaborative, innovative, curious, and resourceful, and exhibit a positive attitude</li>\n<li>Strong desire to work on interesting projects with smart and creative people</li>\n<li>Willingness to travel to client sites as needed</li>\n<li>Must reside in the Chicago or New York metropolitan area</li>\n</ul>\n<p><strong>Our Culture:</strong></p>\n<p>Passionate, diverse, creative, genuine, flexible, hands-on…these are just a few of the words that describe our culture. Our Founders and Partners are deeply involved in the client work on a daily basis. We have a high-energy workplace with a focus on producing high-quality, impactful results.<em> </em>We are committed to equality of opportunity, fairness, work and lifestyle balance, and mutual respect. We promote an entrepreneurial spirit by encouraging individual initiative and foster a collaborative culture and work environment which includes open communication and on-going learning. We build teamwork through small, dedicated teams who continuously teach each other and learn from one another. We strongly believe these characteristics enable our employees to develop to their fullest potential. To learn more, please visit us at www.sagenceconsulting.com</p>"}