{"job title": "Senior Principal Visual Analytics / Big Data Engineer (TS/SCI w/ Polygraph Clearance Required)", "company": "SAIC", "city state": "– Columbia, MD", "rating": "3.5", "job description": "Senior Principal Visual Analytics / Big Data Engineer (TS/SCI w/ Polygraph Clearance Required) (Job Number:427892)\n<br><br>\n<strong>Description:</strong>\n<br><br>\nSAIC has an opening for a Senior Principal Visual Analytics / Big Data Engineer who will be contributing to projects in support of Visual Analytics system development, improvement, and expansion for a prestigious research group within a government agency located in Columbia, MD. The successful candidate will have the opportunity to work with a small group to develop cutting-edge concepts and solutions which will further research in cooperative intelligence analysis and visual analytics. This position will let the candidate explore analysis concepts, alternatives technologies, and operational solutions.\n<br><br>\n<strong>The candidate will:</strong>\n\n\n<ul>\n<li>Develops parallel data-intensive systems using Big Data technologies.</li>\n<li>Works with the full open source Hadoop stack from cluster management, to data repositories, to analytics software, to schedulers.</li>\n<li>Works in on-premises or public cloud environments to build scalable systems.</li>\n<li>Determines the appropriate database given the data and analytics needs, whether file structures such as HDFS, relational databases including NewSQL, non- relational NoSQL databases including in-memory databases.</li>\n<li>Optimizes the distribution of data across nodes and the performance of NoSQL repositories. Identifies performance bottle-necks and evaluates scaling benchmarks.</li>\n<li>Designs, develops, documents, tests and debugs application software.</li>\n<li>Conducts analysis and collaborates with subject matter experts in the planning, design, development, and utilization of electronic data processing systems for information storage, processing, presentation, manipulation, display, or reporting.</li>\n<li>End product may be special use, customized, or commercial software.</li>\n<li>Determines computer user needs; analyzes system capabilities to resolve problems on program intent, output requirements, input data acquisition, programming techniques and controls; prepares operating instructions; designs and develops autonomous services, desktop applications, web applications, scripts, and utility programs.</li>\n<li>Ensures software standards are met.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br>\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>Clearance required TS/SCI with Poly</li>\n<li>U.S. citizenship required</li>\n</ul>\n\nExperience is required in the following technologies and languages:\n\n\n<ul>\n<li>Java, JavaScript, HTML5, CSS3, XML, JSON, AJAX, and JQuery</li>\n<li>Web frameworks, open source visualization technologies, interactive visualizations</li>\n<li>Source code control systems</li>\n<li>Relational databases</li>\n</ul>\n\n<strong>Required Education and Experience:</strong>\n\n\n<ul>\n<li>Bachelor’s degree in Computer Science or a closely-related discipline and fourteen (14) years or more experience of progressively responsible experience in software development, software engineering, data warehousing, Big Data analytics, or data visualization.</li>\n<li>Or, a Master’s degree and twelve (12) years or more experience;</li>\n<li>Or, a PhD or JD and nine (9) years or more experience</li>\n</ul>\n\n<strong>Desired Experience:</strong>\n\n\n<ul>\n<li>Experience with WebGL, open-source container and resource management, web/proxy servers, and NoSQL databases.</li>\n<li>Experience with development and use of government data analysis tools</li>\n<li>Demonstrated success working in Agile development environments experience.</li>\n</ul>\n\n<strong>Travel:</strong>\n\n\n<ul>\n<li>Minimal travel required for this position</li>\n</ul>\n\n<strong>#MNS</strong>\n<br><br>\nSAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC provides systems engineering and integration offerings for large, complex projects. Headquartered in McLean, Virginia, SAIC has approximately 15,000 employees and annual revenues of about $4.3 billion.\n<br><br>\nEOE AA M/F/Vet/Disability\n<br><br>\n<strong>Job Posting:</strong> May 25, 2017, 10:00:00 PM\n<br>\n<strong>Primary Location:</strong> United States-MD-COLUMBIA\n<br>\n<strong>Clearance Level Must Currently Possess:</strong> Top Secret/SCI with Polygraph\n<br>\n<strong>Clearance Level Must Be Able to Obtain:</strong> Top Secret/SCI with Polygraph\n<br>\n<strong>Potential for Teleworking:</strong> No\n<br>\n<strong>Travel:</strong> Yes, 10% of the time\n<br>\n<strong>Shift:</strong> Day Job\n<br>\n<strong>Schedule:</strong> Full-time"}