{"job title": "NRL Mid-level Research Scientist", "company": "SAIC", "city state": "– Monterey, CA", "rating": "3.5", "job description": "NRL Mid-level Research Scientist (Job Number:437499)\n<br><br>\n<strong>Description:</strong>\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n<br><br>\nNRL Mid-Level Research Scientist NRL is looking to bring in new scientist to work in a wide variety of Navy applicable Meteorological disciplines.\n<br><br>\n<strong>Description:</strong>\n\n\n<ul>\n<li>NWP Focus: Must be a co-developer of global and/or mesoscale NWP models and scripting for the management of job submission and data processing tasks, including error handling; provide recommendations to team lead for resolution of research issues related to global and/or mesoscale modeling problems; parallel processing computing experience.</li>\n<li>DA Focus: Must be a co-developer of global and/or mesoscale analysis or data assimilation software and scripting for the management of job submission and data processing tasks, including observation data handling and error handling; provide recommendations to team lead for resolution of research issues related to global and/or mesoscale DA problems.</li>\n<li>MAP focus: Must be co-developer for METOC applications including web-based applications, climatology applications, and/or port study applications; demonstrable ability to process data, analyze data, and write-up/publish results; provide recommendations to team lead for resolution of research issues associated with application, climatology, or port study development problems.</li>\n<li>Must have demonstrable report writing experience.</li>\n<li>Must have demonstrable data processing experience.</li>\n</ul>\n\nNWP = Numercial Weather Prediction\n<br><br>\nDA = Data Assimilation\n<br><br>\nMAP Focus = Military Applications\n<br><br>\n<strong>Desired:</strong>\n\n\n<ul>\n<li>Experience with a combination of FORTRAN, C, C++, or Java, and scripting programming languages using the LINUX operating system.</li>\n<li>Experience publishing peer-reviewed scientific literature, software documentation, climatologies, guidebooks and/or handbooks.</li>\n<li>High Performance Computing (HPC) experience.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br>\nMaster's degree in Meteorology, Oceanography, Physical Science, Computer Science, or in a related Mathematics and Engineering fields.\n<br><br>\n<strong>Desired:</strong>\n\n\n<ul>\n<li>Experience with a combination of FORTRAN, C, C++, or Java, and scripting programming languages using the LINUX operating system.</li>\n<li>Experience publishing peer-reviewed scientific literature, software documentation, climatologies, guidebooks and/or handbooks.</li>\n<li>High Performance Computing (HPC) experience.</li>\n</ul>\n\nSAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge to enable the delivery of systems engineering and integration offerings for large, complex projects. SAICs approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $4.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see My SAIC Benefits. EOE AA M/F/Vet/Disability\n<br><br>\n<strong>Job Posting:</strong> Jun 20, 2018, 10:51:25 AM\n<br>\n<strong>Primary Location:</strong> United States-CA-MONTEREY\n<br>\n<strong>Clearance Level Must Currently Possess:</strong> None\n<br>\n<strong>Clearance Level Must Be Able to Obtain:</strong> None\n<br>\n<strong>Potential for Teleworking:</strong> No\n<br>\n<strong>Travel:</strong> None\n<br>\n<strong>Shift:</strong> Day Job\n<br>\n<strong>Schedule:</strong> Full-time"}