{"job title": "Data Science and Analytics Lead (NIAID SEB)", "company": "SAIC", "city state": "– Rockville, MD", "rating": "3.5", "job description": "Data Science and Analytics Lead (NIAID SEB) (Job Number:436291)\n<br><br>\n<strong>Description:</strong>\n<br><br>\n<strong>JOB DESCRIPTION:</strong>\n<br>\nThe Data Science and Analytics Lead is responsible for planning, directing and coordinating activities associated with reporting and analytical services; and supporting the client’s organizational activities. This includes integrating information from existing systems; building data marts; supporting the development of an Enterprise Data Architecture; managing architectural standards; and supporting the integration of applications with document management systems. The Lead will implement SAIC designs and processes and will be expected to function at the highest level in technical coordination and in supporting project management.\n<br><br>\n<strong>Job Specific Responsibilities:</strong>\n\n\n<ul>\n<li>Establishes systems, standards, requirements, guidelines, and quality assurance for data science deliverables, such as conceptual design and architecture, logical database, external interface specifications, data migration plan, and security policy</li>\n<li>Works with clients to translate business requirements into a logical model that will accurately support and represent the client’s use cases</li>\n<li>Implements compliance procedures according to all applicable cybersecurity and Information assurance (IA) policies and directives</li>\n<li>Oversees the development of comprehensive test cases to include testing scenarios for both normal and degraded (e.g., disaster recovery, continuity of operations, data recovery/spills, etc.) operations, pass/fail criteria, performance criteria, capacity planning, measurement criteria, results analysis procedures, and results/status reporting criteria</li>\n<li>Interfaces with system owners during integration and testing preparation and execution</li>\n<li>Performs requirements analysis to capture and incorporate component system of systems testing criteria into integration testing scenarios</li>\n<li>Documents the implementation of approved changes to system configurations, software, and infrastructure as directed</li>\n<li>Assists with providing ongoing progress to leadership, system owners, and peers regarding health and status of the environment</li>\n<li>Researches and analyzes emerging technologies, techniques, and protocols and makes recommendations</li>\n<li>Assists with procurement of hardware, software, and services</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\n<strong>TYPICAL EDUCATION AND EXPERIENCE:</strong>\n\n\n<ul>\n<li>Bachelors and fourteen (14) years or more experience; Masters and twelve (12) years or more experience; PhD or JD and nine (9) years or more experience</li>\n</ul>\n\n<strong>CLEARANCE REQUIREMENT:</strong>\n\n\n<ul>\n<li>Public Trust L5 Security Clearable</li>\n</ul>\n\n<strong>REQUIRED QUALIFICATIONS &amp; EXPERIENCE</strong>\n\n\n<ul>\n<li>Possess a Bachelor’s Degree or Higher in Computer Science, Information Technology or related field and a minimum of nine years of practical experience in data science and analytics</li>\n<li>Experience with data lifecycle – Collect, analyze, and interpret a wide variety of data from various databases.</li>\n<li>Deep knowledge of data extraction, transformation and loading (ETL) process, data management techniques, data warehousing, data analysis, design of complex queries, and data visualization activities.</li>\n<li>Experience in implementing enterprise data architecture – data modeling, standards, data quality, data discovery, data integrity, governance and security.</li>\n<li>Requires analytic thought process and collaborative skills.</li>\n<li>Agile certification</li>\n<li>Must be an independent self-starter with strong initiative</li>\n<li>Must have strong writing / reporting and verbal communication skills</li>\n<li>Must be able to perform in a high-pressure fast- paced environment</li>\n<li>Must be able to quickly learn and apply new tools and technologies</li>\n<li>Must be flexible in a constantly changing business landscape</li>\n<li>Must have strong customer service orientation</li>\n<li>Demonstrated experience in MS SQL Server development, testing, integration, disaster recovery, and operational environments</li>\n</ul>\n\n<strong>DESIRED QUALIFICATIONS &amp; EXPERIENCE</strong>\n\n\n<ul>\n<li>Scrum Master certification</li>\n<li>DevOps certification</li>\n<li>Experience with health IT systems</li>\n<li>Experience or knowledge of HHS EPLC</li>\n<li>Oracle database experience</li>\n<li>Possess demonstrated experience with Operations support within an ITIL Service Operations management framework</li>\n<li>Demonstrated experience briefing senior leaders</li>\n<li>Demonstrated experience with Risk Analysis</li>\n<li>Understanding of cloud computing technologies, business drivers, and emerging computing trends</li>\n<li>Experience with multi-tiered application environments with SQL, Web services, Web API, HTML5, and XML development</li>\n</ul>\n\n<strong>VENDORS/TOOLS/MANAGEMENT SYSTEMS</strong>\n\n\n<ul>\n<li>MS SQL Server</li>\n<li>Oracle</li>\n<li>Databases</li>\n<li>Neo4j Graph Database</li>\n<li>Microsoft Office Suite</li>\n<li>Microsoft SharePoint</li>\n<li>STIG or equivalent cybersecurity assessment</li>\n<li>VMWare</li>\n<li>Statistics</li>\n<li>Transformational analysis</li>\n<li>Data mining</li>\n<li>Erwin</li>\n<li>Informatica</li>\n<li>Pentaho</li>\n<li>Tableau</li>\n<li>Scoop</li>\n</ul>\n\n<strong>TECHNICAL SPECIALTIES</strong>\n\n\n<ul>\n<li>Agile Engineering - Level 2: 3-6 yrs</li>\n<li>Change Management - Level 2: 3-6 yrs</li>\n<li>Conceptual Data Modeling - Level 3: 6-10 yrs</li>\n<li>Data Analyst - Level 3: 6-10 yrs</li>\n<li>Data Dissemination - Level 2: 3-6 yrs</li>\n<li>Data Governance - Level 3: 6-10 yrs</li>\n<li>Data Integrator - Level 2: 3-6 yrs</li>\n<li>Data Mining - Level 3: 6-10 yrs</li>\n<li>Data Modeler - Level 3: 6- 10 yrs</li>\n<li>Data Policy Analyst - Level 2: 3-6 yrs</li>\n<li>Data Quality Analyst - Level 2: 3-6 yrs</li>\n<li>Data Scientist - Level 3: 6-10 yrs</li>\n<li>Data Visualization Expert - Level 2: 3-6 yrs</li>\n<li>Decision Support Analysis - Level 2: 3-6 yrs</li>\n<li>Information Technology Infrastructure Library (ITIL) - Level 2: 3-6 yrs</li>\n<li>Plan of Actions and Milestones (POA&amp;M) - Level 2: 3-6 yrs</li>\n<li>Relational database programming - Level 2: 3-6 yrs</li>\n<li>Requirements Development - Level 3: 6-10 yrs</li>\n<li>Requirements Engineer - Level 2: 3-6 yrs</li>\n<li>Requirements Management - Level 3: 6-10 yrs</li>\n<li>Virtualization - Level 2: 3-6 yrs</li>\n</ul>\n\n<strong>TECHNOLOGIES &amp; PROTOCOLS</strong>\n\n\n<ul>\n<li>Development and optimization</li>\n<li>Analysis and testing</li>\n<li>Data modeling and performance optimization</li>\n<li>Virtualized/cloud based environments</li>\n<li>Automated testing tools</li>\n<li>Data mapping, mining and transformational analysis tools</li>\n<li>Installation, testing, implementation and patching</li>\n<li>Applying cybersecurity guidance</li>\n<li>Virtualization</li>\n</ul>\n\nSAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge to enable the delivery of systems engineering and integration offerings for large, complex projects. SAIC¿s approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $4.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see ( My SAIC Benefits. EOE AA M/F/Vet/Disability\n<br><br>\n<strong>Job Posting:</strong> May 1, 2018, 11:26:35 AM\n<br>\n<strong>Primary Location:</strong> United States-MD-ROCKVILLE\n<br>\n<strong>Clearance Level Must Currently Possess:</strong> None\n<br>\n<strong>Clearance Level Must Be Able to Obtain:</strong> Other Clearance\n<br>\n<strong>Potential for Teleworking:</strong> No\n<br>\n<strong>Travel:</strong> None\n<br>\n<strong>Shift:</strong> Day Job\n<br>\n<strong>Schedule:</strong> Full-time"}