{"job title": "Data Modeler - Technical Analyst", "company": "Sallie Mae", "city state": "– Indianapolis, IN", "rating": "3.6", "job description": "<div><strong>Sallie Mae</strong> is proud to help Americans aspiring to create the life they want--whether that means helping them make college happen, or something more. Our colleagues across departments and across the country are united in our passion and our customer-first approach. Whether you want to join a growing company, be part of an agile workforce, or gain new skills--you're in the right place.</div>\n<br><strong>Position Summary:</strong>\n<br><br>\nThe Technical Analyst is responsible for gathering and documenting business requirements and converting requirements into testable designs within an Agile development methodology. The analyst is responsible for the development of the logical and physical data base designs. The Analyst is also responsible for providing metadata management and support to various departments within systems as well as throughout Sallie Mae. The individual provides subject matter expertise in a broad range of data management disciplines, including data normalization techniques, data rationalization, business analysis and requirements gathering and refinement.\n<br><br>\n<strong>Key Responsibilities:</strong>\n<br><br>\nPhysical Data Model Development 45% Time\n\n<ul>\n<li>Responsible for the process of data normalization as well as working closely with the DBA to reach a consensus on the physical data base design.</li>\n<li>Document all primary and foreign keys, indexes and constraints</li>\n<li>Generate DDL/Alter table scripts for implementation by the DBAs</li> \n</ul>\nBusiness Analysis, Requirement, and Test Design 20% Time\n\n<ul>\n<li>Work with the business and application teams to gather and refine design requirements on selected projects.</li>\n<li>Attend and organize IT and business requirements sessions</li>\n<li>Manage requirements documents</li> \n</ul>\nMeta Data Support 20% Time\n\n<ul>\n<li>Respond to ad hoc requests regarding metadata information on the various systems that DM supports.</li>\n<li>Establish and maintain constructive user relationships to better manage user expectations.</li>\n<li>Support data rationalization efforts and develop data models using Select SE and ERWIN.</li>\n<li>Determine appropriate enterprise-wide data strategy and articulate tasks to help move the organization towards the strategy.</li> \n</ul>\nLogical Data Model Development 5% Time\n\n<ul>\n<li>Work closely with development teams to identify the data required by the application and business processing. Data requirements gathering may be through individual meetings or through conducting Joint Application Development (JAD) sessions.</li>\n<li>Responsible for developing the logical data model which consists of developing the entity-relationship diagram (ERD), creating entity and data item business names and descriptions as well as defining data item valid values, type and length, and physical target names.</li>\n<li>Meta data management including the enforcement of standards and naming convention.</li>\n<li>Document all deliverables within the ER diagramming tool</li> \n</ul>\nCustomer Service 5% Time\n\n<ul>\n<li>Coordinate the completion of data base change requests within the Data Management team</li>\n<li>Work with clients to complete data base change requests in a timely manner.</li>\n<li>Complete deliverables that are consistent, accurate, and follow all corporate naming conventions and guidelines.</li> \n</ul>\nProject Management 5% Time\n\n<ul>\n<li>Keep management informed of critical issues.</li>\n<li>Complete metrics and auditing information for reporting purposes.</li>\n<li>Commit to and meet deadlines in both quality and time.</li>\n<li>Develop department procedures and standards.</li>\n<li>Develop corporate naming guidelines and standard abbreviations.</li> \n</ul>\nTotal 100% Time\n<br><br>\n<strong><u>Education:</u></strong>\n\n<ul>\n<li>Bachelor's Degree Information Technology/Computer Technology or related field and/or equivalent work experience.</li>\n</ul>\n<strong><u>Experience:</u></strong>\n\n<ul>\n<li>At least 5 years of experience in an IT related field</li>\n<li>1-2 years experience with configuration management concepts, practices, and procedures relative to data modeling in a high volume environment.</li>\n<li>2-3 years experience with data modeling tools, practices, approaches.</li> \n</ul>\n<strong><u>Knowledge, Skills and Abilities:</u></strong>\n\n<ul>\n<li>Knowledge of data administration principles.</li>\n<li>Knowledge of logical and physical data base design techniques.</li>\n<li>Ability to understand business problems and translate these problems into automated and non-automated solutions.</li>\n<li>People management skills, including the ability to direct, counsel, lead, and motivate staff in a matrix environment.</li>\n<li>Strong technical skills required to ensure technical solutions are efficient and optimal.</li>\n<li>Expertise in gathering and refining business requirements into clear, testable designs.</li>\n<li>A working understanding of data administration concepts, principles, and industry \"Best Practices\".</li>\n<li>Experience developing logical and physical data models and associated meta data in accordance with corporate guidelines and naming standard conventions.</li>\n<li>A thorough understanding and experience with normalization techniques.</li>\n<li>Actively participates in the development and implementation of policies and procedures related to development and support of new and ongoing systems to ensure the integrity of data.</li>\n<li>Coordinates data models, dictionaries, and other database documentation across multiple applications.</li>\n<li>Works with development/application teams, migration manager and database administrator to ensure that the model design and development is properly updated, loaded and communicated.</li>\n<li>Maintains data integrity by working to eliminate redundancy and adhering to requisite data governance rules set forth by the Bank.</li>\n<li>Stays informed of the ways the organization uses its data.</li>\n<li>Ability to operate a PC or CRT.</li>\n<li>Strong written and oral communication skills.</li>\n<li>Knowledge and support of departmental standards and guidelines.</li>\n<li>Ability to multi-task.</li> \n</ul>\n<strong><u>Other:</u></strong>\n\n<ul>\n<li>Desired to have working knowledge of the Idera ER/Studio data modeling tool.</li>\n<li>History of demonstrated experience and judgment to plan and accomplish goals.</li>\n</ul>\n\nEEO Employer Minority/Female/Disability/Veteran/Sexual Orientation/Gender Identity. SLM Corporation and its subsidiaries are not sponsored by or agencies of the United States of America. Sallie Mae is a drug free workplace.\n<br><br>\nFull-time\n<br>\nIndianapolis, IN\n<br>\nJul 2, 2018"}