{"job title": "Data Scientist", "company": "Sambasafety", "city state": "– Greenwood Village, CO", "rating": "4.2", "job description": "<strong>Data Scientist</strong>\n<br><br>\n8.1.2018\n<br><br>\nReports to: CTO\n<br><br>\nLocation: Denver\n<br><br>\nClassification: Exempt\n<br><br>\nSalary Grade: NA\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\n<strong>Who we are:</strong>\n<br><br>\nSince 1998, SambaSafety® has been the pioneer and leading provider of driver risk management software in North America. Our mission is to guide our customers including employers, fleet managers and insurance providers to make the right decision at the right time. By collecting, correlating and analyzing motor vehicle records (MVRs) and other data sources, we identify driver risk and enable our customers to modify their drivers behavior, reduce accidents, ensure compliance, and lower costs ultimately improving driver and community safety. Our solutions provide the information that our clients need to make informed decisions about the people operating commercial vehicles, passenger vehicles, or heavy machinery. SambaSafety eliminates the need for an expensive, time consuming paper chase, enabling true continuous driver monitoring and management. SambaSafety works in partnership with State governments and other third-party information providers to acquire, process, and report critical driver information. Our patented data technology allows customers to filter irrelevant data, receiving actionable information to make quicker and better driver risk management decisions. In August 2012, SambaSafety acquired American Driving Records, Inc, and Softech International in 2014.\n<br><br>\nSambaSafety is a wholly-owned subsidiary of Safety Holdings, Inc., a privately held Delaware corporation.\n<br><br>\n<strong>Our Mission</strong>\n<br><br>\nTransforming data into action to protect businesses and communities from driver and mobility risk.\n<br><br>\nOur Core Values\n<br><br>\nAccountability. Teamwork. Impact\n<br><br>\n<strong>What what we're looking for:</strong>\n<br><br>\nSambaSafety is growing and we're looking for a Data Scientist. The Data Scientist is responsible for modeling complex industry problems, discovering insights and identifying opportunities through the use of statistical, algorithmic, mining and visualization techniques. In addition to advanced analytic skills, this role is also proficient at integrating and preparing large, varied datasets, architecting specialized database and computing environments, and communicating results.\n<br><br>\nThe Data Scientist will work closely with product managers, clients, data stewards, and other IT teams to turn data into critical information and knowledge that can be used to make sound organizational decisions. Other responsibilities include providing data that is congruent and reliable. The candidate needs to be a creative thinker and propose innovative ways to look at problems by using data mining approaches on the set of information available. The individual will need to be able to present back findings to the business by exposing assumptions and validation work in a way that can be easily understood by business counterparts.\n<br><br>\nThe ideal candidate will need a combination of business focus, strong analytical and problem-solving skills and programming knowledge to be able to quickly cycle hypothesis through the discovery phase of the project. Excellent written and communications skills to report back the findings in a clear, structured manner are required.\n<br><br>\n<strong>What youll do:</strong>\n\n<ul>\n<li>Innovation: Improve organizational performance though the application of original thinking to existing and emerging methods, processes, products and services. Successful at developing solutions that address meaningful work issues.</li> \n\n<li>Communications for Results: Express technical and business concepts, ideas, feelings, opinions, and conclusions orally and in writing in easy to understand terms for the business.</li>\n<li>Data Management: Audit internal and external data sources and determine what is available and relevant. Work with engineering to support data collection, integration, and retention requirements based on feedback from the business and the landscape of the industry.</li>\n<li>Change Advocate: Encourage prudent risk-taking, exploration of alternative approaches, and organizational learning. Partner with Product Management and Engineering to educate and promote various analytical methods.</li> \n\n<li>Problem Solving: Anticipate, identify and define problems. Seek root causes. Develop and implement practical and timely solutions.</li>\n</ul>\n<strong>Qualifications youll need:</strong>\n\n<ul>\n<li>Graduate degree in math, statistics, engineering, operational research, computer science, and other quantitative fields is required.</li>\n<li>5+ years of hands on working experience with scripting languages like Python, R and their specific libraries used for machine learning and data analytics and good command of SQL and proven experience working with large databases.</li>\n<li>Proven experience solving complex business problems using machine learning, AI or other statistical and data analytics approaches.</li>\n<li>Solid statistics or data analytics approaches, methods, applications to real world issues.</li>\n<li>A passion for data science and advanced machine learning.</li>\n<li>Ability to interact with a diverse group of subject matter experts and other technical and non-technical cross-functional team members within a large global organization.</li>\n<li>Creative, innovative, persistent, and forwarding thinking</li>\n<li>Self-starter who can work independently for new initiatives. A true team player who is not only open to different ideas but also goes out of way to help colleagues.</li>\n<li>Demonstrable methods to stay up to date on the latest developments and self-improve in data analytics and other software technologies.</li>\n</ul>\n<strong>Other Duties:</strong>\n<br><br>\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n<br><br>\n<strong>Benefits and Perks:</strong>\n\n<ul>\n<li>Unlimited time off (vacation, sick, volunteer = your choice!)</li>\n<li>Generous insurance policies</li>\n<li>Tuition reimbursement</li>\n<li>Money for fitness programs</li>\n<li>Awesome Culture</li>\n<li>Kitchen stocked daily with tasty snacks and drinks</li>\n<li>Free parking</li>\n<li>401k</li>\n</ul>\nSambaSafety provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, gender identity and expression or genetics."}