{"job title": "Data Scientist", "company": "Samba TV", "city state": "– San Francisco, CA", "rating": "4.1", "job description": "Samba TV, recognized by Inc. Magazine as one of the fastest growing companies in the US and one of the \"most interesting ad-tech upstarts of the year\" by Business Insider, is seeking to hire a Data Scientist to join our Data Science &amp; Analytics team and help us build the first real-time cross-screen TV analytics platform that brings the power of online analytics to TV data.\n<br><br>\nSamba TV is uniquely positioned at the forefront of the TV revolution. The way people discover, watch, and engage with television has fundamentally changed, and we're connecting the dots to help better understand audience trends and viewership habits for marketers.\n<br><br>\nThe perfect candidate will have a background in math, stats, physics, econometrics, computer science or a related quantitative field, will have experience working with large data stores, statistical modeling, and will have experience building production level software.\n<br><br>\n<strong>R</strong><strong>esponsibilities</strong>\n\n<ul>\n<li>Design, build, and launch new data models for TV usage and associated online activity.</li>\n<li>Apply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how users interact with our products.</li>\n<li>Partner with Product and Engineering teams to solve problems, build products based on data, and identify trends and opportunities.</li>\n<li>Mine massive amounts of data to extract actionable insights that inform, influence, support, and help execute our product decisions and product launches.</li>\n<li>Design and implement reporting and metrics that track and monitor the performance of our products, the quality of our data, and overall health of the business.</li></ul>\n\n\n<ul>\n<li><strong>Data Infrastructure</strong></li>\n\n\n<ul>\n<li>Work with SQL, Map Reduce, and no-SQL databases.</li>\n<li>Design, build and launch new ETL processes.</li>\n<li>Build data sets to empower operational and exploratory analysis.</li>\n<li>Automate analyses.</li></ul>\n\n</ul>\n\n\n\n<ul>\n<li><strong>Product Operations &amp; Leadership</strong></li>\n\n\n<ul>\n<li>Design and evaluate experiments monitoring key product metrics, and understand root causes of changes in metrics.</li>\n<li>Build and analyze dashboards and reports.</li>\n<li>Influence product teams through presentation of findings.</li>\n<li>Communicate the state of business, experiment results, etc. to product and management teams.</li></ul>\n\n</ul>\n\n\n\n<ul>\n<li><strong>Exploratory Analysis &amp; Statistical Modeling</strong></li>\n\n\n<ul>\n<li>Understand ecosystems, user behaviors, and long-term trends.</li>\n<li>Identify levers to help move key metrics.</li>\n<li>Evaluate and define metrics.</li>\n<li>Build models of user behaviors for analysis and powering production systems.</li>\n<li>Identify and correct for any biases or errors in our data sets.</li></ul>\n\n\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>2+ years Data Science experience outside of academia. Title will be commensurate with experience</li> \n\n<li>Advanced degree in a quantitative discipline (applied mathematics, statistics, computer science, physics, or other related field) from a leading academic institution.</li> \n\n<li>Expert in Python and SQL. (Must have experience writing production level code.)</li>\n<li>Proficiency working with Spark to process large data sets.</li>\n<li>Excellent communication skills with demonstrated success presenting complex data and analysis (qualitative and quantitative) in a clear and compelling manner that inspires action</li>\n<li>Strong understanding of statistical analysis</li>\n<li>A strong passion for empirical research and for answering hard questions with data. A passion for problem solving, comfort with ambiguity, and creativity.</li>\n<li>A flexible analytic approach that allows for results at varying levels of precision.</li>\n<li>Quick learner, with the ability to initiate and drive projects to completion with minimal guidance.</li>\n<li>Ability to thrive in a dynamic and fast-paced environment. Drive change and collaborate effectively with a variety of individuals and organizations</li>\n</ul>\n#LI-SP1"}