{"job title": "Neural Processor (Deep Learning) Research Scientist", "company": "Samsung Semiconductor, Inc.", "city state": "– San Jose, CA, United States", "rating": "4.1", "job description": "<strong>Job Title:</strong> Neural Processor Research Scientist\n<br><br>\n<strong>What we are looking for:</strong>\n<br>\nImagine what you could do here. At Samsung, new ideas have a way of becoming innovative products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Would you like to work in a rapidly changing environment where your technical abilities will be challenged on a day-to-day basis? Samsung’s Advanced Systems Lab is searching for a world-class researcher in deep learning and it’s application to computer vision, speech, text and other domains, with the goal of improving specific problems encountered in Samsung’s products. After building prototypes that demonstrate the promise of your research, you will work with product teams to help them integrate your ideas into products.\n<br><br>\nSamsung’s Advanced Systems Lab (ASL) is working on the next generation architecture for NPU, Neural Processor Unit, to be used in handsets, ADAS, and mobile devices’ next generation Samsung products.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Conceive deep learning approaches to solving particular product problems.</li> <li>Construct and curate large problem specific datasets.</li> <li>Design and implement machine learning techniques aimed at solving specific problems.</li> <li>Transfer your technology to product groups.</li> <li>This position requires you to keep up with the latest DL research and collaborate with diverse teams, including DL researchers, hardware architects, and software engineers.</li> \n</ul>\n\n<strong>Minimum Qualifications:</strong>\n\n<ul>\n<li>Masters, PhD, or equivalent experience in Computer Science, Electrical Engineering, Artificial Intelligence, Applied Math, or related field.</li> <li>Strong C++ and Python coding skills,</li><li>Experience with using and modifying TensorFlow, Caffe, &amp; PyTorch code and/or other neural network development frameworks</li><li>Familiarity with neural networks and machine learning concepts, processor architectures, and hardware architecture concepts</li><li>Desirable – knowledge of signal processing, linear algebra, Halide, OpenVX, GPU OpenCL/Cuda programming, image processing, and compression techniques</li></ul>\n\n\n<ul>\n<li>****************************************************************************</li>\n</ul>\n\nSamsung Semiconductor Inc (SSI), an equal opportunity employer, is a world leader in Memory, System LSI, and LCD technologies. Headquartered in San Jose, California, SSI is a wholly-owned U.S. subsidiary of Samsung Electronics Co., Ltd.- the second largest semiconductor manufacturer in the world and the industry's volume and technology leader in DRAM, NAND Flash, SSDs, mobile DRAM and graphics memory. It is one of the largest providers of system logic, imaging and LED lighting solutions, as well as providing advanced process design and manufacturing for fabless companies. Samsung Semiconductor, Inc. also has a research and innovation center with numerous labs providing product design and research in: logic, memory, image sensors, displays and mobile technologies. In addition, the company supports Samsung Display Company, the largest producer of LCD and OLED displays.\n\n\n<ul>\n<li>****************************************************************************</li>\n</ul>\n\nLearn more about Samsung Semiconductor. A day in the life Samsung Video\n<br><br>\nPlease visit the Samsung Semiconductor Career Page"}