{"job title": "Data Scientist", "company": "Sanofi", "city state": "– Cambridge, Massachusetts, United States", "rating": "3.5", "job description": "<strong>About Sanofi</strong>\n<br>\nSanofi, a global healthcare leader, discovers, develops and distributes therapeutic solutions focused on patients' needs. Sanofi is organized into five global business units: Diabetes and Cardiovascular, General Medicines and Emerging Markets, Sanofi Genzyme, Sanofi Pasteur and Consumer Healthcare.\n<br><br>\n<strong>Sanofi US</strong>\n<br><br>\n<strong>At Sanofi US, we are committed to the growth of our people, connected in purpose by career, life and health.</strong>\n<br><br>\n<strong>Headquartered in Bridgewater, NJ, Sanofi US is part of a leading global healthcare company dedicated to discovering, developing and distributing therapeutic solutions focused on patients needs.</strong>\n<br><br>\n<strong>Sanofi has core strengths in diabetes solutions, human vaccines, innovative drugs, consumer healthcare, emerging markets and Sanofi Genzyme.</strong>\n<br><br>\n<strong>Sanofi US employs approximately 15,000 people across the country all dedicated to protecting health, enhancing life and responding to the hopes and potential healthcare needs of seven billion people around the world.</strong>\n<br><br>\n<strong>Commitment is our Strength. Ready to grow together?</strong>\n<br><br>\n<strong>Sanofi US endeavors to make our career center accessible to any and all users. If you are experiencing difficulty and need assistance applying online, please call 1-800-207-8049 Option 7, then Option 3.</strong>\n<br><br>\nSanofi US Services, Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law.\n<br><br>\nAdvanced Analytics - Data Scientist will execute advanced computational approaches to accelerate and optimize evidence-based pharmaceutical product development. He/She will leverage high-dimensional population health data to support R&amp;D, Medical, HEVA, commercial product development, access and business strategy. The Advanced Analytics Data Scientist roles will generate analytics to aid in the development and launch of Sanofi medicines.\n<br><br>\nExamples of Advanced Analytics activities:\n<ul>\n<li>Generating insights by merging diverse data streams e.g. health, surveillance, trend data, sensor, imaging,</li> <li>Machine/Deep Learning to elucidate disease trajectories, patient subtypes, define underdiagnosed conditions, and unmet health needs.</li>\n</ul>\nJob Responsibilities:\n<ul>\n<li>Apply a broad array of analytics skills including machine learning, statistics, text-mining/NLP, and modeling to extract insights to structured and unstructured healthcare data sources, pre-clinical, clinical trial and complementary real-world &amp; digital information streams.</li><li>Work on a variety of team-based projects providing expertise in analytical and computational approaches.</li> <li>Work with the latest tools and technologies to impact drug development</li> <li>Contribute to the Advanced Analytics plans for projects across R&amp;D, Medical Affairs, HEVA and Market Access Strategies and Plans.</li><li>Leverage analytics involving large datasets to refine and improve data models.</li><li>Build and construct prototypes of Advanced Analytic work-flows.</li>\n</ul>\nEssential Skills &amp; Experience:\n<ul>\n<li>PhD or ScD in quantitative field such as Medical Informatics, Mathematics, Biostatistics, or Computer Science, Engineering or related field</li> <li>Relevant Masters Degree, with at least 2 years of relevant industry experience (level II), or Masters degree with relevant Essential Skills and Experience (level I). Candidates with a Bachelors degree with at least 3 years in a relevant discipline and commensurate analytics experience will be considered.</li><li>Experience with open source technologies, ML libraries, and programming languages (R, python)</li><li>An ability to interact with a variety of large-scale data structures e.g. HDFS, SQL, noSQL</li><li>Experience working across multiple compute environments to create workflows and pipelines (e.g. HPC, cloud, linux systems)</li><li>Experience with any of the following: biomedical data types/population health data/real world data/novel data streams.</li><li>Strong oral and written communication skills</li><li>A demonstrated ability to work and collaborate in a team environment</li>\n</ul>\nDesirable Skills &amp; Experience\n<ul>\n<li>Experience with reproducible and collaborative technology platforms (e.g. github, containers, jupyter notebooks)</li><li>Experience with big data analytics platforms and/or workflow tools</li><li>Exposure to NLP technologies and analyses</li><li>Knowledge of some datavis technologies (ggplot2, shiny, plotly, d3, Tableau or Spotfire)</li>\n</ul>\nSanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.\n<br><br>\nWith more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.\n<br><br>\nSanofi, Empowering Life"}