{"job title": "Senior Principal Scientist/Associate Director, Antibody Discovery", "company": "Sanofi", "city state": "– Framingham, Massachusetts, United States", "rating": "3.5", "job description": "<strong>Job description:</strong>\n<br><br>\nSanofi is seeking a highly motivated candidate with an innovative mind set, experienced in microfluidic platforms for single cell characterization and transcriptome capture and analysis. The main objective for this candidate will be to establish droplet and chip based microfluidic platforms to capture immune repertoires. The candidate should be well versed in antibody discovery and development technologies. The candidate will be expected to coordinate research activities in a multi-disciplinary setting. This is a senior level position requiring scientific expertise and vision and excellent interpersonal skills.\n<br><br>\n<strong>Essential qualifications</strong>:\n<br><br>\nA Ph.D. degree and post doctoral experience in lithography and microfluidics with 3-5 years of experience in application of these platforms for biologics drug discovery and characterizations. Demonstrated successful experience in antibody/TCR research, preferably in an industry setting and experienced in leading and advancing projects are required. The candidate must have clear understanding of immunology and technical expertise in molecular and cell biology. In addition, excellent written and verbal communication skills are needed for this role.\n<br><br>\n<strong>Preferred qualifications:</strong>\n<br><br>\nCandidates with one or more of the following skills are highly desired: Thorough understanding of immune repertoire analysis and computation of large data sets. Prior experience with biotherapeutic discovery is highly desirable.\n<br><br>\nSanofi US Services, Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law.\n<br><br>\n#LI-SA\n<br><br>\n#GD-SA\n<br><br>\nAt Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all."}