{"job title": "Sr. Data Scientist", "company": "Sanofi", "city state": "– Bridgewater, New Jersey, United States", "rating": "3.5", "job description": "<strong>Job Overview:</strong>\n<br><br>\nAdvanced Analytics - Sr. Data Scientist will execute advanced computational approaches to aid in evidence-based pharmaceutical product development. He/She will leverage high-dimensional population health data to support R&amp;D, Medical, HEVA, commercial product development, access and business strategy. The Advanced Analytics role will generate analytics required by healthcare decision makers to support patient access and use of Sanofi medicines and he/she will contribute to the insights required by Sanofi internal teams to develop and commercialize the most impactful medicines.\n<br><br>\n<strong>Job Responsibilities:</strong>\n<ul>\n<li>Get to apply a broad array of capabilities spanning machine learning, statistics, text-mining/NLP, and modeling to extract insights to structured and unstructured healthcare data sources, pre-clinical, clinical trial and complementary real world information streams.</li><li>Work on a variety of team-based projects providing expertise in analytical and computational approaches.</li> <li>Have the opportunity to identify novel solutions to internal analytics &amp; data challenges including the piloting and/or evaluation of tools for analytics, reporting and data visualization.</li><li>Develop additional skills through training courses, mentoring, and interactions daily with team members and Sanofi stakeholders.</li><li>Provide expertise and execute advanced analytics for solving problems across R&amp;D, Medical Affairs, HEVA and Market Access Strategies and Plans.</li><li>Design and implement data models, perform statistical analysis and create predictive analysis models</li><li>Translate and appropriately champion advanced analytics results and capabilities to non-technical audiences.</li> <li>Work with internal and external data scientists to scope and execute Advance Analytics projects.</li>\n</ul>\n<strong>Essential Skills &amp; Experience</strong>:\n<ul>\n<li>PhD or ScD in quantitative field such as Health Services research, Medical Economics, Medical Informatics, Biostatistics, or Computer Science, computer engineering or related field with a minimum of 3 years of industry or academic experience</li><li>Relevant Masters Degree, with 6 or more years of related industry experience</li><li>Proficiency in at least two or more technical or analytical languages (R, Python, etc..) and a willingness to embrace new coding approaches.</li><li>Experience with advanced ML techniques (neural networks/deep learning, reinforcement learning, SVM, PCA, etc.).</li><li>Demonstrated ability to interact with a variety of large-scale data structures e.g. HDFS, SQL, noSQL</li><li>Experience working across multiple environments (e.g. AWS, GCP, linux) for optimizing compute and big data handling requirements.</li><li>Experience with any of the following: biomedical data types/population health data/real world data/novel data streams.</li><li>Strong oral and written communication skills</li><li>A demonstrated ability to work and collaborate in a team environment</li>\n</ul>\n<strong>Desirable Skills &amp; Experience</strong>\n<ul>\n<li>Ability to prototype analyses and algorithms in high-level languages embracing reproducible and collaborative technology platforms (e.g. github, containers, jupyter notebooks)</li><li>Exposure to NLP technologies and analyses</li><li>Knowledge of some datavis technologies (ggplot2, shiny, plotly, d3, Tableau or Spotfire)</li>\n</ul>\nSanofi Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law.\n<br><br>\n#GD-SA\n<br><br>\n#LI-SA\n<br><br>\nAt Sanofi diversity and inclusion is foundational to how we operate and embedded in our Core Values. We recognize to truly tap into the richness diversity brings we must lead with inclusion and have a workplace where those differences can thrive and be leveraged to empower the lives of our colleagues, patients and customers. We respect and celebrate the diversity of our people, their backgrounds and experiences and provide equal opportunity for all."}