{"job title": "Data Scientist", "company": "SAP", "city state": "– Palo Alto", "rating": "4.5", "job description": "<strong>Requisition ID:</strong> 198752\n<br>\n<strong>Work Area:</strong> Customer Service and Support\n<br>\n<strong>Expected Travel:</strong> 0 - 10%\n<br>\n<strong>Career Status:</strong> Professional\n<br>\n<strong>Employment Type:</strong> Regular Full Time\n<br>\n<strong>Original Posting Date: 10/18/2018</strong>\n<br><br>\n<strong>COMPANY DESCRIPTION</strong>\n<br><br>\nSAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.\n<br>\nSAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and improve people’s lives.\n<br><br>\n<strong><u>Job Title:</u></strong> Data Scientist\n<br><br>\n&nbsp;\n<br><br>\n<strong><u>Location:</u></strong> Palo Alto, California\n<br><br>\n&nbsp;\n<br><br>\n<strong><u>Purpose and Objective:</u></strong> SAP Labs, LLC seeks a Data Scientist for our Palo Alto, CA office to work in different areas, such as customer projects (co-innovation, consulting,&nbsp;custom development, projects with internal customers), development, or&nbsp;research.\n<br><br>\n&nbsp;\n<br><br>\n<strong><u>Expectations and Tasks:</u></strong> Customer projects: execute the mathematical modeling of our&nbsp;customers’ business problems, develop algorithms, data mining flows and&nbsp;applications to solve these problems, and help our customers directly to&nbsp;understand and implement the results of the analysis. In this role, work&nbsp;directly with industry experts and technology experts to translate our&nbsp;customers’ business needs into mathematical models and present and deliver a&nbsp;solution to the client. Development: integrate or implement data&nbsp;mining/mathematical methods into products. Responsible for evaluating and&nbsp;testing data mining methods and maintains a high level of quality. Work closely&nbsp;with the senior data scientist to prototype new innovations and eventually get&nbsp;them into the product. Contribute to data definitions, data storage&nbsp;infrastructure for data mining purposes and to Data Mining architectures.&nbsp;Resolve data mining performance issues, monitor data mining system performance,&nbsp;and implement efficiency improvements. Implement data mining algorithms if&nbsp;required. Work closely with product management, application developers,&nbsp;information developers and end users. Research Projects: perform functional and&nbsp;empirical analysis on data mining topics. Conduct research on data mining tools&nbsp;and algorithms, implement prototypes and data mining algorithms and validate&nbsp;them on real data. Contribute to best practices for data mining topics and&nbsp;collaborate with development, universities and research institutes.&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong><u>Education and Qualifications/Skills and Competencies:</u></strong> Bachelor's degree in Computer Science, Software&nbsp;Engineering, Electrical Engineering, Data Science, Business Analytics or a&nbsp;related field and 5 years of experience. Alternatively, the company will accept a Master's degree&nbsp;and 2 years of experience.&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong><u>Work Experience:</u></strong> Experience must include 1 year of experience involving the following:&nbsp;developing state-of-the-art enterprise solutions leveraging deep learning and&nbsp;machine learning; translating the recent results from research and academia in&nbsp;the area of Neural Networks into enterprise software modules; implementing&nbsp;Computer Vision and Image Processing algorithms to solve business challenges;&nbsp;implementing Natural Language Processing and Natural Language Understanding&nbsp;components to understand business context; integration of speech-to-text&nbsp;frameworks into enterprise software; implementing machine learning-based&nbsp;solutions using C, C++, Python, Java, MATLAB, OpenCV, NLP Frameworks; and Agile&nbsp;software development, task coordination and execution. 10% travel required.&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong><u>Travel:</u></strong> 10% travel required.&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong>Internal use only: reference code lhrs4262</strong>\n<br><br>\n<strong>SAP'S DIVERSITY COMMITMENT</strong>\n<br><br>\nTo harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.\n<br><br>\nSAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis.\n<br><br>\n<strong>EOE AA M/F/Vet/Disability:</strong>\n<br><br>\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.\n<br><br>\n<strong>Additional Locations :</strong>"}