{"job title": "Senior Data Scientist", "company": "SAP", "city state": "– Irvine", "rating": "4.5", "job description": "<strong>Requisition ID:</strong> 178833\n<br>\n<strong>Work Area:</strong> Information Technology\n<br>\n<strong>Expected Travel:</strong> 0 - 10%\n<br>\n<strong>Career Status:</strong> Professional\n<br>\n<strong>Employment Type:</strong> Regular Full Time\n<br>\n&nbsp;\n<br><br>\n<strong>COMPANY DESCRIPTION</strong>\n<br>\nAs market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably.\n<br><br>\n&nbsp;\n<br><br>\n<strong>PURPOSE AND OBJECTIVES&nbsp;</strong>\n<br>\n&nbsp;\n<br><br>\nAt the SAP Innovation Center Network (ICN), we map, build and inspire a future worth living. ICN is SAP’s strategic innovation vehicle which combines software engineering excellence with thought leadership and entrepreneurial spirit. We pioneer game-changing solutions in close collaboration with SAP units, customers, partners &amp; startups. At ICN, we are curious, open-minded, passionate and courageous. We bring together experts across continents, disciplines, and companies to navigate SAP to tomorrow and beyond. Spread across 11 locations around the globe, the brightest minds are working on a diverse range of projects while following the same approach to innovation. Coming from various cultural and academic backgrounds, our highly-skilled teams unite top-notch programming expertise with creative problem-solving skills. As creatives, we challenge the status quo. As developers, we create unconventional solutions. As entrepreneurs, we take our ideas to market.\n<br><br>\n&nbsp;\n<br><br>\nJoin our newest outpost in Newport Beach at the state-of-the-art Innovation Center in Southern California. Steps away from the water, you’ll be inspired to solve real-world problems around the vision of an Intelligent Hospital. As part of this passionate “startup” team of engineers, data scientists, UX and interaction designers, your work will explore how to improve peoples’ lives at a global scale. In order to come up with lighthouse solutions and bring this vision to life, you will collaborate with leaders from the buzzing local technology, medical, healthcare, and academic ecosystems. If you’re ready to bring tomorrow’s innovations to life as part of our multi-disciplinary team, then meet us by the beach at the Innovation Center in Southern California. &nbsp;\n<br><br>\n&nbsp;\n<br><br>\n· Work out of our open workspace where the focus is on cooperation and collaboration&nbsp;\n<br><br>\n· Connect with world leading software engineers, become part of the worldwide SAP network of experts, partners, and customers, have an extraordinary executive visibility&nbsp;\n<br><br>\n· Being part of a cross-functional team discovering and working on trending technologies and building next-generation applications&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong>Purpose &amp; Objectives</strong>\n<br><br>\nWe are looking for a passionate data scientist to lead the identification and exploration of whole new focus areas and to engineer machine learning solutions based on the most recent research results. This position is meant for you if you are an experienced data scientist who is looking for an exciting opportunity to explore new areas, to apply machine learning to complex business challenges.\n<br><br>\nWhat’s exciting for you:\n<br><br>\n· Work out of our open workspace where the focus is on cooperation and collaboration\n<br><br>\n· Connect with world leading software engineers, become part of the worldwide SAP network of experts, partners, and customers, have an extraordinary executive visibility\n<br><br>\n· Being part of a cross-functional team discovering and working on trending technologies and building next-generation applications\n<br><br>\n&nbsp;\n<br><br>\n<strong>Responsibilities &amp; Expectations</strong>\n<br><br>\n&nbsp;\n<br><br>\n· Guiding development teams applying cutting-edge research insights in Machine Learning and Artificial Intelligence to challenges of SAP’s research partners and customers\n<br><br>\n· Contributing to the efficiency, effectiveness, and improvement of Innovation Center Network data science best practices as a thought leader, as an advisor to the leadership of the Innovation Center Network as well as SAP’s Chief Innovation Officer\n<br><br>\n· Influence &amp; multiply knowledge and skills across SAP’s product development organization with over 20,000 employees\n<br><br>\n&nbsp;\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n· At least 5 years of experience in architecting &amp; implementing Deep Learning / Machine Learning / Data Science development projects for innovative products\n<br><br>\n· M.S. or Ph.D. in Computer Science, Machine Learning, Mathematics, Statistics, Operations Research or related field\n<br><br>\n· Deep knowledge of ML/DL frameworks (TensorFlow or Theano or Torch)\n<br><br>\n· Statistics, predictive modeling, operations research, informatics and tools, e.g., SPSS, SAS, R, Python\u2028\n<br><br>\n· Track record of developing novel learning algorithms and/or systems\n<br><br>\n· Software development experience with Java/Scala, Python, C++\n<br><br>\n· Cloud-based experience with PaaS and IaaS, as well as Cloud-based, agile, development environments.\n<br><br>\n· Strong enthusiasm and interest for new technologies and business models of the next generation\n<br><br>\n· Ability to visualize data and present core insights in a clear and compelling way\n<br><br>\n· Excellent written and communication skills in the English language\n<br><br>\n· Experience working in a fast-paced environment with a lean product development process through rapid iteration\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong>SAP'S DIVERSITY COMMITMENT</strong>\n<br>\nTo harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.\n<br>\n&nbsp;\n<br><br>\nSAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis.\n<br>\n<strong>EOE AA M/F/Vet/Disability:</strong>\n<br>\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.\n<br>\n<strong>Additional Locations:</strong>"}