{"job title": "Analytical Consultant - Text Analytics", "company": "SAS Institute", "city state": "– Arlington, VA", "rating": "3.8", "job description": "Overview\n<br><br>\nSAS has proudly helped our customers solve complex business issues with our world class analytics for more than 38 years. SAS employees around the world provide unparalleled technical acumen and domain expertise, and collectively contribute to SAS' acclaimed culture of innovation. We have a workplace like no other. We believe in stimulating work, an empowering management philosophy where you are encouraged to take risks and an inspiring workplace where creativity thrives.\n<br><br>\nWe are seeking an innovative and dedicated individual to join our Federal Practices division as a Analytical Consultant. The Analytical Consultant will support customer analytic business needs through software installation and configuration, data discovery, analysis, reporting, and presentation. The consultant will participate in end-to-end customer analytic requirements, which will include identifying data analysis needs, processing and exploring client data, translating business requirements into analytic methods, building analytic models, developing analysis reports, and presenting reports to customers.\n<br><br>\nAt this time we are seeking mid-level candidates to support clients in the Washington, DC and Baltimore metro areas. The level of this position will be determined based on the applicant's education, skills and experience.\n<br><br>\nPrimary Responsibilities\n\n\n<ul>\n<li>Provides reliable delivery of targeted project results through role as expert in the application of specific SAS methodologies, projects and technologies</li>\n<li>Providing data and analytical expertise to projects</li>\n<li>Understanding client business pains and translating them into solutions</li>\n<li>Collaborating with other professional services colleagues, project managers, and sales teams on customer implementations</li>\n<li>Understands, utilizes and communicates best practice methodologies and industry standards internally and externally.</li>\n<li>Participates in product and solution training to acquire and maintain a detailed level of product knowledge of core components of SAS offerings.</li>\n<li>Leverages detailed technical knowledge to support sales opportunities and implementations across solution domains.</li>\n<li>Conducts project requirements gathering.</li>\n<li>Participates in and leads design process.</li>\n<li>Scopes and defines work effort, resource plan, and estimates cost on phase/project.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\nEssential\n\n\n<ul>\n<li>Must be currently located in or willing to relocate to the Washington DC/Baltimore MD area</li>\n<li>Bachelor's Degree in Math, Statistics, Economics, Computer Science, Linguistics or related field</li>\n<li>8 years of professional consulting experience including at least 5 years of experience performing text analytics using SAS or other programming languages</li>\n<li>Familiarity with text analysis and text mining topics (natural language processing, topic assessment using LDA, etc.)</li>\n<li>Familiarity with regular expressions</li>\n<li>General familiarity with scripting languages</li>\n<li>Experience using a rule-writing language to define taxonomies to extract concepts and define categories</li>\n<li>Frequent travel to client sites in the DC and Baltimore metro areas with some overnight travel; approximately 25% of the time or as business requirements dictate at management discretion</li>\n</ul>\n\nPreferred\n\n\n<ul>\n<li>Master's Degree preferably Math, Statistics, Economics, Computer Science, Linguistics or related field.</li>\n<li>Current Top Secret security clearance</li>\n<li>4 additional years of text analytics, statistical analysis, or modeling experience</li>\n<li>Experience with open source text analytics</li>\n<li>Experience using scripting languages to web scrape or invoke APIs</li>\n<li>Experience with cybersecurity</li>\n<li>Ability to communicate with people of various technical and business backgrounds, including the ability to explain difficult technical concepts in simple terms to business users</li>\n<li>Excellent written, verbal, and interpersonal communication skills</li>\n<li>Ability to work as an individual or part of a team</li>\n<li>Good knowledge of SAS products, peripheral technologies and implementation best practices</li>\n<li>Good problem solving, organizational, decision-making written, oral and interpersonal skills</li>\n<li>Ability to conceptualize clients' needs and translate into specific implementation strategies</li>\n<li>Previous Federal government experience</li>\n</ul>\n\n<strong>Additional Information:</strong>\n<br><br>\nTo qualify, applicants must be legally authorized to work in the United States, and should not require, now or in the future, sponsorship for employment visa status.\n<br><br>\nSAS is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status or any other characteristic protected by law.\n<br><br>\nThe level of this position will be determined based on the applicant's education, skills and experience.\n<br><br>\nResumes may be considered in the order they are received.\n<br><br>\nSAS employees performing certain job functions may require access to technology or software subject to export or import regulations. To comply with these regulations, SAS may obtain nationality or citizenship information from applicants for employment. SAS collects this information solely for trade law compliance purposes and does not use it to discriminate unfairly in the hiring process.\n<br><br>\nWant to stay up to date with SAS culture, products and jobs? Follow us on LinkedIn<br><br>SDL2017"}