{"job title": "Senior Data Scientist", "company": "Satsyil Corporation", "city state": "– Alexandria, Virginia", "rating": "4.4", "job description": "Company Description<br><br>Satsyil is not a typical software solution company. Talented, hardworking, practiced professionals and principled people who are passionate about customers and software, brought together because they want to provide very affordable, simple and amazing solutions.<br><br>Job Description<br><br>Looking for Candidates with the following skills in priority order, also we are expecting the person to do both development and data science analytics work, most likely 50% development and 50% data science work:\n<ul>\n<li>http</li><li>elastic search</li><li>Apache zeppelin</li><li>data science</li>\n</ul>\n\n<div><strong>Responsibilities</strong>\n<ul>\n<li>Selecting features, building and optimizing classifiers using machine learning techniques.</li><li>Ability to work with Hadoop/Hive/HDFS/Spark environments to be able to experiment and write the scalable programs.</li><li>Ability to work with structured and unstructured datasets.</li><li>Ability to work with large datasets.</li><li>Enhancing data collection procedures to include information that is relevant for building analytic systems.</li><li>Processing, cleansing, and verifying the integrity of data used for analysis.</li><li>Doing ad-hoc analysis and presenting results in a clear manner.</li><li>Creating automated anomaly detection systems and constant tracking of its performance.</li> </ul></div>\n\n<br><strong>Qualifications</strong>\n\n<ul>\n<li>Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.</li><li>Strong mathematical academic background.</li><li>Experience with common data science tool-kits, such as NumPy, SciPy, NLTK, matplotlib, pandas, xlrd.</li><li>Experience with data visualization tools like Kibana/Grafana.</li><li>Experience in using Zeppelin type of tools for quick scripting.</li><li>Proficiency in using query languages such as Hive.</li><li>Extensive experience in using HDFS/HIVE/Spark environments.</li><li>Experience with NoSQL databases.</li><li>Good applied statistics skills, such as distributions, statistical testing, regression, etc.</li><li>Good scripting and programming skills (Python, Java especially using Spark).</li><li>Data-oriented personality.</li>\n</ul>\n\nAdditional Information<br><br>All your information will be kept confidential according to EEO guidelines."}