{"job title": "Data Scientist", "company": "Schireson", "city state": "– New York, NY", "rating": "4.9", "job description": "<strong><u>Who we're looking for:</u></strong>\n<br><br>\nWe are looking for an industry-oriented data scientist to join our growing team and help build cutting edge data processes and products.\n<br><br>\n<strong><u>About Schireson:</u></strong>\n<br><br>\nSchireson is the leading data science firm delivering transformative solutions in marketing and media. We have offices in New York, Boston, Seattle, Austin, and San Francisco. We always aim to do superb work, and we always try to make the experience of working with us delightful. We also try to have fun while we're doing it.\n<br><br>\nOur clients are market leaders from a wide range of industries, including media &amp; entertainment, technology, professional services, non-profit, financial services, and automotive among other categories. We forge deep, on-going relationships with our clients, and in return they trust us to help them navigate their most complex business challenges.\n<br><br>\nMany of us have professional roots in tech and marketing, and our collective previous experience spans music, entrepreneurship, market research, venture capital, investment banking and management consulting.\n<br><br>\n<strong>Your responsibilities would include:</strong>\n\n<ul>\n<li>Conducting data mining</li>\n<li>Building predictive models</li>\n<li>Developing proprietary algorithms and assets for clients</li>\n<li>Drawing key insights to drive critical decision making</li>\n<li>Creating high quality data driven presentations</li>\n<li>Collaborating with peers and managers to consistently exceed client expectations</li>\n<li>Participating in the full cycle of strategic client analysis projects from client facing kick-off to code delivery or implementation</li>\n<li>Answering key strategic client questions utilizing robust data analysis</li>\n</ul>\n<strong>The ideal candidate will have:</strong>\n\n<ul>\n<li>3-5+ years of hand-on experience doing quantitative analysis/modeling, technical/coding work</li>\n<li>A desire to work on complex data sets, predictive modeling, and machine learning projects (but not alone!)</li>\n<li>Superb communication and presentation skills</li>\n<li>Ability to think strategically, analytically, and proactively about diverse business problems</li>\n<li>Passion for managing the quality &amp; accuracy of analytics, including checking your and others' work</li>\n<li>Experience multi-tasking in a fast-paced and a fast-growing small company or professional services/consulting firm environment is a plus</li>\n<li>Proficiency with Python</li>\n<li>Experience with software engineering best practices (OOP, Version Control and/or functional programming)</li>\n<li>Expertise in SQL and relational databases</li>\n<li>Familiarity with cloud tools, AWS a plus</li>\n<li>Exposure to big data tools such as Hadoop, Hive, Sqoop, Pig, Impala or Spark is a big plus</li>\n<li>Experience in advertising or media &amp; entertainment are a plus</li>\n<li>Degrees in Physics, Mathematics, Computer Science or Engineering are a plus</li>\n</ul>"}