{"job title": "Data Scientist", "company": "Schlumberger", "city state": "– Houston", "rating": "3.5", "job description": "<div>\nData Scientist<br>\n\n <div>\nLocation: Houston - United States</div><br>\n\n<div>Schlumberger has an opening in Houston, Texas for a <strong>Data Scientist</strong>. Data Scientist is responsible to address highly challenging scientific and engineering problems for exploration and production (E&amp;P) applications using machine-learning and data analytics methods. We are seeking scientists and engineers with a strong fundamental understanding of various modern machine-learning methods, and with good experience in a few of the following areas: deep neural networks, reinforcement learning, Markov Random Fields, Bayesian networks, semi-supervised learning, computer vision, image processing, signal processing, distributed computing, and/or numerical optimization. Computer scientists, as well as candidates with a computational physics/biology/chemistry background, along with significant machine-learning knowledge, are strongly encouraged to apply. Solid knowledge of physics and experienced in oil and gas application are a plus. Substantial programming experience is expected, preferably in Python. Experiences with one or more of the following is highly desirable: HPC/Parallelization, operationalizing ML models; cloud computing (e.g. Google Cloud, AWS, etc.); familiarity with ML frameworks such as Tensorflow, Theano, MXNet, etc. Experience with big-data technologies such as Hadoop/Spark is a plus too.\n<br><br>\nThis position reports to the Data Analytics Program Manager.\n<br><br>\n<strong><u>Essential Responsibilities and Duties</u></strong><strong>:</strong>\n<br><br>\nThe candidate may work on any of the following:\n\n<ul>\n\n\t\n<li>\n Research and develop data analytics and/or machine learning systems for E&amp;P applications</li>\n<li>\n Work with domain experts to understand needs and constraints</li>\n<li>\n Work with software engineers to integrate ML solutions in E&amp;P workflows</li>\n<li>\n Communicate sophisticated ML concepts to management, clients, and the business community.</li>\n</ul>\n<strong><u>Experience and Competencies</u></strong><strong>:</strong>\n\n<ul>\n\n\t\n<li>\n PhD in Computer Science, Statistics, Electrical Engineering, Applied Mathematics, Computational Physics/Chemistry/Biology, or a highly quantitative discipline with a minimum of three years’ experience, or,</li>\n<li>\n Master’s degree in Computer Science, Electrical Engineering, Mathematics/Statistics, with a minimum of seven years of AI-related experience</li>\n<li>\n 3 years of professional experience in Data Analytics, Machine-Learning, and/or computational physics.</li>\n<li>\n Evidence of proficiency in programming</li>\n<li>\n Strong oral and written communication skills</li>\n<li>\n Ability to work independently and in a team of scientists and engineers</li>\n<li>\n Candidates must be able to legally work and reside in the US, without sponsorship.</li>\n</ul>\nHTC is part of the Schlumberger Digital organization. As the oil and gas industry’s leading supplier of technology, integrated project management, and information solutions to customers worldwide, the Schlumberger digital technology development and management initiatives play a key role in driving of the oilfield service industry’s digital technology transformation.\n<br><br>\nSchlumberger is an equal employment opportunity employer. Qualified applicants are considered without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, status as a protected veteran or other characteristics protected by law.\n<br><br>\nSchlumberger is a VEVRAA Federal Contractor – priority referral Protected Veterans requested.</div>\n </div>\n<br>"}