{"job title": "Data Scientist I", "company": "Schneider", "city state": "– USA-WISCONSIN-Green Bay", "rating": "3.3", "job description": "The Schneider organization is looking for an entry level Data Scientist to help design and build our next generation of analytics solutions as well as improve existing solutions. Using open source and licensed cutting edge modeling and visualization tools like R, SPSS, Python, and Tableau, you’ll be able to grow your technical skills while working on impactful and challenging analytics problems.\n<br><br>\n<strong>As a Data Scientist, you will:</strong>\n\n<ul>\n<li>Develop sufficient understanding of business operations and practices and be able apply the appropriate methods, models, and analysis with minimal direction.</li>\n<li>Prepare proposals, statements of work, project logs and updates, and presentations in a clear and concise manner. Document project assumptions and approach; track savings.</li>\n<li>Identify data sources and prepare data (merging data from different sources, cleansing, manipulation, etc.).</li>\n<li>Collaborate with Senior Data Scientists and engineers to decide on approach and design.</li>\n<li>Document and implement analytical models to deliver actionable business insights and decision support.</li>\n<li>Prepare and deliver written non-technical reports and presentations to managers indicating solution or range of possible alternatives, solution pros and cons, and technical recommendations.</li> \n</ul>\n<strong>By choosing a career with Schneider, we improve your life by offering:</strong>\n\n<ul>\n<li>Competitive Salary: $56,900 - $78,200</li>\n<li>Annual profit sharing bonuses available</li>\n<li>Strong work/life balance that includes paid holidays and generous personal time off</li>\n<li>Medical, dental and vision insurance plus company-paid life insurance</li>\n<li>401(k) savings plan with company match plus a company-paid retirement plan</li>\n<li>Tuition reimbursement and free financial service assistance</li>\n<li>Health Care Spending Account</li>\n<li>On-site services at some facilities including cafeteria, gym and fitness classes, walking/jogging trail, ATM, personal mail services, company store and much more</li>\n<li>Resilient, values-based culture that drives safety, integrity in every action, respect and excellence in all we do</li>\n<li>Individual development opportunities through company-paid training, active leadership involvement and more than 170 online personal development courses</li> \n</ul>\n<br><br>\n<strong>Our preferred Data Scientist will have:</strong>\n\n<ul>\n<li>Master’s degree in Data Science, Statistics, Mathematics, Computer Science, Engineering, or a related field, or Bachelor’s Degree plus two years of relevant experience required.</li>\n<li>Ability to build effective business relationships with clients, peers, and associates.</li>\n<li>Basic knowledge of statistics modeling, solution techniques and tools.</li>\n<li>Ability to understand the uses and limitations of statistical methodologies such as time-series forecasting, regression analysis, random forests, k-means clustering and Bayesian methods, machine learning, and the ability to select the appropriate methodology to complete assignments.</li>\n<li>Ability to learn and utilize statistical programming languages and tools such as R, SAS, Python SQL, SPSS, and Tableau.</li>\n<li>Ability to effectively communicate technical information and concepts to non-technical audiences.</li>\n</ul>\n<strong>Company Overview:</strong>\n<br><br>\nSchneider is a premier provider of truckload, logistics and intermodal services. Offering the broadest portfolio of services in the industry, Schneider’s solutions include Van Truckload, Dedicated, Regional, Bulk, Intermodal, Transportation Management, Supply Chain Management, Warehousing and Port Logistics services. A $4.4 billion company, Schneider has provided expert transportation and logistics solutions since 1935.\n<br><br>\n<strong>The Schneider Way:</strong>\n\n<ul>\n<li>We treat our customers, associates, shareholders and suppliers with honesty, dignity and respect.</li>\n<li>We are a desirable employer due to our commitment to achieving mutually beneficial, lasting relationships.</li>\n<li>We are a responsible member of the community.</li>\n</ul>\n<strong>Core Values:</strong>\n\n<ul>\n<li>Safety-first and always</li>\n<li>Integrity in every action</li>\n<li>Respect for all</li> \n\n<li>Excellence in all that we do</li>\n</ul>\nRise to the challenge and become a part of the Schneider family. Be the difference with a leader in an industry that impacts the world. Apply today! http://www.schneiderjobs.com\n<br><br>\nSchneider is an equal opportunity employer"}