{"job title": "Data Scientist", "company": "Schnucks", "city state": "– Saint Louis, MO", "rating": "3.0", "job description": "<p>Schnucks has a current opening for a<b> Data Scientist </b>reporting to the Director of Financial Planning &amp; Analytics. This role will bring technology &amp; analytical skills to unlock new and deeper insights at Schnucks. The role will drive insights into customer-focused action through communication and partnership with our strategic and tactical decision-makers; deep-dive into our largest opportunities analytically, including sales, gross profit, pitch/shrink; develop customer-focused analytics (leveraging loyalty), and basket level analysis; and develop best practices and be accountable for sharing these practices across the entire analyst team.</p>\n<p><b><u>Essential Job Responsibilities:</u></b> <b><u></u></b></p>\n<ul>\n<li>Conduct deep analysis evaluating strategic effectiveness around sales, gross profit, TIL, customers, and baskets.</li>\n<li>Develop and share analytics and best practices across entire analyst team.</li>\n<li>Centralize, standardize, and automate key analytics functions currently spread across multiple teammates.</li>\n<li>Report findings and work with business stakeholders to recommend actions.</li>\n<li>Develop predictive modeling in support of business optimization.</li>\n</ul>\n<p><b><u>Minimum Requirements:</u></b> <b><u></u></b></p>\n<ul>\n<li>Minimum Education: Master’s Degree. Will accept Bachelor’s Degree in Mathematics/Statistics plus equivalent experience.<br></li>\n<li>Minimum Years of Experience: 3 to 5 years.</li>\n</ul>\n<p><b><u>Required Knowledge, Skills and Abilities:</u></b></p>\n<ul>\n<li>Google Suite and Microsoft Office, with advanced Microsoft Excel.</li>\n<li>Working knowledge of SQL. Working knowledge of Web-Focus BI, Nitro (Nielsen), Alteryx, Tableaut tools a plus.</li>\n<li>Statistical software proficiency required; R, Python, Matlab, SAS, SPSS, etc., with demonstrated success.</li>\n<li>Functional knowledge of unstructured data sets, including how to access and consume.</li>\n<li>Certification or equivalent experience in analytic methodology (e.g. Six Sigma).</li>\n<li>Ability to handle large amounts of data, identify key information, and provide insightful recommendations to all levels within the organization with minimal direction.</li>\n<li>Ability to communicate to all audiences including strategy team, form strong partnerships, and powerfully convey their recommendations in order to gain action on their insights.</li>\n<li>Strong organizational skills, the ability to multi-task in a dynamic environment, and must keep a high level of composure and professionalism in all situations.</li>\n<li>Strong critical thinking skills with the ability to think outside the box.</li>\n<li>Advanced analytical skills and techniques, including deep statistical knowledge, big data knowledge, visualization, and data exploration.</li>\n</ul>\n<p>Equal Opportunity Employer.</p>"}