{"job title": "Data Scientist", "company": "ScienceLogic", "city state": "– Reston, VA", "rating": "3.9", "job description": "<strong>What we're looking for</strong>\n<br><br>\nScienceLogic AIOps meets an urgent and fast-growing demand for enterprise scale AIOps applications to enable Digital Transformation. The ScienceLogic Platform utilizes real-time performance monitoring and predictive analytics to optimize business processes, differentiate products and services, and create new revenue streams.\n<br><br>\n<strong>What you'll be doing</strong>\n\n<ul>\n<li>Participate in the definition of new analytics capabilities to provide our customers with the information they need to make proper decisions and help find the appropriate Machine Learning algorithms to answer these questions.</li>\n<li>Designing and deploying machine learning algorithms on commercial monitoring applications such as event correlation, anomaly detection, and predictive maintenance.</li>\n<li>Collaborating with data and subject matter experts from ScienceLogic and its customer teams to seek, understand, validate, interpret, and correctly use new data elements.</li>\n<li>You will be part of the team responsible for implementing this into the product and making it available to our customers.</li>\n</ul>\n<strong>Qualities you possess</strong>\n\n<ul>\n<li>Strong understanding of topology analysis, graph theory and traversal methods</li>\n<li>Strong understand of optimum methods for text encoding from bag of words to hashing techniques.</li> \n\n<li>NLP experience is a plus</li> \n\n<li>Strong understanding of machine learning algorithms &amp; principles (regression analysis, time series, probabilistic models, supervised classification and unsupervised learning), and their application</li>\n<li>measure effectiveness of machine learning algorithms with respect to trained models re: R squared scoring, tradeoffs between number of layers in a net vs. less computational resources/accuracy, overfitting vs. under-fitting, weights/biases etc.</li> \n\n<li>Experience with Deep Learning algorithms such as Convolutional Neural Networks, Recurrent Neural Networks and LSTM</li>\n<li>Familiarity with Deep Learning frameworks such as TensorFlow, PyTorch, Skikit-Learn and strong experience in at least one of those.</li>\n<li>Familiarity with MLaaS platforms such as IBM Watson, Amazon Sagemaker etc.</li> \n\n<li>Ability to drive a project and work both independently and in a team</li>\n<li>Smart, motivated, can do attitude, and seeks to make a difference</li>\n<li>Excellent verbal and written communication</li>\n<li>Any experience in ITIM and Network Operations is a major plus</li>\n</ul>\n<strong>Preferred</strong>\n\n<ul>\n<li>MS or PhD in Computer Science, Math, or equivalent fields. Specialization in machine learning preferred.</li> \n\n<li>3+ years of programming experience in Python. Experience with JavaScript a plus</li>\n<li>A portfolio of projects (GitHub, papers, etc.)</li>\n</ul>\n<strong>About ScienceLogic</strong>\n<br><br>\nScienceLogic is a leader in IT Operations Management, providing modern IT operations with actionable insights to resolve and predict problems faster in a digital, ephemeral world. Its solution sees everything across cloud and distributed architectures, contextualizes data through relationship mapping, and acts on this insight through integration and automation.\n<br><br>\nwww.sciencelogic.com"}