{"job title": "Data Scientist", "company": "Scientific Games", "city state": "– Alpharetta, Georgia", "rating": "3.0", "job description": "<strong>Job Description:</strong>\n<br><br>\nThe Data Scientist offers expertise based on the application of statistical knowledge and predictive modeling. An in-depth understanding of data manipulation, database management systems, statistics, and machine learning is required. The candidate should be comfortable with the model building process (data acquisition, data munging, algorithm selection, hyper parameter tuning, model performance testing, and model implementation). It is crucial to possess deep analytical skills, strong out-of-the-box thinking, and a curious mind.\n<br><br>\n<strong>Key Responsibilities:</strong>\n\n\n<ul>\n<li>Develop both descriptive and predictive models to help solve real-world industry problems</li>\n<li>Using the results of analysis and modeling, the Data Scientist must effectively communicate impactful business recommendations on a regular basis</li>\n<li>Apply machine learning and data mining techniques to identify growth opportunities</li>\n<li>Build solutions for but not limited to: customer segmentation and targeting, propensity modeling, churn modeling, lifetime value estimation, forecasting, recommendation systems, modeling response to incentives, and price optimization</li>\n<li>Identify and validate industry Key Performance Indicators (KPIs), metrics, and trends</li>\n<li>Transform and manipulate data in preparation for analysis</li>\n<li>Provide testing techniques and methodologies in order to assess the impact and effectiveness of business initiatives</li>\n<li>Keep up-to-date on relevant tools and algorithms</li>\n</ul>\n\n<strong>Required Skills and Experience:</strong>\n\n\n<ul>\n<li>Master's degree in a field with significant quantitative training (e.g. applied statistics, mathematics, economics, finance, computer science, engineering)</li>\n<li>Previous experience with retail CPG analytics is a plus</li>\n<li>Fluency in R and/or Python</li>\n<li>2+ years of experience in supervised and unsupervised machine learning methods including but not limited to clustering techniques (e.g. k-means, DBSCAN, spectral clustering), tree-based ensemble classifiers (random forests, gradient-boosted trees), support vector machines, and neural networks</li>\n<li>Familiarity with: general linear modeling, simulation, feature engineering and selection, hyperparameter tuning, cross-validation, data smoothing methods, ARIMA models, Box-Jenkins methodology, multivariate time series analysis</li>\n<li>Knowledge of SQL with the ability to independently write queries in order to extract necessary data</li>\n<li>Organized and capable of independently managing complex analytical projects from start to finish</li>\n<li>Ability to independently structure analyses and communicate findings to a non-technical audience</li>\n<li>Experience with Excel VBA/macros, Tableau, and/or Alteryx is a plus</li>\n</ul>\n\nJob Requirements\n<br><br>\nSG is an Equal Opportunity Employer and does not discriminate against applicants due to race, ethnicity, gender, sexual orientation, veteran status, or on the basis of disability or any other federal, state or local protected class. If you'd like more information about your equal employment opportunity rights as an applicant under the law, please click here EEOC Poster.\n<br><br>\nJob ID: IRC6731\n<br><br>\nHelp us improve CareerBuilder by providing feedback about this job: .\n<br><br>\n<strong>CAREERBUILDER TIP</strong>\n<br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br>\nBy applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.\n<br><br>\nScientific Games\n<br><br>\nScientific Games is a leading innovator in the global lottery and regulated gaming industries. Beginning with the breakthrough technology that launched the world's very first secure instant lottery game in 1974, the company has continued to advance the games, technology, programs, marketing research and security that have been a driving force behind the success of more than 300 customers on six continents over the last 40 years. Contact Info\n\n\n<ul>\n<li>Alpharetta, GA</li>\n</ul>"}