{"job title": "Analytics Manager []", "company": "Scientific Research", "city state": "– Atlanta, GA", "rating": "4.0", "job description": "Digital Marketing - Analytics Manager\n<br><br>\nThe ideal candidate will have an understanding of all Digital Marketing channels and will report to the Director of Marketing Intelligence. The Analytics Manager will be responsible for managing Conversion Optimization Program as well as providing insights across all Digital Marketing tactics. This role is heavily involved in ensuring the success of the Analytics Team by providing qualitative and quantitative insights to improve campaign performance and achieving the ideal Marketing Mix. This role works closely with the Paid Search, Media, Marketing Development and Creative team.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Create and analyze reports for Rooms To Go web properties using Excel, Google Data Studio, Big Query and IBM Cognos.</li>\n<li>Collaborate with cross functional teams to establish measurement strategies, customize data collection and ensure proper configuration of Analytics</li>\n<li>Ensure data accuracy and identify methods to improve insights and capability for marketing across all analytics</li>\n<li>Troubleshoot KPI issues, as well as analytic issues that arise in Paid Search, Display Media and Social Campaigns</li>\n<li>Analyze campaign and product performance to optimize tactics and deliver insights</li>\n<li>Translate campaign and channel metrics into actionable insights, strategy and recommendations</li>\n<li>Responsible for managing the Conversion Optimization Program</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>At least 4 years of experience in a Digital Marketing Quantitative role.</li>\n<li>Bachelor Degree in Business, Marketing, Statistics or Analytics is preferred</li>\n<li>Master's Degree is a plus</li>\n<li>Self-starter with high attention to detail, strong organization skills, and ability to work on multiple projects simultaneously</li>\n<li>Proficient/Certified in Google Analytics</li>\n<li>Knowledge of 360 Google Suite</li>\n<li>Experience with Multivariate Testing</li>\n<li>Solid quantitative and proven data interpretation capabilities</li>\n<li>Excellent verbal and written communication skills, and an ability to prepare executive level presentations</li>\n</ul>\n\nEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}