{"job title": "Head of Data Science", "company": "SCOR", "city state": "– ", "rating": "3.1", "job description": "<div>\n<div>\n<div>\n<div>SCOR Global P&amp;C is hiring a newly created position as head of data science. We are looking for an experienced professional with experience helping companies (ideally insurers) to generate more/better insight from data to drive real, tangible business outcomes.\n<br><br>\nAs Head of Data Science, you will play a crucial leadership role within the P&amp;C business in establishing the data science platform, working closely with IT to execute. Your role initially will be to define our data strategy, then begin to execute advanced analytics projects that drive the P&amp;C division’s decision-making. Over time, we anticipate that you would identify collaborators and possibly be asked to form a team to execute data-driven projects with creativity, statistical rigor and business sense.\n<br><br>\nThe role is ideally based in Paris or London, but we will consider candidates based in Cologne or Zurich.\n<br><br>\n<strong><u>Key duties and responsibilities</u></strong>\n\n<ul>\n\n\t<li>Develop and lead a cross-functional data science strategy and a prioritized set of data-related project initiatives. Manage data-related projects.</li> \n\n<li>Be a data science thought leader, catalyst and mentor, both within SCOR and with selected clients. Build and share expertise on how to collect and use data in our business, whether internally or with partners.</li>\n<li>Advise on and assess the appropriateness of analytics methods, techniques, and outside partners for solving identified problems.</li> \n\n<li>Discover, explore and analyse internal and external datasets for the purpose of developing advanced analytics models.</li>\n<li>Manage analytics processes, procedures, and data governance.</li>\n<li>Develop predictive tools for the business or for clients using advanced analytics techniques including generalized linear models, logistic regression, and machine learning.</li>\n<li>Ensure that activities are consistent with client agreements, company policy, and our values.</li>\n</ul>\n<strong><u>Required experience &amp; competencies</u></strong>\n<br><br>\n<strong>Desired Skills – Leadership</strong>\n\n<ul>\n\n\t<li>Both strategic and technical mindsets; broad ability to synthesize, prioritize, and communicate complex concepts across the organization.</li>\n<li>Demonstrable experience in developing data driven insight from initial idea to successful commercial implementation.</li>\n<li>At least 5 - 10 years of commercial experience in analytics and/or data science roles.</li>\n<li>Ability to design, build and implement new modelling approaches</li>\n<li>Exceptional cross-functional team skills. Ability to collaborate and build trusting relationships with business and technology partners, both internal and external.</li> \n\n<li>Track record of delivering significant business value from small or non-standard data sets.</li>\n</ul>\n<strong>Desired Skills – Technical</strong>\n\n<ul>\n\n\t<li>Breadth of knowledge – statistics, machine learning, predictive modelling, heuristic methods, data mining, artificial intelligence, etc. – with experience across many applications in a commercial setting.</li>\n<li>Deep knowledge/experience of at least one NOSQL platform and at least one relational database platform. Must be able to work closely with data platform professionals.</li>\n<li>Experience building high-performance data tools from scratch.</li>\n<li>Excellent skills in Hadoop/Spark application development, R, SQL, Python, and data visualisation – Tableau, Spotfire</li>\n<li>Ideally, knowledge of Property &amp; Casualty insurance or reinsurance</li>\n</ul>\n<strong><u>Required Education</u> </strong>\n\n<ul>\n\n\t<li>Masters or PhD in statistics, mathematics, engineering or similar quantitative fields; or significant demonstrated experience in advanced data analytics</li>\n</ul>\n\n</div>\n</div>\n</div>\n </div>\n\n<br>"}