{"job title": "Scientist", "company": "SDHR Consulting", "city state": "– San Diego, CA", "rating": "NA", "job description": "<p>Biomatrica Inc. is a dynamic Biotechnology Company focused on Biostabilization. We develop technology to prevent degradation at ambient temperature of biological material, including assays, nucleic acids, proteins, bacteria, cells and patient samples. Biomatrica uses a biomimicry approach to develop its core technology, based on extremophile biology. Biomatrica's award winning technology is changing the world of life sciences and impacts a diverse range of disciplines including basic research, biobanking, forensics, molecular diagnostics and personalized medicine. We know that people are responsible for our success and we value our employees. Our commitment is to create a work environment where feeling valued, respected and empowered is a daily experience.</p>\n \n\n<p>Biomatrica is seeking a highly motivated scientist to work on a variety of projects in the area of sample and reagent preservation and integration in diagnostic platforms. The successful candidate will be able to design and conduct complex experiments, as well as analyze data independently and will work closely with the Director of Custom Programs to drive timely completion of projects. In particular we are interested in finding a highly motivated scientist who has an entrepreneurial spirit, team building and synergistic personality and wants to participate in building a new company with a revolutionary core technology.</p>\n \n\n<p>Duties and Responsibilities</p>\n\n<ul>\n\t<li>\n\t<p>Effective design, completion and analysis of complex experiments</p>\n\t</li>\n\t<li>\n\t<p>Serve as a technology resource to the laboratory</p>\n\t</li>\n\t<li>\n\t<p>Scientific troubleshooting and hands-on problem solving</p>\n\t</li>\n\t<li>\n\t<p>Handle human and animal blood and body fluids with confidence</p>\n\t</li>\n\t<li>\n\t<p>Simultaneous management of ongoing experiments</p>\n\t</li>\n\t<li>\n\t<p>Other duties as assigned</p>\n\t</li>\n</ul>\n \n\n<p>Qualifications</p>\n\n<ul>\n\t<li>\n\t<p>Master’s and a minimum of 5 years of laboratory experience or Ph.D. and 1 to 3 years laboratory experience</p>\n\t</li>\n\t<li>\n\t<p>Previous experience with sample and reagent preservation</p>\n\t</li>\n\t<li>\n\t<p>Extensive experience with enzymatic assays such as PCR and RT-PCR</p>\n\t</li>\n\t<li>\n\t<p>Be familiar with DNA, RNA and protein-based techniques</p>\n\t</li>\n\t<li>\n\t<p>Experience in assay development is essential</p>\n\t</li>\n\t<li>\n\t<p>Experience with diagnostic assay development and FDA regulated products a plus</p>\n\t</li>\n\t<li>\n\t<p>Highly motivated and enjoys a challenging and dynamic work environment</p>\n\t</li>\n\t<li>\n\t<p>Team player with excellent interpersonal skills</p>\n\t</li>\n\t<li>\n\t<p>Strong technical background in molecular biology, genomics or protein biochemistry is required</p>\n\t</li>\n\t<li>\n\t<p>Ability to perform statistical data analysis</p>\n\t</li>\n\t<li>\n\t<p>Fast and self-motivated learner</p>\n\t</li>\n\t<li>\n\t<p>A proven track record of grant writing and publication of original work</p>\n\t</li>\n</ul>\n \n\n<p>Biomatrica is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. The Company’s affirmative action program is available to any applicant or employee for inspection upon request.</p>"}