{"job title": "Data Scientist", "company": "Seattle Children's Hospital", "city state": "– Seattle, WA", "rating": "3.7", "job description": "As a Data Scientist in SCEA, work with developers, analysts, scientists, clinicians, and business owners in a team-driven, agile environment to develop and scale data science results and products. Work alongside clinicians to develop algorithms and models to solve critical health care needs, and provide input into driving business and clinical operations and quality improvement with advanced analytics. Dive deep into vast repositories of structured, unstructured, and streaming data to find the input for models. Create tools and libraries that can leverage products for efficient use across the enterprise and beyond.\n<br><br>\nRequired Education/Experience:\n\n\n<ul>\n<li>Bachelor’s degree or higher in a STEM or relevant analytical field that demonstrates analytical and technical competency and 2+ years as a Data Analyst using data science tools and methods OR a Master's in a STEM or relevant analytical field that demonstrates analytical and technical competency with evidence of work or applied research experience using data science tools and methods.</li>\n<li>Experience with statistics as well as machine learning/data mining/etc.</li>\n<li>Experience developing and using statistical models and algorithms</li>\n<li>Intermediate or higher experience in least one major data science language (e.g., R, Python)</li>\n<li>Experience in use of data visualization tools and methods</li>\n<li>Experience working with source control tools and version management</li>\n<li>Experience in data extraction using at least one data manipulation language/package(e.g., SQL, R-dplyr, SAS DATA step, Python-pandas)</li>\n<li>Experience as a member of a delivery team supporting integrated data science products and solutions for a wide range of customer groups.</li>\n</ul>\n\n<strong>Required Credentials:</strong>\n\n\n<ul>\n<li>N/A</li>\n</ul>\n\n<strong>Preferred:</strong>\n\n\n<ul>\n<li>N/A</li>\n\n</ul>"}