{"job title": "Data Scientist", "company": "SeatGeek", "city state": "– New York, NY", "rating": "4.7", "job description": "SeatGeek operates a unique business model in a complicated, opaque market. Many of the hardest problems we face have never been tackled at scale and do not have clear questions, let alone answers. Moving forward requires critical thinking, rapid prototyping, and intellectual dexterity.\n<br><br>\nOur team members have varied backgrounds including an expert on natural language processing, a neuroscientist, a former math teacher, and a mathematician who previously specialized in traffic flow optimization. We share common views on experimental rigor, pragmatism, and software quality.\n<br><br>\nWe want someone to join us who shares our excitement at providing data services to our colleagues and customers, someone proficient with at least one general-purpose programming language and who knows its scientific stack. We want someone who can take a messy dataset and make it clean and who can take a clean dataset and make it sing. Last but not least, we want someone who's committed not only to bettering themselves but to bettering their team, someone who values and invests in knowledge share and open communication.<br><br><strong>What you'll be doing</strong><br><br>As a member of the SeatGeek data science team you will take the complex issues facing the business and make them simple. We aim to find meaning in the data we have, go out and get the data we don't. We leverage technology whenever possible, and we strive to build systems that anticipate the needs of tomorrow as well as solving the problems of today.\n<br><br>\nHere are some things you might work on:\n\n<ul>\n<li>Design and implement statistical tests for new KPIs in our A/B testing framework</li>\n<li>Mine user interaction data for operational efficiencies and product improvements that could save our customers time and boost our bottom line</li>\n<li>Deliver a talk to engineers on your favorite Scala features or a class on epistemology to the rest of the business</li>\n<li>Estimate how adding a hundred thousand tickets to our inventory or changing how we allocate marketing resources will impact revenue</li>\n<li>Use machine learning to identify when a user has a problem before they contact us</li>\n<li>Build a model to predict the probability a particular ticket listing will sell at a given price</li>\n</ul>\n\n<strong>What we're looking for</strong><br><br>The ideal candidate has a passion for problem solving, experience working on open-ended projects, and a proven ability to come up with creative, elegant solutions to complex issues. Experience with specific tools is less important than aptitude and drive, but at a minimum we would expect:\n\n<ul>\n<li>3-5 years of academic or professional experience in a quantitative role</li>\n<li>Experience translating business problems into data problems and solving them</li>\n<li>Comfort turning ideas into code (bonus points for experience with Python or Scala)</li>\n<li>Commitment to creating and sharing reproducible analysis</li>\n<li>A passion for constantly learning and teaching others</li>\n</ul>\nBonus points for candidates who have experience with or desire to learn any of the following:\n\n<ul>\n<li>Streaming data (Reactive Extensions, Spark Streaming, Akka-streams, Kafka, RabbitMQ)</li>\n<li>AWS infrastructure (we use Redshift, S3, EMR, Kinesis, Lambda, and RDS)</li>\n<li>Building distributed software (especially on top of Spark, Hadoop, etc.) in a production environment</li>\n<li>Utilizing applied statistics or machine learning on large, complex, noisy datasets</li>\n<li>Scaling and turning statistical models into production-ready applications such as recommender systems</li>\n</ul>\n\nThe Tools We Use<br><br>We do research and development work in a custom environment optimized for repeatability and collaboration. You <strong>absolutely do not</strong> need experience with all of these, but we thought you might be curious.\n\n<ul>\n<li><strong>Languages:</strong> Python for web services and product devlopment, R for analysis and prototyping</li>\n<li><strong>Datastores:</strong> MySQL, Redshift, Elasticsearch, Redis</li>\n<li><strong>Monitoring:</strong> Graphite/StatsD</li>\n<li><strong>Version control:</strong> Git</li>\n</ul>\n\nJob Perks\n<br>\n<div>\n\n\n<ul>\n<li>A competitive base salary and equity stake in a well-funded growth stage company</li>\n<li>A culture where the product is king</li>\n<li>A monthly budget to spend on tickets to live events</li>\n<li>A laid-back, fun workplace with an endless supply of snacks/coffee/beer, frequent team lunches, and social jaunts organized by Eric Waller, our official Social Chair</li></ul>\n\n\n<ul>\n<li>The opportunity to write code that is used outside of SeatGeek, e.g. we've opensourced our a/b testing framework,Sixpack, our Redis-backed autocompleting service, Soulmate, and our Python string matching library, FuzzyWuzzy</li>\n<li>A superb benefits package, including full health/dental/vision</li>\n<li>Hackathons: scheduled times when everyone drops what they're doing and builds cool stuff in small groups</li>\n</ul>\n\n</div>\n<br>"}