{"job title": "Data Scientist", "company": "Securian Financial", "city state": "– St Paul, MN", "rating": "3.8", "job description": "<div> \n<div><strong>General information:</strong></div></div> <div> <div><div><strong>Department:</strong> Digital\n<br><br>\n<strong>Salary range:</strong>\n<br><br>\n$73,600 - $103,700/year depending on qualifications and experience.\n<br><br>\n*This position is eligible for a target bonus of 5% - 8%.\n<br><br>\n<strong>Overview:</strong>\n<br><br>\nThe ideal candidate for the position of <strong>Data Scientist</strong> is passionate about digging into large amounts of data, both known and unknown, structured and unstructured. This individual must have a strong interest in developing data science solutions to address business problems as well as an ability to interact effectively with both the technology and business teams. You will contribute significantly to the vision of our data environment and advance our data science capabilities.</div>\n</div>\n</div> <div> \n<div><strong>What you would do in this job:</strong></div></div> <div> <div><div>\n\n<ul>\n\t\n<li>Provide data science support on enterprise initiatives to drive business growth, productivity, and efficiency.</li>\n\t\n<li>Drive the adoption of data science capabilities by training and educating management and end users on data science concepts, applications and best practices.</li>\n\t\n<li>Mentor junior level data science associates within the organization.</li>\n\t\n<li>Support the implementation and development of a customer/channel partner Data Lake at Securian Financial.</li>\n</ul></div>\n</div>\n</div> <div> \n<div><strong>What we'd expect from you:</strong></div></div> <div> <div><div>\n\n<ul>\n\t\n<li>Minimum (4-6 years) of work experience and/or graduate education in Statistics, Mathematics, Data Science, Actuarial Science or Computer Science.</li>\n\t\n<li>Degree in field such as Statistics, Mathematics, Data Science or equivalent work experience.</li>\n\t\n<li>Substantial experience with data science tools (e.g. R, SAS, Tableau, SQL, Excel, etc.)</li>\n\t\n<li>Expert ability manipulating data (extraction, cleansing, joining, etc.)</li>\n\t\n<li>Demonstrable experience automating data science solutions.</li>\n\t\n<li>Strong communication skills to educate business users on data science concepts and techniques.</li>\n\t\n<li>Demonstrated organization, prioritization, and project coordination skills to work across multiple initiatives simultaneously.</li>\n\t\n<li>Experience with Big Data systems (Hadoop, Spark, Hive, Pig, etc.)</li>\n</ul></div>\n</div>\n</div> <div> \n<div><strong>Preferred skills for this job:</strong></div></div> <div> <div><div>\n\n<ul>\n\t\n<li>Familiarity with the insurance and financial services marketplace, products, distribution channels and target markets to effectively hone in on the most relevant data and Key Performance Indicators (KPIs) to drive successful business strategies is a plus.</li>\n\t\n<li>Knowledge of marketing and sales technology platforms (Salesforce, Journey Builder, Pardot, etc.)</li>\n\t\n<li>Advanced experience integrating multiple data sources to develop cross-channel insights.</li>\n</ul></div>\n</div>\n</div> <div> \n<div><strong>What you could expect from us:</strong></div></div> <div> <div><div>Appreciating diversity and the unique contributions of each associate, Securian fosters a workplace where people can develop and reach their potential. The Company offers opportunities for long-term, career growth in a wide range of fields.\n<br><br>\nWe encourage associates to prepare for future responsibilities and career success by pursuing professional and educational opportunities, and offer an extensive on-campus curriculum of industry programs and customized courses through our Training and Development department.\n<br><br>\nProviding a family-friendly workplace, we encourage associates to maintain a balance between work and personal activities, and offer a variety of life balance programs and benefits. We understand there's more to life than work.\n<br><br>\nWe also contribute to the health and vitality of the communities where we live and work through our tradition of volunteerism and philanthropy.\n<br><br>\nThe advantages we offer - opportunities for advancement, a positive and flexible work environment, a comprehensive and valuable benefits package, and a commitment to our community - result in an excellent associate retention level.</div>\n</div>\n</div> <div> \n<div><strong>Physical job requirements:</strong></div></div> <div> <div><div>\n\n<ul>\n\t\n<li>Ability to work at least 40 hours per week</li>\n\t\n<li>Ability to utilize keyboard, mouse and computer for up to 8 hours per day</li>\n\t\n<li>Ability to utilize telephone for approximately 1-4 hours per day</li>\n\t\n<li>Ability to perform simple grasping including handwriting, paper manipulation, sorting, folding, etc. periodically throughout entire workday</li>\n\n</ul>\nThe physical job requirements described above are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</div>\n</div>\n</div> <div> \n<div><strong>Equal employment opportunity:</strong></div></div> <div> <div><div>Securian Financial Group, Inc. considers applicants for all positions without regard to race, color, creed, religion, national origin, sex, gender identity, sexual orientation, genetic information, age, marital or familial status, status with regard to public assistance, disability, or Veteran status. All applicants will be considered solely on the basis of their qualifications.</div>\n</div>\n</div>"}