{"job title": "Quality Control Scientist", "company": "Select Source International", "city state": "– Andover, MA", "rating": "4.4", "job description": "Job Description<div><strong>Job Description:</strong>\n<br><br>\nMust have hands on analytical testing experience -any combination of analytical testing is fine -must have hands on GMP experience -not looking for academic experience or research experience must have industry experience -also looking for technical writing or method transfer experience\n<br><br>\n<strong>Notes:</strong>\n<br><br>\nMust have hands on analytical testing experience\n<br><br>\nAny combination of analytical testing is fine\n<br><br>\nMust have hands on GMP experience\n<br><br>\nNot looking for academic experience or research experience must have industry experience\n<br><br>\nAlso looking for technical writing or method transfer experience\n<br><br>\nThe Quality Control Analytical group is seeking a highly motivated candidate to support analytical testing activities for multiple products at the Andover site. The work includes various HPLC, UV spectrophotometry, and ELISA methods. The candidate will also be responsible for supporting technical writing, investigations, and other QC analytical business activities at the site.\n<br><br>\nThe qualified candidate will work in a cGMP Quality Control Analytical lab.\n<br><br>\n<strong>Responsibilities include:</strong>\n<br><br>\n• Prepares and record buffers and reagents, etc., and maintain work area in a neat and orderly manner.\n<br><br>\n• Perform and review analytical testing of in-process, drug substance, and drug product samples.\n<br><br>\n• Identify basic technical issues, atypical or out-of-specifications test results, instrument\n<br><br>\nmalfunctions and methodology problems and participates in the investigation to resolve and correct.\n<br><br>\n• Maintain all related data and records in compliance with cGMPs and quality procedures.\n<br><br>\n• Support laboratory investigations\n<br><br>\n• Perform laboratory support functions including method revisions and maintain work area in compliance with cGMP and quality procedures.\n<br><br>\n• Participates in continuous improvement culture within labs. Utilizes continuous improvement\n<br><br>\ntools such as DMAIC.\n<br><br>\nThis candidate would interact with immediate group and across the Quality organization.\n<br><br>\n<strong>Years of Experience 5-7.</strong>\n<br><br>\n-QC Analytical experience and GMP Lab Experience are a must\n<br><br>\n-Resumes in the past were lacking: GMP Lab, GMP Knowledge,\n<br><br>\n-Analytical Lab techniques include include but not limited to: HPLC, Elisa, UV Spectrometry, etc.\n<br><br>\n-Tasks: Run Routine assays, Analytical Lab work, electronic documentation, investigations.\n<br><br>\n-Plus would be technical writing skills, documentation, electronic documentation, LIMS, investigation experience\n<br><br>\n- BA in science related field\n<br><br>\n-previous roles: Analyst, Lab Analyst, Associate Scientist, Analytical Scientist, etc.\n<br><br>\n-Self motivator, team player\n<br><br>\n<strong>Additional Skills:</strong>\n<br><br>\n• Lab Experience in basic analytical methods: HPLC, UV, pH\n<br><br>\n• Knowledge of Advanced analytical methods: Peptide map and Oligosaccharide, ELISA, ICE, Bioassay, CE\n<br><br>\n• Strong oral and written communication skills\n<br><br>\n• Knowledge and understanding of cGMP and industry standards\n<br><br>\n• Proficiency with computer systems (Microsoft Office applications, LIMS, etc.).\n<br><br>\n• Experience working in cGMP, regulatory environment.</div>Company Description<div>Select Source International (SSI) is an IT, Health Care and Engineering Services consulting firm that has been in business since 1998. SSI consultants have provided exceptional services that have been appreciated by clients, customers, and users alike at several large Fortune 500 companies, mid-size enterprises, and consulting companies.</div>"}