{"job title": "Data Scientist", "company": "Selective Insurance", "city state": "– US-NJ-Branchville", "rating": "3.2", "job description": "Overview\n<p>The Quantitative Specialist is responsible for data science, machine learning algorithms, AI, statistical analysis, complex data analysis and the development of quantitative models that are designed to solve key business problems in the area of claims, marketing, underwriting, and many other insurance based functions. Detects, trouble-shoots, and foresees data and analysis issues and implements creative solutions. Seeks out new ideas for how data science and machine learning algorithm can add value to insurance operations.</p>\nResponsibilities\n<ul>\n <li> Apply advanced statistical and machine learning algorithm to solve critical business problem. Research, recommend, and implement new and/or alternative statistical and other mathematical methodologies appropriate for the given model or analysis.</li>\n <li>Use supervised and unsupervised modeling techniques in the development and testing of sophisticated models in all areas of insurance. Examples include claims, growth opportunities, marketing optimization, underwriting, expense reduction and many others.</li>\n <li>Lead efforts with our IT partners on the development of modeling datasets, as well as model deployment, validation and problem solving.</li>\n <li>Analyze available modeling data files in order to understand the data and identify issues that could potentially have an impact on model results.</li>\n <li>Apply design of experiment principles to test new ideas (including marketing campaigns), analyze results and provide actionable insights.</li>\n <li>Utilize text mining techniques to extract information from various sources and build models to improve customer experience and optimize operational efficiencies.</li>\n <li>Works directly with business partners to identify new advanced modeling opportunities and solutions.</li>\n <li>Work with the business partners to resolve any issues that arise from the deployment of the models including the development of sophisticated business rules.</li>\n <li>Provide training and support to junior analysts and other coworkers in the areas of business intelligence and advanced analytics.</li>\n <li>Participate in the evaluation of statistical software products for various enterprise applications.</li>\n</ul>\nQualifications\n<ul>\n <li>At least 5 years of progressive experience in data science, statistical analysis and data modeling.</li>\n <li>5 years of experience with statistical software.</li>\n <li>Insurance industry experience preferred.</li>\n <li>Professional experience building sophisticated models via regression, segmentation, decision tree, time series, design of experiments and other multivariate analysis.</li>\n <li>Experience in machine learning techniques and algorithms, such as SVM, Random Forests, and Neural etc.</li>\n <li>Experience with statistical packages (one or more) such as R, SAS, SPSS, Statistica, STATA, Alteryx, KNIME etc. are required</li>\n <li>Python (scikit) and any other computer language experience a plus.</li>\n <li>Experience with BI tools like Tableau, MSBI etc. is plus.</li>\n <li>Must be detail-oriented and possess intellectual curiosity. Outstanding organizational and communication skills. </li>\n</ul>\n<p> <em>Selective is an Equal Employment Opportunity employer. Selective maintains a drug-free workplace.</em></p>\n<p><em>#LI-BB1</em></p>"}