{"job title": "Data Engineer", "company": "ServiceTitan", "city state": "– Glendale, CA, US", "rating": "4.3", "job description": "ServiceTitan is looking for a Data Engineer to join our data team. Strong candidates will have solid command of the SQL, ETL operations, and SSIS packages in addition to very strong analytical and critical thinking skills. The most critical portion of the role is deconstructing and re-interpreting databases from other software to translate them into our database. It also includes support of existing, and development of new automated import methods. The candidate will work closely with cross departmental resources to ensure on time delivery of transferred data for customers adoption of ServiceTitan.\n<br><br>\nOur Data Engineers receive projects and deadlines from several departments. The ability to own tasks, clearly communicate requirements, delays, completion and prioritize a constantly shifting schedule of deadlines is paramount.\n<br><br>\nThis work is highly critical to successfully building our company. It is the lynchpin of the sales and onboarding process. Data concerns are a blocker for most of our customers, so delivering high quality, highly accurate transfers is absolutely crucial and greatly appreciated by both our customers and our company.\n<br><br>\n<strong>What you'll do</strong>\n\n<ul>\n<li>Map data from various legacy databases into the ServiceTitan platform, subsequently developing SQL scripts that will extract the information efficiently and accurately</li>\n<li>Develop automated scripts to validate legacy database values and identify previously unmapped fields prior to loading them into the ServiceTitan platform</li>\n<li>Receive and incorporate feedback from customers and internal stakeholders on data import quality into previously developed extraction scripts</li>\n<li>Identify opportunities to leverage information from legacy databases into the implementation process to avoid inquiring for additional information from customers</li>\n<li>Given the experimental nature of this job, we will require very tight compliance when it comes to data - we need to focus on learning</li>\n<li>Establish quality working relationships with internal stakeholders</li>\n<li>Contribute material input to go/no-go/continue decisions upon test completion</li>\n</ul>\n<strong>What you'll need</strong>\n\n<ul>\n<li>2-5 years of experience with SQL Server 2008/2012/2014/2016</li>\n<li>Advanced knowledge and experience in T-SQL, complex ETL tools and operations, and SSIS</li>\n<li>Expert level understanding of database and data model concepts</li>\n<li>Vertical SaaS experience is highly desirable</li>\n<li>Results and solution oriented - we want to know how we can win, not why we can’t</li>\n<li>Ability to work independently and cross functionally</li>\n</ul>\n<strong>About ServiceTitan</strong>\n<br><br>\nServiceTitan is a mobile, cloud-based software platform that helps home services companies streamline operations, improve customer service, and grow their business. ServiceTitan's end-to-end solution for the multi-billion dollar residential home services industry includes CRM, intelligent dispatch, custom reporting, marketing automation, mobile solution for field techs, and accounting integration with Intacct and QuickBooks. ServiceTitan brings a fully operational modern SaaS infrastructure to an industry traditionally underserved by software. ServiceTitan is the preferred software for hundreds of the world's most successful plumbing, HVAC, and electrical companies. For more information about ServiceTitan, visit www.ServiceTitan.com.\n<br><br>\nInc 5000 - Best Workplaces 2018\n<br>\nMogul Top 1000 Companies Worldwide for Millennial Women 2018\n<br>\nGlassdoor/Battery Ventures Highest Rated Cloud Computing Companies to Work 2018\n<br>\nLos Angeles Business Journal Top 100 Fastest Growing Private Company for 2017\n<br>\nInc. 5000 – America’s Fastest Growing Companies 2017\n<br>\nForbes - Next Billion-Dollar Startup List 2017"}