{"job title": "Data Scientist, Strategy", "company": "Service Titan", "city state": "– Glendale", "rating": "4.0", "job description": "What youll do\n<br><br>\nAnswer critical business questions around marketing/sales funnel optimization, customer retention, business investment prioritization, corporate development opportunities, etc.\n<br>\nInteract with key business stakeholders at ServiceTitan and own end to end data analysis and modeling of assigned projects\n<br>\nCreate sustainable data science models and participate in the continuous improvement of predictive analytics framework\n<br>\nLeverage insights gained from analytics into actionable business recommendations\n<br>\nDevelop dashboards and systems to monitor our business metrics at an in-depth level to spot emerging trends, challenges, and potential opportunities\n<br>\nPromote adoption of cutting edge analytics across ServiceTitan, implement innovative quantitative research tools and models, ultimately contributing to the development of ServiceTitans Decision Support System\n<br><br>\nWhat youll need\n<br><br>\nMS/Ph.D in Statistics, Applied Mathematics, Economics, Engineering, or similar quantitative discipline required\n<br>\n5+ years experience (or 3+ years post Ph.D) as a data scientist/analyst developing business-oriented models such as marketing analytics, demand forecasting, price optimization, customer segmentation, etc…\n<br>\nHands on knowledge of data mining, forecasting and optimization mathematics\n<br>\nProficiency with one or more statistical and optimization packages (Python, R, Matlab). Expertise in SQL.\n<br>\nExperience with Business Intelligence (Tableau) is also helpful, Experience with Agile software development a plus\n<br>\nGood communication skills are a must (written/verbal) including the ability to communicate complex concepts to non-technical business stakeholders.\n<br>\nCapability to drive research and analysis initiatives from project design through product development\n<br>\nCreative thinker - able to develop unique methods of analysis where traditional methods do not yield results"}