{"job title": "Data Scientist, Strategy (Marketing &amp; Sales)", "company": "ServiceTitan", "city state": "– Glendale, CA, US", "rating": "4.3", "job description": "ServiceTitan is building out its Strategic Analytics team to take our understanding of our business' growth and cost drivers to the next level, and make smarter investment and operational decisions across the company, to further accelerate our disruption of the Home Servicing industry.\n<br><br>\nPart of ServiceTitan's success can be attributed to our intensive SaaS metric-driven culture and environment, relentless investigations to get to THE root cause and come up with the right solutions to either augment/replicate successes or promptly address opportunities for improvement.\n<br><br>\nThis is a critical investment area for ServiceTitan, that bears a lot of responsibilities, as our business and technology investments portfolio grows in complexity. The performance of this team has a significant impact not only on ServiceTitan, but also on the success of our customers, impacting their lives and their pursuit of the extraordinary.\n<br><br>\n<strong>What you'll do</strong>\n\n<ul>\n<li>Answer critical business questions around marketing/sales funnel optimization, customer retention, business investment prioritization, corporate development opportunities, etc.</li>\n<li>Interact with key business stakeholders at ServiceTitan and own end to end data analysis and modeling of assigned projects</li>\n<li>Create sustainable data science models and participate in the continuous improvement of predictive analytics framework</li>\n<li>Leverage insights gained from analytics into actionable business recommendations</li>\n<li>Develop dashboards and systems to monitor our business metrics at an in-depth level to spot emerging trends, challenges, and potential opportunities</li>\n<li>Promote adoption of cutting edge analytics across ServiceTitan, implement innovative quantitative research tools and models, ultimately contributing to the development of ServiceTitan's Decision Support System</li>\n</ul>\n<strong>What you'll need</strong>\n\n<ul>\n<li>MS/Ph.D in Statistics, Applied Mathematics, Economics, Engineering, or similar quantitative discipline required</li>\n<li>5+ years experience (or 3+ years post Ph.D) as a data scientist/analyst developing business-oriented models such as marketing analytics, demand forecasting, price optimization, customer segmentation, etc…</li>\n<li>Hands on knowledge of data mining, forecasting and optimization mathematics</li>\n<li>Proficiency with one or more statistical and optimization packages (Python, R, Matlab). Expertise in SQL.</li>\n<li>Experience with Business Intelligence (Tableau) is also helpful, Experience with Agile software development a plus</li>\n<li>Good communication skills are a must (written/verbal) including the ability to communicate complex concepts to non-technical business stakeholders.</li>\n<li>Capability to drive research and analysis initiatives from project design through product development</li>\n<li>Creative thinker - able to develop unique methods of analysis where traditional methods do not yield results</li>\n</ul>\n<strong>About ServiceTitan</strong>\n<br><br>\nServiceTitan is a mobile, cloud-based software platform that helps home services companies streamline operations, improve customer service, and grow their business. ServiceTitan's end-to-end solution for the multi-billion dollar residential home services industry includes CRM, intelligent dispatch, custom reporting, marketing automation, mobile solution for field techs, and accounting integration with Intacct and QuickBooks. ServiceTitan brings a fully operational modern SaaS infrastructure to an industry traditionally underserved by software. ServiceTitan is the preferred software for hundreds of the world's most successful plumbing, HVAC, and electrical companies. For more information about ServiceTitan, visit www.ServiceTitan.com."}