{"job title": "Sr. Data Scientist (Geometric Deep Learning)", "company": "Shape (ShapeScale)", "city state": "– San Francisco, CA", "rating": "NA", "job description": "San Francisco, CA<br>\n\n<div>Based in San Francisco, we are a team with a passion for great design, user experience, hardware, software, and sports. Together we share the commitment to create products that connect the human body with technology in a magical way. We're working to become the most empowering consumer company of the 21st century.\n<br><br>\nShape is backed by renowned investors such as Y Combinator and Stanford StartX.\n<br><br>\nOur first product,ShapeScale, is the first photorealistic 3D body scanner that shows you how your body shape changes over time. It's not only a game changer for fitness but also an enabler for a number of fashion, healthcare, and AR / VR applications. We have recently started to take pre-orders for ShapeScale and have thus far received thousands of pre-orders.\n<br><br>\nShape is looking for a talentedSenior Data Scientist/ Geometric Deep Learningwith an entrepreneurial spirit to join our team and help us achieve our technology goals. In this role you will work onon the acquisition, processing, and analysis of the data captured by ShapeScale and develop state-of-the-art 3D deep learning and machine learning methods.This role is perfect for driven individuals who are excited to take on large responsibilities and solve unique technical challenges.\n<br><br>\nRecent PhD-graduates and experienced candidates are welcome to apply for this role. The candidate of choice will be hired into the level that is commensurate with their educational background and experience.<br><br><strong>WHAT YOU'LL DO</strong>\n\n<ul>\n<li>Develop existing and new body shape parameterization, segmentation, correspondence, registration, posture estimation and analysis methods and algorithms.</li><li>Design, build, train and optimize 3D deep learning and computer vision algorithms with a focus on high performance and efficient implementation.</li><li>Working with founding team members to define technology stack, understanding the business needs and choosing the right languages, tools, libraries, platforms, and partners for the job.</li><li>Lead the efforts on designing, building, and labeling Shape's dataset of 3D human body scans.</li><li>Find the best solutions to computer vision problems, innovating new network architectures when necessary, and knowing when to use existing ones.</li><li>Analyze and prototype key 3D deep learning and data analytics algorithms and applications.</li><li>Define Deep/Machine Learning architecture best practices and keep up to date with the evolving deep learning frameworks.</li><li>Develop or modify tools for visual data analysis and verification.</li><li>Utilize 3D deep learning frameworks such as TensorFlow, Caffe, Torch, PointNet, ShapeNet, etc, and implement substantial portions of production code in C / C++ and Python.</li><li>Conceive proof-of-concept prototypes that establish overall system performance.</li><li>Participate in defining product requirements.</li><li>Evaluate technical trade-offs.</li><li>Help to recruit and lead a team of data scientists.</li>\n</ul>\n\n<strong>REQUIREMENTS</strong><strong>Minimum</strong>\n\n<ul>\n<li>MS in Computer Science, Applied Mathematics, Physics or Computer Vision.</li><li>Fundamental understanding of 3D deep learning, 3D semantic scene understanding, and 3D point cloud analysis.</li><li>Hands-on experience in geometric/3D deep learning frameworks and libraries e.g., Tensorflow, Pytorch, Caffe, Keras, PointNet, ShapeNet, etc..</li><li>Experience in training and evaluation of computer vision algorithms on large datasets.</li><li>Outstanding skills in Python, C &amp; C++ with experience in writing robust and maintainable production code.</li><li>Experience in developing computer vision/imaging and machine learning algorithms for embedded and non embedded platforms.</li><li>Knowledge of object classification, template matching, or other machine learning methods for computer vision.</li><li>Comfortable with 3D computational geometry, linear algebra, statistics, numerical methods and error analysis</li><li>Experience with 3D reconstruction from camera images and depth sensors.</li>\n</ul>\n\n<strong>Preferred</strong>\n\n<ul>\n<li>Ph.D. in Computer Science, Applied Mathematics, Physics or Computer Vision.</li><li>Complete mastery of 3D deep neural networks; you have created 3D deep neural networks and seen them through to high performance and/or have published papers at the top conferences.</li><li>Prior experience involving 3D scanning or measurement of the human body is a big plus.</li><li>Completion and deployment of significant computer vision projects in a commercial environment.</li><li>Experience with existing computer vision libraries such as OpenCV, PCL, CGAL, Eigen, etc.</li><li>Experience with Texture projection, generation, completion using patch match algorithms.</li><li>Experience with 2D and 3D tracking algorithms such as SLAM.</li><li>Knowledge of WebGL / OpenGL / OpenCV/ video codec / video processing.</li><li>Proven publication track record at conferences such as SIGGRAPH, CVPR, NIPS, ECCV, ICCV, ISMAR, ICML, ICPR, etc.</li><li>Experience with computational imaging / photography.</li><li>Experience with embedded Linux / Linux Kernel / Drivers</li><li>Experience with imaging sensors and camera module packaging / manufacturing / calibration / testing</li><li>Has experience with Agile methods, Scrum / Kanban / etc.</li><li>Knowledge of scripting language, e.g. Python, Bash, etc.</li><li>Camera and/or video pipeline knowledge and experience.</li>\n</ul>\n\n<strong>BENEFITS</strong>\n\n<ul>\n<li>Competitive salary and equity</li><li>Flexible work schedule, unlimited holidays with a mandatory 15 days / year off.</li><li>Great, comprehensive health insurance : low deductible - 100% covered (incl. dependents)</li><li>Visa sponsorship if necessary</li><li>Catered lunches with healthy eating options suitable for all diets and allergies and healthy snacks</li><li>Top of the line Apple and Windows equipment of choice that you think you need to work comfortably and efficiently</li><li>Motorized sit / standing desk with Herman Miller or Steelcase chairs.</li><li>Fitness discounts and fun, action-inspired company-wide events and outings, gaming evenings</li><li>Commuter benefits or subsidies</li><li>Office located at the heart of San Francisco (SoMa)</li><li>A fun, creative and collaborative environment of a young startup company with a driven, agile and adept international team</li><li>The opportunity to have an impact on millions of people and make them happier and healthier</li></ul></div>\n<br>PI105644728"}