{"job title": "Data Scientist", "company": "Shields Health Solutions", "city state": "– Quincy, MA", "rating": "5.0", "job description": "<strong>Who we are:</strong>\n<br><br>\nAs the first and largest specialty pharmacy integrator and accelerator, Shields Health Solutions sits at the nexus of the $200B specialty pharmacy industry. Shields builds and manages hospital-owned specialty pharmacies for health systems who want to offer coordinated care services for patients with chronic illness. Our patient-centric TelemetryRx platform enables health systems to improve medication adherence, reduce patient readmission rates, and ultimately improve health outcomes through the collection and distillation of clinical, behavioral, and financial data. Shields Health Solutions is one of the fastest growing healthcare companies and has proven its immense impact on patients' lives\n<br><br>\n<strong>Whom we are looking for:</strong>\n<br><br>\nWe are searching a data science professional with flexibility and breadth of experience who is looking for a challenging career with a fast-growing company in health tech. We want to meet with those of you who measure yourself on results and quality. You should be as excited by data analytics as we are; gleaming insights from noise to portray a story that informs how we think about our business. Having the foresight to anticipate potential issues and the action-bias to propose solutions. We want to rely on you to complete your work without constant oversight; we will guide you along the way to success but do not micromanage. Most importantly, we all work together as members of a close-knit team, supporting and learning from one another. If you smile reading through this, we want you on our team.\n<br><br>\n<strong>What you will do:</strong>\n<br><br>\nEnable the success of our Data Analytics team including our innovative TelemetryRx platform. The candidate will work with fellow team members in Informatics, IT, and Data Analytics to help manage and execute various informatics projects to develop and integrate scientific data management systems and bioinformatics pipelines. Importantly, you will be a key member of the team that enables the expansion of and improves our care model to new patients by contributing information and detailed data analysis\n<br><br>\n<strong>What you need:</strong>\n<ul>\n<li>S. or Ph.D. in Statistics, Applied Math, Operations Research, Computer Science, Engineering, Computational Finance, Economics or other relevant quantitative discipline.</li><li>Minimum 3 years in data science role</li><li>Proficiency with tools such as R, SAS, Python, C++, etc.</li><li>Experience working with product development teams and/or with developers</li><li>Energy and attention to detail; this is a fast-moving environment and getting the small things right is critical for success</li><li>Going the extra mile; high-achievers who go beyond the minimum</li>\n</ul>\n<strong>Details on the role:</strong>\n<br><br>\n<ul>\n<li>Coordinate the delivery of algorithms, statistical models, and data science products and research to support efforts such as predictive adherence modeling and other analyses focused on improving patient care.</li> <li>Lead on projects, and oversee work of junior data team members as needed.</li><li>Serve as hands on technical contributor, developing algorithms, and performing analysis to solve complex problems utilizing advances statistical techniques, mathematical analysis, and/or machine learning techniques.</li><li>Mentor teammates on best practices, methodology, and problem solving.</li><li>Apply a broad array of analytics skills including machine learning, statistics, text-mining/NLP, and modeling to extract insights to structured and unstructured specialty pharmacy data sources and complementary real-world &amp; digital information streams.</li>\n</ul>\n\n<strong>0</strong>\n<br><br>\n<strong>Job Posted by ApplicantPro</strong>\n<br>"}