{"job title": "Data Scientist", "company": "SHI International Corp.", "city state": "– Somerset, NJ", "rating": "3.3", "job description": "<em>Innovative Solutions. World Class Support.</em>\n<br><br>\nHeadquartered in Somerset, NJ, SHI International Corp. has transformed itself from a $1 million “software-only” regional reseller into a $8.5 billion+ global provider of technology products and services. Privately-held and under the guidance of its current ownership since 1989, SHI has experienced tremendous growth in size and scope. Its organic growth and over two decades of stability are a direct result of backing a highly-skilled, tenured sales force with software volume licensing experts, hardware procurement specialists and certified IT services professionals.\n<br><br>\nSHI offers custom IT solutions for every aspect of your environment from software and hardware procurement to deployment planning, configuration, data center optimization, mobility and IT asset management.\n<br>\nSHI supports their clients from over 30 offices throughout the U.S., Canada, the U.K., Germany, France and Hong Kong. SHI’s goal is to foster long-term, mutually-beneficial relationships with its customers and partners, every day.\n<br><br>\n<strong>What SHI Can Offer:</strong>\n<ul>\n<li>World Class Facility includes on site gyms, restaurants and community events</li><li>Ongoing opportunities for personal and professional growth and development due to our strong promote from within philosophy</li><li>Work in an up-beat, creative, and fun environment</li><li>Benefits, include medical, vision, dental, 401K, and flexible spending</li><li>Supportive Management and Leadership</li>\n</ul>\nPassionate about using data science to create better customer experiences, identifying potential sales opportunities and creating recommendations for high value sales motions with a high probability of success. The role requires both, in depth and hands on knowledge of existing advanced analytics practices and approaches including Machine Learning &amp; Artificial Intelligence and the creativity to discuss innovation opportunities with business partners and shape cutting edge applications and proposals. The Principal scientist needs to be comfortable to work in a multidisciplinary environment to drive business solutions.\n<br><br>\nThe responsibilities include but are not limited to:\n<ul>\n<li>Directly participate in the delivery of data-driven research projects that have a direct impact on business results or product design for SHI</li><li>Will be the analytical lead and actively contribute to highly visible, complex projects, programs or solutions that are critical to SHI</li><li>Explore the space of analytical opportunities for a given problem and execute with a sound analytical strategy</li><li>Work effectively as part of a team and collaborate across business and functional groups to share results and leverage the work of project members to meet checkpoints and accomplish team objectives on time.</li><li>Acquire, augment, analyze and act on complex, high-dimensional data sets using high performance computing and advanced algorithms as required.</li><li>Manage relationships with partners across the various functions of SHI</li></ul>\n\n<ul>\n<li>A minimum of 5 years of combined industry/postdoctoral experience is required</li><li>Familiarity with large datasets, handling of sales datasets and understanding of data analysis workflows is required</li><li>Strong working knowledge of data mining algorithms including supervised and unsupervised machine learning techniques including random forest, clustering, neural networks &amp; deep learning is required</li><li>Proficient with one or more programming language such as C#</li><li>Familiarity with cloud computing</li><li>Excellent communication, interpersonal, verbal, and written skills</li>\n</ul>\n<strong>Preferred Skills:</strong>\n<ul>\n<li>Experience with Natural Language Processing or text analytics methods</li><li>Experience with SQLServer</li><li>Provide service integration techniques for data visualization</li>\n</ul>\n<strong><em>#LI-ST1</em></strong>\n<br><br>\n<strong><em>Equal Employment Opportunity – M/F/Disability/Protected Veteran Status</em></strong>"}