{"job title": "Data Scientist", "company": "Shipwell", "city state": "– Austin, TX", "rating": "3.6", "job description": "Data Scientist\n<br>\nABOUT US<br><br>Shipwell believes we are fundamentally changing the logistics industry and breaking the mold for how the supply chain has been operated for centuries. We work with thousands of shippers and carriers to create the first real solution in logistics through an unmatched technology platform. With a fast-paced and gritty startup mentally, which is generating a buzz in the investment world, Shipwell provides a unique opportunity to get in on the ground floor of a future Fortune 500 Company. We are backed by some of the best investors in both Silicon Valley and Austin who believe we are onto something and we need the right people to continue our rapid growth plan towards changing the world of freight.<br><br>DATA SCIENTIST<br><br>The Data Scientist role provides you with a unique opportunity to join a high growth, third-party logistics company as we pivot into a record-breaking 3rd year. We're laying the foundation on which our industry will be reinvented; we're looking for individuals who want to part of a significant change. Ideas come from being an innovator and an amplifier, that strives to achieve more, for themselves and to enable greatness in others.\n<br><br>\nWHAT YOU WILL DO WHEN YOU GET HERE\n\n<ul>\n<li>Analyze client proprietary and public domain datasets leveraging advanced analytics and statistics to work on scheduling and network optimization, macroeconomic forecasting, pricing, and routing</li>\n<li>Source, clean, and process a diverse set of data streams</li>\n<li>Identify and understand business needs and contextualize results of the analysis to drive impact for the organization as a whole</li>\n<li>Dynamically collaborate with operations and product teams to refine project goals, scope, and timelines</li>\n<li>Provide consulting services on both internal and external analytic questions</li>\n</ul>\nWHAT YOU NEED TO HAVE\n\n<ul>\n<li>Bachelor's degree in mathematics/statistics, engineering, computer science, or other technical disciplines</li>\n<li>Expert knowledge in a mathematical programming language of choice (preferred: R, Python, Matlab)</li>\n<li>Experience with ETL processes for manipulating data sets</li>\n<li>Detail-oriented, proactive problem-solving skills</li>\n<li>Ability to communicate complex findings in a clear, precise, and actionable manner. Able to translate high-level ideas into well-defined problems</li>\n<li>2+ years work experience (non-academic)</li>\n<li>Experience with API integration</li>\n<li>Experience with a visualization platform (e.g. Tableau) and experience with database manipulation (e.g. SQL) - preferred</li>\n</ul>\nWHY SHIPWELL?\n\n<ul>\n<li>Corporate headquarters in sunny Austin, TX</li>\n<li>Incredible growth opportunity at one of the fastest growing companies in Austin</li>\n<li>The kitchen is fully stocked with local coffee, drinks, and snacks</li>\n<li>Company sponsored healthcare insurance and dental insurance</li>\n<li>Team building events and office competitions</li>\n<li>Partial cell phone reimbursement</li>\n<li>Receive an elite technology package to include a brand new MacBook Pro!</li>\n<li>Competitive salary</li>\n<li>Opportunity to put your thumbprint on a high-growth company in the early stages</li>\n<li>An open work environment where everyone, even the new folks, have a voice</li>\n</ul>\nView all our open positions at www.shipwell.com/careers\n<br><br>\nWe've announced our Series A financing round! Read more on TechCrunch.\n<br><br>\nShipwell is an equal opportunity employer. In keeping with the values of Shipwell, we make all employment decisions including hiring, evaluation, termination, promotional and training opportunities, without regard to race, religion, color, sex, age, national origin, ancestry, sexual orientation, physical handicap, mental disability, medical condition, disability, gender or identity or expression, pregnancy or pregnancy-related condition, marital status, height and/or weight. We have pledged to create a diverse and culturally strong company and environment."}