{"job title": "Data Scientist", "company": "Shutterstock", "city state": "– New York, NY", "rating": "2.7", "job description": "<strong>The Opportunity:</strong>\n<br><br>\nShutterstock is a technology company that powers one of the world's largest two-sided marketplaces for high-quality photos, illustrations, videos and music used by individuals, businesses, marketing agencies and media organizations of all sizes. In this role, you will help us discover insights hidden in vast amounts of data and help us make smarter decisions to deliver even better products. Your primary focus will be in applying data mining techniques, AI algorithms in the areas of deep learning and machine learning, doing statistical analysis and building high-quality prediction systems integrated with our products and solutions. Along the way you will be collaborating with an extremely talented and passionate team of researchers, data scientists and engineers from around the world working for Shutterstock.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Supporting product development with innovative deep learning and machine learning algorithms</li>\n<li>Exploring immense data sets of information from images, videos, music, customer interactions, and marketing</li>\n<li>Selecting features, building and optimizing classifiers using machine learning techniques</li>\n<li>Enhancing data collection procedures to include information that is relevant for building analytic systems</li>\n<li>Processing, cleansing, and verifying the integrity of data used for analysis</li>\n<li>Analyze data from across Shutterstock including behavioral data with state of the art techniques to provide a better experience to customers</li>\n<li>Creating automated anomaly detection systems and constant performance tracking</li>\n<li>Working with data engineers, analysts and business partners to drive ideas from the rapid prototyping phase all the way through to serving and learning from live traffic at scale</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.</li>\n<li>Experience with common data science toolkits, such as R, Weka, NumPy, MatLab, etc.</li>\n<li>2+ years of industry experience creating, deploying, and learning from production algorithm analysis</li>\n<li>Fluent in one or more general purpose programming languages including but not limited to Python or Spark</li>\n<li>Proficiency in using query languages such as SQL, Hive, Pig</li>\n<li>Experience with NoSQL databases, such as MongoDB, Cassandra, HBase</li>\n<li>Excellent applied statistics skills, such as distributions, statistical testing, regression, etc.</li>\n<li>BS or MS in Computer Science or equivalent experience</li>\n</ul>\n<strong>Bonus Skills:</strong>\n\n<ul>\n<li>Using Jupyter to perform data analysis and algorithm development using Python</li>\n<li>Cloud computing experience using AWS with Docker and Kubernetes</li>\n<li>Computer Vision experience, natural language processing, recommendation systems, classification, pattern recognition</li>\n<li>Ph.D. in a related scientific field: Computer science, Physics, Math</li>\n</ul>\n<strong>About Shutterstock:</strong>\n<br><br>\nShutterstock, Inc. (NYSE: SSTK), is a leading global provider of high-quality licensed photographs, vectors, illustrations, videos and music to businesses, marketing agencies and media organizations around the world. Working with its growing community of over 190,000 contributors, Shutterstock adds hundreds of thousands of images each week, and currently has more than 125 million images and more than 6 million video clips available.\n<br><br>\nHeadquartered in New York City, with offices in Amsterdam, Berlin, Chicago, Dallas, Denver, London, Los Angeles, Montreal, Paris, San Francisco and Silicon Valley, Shutterstock has customers in more than 150 countries. The company also owns Bigstock, a value-oriented stock media agency; Offset, a high-end image collection; PremiumBeat a curated royalty-free music library; Rex Features, a premier source of editorial images for the world's media; and Webdam, a cloud-based digital asset management service for businesses.\n<br><br>\nFor more information, please visit www.shutterstock.com and follow Shutterstock on Twitter and on Facebook.\n<br><br>\nEqual Opportunity Employer, M/F/D/V"}