{"job title": "Senior Data Analyst", "company": "Siemens Corporation", "city state": "– Tarrytown, NY", "rating": "3.1", "job description": "Division: Siemens Healthineers\n<br><br>\nBusiness Unit: Laboratory Diagnostics\n<br><br>\nRequisition Number: 233378\n<br><br>\nPrimary Location: United States-New York-Tarrytown\n<br><br>\nAssignment Category: Full-time regular\n<br><br>\nExperience Level: Mid level\n<br><br>\nEducation Required Level: Bachelor's Degree\n<br><br>\nTravel Required: 10%\n<br><br>\n<strong>Division Description:</strong>\n<br><br>\nsiemens\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nPosition Overview\n<br><br>\nThis position will report to the Senior Director of Planning and be responsible for Reporting &amp; Analysis within the Materials &amp; Logistics Group of the Siemens Healthcare Diagnostics Division. Primary responsibilities include data maintenance and analysis of global inventory and customer orders &amp; shipments. Completes analysis of budgets, forecasts, and actual results across all product lines and product types. The position supports the S&amp;OP process and interacts with various functional groups and levels of management.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Main responsibilities include database maintenance, data collection, reporting and analysis.</li>\n<li>Performs Oracle database maintenance as needed including creation of new tables and views to support changes in reporting needs.</li>\n<li>Collects data on a monthly basis from a variety of systems. SAP, Demand Solutions, Oracle.</li>\n<li>Collects and maintains data using various methods and tools. SAP-SE16 query, MS Access queries, ODBC, and SQL Developer.</li>\n<li>Completes reports covering various topics including but not limited to: Line Item Fill Rates, Forecast Accuracy, Shelf Life, Inventory, Scrap, and Shipments.</li>\n<li>Completes routine and ad hoc reports in MS Excel using advanced features such as pivot tables, charts, macros, complex formulas and ODBC.</li>\n<li>Prepares monthly presentations using MS PowerPoint.</li>\n<li>Utilizes SharePoint and Secure File Exchange for report distribution.</li>\n<li>Identify, initiate, support and drive improvements in the S&amp;OP process including but not limited to data collection, order/ship processing, forecasting, and reporting.</li>\n<li>Routinely communicate within Supply Chain and also cross functional/regional areas including order processing, marketing, logistics and finance groups.</li>\n<li>Completes additional project work as assigned.</li>\n<li>Cross train with team members.</li>\n<li>Writes procedures.</li>\n</ul>\n\nPreferred Knowledge/Skills, Education, and Experience\n\n\n<ul>\n<li>MS Office 2010 with advanced MS Excel and MS Access skills.</li>\n<li>Oracle Database and SQL Developer create tables/views, load data.</li>\n<li>C# development experience</li>\n<li>SAP especially Material Master and SE16 query.</li>\n<li>Proficient working with large volumes of data from variety of sources.</li>\n<li>Good communication skills with the ability to interface with all levels of management.</li>\n<li>Ability to work independently and comfortable making decisions.</li>\n<li>Strong analytical skills.</li>\n</ul>\n\n<strong>#LI-LP1</strong>"}