{"job title": "Data/Imaging Scientist", "company": "Siemens Healthineers", "city state": "– Hoffman Estates, Illinois", "rating": "3.9", "job description": "<div><strong>Division:</strong> Siemens Healthineers<br><strong>Business Unit:</strong> Diagnostic Imaging<br><strong>Requisition Number:</strong> 232873<br><strong>Primary Location:</strong> United States-Illinois-Hoffman Estates<br><strong>Assignment Category:</strong> Full-time regular<br><strong>Experience Level:</strong> Mid level<br><strong>Education Required Level:</strong> Master's Degree<br><strong>Travel Required:</strong> 15%<br><br><strong>Division Description:</strong><br><br><p>Siemens is a global technology powerhouse that has stood for engineering excellence, innovation, quality, reliability and internationality for more than 165 years. As a global technology company, Siemens is rigorously leveraging the advantages that this setup provides. To tap business opportunities in both new and established markets, the Company is organized in nine Divisions: Power and Gas, Wind Power and Renewables, Energy Management, Building Technologies, Mobility, Digital Factory, Process Industries and Drives, Healthineers and Financial Services.<br><br>With 45,000 employees Siemens Healthineers is one of the world’s largest suppliers of technology to the healthcare industry and a leader in medical imaging, laboratory diagnostics and healthcare IT. All supported by a comprehensive portfolio of clinical consulting, training, and services available across the globe and tailored to customers’ needs. So that more people can have a life that is longer, richer, and more filled with happiness.<br><br>For more information, please visit: http://www.usa.siemens.com/healthcare</p><br><br><strong>Job Description:</strong><br><br>\n<p>Siemens Medical Solutions USA, Inc. is one of the largest global suppliers of healthcare equipment, renowned for innovative products, services and solutions including diagnostic imaging systems, therapy equipment for treatment and electro-medicine and IT solutions to optimize workflow and increase efficiency in the healthcare industry. <br><br>We are working on novel technologies to develop next generation quantitative multi modal SPECT, where artificial intelligence is complementary to image formation research. </p>\n<p> </p>\n<p>We are currently seeking a <b>Senior-level Data/Imaging Scientist</b> to join our research team at <b>Hoffman Estates, IL. </b>The ideal candidate is an experienced engineer or scientist with excellent background in computer science. </p>\n<p> </p>\n<p>In this role, you will rapidly implement complex prototypes that will go into a clinical testing environment at luminary researcher sites worldwide. You will not only drive research projects, but must support the computational and image processing efforts of the multi-disciplinary team of scientists. You should be comfortable to work on different platforms ranging from high performance CPU/GPU based workstations to clusters to cloud deployments, and be able to handle multiple projects with aggressive timelines. </p>\n<p> </p>\n<p><b>Requirements:</b></p>\n<p>· \nM.S or Ph.D. in computer sciences or equivalent</p>\n<p>· \n5+ years of experience </p>\n<p>· \nDesired areas of expertise: </p>\n<p>o \nImage and Data processing, Pattern recognition, Segmentation, Elastic registration with anatomical constraints, Locally adaptive noise reduction techniques for correlated and uncorrelated noise in multiple dimensions, optimization of inversion problems</p>\n<p>o \nMonte-Carlo gamma-rays massive computation simulations on cloud and clusters </p>\n<p>o \nCasting a CPU/GPU cluster oriented implementation into a massive GPU distributed implementation; and deployment on cloud computing infrastructure</p>\n<p>o \nUser interface and GUI design and visualization</p>\n<p>o \nFinite elements, finite differences and volumes simulations</p>\n<p>o \nMassive data handling including standards of DICOM and HL7 </p>\n<p>o \nDigital Signal processing, FPGA and embedded microcontroller programming</p>\n<p>o \nMachine and Deep Learning methods</p>\n<p>o \nParallel and high performance computing with CUDA/OpenCL, Python, Matlab, R, C/C++/C# on Windows (must), Linux/Unix platforms</p>\n<p>o \nNvidia Digits, Tensorflow, Caffe, Keras API, Estimator API, R</p>\n<p>o \nDistributed computing including deployment to cloud and local mixed ad-hoc cluster </p>\n<p>· \nAbility to communicate with both scientists and non-scientists is essential</p>\n<p></p>\n<p><br>Exceptionally qualified candidates who do not meet all requirements will also be considered.</p>\n<p><br></p>\n<p></p>\n<p>#LI-BI1</p></div>"}