{"job title": "Senior Data Analyst, Client Intergration", "company": "Signify Health", "city state": "– Dallas, TX", "rating": "4.4", "job description": "<strong></strong><div><strong>\n<u>Position Overview</u>:\n<br><br>\n</strong>\n<br>\n<div>The Senior Data Analyst, Client Integration position is responsible for fulfilling analytics needs for both internal and external client requestors. The candidate filling this position needs to have advanced technical abilities in order to mine data from multiple sources (SQL server and flat files) and transform that data into meaningful insight that will be consumed by individuals from various backgrounds. The analytics deliverables include visualizations, reports, presentations, and more.</div><br>\n\n<div>The candidate will work with the technology team, customer success, and other business groups to gather information and understand any request. In addition, this position is responsible for supporting and identifying new solutions that could optimize our current process to deliver data and insights to clients.</div><br>\n\n<div>This role will also participate in the development of analytics strategy in collaboration with Client Services team.</div>\n<br><br>\n<strong><div><u>Education/Licensing Requirements:</u></div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>High school diploma or equivalent.</li>\n<li>Bachelors degree in Math, Statistics or Computer Science or related field or equivalent work experience. BA/BS degree with 5+ years professional experience (quantitative disciplines such as math, statistics, computer science, information systems preferred)</li>\n<li>Masters degree in Mathematics or technology preferred</li>\n</ul>\n\n<strong><div><u>Responsibilities:</u></div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Work with technology/project teams to understand the business meaning of data, provide analysis and requirements so that data design is fully understood and the development initiatives are in line with intended design and standards</li>\n<li>Implement processes aligned to data management standards, ensure data quality and requirements are embedded in/adhered to within system development deliverables</li>\n<li>Apply data science expertise including descriptive, predictive, machine learning, deep learning in order to create forecast models, generate new insights, and solve business problems</li>\n<li>Demonstrate creative problem solving and ability to translate data patterns into business insights, use statistical methods to test finding through prototyping and scenario testing; cause/effect relationships and refined driver variables to amplify predictive power of underlying models</li>\n<li>Create visualizations, reports and dashboards that will be uses to convey key business KPIs on a real-time basis to key business stakeholders</li>\n<li>Partner with client, operations and other teams to drive understanding of our product offerings and services through data analysis.</li>\n<li>Work closely with Client Services to gather requirements and to develop solutions to fulfil clients requests.</li>\n<li>Implementing automated solutions for recurring ad hoc data extraction.</li>\n</ul>\n\n<strong></strong><div><strong><u>Essential Skills/Experience</u></strong><strong>:</strong></div><strong>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Experience with SQL Server, Reporting, and Data Cubes</li>\n<li>Experience with Replication and ETL</li>\n<li>Experience in statistical and data analysis (e.g. significance testing, regression modelling, factor analysis, etc.) or experience in machine learning, predictive or descriptive analytics, preferred</li>\n<li>Experience using business intelligence tools (e.g. Tableau) and data frameworks</li>\n<li>Fluently speak, read, and write English.</li>\n<li>Good verbal and written communication skills.</li>\n<li>Ability to source and skillfully manipulate both internal and external data sets</li>\n<li>Highly motivated and hard-working with ability to think clearly under pressure, both individually and in team environment</li>\n<li>Strategic thinker with strong analytical and creative problem-solving skills</li>\n<li>Demonstrated ability to develop and present business cases</li>\n<li>Ability to rapidly assess, analyze and resolve complicated issues, and distill that complexity into simple and concise communication</li>\n<li>Strong analytical skills, with experience solving ambiguous problems using data and providing practical business insights</li>\n</ul>\n\n<strong><div><u>Desired Skills and Experience:</u></div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Demonstrated ability to multi-task on several projects at one time, independently set a project schedule, effectively manage the schedule, and motivate a cross-functional team to complete projects on time within scope and with high quality</li>\n<li>4-6 years experience working as a Business Intelligence/Reporting analyst, including requirements gathering, use cases, user stories, and producing clear and concise documentation</li>\n<li>Experience in creating product roadmaps and managing the product line life cycle from strategic planning to tactical activities.</li>\n<li>Experience in defining requirements and management of creation and maintenance of essential business reports</li>\n<li>Driven to solve detailed complex problems in a collaborative environment</li>\n<li>Demonstrated analytical skills to enable factual decisions</li>\n<li>Demonstrated ability to lead vendor selection process</li>\n<li>Strong time management, prioritization, and organizational skills</li>\n<li>Excellent verbal and written communication skills with customer and industry presentation experience</li>\n<li>Excellent interpersonal skills with an understanding of how to build and maintain strong internal relationships with key stakeholders</li>\n<li>Experience with Agile development process (SCRUM)</li>\n<li>Demonstrated passion reporting, business intelligence and data practices</li>\n<li>Basic knowledge of SQL server database design and architecture preferred</li>\n<li>Knowledge of health care systems and workflows preferred</li>\n<li>Familiar with internal and external reporting requirements and dashboard style presentations of Key Performance Indicators across the enterprise preferred</li>\n</ul>\n\n</div>\n<br>"}