{"job title": "Data Scientist", "company": "Simon Data", "city state": "– New York, NY", "rating": "4.9", "job description": "<strong>ABOUT US</strong>\n<br><br>\nSimon Data was founded in 2015 by a team of successful serial entrepreneurs. We're a data-first marketing platform startup, and we approach our work seriously; we tackle problems in a scrappy and disruptive fashion, yet we build for scale to support our clients at big data volume.\n<br><br>\nWe are the first and only enterprise customer data platform with a fully-integrated marketing cloud. Moving beyond the limitations of both categories, Simon's platform empowers businesses to leverage enterprise-scale big data and machine learning to power customer communications in any channel. Simon's unique approach allows brands to develop incredible personalization capabilities without needing to build and maintain massive bespoke data infrastructure.\n<br><br>\nOur culture is rooted in organizational transparency, empowering individuals, and an attitude of getting things done. If you want to be a valuable contributor on a team that cultivates these core values we would love to hear from you.\n<br><br>\n<strong>THE ROLE</strong>\n<br><br>\nAs a Data Scientist at Simon, you will be working as part of a collaborative/user focused team and be responsible for designing and building smart systems that drive revenueour statistical models are at the core of our product, and will only become more so as we continue to develop and add features. We take an approach to ML that is data-first, and requires principled modeling decisions: we don't believe in theory-crafting models before we have collected the data that will power them, as well as built out the business process that will continue to generate that data. In the model building process, we prioritize interpretable models whose training and performance yield insights about the underlying process, along with optimizing the selected objective.\n<br><br>\nOur technologies of choice are Python in the backend and React/Redux in the frontend, and our tech stack includes Django, MySQL, Redshift, S3, DynamoDB, and Elasticsearch storage, asynchronous tasks over RabbitMQ, and distributed data processing over Elastic MapReduce and Spark.\n<br><br>\n<strong>WHAT YOU'LL DO</strong>\n\n<ul>\n<li>Build ML products that leverage Simon's extraordinary data access to drive real business value</li>\n<li>Build high-quality statistical models by executing the entire model-building process, including data cleaning, feature extraction, model selection, and predictive validation</li>\n<li>Contribute to the tooling and interfaces used to support the data science process at Simon</li>\n<li>Represent Simon DS in conversations with stakeholders at our client companies</li>\n<li>Advance Simon as a thought leader in data science, by writing blog posts and papers, and presenting at industry conferences</li>\n<li>Guide internal product and technology strategy by representing data science perspectives and requirements in conversations with your peers</li>\n</ul>\n<strong>QUALIFICATIONS</strong>\n\n<ul>\n<li>Ph.D. in Statistics/Machine Learning, or equivalent</li>\n<li>Excellent communication of statistical concepts to expert &amp; non-expert audiences</li>\n<li>Broad and up-to-date knowledge of machine learning models (and their performance characteristics) for classification and regression tasks</li>\n<li>Specific experience designing and building machine-learning models</li>\n<li>Fluency in at least one statistical coding environment (numpy/pandas, R, etc.)</li>\n<li>Comfort coding in at least one non-statistical language (e.g. Python or Java, not R or Matlab)</li>\n<li>Fluency in SQL</li>\n<li>Production-level software engineering experience is a plus</li>\n<li>Expertise in causal inference, experiment design, reinforcement learning, and related fields is a plus</li>\n</ul>\n<em>Visa sponsorship for this role is currently not available.</em>\n<br><br>\n<strong>Diversity</strong>\n<br><br>\nWe're proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, Veteran status, or any other legally protected status."}