{"job title": "Data Engineer", "company": "Simple", "city state": "– Portland, OR", "rating": "2.8", "job description": "<strong>The Company</strong>\n<br><br>\nWe're a tech company that's changing how people bank and think about their finances. We value empathy, curiosity, craft and efficacy. Our mission is to help people feel confident with their money. We do that by bringing humanity, elegance and ease to the consumer banking experience. And we make banking beautiful.\n<br><br>\n<strong>The Team</strong>\n<br><br>\nThe Data Engineering team builds and operates the pipeline that feeds Simple's data needs, currently using Postgres, Kafka, and Redshift. The team is composed of data management specialists working together to reduce operational defects and increase the capabilities of Simple's internal data customers in Product and Platform Engineering, Risk Management, Analytics, and Customer Support.\n<br><br>\n<strong>About You:</strong>\n<br><br>\nYou love both the human and technical challenges of building data solutions that create awesome business impact. You're hungry to learn about technology &amp; data, and what it can unlock for our customers. You thrive in a collaborative environment that values discussion and empirical reasoning, and believe these components lead to a successful outcome for the team and the business.\n<br><br>\n<strong>What You'll Do All Day</strong>\n<br><br>\nAs a Data Engineer you will contribute to the team's initiatives and projects. You'll participate in development and operational work that meets standards of practice for both. You'll interact across the platform and engineering teams in order to have an impact on the business at large.\n\n<ul>\n<li>Ensure our data pipeline is healthy and operational</li>\n<li>Respond to alerts and customer requests for data and analytics support</li>\n<li>Participate in design and implementation of pipeline features and enhancements</li>\n</ul>\n<strong>We'd Like To See:</strong>\n\n<ul>\n<li>Minimum 3 years of relevant experience</li> \n\n<li>Experience with SQL and Python</li>\n<li>Familiarity with data modeling, warehousing and analytics concepts and technologies</li>\n<li>Experience with AWS or other cloud services</li>\n<li>Experience designing and implementing data systems for business impact</li>\n</ul>\n<strong>Details:</strong>\n<br><br>\nWe recognize the dire lack of diversity in our industry, and we're not okay with it. We actively seek to address it with our hiring and retention processes, as well as our office culture. If you're on the fence about whether you're a fit, we say go for it, and apply!\n<br><br>\n<strong>Why Simple's a Great Place to Work:</strong>\n\n<ul>\n<li>Based in Portland, Oregon-- a beautiful place to live and work.</li>\n<li>Competitive salary and benefits package.</li>\n<li>A supportive and nurturing place to work. We actively consider how we can improve employees' quality of life--both inside and outside the office.</li>\n<li>Committed to hiring quality human beings. Simple is a place where others will watch out for you and help you learn. We actually like and respect each other.</li>\n<li>We give a damn about what we do, both as individual contributors and as a company on a mission to change banking. We're passionate and nerdy about our work; in fact we're kind of that way about things outside of work, too.</li>\n</ul>\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. Email our team at careers@simple.com if you need an accommodation in the application process.\n<br><br>\nA background check will be required for this opportunity.\n<br><br>\nSimple provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, or genetics. In addition to federal law requirements, Simple complies with all applicable state and local laws governing nondiscrimination in employment in every location in which the company has employees. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n<br><br>\nBy submitting this application, you certify that the facts contained in your application are true and complete to the best of your knowledge. If you are employed, false statements on your application will be grounds for termination."}