{"job title": "Senior Product Data Analyst", "company": "Simple", "city state": "– Portland, OR", "rating": "2.8", "job description": "<strong>The Company:</strong>\n<br><br>\nWe're a tech company that's changing how people bank and think about their finances. We value empathy, curiosity, craft and efficacy. Our mission is to help people feel confident with their money. We do that by bringing humanity, elegance and ease to the consumer banking experience. And we make banking beautiful.\n<br><br>\n<strong>The Team</strong>\n<br><br>\nAnalytics is responsible for informing Simple's key product, marketing and strategy decisions with data insights. We shape how Product, Marketing, and Simple as a whole use data to drive rapid learning and iteration. As part of the Finance and Analytics department, we are the voice of actionable insights on Simple's management team.\n<br><br>\n<strong>About You:</strong>\n<br><br>\nYou have a passion for data and have spent your career honing your analytical instincts. Your work blends a deep appreciation for great data analysis with the business-savviness to make it meaningful. You love discovering actionable data insights and working with stakeholders to put those insights to use. You are excited to work in a dynamic startup environment and shape how a product organization uses data.\n<br><br>\n<strong>What You'll Do All Day</strong>\n<br><br>\nAs a Senior Product Data Analyst at Simple, you will play a lead role in developing data insights that drive Simple's product decisions. You will draw on deep data knowledge, business savviness, and a strong analytics toolkit to scope and deliver analysis of who our customers are, how they use our product, and how we impact them. You will work directly with product managers and executive leadership to ensure your insights get heard and used. You will shape how Simple's Product team uses data. As a data leader in the company, you will be a mentor and a trusted source for data, insights, and methodology.\n<br><br>\nYou'll do this through:\n\n<ul>\n<li>Partnering with Simple's product teams to develop data insights that inform product design</li>\n<li>Using statistics and other measurement techniques to understand how new products impact customer behavior and company performance</li>\n<li>Conducting data analyses to understand how and why customers use Simple and presenting strategic takeaways to Simple's executive team</li>\n<li>Presenting on findings and takeaways across the company, to everyone from executives to peers</li>\n<li>Developing dashboards that shape how product managers and the management team think about the business</li> \n\n<li>Acting as a data and thought leader for the company and a mentor for the analytics team</li>\n</ul>\n<strong>We'd Like To See:</strong>\n\n<ul>\n<li>5+ years experience in business analysis, data analytics, data science, statistics, or related field</li>\n<li>Consistent record of conducting proactive, business-relevant data analysis and distilling actionable takeaways and recommendations</li>\n<li>Experience designing and evaluating statistical tests to measure the impact of product releases or other business decisions</li>\n<li>Well-versed in SQL or similar database languages and familiarity with Python, R or other statistical packages</li>\n<li>Familiarity with BI tools such as Power BI, Tableau or ChartIO</li>\n<li>Strong presentation and communication skills, with experience working with executives and stakeholders at all levels</li>\n<li>Experience mentoring junior analysts strongly preferred</li>\n<li>Ability to thrive in a fast-paced, dynamic environment and drive change</li>\n</ul>\n<strong>Details:</strong>\n<br><br>\nWe recognize the dire lack of diversity in our industry, and we're not okay with it. We actively seek to address it with our hiring and retention processes, as well as our office culture. If you're on the fence about whether you're a fit, we say go for it, and apply!\n<br><br>\n<strong>Why Simple's a Great Place to Work:</strong>\n\n<ul>\n<li>Based in Portland, Oregon-- a beautiful place to live and work.</li>\n<li>Competitive salary and benefits package.</li>\n<li>A supportive and nurturing place to work. We actively consider how we can improve employees' quality of life--both inside and outside the office.</li>\n<li>Committed to hiring quality human beings. Simple is a place where others will watch out for you and help you learn. We actually like and respect each other.</li>\n<li>We give a damn about what we do, both as individual contributors and as a company on a mission to change banking. We're passionate and nerdy about our work; in fact we're kind of that way about things outside of work, too.</li>\n</ul>\nIn compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. Email our team at careers@simple.com if you need an accommodation in the application process.\n<br><br>\nA background check will be required for this opportunity.\n<br><br>\nSimple provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, or genetics. In addition to federal law requirements, Simple complies with all applicable state and local laws governing nondiscrimination in employment in every location in which the company has employees. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n<br><br>\nBy submitting this application, you certify that the facts contained in your application are true and complete to the best of your knowledge. If you are employed, false statements on your application will be grounds for termination."}