{"job title": "Principal Data Science Engineer - Automatic Labs", "company": "Sirius XM", "city state": "– Irving, TX", "rating": "3.4", "job description": "Regular\n<br><br>\nLocation: Irving, TX\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nDo you want to be a part of empowering drivers with knowledge about themselves and their cars so they can be safer and drive smarter? Do you believe you shouldn't have to buy a new vehicle to have a better driving experience? Do you want to be a part of new initiatives to further empower drivers with features that have a real impact? Are you passionate about building cutting-edge meaningful technology?\n<br><br>\nWe are building new features every day to enhance the connected car story and empower drivers in meaningful and impactful ways. We are looking for energetic and passionate engineers who will be tasked to solve many of the complex problems arising to bring meaning impact to our customers.\n<br><br>\nAs a Principle Data Science Engineer you will lead the technical side to solve business problems at their root with large amounts of data. This position is an A-Z type role for a full practitioner. This person is going to get to manage and execute, from start to finish, projects including: architecture, data gathering, and manipulation, synthesis and modeling, problem-solving, and communication of insights and recommendations.\n<br><br>\nYou will be working to help build cross-functional databases in Automatic's platform as well as work on business intelligence reporting and dashboarding solutions used to in data-driven decisions, operational insights, and intuitive customer reporting.\n<br><br>\nUtilizing deep expertise in the design, creation, management, and business use of large datasets, successful candidates will work with business owners to develop and define key business questions and to build data sets that answer those questions. While focused on designing, implementing, and operating stable, scalable, low-cost solutions to flow data from production systems into the data warehouse and end-user facing applications.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Interface with business customers, gathering requirements and developing new datasets and modeling in our data environments.</li>\n<li>Manage and design a business intelligence reporting platform integrated into internal and external Automatic systems.</li>\n<li>Optimize the performance of business-critical queries and deal with ETL job-related issues.</li>\n<li>Tune application and query performance using profiling tools.</li>\n<li>Identify the data quality issues across the various platforms at Automatic Labs.</li>\n<li>Extract and comb data from multiple heterogeneous data sources.</li>\n<li>Design, implement and support a platform that can provide ad-hoc access to large datasets.</li>\n<li>Model data and metadata to support ad-hoc and pre-built reporting.</li>\n</ul>\n\n<strong>Supervisory Responsibilities:</strong>\n\n\n<ul>\n<li>None.</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>A Master's degree in a highly quantitative field (computer science, machine learning, operational research, statistics, mathematics, etc.) or equivalent, relevant experience.</li>\n<li>5+ years of experience working with large-scale, complex datasets to create/optimize machine learning, predictive, forecasting, personalization, and/or optimization models.</li>\n<li>Practical understanding and hands-on experience with the following:</li>\n<li>Supervised learning methods (linear and logistic regression, generalized linear models, decision trees, random forests, support vector machines, graphical models, neural networks / deep learning, etc.).</li>\n<li>Unsupervised learning methods (K-means, hierarchical clustering, association rules, principal components, etc.).</li>\n<li>Experience with predictive modeling and analysis.</li>\n</ul>\n\n<strong>Requirements and General Skills:</strong>\n\n\n<ul>\n<li>Good public speaking and presentation skills.</li>\n<li>Interpersonal skills and ability to interact and work with staff at all levels.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to work independently and in a team environment.</li>\n<li>Ability to pay attention to details and be organized.</li>\n<li>Ability to project professionalism over the phone and in person.</li>\n<li>Commitment to \"internal client\" and customer service principles.</li>\n<li>Willingness to take initiative and to follow through on projects.</li>\n<li>Spelling, grammar, proofreading and editing skills.</li>\n<li>Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment.</li>\n<li>Must have legal right to work in the U.S.</li>\n</ul>\n\n<strong>Technical Skills:</strong>\n\n\n<ul>\n<li>Ability to write code in R or Python.</li>\n<li>Knowledge and experience of writing SQL.</li>\n<li>Experience with Redshift, Oracle, etc.</li>\n<li>Experience with AWS services including S3, Redshift, EMR, and RDS.</li>\n<li>Experience with Big Data Technologies (Hadoop, Hive, HBase, Pig, Spark, Databricks, etc.).</li>\n<li>Experience in working and delivering end-to-end projects independently.</li>\n<li>Knowledge of distributed systems as it pertains to data storage and computing.</li>\n</ul>\n\nAs an EEO/Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice."}