{"job title": "Principal Architect - Machine Learning / AI Data Scientist", "company": "Sirius XM", "city state": "– New York, NY", "rating": "3.4", "job description": "Regular\n<br><br>\nLocation: New York, NY\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nResponsible for the development of practices and algorithms around content identification and classification, segmentation, as well as user targeting and heuristics around content, utilizing the latest in machine learning and statistical techniques.\n<br><br>\nThe ideal candidate will operate inside a scrum-based development team that is responsible for development of platform that will make use of these learnings for applications such as search indexing, recommendation and targeting, and other similar functions.\n<br><br>\n<strong>Duties and Responsibilities:</strong>\n\n\n<ul>\n<li>Develop statistical models relating to content topic identification, segment identification, and user heuristics.</li>\n<li>Leverage the latest machine learning and AI approaches, including leveraging 3rd party platform integrations where appropriate</li>\n<li>Develop algorithms in Python</li>\n<li>Performing advanced statistical validation including clustering, cross-correlation, auto correlation etc. on topic classification functions</li>\n<li>Selecting features, building and optimizing classifiers using machine learning techniques</li>\n<li>Extending company's dataset with third party sources of information where needed</li>\n<li>Enhancing data collection procedures to include information that is relevant for building analytics systems</li>\n<li>Perform ad-hoc analysis and presenting results in a clear manner to stakeholders</li>\n</ul>\n\n<strong>Supervisory Responsibilities:</strong>\n\n\n<ul>\n<li>None</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>BA in Mathematics / Computer Science / Engineering / Data Science</li>\n<li>Masters Preferred</li>\n<li>5+ years in Data Science / Machine Learning</li>\n</ul>\n\n<strong>Requirements and General Skills:</strong>\n\n\n<ul>\n<li>Interpersonal skills and ability to interact and work with staff at all levels.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to work independently and in a team environment.</li>\n<li>Ability to pay attention to details and be organized.</li>\n<li>Ability to project professionalism over the phone and in person.</li>\n<li>Ability to handle multiple tasks in a fast-paced environment.</li>\n<li>Commitment to \"internal client\" and customer service principles.</li>\n<li>Willingness to take initiative and to follow through on projects.</li>\n<li>Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment.</li>\n<li>Must have legal right to work in the U.S.</li>\n</ul>\n\n<strong>Technical Skills:</strong>\n\n\n<ul>\n<li>Algorithm design</li>\n<li>Linear/nonlinear optimization</li>\n<li>Python</li>\n<li>Tensorflow</li>\n<li>Spark</li>\n<li>Can program to help analyze complex data or build your own tools to do so.</li>\n<li>Databases: SQL &amp; NoSQL</li>\n<li>Good applied statistics skills, such as distributions, statistical testing, regression, etc.</li>\n<li>Thorough knowledge of MS-Office Suite (Word, Excel, PowerPoint, Access).</li>\n<li>Additional, non-mandatory skills: LDA, Word2Vec, REST APIs / Web Services, Java, Scala</li>\n</ul>\n\nAs an EEO/Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status.\n<br><br>\nThe requirements and duties described above may be modified or waived by the Company in its sole discretion without notice."}