{"job title": "Data Scientist", "company": "Skillz Inc.", "city state": "– San Francisco, CA", "rating": "3.3", "job description": "<strong>About Skillz:</strong>\n<br><br>\nToday, people spend more time playing video games than they do playing all physical sports, and eSports are poised to become bigger than the NFL, NBA, MLB and NHL combined. Skillz provides the technology that powers an eSports industry forecast to exceed as much as $40 billion in revenue by 2020.\n<br><br>\nAs the eSports provider for over 8,000 game developers, Skillz enables any mobile game to be turned into a competitive eSport that can also be broadcast on major streaming sites like Twitch and YouTube. We do this by integrating our unique layer of code directly into a mobile app, which activates our end-to-end tournament administration and other important features like player matching, anti-cheating mechanisms, customer support and a built-in loyalty program. Using our patented technology stack, we've already hosted more than 500 million tournaments for 15 million players around the world.\n<br><br>\nSkillz has raised over $53 million in funding from sources including Telstra, Liberty Global, and the owners of the New England Patriots, Milwaukee Bucks, New York Mets and Sacramento Kings. In our quest to make gaming better for players and developers, we're looking for savvy, driven and enthusiastic teammates to help us build the future of sports. If you're excited about defining a multibillion dollar industry, building an awesome product, or working with cutting-edge technology, Skillz just might be for you!\n<br><br>\n<strong>Our Culture:</strong>\n<br><br>\nWe are true believers in electronic sports, so don't be surprised if you see us playing mobile games at our desks or in the kitchen. At Skillz, this type of behavior is encouraged! You can also catch us at our weekly game nights playing anything from Super Mario Kart to Codenames over dinner, while discussing new technologies or brainstorming ideas to improve our business.\n<br><br>\nNot a \"gamer\"? Don't worry about it. Every Skillzian brings a unique perspective to the team, and we bond over plenty of activities that don't involve games. We're working to build a truly groundbreaking company, and we want top-notch people to join us in that mission. As the creators and leaders of a new marketplace, we work with a \"do whatever it takes\" mentality, and frankly, we get the job done!\n<br><br>\nOur team is comprised of passionate, intelligent and creative individuals who consistently seek out new challenges and knowledge. We embrace out-of-the-box strategies to propel our business forward, and foster a culture where every person's voice is heard. Our team comes from diverse backgrounds, and our leaders have a strong history of funding and building successful enterprises. If you're up for the challenge, we'd love to meet you.\n<br><br>\n<strong>Who we're looking for:</strong>\n<br><br>\nYou're ready to take the next step in your Data Science career - to a fast-moving, successful company building out their world class player matching system! You're passionate about data and finding patterns and insights that others often overlook. You're looking to have a big impact on a small team. You're oozing with curiosity and want to find new and novel ways to leverage your current skill set. You're an excellent communicator and know that you grow faster from being able to mentor others.\n<br><br>\n<strong>What You'll Do:</strong>\n\n<ul>\n<li>Work on a platform level player matching system that impacts thousands of games</li>\n<li>Implement models for anomaly detection</li>\n<li>Communicate your findings to a larger business audience</li>\n<li>Be the voice of statistical rigor across the entire organization</li>\n<li>Simulate new algorithms with bots in a staging environment to understand the impact of your ideas before users see them</li>\n<li>Collaborate with other engineering teams to have your algorithms implemented in production</li>\n</ul>\n<strong>Your Skillz:</strong>\n\n<ul>\n<li>2+ years analyzing customer behavior</li>\n<li>Programming experience (Python, R or any other relevant language)</li> \n\n<li>Excellent analytical and problem solving skills</li>\n<li>Experience building and training predictive models</li>\n<li>Working knowledge of statistical mathematics</li>\n<li>Prior experience in statistical algorithm design</li>\n<li>Ability to produce ad-hoc reports using SQL</li>\n<li>Basic understanding of optimization methodologies</li>\n<li>Good understanding of A/B testing methodologies</li>\n</ul>\n<strong>Bonus:</strong>\n\n<ul>\n<li>Prior experience in gaming</li>\n<li>Prior experience in finance</li>\n</ul>\nSkillz embraces diversity and is proud to be an equal opportunity employer. As part of our commitment to diversifying our workforce, we do not discriminate on the basis of age, race, sex, gender, gender identity, color, religion, national origin, sexual orientation, marital status, citizenship, veteran status, or disability status, and we operate in compliance with the San Francisco Fair Chance Ordinance<em>.</em>"}