{"job title": "Co-Op Business Data Analyst - Current Masters Students", "company": "Skyworks", "city state": "– Irvine", "rating": "3.4", "job description": "&nbsp;\n<br><br>\n<strong>Skyworks Solutions, Inc.</strong> is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications. We possess broad technology capabilities and one of the most complete product portfolios in the industry. Our customers are global industry leaders who are driving innovative platforms that are changing the way we all live, work and play. Our global team collaborates daily to create the semiconductors the world relies on. If you're looking for a challenging and exciting career in a fast-paced environment, Skyworks offers a variety of roles in an environment that promotes prompt decision making, uninhibited sharing of best practices and individual ownership. Here, you'll find minimal layers of management, open communication and mutual trust and respect.\n<br><br>\nRequisition ID:&nbsp;48745&nbsp;\n<br><br>\n<strong>Business Data Analyst - Co-Op</strong>\n<br><br>\n<strong>Position Summary</strong>\n<br><br>\nThe Sales and Marketing Business Operations team is seeking a motivated Co-Op pursuing a MS degree in statistics, math or data science to develop reports and analytics which drive enhanced business outcomes for Skyworks. Areas of focus will primarily be demand forecasting, marketing research and pricing.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nThis Co-Op is designed to help MS candidates develop the skills and experience required to develop/maintain reports used for demand planning, forecasting and market research. The Business Operations team, in conjunction with the Demand Management CoE (<u>C</u>enter <u>o</u>f <u>E</u>xcellence) provide a broad range of services to support Sales and Operations by providing value-adding intelligence through data analysis. The primary purpose of the role is to assist the department in further developing its data analysis and business intelligence reporting.\n<br><br>\n<strong>Organization</strong>\n<br><br>\nThe successful candidate will be embedded within the Demand Management CoE (Center of Excellence) as part of the Sales and Marketing Business Operations organization.\n<br><br>\n<strong>Requirements</strong>\n<ul>\n<li>Currently pursuing an MS Degree candidate in Statistics, Math or Data Science, or related field</li><li>Graduation date no earlier than May/June 2019 - we will not consider students who've already gradudated or those who graduate before this date</li><li>Excellent communication skills – both written and verbal</li><li>Strong base of IT and data analysis and reporting skills</li><li>Experience working with relational databases using Microsoft SQL Server or equivalent, including deriving data using Structured Query Language (SQL)</li><li>Knowledge of Statistical forecasting techniques and Algorithmic solutions</li><li>Advanced MS Excel skills</li>\n</ul>\n<strong>About Skyworks’ Demand Management</strong>\n<br><br>\nSkyworks Demand Management is a unique mix of fulfillment planning and business management. The team operates in a fast paced, customer-first environment where change is constant. The primary goal of the team is to ensure fulfillment of financial goals and customer demand. The demand management team is an integral part of Skyworks success, both tactically in fulfilling quarterly goals and strategically in planning for future success.\n<br><br>\n<strong>About Skyworks</strong>\n<br><br>\nSkyworks is an innovator of high reliability analog and mixed signal semiconductors. Leveraging core technologies, Skyworks offers diverse standard and custom linear products supporting automotive, broadband, cellular infrastructure, energy management, industrial, medical, military and mobile handset applications. The Company’s portfolio includes amplifiers, attenuators, detectors, diodes, directional couplers, front-end modules, hybrids, infrastructure RF subsystems, mixers/demodulators, phase shifters, PLLs/synthesizers/VCOs, power dividers/combiners, receivers, switches and technical ceramics. Working at Skyworks gives you a real opportunity to shape the company's future and the future of wireless.\n<br><br>\nSkyworks is proud to be an equal opportunity employer supporting diversity in the workplace."}