{"job title": "Senior Data Scientist, Research", "company": "Slack", "city state": "– San Francisco, CA", "rating": "4.7", "job description": "Slack's mission is to make people's work lives simpler, more pleasant, and more productive. We do this by incorporating customer insights from Slack Research into all stages of product development, growth strategy, sales and customer success programs.\n<br><br>\nSlack Research is looking for an experienced data scientist, quantitative researcher, or social scientist with a quantitative background, to join the small but growing Quantitative Research team. This person will be based full-time in San Francisco. Some companies call this role a quantitative researcher, and some call it a data scientist. At Slack, this role lives within the Research team, and all that matters is that you're passionate about leading projects to generate foundational insights that are rigorous, reliable, and have long shelf-life. Your work will be shared throughout the companyincluding product, design, sales, marketing, and leadership.\n<br><br>\nSlack has a positive, diverse, and supportive cultureif this sounds like a good fit for you, send us a nice hello.\n<br><br>\n<strong>What you will be doing</strong>\n<br><br>\nThe Quantitative Research team strives to answer foundational questions that include: What motivates customer behavior? What drives customer love? How do these impact our business?\n\n<ul>\n<li>We measure customer sentiment, model relationships between user behavior and sentiment, and estimate the impact these have on Slack's business.</li>\n<li>We use whatever analytic strategy, study design, or methods of data collection necessary to generate reliable, comprehensive, and deep insights.</li>\n<li>Typical studies include, but are not limited to, a combination of experimental design, statistics/modeling (e.g., surveys, behaviors, time series), and NLP.</li>\n</ul>\n<strong>What you should have</strong>\n<br><br>\nYou have expertise in all aspects of quantitative researchmore specifically, a hybrid of data science as well as quantitative social science.\n\n<ul>\n<li>You have 4+* years of relevant industry experience.</li>\n<li>You have an extensive background in a quantitative or technical field, especially data science or social science.</li>\n<li>You have experience with statistical analysis software like Python, R, Stata, or SPSS as well as some proficiency in SQL.</li>\n<li>You have completed graduate-level coursework in statistics-related fields (e.g., survey statistics, econometrics, NLP), experimental design, or quantitative social sciences (e.g., economics, behavioral economics, sociology, social psychology, organizational behavior or management science).</li>\n<li>You've demonstrated experience collecting and analyzing diverse datasets (e.g., large and small, structured and unstructured, behavioral and self-reported).</li>\n<li>Your interpersonal skills are exceptionalyou have experience leading projects involving cross-functional teams. This role requires fostering relationships across areas of the business that include Analytics, Business Strategy, Data Engineering, Product, Sales, Growth, and Marketing.</li>\n<li>You're passionate about setting new standards for quantitative research methods as well as crafting and executing on impact-driven research.</li>\n<li>You have excellent written and verbal communication skills. You excel at telling stories with data, rather than just reporting on trends and stats.</li>\n</ul>\n* Through trial and error we've learned that people don't apply unless we provide a guideline. But what's more important to us than a number are the experiences you've had, and the skills you've developed, regardless of the length of time it took you to get where you are. Have 20+ years? Awesome, please apply. Have only 2 years, but feel you meet the requirements above? Great, please apply."}