{"job title": "Data Scientist, Analytics", "company": "Slack", "city state": "– New York, NY", "rating": "4.7", "job description": "Slack is looking for experienced analysts to join our Analytics team and help drive the understanding, growth, and success of Slack. You should have deep technical skills and be comfortable working in an evolving data infrastructure to help us make data informed decisions. You will be scrappy, independent, and excited about having a big impact in a growing team.\n<br><br>\nYou will partner closely with Sales, Marketing, and Product to provide visibility into our data, craft narratives, find insights, and provide recommendations. Analytics works closely with a group of cross functional teams, such as Data Engineering &amp; IT, to transform massive amounts of data into data products and insights that allow the rest of the company to make better decisions, faster.<br><br><strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Use data to inform and influence the direction of team roadmaps and inform business decisions</li>\n<li>Work with partner teams to define goals and identify metrics for improving existing features and new releases</li>\n<li>Deepen our understanding of patterns/trends in user behavior, design experiments, and uncover new opportunities</li>\n<li>Build dashboards and reports to drive awareness and understanding of metrics and experiment results</li>\n<li>Work closely with Data Engineering and IT to author and develop core data sets that empower operational and exploratory analyses</li>\n</ul>\n\n<strong>Requirements:\n<br><br>\n</strong>\n\n\n<ul>\n<li>2 or more years of professional industry experience doing quantitative analysis</li>\n<li>A proven track record of using analysis to impact key business or product decisions</li>\n<li>The ability to clearly and effectively communicate the results of complex analyses</li>\n<li>Experience writing production datasets in SQL/Hive OR building internal/production data tools for ETL, experimentation, or exploration in a scripting language (Python, R, etc.)</li>\n<li>A solid grasp of basic statistical applications and methods (experimentation, probabilities, regression)</li>\n<li>Experience in software engineering, data engineering, consulting, or academic research a plus</li>\n</ul>"}