{"job title": "Sr. Manager, Data Science", "company": "Smith Hanley Associates", "city state": "– New York, NY", "rating": "4.5", "job description": "Contact: Rachel Pereira\n<br>\nrpereira@smithhanley.com\n<br>\n<strong>#GD</strong>\n<br><br>\nTitle: Sr. Manager, Data Science\n<br><br>\nThe ideal candidate will be a strong Project Manager with modeling experience and expertise in test design\n<br><br>\nOur client seeking to add a Sr. Manager, Data Science professional to their team. This person will have solid project management, programming, data management and statistical skills. In this role, you will lead data integration and analytic projects that will drive product personalization, marketing effectiveness, channel optimization, better customer experience, and operation efficiency.\n<br><br>\nSr. Manager, Data Science Duties and Responsibilities:\n<br><br>\nLead the marketing recommendation engine project across the company\n<br>\nResponsible for the management of KPI's and overall governance of specific data projects\n<br>\nResponsible for data business requirements including determining scope of work, prioritization and establishing consistency across data\n<br>\nProactively lead the evaluation process of new data sources.\n<br>\nPartner with key lines of business on data driven analyses, models and insights\n<br><br>\n<strong>Sr. Manager, Data Science Qualifications:</strong>\n<br><br>\nMaster's degree in computer science, statistics, or a related field\n<br>\nAt least 3-5 years of relevant experience.\n<br>\nKnowledge of machine learning and statistical modeling methods such as regression analysis, clustering, outlier detection, decision trees, collaborative filtering, nearest neighbors and ensemble methods.\n<br><br>\nSr. Manager, Data Science Required Technical Skills:\n<br><br>\nProgramming skills in R/Python.\n<br>\nStrong knowledge of databases and related languages/tools such as Teradata SQL.\n<br>\nExtensive experience cleaning data.\n<br>\nExpertise in MS-Office Suite (Word, Excel, PowerPoint, Access).\n<br>\n<strong>.</strong>"}