{"job title": "Data Scientist", "company": "Snap Inc.", "city state": "– Los Angeles, CA", "rating": "2.7", "job description": "Snap Inc. is a camera company. We believe that reinventing the camera represents our greatest opportunity to improve the way people live and communicate. Our products empower people to express themselves, live in the moment, learn about the world, and have fun together.\n<br><br>\nSnapchat is the camera used by millions of people every day to Snap with family, watch Stories from friends, see events from around the world, and explore expertly curated content from top publishers. In short, we are a passionate team working hard to build the best platform in the world for communication and storytelling.\n<br><br>\nWe're looking for a Data Scientist to join Team Snapchat! Working closely alongside engineering, product design and product management, you will enjoy creating inventive, data-based approaches to solving difficult business problems. Working from our Los Angeles, CA headquarters, you'll work with the Camera Platform team to transform business questions into data analysis and help to keep Snap at the forefront of AR.\n<br><br>\n<strong>What you'll do:</strong>\n\n<ul>\n<li>Partner with Product and Engineering and apply your expertise in quantitative analysis to create and scale insights</li>\n<li>Create and test hypotheses</li>\n<li>Create visuals and dashboards to effectively report your insights</li>\n<li>Help business and engineering partners make date-drive decisions</li>\n</ul>\n<strong>Minimum qualifications:</strong>\n\n<ul>\n<li>Bachelor's degree in math, statistics, computer science, or other quantitative field</li>\n<li>2+ years of experience in quantitative analysis &amp; data science or a related field</li>\n<li>Fluency in SQL or other big data querying language</li>\n</ul>\n<strong>Preferred qualifications:</strong>\n\n<ul>\n<li>Master's degree in math, statistics, computer science, or other quantitative field</li>\n<li>Experience with causal inference techniques, experimental design and/or A/B testing</li>\n<li>Experience with analytical packages such as SciPy or R</li>\n<li>Experience with a programming language, such as Python</li>\n<li>Excellent verbal and written communication skills, with high attention to detail</li>\n<li>Experience in a product-focused role at a social media and/or mobile technology company</li>\n<li>A team player who can collaborate with engineers, product managers, and other cross-functional teams</li>\n<li>Ability to initiate and drive projects to completion with minimal guidance</li>\n<li>Ability to communicate the results of analyses in a clear and effective manner to a senior audience</li>\n<li>Passionate about Snapchat, Lens Studio, and immersive technology</li>\n</ul>\n<em>At Snap, we believe that having a team of diverse backgrounds and voices working together will enable us to create innovative products that improve the way people live and communicate. Snap is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. If you have a disability or special need that requires accommodation, please don't be shy and contact us at</em> <em>accommodations-ext@snap.com</em><em>.</em>"}