{"job title": "Senior Data Engineer", "company": "SoFi", "city state": "– Murray, UT, United States", "rating": "3.5", "job description": "We are seeking a Data Engineer to work in a fast-paced and fun environment in our Helena office.\n<br><br>\nIdeal candidates must be enthused about Data Warehouse development, dimensional modelling, data pipelines and ETL. They must be a quick learner and be self-starting. The role will require extensive hands-on experience with ETL, SQL, and Data Warehouse Design.\n<br><br>\nThe ideal candidate will have experience in all phases of the project development lifecycle, solid problem-solving and communication skills, and the ability to work quickly and accurately under pressure.\n<br><br>\nAt SoFi, you’ll become part of a new kind of finance company based around speed, transparency, and alignment with our members’ interests. Our goal is to be at the center of our members’ financial lives. We created student loan refinancing, addressing the biggest financial challenge of a new generation through a modern approach to lending and personal finance. We expanded into other types of loans, and then into insurance and wealth management with similarly inventive products and soon to be launched SoFi money a modern take on a checking or savings account. As the company has grown, we’ve been able to help more people with these tools. SoFi has achieved significant growth, with ambitious plans ahead, but to continue this growth we need great talent.\n<br><br>\n<strong>Desired Skills</strong>\n<ul>\n<li>ETL, SQL, Dimensional Modelling, pl/pgsql</li> \n</ul>\n<strong>Key responsibilities include</strong>\n<ul>\n<li>Partner with BI Analysts, Data Scientists and other business stakeholders to meet their data requirements</li> <li>Enable the business to drive efficiencies and improvements through data driven decisions</li> <li>Develop new dimensional data models where highly complex data relationships and data flows exist</li> <li>Architect and maintain data pipelines to simplify end user reporting and analytics</li> <li>Maintain the security, data integrity, and availability of data in the Data Warehouse</li> <li>Strategically design highly automated processes and data flows</li> <li>Execute System, Integration and User Acceptance Testing</li> <li>Mentor and provide technical leadership to junior members of the team</li> <li>Troubleshoot data inconsistency issues</li> <li>Identify inefficiencies, optimize processes and data flows and make recommendations for improvements</li> <li>Help business users understand and utilize the Data Warehouse</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n<li>Bachelor's degree (or equivalent work experience) and 5+ year of ETL related experience</li> <li>Advanced experience designing dimensional data models</li> <li>Skilled in creating and maintaining ETL processes and architecting complex data pipelines</li> <li>Extensive knowledge of data warehouse principles, design and concepts</li> <li>Expert in SQL</li> <li>Adept in tracing and resolving data integrity issues</li> <li>Self-motivated</li> <li>Ability to bring new ideas and promote process improvement</li> <li>Excellent Communication Skills</li> \n</ul>\n<strong>Plusses</strong>\n<ul>\n<li>Knowledge of Python</li> <li>Knowledge of DW platforms such as Redshift / Snowflake</li> <li>Experience with Kafka or other data streams</li> <li>Experience with PL/SQL or pl/pgsql</li> <li>Knowledge and experience in AWS or other cloud data environments</li> <li>Experience using an ETL tool</li> <li>Experience with Business Intelligence Tools such as Tableau</li> <li>Experience with Micro-service and/or distributed architectures</li> <li>Personal Attributes of the Ideal Candidate Include</li> <li>Ability to thrive in a fast-paced growing company</li> <li>Ability to drive a project from inception to completion</li> <li>Enthusiasm for solving challenging problems</li> <li>Team attitude: a willingness to roll up your sleeves, work with others and get stuff done</li> \n</ul>\n\n#LI-RR1<br><br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}