{"job title": "Data Scientist", "company": "Softheon", "city state": "– Stony Brook, NY", "rating": "4.0", "job description": "The Data Scientist is responsible for analyzing large amounts of raw information to find patterns that will help improve our company. We will rely on you to build data products to extract valuable business insights.\n<br><br>\n<strong>Key Responsibilities (include but not limited to):</strong>\n<br><br>\nThe Data Scientist should be highly analytical with a knack for analysis, math and statistics. Critical thinking and problem-solving skills are essential for interpreting data.\n<ul>\n <li>Collaborate with product management and engineering departments to Investigate, analyze, and automate solutions to resolve data patterns and trends</li>  <li>Identify relevant data sources and sets to mine for client business needs, and collect large structured and unstructured datasets and variables</li>  <li>Gather and document business requirements using interviews, document analysis, requirements workshops, surveys, site visits, business process descriptions, use cases, scenarios, business analysis, task and work flow analysis</li>  <li>Critically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a high understanding, and distinguish user requests from the underlying true needs.</li>  <li>Define project scope, deliverables, timelines and resources that support business goals in collaboration with senior management and stakeholders.</li>  <li>Keep up-to-date with latest technology trends</li> \n</ul>\n<strong>Requirements</strong>\n<br><br>\n<strong>Qualifications</strong>\n<ul>\n <li>Bachelor’s degree in Computer Science, Applied Mathematics or related area with GPA of 3.5 or higher</li>  <li>0-1 years’ work experience or related internship experience preferred</li>  <li>Basic knowledge of SQL and Visio preferred</li>  <li>Advanced knowledge of mS Office: specifically, Excel and MS Word</li>  <li>Excellent interpersonal skills with ability to communicate effectively across all levels within the organization and external customers</li>  <li>High attention to detail and accuracy</li>  <li>Ability to effectively communicate in written and verbal communication while managing simultaneous projects</li>  <li>Must have a strong work ethic and commitment to constantly improving capacity to work effectively while having a willingness to learn new things</li>  <li>Ability to work in a fast paced, team oriented, agile environment</li>  <li>Ideal candidate will have strong organizational, time management skills and is self-motivated</li> \n</ul>\n<strong>When you join Softheon, you will:</strong>\n<ul>\n <li>Have an opportunity to be part of a great team of professionals;</li> <li>Learn and work in an environment surrounded by our Softheonites right here at the Center of Excellence in Wireless Info &amp; Technology (CEWIT) building at Stony Brook University, NY. CEWIT is an unparalleled resource, advancing the science and technology underlying the next epoch of the information revolution (www.cewit.org)</li> <li>Receive competitive salary and career growth opportunities that includes health care, dental, vision, life insurance, flexible spending, 401k and tuition reimbursement benefits package.</li>\n</ul>\n<strong>ABOUT US:</strong>\n<br><br>\nAt Softheon we strive to create simple solutions to complex problems. Our innovative and easy-to-use products have revolutionized the way everyday people control their healthcare needs. Empowering the nation's first state health benefit exchange since 2008, Softheon's vision and strategic direction has designed five platforms to help our partners quickly adapt to industry standards, manage client data, and grow their membership, while never compromising the exceptional care they provide. In this highly dynamic industry, Softheon has maintained its position as a premier Business Process as a Service (BPaaS) and Software as a Service (SaaS) solution, utilized by 37% of healthcare payers and having been responsible for 12% of ACA enrollments processed. Our platform has been ranked #1 in addressing the industry’s ever-changing regulatory demands and recognized by Gartner, IDC, AHIP, ACAP, and HCEG.\n<br><br>\nTo find out more about Softheon please visit www.softheon.com.\n<br><br>\nTo all recruitment agencies: Softheon does not accept agency resumes. Please do not forward resumes to Softheon employees or any other company location. Softheon is not responsible for any fees related to unsolicited resumes and will not pay fees to any third-party agency or company that does not have a signed agreement with the Company."}