{"job title": "Data Scientist", "company": "Softsol", "city state": "– Fremont, CA", "rating": "2.6", "job description": "Data Scientist<br><br>SoftSol delivers products and solutions that empower organizations toward greater efficiency, innovation, compliance, and cost savings. Since1993, SoftSol has been a driver in the evolution of IT through Web and SOA to collaboration and cloud, maintaining a debt-free operation while assisting organizations like the United States Department of Defense, Genentech, CalPERs, Cisco, the Superior Court of California, and HBO.\n<br><br>\nSoftSol is CMMi Level 3, IS0 9001 and ISO 27001. We are also a Microsoft Gold Certified Partner and Oracle partner, as well as a member of the Oracle Modernization Alliance and Mainframe Migration Alliance.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nThe Data Scientist will be a member of a team collaborating on the design and implementation of Big Data solutions. This role will work with the engineering and business teams to extract meaningful information from a wide variety of data collected from clients and online services. It will also be necessary to create algorithms and heuristics to extract information from large data sets, implement the algorithms in software, and architect necessary systems.\n<br><br>\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Prior experience in a data scientist or software engineer role is a plus</li>\n<li>Expertise in big data technologies is desirable</li>\n<li>Ability to clearly communicate analysis output</li>\n<li>Excellent programming skills</li>\n<li>Strong analytical capabilityM.S. in Computer Science, Mathematics, or equivalent degree desired</li>\n</ul>\nWith excellent career growth opportunities, we foster an environment based on open employee communications, diversity, trust, and corporate responsibility. SoftSol offers a competitive compensation and benefits package, which for full-time employees includes: medical, dental, vision, paid time off, 401K, and much more.\n<br><br>\nIf you’re interested in a growing company that values the insights of the individual, please send your resume to \n<br>\n<br>\nhr@softsol.net\n<br>\nThis email address is being protected from spambots. You need JavaScript enabled to view it.\n<br>\n<br>\n. EOE"}