{"job title": "Senior Data Scientist / Technical Lead", "company": "Soft Tech Consulting, Inc.", "city state": "– Washington, District of Columbia", "rating": "4.2", "job description": "Soft Tech Consulting is seeking a highly motivated, self-directed individual to fill the role of Sr. Data Analyst Team Lead, overseeing design and development activities for an existing government client. The place of performance for this contract is in Washington, DC. Lead a collaborative team of 10 members, using agile process, providing leadership necessary toward the successful delivery of the project deliverables and provide effective communication to all levels of staff.\n<br><br>\nResponsibilities\n<ul>\n<li>Build out a model to support the statistics, data mining, and machine learning of structured, semi-structured, and unstructured data to explore and extract insights to risk and fraud and advance executive reporting.</li><li>Develop algorithms and to apply mathematics to data, perform large scale experimentation and build data driven dashboards / reports to translate data into intelligence, solve a variety of business problems and enable business strategy.</li><li>Support data management tasks such as merging, cleansing, and identifying relationships in data.</li><li>Analyze large, complex datasets to generate actionable insights and help clients to solve difficult problems.</li><li>Lead a team of software engineers, visualization designers, data engineers, and data scientists to create a re-usable ecosystem to support efforts above.</li>\n</ul>\nQualifications\n<ul>\n<li>5 years of experience <strong>managing</strong> data scientists, data mining, and data analytics teams.</li><li>Demonstrate the understanding of statistical inference and model comparisons, and in feature extraction.</li><li>Expertise in relational database structures, research methods, and statistical models.</li><li>Ability to lead a data science Agile team to build out a platform to show tangible results.</li><li>Experience with scripting or programming languages (i.e. Scala, Perl, Python, Java C/C++).</li><li>Experience with statistical packages (i.e. SPSSS, SAS, R, Matlab).</li><li>Experience with the AWS ecosystem is a plus.</li><li>Experience with Big Data technology stack is a plus (i.e. Hadoop, Elastic Search, Mahout, etc.).</li><li>Experience with deep learning libraries a plus (i.e. Caret, Stan, PyMC, Tensorflow, etc.).</li><li>Possess a Masters or PhD in Computer Science, Statistics, or any other related field.</li><li>Data visualization and presentation skills a plus.</li>\n</ul>\nAbout Us\n<br><br>\nSoft Tech Consulting, Inc. is a woman and minority-owned small business headquartered in Chantilly, VA. With contracts in both the public and private sectors in the DC metro area and across the country, Soft Tech is an organization made up of highly successful and talented Information Technology professionals offering enterprise class solutions for any size organization at great value. Soft Techs mission is to help government organizations design, implement, and maintain mission critical Information Technology solutions. By focusing jointly on our employees and our customers, we are able to achieve our mission by providing each and every one of our customers with continuous quality customer support. Soft Tech Consulting, Inc. is an Equal Opportunity Employer.\n<br><br>\nJob Type: Full-time\n<br><br>\nExperience:\n<ul>\n<li>statistical packages i.e. SPSSS, SAS, R, Matlab): 1 year (Preferred)</li><li>Big Data technology stack is a plus (i.e. Hadoop): 1 year (Preferred)</li><li>managing data scientists, data mining/analytics teams: 5 years (Preferred)</li><li>relational database structures, research methods: 1 year (Preferred)</li><li>leading a data science Agile teams: 1 year (Preferred)</li><li>deep learning libraries a plus (i.e. Caret, Stan, PyMC): 1 year (Preferred)</li><li>programming languages (i.e. Scala, Perl, Python, Java C/C++): 1 year (Preferred)</li><li>Data visualization and presentation skills: 1 year (Preferred)</li><li>understanding of statistical inference and model comparisons: 1 year (Preferred)</li><li>AWS ecosystem: 1 year (Preferred)</li>\n</ul>\nEducation:\n<ul>\n<li>Master's (Required)</li>\n</ul>\nLicense:\n<ul>\n<li>Are you a US Citizen (Required)</li>\n</ul>"}