{"job title": "Data Science Engineer", "company": "Sojern", "city state": "– San Francisco, CA", "rating": "4.2", "job description": "Want to be part of a fantastic and fun startup that's revolutionizing the online travel advertising space? Want to join a data science team that's growing fast and making a big impact on the business? Come join us at Sojern!\n<br><br>\nOn the Deloitte Fast 500 for five years running, Sojern applies technology to the travel advertising space, delivering $10B in bookings for the thousands of hotel, airline, and cruise companies that make up our customer base.\n<br><br>\n<strong>The Team</strong>\n<br><br>\nIt is an exciting time to join the data science team at Sojern: business is booming, and the team plays a key role in Sojern's mission by automating, analyzing, modeling, and optimizing the way we target potential travelers with the most relevant and timely travel ads.\n<br><br>\nThe data science team collaborates with product to define projects, analyze data sets, and build solutions. Example projects include:\n\n<ul>\n\n\t<li>Delivering a better understanding of why a traveler books a hotel or flight, and utilizing those insights in production models which are used to improve ad relevance, timeliness, and performance for millions of ads per day</li>\n\n<li>Analyzing, visualizing, and improving our ML pipeline that pushes thousands of models into production each month</li>\n\n<li>Applying ideas from game theory to better understand the value of our audience targeting methods</li>\n\n<li>Optimizing automated campaign management which allocates budget for over 40 million display ad impressions daily for over a thousand customers and millions of ad spend per year</li>\n</ul>\nAs a part of engineering, we also drive our solutions to production including:\n\n<ul>\n\n\t<li>Creating data processing jobs using Google's big data infrastructure such as BigQuery</li>\n\n<li>Deploying our codebase to production with docker/containers on Google Cloud's Kubernetes platform</li>\n\n<li>Building and improving internal data science tools like our Jupyter server to scale our impact</li>\n</ul>\nWe're looking for data science engineers who can leverage their strong foundation to design and build out features for our next generation data products.\n<br><br>\n<strong>Day-to-day responsibilities include:</strong>\n\n<ul>\n\n\t<li>Collaborating with the team to discover new insights in our unique traveler profile data</li> \n\n<li>Adding new features to our automated campaign management systems and A/B testing platform</li>\n\n<li>Contributing to our production code base, driving additional efficiency and impacting Sojern's bottomline</li> \n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n\n\t\n<li>\n<strong>Python Proficiency</strong> -- It's our lingua franca, and we're big Jupyter fans</li>\n\n\n<li>\n<strong>MS or PhD in CS or STEM</strong> -- Shown ability to transform concepts into practical solutions</li>\n\n\n<li>\n<strong>Communication Ability</strong> -- Experience/comfort in presenting abstract concepts</li> \n\n\n<li>\n<strong>Experience as a Data Scientist</strong> -- Ideally1+ years of experience with data science/ML</li>\n</ul>\n<strong>Perks:</strong>\n\n<ul>\n\n\t\n<li><strong>Culture:</strong> Our team loves a good time</li>\n\n\n\n<li><strong>Snacks:</strong> Well-stocked kitchen to fill your breakfast, lunch, and snack needs</li>\n\n\n\n<li><strong>Opportunities:</strong> Be part of a growing team with training and support to help you grow</li>\n\n\n\n<li><strong>Give Back:</strong> We give 40 hours a year to volunteer and organize office volunteer programs with local organizations</li>\n\n\n\n<li><strong>Ownership:</strong> Lead creative and challenging projects</li>\n\n\n\n<li><strong>Meals:</strong> Monthly catered lunches &amp; happy hours</li>\n\n\n\n<li><strong>Wealth:</strong> Stock options</li>\n\n\n\n<li><strong>Time Off:</strong> Flexible vacation days</li>\n\n\n\n</ul>\n<em>At Sojern, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em>"}