{"job title": "Scientist, Product Development", "company": "SOLGAR VITAMIN", "city state": "– Ridgefield Park, NJ", "rating": "3.2", "job description": "<strong>Job Description</strong>\n<br><br>\n<strong>Company Description</strong>\n<br><br>\nFor more than 70 years, The Nature's Bounty Co. has enriched the lives of consumers around the world and stood as the leader in health and wellness by introducing innovative products and solutions to the marketplace. Putting science and the highest quality standards at the heart of our business, the brands of The Nature's Bounty Co. are some of the most trusted in the world. Always motivated by nature's bountiful effects on people's health, our vision for health and wellness has inspired leading brands such as Nature's Bounty®, Sundown Naturals®, Solgar®, Osteo Bi-Flex®, Ester-C®, MET-Rx®, Pure Protein®, Balance®, Body Fortress®, Puritan's Pride® and Organic Dr.®, among others. As a leading global manufacturer, marketer, distributor and retailer of vitamins, nutritional supplements, sports &amp; active nutrition and ethical beauty products, The Nature's Bounty Co. is committed to supporting wellness in all its forms.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nThe Product Development Scientist manages and participates in technical projects and activities for The Nature's Bounty Co.'s Natural &amp; Organic product innovation, including the design, development, and technology transfer of new formulas, processes, products, and line extensions. Additionally, this position contributes to the successful execution of new product development activities inclusive of Front End of Innovation (FEI), Stage Gate and core Product Development activities and exploits enabling technology and delivery form platforms to support growth of current and future brands and platforms.\n<br><br>\nAdditional responsibilities include, but are not limited to:\n\n\n<ul>\n<li>Plan, manage and complete technical projects and activities necessary to design, develop and optimize new and improved formulations/products/delivery systems for N&amp;O products that meet customer needs.</li>\n<li>Serve as the technical lead for all N&amp;O projects where solid dose, including capsules, tablets, softgels, and chewables, is the primary delivery form.</li>\n<li>Creatively links formulation and/or product science and technology opportunities to the needs of the business through development and transfer of new products from Idea to Commercialization, transfers technologies from bench/pilot to manufacturing scale and successfully implements proprietary and differentiated technical solutions</li>\n<li>Conducts design and development activities where analysis of situations or data requires evaluation of variable factors. Contributes to the development of new principles or concepts that lead to capability and competency enhancements and/or higher impact/value opportunities.</li>\n<li>Applies fundamental understanding of research principles and the scientific method, and acts as a role model in fostering a test-and-learn environment that improves R&amp;D influence and effectiveness.</li>\n<li>Manages the identification, assessment and development of enabling technology/delivery form platforms to enable meaningfully unique confectionary delivery of current and future ingredients/bioactives.</li>\n<li>Collect, analyze, interpret, draw conclusions and make recommendations from data to enable technical execution of projects. Modify methodologies to improve the quality, accuracy and usefulness of data. Provide technical recommendations to R&amp;D, Project and Brand teams through clear and concise oral and written communications. Participate in writing protocols and manufacturing documents for feasibility, development and commercial activities.</li>\n<li>Partners closely with technical staff as needed at internal and external contract research, development and manufacturing sites to successfully advance projects.</li>\n<li>Designs, conducts and documents stability testing protocols to recommend and support product dating.</li>\n<li>Contributes to the development and review of intellectual property strategy and conducts patent searches, literature reviews and is current with cross industry technology insights. Understands application and benefits/costs to our product portfolio. Ensures competitive advantage through implementation of proprietary and differentiated technical solutions.</li>\n<li>Lead technical activities to assist advancement of multiple projects concurrently through the Stage Gate product development process.</li>\n<li>Support, coordinate and conduct bench, pilot and production scale trials at internal and external development and manufacturing sites.</li>\n<li>Participates in exploratory and scouting activities to generate new product ideas with differentiated technology. Identifies, evaluates and selects new ingredients, delivery forms, processes and technologies to guide product development initiatives.</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>3+ years of industrial experience in the dietary supplement, consumer healthcare and/or value-added consumer packaged goods industry with continually increasing scope of responsibilities</li>\n<li>BS, MS, PhD in Chemistry, Chemical Engineering, Pharmaceutical Science or equivalent</li>\n<li>Training or certifications in Project Management, Design of Experiments or equivalent is desired</li>\n<li>Breadth of technical knowledge and experience in application in functional food/nutritionals/dietary supplement formulation, product, process and platform development and delivery systems.</li>\n<li>Demonstrated proficiency in NPD/Stage Gate process from Idea through Commercialization</li>\n<li>Demonstrated expertise in partnering with external suppliers and contract developers and manufacturers.</li>\n<li>Working knowledge and experience in design thinking, design of experiments and relevant statistical tools in product development.</li>\n<li>Understanding of Good Manufacturing Practices and working knowledge of form-specific regulatory requirements (DSHEA, FDA) and certifications (non-GMO, Kosher, Halal, DSVP, etc.).</li>\n<li>Specific experience in solid dose (capsule, tablet, chewables, softgels) formulation and process technology is required. Softgel expertise is preferred. Liquid and/or Powder expertise is desired.</li>\n<li>Strong formulation expertise and understanding of ingredient/raw material physical and chemical interactions.</li>\n<li>Excellent time and project management skills with proven ability to manage</li>\n</ul>\n\n<strong>Additional Information</strong>\n<br><br>\nThe Nature's Bounty Co. is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n<br><br>\nThe Nature's Bounty Co. offers a competitive salary and a comprehensive benefits package, which includes health and dental plans, voluntary short-term and long-term disability, life insurance, flexible spending accounts, 401(k), tuition reimbursement, generous associate discounts and more!\n<br><br>\nPlease contact Human Resources at 631-244-2120 if you should need a reasonable accommodation to submit your information for our on-line job postings."}