{"job title": "Data Analyst", "company": "Sonepar USA", "city state": "– Philadelphia, PA", "rating": "4.2", "job description": "<strong>Data Analyst</strong>\n<br><br>\nSonepar USA is an independent family-owned company with global market leadership in B2B distribution of electrical products and related services. We are a member of the Sonepar Group, the world's largest privately-held electrical distributor. In the USA, we are represented by 16 locally managed electrical and industrial distributors with over 700 locations and coverage in all 50 states.\n<br><br>\n<strong>Position Summary</strong>:\n<br><br>\nSupport of the Corporate Finance and Treasury teams at Sonepar USA. The Data Analyst will report to the Director, Data Management &amp; Analytics and provide ad-hoc and recurring monthly data analysis services, budgeting and forecasting support and general support to the finance, treasury and accounting teams with month-end/year-end closing activities. The Data Analyst will also work very closely with the Business Intelligence (BI) development and delivery teams to support all aspects of financial reporting across the enterprise.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Provide month-end/year-end financial reporting and data analysis support to the Finance, Accounting and Treasury teams</li>\n\n<li>Budgeting and Forecasting support</li>\n\n<li>Ad-hoc reporting/data mining &amp; analysis in the following areas;</li>\n\n\n<ul>\n<li>Vendor/Category Management</li>\n\n<li>Indirect Spend</li>\n\n<li>Customer/Product Segmentation</li>\n</ul>\n\n<li>Dashboard creation and data analysis support for the Corporate finance, treasury and accounting teams</li>\n\n<li>Drive alignment in all reporting and data analysis activities with corporate standards as established by the Data Management and Analytics team</li>\n</ul>\n<strong>Qualifications</strong><strong>:</strong>\n\n<ul>\n<li>1-2 years previous experience</li>\n\n<li>Bachelor’s degree or equivalent work experience with quantitative major such as finance, math, applied math, engineering or data science</li>\n\n<li>Must be proficient in MS Office Suite: Excel, Word and PowerPoint. Access is a plus</li>\n\n<li>Organize and present data effectively based on the audience/consumers</li>\n\n<li>Experience with Cognos, Tableau, or similar data visualization tools is a plus</li>\n\n<li>Consistent track record in using quantitative analysis to drive market and/or business decisions</li>\n\n<li>Strong communication skills and presentation skills</li>\n\n<li>Must be comfortable meeting with, presenting to, and supporting all levels of staff</li>\n\n<li>Experience supporting sales or operations functions is a plus</li>\n\n<li>Experience manipulating data warehouses as a resource for analytical work and Excel Reporting is a plus</li>\n</ul>\n<strong>**We will not be accepting applicants on a Visa nor in need of sponsorship for this position**</strong>\n<br><br>\n<strong>Benefits:</strong>\n<br><br>\n401K Plan, Health Insurance (medical, dental, and vision), Paid Vacation, Paid Sick, Paid Personal, Paid Holidays, Flexible Spending Accounts (Health, Transit, and Dependent Care), Employee Assistance Program, Employee Discounts and more.\n<br><br>\n<strong>Sonepar USA is an equal opportunity employer. M/F/Disability/Veteran</strong>\n<br><br>\nBusiness Unit: Sonepar<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nPhiladelphia, PA,\n<br>"}