{"job title": "Machine Learning Engineer", "company": "Soroco", "city state": "– Boston, MA", "rating": "3.7", "job description": "<div><strong>The Company</strong>\n<br><br>\nWe are a young, fast-growing, fully-funded technology company. Our team includes PhDs and graduates from top computer science programs across the country. Before joining Soroco, members of our team worked at Microsoft Research, McKinsey, Sequoia Capital, Goldman Sachs, Citrix, Samsung Research, IBM Research, and more. Collectively, we have published more than 100 papers in journals and conferences, and have been granted over 20 patents. We have flagship offices across three geographies Boston, London, and Bangalore.\n<br><br>\nWe develop intelligent automation systems that augment and repurpose human labor across the modern business enterprise. Soroco is pioneering Trustworthy Automation with patent-pending automation technology designed to automate at unprecedented scale. Each system is capable of assuming the combined roles of 50-100+ Full Time Employees (FTEs) performing 1000s of complex business rules, thereby creating additional capacity in a business unit. Today, we work with Fortune 500 clients where we have successfully automated large volumes of complex manual effort.</div> <div><strong>The Role</strong>\n<br><br>\nWe are looking for a machine learning expert who will work with other scientists and senior leaders of the company to develop intelligent automation solutions. S/he will fuel the growth of the companys US operations by developing computer vision and NLP products that can be applied to a wide range of automation tasks.\n<br><br>\n<strong>Responsibilities (and skills) include (but are not limited to):</strong>\n\n<ul>\n<li>Analyze client data and estimate the efficacy of machine learning algorithms for information extraction</li>\n<li>Propose intelligent algorithms to improve state of the art results on visual detection and recognition</li>\n<li>Contribute to full stack development of machine learning algorithms from design to product implementation</li> \n\n<li>Mentor younger engineers to develop automation applications based on the proposed learning algorithms</li>\n<li>Project managing timelines, deadlines, feature sets, and release</li>\n</ul>\n\n</div>\n<br>\n<div><strong>The Candidate</strong>\n<br><br>\nThe ideal candidate will have approximately 2-4 years of experience in machine learning with an appetite for research, be detail oriented in nature, be able to communicate with a team, and have a deep commitment to improving performance of the proposed machine learning algorithms.\n<br><br>\n<strong>Expected skills:</strong>\n\n<ul>\n<li>Bachelors degree in computer science, information science or other related quantitative field.</li>\n<li>Expertise in Bayesian statistics and machine learning</li>\n<li>Expertise in deep learning for visual recognition, detection and segmentation</li>\n<li>Experience with data modeling with generative and discriminative models</li>\n<li>Experience with graphical models, parameter learning and inference</li>\n<li>Experience in NLP including text embedding and sequence transduction</li>\n<li>Experience leading/mentoring engineers</li>\n<li>Experience writing code in Python, C++, Java, and/or Go</li>\n</ul>\n\n</div>\n<br>"}