{"job title": "Research Assoicate/Scientist (In Vivo Biology)", "company": "Sorrento Therapeutics", "city state": "– San Diego, CA", "rating": "2.6", "job description": "<strong>ABOUT US</strong>\n<br><br>\nSorrento Therapeutics Inc. is a fast growing, clinical stage, antibody-centric, biopharmaceutical company developing new therapies to turn malignant cancers into manageable and possibly curable diseases. Sorrento's multimodal, multipronged approach to fighting cancer is made possible by its extensive immuno-oncology platforms, including key assets such as fully human antibodies (G-MAB library), clinical stage immuno-cellular therapies (CAR-T), intracellular targeting antibodies (iTAbs), antibody-drug conjugates (ADC), and clinical stage oncolytic virus (Seprehvir®).\n<br><br>\nWe attract smart people who play well with others. We're small enough for your ideas to make a big impact, and large enough to offer you opportunities to grow professionally at any stage of your career.\n<br><br>\nIf you're a quick learner, enjoy working in the biotech industry, and share our mission of providing ground-breaking impact to medicine, each other, and our patients, Sorrento Therapeutics is the place for you!\n<br><br>\n<strong>WHAT WE ARE LOOKING FOR:</strong>\n<br><br>\nSorrento Therapeutics is seeking an experienced Research Associate/Scientist (In Vivo Biology).\n<br><br>\n<strong>WHAT YOU'LL DO:</strong>\n<br><br>\nThis position will perform preclinical in vivo studies in research and development in collaboration with others for ADC projects. Conducts and designs in vivo studies, makes detailed observations, analyzes data and interprets results. Investigates, creates and develops new in vivo tumor animal models, assays and technologies for project advancement. Maintains high level of professional expertise through familiarity with scientific literature. Participates in scientific presentation and meetings. May act as principal investigator in conducting own experiments.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES:</strong>\n\n\n<ul>\n<li>Design, plan and execute in vivo studies including xenograft human tumor models, syngenic mouse tumor models and PK/ toxicity studies in rodents.</li>\n<li>Proficiency with in vivo techniques, such as animal handling, po, sc, iv, ip. Injections, tumor volume measurements, necropsy, collection of blood and tissue from small animals of laboratory, collect and record data is the essential requirement. Expertise with murine intravenous injection with tumor cells is a plus.</li>\n<li>Perform routine cell culture and maintain tumor cell lines used for in vivo efficacy studies with xenograft tumor models.</li>\n<li>Establish and develop new animal models as needed, including pilot studies for model development and troubleshooting.</li>\n<li>Analyze data using software including Excel and GraphPad Prism; prepare and present data to various groups within the organization.</li>\n<li>Experience or proficiency in performing IVIS and other image system like PET-Scan is a plus.</li>\n<li>Experience or proficiency in performing histology and IHC is a plus.</li>\n<li>Sample processing, homogenization, or generation of single-cell suspensions for ex vivo analysis. Experience performing immunology-related biological assays, flow cytometry and analysis is a plus.</li>\n<li>Proficiency in Microsoft office and Graphpad Prism. Organizes data, prepares and maintains clear and precise documents according to company policies and FDA requirements.</li>\n<li>Write and develop Standard Operating Procedures (SOP's), and study report.</li>\n<li>Uses a wide variety of laboratory instruments, and computers. Handles blood samples, prepares animal tissue and cells, maintains cell lines.</li>\n<li>Maintains animal facilities, lab equipment and supplies, as needed.</li>\n<li>May supervise laboratory technicians, media technicians or assistants.</li>\n</ul>\n\n<strong>EDUCATION AND QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Bachelor's degree (B.S) / Master's degree (M.S) with over 5 years' experience in the</li>\n</ul>\n\nbiotechnology or pharmaceutical industry. Or Doctorate's degree (Ph.D) in a science\n<br><br>\ndiscipline e.g., Life Sciences, Chemistry, Biology, Oncology, immunology and 2-3 years\n<br><br>\nin related post doctorate experience.\n\n\n<ul>\n<li>Ability to work with mathematical concepts such as probability and statistical inference,</li>\n</ul>\n\nand fundamentals of plane and solid geometry and trigonometry. Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations.\n\n\n<ul>\n<li>Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.</li>\n</ul>\n\n<strong>YOUR REWARD:</strong>\n<br><br>\nSupport scientists who are on the leading edge of immunotherapies for the treatment of cancer.\n<br><br>\nEarn a competitive salary that allows you to focus your attention on your passion.\n<br><br>\nA comprehensive benefits package including: medical, dental, vision, life and disability insurance, matching 401k, 10 paid holidays, and three-weeks' PTO, plus stock options.\n<br><br>\nIf this sounds like the right career to fit your personality and interests, please apply, we're looking forward to meeting you!\n\n\n<ul>\n<li>Principals only. Recruiters, please don't contact this job poster.</li>\n<li>Sorrento Therapeutics, Inc. is an Equal Opportunity Employer</li>\n</ul>"}