{"job title": "Data Scientist", "company": "Southern California Edison", "city state": "– Irvine, CA", "rating": "3.4", "job description": "<strong>Job Description</strong>\n<br>\n<div><strong><u>ENERGY FOR WHATS AHEAD</u></strong></div>  <div>Are you looking to make a difference in your career? Were working on smarter grids, cleaner energy and tools to help people manage energy more efficiently.</div> <div></div> <div><strong>About Transmission and Distribution</strong></div> <div>Southern California Edisons (SCE's) Transmission and Distribution Organizational Unit (T &amp; D) is responsible for planning, engineering, constructing, operating, and maintaining transmission and distribution facilities throughout the 50,000-square-mile territory. T&amp;D is the steward of roughly $19 billion in assets that safely and reliably deliver electricity to 14 million residents via SCEs 5 million customer accounts.</div> <div><strong>Position Overview:</strong></div> <div>The selected <strong>Data Scientist</strong> will work in our Reliability Operations Center and will be responsible for enhanced troubleshooting and support for diagnostics and data gathering for distribution electrical events. The Data Scientist will help drive the T&amp;D organizations reliability performance through multiple efforts including the development and implementation of equipment pre-failure detection methods, identifying energized downed wire, single-phase fault conditions, and provide real-time support by utilizing advanced metering infrastructure (AMI) data along with other real-time tools.</div> <div>The Data Scientist position will be using and developing tools and techniques such as statistical algorithms, machine learning, visualization techniques, and data mining applied to electric system operations of which there is no industry precedence.</div> <div><strong>Typical Responsibilities:</strong></div>\n\n<ul>\n <li>Develop and operationalize enhanced methods to more accurately detect problems and locate faults using existing and new technology where there is no industry precedent. This requires advanced data science, statistics, and application development skills.</li> <li>Analyze the performance of the distribution system in real time, as well as post-event analysis using unconventional methods and applications. Using engineering judgment during high consequence events, provide operational personnel with information necessary to improve response, troubleshooting, and restoration times, while maintaining safety to workers and the public.</li> <li>Work with stakeholders to understand business problems, goals and objectives, translate them into data science use cases and appropriately prioritize. Work closely with operations, engineering and technology teams to develop solutions to data-intensive business problems.</li>  <li>Train end users on enhanced methods to accurately detect problem to ensure quicker diagnostics when issues occur at customer premise.</li> <li>Improve or establish methods to capture outage data and develop new operational techniques into requirements for future software systems</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\n<strong><div>Minimum Qualifications:</div>\n<br>\n</strong>\n\n<ul>\n <li>Bachelor Degree in a STEM discipline</li> <li>Seven years or more of work experience in data analytics</li> <li>Ability to work flexible hours to support operational needs.</li> \n</ul>\n\n<strong><div>Desired qualifications:</div>\n<br>\n</strong>\n\n<ul>\n <li>Graduate Degree in STEM field.</li> <li>Work experience in electric system engineering or power system control fields.</li> <li>Experience interpreting advanced analytical data and making recommendations based on their outcome.</li>  <li>Three years experience working with applications such as: Outage Management Systems (OMS), Energy Management System (EMS), Distribution Management System (DMS), Network Management System for AMI meters.</li> <li>Experience applying innovative solutions based on data mining analytics.</li> <li>Professional Engineering License.</li>\n</ul>\n\n<strong><div>Comments:</div>\n<br>\n</strong>\n\n<ul>\n <li>Relocation may apply to this position</li> <li>Candidates for this position must be legally authorized to work directly as employees for any employer in the United States without visa sponsorship.</li> <li>This position has been identified as a NERC/CIP impacted position - Prior to being hired, the successful candidate must pass a Personnel Risk Assessment (PRA) or Background Investigation. Once hired, the candidate must complete specified training prior to gaining un-escorted access to assigned work location and performing necessary job duties.</li>\n</ul>\n\n<div>Southern California Edison, an Edison International (NYSE:EIX) company, serves a population of approximately 15 million via 5 million customer accounts in a 50,000-square-mile service area within Central, Coastal and Southern California. Join the utility leader that is safely delivering reliable, affordable electricity to our customers for over 125 years.</div> <div>SCE is a proud Equal Opportunity Employer and will not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status or any other protected status.</div>"}