{"job title": "Data Scientist (Senior)", "company": "Southern Cross Engineering", "city state": "– Linthicum Heights, MD", "rating": "NA", "job description": "Data Scientist (Senior)\n<ul>\n<li>establish and implement end-to-end proof of concept for leading edge data mining and analytics systems</li><li>will be responsible for the creation of innovative methodologies for extracting key parameters from big data coming from various sensors</li><li>will utilize their expertise in machine learning, statistical data analytics, and predictive analytics to help implement analytics tied to cyber security and hunting methodologies and applications</li>\n</ul>\n<strong>*All Candidates must be a U.S. Citizen and have a TS/SCI clearance with a Full Scope Polygraph</strong>\n<br><br>\n<strong>REQUIRED EXPERIENCE</strong>\n<ul>\n<li>Shall have a Master’s degree in technical discipline (i.e. computer science, engineering mathematics, etc.); will consider candidates with a PhD and five (05) years of experience</li><li>Shall have six plus (06+) years of Data Scientist experience</li><li>Shall conduct data analysis and orchestration of a large volume of security data sources, threat indicators, and customer logs</li><li>Shall apply latest technologies in machine learning, data mining, and predictive analytics to correlate the big datasets and events, and derive dynamic cybersecurity rules</li><li>Shall generate highly accurate and near real-time security alerts based on the dynamic rules</li><li>Shall architect and work closely with other team members to develop a scalable cloud-based cybersecurity data analytics engine</li><li>Shall have experience with Applied Machine Learning experience (regression analysis, time series, probabilistic models, supervised classification and unsupervised learning)</li><li>Shall have a strong mathematical background (linear algebra, calculus, probability and statistics)</li><li>Shall have experience with JavaScript and prototyping languages such as Python and R</li><li>Shall be familiar with scalable distributed data processing, management, and visualization tools (e.g. Hadoop, ELK, Kafka, Accumulo, graph databases, etc.)</li><li>Shall be familiar with data mining and analytics methods (e.g., clustering, sequences, networks, time series, deep learning, statistical analytics, etc.)</li><li>Shall have knowledge of cyber security operations, cyber security data types, cyber security threats, network protocols (SOC tools and methodologies)</li>\n</ul>\n<strong>DESIRED EXPERIENCE</strong>\n<ul>\n<li>PhD in Computer Science, Electrical Engineering, Statistics, or equivalent fields is desired</li>\n</ul>\nSouthern Cross Engineering is an Equal Employment Opportunity Employer; all qualified applicants are encouraged to apply and will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or veteran status."}