{"job title": "Associate Data Scientist", "company": "Southwest Airlines Co.", "city state": "– Dallas, TX", "rating": "4.3", "job description": "We are committed to provide our Employees a stable work environment with equal opportunity for learning and personal growth. Creativity and innovation are encouraged for improving the effectiveness of Southwest Airlines. Above all, Employees will be provided the same concern, respect, and caring attitude within the organization that they are expected to share externally with every Southwest Customer.\n<br><br>\nAn Entry-level data scientist in Corporate Strategy serves as an internal consultant and is responsible for leading multiple, cross functional data science solutions to collect, organize, analyze, summarize, and interpret data; create knowledge; or develop predictive and prescriptive capabilities which drive actionable decisions and generate competitive advantage.\n<br><br>\n<strong>WORK ACTIVITIES/CONTEXT:</strong>\n<ul>\n<li>Works on moderately complex data science projects, collaborating with Colleagues to understand and define contextual problems quickly, and recommending solutions with assistance from peers</li><li>Uses statistical models and machine learning techniques to solve moderately complex business problems</li><li>Employs intermediate-level data mining techniques and knowledge of internal data sources to complete exploratory analyses</li><li>Supports the ongoing development of the Southwest Airlines data science center and community</li>\n</ul>\nFunctional Competencies\n<br><br>\nData Science Consulting\n<ul>\n<li>Learning how to use data to tell a story in a way the Customer will understand</li><li>Learning how to help Customers clearly articulate the exact nature of their problems in ways that assist in problem solving</li><li>Demonstrates efficiency in gathering, manipulating, and interpreting information to identify problems and opportunities</li>\n</ul>\nData Mining and Integration\n<ul>\n<li>With guidance, performs data extractions in preparation for data mining, integration or visualization exercises conducted by senior teammates</li><li>Translates Customer analytical needs to determine the appropriate data mining and integration approach</li><li>Applies math, statistics, and advanced modeling methods in order to create solutions which can be utilized in descriptive, diagnostic, predictive, and perscriptive analysis</li>\n</ul>\nStatistical Modeling\n<ul>\n<li>Demonstrates a fundamental understanding of descriptive, diagnostic, predictive and prescriptive statistical methods; how to use them and apply to Customer engagements</li><li>Utilizes statistical modeling methods and basic machine learning for projects</li><li>Presents information in the form of graphs, charts, and tables</li> \n</ul>\nMust be able to meet any physical ability requirements listed on this description.\n<br><br>\nMay perform other job duties as directed by Employee’s Leaders.\n<br><br>\n<strong>BASIC QUALIFICATIONS:</strong>\n<ul>\n<li>High School Diploma, GED or equivalent education required.</li><li>Must be at least 18 years of age.</li><li>Must have authorization to work in the United States for any employer, with no sponsorship needed now or in the future of an employment-based visa.</li> \n</ul>\n<strong>EDUCATION:</strong>\n<ul>\n<li>Bachelor’s degree in Finance, Economics, Engineering, Computer Science or other quantitative field required.</li><li>Master’s degree in Data Science, Operations Research, Financial Engineering, Business Analytics, Applied Mathematics, Business or other quantitative field required</li>\n</ul>\n<strong>WORK EXPERIENCE:</strong>\n<ul>\n<li>Minimum of 2 years of experience in applied data science, statistics, or analytics required; preferably in the transportation or travel industry</li><li>Previous data science or business analyst internship preferred</li> \n</ul>\n<strong>LICENSING/CERTIFICATION:</strong>\n<ul>\n<li>CAP certification a plus</li><li>Public examples of applied Data Science on GitHub, Kaggle, and/or crowdNALYTIX a plus</li>\n</ul>\n<strong>PHYSICAL ABILITIES:</strong>\n<ul>\n<li>Ability to perform work duties from desk/office work area for extended periods of time.</li> \n</ul>\n<strong>SKILLS/ABILITIES/KNOWLEDGE/WORK STYLE:</strong>\n<br><br>\nMust be able to comply with Company attendance standards as described in established guidelines.\n<ul>\n<li>Working competency in Microsoft office products (Excel, PowerPoint, Access)</li><li>1+ years of programming experience in R, Python, or Julia</li><li>2+ years of experience writing SQL queries from scratch</li><li>1+ years of experience in Tableau or other visualization platforms (i.e.-ggplot2, matplotlib, Seaborn, etc.)</li><li>Experience with noSQL databases is a plus</li>\n</ul>\nProfessional Competencies\n<br><br>\nCultivates Innovation\n<ul>\n<li>Leads enhancement efforts of current models participates in discussions on how to build new models</li><li>Partners with others using existing tools to test inputs and accuracy of existing models</li><li>Implements and maintains models for partners; participates in discussions about the benefits of new models</li>\n</ul>\nCommunicates Effectively\n<ul>\n<li>Expresses thoughts and facts in a clear and concise way</li><li>Recognizes information that is relevant to others and informs them in a timely manner and in an appropriate format</li><li>Fully responds to requests and questions</li>\n</ul>\nSelf-development\n<ul>\n<li>Shows personal commitment to 4increase knowledge and takes action to continually improve</li><li>Participates in assignments that broaden capabilities</li><li>Seeks out available team and company resources</li> \n</ul>\n<strong>OTHER QUALIFICATIONS:</strong>\n<ul>\n<li>Must be able to work under strict time constraints.</li><li>Must have flexibility to work extended hours during the week and weekend, if necessary, during special projects</li><li>Must meet confidentiality expectations as to confidential, proprietary, and sensitive Company information.</li> \n</ul>\nMust maintain a well-groomed appearance per Company appearance standards as described in established guidelines.\n<br><br>\n<strong><em>Southwest Airlines is an Equal Opportunity Employer</em></strong>"}