{"job title": "Data Scientist", "company": "Southern Cross Engineering", "city state": "– Linthicum Heights, MD", "rating": "NA", "job description": "Job Description<div>Data Scientist\n<br><br>\nSouthern Cross Engineering is looking for an experienced Data Scientist to join our team. The Data Scientist will establish and implement end-to-end proof of concept for leading edge data mining and analytics systems. They will be responsible for the creation of innovative methodologies for extracting key parameters from big data coming from various sensors. The data scientist will utilize their expertise in machine learning, statistical data analytics, and predictive analytics to help implement analytics tied to cyber security and hunting methodologies and applications.\n<br><br>\n<strong>*All Candidates must be clearable for a TS/SCI clearance with a Polygraph</strong>\n<br><br>\n<strong>REQUIRED EXPERIENCE</strong>\n<ul>\n<li>Must be a U.S. Citizen</li><li>B.S. degree in Computer Science, Electrical Engineering, Statistics, or equivalent elds</li><li>Must have 8+ years of Data Scientist experience</li><li>Conduct data analysis and orchestration of a large volume of security data sources, threat indicators, and customer logs.</li><li>Apply latest technologies in machine learning, data mining, and predictive analytics to correlate the big datasets and events, and derive dynamic cybersecurity rules.</li><li>Generate highly accurate and near real-time security alerts based on the dynamic rules.</li><li>Architect and work closely with other team members to develop a scalable cloud-based cybersecurity data analytics engine.</li><li>Applied Machine Learning experience (regression analysis, time series, probabilistic models, supervised classication and unsupervised learning).</li><li>Strong mathematical background (linear algebra, calculus, probability and statistics).</li><li>Experience with JavaScript and prototyping languages such as Python and R.</li><li>Familiar with scalable distributed data processing, management, and visualization tools (e.g. Hadoop, ELK, Kafka, Accumulo, graph databases, etc.). Familiar with data mining and analytics methods (e.g., clustering, sequences, networks, time series, deep learning, statistical analytics, etc.).</li><li>Knowledge of cyber security operations, cyber security data types, cyber security threats, network protocols (SOC tools and methodologies).</li>\n</ul>\n<strong>DESIRED EXPERIENCE</strong>\n<ul>\n<li>MS or PhD in Computer Science, Electrical Engineering, Statistics, or equivalent elds is highly desired.</li>\n</ul>\nSouthern Cross Engineering is an Equal Employment Opportunity Employer; all qualified applicants are encouraged to apply and will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or veteran status.</div>"}