{"job title": "Data Scientist", "company": "Specialists On Call", "city state": "– Reston, VA", "rating": "3.0", "job description": "<strong>At SOC Telemed (“SOC”), it is our mission to partner with healthcare organizations to bring clinicians and patients together using innovative technologies to improve clinical care and patient outcomes in a measurable way.</strong>\n<br><br>\nWe are the nation’s most experienced and trusted provider of telemedicine solutions to acute hospitals. We are proud to be the first private telemedicine company to earn The Joint Commission’s Gold Seal of Approval and we have maintained that accreditation every year since 2006.\n<br><br>\nTo achieve our mission, we need to get the word out into the healthcare market about what we uniquely offer. This <strong>Data Scientist</strong> will work independently and apply modern data analytics techniques and develop analytical models. You will be part of SOC’s growth as the analytical engine and provide actionable insights to senior management and functional leadership. You will support SOC’s business decision-making and make a lasting impact on customer experience and patient outcomes.\n<br><br>\n<strong>You thrive on teamwork in a fast paced, flexible, and dynamic environment.</strong> Everything you do demonstrates professionalism, reliability, resourcefulness, flexibility, and attention to detail, while always maintaining strict privacy of confidential data.\n<br><br>\n<strong>You are never bored: there is always another skill to master, another question to ask. Your intellectual curiosity is boundless.</strong>\n<br><br>\nThis highly visible and impactful role is based in Reston, VA, where you will closely work with cross functional teams and directly report to the VP of Analytics.\n<br><br>\n<strong>Our Vision as an organization is to transform healthcare: come be a part of it.</strong>\n<br><br>\n<strong>RESPONSIBILITIES:</strong>\n<ul>\n <li>Discover patterns and solve strategic business problems using both structured and unstructured data sets across many environments</li> <li>Develop predictive models that drive better outcomes for customers, patients and SOC operations</li> <li>Collaborate with business owners, gather requirement, determine the best fitting method of analysis, translate and articulate analytical results, make recommendations with common sense approach to a non-technical business audience including executive management, internal staffs and external customers</li> <li>Train and mentor team members as needed</li> <li>Demonstrated ability and experience of analytical techniques and methodologies including supervised and unsupervised learning, regression modelling, data mining, and predictive modelling</li> <li>Demonstrated ability in advanced optimization techniques in the context of supply optimization</li> <li>Desired skills include programming in multiple languages (i.e. SQL, R, Python), working with large data sets, data collection, data normalization, and data visualization.</li> <li>Ability to demonstrate professionalism, reliability, resourcefulness, flexibility, and attention to detail, and to maintain strict privacy of confidential data</li> <li>Successful track record of thriving in a fast paced, flexible, and dynamic environment</li> <li>Ability to manage multiple, concurrent projects of varying size and scope and core team activities in a fast paced environment. Ability to set reasonable timeline to meet objectives and prioritize conflicting deadlines</li> <li>Energetic and enthusiastic self-starter comfortable taking the initiative to develop new levels of analytics</li> <li>Ability to build consensus, collaborate and motivate others</li>\n</ul>\n<strong>SPECIFIC JOB KNOWLEDGE, SKILL AND ABILITY:</strong>\n<br><br>\nThe individual must possess the following knowledge, skills and abilities to be able to perform the essential functions of the job, with or without reasonable accommodation.\n<ul>\n <li>Demonstrated ability and experience of analytical techniques and methodologies including supervised and unsupervised learning, regression modelling, data mining, and predictive modelling</li> <li>Demonstrated ability in advanced optimization techniques in the context of supply optimization</li> <li>Desired skills include programming in multiple languages (i.e. SQL, R, Python), working with large data sets, data collection, data normalization, and data visualization.</li> <li>Ability to demonstrate professionalism, reliability, resourcefulness, flexibility, and attention to detail, and to maintain strict privacy of confidential data</li> <li>Successful track record of thriving in a fast paced, flexible, and dynamic environment</li> <li>Ability to manage multiple, concurrent projects of varying size and scope and core team activities in a fast paced environment. Ability to set reasonable timeline to meet objectives and prioritize conflicting deadlines</li> <li>Energetic and enthusiastic self-starter comfortable taking the initiative to develop new levels of analytics</li> <li>Ability to build consensus, collaborate and motivate others</li> <li>Ability to work independently and collaboratively</li>\n</ul>\n<strong>Requirements</strong>\n<br><br>\n<strong>REQUIRED QUALIFICATIONS:</strong>\n<ul>\n <li>A Master’s degree in Data Science, Civil Engineering or Statistics</li> <li>2+ years of in data science, advanced analytics, predictive analytics and optimization experience</li> <li>Experience driving large analytic projects, research and programs to completion</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nAs part of its total compensation strategy, SOC provides its employees with a comprehensive benefits package. The benefits program is designed to provide you with the opportunity to select benefit options that best fit your lifestyle and personal choices.\n<ul>\n <li>Health Insurance (Medical, Dental, Vision)</li> <li>Health Savings Account</li> <li>Flexible Spending (Medical and Dependent Care)</li> <li>Employer Paid Short and Long Term Disability</li> <li>Employer Paid 1x Life and AD&amp;D (Supplemental available)</li> <li>401(k) &amp; Roth 401(k)</li> <li>Paid Time Off</li> <li>Paid Holidays</li> <li>Pregnancy and Parental Leave</li> <li>Military Leave Pay</li> <li>Commuter Assistance</li>\n</ul>"}