{"job title": "Senior Data Scientist", "company": "Spectrum", "city state": "– United States - Colorado - Greenwood Village", "rating": "3.0", "job description": "<strong>Business Title</strong>\n<br>\nSr Data Scientist\n<br><br>\n09-Jul-2018\n<br><br>\n<strong>Posting Location</strong>\n<br>\nUnited States - Colorado - Greenwood Village\n<br><br>\n<strong>Posting Job Description</strong>\n<br>\n<strong>JOB SUMMARY</strong>\n<br>\nCharter’s Product division is a high-tech group charged with developing cutting edge video products. As part of this group, the Sr Data Scientist role is responsible for executing the full-scope of advanced analytic techniques with the objectives of improving business processes, enhancing product personalization, and improving customer retention through discovery of causal relationships, predictive analysis, and recommender systems. Additionally, the role will be responsible for developing experiments and metrics to test and monitor system improvements. This position requires a strong command of statistical techniques and machine learning algorithms, as well as a demonstrated practical ability to determine where to invest time, synthesize actionable findings across diverse assignments, and present findings to audiences with diverse agendas and varying levels of technical expertise.\n<br><br>\n<strong>MAJOR DUTIES AND RESPONSIBILITIES</strong>\n<br>\nPlan, lead, and execute the complete analytics life-cycle for problem solving, including requirements gathering, problem formulation, data grooming, data exploration, model prototyping, model validation, and algorithm productionalization\n<br><br>\nSurvey varied data sources for analytic relevance, including stream source distributed file systems relational databases, flat files, external sources\n<br><br>\nInterpret, synthesize and communicate results of analyses to effect action and changes within the organization\n<br><br>\nCollaborate across teams to integrate analytic products with existing production architectures, develop execute and evaluate courses of action, and socialize results\n<br><br>\nHelp teach and explain techniques and tools used to a broad set of business-intelligence, data, and analytics professionals with varied backgrounds\n<br><br>\nExercise thought leadership and discretion in tailoring the tools, approaches, and data used to meet the needs of the particular problem\n<br><br>\nPerform other duties as needed\n<br><br>\n<strong>REQUIRED QUALIFICATIONS</strong>\n<br>\n<strong>Skills/Abilities and Knowledge</strong>\n<br>\n<em>Ability to read, write, speak and understand English</em>\n<br>\nStrong communication and presentation skills\n<br>\nExpert-level skills and experience with Python (preferred), R, Matlab, or other analytics languages\n<br>\nExperience with relational and NoSQL databases\n<br>\nExpert-level quantitative analysis skills including interpretation of model results, consideration of causality, treatment of multicollinearity\n<br>\nBroad experience and solid theoretical foundation on the modeling process using a variety of algorithmic techniques, including Machine Learning, NLP, Deep Learning, and Graph Theory\n<br>\nData pre-processing, exploratory data analysis using a variety of techniques\n<br>\nBasic understanding of data architecture, data warehouse and data marts\n<br>\nExperience in the telecommunications industry, or two other consumer-based industries\n<br>\nDemonstrated ability and desire to continually expand skill set, and learn from and teach others\n<br><br>\n<strong>PREFERRED QUALIFICATIONS</strong>\n<br>\n<strong>Skills/Abilities and Knowledge</strong>\n<br>\nExperience with BigData tools, particularly HIVE, Spark, Spark Streaming, and GraphX\n<br>\nExperience with Linux based operating systems\n<br>\nExperience with advanced analytics libraries in python such as numpy, sci-kit learn, and pandas\n<br>\nBackground with Cable systems and operations\n<br>\nKnowledge of other relevant techniques such as text analysis and text mining\n<br>\nOperations-research background, in particular focused on large labor operations such as field ops, technical support, and sales\n<br><br>\n<strong>Education</strong>\n<br>\nAdvanced degree in computer science, mathematics, statistics, physics, operations research or other quantitatively-focus fields\n<br><br>\n<strong>Related Work Experience Number of Years</strong>\n<br>\nStatistical Analysis 10+\n<br>\nBusiness Analysis 8+\n<br>\nSQL/R/SAS Programming 8+\n<br>\nDatabase Design or Database Modeling 2+\n<br><br>\n<strong>WORKING CONDITIONS</strong>\n<br>\nOffice environment\n<br>\nTravel as required\n<br><br>\n<strong><em>EOE</em></strong>\n<br>\nCharter Communications is an Equal Opportunity Employer - Minority/Female/Veteran/Disability\n<br><br>\n<strong>Requisition #</strong>\n<br>\n<strong>221984BR</strong>\n<br><br>\n<strong>Job Code</strong>\n<br>\nBBL306 Sr Data Scientist Exempt\n<br><br>\n<strong>Position Type</strong>\n<br>\nFull Time\n<br><br>\n<strong>Area of Interest</strong>\n<br>\nEngineering/Technical Operations, Product Management, Telecommunications\n<br><br>\n<strong>Business Unit</strong>\n<br>\nCable Operations\n<br><br>\n<strong>Location</strong>\n<br>\n6380 S Fiddler's Green Circle\n<br><br>\n<strong>FCC Unit</strong>\n<br>\n<strong>13541</strong>\n<br><br>\n<strong>Controlling Establishment ID</strong>\n<br>\n01176 - 6380 South Fiddler's Green Cir\n<br><br>\n<strong>More on Spectrum</strong>\n<br>\nThe Spectrum brand is powered and innovated by Charter Communications. Charter Communications reaffirms its commitment to providing equal opportunities for employment and advancement to qualified employees and applicants. Individuals will be considered for positions for which they meet the minimum qualifications and are able to perform without regard to race, color, gender, age, religion, disability, national origin, veteran status, sexual orientation, gender identity, or any other basis protected by federal, state or local laws.\n<br><br>\nCharter Communications will consider for employment qualified applicants with criminal histories in a manner consistent with applicable laws, including local ordinances.\n<br><br>\n<strong>Work State</strong>\n<br>\nColorado\n<br><br>\n<strong>Work City</strong>\n<br>\nColorado - Greenwood Village\n<br><br>\n<strong>Cost Center</strong>\n<br>\n90601980-Product Management-Residential Product\n<br><br>\n<strong>Posting Job Title</strong>\n<br>\nSenior Data Scientist\n<br><br>\ntest5768789"}