{"job title": "Data Scientist", "company": "Spectrum Communications and Consulting", "city state": "– Chicago, IL", "rating": "3.9", "job description": "What’s <em>significantly</em> better than working on a typical data science team? How about working on a data science team in which you’re directly making an impact in the revolutionary field of artificial intelligence even as an entry level team member? (well, statistically significant that is). Pardon the pun, but at Spectrum we’re certain that our team is pumped up to work not only with like-minded data-savvy and fun loving professionals, but also to work with cutting edge new tools like our predictive, artificially intelligent proprietary software. So, if your confident that you want to make a direct impact in your next job today, then please keep on reading.\n<br><br>\n<strong><em>Responsibilities</em></strong>\n<br><br>\nBeyond working with state of the art technology you will have many different fantastic projects to work on as a Data Scientist at Spectrum. Here are just a few different responsibilities you can expect off the bat:\n\n<ul>\n<li>Work with IT teams, management and/or data scientists to determine organizational goals</li>\n<li>Mine data from primary and secondary sources</li>\n<li>Clean and prune data to discard irrelevant information</li>\n<li>Analyze and interpret results using standard statistical tools and techniques</li>\n<li>Pinpoint trends, correlations and patterns in complicated data sets</li>\n<li>Identify new opportunities for process improvement</li>\n<li>Provide concise data reports and clear data visualizations for management</li>\n</ul>\n<strong><em>Some Characteristics That Define You</em></strong>\n<br><br>\nWe understand that as a Data Scientist for Spectrum, you have many different professional goals and personal interests. As such here are just a few different things that typically define our team members on the Data Science team:\n\n<ul>\n<li><strong>Analytical.</strong> In order to solve problems and build innovative new digital marketing campaigns, it is essential that you know how to take an idea and analyze it from all of its angles.</li>\n<li><strong>Patient.</strong> As a data scientist, you know that you work with extremely large data sets on a daily basis. As such we are looking for someone who is not only meticulous, but patient enough to sit and sift through that data in a thorough way.</li>\n<li><strong>Creative.</strong> Beyond just analyzing data sets, you are an explorer and a puzzle solver. Pulling insights out of your data and understanding how those insights can better shape our tools is something that you live to do.</li>\n<li><strong>Student.</strong> More so than most industries, the field of data science is always changing and evolving. As such, you are always looking to learn new things and gain new skills.</li>\n<li><strong>Business-Savvy.</strong> Beyond the wicked data science skills you bring to the table, we also want you to consider the business implications of our data tools. From the ways our team will use them to how our customers will use them, we always want you to keep the user and the business application in mind.</li>\n</ul>\n<strong><em>Required Skills and Experience</em></strong>\n<br><br>\nOn top of the many intangible skills you bring to the table, there are many skills that can help improve the efficiency and success of your work at Spectrum. Here are a few of those required skills and experience that you will come in with as a Data Scientist on our team:\n\n<ul>\n<li>A bachelor’s degree/pursuing a bachelor's degree in computer science, mathematics, statistics, information systems, or a related field</li>\n<li>Experience with statistical modeling</li>\n<li>Fundamental knowledge of R and/or SAS languages</li>\n<li>Experience with SQL databases and database querying languages</li>\n<li>Experience with data mining and data cleaning</li>\n<li>Experience with data visualization and reporting techniques</li>\n<li>Written and verbal expression</li>\n</ul>\n<strong><em>Benefits</em></strong>\n<br><br>\nAs a Data Scientist at Spectrum there are a ton of fantastic perks and benefits that come along with your work. Here are just a few of the benefits you can expect when joining the Spectrum family:\n\n<ul>\n<li>Comprehensive medical &amp; dental insurance</li>\n<li>Retirement planning &amp; company matching</li>\n<li>Generous PTO, including sick days &amp; holidays</li>\n<li>A state-of-the-art office environment</li>\n<li>Nintendo Switch in-office gaming such as FIFA, Arms, Mario Kart, and Rocket League</li>\n<li>Year-round gym memberships</li>\n<li>Paid continuing education</li>\n<li>Casual dress code</li>\n<li>Flexible scheduling</li>\n<li>Free-Lunch-Friday</li>\n<li>Company sponsored parties and group activities outside of the office</li>\n</ul>"}