{"job title": "Data Engineer", "company": "SPINS, LLC", "city state": "– Chicago, IL", "rating": "3.8", "job description": "SPINS is seeking a world class Data Engineer to join the Data Science Solutions team.<br><br><strong>Who We Are</strong><br><br>For 20 years, our mission has been to increase the presence and accessibility of natural and organic products to encourage healthier and more vibrant living. By leveraging SPINS' industry-leading proprietary data and analytics, our technology enables deeper, more engaged relationships between Retailers, Brands and Consumers through our platform, web, and mobile products. At the core of our work lies a passion to create a culture of sustainable health &amp; wellness.<br><br><strong>What You Will Do</strong><br><br>You will create robust, scalable data pipelines that scale across the SPINS business to deliver insights to Retail and CPG companies that work with SPINS. You will be working in a \"hands on\" role, using python and SQL to efficiently uncover meaning and insight that leverage SPINS proprietary data. You will develop and drive the analytics efficiency of the organization by contributing to a codebase that can be leveraged in projects across the organization.\n<br><br>\nIdeally, you thrive on continuous innovation when value is determined by client results. You must have a passion for digging into data using the latest tools and methodologies.\n\n<ul>\n<li>Develop and maintain tools that bridge disparate data sources across the organization to serve data models, dashboards, decision aids, and business case analysis with up-to-date and accurate information.</li>\n<li>Collaborate with our data scientists on engineering machine learning and predictive features from our proprietary data assets.</li>\n<li>Prototype, implement, and optimize data new pipelines and architectures that can transform our data to impactful insights.</li>\n<li>Create daily, weekly, or monthly automated processes built on proven and completed work.</li>\n<li>Create innovative and efficient techniques that better solve the problems we are working on</li>\n<li>Assess risks to proposed analytics solutions based on quality of existing data sources and actively develop QA procedures to mitigate those risks.</li>\n<li>Tailor our syndicated data to retail and CPG business needs in a robust, repeatable, and scalable way.</li>\n<li>Facilitate knowledge transfer across the business between Product Delivery and Commercial teams.</li>\n<li>Recommend and implement enhancements that standardize and streamline processes, assure data quality and reliability, and reduce processing time to meet client expectations.</li>\n</ul>\n\n<strong>What You Bring</strong>\n\n\n<ul>\n<li>Have a professional quantitative background with an education that stresses analytical thinking and quantitative methods (STEM)</li>\n<li>Experience using python in a data context (iterators, pandas, scikit-learn, etc.)</li>\n<li>Are passionate about innovating new ways to answer novel problems</li>\n<li>Are comfortable with being given the self-autonomy to work independently and experiment with new ideas and new ways to design and implement data science solutions to advance business goals</li>\n<li>Can maintain sharp focus amidst multiple priorities and a keen aptitude to prioritize and manage time/projects</li>\n<li>Have confidence in being the expert on SPINS data capabilities and best practices based on independent synthesis of a broad range of data</li>\n<li>Have knowledge of working in a cloud computing environment</li>\n<li>Familiarity with Docker or similar container framework and container orchestration tools such as Kubernetes is a plus</li>\n<li>Experience working with retail POS or other transactional data is preferred</li>\n</ul>\n\n<strong>The SPINS Way: The right candidate for us will be</strong>\n\n\n<ul>\n<li>Vibrant You're passionate about doing meaningful, impactful work.</li>\n<li>A Disruptor You're not afraid to do things differently</li>\n<li>Connected You work well as part of a team, and you build strong relationships with colleagues</li>\n<li>Be Yourself We are open &amp; honest with each other; we take responsibility for our actions, and for our work</li>\n</ul>\n\n<strong>Why SPINS?</strong>\n\n\n<ul>\n<li>Health, dental and vision insurance</li>\n<li>401k (Traditional and Roth) plus company match</li>\n<li>FSA for medical and dependent care expenses</li>\n<li>Pre-tax commuter benefit</li>\n<li>Life insurance</li>\n<li>Short- and long-term disability</li>\n<li>Paid maternity and paternity leave</li>\n<li>Bike storage</li>\n<li>Fresh and healthy snacks</li>\n<li>Vibrancy 360 Wellness Program: Yoga and fitness classes, onsite massage, volunteer opportunities, company happy hours, product demos, outings, and more</li>\n</ul>"}