{"job title": "Associate Data Scientist", "company": "Spirent Communications", "city state": "– Holmdel, NJ", "rating": "3.6", "job description": "The Telecom Analytics organization within Spirent is an exciting software division, providing innovative solutions for the telecommunications industry. Leveraging the latest technologies in big data, machine learning and data mining, Spirent provides state-of-the-art software products for communication service providers. With a friendly, informal culture, and substantial growth opportunities, the analytics division provides an ideal environment for a talented data scientist. The position is located in Holmdel, NJ.\n<br><br>\nThis position is for an entry level data scientist with experience working with and analyzing large data sets. The ideal candidate would be a recent computer science, statistics or operations research graduate with related course experience and some prior work (summer jobs or internships) in the field of big data or data mining.\n<br><br>\nThe responsibilities include, but are not limited to:\n\n\n<ul>\n<li>Investigation of large data sets related to telecommunications services -- identify unique patterns and determine potential business value of new data mining proposals.</li>\n<li>Specification and prototyping of new algorithms for data mining telecommunications data</li>\n<li>Bachelor's Degree in Computer Science, Statistics, Operations Research or related field.</li>\n<li>Ability to multitask</li>\n<li>Good communications skills</li>\n<li>Self-starter</li>\n<li>Independent thinker, but good team player</li>\n</ul>\n\n<strong>USEFUL EXPERIENCE (but not required):</strong>\n\n\n<ul>\n<li>Big Data Technologies and Data Analysis</li>\n<li>Hadoop, HDFS, Spark</li>\n<li>Machine learning algorithms</li>\n<li>Neural Networks</li>\n<li>Clustering, Classification, Support Vectors and Predictive Analytics</li>\n<li>Time series analysis and anomaly detection</li>\n<li>Experience with Python, R, Matlab or statistical packages</li>\n<li>SQL</li>\n<li>Relational database expertise</li>\n<li>SQL queries</li>\n<li>Query optimizations, query plans</li>\n<li>Unix/Linux</li>\n<li>Shell scripting, system monitoring (CPU, disk, processes, system limits, security)</li>\n</ul>"}