{"job title": "Data Engineer", "company": "Spotify", "city state": "– Boston, MA, United States", "rating": "4.0", "job description": "Spotify is looking for a Data Engineer to join us. You will build data driven solutions to bring music and digital media experiences to hundreds of millions of active users and millions of creators by matching fans with creators in a personal and relevant way. You will take on complex data-related problems using some of the most diverse datasets available user behaviors, acoustical analysis, revenue streams, cultural and contextual data, and other signals across our broad range of mobile and connected platforms. Above all, your work will impact the way the world experiences art.<br><br><strong>What youll do</strong>\n\n<ul>\n<li>Build large-scale batch and real-time data pipelines with data processing frameworks like Scio, Storm or Spark and the Google Cloud Platform.</li><li>Leverage best practices in continuous integration and delivery.</li><li>Help drive optimization, testing and tooling to improve data quality.</li><li>Collaborate with other engineers, ML experts and stakeholders, taking learning and leadership opportunities that will arise every single day.</li><li>Work in cross functional agile teams to continuously experiment, iterate and deliver on new product objectives.</li>\n</ul>\n\n<strong>Who you are</strong> \n\n<ul>\n<li>You know how to work with high volume heterogeneous data, preferably with distributed systems such as Hadoop, BigTable, and Cassandra.</li><li>You have experience with one or more higher-level JVM-based data processing frameworks such as Beam, Dataflow, Crunch, Scalding, Storm, Spark, or something we didnt list- but not just Pig/Hive/BigQuery/other SQL-like abstractions</li><li>You are knowledgeable about data modeling, data access, and data storage techniques.</li><li>You care about agile software processes, data-driven development, reliability, and responsible experimentation.</li><li>You understand the value of collaboration within teams.</li>\n</ul>\nWe are proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better product for our users and our creators. This is something we value deeply and we encourage everyone to come be a part of changing the way the world listens to music.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}