{"job title": "Data Engineer - Legal &amp; Licensing", "company": "Spotify", "city state": "– New York, NY, United States", "rating": "4.0", "job description": "We are looking for a very motivated data engineer to build the framework of data reporting and analysis for our licensing partners - Labels and Publishers. This is a great opportunity for a data engineer that has worked on the back end of things to gain more business context by working closer to the partners and business.\n<br><br>\n<strong>What you'll do:</strong>\n\n<ul>\n<li>Design, build and maintain a “licensing specific” data infrastructure, which captures all data points needed by the licensing external partners and by the internal licensing team</li> <li>Design, build and maintain the standard reporting for licensing external partners (major labels and publishers). For examples: top charts, free trial conversion, market share, top search, active users etc</li><li>Partner with licensing data scientists to drive business insights on labels and publishers</li><li>Partner with licensing data scientists and the broader licensing team to drive partners business reviews</li><li>Design, build and maintain ad-hoc solutions and data pipeline to gather relevant data across the sprawling data infrastructure of Spotify</li><li>Become the center of excellence for data collection, data taxonomy and data filtering specific to licensing partners.</li><li>Drive automation of standard reporting and distribution wherever possible.</li>\n</ul>\nWho you are:\n<ul>\n<li>You are self-driven and have a good understanding of the business and communicate well with non-data colleagues.</li><li>You are interested in being the glue between engineering and analysis and feel comfortable working in a business oriented team.</li><li>You are Innovative and able to come up with new solutions to very tricky problems</li><li>You are passionate about crafting clean code and have a steady foundation in coding</li><li>You know Scala and Python language</li><li>You have experience in developing/building data pipelines (batch or streaming)</li><li>You are familiar with ETL (extract, transform and load)</li><li>Tools and infrastructure such as GCP (google cloud platform) is a plus, as well as familiarity with Amazon or Azure cloud.</li><li>At least 2-3 years of relevant experience, i.e. software engineering working with data analysis, data modeling, data processing as well as</li>\n</ul>\nGreat role if you're interested in making a change!\n<br><br>\nQuestions? or Interested in Learning more? Contact Andrea Silvestrini @asilvestrini@Spotify.com\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}