{"job title": "Data Scientist, Markets Research", "company": "Spotify", "city state": "– London/New york, United Kingdom", "rating": "4.1", "job description": "We seek an outstanding Data Scientist to join our Markets Research team in New York. This individual will be responsible for partnering with local business operations teams to drive strategic decision-making across the globe. You will study user behavior, market dynamics, and content strategies, providing data and insights that will influence strategic direction. Above all, you will be at the nexus of data science and business at one of the most innovative companies in the world.\n<br><br>\nIn addition to possessing strong technical background of his/her own, the ideal candidate will be a natural communicator who is able to explain complex statistical frameworks to non-technical stakeholders all over the world. Accompanying this broad set of responsibilities is exposure to many departments, as well as senior management, at Spotify.<br><br><strong>What you'll do:</strong>\n\n<ul>\n<li>Productize day-to-day analytics and insights support for Spotify’s Markets Operations team.</li><li>Develop a robust body of knowledge around each of Spotify’s key markets to proactively address business questions and drive strategy.</li><li>Work closely with cross-functional teams of analysts, product owners, marketers, designers, and others across the company who are responsible for driving results in local markets.</li></ul>\n\n<ul>\n<li>Support Markets leadership with research on key business initiatives and challenges.</li>\n</ul>\n\n<strong>Who you are:\n<br>\n</strong>\n\n<ul>\n<li>Degree in Computer Science/Engineering, Mathematics, Statistics, Economics, or another quantitative field.</li><li>3-5 years of experience, preferably at at least one company with a matrix organizational structure.</li><li>Excellent communication and stakeholder management skills.</li><li>Extensive experience manipulating and analyzing complex data with SQL, Python and/or R. Knowledge of Google BigQuery and Java/Scala is a plus.</li><li>Familiarity with big data processing frameworks like Hadoop or Spark is a plus.</li><li>Ability to converse in two or more languages is a plus.</li><li>Comfort operating independently in a fast-paced work environment.</li>\n</ul>\n<em>We are proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better product for our users and our creators. This is something we value deeply and we encourage everyone to come be a part of changing the way the world listens to music</em>\n<br><br>\n<em><u>Psst! If this job is your perfect match and you want some inside tips before you apply, read this blog post</u></em>"}