{"job title": "Analytics Consultant", "company": "SpringML", "city state": "– Indianapolis, IN", "rating": "3.4", "job description": "SpringML is seeking an Analytics Consultant to augment our Salesforce delivery practice. You will play a critical role in our client engagements using the Salesforce Analytics Cloud platform (Einstein Analytics, Einstein Discovery, and the Einstein Platform). You will design and implement highly customized solutions for our customers business problems, typically across multiple functions of a customers organization through data integration, visualization, and analysis.\n<br><br>\nRESPONSIBILITIES\n\n<ul>\n<li>Ability to work as a member of a team assigned to design and implement solutions for our customers.</li>\n<li>Data analysis skills to conduct analysis and deliver recommendations to the team and customer.</li>\n<li>Dashboard and Dataset development develop dashboards and datasets that meet and exceed customer requirements.</li>\n<li>Presentation skills demonstrated ability to simplify complex situations and ideas and distill them into compelling and effective written and oral presentations.</li>\n<li>Learn quickly ability to understand and rapidly comprehend new areas, functional and technical, and apply detailed and critical thinking to customer solutions.</li>\n</ul>\nQUALIFICATIONS\n\n<ul>\n<li>B.S. or equivalent degree in computer science, statistics, mathematics or other relevant fields.</li>\n<li>0 3 years of experience in business analytics, data science, or consulting in these fields.</li>\n<li>1+ year experience with Salesforce preferred.</li>\n<li>Previous experience using Salesforce Einstein Analytics or Einstein Discovery a plus.</li>\n<li>Experience or equivalent coursework using statistics for data analysis with an understanding of, at a minimum, multivariate regression.</li>\n<li>Strong understanding of query languages and basic understanding of programming languages; experience with Python, R, Java, or Apex a plus.</li>\n</ul>"}