{"job title": "Engineering Team Lead- Data Engineering", "company": "Squarespace", "city state": "– New York, NY", "rating": "3.5", "job description": "Squarespace is seeking experienced data engineering team leaders. As a member of our Data Engineering team, you'll sit with a cross-functional team of software engineers, data scientists and business analysts, working closely with your team to turn complex sources into understandable data. The data sets, pipelines and tools that you build will be involved in pivotal, company-level decisions for years to come. Not only that, but you'll be working on a team where constant learning and team-wide knowledge sharing is a core part of our culture.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n\n<ul>\n<li>Build and maintain data processing services</li>\n<li>Write, test, and review primarily microbatch or streaming ETL</li>\n<li>Continuous improvement of our system, tests, and data quality indicators</li>\n<li>Influence our technical decisions</li>\n<li>Keep yourself informed and up-to-date with technologies</li>\n<li>Encourage the technical growth of your teammates</li>\n<li>Lead other engineers and collaborate with designers to deliver strong customer-focused experiences</li>\n<li>Have regular 1-1 with team members, and take an active role in code reviews for junior members</li>\n<li>Mentor junior team members</li>\n</ul>\n<strong>QUALIFICATIONS</strong>\n\n<ul>\n<li>You love working directly with the people whose problems you're solving</li>\n<li>You are deeply skilled at data modeling, storage, security, and retrieval</li>\n<li>You're motivated and driven. You naturally take responsibility for a project and ask for help when needed</li>\n<li>You enjoy working with dynamic programming languages, relational databases, and distributed systems. Our platform is ever evolving, but currently is a combination of Python, Java, Postgres, Kubernetes, Spark, Presto, Kafka, and Mongo</li>\n<li>You gain a deep understanding of the products and tools you work with</li>\n<li>You check your work and stand behind what you've built</li>\n<li>Experience managing a team of 3-5 engineers</li>\n</ul>\n<strong>ABOUT SQUARESPACE</strong>\n<br><br>\nSquarespace makes beautiful products to help people with creative ideas succeed. By blending elegant design and sophisticated engineering, we empower millions of people from individuals and local artists to entrepreneurs shaping the world's most iconic businesses to share their stories with the world. Squarespace's team of more than 800 is headquartered in downtown New York City, with offices in Dublin and Portland. For more information, visit www.squarespace.com/about.\n<br><br>\n<strong>PERKS</strong>\n\n<ul>\n<li>Health insurance with 100% premium covered</li>\n<li>Flexible vacation &amp; paid time off</li>\n<li>Equity plan</li>\n<li>401(k) plan with employer match</li>\n<li>Free lunch and snacks</li>\n<li>Dog-friendly workplace</li>\n</ul>\n<em>Today, more than a million people around the globe use Squarespace to share different perspectives and experiences with the world. Not only do we embrace and celebrate the diversity of our customer base, but we also strive for the same in our employees. At Squarespace, we are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace.</em>"}