{"job title": "Scientist, Analytical Development", "company": "SQZ Biotechnologies", "city state": "– Watertown, MA, US", "rating": "4.0", "job description": "<div>\nWe are seeking a flexible, detail oriented and innovative Scientist to join the Analytical Development &amp; Quality Control (AD&amp;QC) team. The successful candidate will work within the internal AD&amp;QC team to develop analytical methodologies for extensive characterization of SQZ Biotechnologys cell therapy products. The candidate will also effectively and routinely collaborate with colleagues from Research and Development teams.</div> \n<br>\n<div><strong>At SQZ, we're proud of our culture and always look to grow our team with people who share our values. We:</strong></div><ul>\n\n<li>\n<strong>Squeeze Together:</strong> We value teamwork, trust, and transparency as critical components for achieving our mission and exceeding our goals</li> \n<li>\n<strong>Question Boundaries:</strong> Were committed to questioning the status quo and changing the world through our people and our science</li>\n<li>\n<strong>Zap Obstacles:</strong> We strive to be pioneers. Were resilient when it comes to navigating challenges, anticipated or not, scientific and otherwise</li>\n</ul>\n\n<div><strong>Primary responsibilities:</strong></div><ul>\n<li>\nDevelop analytical methods for heightened characterization of starting materials used in cell therapy products that include assessing purity, content and physicochemical attributes of the starting materials</li>\n<li>\nDevelop a matrix of analytical methods to measure antigen delivery in cell therapy products</li>\n<li>\nDevelop analytical methods to measure purity, dose, and potency of cell therapy products</li>\n<li>\nProvide analytical support for understanding the mechanism of action of cell therapy products</li> \n<li>\nDevelop methods to measure trace analytes and process residuals</li> \n<li>\nConduct pilot studies to understand stability profile of starting materials and cell therapy products</li>\n<li>\nProvide testing support for Research and Development teams as needed</li>\n</ul>\n\n<div><strong>Candidate must:</strong></div><ul>\n<li>\nWork independently and manage multiple projects simultaneously</li>\n<li>\nDesign and troubleshoot experiments</li> \n<li>\nCritically analyze and present data</li> \n<li>\nManage and mentor junior team members as needed</li>\n<li>\nDemonstrate critical thinking, problem-solving and attention to detail</li>\n</ul><br>\n\n<div><strong>Minimum Qualifications:</strong></div><ul>\n<li>\nPh.D. in scientific field with at least 2 years of Analytical Development experience in industry</li>\n<li>\nExpertise in cell handling and aseptic techniques</li>\n<li>\nExperience with analytical, molecular biology and immunological methods (U/HPLC, LCMS, plate readers, UV, Fluorescence, qPCR, Sanger sequencing, gel electrophoresis, western blot, ELISA, Flow cytometry)</li>\n<li>\nExcellent computer skills including using fluency with Excel, Minitab, GraphPad Prism or similar statistical and data analysis software</li>\n<li>\nExperience writing scientific reports</li>\n</ul>\n\n<div><strong>Preferred Qualifications:</strong></div><ul>\n<li>\nExperience authoring characterization data to support CMC content for regulatory submissions</li> \n<li>\nExperience with data processing software like ChemStation, Chromeleon, FlowJo etc.</li>\n</ul>\n\n<div>\nSQZ Biotechnologies is proud to be an equal opportunity employer and to provide equal opportunities to all employees and applicants for employment without regard to race, color, religion, sex or gender identity, national origin, age, disability, sexual orientation or genetics. In addition to federal law requirements, SQZ complies with applicable state and local laws governing nondiscrimination in employment.</div>"}