{"job title": "Scientist, Immunology", "company": "SQZ Biotechnologies", "city state": "– Watertown, MA, US", "rating": "4.0", "job description": "<div>\nWe are seeking to expand our team by recruiting a Scientist with a background in immunology and molecular biology. The successful candidate will have a passion for driving high-impact projects focused on the development of novel immune-therapeutics. The successful candidate will effectively and routinely collaborate with colleagues on different projects and regularly present scientific results to multidisciplinary teams and leadership at SQZ Biotechnologies.</div> \n<br>\n<div><strong>Primary responsibilities:</strong></div><ul>\n<li>\nGenerate and test engineered murine and human immune cells with the CellSqueeze platform</li>\n<li>\nDesign, produce, and validate cell-based assays in order to evaluate engineered immune cell function</li>\n<li>\nDesign and execute in vitro studies utilizing primary immune cells to characterize T cell responses</li>\n<li>\nMentor research associates</li>\n<li>\nContribute to experimental design and problem-solve in a creative manner</li>\n<li>\nManage and support external collaborations as a subject matter expert in immunology</li>\n<li>\nContribute to the external scientific visibility of the company through collaboration with large pharmaceutical companies</li>\n</ul><br>\n\n<div><strong>Candidate must:</strong></div><ul>\n<li>\nWork independently and manage multiple projects simultaneously</li>\n<li>\nDemonstrate the ability to critically analyze and present data</li> \n<li>\nKeep up-to-date with the literature related to his/her field</li>\n<li>\nDemonstrate clear and professional verbal and written communication skills</li>\n<li>\nHave strong work ethic and a team orientation</li>\n</ul>\n\n<div><strong>Required skills:</strong></div><ul>\n<li>\nPhD in Immunology highly preferred, additional areas of applicable study include molecular biology, protein chemistry, and/or related fields</li>\n<li>\nExpertise in the culture of primary human cells and in vitro assays such as ELISA, ELISpot, and intracellular cytokine staining</li> \n<li>\nHands-on experience with in vivo adoptive immune response assays in the context of tumor models is a plus</li> \n</ul>\n\n<div>\nSQZ Biotechnologies is proud to be an equal opportunity employer and to provide equal opportunities to all employees and applicants for employment without regard to race, color, religion, sex or gender identity, national origin, age, disability, sexual orientation or genetics. In addition to federal law requirements, SQZ complies with applicable state and local laws governing nondiscrimination in employment.</div>"}