{"job title": "Computer Scientist (Computer Vision), Vision Systems Group", "company": "SRI International", "city state": "– Princeton, NJ", "rating": "3.5", "job description": "<strong>Title</strong>\n<br>\nComputer Scientist (Computer Vision), Vision Systems Group\n<br><br>\n15-Oct-2018\n<br><br>\n<strong>Job Description</strong>\n<br>\nSRI International’s Center for Vision Technologies offers end-to-end computer vision solutions that translate into real-world applications. Our scientists have pioneered real-time, real-world systems in multimodal (text, audio, and vision) analytics, stereo processing, 3D scene understanding, object recognition, activity recognition and integrated sensor and processing solutions. We continue today to advance real-time computer vision algorithms directly applicable into real-world applications.\n<br><br>\nWe are looking for a creative and energetic research scientist with a strong academic and practical background in computer vision algorithms including image enhancement, computation imaging, stereo, semantic reasoning and activity recognition algorithms. A successful candidate needs to demonstrate the ability to conduct state-of-the-art research, preferably in the area of real-time computer vision algorithms development and implementation on commercial processing hardware. You will develop end-to-end systems in applications for imaging, vision and other sensing domains. The right candidate will possess a strong technical background and software development, understanding methods for working across different program teams. You must be able to thrive and succeed in a fast-paced research environment. Maturity, innovation, design judgment and the ability to be a team player are essential to succeed in this role.\n<br><br>\n<strong>Responsibilities include:</strong>\n\n<ul>\n<li>Support computer vision algorithm design, implementation and testing. Support operational prototype developments and investigate their deployment in real world operations.</li><li>Support the development of exploring novel solutions in the area of computer vision, computational sensing, sematic reasoning, and related areas.</li><li>Support development of software for PC, smartphones, FPGAs, and GPUs.</li><li>Develop software under robust and agile methods, including design, documentation and revision control practices.</li><li>Support development of new IP within government, commercial, and internally funded programs.</li>\n</ul>\n\n<strong>Auto req ID</strong>\n<br>\n<strong>1935BR</strong>\n<br><br>\n<strong>Location(s)</strong>\n<br>\nPrinceton, NJ\n<br><br>\n<strong>Other Requirements</strong>\n\n\n<ul>\n<li>-There are no additional requirements for this position.</li>\n</ul>\n\n<strong>Employment Status</strong>\n<br>\nFull Time\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>M.S. or PhD in Computer Science, machine learning or related field.</li> <li>Publications in top-tier conferences or journals in your field a plus.</li><li>Have solid programming skills, including experience with Python, C and C++.</li><li>Have experience with computer vision open source libraries (e.g. OpenCV).</li><li>Have experience with software version tools (e.g. GitLab).</li><li>One or more years of relevant work experience is desired.</li> <li>Must possess strong Software Engineering skills and communication skills.</li>\n</ul>\n\n<strong>Desired Qualifications:</strong>\n\n<ul>\n<li>US Citizenship/Permanent Residency is preferred, clearances are a plus. Exceptional candidates in non-immigrant status will be considered</li>\n</ul>\n\n<strong>EOE/AA</strong>\n<br>\nSRI is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.\n<br><br>\n<strong>Background Check</strong>\n<br>\nCandidates who receive a conditional offer of employment will be subject to a background check.\n<br>"}