{"job title": "Clinical Laboratory Scientist II", "company": "Stanford Health", "city state": "– Palo Alto, CA", "rating": "3.4", "job description": "Stanford Blood Center Histocompatibility lab is seeking a Clinical Laboratory Scientist or Histocompatbility Specialist to perform human histocompatibility testing for organ transplantation, including molecular typing, HLA antibody identification, crossmatch testing. Test specimens, analyze, interpret, and report results; function as an expert technical resource, performing the most complex assays and providing training and mentoring to other Clinical Laboratory Scientist staff. Clinical test results are used directly to inform patient care decisions. Minimum of five years of experience in HLA clinical testing is required. After completion of training, regular work hours are 10:30 PM to 7:00 AM, Monday through Friday. Must hold or qualify for current California Clinical Laboratory Scientist license. (If you have completed a medical technologist training program and are boarded by ASCP or AAB, or you have passed the ABHI CHT or CHS board exam, you qualify for this state license.) Generous shift differential for night work.\n<br>\n<strong>Core Duties include:</strong>\n<br>\nPerform high-complexity histocompatibility testing on various types of clinical samples. Tests may include HLA antibody identificatoin, crossmatching, typing, and engraftment monitoring.\n<br>\nAnalyze and evaluate results, and generate and evaluate clinical reports.\n<br>\nPerform final review of sample processing, test preparation, testing results, and reports generated by staff. Sign out reports to next level review or to physicians.\n<br>\nServe as expert, technical resource, and/or point person for one or more specialized areas or instruments in the department. Train and mentor other Clinical Laboratory Scientists.\n<br>\nEvaluate, validate, and optimize new assays; may evaluate new technologies and make recommendations on new acquisitions and/or upgrades of instrumentation and software.\n<br>\nReview quality assurance and quality control data and take corrective action for assigned area, as needed. Maintain documentation and assure that regulatory requirements are met.\n<br>\nAssist with scheduling and workflow coordination.\n<br>\nWrite, review, and edit protocols and procedures; maintain procedure manuals.\n<br>\nOversee completion of equipment maintenance, instrumentation calibration, quality control and documentation, and ensure adequate supply of supplies and equipment.\n\n\n<ul>\n<li>- Other duties may also be assigned.</li>\n</ul>\n\nBA or BS degree in biology or related field, plus five years of testing experience in a clinical histocompatibility lab. Hold or qualify for California Clinical Laboratory Scientist (MTA) or Clinical Histocompatibility Specialist (MTR) license. (Out of state: if you meet these requirements, you qualify for this license. License must be obtained within 6 months of start date.) After completion of training, regular work hours are 10:30 PM to 7:00 AM Monday through Friday.\n<br><br>\n<strong>Other Relevant Information:</strong>\n<br>\nWill be required to comply with governmental regulations and Blood Center policy and strictly observe privacy and security related policies, procedures and practices to preserve the integrity and confidentiality of medical and other sensitive information pertaining to donors, patients, research subjects, and staff. May be required to enter areas where other individuals work with human blood; potential may exist for unanticipated exposure to bloodborne pathogens by splash or spill.\n<br><br>\nStanford Blood Center, a subsidiary of Stanford Health Care, is focused on connecting our communities to provide hope for healing. We lead the fields of transfusion and transplantation medicine by advancing science and technology. We provide hope for the future by teaching the medical leaders of tomorrow. We enhance lives by connecting donors to patients every day. We are looking for friendly, customer-focused individuals who value integrity, accountability, collaboration and communication, to join our team.\n<br><br>\nWe are a 24/7 fast-paced organization that is highly regulated by the FDA, ASHI and a number of other accrediting agencies. We need people that are dependable, detail-oriented and comfortable following established procedures. For more information about us, visit our website at http://bloodcenter.stanford.edu/\n<br><br>\nFinal offers of employment are contingent upon the successful completion of:\n<br>\nA background check that includes employment history, national criminal background check, national sex offender registry search and, where applicable, a credit check and/or driving record.\n<br>\nA pre-placement physical exam that includes TB testing and drug/alcohol screening.\n<br><br>\nWe are not able to provide relocation or sponsorship for this position. Stanford Blood Center is an affirmative action, equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status or on the basis of disability.\n<br><br>\nThank you for your interest!"}