{"job title": "Clin Lab Scientist, OP Ctr Clinical Labs", "company": "Stanford Health Care", "city state": "– Redwood City, CA", "rating": "3.4", "job description": "Performs a wide range of medical laboratory tests used to diagnose, treat and prevent disease. Using\n<br>\ntechnical knowledge and a theoretical understanding of the basis of the tests, records and validates the\n<br>\naccuracy and quality of results to ensure conformity to specifications. Understands and applies the correct\n<br>\ncontrol measures and protocols in cases of abnormal results, reporting any discrepancies to a Senior,\n<br>\nReference, or Supervising Clinical Laboratory Scientist. Calibrates assays where the calibration is part of\n<br>\neach run. Maintains supply inventory, performs and documents routine preventative maintenance and records\n<br>\nis performance. Performs simple troubleshooting and reports instrument malfunctions to senior staff. Has an\n<br>\nunderstanding and maintains current knowledge of specialty area(s) assigned in the laboratory.\n<br><br>\nEssential Functions\n<br><br>\nAccurately performs and completes laboratory analysis on body fluids in accordance with laboratory protocols\n<br>\nand policies.\n<br><br>\nAdheres to all safety/health and state/federal regulatory requirements and the procedures, policies and\n<br>\nServices Standard defined by the Hospitals.\n<br><br>\nApplies the appropriate control measures in test with abnormal results. Handles results in accordance with\n<br>\nprotocol and notifies the necessary personnel.\n<br><br>\nDemonstrates technical proficiency in all areas of assigned responsibility. Keeps abreast of new technical\n<br>\ndevelopments and acquires the necessary skills to adapt to technological changes.\n<br><br>\nMaintains a current understanding of all procedures used in the assigned laboratory section(s) and can\n<br>\ninterpret the significance of normal and abnormal results.\n<br><br>\nPerforms clinical laboratory tests of varying complexity using standard procedures examining specimens for\n<br>\nthe purpose of providing information for the diagnosis, prevention, or treatment of disease.\n<br><br>\nPerforms maintenance and function checks on analytical equipment and perform operational checks necessary for proper test performance to assure accurate and reliable test results and reporting.\n<br><br>\nPerforms other duties as assigned by supervisors.\n<br><br>\nResolves problems related to clinical issues, equipment or testing by initiating research utilizing available\n<br>\nreference material. Reports and/or escalates problems to management as appropriate.\n<br><br>\nUsing technical knowledge and theoretical understanding of the basis of tests, records and analyzes test\n<br>\nresults to validate accuracy, quality and conformity to specifications.\n<br>\nEqual Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.\n<br>\nAny combination of education and experience that would likely provide the required knowledge, skills and abilities as\n<br><br>\nwell as possession of any required licenses or certifications is qualifying.\n<br><br>\nEducation: Bachelor\"s degree in a work-related discipline/field from an accredited college or university\n<br><br>\nExperience: One (1) year of progressively responsible and directly related work experience\n<br><br>\nLicense/Certification: Clinical Laboratory Scientist (CLS) or for Microbiology, Cytology or Genomics Labs only:\n<br><br>\nPHM - California Certified Public Health Microbiologist; or CGMBS - Clinical Genetic Molecular Biology\n<br><br>\nScientist, or CLS Limited - Clinical Laboratory Scientist\n<br><br>\nKnowledge, Skills, and Abilities\n<br><br>\nThese are the observable and measurable attributes and skills required to perform successfully the essential\n<br><br>\nfunctions of the job and are generally demonstrated through qualifying experience, education, or\n<br><br>\nlicensure/certification.\n<br><br>\nAbility to analyze data, draw conclusions and interpret results\n<br><br>\nAbility to communicate effectively, both orally and in writing\n<br><br>\nAbility to learn new procedures and adapt to technological changes in the laboratory\n<br><br>\nAbility to organize, prioritize, multi-task, and adapt to changing priorities\n<br><br>\nAbility to solve problems and identify solutions\n<br><br>\nAbility to work effectively with individuals at all levels of the organization\n<br><br>\nKnowledge and technical proficiency in specialty areas assigned within the laboratory\n<br><br>\nKnowledge of infection prevention policies and procedures\n<br><br>\nKnowledge of local, state and federal regulatory requirements related to areas of functional responsibility\n<br><br>\nPhysical Requirements and Working Conditions\n<br><br>\nThe Physical Requirements and Working Conditions in which the job is typically performed are available from the\n<br><br>\nOccupational Health Department. Reasonable accommodations will be made to enable individuals with disabilities to\n<br><br>\nperform the essential functions of the job.\n<br>"}