{"job title": "Data Scientist", "company": "Stanley Black &amp; Decker", "city state": "– Hartford", "rating": "3.4", "job description": "<strong>Title</strong>\n<br>\nData Scientist\n<br><br>\n21-Sep-2018\n<br><br>\n<strong>Business</strong>\n<br>\nUS - Corporate\n<br><br>\n<strong>State / Country / Province</strong>\n<br>\nConnecticut\n<br><br>\n<strong>Job Description</strong>\n<br>\nStanley Black &amp; Decker is looking for an experienced Data Scientist to join their Advanced Manufacturing Center of Excellence team. Since 1843, Stanley Black and Decker has been committed to innovation and social responsibility, while becoming a leader in multiple industries. In this position, one can expect to use their expertise in big data and data collection to lead others to solve critical business problems.\n<br><br>\nStanley Black &amp; Decker has created this state of the art manufacturing incubator to accelerate its global Industry 4.0 “smart factory” initiative across the entire organization. The 23,000-square foot facility will serve as a hub for the latest advancements in IoT, cloud computing, artificial intelligence, 3-D printing, robotics and advanced materials. This team will set the overall vision and strategy for the company’s Industry 4.0 initiative and supply the resources and expertise necessary to serve as the epicenter for the latest technologies and processes with respect to Industry 4.0.\n<br><br>\nTo learn more about Industry 4.0 and Stanley Black and Decker’s vision, visit:\n<br>\nhttp://ir.stanleyblackanddecker.com/phoenix.zhtml?c=114416&amp;p=irol-newsArticle&amp;cat=news&amp;id=2321207.\n<br><br>\n<strong><u>Responsibilities, Competencies and Experience</u></strong>\n<br>\n<strong>Responsibilities include:</strong>\n\n<ul>\n<li>Leveraging big data to discover patterns and solve strategic &amp; tactical business problems using massive structured and unstructured data sets across multiple environments</li><li>Developing analytic capabilities (e.g. models and processes) that drive better outcomes for both customers and the company</li><li>Driving the collection, cleansing, processing and analysis of new and existing data sources.</li><li>Building, testing, and deploying predictive models and/or machine learning algorithms on large static and/or streaming data sets</li><li>Reporting findings by creating useful and appropriate data outputs and visualizations tailored for the intended audiences</li><li>Learning &amp; staying current on Internet of Things developments, news, opportunities, and challenges</li><li>Generating innovative ideas, establish new research directions, shape and execute the information strategy in support of technical projects and new product developments</li><li>Working with and supporting other team members, management, and partners</li>\n</ul>\n\n<strong>Required experience and skill include:</strong>\n\n<ul>\n<li>Data science advanced degree in a relevant technical field with 2+ years’ experience in related data science, analytics, and model building roles or 5+ years’ experience in directly related roles</li></ul>\n\n<ul>\n<li>Experience working with large complex data sets, real time/near real time analytics, and distributed big data platforms (Hadoop &amp; MapReduce and/or Cassandra/Spark)</li><li>Strong practical knowledge of analytical techniques and methodologies such as machine learning/supervised and unsupervised techniques, segmentation, mix and time series modeling, response modeling, lift modeling, experimental design, neural networks, data mining and optimization techniques</li><li>Strong knowledge of analysis tools such as Python, R, MATLAB, Spark or SAS. R/Spark on Hadoop or Cassandra preferred.</li><li>Strong background in applying statistical machine learning techniques to predictive modeling and experience with Machine Learning libraries (via R, H2O, Python, Spark, etc)</li><li>Proficiency in programming in Python, R, SQL, Javascript, Java/Scala/Ruby and shell scripting</li><li>Proficiency in consuming REST based API (with JSON payload) is a plus.</li><li>Fluency in big data platforms including Hadoop, MapReduce, Hive, Spark, PIG</li><li>Familiarity with Cloud based HaaS/PaaS solutions such as AWS EMR, MS Azure.</li><li>A strong understanding of data profiling and data cleansing techniques</li><li>Natural curiosity and a strong passion for empirical research and problem solving</li><li>Strong written and verbal communications skills; comfortable communicating with senior levels of both business and technology leadership</li>\n</ul>\n\n<strong>Competencies include:</strong>\n\n<ul>\n<li>Statistical Analysis &amp; Modeling</li><li>Understanding Business Problems</li><li>Data Wrangling &amp; Exploration</li><li>Problem Solving Mindset</li><li>Clear Communication</li><li>Technical Fluency</li>\n</ul>\n\n<strong><u>The Company</u></strong>\n<br>\nFor the builders and protectors, for the makers and explorers, for those shaping and reshaping our world through hard work and inspiration. Since 1843, Stanley Black &amp; Decker has provided the tools and innovative solutions to propel people to their goals. They collaborate with one goal in mind: empower people to do better, safer, more significant work. They define success as: delivering value to their customers, colleagues and communities. Their commitment to quality, safety and sustainability keeps them focused on their path to becoming the type of uniquely human-centered global industrial company that keeps every stakeholder in mind, while being “For Those Who Make The World”.\n<br><br>\nStanley Black &amp; Decker, an S&amp;P 500 and FORTUNE 500 company, is the world's leading provider of tools and storage, the world's second-largest commercial electronic security company, and a leading engineered fastening systems provider, with unique growth platforms in the Oil &amp; Gas and Infrastructure industries. With industry elite partners such as DEWALT, Porter-Cable, Craftsman, Bostitch, Lenox, and more: Stanley Black &amp; Decker provides to the tools to build the world.\n<br><br>\nLearn more about Stanley Black &amp; Decker at http://www.stanleyblackanddecker.com/.\n<br><br>\n<strong>Requisition Number</strong>\n<br>\n<strong>56989BR</strong>\n<br><br>\n<strong>City</strong>\n<br>\nHartford\n<br><br>\n<strong>EEO Statement</strong>\n<br>\nAll qualified applicants to Stanley Black &amp; Decker are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran’s status or any other protected characteristic.\n<br>"}