{"job title": "Data Scientist", "company": "Standard Bank Group", "city state": "– Rosebank", "rating": "3.9", "job description": "<div>\nJob Details</div><br>\n\n <div>Standard Bank is the largest bank in Africa and our highly visible brand, award-winning service, and strong global presence helps us maintain our market-leading position. We place huge value on the talent of our people to drive our continued success, and to support our plans for growth. We now need a talented and resourceful individual to help us fulfill our business objectives and build customer loyalty.<br><br>Job Purpose<br><br>Follow the customer along the path of the data. Through a scientific approach you will find the customer in their financial journey and derive meaning by recognizing the unspoken voice that is captured in the data.<br><br>Key Responsibilities/Accountabilities<br><br>You will develop and build models that can drive actionable and executable data-driven recommendations from the use-cases that is co-created through the strategic themes and build within the context of Personalisation’s key focus areas. You will drive the productionalization of ML use-cases within Personalization and will maintain these over its life. You will constantly strive to enhance and improve the models through thorough and rigorous testing to constantly improve customer experience. Being a team player will allow you to learn fast and also to put forward recommendations.<br><br>Preferred Qualification and Experience<br><br>Post Graduate Degree in the STEM fields: Science, Technology, Engineering or Mathematics.\n<br>\nResearch in advance Statistical, Mathematical, Algorithmic, Machine Learning applications or strong portfolio of evidence i.e. rankings on open topic hackathons.\n<br>\n3-7 years experience in driving data driven decisions through quantitative modelling and advance analytics and machine learning techniques.\n<br>\n1-2 years experience in open source programming tools applied on big data platforms using distributed computational technologies.\n<br>\nProven track record in driving value through supervised and unsupervised ML techniques on both structured and unstructured data.<br><br>Knowledge/Technical Skills/Expertise<br><br>Advance Programming using Python, SAS Miner, C#, Java, Scala, SQL for productionalization of code.\n<br>\nStrong collaboration ability using tools like Bitbucket, Confluence and an understanding of tools like Jira.\n<br>\nGood understanding of Hadoop, Hive, Spark for distributed computing, seasoned in Data Lakes and Warehouses.\n<br>\nStrong visualization ability – Power BI, Tableau, D3, Qlikview.\n<br>\nAdvance understanding of ML libraries.</div>"}