{"job title": "Data Scientist", "company": "Staples, Inc.", "city state": "– Framingham, MA", "rating": "3.1", "job description": "<strong>Description</strong><br><br>The Data Scientist is responsible for applying machine learning techniques to drive innovation for Staples Digital Solutions. This position involves a combination of R&amp;D and consultative activities. The successful candidate will have an opportunity to directly impact strategic planning and future directionality of core technologies and data science services at Staples.\n<br><br>\n<strong>Primary Responsibilities</strong>\n\n<ul>\n<li>Partner with Business Units, Product Development, and Product Management teams to identify and work on high-impact projects utilizing big data analytics and machine learning techniques</li> \n\n<li>Research new ways for segmenting, ranking, and modeling behavior of customers</li> \n\n<li>Evaluate, validate, and optimize existing algorithms and provide recommendations to Business</li> \n\n<li>Provide guidance on analytics and data science initiatives across analytics teams, contractors, and vendors</li> \n\n<li>Communicate inter-departmentally, acting as a conduit between strategy and implementation</li> \n</ul>\n\n<strong>Qualifications</strong><br><br><strong>Required Skills</strong>\n\n<ul>\n<li>MS in Data Science or Statistics, or a minimum 3 years of experience in the field</li> \n\n<li>Minimum 1 year of experience with data mining, machine learning, and statistical modeling</li> \n\n<li>Minimum 1 year of programming experience in one of the languages like Python/R</li> \n\n<li>Minimum 1 year of relevant work experience in advanced analytics space</li> \n\n<li>Excellent communication skills Strong presentation abilities</li> \n</ul>\n<strong>Preferred Skills</strong>\n\n<ul>\n<li>Experience with Hadoop Experience with SQL</li> \n\n<li>Demonstrated leadership experience</li> \n</ul>\n\n<em>Staples is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other basis protected by federal, state, or local law.</em>"}