{"job title": "Scientist I", "company": "State of Virginia", "city state": "– Richmond, VA", "rating": "3.9", "job description": "The Department of General Services is seeking a qualified applicant to provide support in the Drugs of Abuse (DAU) testing section within the Division of Consolidated Laboratory Services (DCLS). The DAU testing section offers secure, reliable, and cost-effective drug testing to state agencies with the goal of promoting public safety. The screening of urine for different drugs and metabolites at DCLS is performed using an enzyme multiplied immunoassay technique (EMIT) which screens for the presence of the different drug targets. If detected, the laboratory may perform gas chromatography/mass spectrometry (GC/MS) for confirmation of the specific drug detected. The candidate will be responsible for some accessioning, receiving, and processing of human samples for analysis; performing routine testing and documentation of analyses performed; performing defined quality control procedures, preparing and testing reagents, maintaining accurate records, maintaining a supply of inventory and troubleshooting and/or maintenance of equipment. Duties may include assisting with development and validation of new methods. The selected candidate must pass a background security clearance check.\n<br><br>\n<strong>Minimum Qualifications</strong>\n<br><br>\nThe applicant must possess at least a Bachelor of Science degree in chemistry, toxicology, biology or a closely related field. The successful applicant must demonstrate knowledge of or experience with enzyme immunoassay testing, GC/MS methods, and chemical extractions. The applicant must be able to demonstrate effective verbal and written communication skills. The qualified candidate must work well with others within a team atmosphere. The selected applicant must have the ability to lift up to 30 pounds.\n<br><br>\nPreferred Qualifications\n<br><br>\nExperience conducting moderate or high complexity testing in a chemistry, toxicology or clinical lab is preferred. Other preferred skills include experience with LC/MS/MS methods, complex computer interfaced instrumentation and equipment/computer maintenance and troubleshooting; data formulation, computation, analysis, and interpretation; attention to detail; and organization. Knowledge of CAP, CLIA and SAMHSHA accreditation; laboratory quality assurance, lab documentation; and lab safety is preferred.\n<br><br>\nSpecial Requirements\n<br><br>\nIn order to comply with OSHA blood-borne pathogens requirements, DCLS offers the Hepatitis B vaccine. The vaccine will be provided by the employer. Sponsorship will not be provided for this position. Applicants that indicate they have preferential hiring rights in the form of a yellow form or blue card must submit these to our office prior to the closing of the posting, in accordance with DHRM policy 1.30. Please note that only current and former employees of the Commonwealth of Virginia that will be or have been laid off are eligible for preferential hiring rights. The selected candidate must pass a fingerprint-based criminal background check."}