{"job title": "Policy/Data Analyst", "company": "State of South Dakota", "city state": "– Pierre, SD", "rating": "3.2", "job description": "Job ID: 11075\n<br><br>\nAgency: Department of Social Services; Division of Economic Assistance\n<br><br>\nSalary: $20.21 - $21.50 per hour; depending on experience\n<br><br>\nPay Grade: GI\n<br><br>\nClosing Date: Open Until Filled\n<br><br>\nFor more information on the Department of Social Services, please visit https://dss.sd.gov/.\n<br><br>\nWhy the Department of Social Services?\n<br><br>\nAt the Department of Social Services (DSS), family is everything. It's the foundation of what we do every day through provision of services to strengthen and support the citizens of South Dakota. Our work is driven with our vision to build Strong Families, South Dakota's Foundation and Our Future.. Sound intriguing?\n<br><br>\nAs a Department of Social Services employee, you will have a chance to experience:\n\n\n<ul>\n<li>Creativity - We are always looking for innovative ideas to help us achieve improved outcomes.</li>\n<li>Making a difference- You will have an opportunity to make a difference in the life of fellow South Dakotans.</li>\n<li>Professional development - We provide valuable trainings to ensure well-trained staff that is competent, accountable and empowered and will assist you in reaching your career goals.</li>\n</ul>\n\n<strong>Who we want:</strong>\n\n\n<ul>\n<li>a highly motivated and experienced person with a passion for serving the public and displays a high level of effort and commitment towards completing assignments and goals;</li>\n<li>a compassionate individual who listens attentively to others and clearly conveys information and ideas;</li>\n<li>a dependable and organized individual who effectively plans and organizes work activities;</li>\n<li>a person who is dedicated and who will represent the Department of Social Service with integrity and enthusiasm;</li>\n<li>an individual who works cooperatively with others and promotes a friendly work climate in order to achieve shared goals.</li>\n</ul>\n\n<strong>What you will do:</strong>\n<br><br>\nWe are currently looking to hire an individual who is excited to serve the public. The qualified applicant will fill a job opening available within the Division of Economic Assistance, our team that promotes the well-being of lower income families, children, people with disabilities and elderly South Dakotans. Develops and applies research techniques in the collection, analysis, and reporting of data or information to be used by management in assessing operations and for planning purposes.\n<br><br>\n<strong>Duties include:</strong>\n\n\n<ul>\n<li>gathering and analyzing information/data and managing data systems to provide management with necessary data to make decisions and implement or modify programs/operations;</li>\n<li>research state and federal requirements and ensures data systems meet those requirements;</li>\n<li>review and makes changes to data reporting instruments;</li>\n<li>investigate and resolves problems with data;</li>\n<li>provide data and reports to others;</li>\n<li>determine the need for and requests programming changes to data systems;</li>\n<li>analyzing data for quality assurance purposes;</li>\n<li>develop and maintains a process and procedure to sample cases for review;</li>\n<li>recommends strategies for corrective actions;</li>\n<li>identifies problem areas and negative trends;</li>\n<li>discusses review findings with management and assists in developing a corrective action plan and monitors its implementation;</li>\n<li>makes recommendations to improve case management services;</li>\n<li>conducts annual reviews for compliance with program performance standards;</li>\n<li>evaluates and prepares reviews of documents, reports, and plans to address concerns and presents findings;</li>\n<li>works on special projects to deal with concerns or needs of an agency.</li>\n</ul>\n\nSuccessful applicant(s) will be required to undergo a background investigation. An arrest/conviction record will not necessarily bar employment.\n<br><br>\n<strong>The Ideal Candidate Will Have:</strong>\n<br><br>\nA Bachelor's degree in a related field is preferred.\n<br><br>\n<strong>Knowledge of:</strong>\n\n\n<ul>\n<li>the data collection process;</li>\n<li>data analysis techniques;</li>\n<li>research or survey methodology;</li>\n<li>applicable computer software and operating systems.</li>\n</ul>\n\n<strong>Ability to:</strong>\n\n\n<ul>\n<li>deal tactfully with others;</li>\n<li>communicate clearly and concisely;</li>\n<li>prepare study outlines and proposals for projects;</li>\n<li>collect and compile data using scientific processes;</li>\n<li>analyze and interpret data or findings using statistical processes or analytical tests;</li>\n<li>present the results of research and analysis in various forms;</li>\n<li>establish and maintain effective working relationships with others;</li>\n<li>interpret and apply laws, rules, policies, and procedures;</li>\n<li>create progress reports and final reports;</li>\n<li>recommend solutions to address short- and long-term needs;</li>\n<li>seek out creative solutions;</li>\n<li>analyze and evaluate operational situations and complex federal regulations.</li>\n</ul>\n\nEqually important will be a strong work ethic and the comprehension of critical thinking and problem solving techniques. If you believe in strengthening and supporting strong families and investing in South Dakota's future, you may have found the dream job you've been waiting for!\n<br><br>\n<strong>VETERANS' PREFERENCE ELIGIBLE</strong>\n<br><br>\nThe State of South Dakota does not sponsor work visas for new or existing employees. All persons hired will be required to verify identity and eligibility to work in the United States and complete an Employment Eligibility Verification, Form I-9.\n<br><br>\nThe State of South Dakota offers paid employee health insurance plus ten paid holidays, generous vacation leave accrual, and medical, dental, vision, and other benefits. For more information visit http://bhr.sd.gov/workforus/workbenefits.aspx. This position is a member of Class A retirement under SDRS.\n<br><br>\nApply at: http://tinyurl.com/ydelvdhe\n<br><br>\nSouth Dakota Bureau of Human Resources\n<br><br>\n500 East Capitol\n<br><br>\nPierre, SD 57501-5070\n<br><br>\nTelephone: 605.773.3148 Fax: 605.773.4344\n<br><br>\n\"An Equal Opportunity Employer\""}