{"job title": "Bioanalytical Development, Mass Spectrometry Scientist", "company": "State of North Carolina", "city state": "– Raleigh, NC", "rating": "3.4", "job description": "Description of Work\n<br><br>\nSave Lives and Create Futures with our Mass Spectrometry team in the Newborn Screening (NBS) unit. The NBS unit's primary purpose is to provide timely and accurate testing for North Carolinians to identify potentially life-threatening conditions in newborns.\n<br><br>\nThis newly created position will work with the Tandem Mass Spectrometry (MS/MS) Laboratory of the Newborn Screening Unit of the State Laboratory of Public Health. The primary purpose of the MS/MS laboratory is to perform biochemical analyses of dried blood spot specimens to detect Fatty Acid Oxidation Disorders, Organic Acid Disorders, Amino Acid Disorders and Lysosomal Storage Disorders in newborns.\n<br><br>\nThe Mass Spectrometry and Bioanalytical Development Scientist's primary purpose is to provide professional and technical direction for method development and implementation, quality assurance, staff training, and problem resolution of clinical chemistry testing associated with metabolic disorders detected during newborn screening. This position is responsible for the development and performance of advanced laboratory testing technologies, such as second tier mass spectrometry and HPLC-MS to characterize human biochemical response to metabolic disorders and reduce false positive rates. The incumbent will independently perform highly complex and unusual analytical procedures to separate and purify organic molecules.\n<br><br>\nThis position will report to the NBS Unit Manager and is responsible for overseeing method development and technology transfer for the Tandem Mass Spectrometry Laboratory. The clinical chemistry assays utilized are typically laboratory developed tests that require advanced training and experience.\n<br><br>\nDuties include, but are not limited to:\n\n\n<ul>\n<li>Evaluating available mass spectrometric and High-Performance Liquid Chromatography (HPLC) methods</li>\n<li>Performing applied research to optimize the detection of a variety of analytes from dried bloodspots (DBS)</li>\n<li>Publishing scientific data and findings in relevant high impact journals</li>\n<li>Attending scientific meetings, seminars, and conventions to keep informed about latest developments in technology and the field of newborn screening and clinical chemistry</li>\n<li>Developing technical training programs to meet laboratory needs, including determining training objectives and identifying resources</li>\n<li>Assisting with the preparation of specifications for new instrument acquisition</li>\n<li>Advising and consulting with laboratory management on purchase of analytical instrumentation and implementation of new technology</li>\n<li>Establishing quality control and assurance measurements and records for clinical chemistry testing procedures and processes</li>\n<li>Collaborating with universities and other institutions on various data mining and study projects to enhance the testing program</li>\n</ul>\n\nThis position will work an occasional Saturday and state holiday to maintain turn-around times for testing.\n<br><br>\nSalary Grade: GN14\n<br><br>\nRecruitment Range: $51,895 to $70,780\n<br><br>\nPosition: 65028224\n<br><br>\nExam Plan: 18-11598\n<br><br>\nAbout the Division of Public Health and the State Laboratory of Public Health\n<br><br>\nThe NC Division of Public Health (DPH) works to promote and contribute to the highest possible level of health for the people of North Carolina Everywhere, Everyday, Everybody.\n<br><br>\nAt the State Laboratory of Public Health (NCSLPH), we provide medical and environmental laboratory services such as testing, consultation, and training, to public and private health provider organizations responsible for the promotion, protection, and assurance of the health of North Carolina citizens. The NCSLPH serves the entire state as a reference laboratory for difficult, unusual, or otherwise unavailable laboratory procedures and assist in the development, evaluation, and standardization of medical and environmental laboratory testing procedures. We provide training and consultation to improve and assure quality services in other laboratories and certify milk and water laboratories and milk analysts. Visit our website at http://slph.ncpublichealth.com to learn more.\n<br><br>\nCampus Amenities and Benefits at the State Laboratory of Public Health\n<br><br>\nWe are located in Raleigh, NC. According to Forbes, we are ranked as one of the top 20 best places to retire and the 2nd most educated city in the country. US News &amp; World ranks Raleigh among the top 15 places to live in the U.S.\n\n\n<ul>\n<li>220,000 square feet state-of-the-art facility</li>\n<li>Plentiful Free Parking</li>\n<li>Easy access to highways (70, 40 and 440), NC Museum of Art, Umstead State Park, healthcare providers, and shopping centers</li>\n<li>Proximity to globally and nationally ranked universities (NC State, UNC-Chapel Hill, Duke)</li>\n<li>Fitness area with exercise equipment, classes, and wellness activities</li>\n<li>Patio Dining with Umbrellas</li>\n<li>Weekly Food Trucks, including Double Food Truck Fridays</li>\n<li>Car Cleaning and Detailing Services On-site bimonthly</li>\n<li>Annual Flu Shot Clinic for Employees and Families</li>\n<li>Monthly and quarterly career development classes, including opportunities for traveling</li>\n<li>Library of academic journals and materials on-site</li>\n<li>Employee Engagement and Staff Development Activities</li>\n<li>NCSLPH Employee Recognition Programs</li>\n<li>State Health Plan and State of NC Employee Benefits</li>\n</ul>\n\nKnowledge, Skills and Abilities / Competencies\n<br><br>\nTo receive credit for all of your work history and credentials, you must list the information on the application form. Any information listed under the text resume section or on an attachment will not be considered for qualifying credit. Qualified candidates must document on the application that they possess all of the following:\n\n\n<ul>\n<li>Must meet federal CLIA '88 requirements for a technical supervisor in a high complexity laboratory. Candidates must attach a copy of their transcript(s) and/or certification(s) in order to be considered.</li>\n<li>Comprehensive knowledge of genetics, protein chemistry and clinical chemistry analyses.</li>\n<li>Thorough knowledge of the principles and procedures used in the fields of clinical chemistry including High Pressure Liquid Chromatography (HPLC), Mass Spectrometry (MS), LC-MS/MS and small molecular quantitation, inherited autosomal recessive disorders and genomics.</li>\n<li>Basic knowledge of certain newborn screening disorders and the tests used to diagnose them.</li>\n<li>Working knowledge of statistical methods and computer applications.</li>\n<li>Thorough theoretical and applied technical knowledge necessary for troubleshooting equipment, interpretation of test results, and modification of procedures in response to specific situations.</li>\n<li>Must have broad knowledge of the hazards of working with potentially infectious materials and the appropriate safety precautions and management practices to avoid infections or releases.</li>\n<li>Must be able to conduct independent research and develop procedures, methods and training materials and have the ability to implement necessary changes with management approval.</li>\n<li>Capable of understanding and accurately following complex oral and written instructions and of reading technical materials.</li>\n<li>Ability to communicate effectively to small and large groups.</li>\n<li>Must demonstrate excellent organization skills allowing the coordination of multi-faceted test procedures.</li>\n<li>Must have a thorough knowledge of sound quality assurance practices and principles.</li>\n</ul>\n\n<strong>Management Preferences:</strong>\n\n\n<ul>\n<li>Post-graduate experience and advanced training in mass spectrometry</li>\n<li>Doctorate degree in analytical chemistry, molecular biology, medical genetics, microbiology, immunology or a related field</li>\n<li>Thorough knowledge of the literature related to tests performed in the laboratory</li>\n<li>Working knowledge of epidemiology and public health laboratory practice</li>\n<li>Ability to express oneself clearly, concisely, and professionally in verbal and written communication, including the ability to articulate complex information accurately and clearly to physicians and other health care personnel</li>\n</ul>\n\n<strong>Physical Requirements:</strong>\n\n\n<ul>\n<li>An occupational medical assessment may be required to determine your ability to safely work with biological, chemical, or radiological hazards.</li>\n<li>This position may also require periodic medical screenings to confirm safety practices are effectively preventing occupational injury or illness. All costs associated with obtaining occupational health services are covered by NCSLPH.</li>\n<li>Ability to perceive colors normally and for any eyesight deficiencies to be correctable</li>\n<li>Average physical/manual dexterity, as the testing equipment requires physical coordination</li>\n</ul>\n\nMinimum Education and Experience Requirements\n<br><br>\nDoctoral degree in in molecular biology, medical genetics, microbiology, immunology or analytical chemistry or a related field from an appropriately accredited institution and two years of clinical laboratory or research experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nMaster's degree in any of the above fields from an appropriately accredited institution and five years of clinical laboratory or research experience\n<br><br>\n<strong>OR</strong>\n<br><br>\nan equivalent combination of education and experience.\n<br><br>\nSupplemental and Contact Information\n<br><br>\nThe Department of Health and Human Services (DHHS) selects applicants for employment based on job-related knowledge, skills, and abilities without regard to race, color, gender, national origin, religion, age, disability, political affiliation or political influence. Pre-Employment criminal background checks are required for some positions.\n<br><br>\nDivision of Public Health (DPH) main locations, including their grounds, are tobacco-free as outlined in the Tobacco-free Campus Policy. All tobacco products, including e-cigarettes, e-hookahs, \"vape products\" and all smokeless tobacco products, may not be used in the indicated areas. For more information, please see the policy and FAQ posted here: http://publichealth.nc.gov/employees/\n<br><br>\nDue to the volume of applications received, we are unable to provide information regarding the status of your application over the phone. To check the status of your application, please log in to your account. You will either receive a call to schedule an interview or an email notifying you when the job has been filled.\n<br><br>\nFor technical issues with your application, please call the NeoGov Help Line at 855-524-5627. Applicants will be communicated with via email only for updates on the status of their application. If there are any questions about this posting other than your application status, please contact HR, 919-707-5450."}