{"job title": "Data Scientist", "company": "Steward Health Care System", "city state": "– MA", "rating": "2.5", "job description": "\n<br><br>\n<strong>Description</strong>\n<br><br>\nA rare opportunity to join the development division within Information Systems at Steward Health Care, the top leader in the competitive for-profit hospital industry. We are seeking a motivated and experienced Data Scientist to contribute to the software development initiatives that improve the quality of health care across the country. This individual will be working with programmers, analysts and senior level management to optimize the development process within the enterprise by expanding our existing predictive analytics field.\n<br><br>\n<strong>Key Responsibilities</strong>\n\n<ul>\n <li>Conduct research and build actionable visualizations that drive decisions.</li> <li>Collect data required to extract actionable insights.</li> <li>Work with the subject matter experts and key stakeholders to understand end goals for enhancements and new predictive tools.</li> <li>Values critical thinking and has the ability to solve complex problems with incomplete data and a genuine curiosity.</li>  <li>Contribute to the team's overall knowledge by educating colleagues and peers about new functionality and upcoming tools applicable to data science.</li>  <li>Ability and willingness to adapt quickly to changing priorities and requests.</li>\n</ul>\n\n<strong>Skills/Experience</strong>\n\n<ul>\n <li>2+ years of experience in a data scientist role.</li> <li>Can solve business problems using data analytics and big data and data lake technologies.</li> <li>Basic python programming experience at the minimum.</li> <li>Familiar with machine learning and modeling capabilities.</li>  <li>Knowledge of tools required to extract, transform, and visualize big data.</li>  <li>Understanding of the Agile Software Development principles and practices a plus.</li>\n</ul>\n\n<strong>Job Relationship</strong>\n<br><br>\nThe Data Scientist reports to the Development Director."}