{"job title": "Data Scientist - Merch Scenarios", "company": "Stitch Fix", "city state": "– San Francisco, CA", "rating": "3.3", "job description": "<strong>About the Team &amp; Role</strong><br><br>At Stitch Fix, our data science team combines artificial intelligence together with expert-human judgment to generate innovative recommendations and insights that help our clients look and feel their best.\n<br><br>\nAs a member of a nimble, collaborative team within Merch Algorithms, you'll build tools and algorithms that shape the future of personalized merchandising at Stitch Fix. You'll answer questions like: Should Stitch Fix carry this shirt next season? If we carry this collection of shirts, will we be increasing our risk exposure or hedging our bets? What data-driven tools should our in-house team of expert merchants use to make these decisions, which form the foundation of our solid business growth and delightful client experience?\n<br><br>\nThis is a true \"full-stack data science\" role where you can grow as a data scientist, engineer, and designer. You'll get the opportunity to bring your ideas to life, and you'll be supported by bright, kind teammates on Algorithms and Data Platform.<br><br><strong>You're excited about this opportunity because you will</strong>\n\n\n<ul>\n<li>Build production web apps that improve how merchandisers make decisions and manage risk.</li> \n\n<li>Innovate on algorithms that optimize our merchandise portfolio.</li> \n\n<li>Partner across the business to make an impact on our bottom line and our client experience.</li> \n\n<li>Contribute to a culture of technical collaboration and scalable development.</li> \n</ul>\n\n<strong>We're excited about you because</strong>\n\n\n<ul>\n<li>You have experience working collaboratively in the modern web ecosystem.</li> \n\n<li>You have experience finding creative uses for the toolkits of financial engineering, operations research, optimization, etc (with desire to grow as a DS/ML generalist).</li>\n<li>You are generous with your ideas and experience, and eager to seek the ideas and experience of others.</li> \n\n<li>You believe that things are rarely black and white; there are multiple good paths to follow, and multiple valuable perspectives to consider.</li> \n\n<li>You believe that working is better than perfect, and innovative is better than incremental.</li> \n\n<li>You have a relevant degree and relevant industry experience.</li>\n</ul>\n\n<strong>Why you'll love working at Stitch Fix...</strong>\n\n\n<ul>\n<li>We are a group of bright, kind and goal oriented people. You can be your authentic self here, and are empowered to encourage others to do the same!</li> \n\n<li>We are a successful, fast-growing company at the forefront of tech and fashion, redefining retail for the next generation</li>\n<li>We are a technologically and data-driven business</li>\n<li>We are committed to our clients and connected through our vision of \"Transforming the way people find what they love\"</li>\n<li>We love solving problems, thinking creatively and trying new things</li>\n<li>We believe in autonomy &amp; taking initiative</li>\n<li>We are challenged, developed and have meaningful impact</li>\n<li>We take what we do seriously. We don't take ourselves seriously</li>\n<li>We have a smart, experienced leadership team that wants to do it right &amp; is open to new ideas</li>\n<li>We offer competitive compensation packages and comprehensive health benefits</li>\n<li>You will be proud to say that you work for Stitch Fix and will know that the work you do brings joy to our clients every day</li>\n</ul>\n\n<strong>About Stitch Fix</strong>\n<br><br>\nStitch Fix is redefining retail shopping using a unique blend of art and science to deliver a deeply personalized service to our customers. This novel juxtapositionat once analytic and artistic, technical and adventurousattracts an extraordinary collection of talented people who are both thinkers and doers. Our diverse workforce has catalyzed enormous company growth over the past three years in terms of customer satisfaction and service efficacy. We'd love for you to help us carry on the trend."}