{"job title": "Data Scientist", "company": "Strata Decision Technology", "city state": "– Chicago,IL", "rating": "3.7", "job description": "Here @Strata…<br><br>We are committed to our mission to help heal healthcare. Our unique culture is driven by a social, hardworking environment full of talented people solving problems together. We embrace learning, cross-team collaboration, and continuous career growth. Lifting each other to lift our clients, our product, our company. If being part of a fun, fast-moving, innovative team is what you seek? Keep reading.<br><br>We look for someone who:\n\n<ul>\n<li><strong>Is Service-Centric:</strong> Someone who desires to make an impact in and outside of our office. We look for service minded people to support our customers, each other and our community.</li><li><strong>Has a Growth Mindset:</strong> Driven to own your individual learning and development (We’ll help you - we have a team dedicated to training you and providing extra educational resources).</li><li><strong>Rocks Impact</strong>: Thinks two steps ahead to ensure the work we do will solve problems and make a difference.</li><li><strong>Will be a StrataPro:</strong> Accountable. Prepared. Positive. Core to who we are and how we treat one another.</li>\n</ul>\n\nWhat you’ll do in this role:<br><br>As a Data Scientist, you will have the opportunity to work with many of the nation’s leading healthcare providers in utilizing their financial, operational, and clinical data to drive their mission of providing world-class care while improving financial health. Your work will bring new insights to individual clients, client collaboratives and the industry.\n<ul>\n<li>Applying data mining techniques and statistical analysis to healthcare and financial data across our customer base</li><li>Consulting and building the ideal data environment that will enable data insights to go from single reports to fully integrated modules within StrataJazz, our“Best in KLAS” enterprise SaaS solution</li><li>Working with product and data integration teams to understand how best to utilize data resources</li><li>Building training and“gold standard” testing databases</li><li>Selecting features, building and optimizing classifiers using machine learning techniques</li><li>Extending company’s data with third party sources of information when needed</li><li>Enhancing data collection procedures to include information that is relevant for building analytic systems</li><li>Processing, cleansing and verifying the integrity of data used for analysis</li><li>Conducting ad-hoc analysis and presenting results in a clean, clear and actionable manner</li><li>Creating automated anomaly detection systems and constant tracking of its performance</li>\n</ul>\n\n<strong>Your accomplishments include:\n<br>\n</strong>\n\n<ul>\n<li>A Master’s degree or foreign equivalent in: Applied Mathematics, Statistics, Economics or Engineering</li><li>4-6 years experience using statistical data analysis techniques on projects within healthcare and/or finance</li><li>Expertise in translating strategic questions into tactical work plans and outputs</li><li>Experience working with large, complex data sets, normalizing and building training sets and models</li><li>Using advanced machine learning techniques to combine and compare large data sets</li><li>Ability to install and configure tools needed for analysis of large data sets</li><li>Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naïve Bayes, SVM, Decision Forests, etc.</li><li>Experience with common data science toolkits, such as R, Python, Weka, MatLab, etc.</li><li>Experience with text mining and Natural Language Processing algorithms</li><li>Ability to present results of analysis to differing audiences within healthcare on both the financial and clinical side (CFO, CEO, CMIO, Physicians, etc)</li><li>Experience with data visualization tools, such as D3.js, GGplot, etc.</li><li>Proficiency in using query languages such as SQL, Hive, Pig</li><li>Experience with NoSQL databases, such as MongoDB, Cassandra, HBase</li><li>Strong applied statistics skills, such as distributions, statistical testing, regression, etc.</li><li>Strong scripting and programming skills</li><li>Data-oriented personality</li><li>Ability to travel up to 10%</li>\n</ul>"}