{"job title": "Data Scientist", "company": "Stratagem Group", "city state": "– Alexandria, VA", "rating": "3.9", "job description": "<div> Are you interested in supporting the ever-changing technology needs of the U.S. Government by providing services that support defense initiatives? Come look at <strong>Stratagem,</strong> where we help the U.S. Government solve some of the most difficult and fun problems in the world.\n<br><br>\n<strong>Stratagem</strong> is hiring motivated, creative, and technically-minded individuals with a passion and skill for building the state-of-the-art in emerging technologies. We understand that candidates may not be able to check the boxes for all desired qualifications, but what is most important to us at Stratagem is that candidates have exceptional problem-solving skills, creative out-of-the-box thinking, and comfort with quickly learning, evaluating, and deploying new technologies. Successful employees are self-starters, excellent communicators and positive individuals with a passion for delivering uncompromising quality products.\n<br><br>\n<strong>** TS – SSBI Required **</strong>\n<br><br>\nThis is a data scientist position in Alexandria, VA and we are not hiring your average Java Joe’s. We’re looking for the Americano with a double pump. You will be given substantial feature ownership, and we'll expect you to contribute product ideas as well as occasional code. Your ideas will help shape the future of <strong>Stratagem</strong>.\n<br><br>\n<strong>Responsibilities &amp; Skills</strong>\n<br>\nOur ideal candidate is a data scientist with a love for learning, the ability to pivot directions quickly, and someone with a conceptual understanding application development. You should love manipulating data, running statistical analysis, and getting your hands dirty by working in a multitude of environments.\n<br>\nAs a data scientist, your responsibilities include:\n\n\n<ul>\n\n\t<li>Integrating with a diverse team to deliver in an agile-like manner</li>\n<li>Using statistics tools to analyze data</li>\n<li>Understanding and modeling the relationship between different metrics to identity key insights</li>\n<li>Identifying opportunities for data science products</li>\n<li>Consulting with developers to run tests and algorithms</li>\n</ul>\n\n<strong>Your core skills/experience include:</strong>\n\n\n<ul>\n\n\t<li>Expertise in one of the following: R, Python, Java, or Scala</li>\n<li>Working in a software development environment</li>\n<li>Expertise at data mining and analysis for structured and unstructured data</li>\n<li>Ability to produce data visualizations on findings</li>\n<li>Minimum of 6 years’ experience or 4 with a Master’s degree</li>\n<li>You are the proud owner of a TS/SCI SSBI clearance or you can be granted one</li>\n</ul>\n\nBonus points if you have experience in any of the following:\n\n\n<ul>\n\n\t<li>Experience with systems like Hadoop and Spark</li>\n<li>Bachelor Degree in Data Science, Statistics, Mathematics, Computer Science, or related discipline or equivalent business experience in a professional service related to Big Data</li>\n<li>DevOps experience</li>\n</ul>\n\n<strong>About you</strong>\n<br>\nYou are an exceptional problem solver, a quick learner, and a creative out-of-the-box thinker who values team work. You are comfortable with the pace and ever-changing requirements of a small development company while maintaining a healthy work life balance.\n<br><br>\n<strong>Who is Stratagem</strong>\n<br>\nStratagem is a small and fast-growing technology company built around the idea that we can make a lasting impact for our customers and employees. We believe in a culture of innovation, fun, empowerment, and family. We want you to learn new skills so you can become more fulfilled in both your personal and professional life.\n<br><br>\nAt Stratagem, our goal is to make our company the last company you work for!</div>\n\n<br>"}