{"job title": "Image Scientist, Senior", "company": "Streamline Defense", "city state": "– Quantico, VA", "rating": "4.0", "job description": "Title: Image Scientist, Senior\n<br><br>\nLocation: Quantico, VA\n<br><br>\nSalary: $115,000 - $120,000\n<br><br>\nStreamline Defense is seeking exceptionally qualified candidates to serve as an Image Scientist, Expert supporting MCIA This is a full-time position with great benefits located in Quantico, VA.\n<br><br>\nThe selected candidate will provide imagery science support specifically related to the exploitation of imagery in one of the following sensor disciplines: radar, infrared, spectral, or geospatial (to include photogrammetry and LiDAR); to assist the government/contractor team in optimizing the collection and exploitation of varied imagery data types, especially those categorized as AGI. The image scientist will collaborate with and provide scientific analysis support to imagery/geospatial analysts, who will leverage the value-added support to sharpen their assessments of current intelligence issues. The image scientist duties also include applying AGI techniques and capabilities to mission issues, as well as investigating innovative and emerging technologies to incorporate into analysis. The evaluation of commercial, academic, and outside approaches and algorithms, refinement, development of measures of effectiveness, improvements to system environments, and creation of new procedures will be commonplace. Formal and informal written reports and briefings will be necessary to capture plans, schedules, status updates and results.\n<br><br>\n<strong>Required Skills and Education:</strong>\n\n\n<ul>\n<li>Current Top Secret/SCI Clearance</li>\n<li>6+ years of experience and a Bachelor of Science degree in image science, remote sensing, earth science, physical science, engineering, or similar engineering/science field</li>\n<li>Experience in applied image processing and scientific analysis of imagery (SAR, IR, Spectral, Lidar, photogrammetry), knowledge of image formation, and associated discipline phenomenology.</li>\n<li>Experience with GOTS applications such as FSTK and AGITK.</li>\n</ul>\n\n<strong>Preferred Skills:</strong>\n<br><br>\nProficiency using ITT ENVI COTS image processing software, ERADAS IMAGINE, MS Office, Windows, and knowledge of programming languages such as IDL, R, Python. Familiarity with commercial and civil data sources, integration of resulting data into ArcGIS. Knowledge of Marine Corps TTPs pertaining to littoral operating environment, and Marine Corps mission sets.\n<br><br>\n<strong>About Streamline:</strong>\n<br><br>\nStreamline is a professional and technical solutions company focused on the U.S. defense, intelligence, and Special Operations communities. Our talented team of analyst, engineers, and military professionals support our clients most demanding missions. We offer an unmatched opportunity to grow and learn in an exciting and entrepreneurial environment. Highly motivated individuals will find a culture that values their individual input and compensates them well for their efforts.\n<br><br>\nStreamline is an Equal Opportunity Employer M/F/D/V.<br><br>SDL2017"}