{"job title": "Data Scientist", "company": "Stride Search", "city state": "– California, United States", "rating": "NA", "job description": "Work in a fast growing startup with unlimited opportunity and\n<br>\nlots of room for growth and advancement. Were on a mission to\n<br>\nsimply residential real estate transactions nationwide by\n<br>\nbringing world-class software, data science, and design to an\n<br>\nage-old industry.\n<br><br>\nWere seeking an exceptional Data Scientist to join us in\n<br>\nbuilding data products at the core of the company. We build\n<br>\nvaluation models, predictive modeling infrastructure, and lead\n<br>\ngrowth experiments. Day to day, its a mix of machine learning,\n<br>\ncrowdsourcing, exploratory data analysis, feature extraction, and\n<br>\nsoftware engineering.\n<br><br>\n<strong>As a Data Scientist you will:</strong>\n\n\n<ul>\n<li>Improve our industry-leading home valuation model using</li>\n</ul>\n\nmillions of real-estate transactions and complementary\n<br>\ndatasets.\n\n\n<ul>\n<li>Rapidly prototype features and predictive models.</li>\n<li>Build ML pipelines in production.</li>\n<li>Identify, research, and analyze new data sources to improve</li>\n</ul>\n\nmodel accuracy.\n\n\n<ul>\n<li>Become a domain expert in real-estate.</li>\n<li>Coordinate with product, engineering, and operations to</li>\n</ul>\n\nunderstand impact and trade-offs of modeling improvements.\n<br><br>\n<strong>Were looking for teammates who bring:</strong>\n\n\n<ul>\n<li>Commitment to rigorous analysis and production-quality code</li>\n<li>Passion for building solid data infrastructure</li>\n<li>A love of tackling complexity in real-world datasets such geo</li>\n</ul>\n\ndata and transaction data\n\n\n<ul>\n<li>Experience in one of Python, R, Java, Scala, Julia; if R or</li>\n</ul>\n\nJulia, candidate must be able to make algorithms scale\n\n\n<ul>\n<li>Familiarity with basic classes of ML algorithms, concepts in</li>\n</ul>\n\nfeature extraction and selection\n\n\n<ul>\n<li>Ability and desire to communicate your analysis with clarity</li>\n</ul>\n\nand precision\n\n\n<ul>\n<li>Resourcefulness and pragmatism</li>\n</ul>\n\n<strong>Bonus points:</strong>\n\n\n<ul>\n<li>Competition experience in data mining or machine learning</li>\n<li>You love delighting customers with honest, transparent</li>\n</ul>\n\nproducts and experiences"}