{"job title": "Lead Programmer Analyst - Data Scientist", "company": "Subaru of America", "city state": "– New Jersey, Cherry Hill", "rating": "3.9", "job description": "<div><div><u><strong>Summary:</strong></u>\n<br><br>\nAnalyzes large sets of data (structured and unstructured) in order to identify hidden patterns and systemic relationships that can be used to predict future behaviors. Be able to transform information into insights that help business users make more meaningful, evidence-based decisions.\n<br><br>\n<u><strong>Responsibilities:</strong></u>\n\n<ul>\n<li>Work closely with our business partners to support their department strategy. Implements this strategy by reviewing our various data sets to understand data trends.</li>\n\n<li>Perform strategic data analysis and research to better understand our customers.</li>\n\n<li>Ability to draw insights from multiple data sources to provide better visibility into safety/quality related issues.</li>\n\n<li>Develop analytical approaches to answer high-level questions and develop insightful recommendations.</li>\n\n<li>Demonstrate a client-service mindset and a desire to take on tough and challenging projects.</li>\n\n<li>Ability to balance the demands of multiple projects simultaneously.</li>\n</ul>\n<u><strong>Additional Responsibilities:</strong></u>\n\n<ul>\n<li>Mentor IT staff and business users regarding data mining and analysis procedures in order to ensure business goals and objectives are met.</li>\n\n<li>Assist in preparation and cleansing of data for analysis.</li>\n\n<li>Educate business users on advanced analytics best practices.</li>\n</ul>\n<strong><u>Required Skills/Abilities</u></strong>\n\n<ul>\n<li>Knowledge and understanding of statistical theory and machine learning techniques, including generalized linear models, survival analysis, decision trees, and clustering techniques.</li>\n\n<li>Excellent programming skills including expertise in R, Shiny, RStudio, and SQL. Ability to use advanced techniques to handle big data with structured and unstructured data.</li>\n\n<li>Prior experience with visualization tools such as D3.js, HTML, and CSS is a plus.</li>\n\n<li>Linux server-side application administration experience (RStudio Server, Shiny Server, RStudio Connect) a plus.</li>\n\n<li>Ability to work both independently and collaboratively.</li>\n\n<li>Excellent oral and written communication skills.</li>\n</ul>\n<strong><u>Education/Experience</u></strong>\n<br><br>\nBA/BS + 8 years of related experience.</div> </div><div></div>"}