{"job title": "Sr. Strategy and Business Intelligence Analyst", "company": "Sunrun", "city state": "– San Francisco, CA", "rating": "3.2", "job description": "<ul>\n<li>*Overview**</li>\n</ul>\n\nSunrun is now the leading residential solar company in the United States and continues to expand our offerings, grow our customer base, improve our operations, and deliver more value for shareholders. To support this development, we need to deliver clear reporting and analysis of business performance. We are looking for an analyst to join our Business Intelligence team to:\n<br><br>\n+ Drive the strategic planning required to meet these needs;\n<br><br>\n+ Partner with our senior functional leaders to examine their businesses and refine and implement their strategic plans; and\n<br><br>\n+ Lead evaluations of business practices and implement major strategic initiatives.\n<br><br>\nThis high visibility function will work cross functionally with multiple teams including Product, Marketing, Sales, Business Development, Operations, Software/IT, Finance and Regulatory.\n\n\n<ul>\n<li>*Responsibilities**</li>\n<li>*_Reporting_**</li>\n</ul>\n\n+ Partner with the Information Technology (IT) team to ingest key business data and shape into explorable data views (?Explores?) in our reporting platform (Looker)\n<br><br>\n+ Develop and update core reporting dashboards for all operating functions\n<br><br>\n+ Manage remaining non-Looker operating reporting and work to transition into Looker\n<br><br>\n+ Partner with executive teams to improve Key Performance Indicators (KPI) and develop new visualizations to better understand trends\n\n\n<ul>\n<li>*_Analysis_**</li>\n</ul>\n\n+ Support executive and operating teams with ad hoc requests for data views and analysis to answer pressing business questions\n\n\n<ul>\n<li>*_Development Pathway_**</li>\n</ul>\n\nSunrun views this role as either a jumping off point for additional analytical responsibilities (providing additional analytical support to operating leaders, developing statistical tools to support business, or managing other analytical groups) or a terminal role (with increasing compensation opportunities associated with tenure and performance) depending on the goals of the candidate.\n\n\n<ul>\n<li>*Qualifications**</li>\n</ul>\n\n+ 5 year of work experience in reporting and analysis\n<br><br>\n+ Requires strong analytical, quantitative, and technical (programming) skills\n<br><br>\n+ Preference for proficiency in Excel, SQL, and Python and ability to acquire other programming languages as needed\n<br><br>\n+ Four year college degree\n<br><br>\n+ Ability to work well in a flexible, \"roll up your sleeves\" and dynamic work environment.\n<br><br>\n+ Strong problem solving, analytical capabilities, troubleshooting and collaboration skills.\n<br><br>\n+ Desire to stay on the leading edge of the solar and renewable energies industry.\n<br><br>\n+ Drive, motivation, passion and an exceptional personal work ethic; ability to uphold the highest possible ethical and professional standards.\n<br><br>\nQuick Apply Mobile Apply\n<br><br>\nSend or Refer This Job\n<br><br>\nOops! The Share function is not working properly at this moment. Please refresh the page and try again later.\n<br><br>\nShare on social media\n\n\n<ul>\n<li>*Need help finding the right job?**</li>\n</ul>\n\nWe can recommend jobs specifically for you!\n\n\n<ul>\n<li>*Category** _Sales_</li>\n<li>*Requisition ID** _2018-11784_</li>\n</ul>"}