{"job title": "Machine Learning Data Analyst", "company": "Sunrise Systems, Inc.", "city state": "– Waterloo, IA", "rating": "3.9", "job description": "Job Title: Machine Learning Data Analyst\n<br><br>\nLocation: Waterloo, IA\n<br><br>\nID: 18-15571\n<br><br>\nWhat you will do:\n<br><br>\n· As a Machine Health Data Analyst, you will work on a cross-functional team focused on utilizing telematics data to deliver mission-critical solutions, and you’ll do it with cutting-edge big data technologies.\n<br><br>\n· You will work on developing methods to analyze data from Agricultural, Construction, and Forestry machines to enable automated solutions to deliver machine uptime to our customers.\n<br><br>\n· There will be a focus on telematics data mining, manipulation, analytics, visualization, and automated solution development.\n<br><br>\n· Our team’s entrepreneurial attitude and collaborative spirit sets us apart and will keep you impassioned, driven, and fulfilled.\n<br><br>\nResponsibilities include:\n<br><br>\n· Development, maintenance, and support of methods to automate solutions to dealers.\n<br><br>\n· You will work on projects to: · Connect, flow, store, transform, analyze, and visualize data from engines and machines ·\n<br><br>\n· Integrate with engineering and reliability subject matter experts on our team to develop automated solutions using SQL and R ·\n<br><br>\n· Develop solutions for identifying patterns or trends to troubleshoot Engine related problems, using Telematics data and/or Warranty Data\n<br><br>\nContact,\n<br><br>\nAnant Dwivedi - Lead Recruitment\n<br><br>\nSunrise Systems Inc.\n<br><br>\n105 Fieldcrest Ave Suite# 504, Edison, NJ - 08837 USA\n<br><br>\nDesk: (732)-272-0289\n<br><br>\nConnect with me on LinkedIn\n<br><br>\nEmail: mailto:Anant.K@sunrisesys.com URL: http://www.sunrisesys.com<br><br>Company Description:<br><br>Sunrise Systems was founded in 1990 with a clear vision to deliver world-class staffing service solutions in all labor categories, including IT consulting and solutions; all with the commitment to provide service that exceeds expectations and become the most trusted name in the industry. More than two and a half decades later, we pride ourselves on being at the forefront of the staffing industry. Combining our deep industry expertise, insights, and global resources, we have partnered with our clients to connect them with top professionals across several different industries.\n<br><br>\nAt Sunrise Systems, we provide cost effective Managed Staffing Solutions, Information Technology and Information Technology Consulting Services to several Fortune 500 companies and U.S. Government agencies. We provide our clients with flexible engagement models and customized products that are budget and time specific. Understanding the challenges that every business faces, we offer our services either on site at the clients' site or from one of our globally distributed technology centers. Our onshore and offshore development capabilities ensure that we excel at meeting customer requirements every single time.\n<br><br>\nOur collective business experience spans over two and a half decades and ranges from:\n\n<ul>\n<li>Business, management, and technical fields</li>\n<li>Information technology consulting and software solutions.</li>\n<li>Providing strategic support for the developmen</li></ul>"}