{"job title": "Sr. Data Science Analyst", "company": "SunTrust Banks", "city state": "– Atlanta, GA", "rating": "3.2", "job description": "Req ID: W459975\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nPerforms sophisticated data analytics (encompassing data mining, inferential statistical analysis, and predictive analytics, for example). Identifies actionable insights from various (or multiple) sources of data that measurably improve business outcomes or reduce business risk. Collects and prepares data for analysis, performs exploratory to advanced predictive and/or modeling analytics, and identifies data relationships (patterns and trends). Provides consultation to business leaders and other stakeholders on how to leverage analytic insights to build actionable strategies.\n<br><br>\nJob Level: Experienced-level professional job that applies a solid understanding of concepts within own professional discipline and uses knowledge of the business and key processes gained practical experience. Solves routine problems of moderate complexity by analyzing possible solutions using experience, judgment and precedents. Focuses on enhancing knowledge of SunTrust's processes, culture and clients. Impacts quality of own work and the work of others on the team. Actively participates in projects, including planning and execution activities; may be responsible for a project workstream from start to finish. Provides informal guidance to new teammates. Works under moderate supervision.\n<br><br>\n<strong>Qualifications</strong>\n<br>\n<strong>Basic Qualifications:</strong>\n\n\n<ul>\n<li>Bachelor's degree or equivalent and 2 years of related experience or an equivalent combination of education and experience.</li>\n<li>Solid understanding of principles, practices, theories, and/or methodologies associated with the professional discipline (e.g., information technology, project management, finance, risk management, etc.).</li>\n<li>Ability to manage competing priorities.</li>\n<li>Ability to solve problems in straightforward situations by analyzing possible solutions using experience, judgment and precedents.</li>\n<li>Awareness of industry competitive landscape and the factors that differentiate SunTrust and other banks in the market.</li>\n<li>Ability to communicate complex information in straightforward situations.</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Master's degree or MBA and 3 years of related experience.</li>\n<li>Previous experience in the banking industry.</li>\n</ul>\n\nEqual Opportunity Employer: SunTrust supports a diverse workforce and is a Drug Testing and Equal Opportunity Employer. SunTrust does not discriminate against individuals on the basis of race, creed, color, gender, religion, national origin, age, disability, veteran status, pregnancy, marital status, citizenship status, sexual orientation, gender identity, genetic information, or any other classification protected by applicable laws.\n<br><br>\nTo review the EEO Poster, copy and paste the following link into your browser: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\n<br><br>\n? 2017 SunTrust Banks, Inc. All rights reserved.\n<br><br>\nSunTrust is federally registered service marks of SunTrust Banks, Inc."}