{"job title": "Data Scientist", "company": "SURVICE Engineering Company", "city state": "– Lexington Park, MD", "rating": "3.9", "job description": "<p>SURVICE Engineering is nationally recognized as a single-source provider for Government and industry organizations involved in all phases of the systems engineering process. We're proud to have supported the development, testing, and analysis of many of the major U.S. combat systems in the field today. In addition, we've helped create a central repository of defense systems related information and resources routinely used by analysts, testers, and other specialists.</p><p>SURVICE is currently seeking a<strong> Data Scientist</strong> to support our customer at the Naval Air Systems Command located at the Naval Air Station Patuxent River, MD. The Data Scientist will support the analysis of F-35 data, simulation data, and the statistical comparison of the two data sets. The ideal candidate is adept at manipulating data in a tactical or operational context to gain insight into installed sensor and system performance. They must have strong experience using a variety of data analysis methods and data munging tools. They must have a proven ability to support technical decisions with data. They must be comfortable working with a wide range of stakeholders and functional teams across government and contractor organizations. </p><p> <strong>Responsibilities</strong>:</p><ul><li>Work with data analysis team members across the enterprise to accomplish the verification and validation of the Joint Simulation Environment.</li><li>Write tools to assist in mining data from flight tests and simulation runs.</li><li>Write tools to assist in comparative analysis of flight tests and simulation runs.</li><li>Assess the effectiveness and accuracy of new data sources and data gathering techniques.</li><li>Implement performance analysis and visualization of flight test and simulation data sets.</li></ul><p> <strong>Skills desired</strong>:</p><ul><li>Strong problem-solving skills with an emphasis on producing data to drive decisions.</li><li>Experience using statistical computer languages (R, Python, MATLAB, or similar etc.) to manipulate data and draw insights from medium and large data sets.</li><li>Experience working with and creating data architectures.</li><li>Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</li><li>Excellent written and verbal communication skills for coordinating across teams.</li><li>A drive to learn.</li></ul><p><strong>Education and Experience</strong>: At least 7 years of relevant experience. BS or MS in Engineering, Operations Research, Computer Science, Math or other relevant technical degree.</p><p><strong>Clearance Requirement:</strong> Must be able to obtain a DoD clearance. U.S. citizenship is required in order to obtain this clearance. Current clearance is desired.</p><p> Relocation benefits are available.</p><p> SURVICE Engineering Company offers competitive salaries and generous benefits packages, including tuition reimbursement up to $7K a year.</p><p> </p><p><strong>SURVICE Engineering is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. VEVRAA Federal Contractor</strong>.</p><p> </p>0<br><br><b>Job Posted by ApplicantPro</b><br>"}