{"job title": "Research Data Scientist", "company": "SurveyMonkey", "city state": "– San Mateo, CA", "rating": "4.3", "job description": "<strong>About SurveyMonkey</strong>\n<br><br>\nFounded in 1999, SurveyMonkey changed the way people gather feedback by making it easy for anyone to create their own online surveys. Today, SurveyMonkey's mission is to power curious individuals and organizations to measure, benchmark and act on the opinions that drive success. Our People Powered Data platform enables conversations at scale to deliver impactful customer, employee and market insights. The company's 700+ employees are dedicated to fueling the curiosity of over 16 million active users globally. For more information about SurveyMonkey, please visit surveymonkey.com.\n<br><br>\n<strong>Survey Science</strong>\n<br><br>\nDo the words \"survey science\" make you giddy? Are you champing at the bit to help millions of people write and execute great surveys? Did you notice the double-barreled question we just asked? When it comes to writing the best questionnaires and helping our users optimize how they run and analyze surveys, we put our money where our mouth is! If you're hip to methodologically, sound survey practices, and analysis, we want to meet you.\n<br><br>\n<strong>The Role</strong>\n<br><br>\nWe are looking for a Research Data Scientist to join the Survey Research and Data Insights team. As a key member of the survey science staff, you play a critical role in developing, enriching, and communicating innovative data best practices. You have a deep, demonstrated ability to detect sources of sample bias, and are both creative and practical in finding ways to address such bias. You are comfortable in all aspects of data pipeline, and particularly good at automating and streamlining data construction and analysis. You use sound research principles to guide your approach to data exploration and statistical modeling. You enjoy experimenting with and perfecting methodology, and are excited to build prototypes that will lead to next generation products and solutions.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Sample weighting and adjustment</li>\n<li>Automate data construction and analysis</li>\n<li>Combine platform and external data to enrich survey data</li> \n\n<li>Support and empower teammates to produce robust quantitative findings</li>\n<li>Provide quantitative expertise on cross-functional projects</li>\n<li>Communicate and present data-driven results to stakeholders</li>\n<li>Collaborate on research and innovate new methods to advance survey science</li>\n<li>Participate in conferences and publish to maintain thought leadership</li>\n</ul>\n<strong>Qualifications</strong>\n\n<ul>\n<li>Bachelor's degree in Statistics, Math, Engineering related field or equivalent experience. Graduate degree preferred</li>\n<li>Understanding of survey sampling and methodology</li>\n</ul>\n<strong>Desired Skills</strong>\n\n<ul>\n<li>Advanced skills in R, python, or other statistical software</li>\n<li>Experience in creating Shiny apps and dashboard a plus</li>\n<li>Knowledge in database storage, query, and processing</li>\n<li>Expertise in statistical modeling and applications</li>\n<li>Proficiency in searching Census and external benchmarks</li>\n<li>Experience with APIs, data transformation and visualization</li>\n<li>Familiarity with Unix-based work environment</li>\n<li>Team-first mentality with great attention to detail</li>\n<li>Strong communication and interpersonal skills</li>\n<li>Passionate about leveraging research and data science to build cutting-edge features and products</li>\n</ul>\nAt SurveyMonkey, we offer competitive salaries, medical/dental benefits, PTO, 401k, paid holidays and parental leave, and equity compensation.\n<br><br>\nSurveyMonkey is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees."}