{"job title": "Vice President Data and Insights", "company": "Suzy", "city state": "– New York, NY, United States", "rating": "3.9", "job description": "Suzy is a human intelligence platform that helps organizations make better, more informed decisionsfaster. Powered by an on-demand network of more than a million consumers, Suzy lets you target and retarget any consumer segment to ask questions and get insights in minutes. Some of the biggest brands in the world use Suzy to validate critical decisions, better understand their customers, increase conversions and drive growth. Learn more at www.suzy.com.\n<br><br>\nThe Vice President, Data and Insights sets will report to the Chief Product Officer, and will create the vision for Suzys approach to transformative data opportunities. You will direct Suzys approach to solving clients data-driven platform, business, and products and service needs. You will set the vision and quality bar of its output, and represent it in all its forms internally and externally. You will ensure that a data-driven culture is integrated within the fabric of all of Suzys offerings.\n<br><br>\nYou will collaborate with other department leaders, data scientists, marketing science analysts, and creatives to uncover clients data gaps, and understand clients data needs and opportunities in which data could help them achieve their goals.\n<br><br>\nResponsibilities:\n<ul>\n<li>Shape the global data strategy. Determine Suzys unique approach to help clients solve their need for data-driven platforms, business opportunities, and products/services.</li><li>Partner closely with clients to identify data-related problems.</li><li>Lead the development of Suzys data offerings and creative approach.</li><li>Collaborate with Suzys Global Chief Technology Officer to develop delivery capabilities, including business intelligence, artificial intelligence/machine learning capability, and algorithm development.</li><li>Identify marketing science/data science research needs, and guide methodology enhancements.</li><li>Identify opportunities to apply advanced analytics and data science, including predictive analytics, business intelligence and cognitive computing solutions to client problems.</li><li>Use your advanced and web analytics backgrounds in R/SAS, Python, SQL, Adobe Analytics and knowledge of DMPs/DSPs to aggregate and integrate multi-channel data and predict customer behaviors based on their engagement with advertising/marketing and purchasing trends.</li>\n</ul>\nPreferred qualifications:\n<ul>\n<li>B.S. in Business, Stats, Economics, or equivalent.</li><li>10+ years' experience working in the data science field</li><li>Proven experience uncovering insights and understand how to connect disparate data sets.</li><li>Strong quants background in SAS/R, SQL/Python and web analytics tools including Adobe Analytics, Google Analytics, DMPs/DSPs.</li><li>Ability to engage with a wide variety of team members at different levels, delivering insights and recommendations.</li><li>Exceptional listening skills, with an ability to ask the right questions and uncover hidden insights.</li><li>Collaborate with strategists, consultants, creatives, and technologists, and ability to integrate and draw from diverse skillsets.</li>\n</ul>\nAbout Suzy\n<br><br>\nAt Suzy (formerly Crowdtap), every team member spends every day moving the business forward together, from engineering to business development. We love what we do, and we like each other a lot. Every Suzy team member has a great attitude, a love for solving problems, collaborating, and lots of fun. We are humble, positive, hilarious and have a genuine love for fixing problems! Not to mention our perks (unlimited PTO, snacks, dog-friendly office, insane parties).We are incredibly proud of our award-winning culture.\n<br><br>\nNBA star Kevin Durant backs marketing tech startup Suzy\n<br><br>\nA former ad agency CEO has built what he calls the Siri for marketers\n<br><br>\nCrains NY Best Places to Work 2013, 2014 and 2015\n<br><br>\n<strong>Benefits</strong>\n<br><br>\nHigh-growth work environment\n<br><br>\nFriendly, fun, and collaborative team-based work environment\n<br><br>\nFully stocked fridge, snacks and cold brew\n<br><br>\nFun, creative, open work space\n<br><br>\nSuzy is an equal opportunity employer. We are a welcoming place for everyone, and we do our best to ensure all people feel supported and connected at work.\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}