{"job title": "Data Scientist", "company": "Swagelok", "city state": "– Solon", "rating": "3.3", "job description": "<div> Requisition Number 18-0205</div> <div> Post Date 6/20/2018</div> <div> Title Data Scientist</div> <div> City Solon</div> <div> Shift First</div> <div> Description Position Summary:\n<br><br>\nThe Data Scientist will work with the team to create state-of-the-art data and analytics driven solutions, developing and deploying cutting edge scalable algorithms, working across Swagelok to drive business analytics to a new level of predictive and prescriptive\n<br>\n analytics while leveraging data tools and technologies. You will be supporting all aspects of the business cross functionally through operations modeling and analytics.\n<br><br>\n<strong>Essential Duties &amp; Responsibilities:</strong>\n\n\n<ul>\n<li>Advocate, evangelize and build data-fueled models that will help our organization improve decision making capabilities.</li>\n<li>Become an expert on our manufacturing, customer service, supply chain, products and engineering datasets.</li>\n<li>Will provide insight into leading analytic practices</li>\n<li>Design and lead iterative learning and development cycles</li>\n<li>Ultimately produce new and creative analytic solutions that will become part of our core deliverables</li>\n<li>Champion the use of data analytics and insight across the company</li>\n<li>Handle large data sets and complex queries to address a hyper growth and fast changing business</li>\n<li>Execute all phases of the application implementation from initial identification of a tool through completion and training the users of the system.</li>\n<li>Collaborate with the Data and IS team to develop tools and identify opportunities for improved data performance and efficiency</li>\n<li>Foster a focused and pragmatic approach combining advanced analytics, statistics, new technologies, and deep insights to drive decisions</li>\n<li>Lead applied analytics initiatives that are leveraged across the breadth of our solutions</li>\n<li>Research, design, implement and validate cutting-edge algorithms to analyze diverse sources of data to achieve targeted outcomes.</li>\n<li>Assess analytical tools, technology and external data acquisition; support proof-of-concepts that drive business success and sustained analytic growth.</li>\n<li>Use and promote data-exploration techniques to discover new or previously unasked questions.</li>\n<li>Communicate data findings to both business and IS partners to influence how an organization approaches and meets business challenges of an evolving customer base and changing marketplace, using strong business acumen.</li>\n<li>Collaborates with IS and other analysts cross functionally to develop, refine and scale data management and analytics procedures, systems, workflows, best practices and other issues.</li>\n<li>Provide expertise on mathematical concepts for the broader applied analytics team and inspire the adoption of advanced analytics and data science across the entire organization.</li>\n<li>Influence stakeholders to make improvements that yield business value by effectively making compelling cases through story-telling, visualizations, and other influencing tools.</li>\n<li>Contribute to the development of Swagelok’s comprehensive business intelligence framework, enabling the connection of data to information.</li></ul></div>\n\n\n<strong></strong><div><strong> Requirements Education and/or Work Experience Requirements:</strong>\n<br><br>\n<strong>Required:</strong>\n\n\n<ul>\n<li>Minimum 7 to 10 years of experience delivering world-class data science outcomes</li>\n<li>Solving complex analytical problems using quantitative approaches</li>\n<li>Demonstrating a unique blend of analytical, mathematical and technical skills</li>\n<li>Propose analytics strategies and solutions that challenge and expand thinking</li>\n<li>Expert in analyzing large, complex, multi-dimensional datasets with a variety of tools</li>\n<li>Accomplished in the use of statistical analysis environments such as R, MATLAB, SPSS or SAS</li>\n<li>Have experience with BI tools such as Qlikview, Tableau and SAP Business Objects</li>\n<li>Excel at making complex concepts simple and easy to understand</li>\n<li>Driven to show the world the power of applied analytics.</li>\n<li>Experience with various programming languages</li>\n<li>Proficient in SQL</li>\n<li>Problem solving mentality with a natural desire to dig to the underlying answers</li>\n<li>Strong statistical background that values meaningful insights and can separate the “noise from the signal”</li>\n<li>Master’s degree in a related field (Computer Science, Math, Statistics, Physics) or related fields. Ph.D. is preferred.</li>\n<li>Excellent interpersonal communication skills</li>\n</ul>\n\n<strong>Preferred:</strong>\n\n\n<ul>\n<li>Skilled in all aspects of conducting business intelligence research</li>\n<li>Excellent strategic thinking abilities and analytical skills</li>\n<li>Ability to evaluate business issues and opportunities that can be solved through attaining insight.</li>\n<li>Must be able to think above the tactical level</li>\n<li>Company awareness and ability to work and network with business partners and colleagues from different areas</li>\n<li>Ability to deal with ambiguity</li>\n<li>Mastery of visual, written and oral communications</li>\n<li>Ability to organize and handle multiple requests and projects</li>\n<li>Ability to influence without authority, motivate others, and maintain high levels of respect for and from peers</li>\n<li>Formal project management skills highly desired.</li>\n</ul>\n\n<strong>Critical Competencies:</strong>\n\n\n<ul>\n<li>Organizational awareness, business acumen, initiative, influence, customer orientation, coaching, teamwork and collaboration</li>\n</ul>\n\n<strong>Working Conditions and/or Physical Requirements:</strong>\n\n\n<ul>\n<li>Physical requirements associated with normal office working environment.</li>\n<li>Ability to operate standard office equipment.</li>\n<li>Ability to safely and successfully perform the essential job functions consistent with the ADA, FMLA and other federal, state and local standards, including meeting qualitative and/or quantitative productivity standards.</li>\n<li>Ability to maintain regular, punctual attendance consistent with the ADA, FMLA and other federal, state and local standards.</li>\n</ul>\n\nClick here to enter text.\n<br><br>\nSwagelok is proud to be an Equal Opportunity and Affirmative Action Employer. Applicants are selected without regard to race, ethnicity, creed, color, religion, sex (including pregnancy), age, national origin or ancestry, disability, genetic information, veteran/military\n<br>\n status, sexual orientation, gender identity, or other protected characteristic under federal, state or local law.\n<br><br>\nSwagelok will make reasonable accommodations in compliance with the Americans with Disabilities Act of 1990 and the Americans with Disabilities Act Amendments Act of 2008.\n<br><br>\nThis job summary is intended to be brief and does not list all the duties for this position. Nothing in this job description should be construed as an express or implied contract of employment. Swagelok is an at-will employer, which means that either party\n<br>\n is free to terminate the employment relationship at any time, without any advanced notice, for any reason or no reason.</div>\n<br>\n<div>Swagelok is proud to be an Equal Opportunity and Affirmative Action Employer. Applicants are selected without regard to race, ethnicity, creed, color, religion, sex (including pregnancy), age, national origin or ancestry, disability, genetic information,\n<br>\n veteran/military status, sexual orientation, gender identity, or other protected characteristic under federal, state or local law. Swagelok will make reasonable accommodations in compliance with the Americans with Disabilities Act of 1990 and the Americans\n<br>\n with Disabilities Act Amendments Act of 2008.\n<br><br>\nSwagelok will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the\n<br>\n compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure\n<br>\n is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information.\n<br><br>\nThis job summary is intended to be brief and does not list all the duties for this position. Nothing in this job description should be construed as an express or implied contract of employment. Swagelok is an at-will employer, which means that either party\n<br>\n is free to terminate the employment relationship at any time, without any advanced notice, for any reason or no reason.\n<br><br>\nPlease view Equal Employment Opportunity Posters provided by OFCCP \n<br>\nhere.</div>"}