{"job title": "interns@swissre - Data Analyst Intern", "company": "Swiss Re", "city state": "– Armonk, NY", "rating": "3.6", "job description": "interns@swissre - Data Analyst Intern\n<br><br>\nAbout iptiQ\n<br><br>\nBecome a part of a growing and dynamic entrepreneurial team within the established Swiss Re Group. iptiQ is a start-up unit, established to provide innovative protection solutions directly to consumers. Our team delivers the coordination, infrastructure and competences that are key to driving forward this new business; working closely with our partners and clients. Our mission is to reduce the protection gap by simplifying life insurance and making it more accessible to people. Our motto is \"now life is easier for everyone\". For us this means making life insurance easier to sell, to buy and to trust.\n<br><br>\nIn this role, you will be a key member of our Business Analytics team in our Armonk office. This includes working with other departments to provide data for various business requirements. There will be opportunities to partner with IT colleagues and implement new ideas strategies to enhance and expedite the deployment of data solutions.\n<br><br>\nTypical Requirements\n\n\n<ul>\n<li>Perform data analysis by means of data interpretation, and execution of advanced database queries using SQL and other database technologies or programming languages as appropriate. Identify, analyze, and interpret trends, patterns or insights in result sets</li>\n<li>Work independently, or in teams on complex level data gathering, checking, manipulation, analysis, reporting and data quality assurance tasks with minimal supervision</li>\n<li>Develop analytical model for reporting and mining insights for business development activities using conventional or visualization tools</li>\n</ul>\n\nBasic Qualifications\n\n\n<ul>\n<li>In your junior year of an undergraduate degree in Computer Science/Engineering or Information Systems; expected graduation date of December 2019 or May 2020</li>\n<li>Or in your senior year and planning to enter a 1-year MIS program</li>\n<li>Or currently completing your first year in a non-business, 2-year MIS program and have less than 2 years of work experience</li>\n<li>Strong understanding of relational data base concepts and familiarity with SQL querying</li>\n<li>Familiarity with statistical data analysis (such as: R, Python) and data visualization tools (such as: Tableau, Power BI)</li>\n<li>Have some experience working with ETL techniques or data warehousing</li>\n<li>Good analytical skills and problem solving skills</li>\n<li>Enjoy working in teams and proactively work with team members</li>\n<li>Strong commitment to excellence and personal and professional growth</li>\n<li>Excellent written and oral communication skills</li>\n</ul>\n\n<strong>ADDITIONAL QUALIFICATIONS:</strong>\n\n\n<ul>\n<li>Experience with cloud technologies such as Azure etc.</li>\n<li>Experience with Mongo DB or other no-SQL databases</li>\n</ul>"}