{"job title": "Data Scientist", "company": "Swoon", "city state": "– Bradenton, Florida", "rating": "4.6", "job description": "<strong>SUMMARY</strong>\n<br><br>\nThe Data Scientist leads the team in developing sophisticated predictive models, mining large data sets for insights, building scalable data products, and growing the overall Data Science capability at our client. This individual serves as the senior member on project teams, often creating solutions from scratch, or, applying known and proven techniques effectively. This role is well versed in multiple analytical techniques, and can seamlessly transition between projects, data types, and problems.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong> include the following. Other duties may be assigned.\n\n<ul>\n\n\t<li>Accesses data from a variety of sources, including RDMS, NoSQL, or API.</li> \n\n<li>Performs data aggregations, joins, manipulations, and cleaning to ensure data integrity throughout the entire analytical process.</li> \n\n<li>Applies supervised and unsupervised modeling techniques to data to generate predictions and uncover patterns.</li> \n\n<li>Develops hypothesis statements and applies statistical testing to determine causality and generalize observations.</li>\n<li>Solves problems by applying a variety of predictive modeling/machine learning/deep learning techniques.</li> \n\n<li>Maintains a comprehensive understanding of the current analytical landscape, including emergent technologies and methods.</li> \n\n<li>Works closely with the Data Engineering and Product teams to ensure the successful completion of projects.</li>\n<li>Decomposes problem statements into specific deliverables and requirements.</li> \n\n<li>Supports the Product Owners in developing sprint goals and roadmaps.</li>\n<li>Continuously scans the Data Science landscape for recent developments and opportunities to ingrate new methodologies into the existing project portfolio.</li>\n<li>Creates presentations and delivers results to colleagues, stakeholders and executive leadership.</li>\n<li>Leads peer review sessions and collaborative exercises to build the team's overall analytical capability.</li>\n<li>Thoroughly understands the client's retail business model and can seamlessly connect data, context, and analytical solutions.</li> \n\n<li>Mentors junior team members and provides constructive critique on specific projects.</li>\n</ul>\n<strong>SUPERVISORY RESPONSIBILITIES</strong>\n<br><br>\nThe Data Scientist does not have direct supervisory responsibilities but they are expected to demonstrate leadership and mentor other team members.\n<br><br>\n<strong>QUALIFICATIONS</strong>\n<br><br>\nThe idea candidate possesses the following qualifications.\n\n<ul>\n\n\t<li>Advanced SQL skills and is comfortable operating with relational data models and structure.</li> \n\n<li>Advanced skills with NoSQL databases and can interact with large amounts of data stored in a Hadoop environment.</li> \n\n<li>Is capable of accessing data via a variety of API/RESTful services.</li>\n<li>Advanced programming skills in either R, Python, or similar analytical language.</li>\n<li>Intermediate knowledge of Linux and Bash. Can interact with the OS at the command line and create shell scripts to automate workflows.</li> \n\n<li>Experience with state of the art techniques such as AI and Deep Learning.</li> \n\n<li>Advanced knowledge of Apache Spark.</li> \n\n<li>Intermediate knowledge of cloud environments such as AWS and Azure.</li>\n<li>Intermediate understanding of software development and collaboration, including experience with tools such as Git.</li>\n<li>Exceptional written and verbal communication skills, comfortable presenting in front of large audiences.</li> \n\n<li>A basic understanding of Agile methodologies and continuous delivery.</li> \n\n<li>Excellent data visualization skills, is able to determine the appropriate visualization for a variety of data types and create compelling stories with data.</li>\n<li>An advanced understanding of supervised and unsupervised learning techniques including; variable selection, feature engineering, model generation, model diagnostics, and deployment.</li> \n\n<li>Excellent statistical skills that are grounded in a thorough understanding of testing and frequentist/Bayesian methodologies.</li>\n<li>A proven track record of leading successful projects and driving measurable, viable results using Data Science techniques.</li> \n</ul>\n<strong>EDUCATION and/or EXPERIENCE</strong>\n<br><br>\nBachelors Degree, Masters Degree or PhD. in a Data Science, Applied Mathematics, Computer Science or otherwise research-based field; 3-5 years of related experience and/or training; or equivalent combination of education and experience.\n<br><br>\n<strong>COMMUNICATION SKILLS</strong>\n<br><br>\nThe candidate must be able to communicate with others in a simple, clear, and understandable manner. Must also have the ability to read and interpret all forms of communication. The ability to write reports for management and professional correspondence, as well as to speak effectively before peers, management, customers, and other associates of the organization is required.\n<br><br>\n<strong>REASONING ABILITY</strong>\n<br><br>\nThe candidate must effectively plan and execute unusual and difficult work. Takes initiative and is decisive and quick, when appropriate, all while adhering to the team’s standards and patterns and practices. Must have the ability to solve complex problems and deal with ambiguity where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form. Deals constructively with conflict and disagreement.\n<br><br>\n<strong>PHYSICAL DEMANDS</strong>\n<br><br>\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nWhile performing the duties of this job, the employee is regularly required to sit and talk or hear. The employee must occasionally lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision, and ability to adjust focus.\n<br><br>\n<strong>WORK ENVIRONMENT</strong>\n<br><br>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n<br><br>\nThe noise level in the work environment is usually quiet, however positive, work-driven collaboration is encouraged.\n<br><br>\n#JA<br>\n<div>Id: 28969</div>"}