{"job title": "Research Scientist/Engineer 5", "company": "Symantec", "city state": "– Mountain View, CA", "rating": "3.5", "job description": "Symantec Research Labs is a global organization, offering the opportunity to work in a talented team of experienced researchers. Team members are encouraged to propose and work on bold new ideas, conduct independent research, produce working prototypes, publish their work at premiere conferences and journals, and actively participate in the research community. Working in close collaboration with Symantec’s senior leadership, the goal of the team is to invent next-generation technologies, as well as to provide thought leadership and technical expertise to the company and the community. Many of the breakthroughs from Symantec Research Labs already better the lives of hundreds of millions of people.\n<br><br>\nThis position requires strength rapidly creating prototypes for solving complex problems. Strength in cryptographic protocols, network protocols, applied crypto, programming, and security are all preferred. For this role, Ph.D. In Computer Science is preferred but not required. Prior security research experience (university research or commercial research) is similarly preferred but not required. Strong technical communication skills are required. As a Senior Principal Research Engineer, you would be expected to set a high standard in rapidly prototyping and evaluating new concepts, both individually at times, and as part of small dynamic teams at other times.\n<br><br>\n<strong>Responsibilities include:</strong>\n<br>\nDeveloping cutting-edge, disruptive technologies to shape the future of cyber-security;\n<br>\nDesigning, implementing, and evaluating models and prototypes of new concepts;\n<br>\nReport and present research results and developments internally and externally;\n<br>\nSuggest and engage in collaborations to meet research goals; and\n<br>\nHelp prototype and patent valuable intellectual property.\n<br><br>\n====================​====================​\n<br><br>\nSymantec is an equal opportunity employer. All candidates for employment will be considered without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, state or local law.<br><br>Apply"}