{"job title": "Data Scientist", "company": "Synergy BIS", "city state": "– Arlington, Virginia", "rating": "3.9", "job description": "Description<br><br>As the <strong>Data Scientist,</strong> you shall analyze and advise development of requirements, plan, design, and execution of data solutions (including infrastructure) for data warehousing/data sharing environments, to include 'federated' service oriented architectures for the entire business enterprise. The contractor shall support synergizing data solutions with IT requirements management products for new initiatives to include data modeling. The contractor shall analyze and advise on common factors and common issues between data environments in multiple functional lanes, to include logistics, acquisition, human resource management, and financial management.\n<br><br>\n<strong>Key Tasks:</strong>\n<ul>\n<li>Responsible to research and develop statistical learning models for data analysis, as well as collaborate with customers and stakeholders to devise possible solutions.</li><li>Stay up-to-date with latest technology trends, communicates results and ideas to key decision makers, and implements new statistical or other mathematical methodologies as needed for specific models or analysis.</li> <li>Analyze cross domain data lineage to develop data exchange plan</li> <li>Optimize join developments efforts through appropriate database use and project design.</li>\n</ul>\n<strong>Experience and Qualifications:</strong>\n<ul>\n<li>Master's Degree in Computer Science, Statistics, Applied Math or related field.</li> <li>7+ years' practical experience with SAS, ETL, data processing, database programming and data analytics.</li><li>Extensive background in data mining and statistical analysis.</li><li>Able to understand various data structures and common methods in data transformation.</li> <li>Excellent pattern recognition and predictive modeling skills.</li>\n</ul>\nSynergy is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}