{"job title": "Scientist", "company": "Synectics Inc.", "city state": "– Pearl River, NY", "rating": "3.4", "job description": "<strong>Job Description<div><strong>Description:</strong>\n<br>\nProvides support to Discovery according to co-discovery paradigm with duties including target evaluation, cell-based assays, model development and data analysis.\n<br>\nDevelops ideas leading to new experimentation, coordinating technical activities and participates in group and project meetings.\n<br><br>\n<strong>Qualifications:</strong>\n<br>\nMasters degree with at least 1 year solid experience in an active lab, or bio-tech\n<br>\nFlow Cytometry experience required\n<br>\nCell culture experience required\n<br>\nImmunology experience required\n<br>\nMasters in Immunology a plus\n<br>\nExperience in culturing immune cell subsets and profiling phenotypic changes upon drug treatment using flow cytometry, ELISA, Luminex, qPCR, etc\n<br>\nMicrosoft Office\n<br>\nGraph Pad Prism\n<br>\nFacsdiva\n<br>\nFlowjo\n<br>\nFcsexpress</div>Company Description<div>Synectics is one of the nation's foremost consulting firms, working with a client base that includes some of the leading institutions and Fortune 500 corporations in the United States. We seek to bring the most highly qualified professionals to assignments that they will find challenging and fulfilling. We also seek to justify our clients’ expectations that every Synectics consultant will bring the highest possible effort to their endeavors every day. Our success has depended on our consistent ability to achieve both of these goals.\n<br><br>\nSynectics serves an extremely diverse client base which represents an equally diverse range of industries and institutions. The technologies we support have always been responsive to this extremely broad spectrum. In order to fully engage with this continually changing commercial and technological landscape, our employees must draw on their own varying interests, skills and backgrounds. This insight, reflected in our daily practices, has always been our fundamental strength as a company, and it continues to serve us well in all our efforts.</div></strong>"}