{"job title": "Data Analyst Intern", "company": "Syngenta", "city state": "– Minnetonka, Minnesota", "rating": "3.4", "job description": "Job/Internship Description\n<br><br>\nData Analyst Intern\n<br>\n<strong>(********)</strong>\n<br><br>\nData Analyst Intern -Minnetonka, MN\n<br><br>\nAbout Syngenta\n<br><br>\nSyngenta is a leading agriculture company helping to improve global food security by enabling millions of farmers to make better use of available resources. Through world class science and innovative crop solutions, our 28,000 people in over 90 countries are working to transform how crops are grown. We are committed to rescuing land from degradation, enhancing biodiversity and revitalizing rural communities.\n<br><br>\n<strong>About this Job:</strong>\n<br><br>\nAs an intern at Syngenta, you have the opportunity to work alongside some of the brightest minds in the industry, and work on real projects finding real solutions. Work with us and you'll get:\n\n\n<ul>\n<li>Competitive wages</li>\n<li>Ongoing career development resources</li>\n<li>The opportunity to work on cutting-edge projects</li>\n<li>Meaningful projects that solve problems</li>\n</ul>\n\n<strong>Duration:</strong>\n<br><br>\nMay 2019-August 2019\n<br><br>\n<strong>Essential Duties &amp; Responsibilities:</strong>\n\n<li>Provide data analysis leadership for the region by dissemination of technical expertise within Seeds Operations</li>\n<li>Work on data analysis initiatives and opportunities to improve the effectiveness of project development activities (reducing risk, quality improvements and reducing variability in operations)</li>\n<li>Provide statistical expertise to ensure tools generate statistically significant results, thereby, ensuring full value from employed resources</li>\n\n<strong>Qualifications</strong>\n<br><br>\n<strong>Qualifications:</strong>\n\n<li>Students who are in their fourth year of study (Bachelor's degree) or pursuing an Advanced degree in the following field of studies: Mathematics, Statistics, Industrial Engineering or another closely related field of study are highly preferred</li>\n<li>Programming experience required, R Programing skills preferred</li>\n<li>2 years of classes in Statistics, Data Modeling, and Optimization</li>\n<li>Fluent in English</li>\n<li>All applicants must be eligible to work in the US</li>\n\n<strong>Additional Knowledge, Skills, Traits &amp; Abilities:</strong>\n\n<li>Qualification in statistics / data analysis</li>\n<li>Sound analytical and problem solving /solid IT skills, including a background in R Shiny</li>\n<li>Studies in data driven problem solving and graphical analysis</li>\n<li>Studies in using regression, data modelling and experimental design</li>\n<li>Ability to convey the right level of detail to the right audience verbally, in writing, or by presentations and ability to judge when and who to communicate key information</li>\n<li>A passion and enthusiasm for statistics in terms of converting data into useful information to drive business value</li>\n<li>Ability to influence and change current ways of working to develop a more scientific approach in the way we design experiments and interpret results</li>\n<li>Collaboration-The ability to work with individuals who come from diverse backgrounds</li>\n<li>Autonomous-An independent individual who is self-motivating and needs little supervision</li>\n<li>Detail/Accuracy Oriented-All procedures and policies must be understood and followed</li>\n<li>Proficiency in Microsoft Office (Word, Excel, PowerPoint)</li>\n\nWork Level: XZ\n<br><br>\nSyngenta is an Equal Opportunity Employer and does not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status.\n<br><br>\n<strong>Syngenta Contact Information:</strong>\n<br>\nIf you need assistance during the application process, please contact the Service Desk at\n<br><br>\nFamily and Medical Leave Act (FMLA)\n<br><br>\n<strong>(********************************************************</strong>\n<br><br>\nEqual Employment Opportunity Commission's (EEOC)\n<br><br>\n<strong>(*********************************************************</strong>\n<br><br>\nEmployee Polygraph Protection Act (EPPA)\n<br>\n<strong>(********************************************************</strong>"}