{"job title": "RD Scientist 1: Weed Control", "company": "Syngenta", "city state": "– Vero Beach, Florida", "rating": "3.4", "job description": "Job Description<br>\n<br>\nR &amp; D Scientist 1: Weed Control<br>\n(********)<br>\n<br>\nAbout Syngenta<br>\n<br>\nSyngenta is a leading agriculture company helping to improve global food security by enabling millions of farmers to make better use of available resources. Through world class science and innovative crop solutions, our 28,000 people in over 90 countries are working to transform how crops are grown. We are committed to rescuing land from degradation, enhancing biodiversity and revitalizing rural communities.<br>\n<br>\nAbout this Job:<br>\n<br>\nPart of a highly motivated research team at the Vero Beach Research Center. Design, initiate, and conduct research and development trials and projects including greenhouse, lab, growth chamber, and field studies with the main focus to support the North American Weed Control program. Provide technical support for registered products in support of Sales and Marketing efforts. Support the Global Herbicide Research Team. Complete projects as a critical part of promoting new active ingredients or supporting current products. Act as field project coordinator (FPC) for assigned projects.<br>\n<br>\nEssential Duties &amp; Responsibilities:<br>\n<br>\n*Conduct and coordinate high quality trials, contributing to the biological profiling and label development of herbicides, GMO traits, and adjacent technology<br>\n*Contribute to or lead project planning and defining experimental objectives; ensuring trial implementation; generating or acquiring data and information<br>\n*Summarize trial data and provide recommendations, identify development opportunities for product label expansion or further research<br>\n*Work with team members, Technical Product Leads and other stakeholders on trial design and implementation<br>\n*Provide technical support and training; coordinate demonstration trials for training/education for internal and external persons, participate in various site tours for internal and external groups<br>\n*Provide technical data and information in support of special local, state, regional, and national labeling actions<br>\n<br>\nQualifications<br>\n<br>\n*Ph.D. degree, or M.S. degree with commensurate experience (a minimum of 5 years) in weed science<br>\n*Position requires substantial applied crop protection field research experience, and training/experience in greenhouse.<br>\n*Lab research experience preferred<br>\n<br>\nAdditional Knowledge, Skills, Traits &amp; Abilities:<br>\n<br>\n*Excellent analytical, organizational, and people skills. Knowledge of statistical analyses.<br>\n*Skilled in interacting and communicating with internal and external customers and peers.<br>\n*Excellent oral and written communication, and presentation skills, flexibility in shifting among projects.<br>\n*Excellent time management skills<br>\n________________________________________<br>\nSyngenta is an Equal Opportunity Employer and does not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status.<br>\n<br>\nSyngenta Contact Information:<br>\nIf you need assistance during the application process, please contact the Service Desk at ***************************<br>\n<br>\nFamily and Medical Leave Act (FMLA)<br>\n(********************************************************<br>\n<br>\nEqual Employment Opportunity Commission's (EEOC)<br>\n(*********************************************************<br>\n<br>\nEmployee Polygraph Protection Act (EPPA)<br>\n(********************************************************"}