{"job title": "Data Scientist", "company": "Syrinx", "city state": "– Framingham, MA", "rating": "NA", "job description": "<strong>Data Scientist Bose Retail</strong>\n<br>\n<strong><u>About This Role</u></strong>\n<br>\nWe need actionable intelligence as much as the next retail team - but even more so as we are pushing boundaries in retail and technology. The Retail Data Scientist will build internal and external data products to service our Retail Vertical and company alike. We are still small when it comes to <em>data collection <strong>and</strong> analysis</em>, so you should be comfortable working on a variety of things.\n<br>\nWe have just engaged with Qualtrics as our customer experience management system. We need this role to build this process and toolset out for us, developing dashboards, integrating our data set, and doing analysis to derive insights to catapult our customers experiences to the forefront of the retail industry!\n<br>\nYoull be a driving force in the evolution of a billion dollar organization! Your impact will empower business leaders to quickly &amp; accurately make decisions in a way that will ensure another 50 years of global dominance in sound technology.\n<br>\n<strong><u>What You Will Do</u></strong>\n\n\n<ul>\n<li>We have an immature data infrastructure, but mature datasets and wed like someone to interrogate this data relentlessly.</li>\n\n<li>We need you to create models from scratch ensuring sustainability to where the addition of new variables is as simple as updating a query; most of the dirty work is already done. Think Jupyter notebooks and meetings with internal business partners.</li>\n\n<li>We need you to work directly with our product, building data scientific solutions that empower our retail stores and company as a whole.</li>\n\n<li>We need you to build machine learning models and productionize them yourself (This is Key!).</li>\n\n<li>These models should predict customer retention, analyze sales &amp; employee data in real time (sales, demo's, actions); offer insight into how stores compare with each other (and what the variables are), improve sales, employee operational flows, and much more. <u>The skys the limit!!!</u></li>\n\n<li>We hope the outcome of your contributions will offer true dashboards resulting from data consolidation from the variety of sources that we have driving the Retail vertical forward into the 21st century. From store to country level, customer to employee - we have data points that need to be dash-boarded from the minutia to the state-region-country level.</li>\n\n<li>To accomplish our goals we need you to design and implement statistical experiments around business decisions &amp; build pipelines to pull in new sources of data for your models.</li>\n</ul>\n\n<strong><u>What makes you an ideal candidate:</u></strong>\n\n\n<ul>\n<li>1-4 years of Data Science experience in a large progressive and technology driven company.</li>\n\n<li>Relative fluency with Python / Pandas / Scikit-Learn and a deep desire to improve. We value Data Scientists who can build models as well as put them into production.</li>\n\n<li>Experience building predictive models</li>\n\n<li>Strong understanding of probability, simulation, and statistical inference</li>\n\n<li>Experience writing SQL</li>\n\n<li>A git-based workflow</li>\n\n<li>Experience working with Qualtrics is a plus</li>\n</ul>\n\n<strong><u>Hopefully you are experienced with:</u></strong>\n\n\n<ul>\n<li>NLP and word2vec</li>\n\n<li>Time Series Analysis</li>\n\n<li>Data visualization / exploration tools (especially Looker)</li>\n\n<li>Data Flow Tools : Think Qualtrics</li>\n\n<li>Columnar databases (especially Redshift)</li>\n\n<li>Document databases (especially Elasticsearch)</li>\n\n<li>AWS</li>\n\n<li>Postgres</li>\n\n<li>Apache Spark</li>\n\n<li>Designing data architecture from table to dashboard</li>\n</ul>"}