{"job title": "Junior Data Scientist", "company": "SysMind ", "city state": "– : Cincinnati, OH", "rating": "3.3", "job description": "<div>\nBasic Job Information</div><br>\n\n<div> <strong>Joborder Id</strong> : 81477</div> <div> <strong>Title</strong> : Junior Data Scientist</div> <div> <strong>Location</strong> : Cincinnati, OH</div> <div> <strong>Position Type</strong> : Full Time</div> <div> <strong>No of Opening</strong> : 1</div><br>\n\n<div>\nJob Description</div>\n<br>\n<div> \n<div>· \n<br>\nExperience using Statistical and Machine Learning algorithms on real data, in academia and/or commercial environments.</div> <div>· \n<br>\nExperience with linear algebra, especially sparse systems</div> <div>· \n<br>\nExcellent and wide-ranging experience in supervised and unsupervised learning. Reinforcement learning a plus.</div> <div>· \n<br>\nExperienced in the use and design of logistic regression, support vector machines, ensemble trees, neural networks. Optimization problems a plus</div> <div>· \n<br>\nFamiliarity and experience with the standard machine learning packages, such as numpy, scipy scikit-learn, TensorFlow, keras and Theano</div> <div>· \n<br>\nDeep knowledge in any of the flavors of SQL, especially Oracle. <em>In-database analytics is a plus</em></div> <div>· \n<br>\nExperience in data munging, data cleansing etc.</div> <div>· \n<br>\nExperience in feature selection, feature engineering.</div> <div>· \n<br>\nExperience in the development of recommender systems.</div> <div>· \n<br>\nExperience with Hadoop, HDFS, Hive, Spark and MLlib.</div> <div>· \n<br>\nCandidate should be very client oriented, proactive, innovative, problem solver.</div> <div>· \n<br>\nShould be conversant with best practices in data sciences, data mining, and software development.</div> <div>· \n<br>\nExperience with REST API</div> <div>o \n<br>\nVery Good Knowledge on one and more Statistical Tool like R/Python</div> <div>o \n<br>\nSolid hands-on experiences with Hadoop technology components such as HDFS, HBase, Cassandra, Kafa especially with Spark and Spark Streaming</div> <div>o \n<br>\nFamiliar with programming concepts with C/C++ and Java.</div> <div>o \n<br>\nVery Good Knowledge on working with MS Office especially PowerPoint, Excel</div>\n<br>· \n<br>\nGood to have experience in cloud based services (data management, compute, storage, machine learning, IoT, etc.) using Google/Microsoft suite of products\n<br><br>\n· \n<br>\nExcellent communication and interpersonal skills, with proven ability to take initiative and build strong, productive relationships.\n<br><br>\n· \n<br>\nPersonal gravitas with demonstrated ability to establish credibility with senior executive teams at large enterprise level\n<br><br>\n· \n<br>\nLead customer interactions, while facilitating a wide range of activities.\n<br><br>\n· \n<br>\nInfluence and transform the end-to-end delivery process to maximize the value Customers gain from Analytics\n<br><br>\n· \n<br>\nShould be able to quickly assess the areas in need of attention with a customer and propose solutions that can improve Customer’s ability to succeed.\n<br><br>\n· \n<br>\nEngage with the customer to drive improvements and scale based on past experiences.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<br><br>\n● BA/BS degree or equivalent practical experience.\n<br><br>\n● Experience with the delivery of engagements using Big Data Analytics techniques.</div>"}