{"job title": "Scientist - III", "company": "System One", "city state": "– West Point, Pennsylvania", "rating": "3.3", "job description": "Joule, a System One division is seeking a Senior Molecular Scientist for a contract position. With more than 6,000 employees and roughly 40 offices throughout the U.S. we provide scientific, clinical, engineering, energy, IT, legal and administrative staffing services. For more than 40 years, we have delivered workforce solutions and integrated services to clients nationally.\n<br><br>\n<strong>Must Have:</strong>\n<br><br>\nExtensive experience with molecular biology assays, examples include but are not limited to DNA and RNA isolation, real-time qPCR, and RT-PCR.\n\n\n<ul>\n<li>Use of electronic laboratory notebooks is desirable</li>\n</ul>\n\nDegree in molecular biology, immunology, cell biology, biochemistry or a related biological sciences discipline\n\n\n<ul>\n<li>MS with 3-5 yrs of related experience</li>\n</ul>\n\n<strong>Qualifications:</strong>\n<br><br>\n<strong>Required Experience</strong>\n\n\n<ul>\n<li>Trained in GLP requirements and/or experience working in a regulated laboratory environment.</li>\n<li>Extensive experience with molecular biology assays, examples include but are not limited to DNA and RNA isolation, real-time qPCR, and RT-PCR.</li>\n<li>Use of electronic laboratory notebooks is desirable. / Education Minimum Requirement</li>\n<li>Degree in molecular biology, immunology, cell biology, biochemistry or a related biological sciences discipline</li>\n<li>MS with 3-5 yrs of related experience</li>\n</ul>\n\nMajor activities will include performing and analyzing molecular biology methods and may also include development, troubleshooting and validating molecular bioanalytical methods. The candidate may have to interpret scientific data generated from one's own experiments or other generated data. This individual understands full accountability for the data they he/she generates within the regulated laboratory.\n<br><br>\n<strong>Responsibilities:</strong>\n<br><br>\nPosition Description Seeking an individual with comprehensive knowledge of the principles and concepts of molecular biology as it pertains to method development and testing of clinical and/or pre-clinical samples. Major activities will include performing and analyzing molecular biology methods and may also include development, troubleshooting and validating molecular bioanalytical methods. The candidate may have to interpret scientific data generated from one's own experiments or other generated data. This individual understands full accountability for the data they he/she generates within the regulated laboratory."}