{"job title": "Data Scientist", "company": "Systems Planning and Analysis, Inc", "city state": "– Alexandria, VA", "rating": "4.0", "job description": "<div> Data Scientist</div>\n<br>\n<div> \n<div> Req Code CD18-155</div> <div> Job Type Data Scientist</div> <div> Location Alexandria, VA</div> <div> Clearance Level Top Secret</div> </div><div> The Civil and San Diego (CSD) Operations is responsible for a broad range analytical, engineering, independent assessments, strategic planning, and technology research, development, testing and evaluation (RDT&amp;E) programs in support of new SPA markets.</div> \n<br>\n<div><strong>Requirements:</strong></div><div> •\tBachelors’ Degree in Mathematics, Operations Research, Statistics, Computer Science, Engineering, or a related discipline.\n\n\n<ul>\n<li>5+ years of related experience, preferably in national security related programs.</li>\n<li>3+ years’ experience with data analytics (e.g., descriptive statistics, predictive modeling, data visualization), this can include significant academic projects.</li>\n<li>Experience with one or more scripting or high-level programming languages such as Python, R, MATLAB, Java.</li>\n<li>Experience with designing and developing automated analytic software, techniques, and algorithms.</li>\n<li>Proficient in developing relational databases and mining data.</li>\n<li>Proven ability to prioritize and execute workload to meet requirements and deadlines.</li>\n<li>Experience developing compelling written and visual communications that are clear, concise, and suited to the audience.</li>\n<li>Advanced knowledge of Microsoft Office Suite (e.g., Excel, Access, Word, PowerPoint).</li>\n<li>Possess an active SECRET clearance with the ability to obtain TS.</li>\n</ul>\n\n<strong>Desired:</strong>\n\n\n<ul>\n<li>Master’s Degree.</li>\n<li>Experience providing analytical support to the Department of Homeland Security.</li>\n<li>Experience with discrete system simulation software such as Arena or ExtendSim.</li>\n<li>Experience with ArcGIS.</li>\n<li>Experience within cybersecurity and/or critical infrastructure domains.</li>\n<li>Active TS clearance.</li>\n<li>DHS Suitability.</li></ul></div> \n\n\n<div><strong>Job Description:</strong></div><div>The Data Scientist will provide advanced analytical support to the Department of Homeland Security (DHS) and will apply science-based techniques and critical thinking to help inform and improve the Department’s decision-making abilities for preparation, response and recovery to manmade and natural disasters and impacts on the Nation’s critical infrastructure. Apply principles of mathematics and statistics, computer science, software development, and data science fundamentals to design and implement an analytical capability with modern tools, workflow processes, and data visualizations. Contribute to the development of capabilities such as text analytic engines for automated document review and metadata discovery dashboards.<br><br><strong>\n<br>\n<strong>Job duties/responsibilities:</strong>\n\n\n<ul>\n<li>Assist in identifying, prioritizing, and executing programs to help demonstrate and expand analytical capabilities.</li>\n<li>Develop data standards and frameworks to collect, integrate and link, and manage data.</li>\n<li>Build data governance and structure for enterprise data integration.</li>\n<li>Run, develop, and document models and analytic methods.</li>\n<li>Create software code to extract and transform data for use in analysis.</li>\n<li>Develop automated analytic algorithms to assist with data management.</li>\n<li>Develop plans of action and timetables in order to meet established deadlines</li>\n</ul>\n\n#CJ</strong></div><strong>\n<br></strong>"}