{"job title": "Principal Data Scientist", "company": "T-Mobile", "city state": "– Bellevue, WA", "rating": "4.0", "job description": "Job Description:<br><br>This role is tasked with partnering with our technical teams and outside partners to design, build, and report on spectrum management data systems that will drive our ability to create value, both for consumers and for T-Mobile. The Principal Data Scientist is an expert in emerging data engineering, analysis, visualization, and integration technologies relevant to operational data systems. The ideal candidate will have a deep knowledge of complex data structures such as networks and graphs, a strong ability to learn challenging and ever-changing business landscape, as well as a strong vision of how data science and engineering can create value for companies.<br><br>Responsibilities:<br>\n\n<div>\n\n<ul>\n<li>Partner with our Engineering, Regulatory, Legal and Corporate Development teams as well as third party companies to define and build the strategy for our spectrum data and analytic technology stack.</li></ul></div>\n<br>\n<div>\n\n<ul>\n<li>Lead the implementation, assessment and standardization of toolkits for our data science, measurement science, insight management and visualization teams.</li></ul></div>\n<br>\n<div>\n\n<ul>\n<li>Identify critical and emerging technologies that will support and extend our software development and quantitative analytic capabilities.</li></ul></div>\n<br>\n<div>\n\n<ul>\n<li>Provide senior level guidance to the data science and measurement science teams on approach and methodologies</li></ul></div>\n<br>\n<div>\n\n<ul>\n<li>Also responsible for other Duties/Projects as assigned by business management as needed.</li></ul></div>\n\n<br><strong>Qualifications:</strong>\n<br><br>\n<strong>Educational Requirements:</strong>\n<br>\nMaster/Advanced Degree<br><br>Research, Applied Analytics, or other quantitative field such as Statistics, Econometrics, Applied Math or Behavioral Sciences\n<br><br>\n<strong>Work Experience:</strong>\n<br>\nMore 10 years Experience in a senior level data science role.\n<br>\n4-7 years Experience in working with third party data assets.\n<br>\n4-7 years Experience in AWS, Hadoop, Web data, Social data.\n<br>\n4-7 years Experience in telecom industry.<br><br>Minimum Qualifications:\n<br><br>\n<strong>Knowlege, Skills, and Abilities:</strong>\n<br><br>\nAWS, Hadoop, Data Analysis, Telecommunications.\n<br><br>\n<strong>Company Profile:</strong>\n<br><br>\nAs Americas Un-carrier, T-Mobile USA, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. The companys advanced nationwide 4G and 4G LTE network delivers outstanding wireless experiences for customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile USA. Inc. provides services through its subsidiaries and operates its flagship brands, T-Mobile and Metro by T-Mobile. For more information, please visit http://www.t-mobile.com\n<br><br>\n<strong>EOE Statement:</strong>\n<br><br>\nWe Take Equal Opportunity Seriously - By Choice. T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination or harassment based upon any of these factors is wholly inconsistent with our Company values and will not be tolerated. Furthermore, such discrimination or harassment may violate federal, state, or local law.\n<br><br>"}