{"job title": "Data Scientist", "company": "T. White Parker Associates", "city state": "– Washington, DC", "rating": "4.2", "job description": "<div><strong>Description</strong>\n<br>\nThe Data Scientist’s role is to harness vast amounts of data to optimize business results. He/she will exercise their knowledge of descriptive and multivariate statistical techniques and applications, and database analysis tools and techniques to develop strategic insights to drive business goals. Data scientists are more excited about what they can learn with data, than they are about what is already known. The data scientist works hard at advancing the state-of-the-art in how data is applied to solve problems in our industry. They are also responsible for teaching data analysts and software engineers how to work effectively with vast quantities of data.</div><br>\n\n<div><strong>Responsibilities</strong></div><br>\n\n<div><strong>Strategy &amp; Planning</strong>\n\n\n<ul>\n<li>Work with integrated client team to define metrics, guidelines, and strategies for effective use of algorithms and data.</li>\n<li>Serve as the lead/advisory statistician to identify, design, and build appropriate datasets for complex experiments.</li>\n<li>Create data mining and analytics architectures, coding standards, statistical reporting, and data analysis methodologies.</li>\n<li>Establish links across existing data sources and find new, interesting mash-ups.</li>\n<li>Coordinate data resource requirements between analytics team and engineering teams.</li>\n<li>Work with product managers, engineers, and analytics team members to translate prototypes into production</li>\n<li>Support expanding prototypes into broader production applications</li>\n<li>Assist in the development of data management policies and procedures.</li>\n<li>Develop best practices for analytics instrumentation and experimentation.</li></ul></div>\n\n\n<div><strong>Acquisition &amp; Deployment</strong>\n\n\n<ul>\n<li>Conduct research and make recommendations on big data infrastructure, database technologies, analytics tools, services, protocols, and standards in support of procurement and development efforts.</li>\n<li>Drive the collection of new data and the refinement of existing data sources.</li></ul></div>\n\n\n<div><strong>Operational Management</strong>\n\n\n<ul>\n<li>Develop algorithms and predictive models to solve critical business problems.</li>\n<li>Develop tools and libraries that will help analytics team members more efficiently interface with huge amounts of data.</li>\n<li>Analyze large, noisy datasets and identify meaningful patterns that provide actionable results.</li>\n<li>Develop and automate new enhanced imputation algorithms.</li>\n<li>Create informative visualizations that intuitively display large amounts of data and/or complex relationships.</li>\n<li>Provide and apply quality assurance best practices for data science services across the organization.</li>\n<li>Develop, implement, and maintain change control and testing processes for modifications to algorithms and data analytics.</li>\n<li>Collaborate with database and disaster recovery administrators to ensure effective protection and integrity of data assets.</li>\n<li>Manage and/or provide guidance to junior members of the analytics team.</li></ul></div>\n\n\n<div><strong>Position Requirements</strong></div><br>\n\n<div><strong>Formal Education &amp; Certification</strong>\n\n\n<ul>\n<li>Graduate or post graduate university degree in the field of computer science, mathematics, or statistics, and/or 7+ years equivalent work experience.</li></ul></div>\n\n\n<div><strong>Knowledge &amp; Experience</strong>\n\n\n<ul>\n<li>Extensive experience solving analytical problems using quantitative approaches.</li>\n<li>Comfort manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources</li>\n<li>Fluency with at least one scripting language such as Python, Perl etc.</li>\n<li>Familiarity with relational, SQL and NoSQL databases.</li>\n<li>Expert knowledge of statistical analysis tools such as IBM Cognos Analytics, Tableau etc.</li>\n<li>Experience with very large datasets a must.</li>\n<li>Knowledge of map/reduce framework (hive/pig other tools for accessing data in Hadoop/HBase cluster systems) a plus.</li>\n<li>Experience in relevant software development</li>\n<li>Project management experience.</li>\n<li>Good understanding of the organization’s goals and objectives.</li>\n<li>Knowledge of applicable data privacy practices and laws.</li></ul></div>\n\n\n<div><strong>Personal Attributes</strong>\n\n\n<ul>\n<li>A strong passion for empirical research and for answering hard questions with data.</li>\n<li>A flexible analytic approach that allows for results at varying levels of precision.</li>\n<li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner.</li>\n<li>Good written and oral communication skills.</li>\n<li>Strong technical documentation skills.</li>\n<li>Good interpersonal skills.</li>\n<li>Highly self-motivated and directed.</li>\n<li>Keen attention to detail.</li>\n<li>Ability to effectively prioritize and execute tasks in a high-pressure environment.</li>\n<li>Strong customer service orientation.</li>\n<li>Experience working in a team-oriented, collaborative environment.</li></ul></div>\n"}