{"job title": "Data Engineer, People Analytics", "company": "Taboola", "city state": "– New York, NY", "rating": "3.9", "job description": "Read something interesting online today? There's a good chance it reached you because of our technology.\n<br><br>\nTaboola is the world's leading content discovery platform, serving 360B recommendations to over 1B unique visitors each month on the web's most innovative publisher sites, including NBC, USA Today, The Weather Channel, Tribune and Fox Sports.\n<br><br>\n<strong>What is People Analytics?</strong> For the last 3 years Taboola has doubled its headcount every 18 months. This means our organizational make-up is changing rapidly, and the HR function is necessarily responding to that change with our own innovations. People Analytics is playing a leading role in transforming HR into a data-driven insights center for our on-going future success.\n<br><br>\n<strong>What does a Data Engineer on this team do?</strong> The engineer will build and maintain systems to enable data-driven decision-making in the People Operations at Taboola. People Analytics has built a technology and data platform that provides recruiters, hiring managers, people managers, senior leadership, and more with analytic insights and self-service tools. The engineer will maintain and expand this platform through efficient database and software development techniques and open communication accessible to non-technical HR colleagues.\n<br><br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Build and maintain the infrastructure to generate useful conclusions and actionable recommendations with datacustom-built systems, 3rd party systems, and datasets</li>\n<li>Create, support and maintain data models, reports and dashboards as well as find creative solutions for a variety of challenges facing our growing data requirements</li> \n\n<li>Effectively communicate with various stakeholders within HR and outside, gather requirements, design and document solutions, and resolve conflicts</li>\n<li>Ensure the smooth on-going operation, security, and customization of our HRIS (BambooHR &amp; ADP) and our ATS (Greenhouse)</li>\n<li>Own and manage multiple reporting, data, and process improvement projects both on an ongoing and an ad-hoc basis</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>Experience in a data warehouse environment with large and complex data sets, including systems integrations and ETL</li>\n<li>Familiarity in database technologies (e.g. Amazon Redshift, Vertica) and SQL</li>\n<li>Familiarity with BI solutions (previous experience in Alteryx is a plus)</li>\n<li>Training in computer science, statistics, engineering, operations research, or related field, graduate-level or equivalent</li>\n<li>Minimum of 3-4 years of professional working experience demonstrating excellent quantitative skills, ability to communicate professionally, and manage projects of increasing complexity</li>\n<li>Strong independent, as well as collaborative, problem solving and research skills</li>\n<li>Ability to multi-task across a range of work streams/projects with constantly shifting priorities</li>\n<li>Ability to handle confidential material discreetly</li> \n</ul>\nTaboola is an equal opportunity employer and we value diversity in all forms. We are committed to creating an inclusive environment for all employees and believe such an environment is critical for success. Employment is decided on the basis of qualifications, merit, and business need.\n<br><br>\n#LI-AY1\n<br><br>\n#GD"}