{"job title": "Data Scientist", "company": "Tailored Management", "city state": "– Jacksonville, FL", "rating": "4.1", "job description": "This is an excellent opportunity to join a family of forward-thinking companies that touches the lives of more than 15 million consumers and interacts with nearly 500 non-profits to fulfill our mission of helping people and communities achieve better health.<br> <br><strong>Data Scientist | Jacksonville, FL</strong><br> <br><strong>SUMMARY</strong><br>Candidate should have experience in some form of SQL (e.g. HIVE, PostgreSQL, MSSQL, etc.) and either Python or R for statistical application development. Experience in a Hadoop environment and / or statistical development tool (e.g. RapidMiner, Knime) a plus.<br><br><br><strong>RESPONSIBILITIES</strong><br>• Develop and communicate a deep understanding of client needs, perform analytical deep-dives to identify problems, opportunities and specific actions required<br>• Develop reproducible and deployable statistical applications on platform such as R/Python/Spark using techniques such as Regression, SVM, and Neural Networks<br>• Implementing processes that improve and lead to greater data quality<br>• Conducting statistical analyses to develop strategies<br>• Documenting all processes and research<br>• Building new algorithms and model training<br>• Executing projects involving analytics<br>• Identifying data patterns and trends<br>• Analyzing data to develop predictive models<br>• Creating, managing, and maintaining analytically rigorous data<br> <br><strong>REQUIRED SKILLS</strong><br>• Possessing a solid machine learning foundation<br>• Proven record of successful statistical product delivery<br>• Ability to execute health insurance use cases via statistical applications such as R or Python<br>• Efficiently access data via multiple vectors (e.g. NFS, FTP, SSH, SQL, Sqoop, Flume, Spark)<br>• Significant experience with SQL and working with large datasets required<br>• Work with cross-functional teams (including Finance, IT areas, and Operational Areas) to rapidly execute and iterate<br>• Noting anomaly detection and running diagnostics<br>• Performing graphical model analysis<br>• Strong verbal and written communication skills<br>"}