{"job title": "Senior Data Scientist", "company": "Tapjoy", "city state": "– San Francisco, CA", "rating": "3.7", "job description": "Join the Mobile Future with Tapjoy\n<br><br>\nTapjoy is a creative workplace, comprised of people with different backgrounds, cultures, skill sets, and global perspectives. With offices all over the globe, Tapjoy provides mobile engagement and monetization services for leading advertisers and app developers. Advertisers rely on Tapjoy's diverse suite of rewarded Interplay ads including video and rich media to impact performance. Developers utilize our technology and mobile expertise to acquire and monetize users. The Tapjoy SDK is currently embedded in over 20,000 mobile apps, reaching 620 million monthly active users. Additionally, Tapjoy works with Fortune 500 brands and the Top 200 grossing app developers.\n<br><br>\nHere at Tapjoy, we promote a Joyful, Engaged, Trustworthy, and Innovative workplace with our company core values, and regularly celebrate and recognize the people who embody our values. Tapjoy believes its people are its greatest investments and we take extra care to support your time inside and outside of work with a multitude of benefits. In order to maintain what makes us so special here, we are committed to continued education and involvement in our community to protect and expand our one-of-a-kind workplace.\n<br><br>\n<strong>Position Title: Senior Data Scientist</strong>\n<br><br>\n<strong>Position Description/Responsibilities:</strong>\n<br><br>\nTapjoy is a mobile advertising and monetization platform whose unique Mobile Value Exchange model allows users to select personalized advertisements with which to engage for virtual rewards or premium content. Tapjoy helps unlock mobile joy by empowering more than one billion mobile users who choose to watch videos, subscribe to services, install applications and participate in other types of advertisements in exchange for virtual rewards they can use in their favorite apps. Tapjoy's turnkey in-app advertising platform helps developers acquire cost-effective, high-value new users and monetize their applications, while its powerful advertising marketplace lets brand advertisers reach a global mobile audience. To make this personalized mobile advertising system possible, it requires huge size of data processing pipelines, data analyses, feature extraction, model building, algorithm testing, maintaining and development of algorithms from data science perspective.\n<br><br>\nEssential duties and responsibilities may include, but are not limited to, the following as additional roles and/or focus will be needed as the company and department continues to grow and evolve.\n\n<ul>\n\n\t<li> Build a data/stats-driven ad optimization system, working closely with the product team</li>\n\n<li>Constantly experiment and improve the relevancy of the recommendation/ad optimization system</li>\n\n<li>Invent and improve algorithms given a set of business cases and help implement them in production</li>\n\n<li>Work with the product/engineering team to implement, test and deploy the solution on Hadoop cluster</li>\n</ul>\n<strong>Core Competencies include:</strong>\n\n<ul>\n\n\t<li>Passionate about building data science product</li>\n\n<li>Great Communicator about complex algorithmic works as easy-to-understand story telling</li>\n\n<li>Self-Starter about game-changing algorithms and motivated to test at billions scaled data</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n\n\t<li>B.S./M.S., in Computer Science or similar applied technical field</li>\n\n<li>Must have hands-on Machine-learning related industry projects</li>\n\n<li>Solid object-oriented programming skill (Java) and at least one scripting language such as Python/Ruby/Perl</li>\n\n<li>Ability to work in a fast paced, test-driven collaborative and iterative programming environment</li>\n\n<li>Understand major recommendation algorithms (Collaborative Filtering, Matrix factorization, Naive Bayes, Boosting method)</li>\n\n<li>Understand statistical hypothesis testing (ex. A/B testing)</li>\n\n<li>Understand various ad optimization algorithms (CTR prediction, eCPM optimization, user targeting and segmentation, RTB and real-time optimization)</li>\n\n<li>Strong understanding of Algorithms, Data Structures and Machine Learning / Data Mining</li>\n\n<li>Understanding of RDBMS, SQL and NoSQL alternatives</li>\n\n<li>Experience with Hadoop/Hbase/Pig or MapReduce/Mahout/Bigtable is a plus</li>\n</ul>\n<strong>Tapjoy is a one-of-a-kind workplace, comprised of people with different backgrounds, cultures, skill sets and global perspectives. In order to maintain what makes us so special here, we support work-life balance both inside and outside the office in many ways.</strong>\n<br><br>\nIf you want to learn about building an amazing team with industry-leading technology, you want to surround yourself with brilliant, passionate entrepreneurial teammates at Tapjoy.\n<br><br>\nTapjoy is an equal opportunity employer. We believe that diversity and inclusion lead to stronger, more innovative teams and better business results; we want to draw from the broadest talent pool possible and encourage qualified applicants. Tapjoy does not discriminate on the basis of sex, race, ethnicity, color, age, sexual orientation, gender (including identity and expression), disability (mental or physical), religion, national origin, citizenship, marital status, military or veteran status, or any other protected classification protected by applicable law; we will provide reasonable accommodations for qualified individuals with disabilities, and pursuant to applicable fair chance ordinances, we will consider for employment qualified applicants with arrest and conviction records.\n<br><br>\nFor more information, please visit www.tapjoy.com."}