{"job title": "Data Scientist", "company": "TASC", "city state": "– Springfield, VA", "rating": "3.1", "job description": "Engility is seeking a number of Data Scientists for an upcoming program with our customer in Springfield, VA. The qualified Data Scientist will define, execute, and analyze the results of complex studies of collection system performance to increase understanding and improve the performance of the GEOINT collection architecture, in addition to supporting the adoption of new source capabilities and novel collection strategies across the GEOINT community. These analyses range from tactical assessments to improve satisfaction of individual collection requirements in response to a Source Strategies Analyst request, to world-wide impact assessments of changes to requirements or the collection architecture in support of senior decision-makers. Investigates and develops new analytic techniques for the team, to include novel approaches to mine, model, and evaluate the expanse of available performance data to identify trends in performance that merit further investigation or exposure to office leadership or the broader NSG. Plays an active role in the transformation of Source Operations by advancing the integration of performance data from disparate sources (e.g. commercial, foreign, airborne), supporting the transition to GEOINT Supplier Broker (GSB) Supply Chain Management (future performance analytics and operational tuning environment), and developing new performance-related dashboards and visualizations to expose performance data to a range of customers. Create tradecraft and training documentation/CONOPS to support the mission. Duties include but are not limited to:\n<br>\nPerformance/Data Analyst develop and apply methods to identify, collect, process, and analyze large volumes of data to build and enhance products, processes, and systems. The contractor shall conduct data mining and retrieval, and apply statistical and mathematical analyses to identify trends, solve analytical problems, optimize performance, and gather intelligence. The contractor shall visualize information using a range of tools (e.g., GIS, R), develop scripts and algorithms, create explanatory and predictive models, and conduct comparative analyses to address complex problems.\n<br>\nDevelop and apply quantitative and qualitative analytic methods to identify, collect, process, and analyze large data sets for specified purposes\n<br>\nDevelop and refine collection and analytic methods and collaborates with analysts to answer key intelligence questions\n<br>\nVisualize information, conducts comparative analysis, develops scripts, algorithms, or models, and develops report on results of data analysis\n<br>\nPerformance/Data Analysts apply tools and algorithms to identify trends and patterns in data. They communicate with stakeholders and conduct research to develop an understanding of relevant programs and requirements. These analysts identify and collect data from various sources, evaluate the data to ensure that they meet analytic needs, and prepare the data for analysis. They also select, apply, and assess analytic models and techniques, and review and verify the results. They prepare reports and briefings and consult with stakeholders to communicate findings.\n<br>\nThe Contractor shall possess the ability to think strategically; a demonstrated ability to operate in a dynamic environment; proven ability to deliver interoperable, enterprise-wide solutions; keen problem-solving skills; and strong interpersonal skills to work internally with different stakeholders and externally with academia, industry, and other agencies to develop and deliver corporate solutions. The contractor shall excel at leading innovation and navigating ambiguity, be adept at building coalitions, sharing expertise, mentoring, and will exemplify a customer-service mindset.\n<br>\nDocument their knowledge of tools and languages, and associated proficiency levels, as well as focus on the impact of their work.\n<br>\nWorking as a team to develop and deliver enterprise-wide solutions for complex data challenges.\n<br>\nDeveloping and applying methods by collecting, processing, and analyzing large volumes of data to build and enhance products, processes, and systems\n<br><br>\nQualifications:\n<br><br>\nDemonstrated proficiency conducting large scale data analysis at all stages (i.e., understand business goals/strategies, formulate analytic approach, perform data extraction and exploration, and interpret/translate results) to find scalable solutions to complex problem-sets or close knowledge gaps.\n<br>\nData visualization expertise including the use of common software tools (e.g. Tableau, matplotlib, etc.) and the use of data visualizations for exploratory data analysis.\n<br>\nProficiency in at least one of the following languages: Python, R, Java, or a similar language, as applied to programming access and manipulation of data.\n<br>\nProven ability to communicate ongoing work and findings to leadership and others through written, visual, and spoken reports and briefings.\n<br>\nBachelor of Science degree in statistics, mathematics, image science, remote sensing, earth science, physical science or related technical or scientific field and 7-10 years of related experience. For every one (1) year of education required, two (2) years of relevant work experience is considered the equivalent. The limit for use of this equivalency measure is one degree.\n<br><br>\nDesired Qualifications:\n<br>\nProven innovator and strategic problem solver.\n<br>\nAbility to create and thrive in emerging and ambiguous environments.\n<br>\nBe an effective collaborator in high performance, geographically distributed team environments.\n<br>\nEvidence of impactful contributions to broader academic, industry, and research communities, such as code, presentations, and publications.\n<br>\nProven ability to create tradecraft and training documentation/CONOPS to support the mission."}