{"job title": "Data Scientist", "company": "Taskrabbit", "city state": "– San Francisco", "rating": "4.1", "job description": "<strong>About TaskRabbit</strong><br><br>Each day brings more to-dos and less time to accomplish them. Whether someone needs a handyman, house cleaner, mover or delivery person, TaskRabbit delights clients by matching the right skilled person in minutes. With our support, our customers can accomplish it all not only today, but also on-demand to be their most productive self. On the other side of the marketplace we help our Taskers earn a living by setting their own prices, defining their working hours, and giving them control to help people when and how they want in the most supportive marketplace.\n<br><br>\nWe're a mission-driven company. Our culture is collaborative, pragmatic and fast-paced. We're looking for talented, entrepreneurially minded and data-driven people who also have a passion for helping people do what they love - and having a ton of fun while they're at it.<br><br><strong>About the job</strong>\n\n\n<ul>\n<li>conceiving, building and implementing predictive models of behavior for both sides of our marketplace</li>\n<li>developing and deploying data products into production environment</li>\n<li>finding and creating opportunities for business growth through data analysis and modeling</li>\n<li>testing and optimizing market parameters for optimal experiences for Clients, Taskers and the marketplace as a whole</li>\n</ul>\n\nTechnology, tools and toys<br><br>The Data Science team's primary toolkit/stack is built on the industry standard scientific and numeric packages in Python. We use the Jupyter Notebook system for exploration, analysis, visualization, collaboration, and prototyping. We have a Python-based production environment, which allows us to quickly move code from \"the laboratory\" to production deployment.\n<br><br>\nWe are heavily invested in AWS for both experimentation, development, testing and deployment and are looking to “lean-in” even further by utilizing more AWS products and services.<br><br>Qualifications<br><br>We are looking for candidates with:\n\n<ul>\n<li>Advanced degree in computer science/engineering/sciences, with a background in machine learning, predictive models, classification, data mining</li>\n<li>Minimum 2 years working professionally as a Data Scientist</li>\n<li>Being responsible for production data products and models</li>\n<li>Knowledge and experience with</li>\n\n\n<ul>\n<li>Jupyter notebook environment</li>\n<li>Pandas, numpy, scipy, scikit-learn</li>\n<li>Flask or similar web-based micro-services</li>\n<li>Spark</li>\n<li>AWS environment</li></ul>\n\n\n</ul>\nWe need someone who is interested and capable to dive into implementation, not a theoretician. There will be ample opportunity to learn on the job, but we need someone who already has some experience working with our technology and tools stack\n<br><br>\nWe also need someone who is looking for a broad, changing set of problems. Someone who is scrappy, motivated, and willing to hack ideas, models, and code equally. Also, someone who can communicate findings and insights clearly and coherently.<br><br><strong>Benefits &amp; Perks</strong><br><br>In addition to working with a stellar team of entrepreneurs and advisors, TaskRabbit employees get tons of perks:\n\n<ul>\n<li><strong>Challenge:</strong> The opportunity for growth in a fast-paced, progressive company is yours for the taking. Game on!</li>\n<li><strong>Monthly task stipend:</strong> Use the product you’re working on and outsource errands you don’t want to do.</li>\n<li><strong>Benefits:</strong> Great health coverage with dental and vision benefits (TR pays 100% premiums and pays for One Medical membership), 12 weeks, 100% paid parental leave, pre-tax commuter benefits and FSA, 401k plan + matching, 20 PTO days/year + 13 paid holidays</li>\n<li><strong>Education:</strong> A series of Lunch and Learn events (we call it “Learnch”), quarterly company-wide trainings, and an annual learning and development stipend for your personal use</li>\n<li><strong>Office:</strong> A huge, dog-friendly SOMA loft built to accommodate collaboration, with two fully- stocked kitchens and a game room. Free lunch every day!</li>\n<li><strong>Fun:</strong> Awesome off-site adventures, weekly meditation, yoga, annual charity events? Yes!</li>\n</ul>"}