{"job title": "Quantitative Analyst II – Model Validation", "company": "TD", "city state": "– Cherry Hill, NJ", "rating": "3.6", "job description": "Company Overview\n<br>\n<div><strong>About TD Bank, America’s Most Convenient Bank®</strong><br><br>TD Bank, America’s Most Convenient Bank, is one of the 10 largest banks in the U.S., providing more than 8 million customers with a full range of retail, small business and commercial banking products and services at approximately 1,300 convenient locations throughout the Northeast, Mid-Atlantic, Metro D.C., the Carolinas and Florida. In addition, TD Bank and its subsidiaries offer customized private banking and wealth management services through TD Wealth®, and vehicle financing and dealer commercial services through TD Auto Finance. TD Bank is headquartered in Cherry Hill, N.J. To learn more, visit www.tdbank.com. Find TD Bank on Facebook at www.facebook.com/TDBank and on Twitter at www.twitter.com/TDBank_US.\n<br><br>\nTD Bank, America’s Most Convenient Bank, is a member of TD Bank Group and a subsidiary of The Toronto-Dominion Bank of Toronto, Canada, a top 10 financial services company in North America. The Toronto-Dominion Bank trades on the New York and Toronto stock exchanges under the ticker symbol “TD”. To learn more, visit www.td.com.</div>\n<br>\n<strong>Job Description</strong>\n<br>\n<div>The Quantitative Analyst provides the quantitative analysis and validates advanced quantitative models to meet DFAST and CCAR requirement. In addition, the Quantitative Analyst provides highly specialized quantitative analytical and modeling support at the assigned line(s) of business.</div>\n<br>\n<strong>Requirements</strong>\n<br>\n<div>•\tProvides financial, analytical, modeling expertise to build quantitative models for DFAST and CCAR projects.\n\n\n<ul>\n<li>Conducts complex quantitative analysis as it applies to areas of responsibility, generally aligned to specific transactions and products.</li>\n<li>Performs statistical model assumptions’ tests for soundness of model theory.</li>\n<li>Hands on coding and building of quantitative models.</li>\n<li>Reviews model results and identifies unexpected results.</li>\n<li>May develop specialized analytical tools for projects or ongoing use.</li>\n<li>May develop conclusions and courses of action to rectify discrepancies as well as analyses.</li>\n<li>Develops and analyzes key metric and plan variances and related information.</li>\n<li>Develops analyses of performance and predictive data.</li>\n<li>Compiles and generates ad-hoc analytical reports.</li>\n<li>May lead additional research efforts, applying expertise in statistical analysis and modeling.</li>\n<li>Explores the best practice modeling techniques for model enhancement.</li><li>Must be eligible for employment under regulatory standards applicable to the position.</li></ul></div>\n\n\n<strong>Qualifications</strong>\n<br>\n<div>•\tGraduate’s degree or progressive work experience in addition to experience below\n\n\n<ul>\n<li>2-4 years modeling experience required</li>\n<li>In-depth knowledge of quantitative models and statistical analysis</li>\n<li>Ability to effectively interpret, select appropriate techniques, take independent action, communicate, and follow-through</li>\n<li>Strong communications skills, both written and verbal</li>\n<li>Strong interpersonal and consultative communication skills with well-developed presentation skills</li>\n<li>Ability to manage competing priorities effectively, making good decisions based on business priorities and objectives</li>\n<li>Practical knowledge of financial analysis techniques and methodologies</li>\n<li>Ability to employ complex analytical tools and statistics to perform analysis and forecasting of financial and other business information</li>\n<li>Proficiently use Microsoft Office tools to prepare and present analysis results to the audience</li>\n<li>Advanced skills in SAS and SQL</li>\n<li>Advanced level in statistical analysis and modeling tools</li></ul></div>\n\n\nHours\n<br>\n<div>40</div>\n<br>\nInclusiveness\n<br>\n<div>At TD, we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of our customers and communities in which we live in and serve, and creating an environment where every employee has the opportunity to reach her/his potential.\n<br><br>\nIf you are a candidate with a disability and need an accommodation to complete the application process, email the TD Bank US Workplace Accommodations Program at USWAPTDO@td.com . Include your full name, best way to reach you, and the accommodation needed to assist you with the application process.\n<br><br>\nEOE/Minorities/Females/Veterans/Individuals with Disabilities/Sexual Orientation/Gender Identity.</div>\n<br>"}