{"job title": "IT Data Analyst III (US)", "company": "TD Bank", "city state": "– Mount Laurel, NJ", "rating": "3.6", "job description": "Job Description:\n<br><br>\n<strong>About This Role</strong>\n<br><br>\nWe are looking for someone to provide a broad range of data analysis functions such as data modeling, structured query language (SQL) data quality, data profiling, extract-transform-load (ETL), metadata enrichment and management, data provenance and lineage, report design and other specialized data management functions. You'll be guided by data specialists or managers to design, develop and support TD's data management solutions.\n<br><br>\nMeaningful work is fueled by meaningful performance and career development conversations with your manager. <strong>Here are the essential job functions of this position:</strong>\n\n<ul>\n<li> Provide data analysis, assess data management requirements for data platforms, applications, systems, servers.</li> \n\n<li> Develop, maintain data knowledge from upstream sources within relevant platform and applications using profiling, quality reporting tools and technical and business metadata capture.</li> \n\n<li> Ensure data complies with TD standards, policies, guidelines.</li> \n\n<li> Collaborate to elicit and articulate data requirements.</li> \n\n<li> Contribute to data involving project business requirements and data requirements documents.</li> \n\n<li> Use industry-standard modeling tools to develop, maintain models.</li> \n\n<li> Help development and testing teams resolve data issues.</li> \n\n<li> Use BI tools and SQL to build and support reports.</li> \n\n<li> Support user community by helping them interpret data.</li> \n\n<li> Provide data governance and availability support to ensure appropriate capture of data privacy and security requirements, governance and access controls.</li> \n\n<li> Assist with testing related to implementation, upgrades, and patches.</li> \n\n<li> Build subject matter knowledge across business lines.</li> \n\n<li> Define, build, manage data catalog for data platforms, systems, servers and applications.</li> \n\n<li> Ensure metadata and data lineage are captured and compatible with enterprise metadata and data management tools and processes.</li> \n\n<li> Run QA reports, resolve integrity issues to ensure accurate reporting and records;</li> \n\n<li> Meet business reporting and analytical needs: gather, review, analyze, profile, validate, map system data.</li> \n\n<li> Research, identify issues, determine approach to correct data, identify, analyze and interpret trends/patterns in complex datasets.</li> \n\n<li> Determine, analyze business line requirements, use system data, support senior management and departments with business reporting.</li> \n\n<li> Understand data initiatives and capabilities, governance principles, enterprise-wide application</li> \n\n<li> Respect TD's technology delivery practices, standards, project management disciplines.</li> \n</ul>\n\nOther duties as assigned • Driving Requirements: • Travel Requirements:.<br><br>Qualifications:<br><br>Preferred Qualifications - Here are the preferred qualifications for this role:."}