{"job title": "Data Scientist II (US)", "company": "TD Bank", "city state": "– New York City, United States", "rating": "3.6", "job description": "<div>This role will be a critical component of Marketing Advanced Analytics team with in marketing that will have hands on experience and subject matter expertise on modeling forecasting &amp; Data Science</div> <div> Job Requirements \tDesign, develop and implement various statistical and forecasting models to optimize different Direct to consumer, Media &amp; Digital campaigns, risk, and response and customer value\n<br>\n\tBuild predictive models using machine learning and statistical techniques and led applications of predictive modeling techniques for complex business problems such as multi-channel effectiveness, customer lifetime value modeling, social media sentiment analysis, digital marketing channels, Propensity models, media mix modeling and churn modeling\n<br>\n\tProvide leadership and creativity by using advanced quantitative methods to identify opportunities that bring value to the business and influence decision making.\n<br>\n\tLead all analytic/modeling projects and provide solutions to the business problems facing across the cross functional department\n<br>\n\tOwn and manage model governance, and all regulatory affairs such as compliance approval process to make sure all the built models are in compliance with current banking rules and regulations\n<br>\n\tSynthesize data and analytical methods into actionable business strategy and communicate findings to business partners and executive management team\n<br><br>\nTechnical Skills: Requires an expert programming and modeling skills (e.g. expert in statistical/econometric and machine learning software such as Base SAS, SAS EG, SAS EM, R, Python, Hadoop, Hive, Spark etc.) and database knowledge and query languages (e.g. Oracle, SQL etc.)\n\n<li>Must be eligible for employment under regulatory standards applicable to the position.</li></div> <div> Qualifications \t5-7 Years' experience preferably in Financial Industry or Retail/CPG\n<br>\n\tMaster degree in Applied Statistics, Business Analytics, Operational Research, Applied Math, Engineering and or Computer Science\n<br>\nProficient PC skills including a strong competency in MS Excel and PowerPoint, and a variety of PC based analytical and reporting software packages.\n<br>\n Advanced experience in the knowledge, utilization and adoption of the latest tools (i.e. machine learning) and technologies (i.e.\n<br>\nHadoop) in big data and advanced analytics\n<br>\n Strong analytical and program solving skills are required to interpret data and draw conclusions.\n<br>\n Excellent written and verbal communications skills.</div> <div> Inclusiveness<br><br>At TD, we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of our customers and communities in which we live in and serve, and creating an environment where every employee has the opportunity to reach her/his potential.\n<br><br>\nIf you are a candidate with a disability and need an accommodation to complete the application process, email the TD Bank US Workplace Accommodations Program at USWAPTDO@td.com . Include your full name, best way to reach you, and the accommodation needed to assist you with the application process.\n<br><br>\nEOE/Minorities/Females/Veterans/Individuals with Disabilities/Sexual Orientation/Gender Identity.</div> \n\n<li>*Province/State (Primary) New York</li>\n\n<div> City (Primary) New York City</div>"}