{"job title": "Analytics Manager", "company": "Teachers Pay Teachers", "city state": "– New York, NY", "rating": "4.9", "job description": "<strong>About Us</strong>\n<br><br>\nAt Teachers Pay Teachers (TpT), we're unlocking the power of educator-created content. More than 2 out of 3 of U.S. teachers come to TpT every year to get teacher-tested, engaging, and rigorous materials. What began as a humble exchange for teachers looking to share lesson plans has since exploded into an education powerhouse where teachers have created more than 3 million resources for all aspects of PreK-12 education. More than five million educators worldwide (including teachers, administrators, and parents) have downloaded TpT resources more than a billion times. If you haven't heard of TpT yet and want to learn more, just talk to a teacher about us. Or try this recent article in Forbes.\n<br><br>\n<strong>Who we are looking for</strong>\n<br><br>\nWe're a team of good people doing great things. We listen first. We love our work. And we are all teachers and learners in whatever we do. We believe that productivity is never an accident. It's the result of a commitment to excellence, intelligent planning, passionate team work, and focused effort. We want every day to be fun and to matter.\n<br><br>\n<strong>Role Description:</strong>\n<br><br>\nAs the Analytics Manger you will lead the adoption of business intelligence tools across teams, foster a culture of insightful analysis and crisp reporting, and become a trusted business partner within the organization.\n<br><br>\nYou know and love working with data and analytics tools, write excellent SQL and scripts, and can use your technical skills, business acumen, and creativity to solve unique business problems. Reporting to the VP of Finance, you'll work closely with business, data science, engineering, and product teams to develop a deep understanding of TpT's business and drive strategy and action through high quality, timely analysis.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Use data to tell a story. Surface insights and influence peers with data, actionable research and compelling narrative content; present and clearly communicate complex data and analyses to cross-functional groups.</li>\n<li>Ensure metrics used to track the business and measure results are consistent and the most relevant to inform decision-making across the organization. Own the weekly KPI package presented to the management team.</li>\n<li>Translate business issues into testable hypotheses answerable with data; partner closely with marketing, product, engineering, and customer experience teams from business case development to ROI measurement.</li>\n<li>Build dynamic and rich dashboards and reporting solutions to support company initiatives and strategic planning using out-of-box features, customizations, and visualizations.</li>\n<li>Explore and recommend emerging technologies and techniques to support/enhance Business Analytics at TpT.</li>\n<li>Write and create custom reports.</li>\n</ul>\n<strong>Requirements</strong>\n\n<ul>\n<li>5+ years of experience with SQL including optimization</li>\n<li>3+ years of experience with business intelligence and visualization tools (Looker, Tableau, Chartio) in an e-commerce environment, preferred</li>\n<li>Comfortable with large, complex relational databases (both transactional and analytical) and nested tables (BigQuery, Redshift)</li>\n<li>Ability to analyze data to identify key insights, potential gaps, and inconsistencies.</li>\n<li>Demonstrated understanding of analytical techniques including regression, trend analysis, forecasting, and A/B testing.</li>\n<li>Experience with web analytics tools (Google Analytics, etc.)</li>\n<li>Advanced user of G Suite and Microsoft Office tools</li>\n<li>Excellent communication skills including the ability to identify and communicate data-driven insights.</li>\n<li>Experience managing people and developing talent a plus</li>\n</ul>"}