{"job title": "Quantitative Analyst", "company": "TEAMGOV", "city state": "– Washington, DC", "rating": "NA", "job description": "<strong>TeamGOV seeks Quantitative Analyst</strong>\n<br><br>\nThis position requires a candidate who is eligible for a DoD Secret clearance; a candidate with an active DoD Secret clearance is\n<br>\npreferred.\n<br><br>\nThe Analyst will design and analyze mathematical models for CBRN, influenza, and emerging infectious disease. Modeling will focus on public health response and medical countermeasure mitigation. The analyst will independently investigate problems that have been recognized as being difficult to solve and require the sophistication, creativity, and judgment of an established and competent scientist. The\n<br>\nposition will require significant interaction with cross-functional teams of subject matter experts in non-quantitative fields. Experience with\n<br>\nepidemiological modeling and analysis preferred.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n<ul>\n<li>Review CBRN and emerging infectious disease impacts against the US civilian population and design mathematical models appropriate to the policy questions asked.</li><li>Review external models, risk assessments, research data and studies and provide critiques and suggestions for application or improvements.</li><li>Review and analyze data from research studies and develop reports and conclusions based on the data. Make recommendations regarding areas of modeling and analysis needed in specific CBRN/disease program areas.</li><li>Create new CBRN models using existing Java APIs. This effort could include implementing existing mathematical models in a new framework or working with subject-matter experts to design a unique model for a tailored application.</li><li>Create models of the treatment effect of a novel countermeasure with the goal of predicting both the reduction in mortality/morbidity as well as reduction in the cost of care. This effort could include a literature review of the cost of care, existing care and treatments, and potential mitigation of the new countermeasure. The estimate of potential mitigation could involve statistical analysis of the collected data and creating a mathematical model of how it would translate into real-world human effects.</li>\n</ul>\n<strong>Basic Qualifications:</strong>\n<ul>\n<li>Candidate must be eligible for a DoD Secret clearance.</li><li>BS in relevant discipline with 4+ yrs relevant experience OR</li><li>MS in relevant discipline with 2+ yrs relevant experience OR</li><li>PhD with 1+ yrs relevant work experience.</li><li>Expertise in mathematics, probability and statistics, stochastic models, CBRN and health effects, epidemiology, avian/pandemic influenza and/or related sciences</li><li>Experience in a compiled OOP language (Java programming is considered a strong plus)</li><li>Experience with scientific or mathematical software or programming particularly R or Python</li><li>Excellent communication skills with the ability to successfully interact with supervisors, functional peer groups, and/or outside customers</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>Active DoD Secret clearance</li><li>Prior experience with and knowledge of data analytics, quantitative algorithms for prediction and machine learning</li><li>Knowledge of statistics, disease transmission modeling, systems dynamics modeling, data analytics, bioinformatics, health economics and/or economic modeling.</li><li>On-site commitment to providing this expertise in a fast-paced, rapidly changing environment</li></ul>\n\n\n<ul>\n<li>provided by Dice</li>\n</ul>\n\nR, Python, Machine Learning, Math"}