{"job title": "Data Scientist", "company": "Techstyle Group LLC", "city state": "– El Segundo, CA", "rating": "3.0", "job description": "<strong>Job Description</strong>\n<br><br>\nTechStyle Fashion Group is currently looking for a Data Scientist.\n<br><br>\nHow Do You Fit In?\n<br><br>\nAs a Data Scientist, you will be responsible for developing algorithms for eCommerce, Merchandising and Purchasing, Media and Acquisition, Inventory, Order Fulfillment, and Member Services for all TechStyle brands. The right candidate will possess outstanding communication skills to assist our brand teams with experimentation, insights, and ultimately trained algorithms to support our core business functions.\n<br><br>\nThis position will report to the Sr. Director, Data Science\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Develop solutions to support our core business functions</li>\n<li>Carry projects from concept to completion</li>\n<li>Work closely with business and engineering teams to push your models into production</li>\n<li>Communicate effectively with product teams to explain ROI, level of effort, and statistical findings of experiments</li>\n<li>Help create algorithms known to provide ROI in an eCommerce environment</li>\n<li>Work closely with the media team to help maximize AD spend and create attribution models</li>\n<li>Assist product and engineering teams in determining features that support future ML models</li>\n<li>Share insights learned through experimentation with underlying teams</li>\n</ul>\n\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>At least 2 years' experience or a degree in a mathematical field, including statistics, economics, physics, or aerospace</li>\n<li>Fluent in Python</li>\n<li>Experienced in creating, deploying, and retraining machine learning algorithms to overcome problems in a production environment</li>\n<li>Good understanding of existing models and experience in model selection</li>\n<li>Experience in feature exploration, dimensionality reduction, and sparse data sets</li>\n<li>Experience in TSQL and data manipulation libraries including Spark, Pandas, and Numpy</li>\n<li>Experience with Deep Learning libraries TensorFlow, MXNet</li>\n<li>Experience with ML libraries scikit-learn, Spark MLLib, mlpack</li>\n<li>Data Visualization experience including scatterplots, histograms, and distribution charts</li>\n<li>Understanding of Cloud offerings including Snowflake Data platform, Sagemaker, Google Cloud AI, AzureML, Azure Workbench a plus</li>\n<li>Understanding of eCommerce</li>\n<li>Outstanding communication skills</li>\n</ul>\n\nTechStyle is an Equal Opportunity Employer: M/F/PV/D (minority, female, protected veteran, disability)<br><br>SDL2017"}