{"job title": "Data Scientist", "company": "Technosoft Corporation", "city state": "– San jose, California", "rating": "3.5", "job description": "Job description:\n<br><br>\nBuild and evaluate predictive and decision models to be deployed in production systems, or for research.\n<br><br>\nAnalysis of large amounts of historical data, determining suitability for modeling, data clean-up and filtering, pattern identification and variable creation, selection of sampling criteria, generating performance definitions and variables, performing experiments with different types of algorithms and models, analyzing performance, to identify the best algorithms to employ.\n<br><br>\nArchitect and develop operational models that run at scale thru partnership with data engineer teams\n<br><br>\nLead a team of data scientists to design, prototype, implement and test descriptive and predictive analytics models\n<br><br>\nPartner with cross-functional teams to identify and explore opportunities for the application of machine learning and predictive analysis\n<br><br>\nCommunicates well with technical and non-technical audiences, and contributing modeling expertise as a thought leader\n<br><br>\nBasic Qualifications:\n<br><br>\nMaster's degree or higher in Statistics/Math/Computer Science or related field\n<br><br>\nBackground in applied statistical modeling on large experimental or observational data sets\n<br><br>\nExperience extracting data from a variety of sources, and a desire to expand those skills (working knowledge SQL is required, Spark is a plus)\n<ul>\n <li><strong>Statistics and Machine learning experience is a MUST</strong></li>\n</ul>\n6+ years of industry work experience in managing and leading data scientist projects\n<br><br>\nExperience with one or more statistical or machine learning software such as R, Python, etc.\n<br><br>\nFamiliarity with database modeling and data warehousing principles with a working knowledge of SQL\n<br><br>\nKnowledge of distributed computing systems, e.g. Cosmos, Spark, Hadoop, and relational database management system is required\n<br><br>\nExtraordinary written and verbal communication to educate and work with multi-functional teams\n<br><br>\n<strong>Sashini Dissanayake</strong>\n<br><br>\nTechnical Recruiter\n<br><br>\n<strong>Technosoft Corporation</strong>\n<br><br>\nOne Towne Square, Suite 600\n<br><br>\nSouthfield, MI 48076\n<br><br>\nDirect: 248 603 2612\n<br><br>\nMobile: +1 248 631 9330\n<br><br>\nSashini.dissanayake@technosoftcorp.com\n<br><br>\nwww.technosoftcorp.com"}