{"job title": "Data Scientist - Intermediate", "company": "Technology Partners", "city state": "– Saint Louis, MO", "rating": "4.5", "job description": "Are you looking for a new and challenging opportunity? Do you have experience with Python or R? Technology Partners can help you make your next big career move a reality.Technology Partners is currently seeking a talented person for a Data Scientist - Intermediate position.What You Will Be Doing:You will collaborate closely with data scientists, breeders, data engineers, and imagery scientists to provide data-driven solutions to business problems. You will understand the core scientific questions and develop a methodology to best address these questions. You will also apply machine learning or other computational approaches to develop, improve and scale crop/ environmental models. You will quantify and simulate interactions between genotype and biotic &amp; abiotic environmental factors. You will also build effective relationships and partnerships with internal customers and stakeholders.What We Are Looking For:PhD in Computer science, Statistics, Engineering, Physics, Mathematics, or a related field. Or, a PhD and demonstrated experience with quantitative applications in Agronomy/Plant Sciences, Climatology, Geo-informatics, or related fields.Demonstrated experience using machine learning, data mining, simulation modeling, or statistical methodology to solve research problems.Proficiency in Python or R.Ability to rapidly learn new problem domains, and good decision-making and judgement skills.Ability to work in a large team as well as independently.It Would Be Great, but Not Required, if You Had:Experience with modeling crop development phases, growth and stress.Experience with geospatial and remote sensing data.Experience with cloud computing and virtualization technology.Strong publication record in leading scientific journals.Proven ability to communicate complex analytical problems in a clear, precise and actionable manner.If this position sounds like you, WE SHOULD TALK! We realize our people are our most valuable asset, that is why we offer the following benefits:Health, Dental, and Vision insurance401(k) retirement planLong and Short-Term disabilityLife insuranceDirect depositReferral programYour better future is ready, and we want to put the right tools in your hands to get you there. Let's go!Looking for more opportunities with Technology Partners?Check out jobs.technologypartners.net.Technology Partners is an Equal Opportunity Employer. Technology Partners does not discriminate on the basis of race, color, religion, sex, national origin, age, disability or any other characteristic protected by applicable state or federal civil rights laws."}