{"job title": "Data Scientist - Neo4J", "company": "TEKsystems, Inc.", "city state": "– Charlotte, NC", "rating": "3.4", "job description": "Responsible for enabling analysis, modeling, and optimization through producing information products. Actively involved in the research and development efforts. Primary requirement is not related to traditional programming or systems analysis skills but to the ability to create sophisticated, value-added analytic systems that support revenue generation, risk management, operational efficiency, regulatory compliance, portfolio management, and research. These systems must overcome issues of complex data (e.g., VLDB, multi-structured, \"big data\", etc.) as well as deployment of advanced techniques (e.g., machine learning, text mining, statistical analysis, etc.) to deliver insights. Responsible for adoption of enterprise information products through clearly communicating how enterprise information products answer material banking questions leading to decisions and actions. This role possesses an advanced degree in hard science. Able to lead or work independently on complex projects and influence strategic direction.\n<br>\n<strong>Keywords:</strong>\n\n\n<ul>\n<li>Data Architecture</li>\n<li>Data science</li>\n<li>Network science</li>\n<li>Hadoop</li>\n<li>Graph database</li>\n<li>NOSQL</li>\n<li>Big data</li>\n<li>VLDB (very large databases)</li>\n</ul>\n\n<strong>About TEKsystems:</strong>\n<br><br>\n<strong>We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.</strong> - provided by Dice\n<br><br>\nData Scientist - Neo4J"}