{"job title": "Scientist", "company": "Tekwissen", "city state": "– Spring House, PA", "rating": "4.0", "job description": "Job Description(1 Year contract)\n<br><br>\n<strong>Description:</strong>\n\n\n<ul>\n<li>In this laboratory-based position, the candidate will join a group of scientists within the ImmunoPharmacology group to support the discovery and development of novel large and small molecule therapeutics targeting immunological diseases.</li>\n<li>The individual will have primary responsibility for executing short-term and long-term pharmacology experiments.</li>\n<li>The responsibilities will include evaluating pharmacological effects of test compounds in vivo pharmacology experiments, evaluating animal health, animal handling, dosing and collecting/processing tissue/blood for analysis.</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n<li>A high school diploma (with 3-5 yr of experience) / BS degree (1-2 yr of experience) in animal/biological sciences with training in animal research.</li>\n<li>Hands-on experience with evaluation of animal health, animal handling, dosing, necropsy to collect tissues/blood of interest and preparing/processing laboratory samples for analysis.</li>\n<li>Quantitative skills, familiarity with laboratory instrumentation, experimental documentation (digital and paper), basic data analysis/data management (Excel/ GraphPad Prism).</li>\n<li>Interpersonal and organizational skills to execute experiments, detailed-orientated, skills to document and effectively communicate to stakeholders.</li>\n<li>Familiarity with mouse models such as inflammation/autoimmunity/oncology and/or AALAC certifications (e.g. ALAT, LAT, LATG) is a plus.</li>\n</ul>\n\nVeterans are encouraged to apply!\n<br><br>\nOnce your application is submitted and reviewed, a response will be initiated via a telephone call or email.\n<br>\nTekWissen is an equal opportunity employer that celebrates diversity and inclusion. All employment is decided on the basis of qualifications, merit and business need, without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\n<br><br>\nCompany DescriptionTEKWISSEN Group is an Equal Opportunity/Affirmative Action Employer (M/F/Disability/Veterans). We will consider all applications without regard to race, gender, sexual orientation, gender identity, age, color, religion, national origin, veteran status, disability, genetic information or any other status protected by applicable law."}