{"job title": "Big Data Specialist", "company": "Telefonica", "city state": "– Birmingham, AL", "rating": "3.7", "job description": "The role\n<br><br>\nProvide with support though Big Data Training Project as part of the Global Project for one of our major clients in US, located in Alabama.\n<br><br>\nThe Mission\n<br><br>\nProject's mission is to analyze, guide and adapt training based on the needs of its employees. The development of a Data Driven Model is contemplated, and will allow the monitoring of this evolution during the different training phases and in a global way.\n<br><br>\nTraining aimed at enabling Business Analyst to work more efficiently and autonomously, increasing their knowledge of the end customer data model and its programming capabilities in SQL.\n<br><br>\nMain Responsibilities\n<br><br>\nThe initial focus of the project will be a) the evolution of end customer data mining capabilities towards data science b) expand the knowledge of Business Analysts.\n<br><br>\nThe role will specifically focus on consulting services for the dissemination of the understanding of the value of data as the organization's main asset, which will be the core obtective of the tainning sessions.\n<br><br>\n<strong>Main activities to perform:</strong>\n\n\n<ul>\n<li>Delivery of training courses that have been designed by our partner and have been designed exclusively for the end customer, among others, in the following subjects:</li>\n<li>1. Data Scientist Fundamentals Program</li>\n<li>2. Data Specialist Fundamentals Program</li>\n<li>Evaluation of the capacities of the candidates for the training through a check-in process that allows to homogenize the training groups and guarantee the basic knowledge required to attend the training.</li>\n<li>Coaching, which includes the accompaniment of the people who have addressed the training after its completion. This process is established as support and guidance for the people trained in the development of their use cases.</li>\n</ul>\n\nThis role will collaborate with partner and end customer through all the education process lifecycle.\n<br><br>\nTechnical Knowledge\n\n\n<ul>\n<li>Statistics</li>\n\n<strong><li>Lenguajes de Programación:</li>\n\n</strong>\n\n<li>Python (mandatory),</li>\n<li>Scala (recommendable)</li>\n\n<strong><li>Big Data and Science:</li>\n\n</strong>\n\n<li>Spark (mandatory)</li>\n<li>Hadoop (Recommended)</li>\n<li>HDFS (Recommended)</li>\n<li>ML (Recommended)</li>\n<li>MapReduce (Recommended)</li>\n<li>pandas (Recommended)</li>\n<li>Scikit-Learn (Recommended)</li>\n<li>MlLib (Recommended)</li>\n\n<strong><li>Database:</li>\n\n</strong>\n\n<li>- Hive (Recommended)</li>\n<li>SQL (mandatory)</li>\n<li>NoSQL (MongoDB, Cassandra) (Recommended)</li>\n</ul>\n\nExperience\n<br><br>\nAt least 5-7 years of experience in design and delivery of technical training.\n<br><br>\nDesirable previous experience in banking.\n<br><br>\n<strong>Education</strong>\n<br><br>\n'Any of these Education paths related with computer science:\n\n\n<ul>\n<li>Mathematician</li>\n<li>Statistic</li>\n<li>Computer Engineer</li>\n<li>Physicist</li>\n</ul>\n\nNote: End Customer located in Birmingham, Alabama. Resource must go in a regular basis to the end customer place, to deliver the training and coaching sessions. When not in the customer, the work willl be home-office.\n<br><br>\nNearest Major Market: Birmingham\n<br><br>\nJob Segment: Database, Consulting, Computer Science, SQL, Data Mining, Technology"}