{"job title": "Data Operations Engineer", "company": "Tempus Labs", "city state": "– Chicago, IL", "rating": "3.4", "job description": "About our teams:\n<br><br>\nAt Tempus, products are owned and developed by small, autonomous teams composed of developers, designers, data scientists, and product managers. You and your team set the goals, build the software, deploy the code, and contribute to a growing software platform that will make a lasting impact in the field of cancer research and treatment.\n<br><br>\nAs a Data Operations Engineer, youll be implementing data pipelines to integrate partner data with the worlds largest library of clinical and molecular data.\n<br><br>\nWhat youll do at Tempus:\n\n<ul>\n<li>Youll analyze, document, and implement data transformation to populate Tempus data models with partner data.</li>\n<li>Youll implement resilient data pipelines as code to guarantee timely ingestion/egress of partner data.</li>\n<li>Youll code instrumentation to measure source data quality, and communicate with partners technical contacts to resolve live integration issues.</li>\n<li>Youll identify and socialize improvements to data processing infrastructure and workflows.</li>\n</ul>\nWhy were looking for you:\n\n<ul>\n<li>You write code to transform data between data models and formats, preferably in Python or PySpark.</li>\n<li>You've worked in agile environments and are comfortable iterating quickly.</li>\n<li>You are comfortable working with high-level direction and querying subject matter experts to extract the information you need to operate in complex domains.</li>\n</ul>\nBonus points for:\n\n<ul>\n<li>Experience with messaging platforms and real-time SOA integration patterns.</li>\n<li>Experience working with RESTful endpoints in ETL processes.Healthcare domain knowledge and experience implementing integrations with healthcare transaction protocols (FHIR, HL7, ANSI X12).</li>\n<li>Experience building cloud-native applications and supporting technologies / patterns / practices including: AWS, Docker, CI/CD, DevOps, and microservices.</li>\n<li>You have knowledge of relational database physical modeling concepts and writing advanced SQL queries.</li>\n</ul>"}