{"job title": "Software Engineer, Data Visualization", "company": "Tempus Labs", "city state": "– Chicago, IL", "rating": "3.4", "job description": "About our teams:\n<br><br>\nAt Tempus, products are owned and developed by small, autonomous teams composed of developers, designers, data scientists, and product managers. You and your team set the goals, build the software, deploy the code, and contribute to a growing software platform that will make a lasting impact in the field of cancer research and treatment.\n<br><br>\nWhy were looking for you:\n\n<ul>\n<li>You are proficient in modern JavaScript/ECMAScript and have experience with at least one web application framework, such as React.js or Angular.js.</li>\n<li>You enjoy making complex information easy to comprehend using data visualization frameworks, such as D3.js or Processing.js.</li>\n<li>You've worked in agile environments and are comfortable iterating quickly.</li>\n<li>You have experience writing tests using frameworks like Jasmine, Jest, Mocha, Nightwatch.js or Selenium.</li>\n<li>You enjoy collaborating and communicating with team members of varying skill sets and from different fields.</li>\n</ul>\nBonus points for:\n\n<ul>\n<li>Working knowledge of mathematics / statistics commonly applied in data science and machine learning.</li>\n<li>Experience working with SQL/NoSQL database technologies like MySQL, PostgreSQL, MongoDB, Elasticsearch, or Redis.</li>\n<li>Experience building cloud-native applications and supporting technologies / patterns / practices including: AWS, Docker, CI/CD, DevOps, and Microservices.</li>\n</ul>\nAbout Tempus:\n<br><br>\nPassionate about making a difference in the world of cancer genomics?\n<br><br>\nWe're on a mission to connect an entire ecosystem to redefine how genomic data is used in clinical settings. We're looking for software engineers who are passionate about changing the status quo and bringing cancer care into the 21st century.\n<br><br>\nWe are an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}