{"job title": "Associate Scientist", "company": "Temple University", "city state": "– Philadelphia, PA", "rating": "4.0", "job description": "<div> </div>\n<div>The Associate Scientist, in the Lewis Katz School of Medicine’s Shriner’s Pediatric Research Center, will participate in ongoing experiments with breeding, genotyping and colony maintenance of genetically modified mice in order to investigate culturing primary neurons, preferably sensory neurons in in-vivo models of nerve injury, in particular optic nerve crush. In addition, the Associate Scientist will perform various molecular, cellular, genomic and microscopic imaging techniques to investigate the generation of lentiviruses and/or Adeno-Associated Viruses, and the use of such viruses in cultured neurons and in-vivo. The incumbent will write papers and grant applications to support their own work, with space, supplies and equipment provided by the Principal Investigator. Specifically, the incumbent will perform techniques such as tissue dissection, neuronal cultures, PCR, RT-PCR, qPCR, histology and protein biochemistry (such as Western blotting and protein purification); perform animal handling and surgery functions on neurologic animal models; conduct research data collection and analysis; maintain laboratory equipment in good order and accurate records on all experiments; keep accurate records of isotope usage as mandated by the Radiation Safety Officer, and maintain radiation safety in the laboratory; assist the Principal Investigator with writing manuscripts, research papers and grants; and supervise junior researchers. Performs other duties as assigned. </div>\n<div><b> </b></div>\n<div><b>Education and Experience:</b></div>\n<div>PhD in Neuroscience or related field and at least 4 years of experience in a laboratory setting. An equivalent combination of education and experience may be considered.</div>\n<div> </div>\n<div><b>Required Skills and Abilities:</b></div>\n<div>*Working knowledge of local, state, and federal laboratory regulations.</div>\n<div>*Demonstrated expertise with molecular and cellular biology as well as neurosurgery techniques. </div>\n<div>*Demonstrated ability to perform In-vivo experiments.</div>\n<div>*Demonstrated data analysis skills. </div>\n<div>*Ability to keep accurate records of research performed to NIH standards.</div>\n<div>*Excellent interpersonal skills, along with the ability to interact with a diverse population of students, faculty, and staff.</div>\n<div>*Excellent written and verbal communication skills.</div>\n<div>*Ability to operate standard office equipment and software including MS office.</div>\n<div>*Demonstrated organizational and prioritization skills, along with the ability to handle multiple tasks in a deadline driven work environment. </div>\n<div> </div>\n<div>This is a grant funded position. </div>\n<div> </div>\n<div>\n<div>Temple University values diversity and is committed to equal opportunity for all persons regardless of age, color, disability, ethnicity, marital status, national origin, race, religion, sex, sexual orientation, veteran status or any other status protected by law.</div></div>\n<div> </div>\n<div>Compliance Statement: In the performance of their functions as detailed in the position description employees have an obligation to avoid ethical, legal, financial and other conflicts of interest to ensure that their actions and outside activities do not conflict with their primary employment responsibilities at the institution. Employees are also expected to understand and be in compliance with applicable laws, University and. employment policies and regulations, including NCAA regulations for areas and departments which their essential functions cause them to interact.</div>\n<div> </div>\n<div>To obtain additional information about Temple University please visit our website at <u>www.temple.edu</u>.</div>\n<div> </div>\n<div>Temple University's Annual Security and Fire Safety Report contains statistics, policies, and procedures related to campus safety and can be found at: <u>http://www.temple.edu/safety/asfr/</u></div>\n<div> </div>\n<div>You may request a copy of the report by calling Temple University’s Campus Safety Services at 215-204-7900.</div>\n<div> </div>\n<div> </div>\n<div> </div>\n<div> </div>\n<div> </div>"}