{"job title": "Data Platform Engineer", "company": "Tempus Labs", "city state": "– Chicago, IL", "rating": "3.4", "job description": "About our teams:\n<br><br>\nAt Tempus, products are owned and developed by small, autonomous teams composed of developers, designers, data scientists, and product managers. You and your team set the goals, build the software, deploy the code, and contribute to a growing software platform that will make a lasting impact in the field of cancer research and treatment.\n<br><br>\nAs a Data Platform Engineer at Tempus, you will architect and implement cloud-native data pipelines and infrastructure to enable analytics and machine learning on Tempuss rich clinical, molecular, and imaging datasets.\n<br><br>\nWhy were looking for you:\n\n<ul>\n<li>You know what it takes to build and run resilient data pipelines in production and have experience implementing ETL/ELT to load a multi-terabyte enterprise data warehouse.</li>\n<li>You have implemented analytics applications using multiple database technologies, such as relational, multidimensional (OLAP), key-value, document, or graph.</li>\n<li>You value the importance of defining data contracts, and have experience writing specifications including REST APIs.</li>\n<li>You write code to transform data between data models and formats, preferably in Python or PySpark.</li>\n<li>You've worked in agile environments and are comfortable iterating quickly.</li>\n</ul>\nBonus points for:\n\n<ul>\n<li>Experience moving trained machine learning models into production data pipelines.</li>\n<li>Healthcare domain knowledge and experience with healthcare transmission formats (e.g. FHIR, HL7, ANSI X12) and data models (e.g OMOP).</li>\n<li>Expert knowledge of relational database modeling concepts, SQL skills, proficiency in query performance tuning, and desire to share knowledge with others.</li>\n<li>Experience building cloud-native applications and supporting technologies / patterns / practices including: AWS, Docker, CI/CD, DevOps, and microservices.</li>\n</ul>\nAbout Tempus:\n<br><br>\nPassionate about making a difference in the world of cancer genomics?\n<br><br>\nWe're on a mission to connect an entire ecosystem to redefine how genomic data is used in clinical settings. We're looking for software engineers who are passionate about changing the status quo and bringing cancer care into the 21st century.\n<br><br>\nWe are an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}