{"job title": "Sr. Data Engineer", "company": "Ten-X", "city state": "– San Mateo, CA", "rating": "2.9", "job description": "Auction.com is the nation's leading online real estate marketplace focused exclusively on the sale of residential bank-owned and foreclosure properties via online auctions and live trustee sale events. By offering access to exclusive properties and technology designed to seamlessly connect buyers and sellers, Auction.com empowers residential real estate investors and financial institutions to achieve optimal, mutually beneficial results to go beyond the bid.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nData and our ability to leverage it is seen and championed as a key competitive advantage from our CEO on down. We are looking for a top tier senior data engineer to work with our data science team on building out Pipelines, Data Modelling and Data related tools.\n<br><br>\n<strong>Responsibilities/Duties:</strong>\n\n\n<ul>\n<li>Play a leading role in designing, developing and implementing Big Data databases (Hadoop, Graph, MySQL, NoSQL, MongoDB) that contains multiple data sets from both internal and external sources</li>\n<li>Lead the setup of data pipelines of new internal and external data sets into the database</li>\n<li>Work with Data Scientists to help dedupe and fuzzy match data</li>\n<li>Work with software engineers on developing APIs</li>\n</ul>\n\n<strong>Knowledge, Skills and Abilities:</strong>\n\n\n<ul>\n<li>Go getter and self-starter</li>\n<li>Good written and oral communication skills</li>\n</ul>\n\n<strong>Education/Experience:</strong>\n\n\n<ul>\n<li>5+ Years' Experience in data engineering, including:</li>\n<li>2+ years in a modern data stack environment, specifically the Hadoop stack</li>\n<li>Computer Science degree or equivalent</li>\n<li>Experience with iterative Agile methodologies and use of supporting tools like JIRA, Confluence and Git</li>\n\n<strong><li>Bonus points for experience in:</li>\n\n</strong>\n\n<li>Spark</li>\n<li>Kafka</li>\n<li>Clickstream data</li>\n<li>Machine Learning</li>\n<li>Streaming Data</li>\n<li>Elastic Search</li>\n<li>Containers (Docker)</li>\n<li>Fuzzy Matching / NLP</li>\n</ul>\n\nTo all recruitment agencies: Auction.com does not accept agency resumes unless you are part of our preferred partner network. Please do not forward resumes to our jobs alias, Auction.com employees or any other company location. Auction.com is not responsible for any fees related to unsolicited resumes.\n\n\n<ul>\n<li>LI-MH1</li>\n</ul>"}