{"job title": "Data Scientist", "company": "Tenor", "city state": "– San Francisco, CA, US", "rating": "4.4", "job description": "<div>\nJob Description<br><br></div><div>\nWe are seeking a Data Scientist with a graduate degree and 3+ years of industry experience. Ideal candidate has practical knowledge working with huge data sets and a passion for data, and is experienced in applying advanced data science and machine learning techniques to address a wide range of challenging computing problems. The dream candidate would be a team player yet independent, knowledgeable in the latest applied data science and machine learning advances, and a creative problem solver. <br><br>Responsibilities: <br>-Implement and apply cutting edge algorithms and methods for machine learning <br>-Perform extensive supervised and unsupervised learning on terabyte-scale datasets to advance consumer communication, search, and video technologies <br>-Build models to predict search and language behavior in a unique consumer space <br>-Collaborate with senior engineers to build best-in-class real-time technologies used by millions of consumers <br><br>Qualifications: <br>-3 years professional experience in applying machine or statistical learning to large datasets to build prediction models <br>-Ability to communicate complex quantitative analysis, analytic approaches and findings in a clear, precise, and actionable manner <br>-Passion for empirical research with attention to detail to answer hard questions in consumer behavior <br>-Python and common Python-based numerical libraries (e.g. SciPy) <br>-Working knowledge of SQL <br>-M.S. or Ph.D. in Computer Science, Mathematics, Statistics or related field <br><br>Bonus Points: <br>-Hands on experience with computer vision and natural language processing techniques<br><br>What We're Building<br><br></div><div>\nTenor (formerly Riffsy) helps people find the right GIF at the right moment. In a world that now largely operates via texts, social media messages, DMs and Slack channels, it can be hard to articulate exactly what you mean with keystrokes alone. Tenors GIF Keyboard makes it easy for people to visually express whats on their mind.<br><br></div><div>\n<br>Beyond Tenor's GIF Keyboard, we extend our mobile-focused experience through our API, powering GIF sharing for partners like Facebook Messenger, Googles G Board, LinkedIn, Kik, Kika, LinkedIn &amp; Vodafone. Together across Tenor's offerings, hundreds of millions of users perform billions of searches every month for GIFs and videos from the worlds greatest content creators.<br><br></div><div>\n<br>The company is based in San Francisco, and is backed by Redpoint and Menlo Ventures.<br><br></div>"}