{"job title": "Principal Data Scientist", "company": "Teradata", "city state": "– San Diego, CA", "rating": "3.4", "job description": "<strong>Requisition Number:</strong>\n<br>\n<strong>201400</strong>\n<br><br>\n<strong>Position Title:</strong>\n<br>\nTB Prin. Data Scientist (I)\n<br><br>\n<strong>External Description:</strong>\n<br>\nData Scientists at Think Big Analytics help our customers solve some of the most challenging business problems using machine learning and artificial intelligence. We are partners in our customer's success, focusing on delivering insights and value that impact their business. We simplify the complexity around data science, helping C-level executives as well as data science practitioners navigate the highly dynamic field. We are looking for experienced, hard-working and talented Principal Data Scientists with the passion to help businesses have a positive impact the lives of millions of people every day. Join us in our pursuit for wisdom. Key Responsibilities:- Lead and mentor a distributed team of data scientists and developers to define and execute data science solutions that address client use cases and business requirements- Business development and sales by engaging prospective clients, developing proposals and guiding sales teams to promote data science consulting- Perform hands on data exploration and modeling over a variety types of data (e.g. text, sensor, image, audio, etc.) using big data technologies- Analyze business and operational data to identify and correct business problems- Simplify and communicate the complex to business leaders- Develop algorithms, platforms, and re-usable software, services and applications - Engage brand building activities such as publishing and speaking engagements Basic Qualifications: - Degree in Computer Science, Engineering, Mathematics, Economics, Statistics, Finance, or related field. - 5+ years relevant experience in predictive modeling and analysis. - 5+ years of experience with machine learning, data mining, and analytics techniques - 3+ years of experience in R, Python, Weka, SAS, Matlab or other statistical/machine learning software. - Strong communication, analytical and collaborative problem-solving skills. - Experience managing and growing high performing teams in Data Science. - Ability to travel to client sites as required. Preferred Candidate: - 5+ years of experience with software development, continuous development/integration, etc. - Experience with AWS, Azure, Google Cloud or Oracle Cloud services (e.g. EC2, S3, EMR, Redshift, etc.) - Experience with NoSQL, parallel or distributed programming (e.g. Hadoop/Spark)- Experience with Graphical Processing Units (GPUs) and CUDA programming. - Experience with one or more of these or similar Natural Language Processing, Computer Vision, Deep Learning, Speech Recognition and Statistical Optimization methods. - Experience in business development and sales. - Managing client relationships and leading additional sales activities. - MS/PhD Degree in Computer Science, Engineering, Mathematics, Economics, Statistics, Finance, or related field.\n<br><br>\n<strong>CountryEEOText_Description:</strong>\n<br>\nTeradata is an Equal Opportunity/Affirmative Action Employer and commits to hiring returning veterans.\n<br><br>\n<strong>City:</strong>\n<br>\nSan Diego\n<br><br>\n<strong>State:</strong>\n<br>\nCalifornia\n<br><br>\n<strong>Community / Marketing Title:</strong>\n<br>\nPrincipal Data Scientist - California\n<br><br>\n<strong>Company Profile:</strong>\n<br>\nTeradata empowers companies to achieve high-impact business outcomes through analytics. With a powerful combination of Industry expertise and leading hybrid cloud technologies for data warehousing and big data analytics, Teradata unleashes the potential of great companies. Partnering with top companies around the world, Teradata helps improve customer experience, mitigate risk, drive product innovation, achieve operational excellence, transform finance, and optimize assets. Teradata is recognized by media and industry analysts as a future-focused company for its technological excellence, sustainability, ethics, and business value.The Teradata culture isnt just about one kind of person. So many individuals make up who we are, making us that much more unique. Its what sets apart the dynamic, diverse and collaborative environment that is Teradata. But even as individuals, theres one thing that we all share our united goal of making Teradata and our people the best we can be.\n<br><br>\n<strong>Location_formattedLocationLong:</strong>\n<br>\nSan Diego, California US"}