{"job title": "Principal Deep Learning Data Scientist", "company": "Teradata", "city state": "– Santa Clara", "rating": "3.3", "job description": "<strong>Requisition Number:</strong>\n<br>\n<strong>202577</strong>\n<br><br>\n<strong>Position Title:</strong>\n<br>\nPrincipal Deep Learning Data Scientist (I)\n<br><br>\n<strong>External Description:</strong>\n<br>\nThink Big Analytics provides end-to-end solutions and services in big data, data science, analytics and data warehousing, enabling companies to become analytics-driven businesses. Think Big Analyticss strategy is to work with customers with business-driven consulting, to create analytic solutions in a technology neutral manner, and to develop its underlying platform to better support market needs. Think Big Analytics is building an Artificial Intelligence team that is growing a business focused on the emerging field of Deep Learning for enterprise analytics. Our cutting-edge advanced analytics and discovery technology is helping Fortune 1000 organizations to be efficient and innovative by uncovering new opportunities to grow revenues and cut costs. From large financial services organizations to global communication services providers to healthcare providers to auto manufacturers, the largest organizations globally are using our Big Data analytics and discovery technology to make sense of petabyte scale multi-structured data to better understand customer behaviors, anticipate customer needs and develop better products and solutions. Think Big Analytics is looking for a Principal Data Scientist with hands on experience developing, implementing and solving complex machine learning problems using emerging approaches in Computer Vision and Deep Learning.Responsibilities: Qualifications:\n<br><br>\n<strong>CountryEEOText_Description:</strong>\n<br>\nTeradata is an Equal Opportunity/Affirmative Action Employer and commits to hiring returning veterans.\n<br><br>\n<strong>City:</strong>\n<br>\nSanta Clara\n<br><br>\n<strong>State:</strong>\n<br>\nCalifornia\n<br><br>\n<strong>Community / Marketing Title:</strong>\n<br>\nPrincipal Deep Learning Data Scientist\n<br><br>\n<strong>Job Category:</strong>\n<br>\nConsulting\n<br><br>\n<strong>Company Profile:</strong>\n<br>\nWith all the investments made in analytics, its time to stop buying into partial solutions that overpromise and underdeliver. Its time to invest in answers. Only Teradata leverages all of the data, all of the time, so that customers can analyze anything, deploy anywhere, and deliver analytics that matter most to them. And we do it at scale, on-premises, in the Cloud, or anywhere in between. We call this Pervasive Data Intelligence. Its the answer to the complexity, cost, and inadequacy of todays analytics. And it's the way Teradata transforms how businesses work and people live through the power of data throughout the world. Join us and help create the era of Pervasive Data Intelligence.\n<br><br>\n<strong>Location_formattedLocationLong:</strong>\n<br>\nSanta Clara, California US"}