{"job title": "Data Scientist", "company": "Tescra, Inc.", "city state": "– San Ramon, CA", "rating": "3.8", "job description": "<strong>Job Description</strong>\n<br>\nCyberCube delivers the most comprehensive cyber insurance analytics platform for the insurance industry.\n<br>\nWe are solely focused on solving the hardest cyber risk challenges with world-class analytics. Our team is composed of multi-disciplinary experts across data science, cyber security, software engineering, modeling and commercial insurance. CyberCube offers products for cyber risk aggregation modeling and insurance underwriting. CyberCube leverages the threat intelligence from the world’s leading cyber security company, Symantec, along with several other data sources.\n<br>\nCyberCube is headquartered in San Francisco, California. We are backed by Symantec Ventures and Trident Capital Cybersecurity (TCC) – the world’s largest venture capital fund dedicated to cybersecurity early stage investing.\n<br>\nRole\n<br>\nAs a Data Scientist, you will join our growing analytics &amp; engineering teams to work on the unique cyber security data layer underlying our SaaS products. You will help build analytical models and solutions to help CyberCube Analytics products users make better data-driven decisions. This is a cross functional position with significant exposure and responsibility. This is a full-time position based in our headquarters in downtown San Francisco, California.\n<br>\n<strong>Responsibilities</strong>\n<br>\n· Gather and process data at scale (scripts, scraping, APIs, database queries, etc.)\n<br>\n· Work closely with products, analytics, and engineering team members\n<br>\n· Design and build new analytical data models and/or enhance existing data models\n<br>\n· Develop and implement machine learning algorithms at scale (supervised learning, unsupervised learning incl. feature extractions and PCA techniques, deep learning, etc.)\n<br>\n· Prepare static and dynamic data visualizations for use in internal and external contexts\n<br>\n· Assist in creating and maintaining SaaS applications\n<br>\n<strong>Skills</strong>\n<br>\n· Self-starter able to work well independently as well as in various team settings\n<br>\n· Intellectual curiosity, willingness to learn new skills, and ability to contribute ideas\n<br>\n· Excited by mathematical problems / coding challenges\n<br>\n· Excellent organizational and time management skills\n<br>\n· Eager to work in an agile environment\n<br>\n· An analytical mindset with problem-solving skills\n<br>\n· Excellent communications and presentation skills\n<br>\n<strong>Qualifications</strong>\n<br>\n· Bachelor’s or master’s degree in computer science, statistics, mathematics, or related field\n<br>\n· At least 4 years in a data scientist or equivalent role\n<br>\n· In-depth knowledge of machine learning algorithms and statistical modeling methods\n<br>\n· Experience in relational database and knowledge of SQL\n<br>\n· Excellent Python programming skills and experience with major data science libraries (Pandas, Numpy, Seaborn, Keras, TensorFlow, NLTK, etc.)\n<br>\n· Experience working with flat files, complex data types (JSON, XML, etc.), and APIs\n<br>\nBonus points\n<br>\n· Experience working in one or more of the following industries: cyber / data security, insurance, finance / risk modeling, consulting\n<br>\n· Portfolio of public and private data science projects you’re proud of (GitHub, Kaggle, DrivenData, etc.)\n<br>\n· Experience in startup environments\n<br>\n· Experience working on quantitative software products\n<br>\n· Familiar with Spark, Hadoop, and non-relational data stores (MongoDB, Neo4j, etc.)\n<br>\nWhy You’ll Love It Here\n<br>\n· Play an instrumental role in reshaping one of the oldest industries in the world\n<br>\n· Competitive salary, 401 (k), unlimited PTO, and meaningful early stage equity\n<br>\n· Generous healthcare benefits with medical, dental and vision coverage\n<br>\n· Fully stocked kitchen with healthy snacks and Ugly Juice for your enjoyment\n<br>\n· Weekly catered lunches, happy hour, and discounted gym passes\n<br>\n· Company paid learning and development assistance\n<br>\n· Grow in a collaborative, respectful, and empathetic culture\n<br><br>\n<strong>Company Description</strong>\n<br>\nCyberCube delivers the most comprehensive cyber insurance analytics platform for the insurance industry.\n<br><br>\nWe are solely focused on solving the hardest cyber risk challenges with world-class analytics. Our team is composed of multi-disciplinary experts across data science, cyber security, software engineering, modeling and commercial insurance. CyberCube offers products for cyber risk aggregation modeling and insurance underwriting. CyberCube leverages the threat intelligence from the world’s leading cyber security company, Symantec, along with several other data sources.\n<br><br>\nCyberCube is headquartered in San Francisco, California. We are backed by Symantec Ventures and Trident Capital Cybersecurity (TCC) – the world’s largest venture capital fund dedicated to cybersecurity early stage investing.\n<br><br>\nWhy You’ll Love It Here\n<br><br>\n· Play an instrumental role in reshaping one of the oldest industries in the world\n<br><br>\n· Competitive salary, 401 (k), unlimited PTO, and meaningful early stage equity\n<br><br>\n· Generous healthcare benefits with medical, dental and vision coverage\n<br><br>\n· Fully stocked kitchen with healthy snacks and Ugly Juice for your enjoyment\n<br><br>\n· Weekly catered lunches, happy hour, and discounted gym passes\n<br><br>\n· Company paid learning and development assistance\n<br><br>\n· Grow in a collaborative, respectful, and empathetic culture"}