{"job title": "Senior Data Scientist, Gigafactory 1", "company": "Tesla Motors", "city state": "– Sparks, NV", "rating": "3.4", "job description": "The Role: Senior Data Scientist\n<br><br>\nManufacturing Engineering is responsible for designing the equipment, processes and data systems of Tesla's production lines. Improving our systems through the application of experimental findings is crucial for Manufacturing Engineering to continue to improve the quality of our increasingly- complicated and increasingly-tuned production lines. This role collaborates with other members of Manufacturing Engineering to improve our most-difficult manufacturing processes and equipment through data science, experimentation and modeling to drive tangible optimizations to the production environment. In addition to designing new processes with Manufacturing Engineers, the Manufacturing Scientist defines and documents standard techniques for scientific research in the manufacturing environment. The Manufacturing Scientist also trains others to improve the sophistication and effectiveness of their scientific investigations within the organization.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Review academic and industry literature for applicable knowledge.</li>\n<li>Design experiments to generate empirical optimizations.</li>\n<li>Analyze existing in-process data to inform process development.</li>\n<li>Build mathematical models to accelerate future optimizations.</li>\n<li>Determine what data is collected and how on new production lines.</li>\n<li>Identify novel techniques for instrumenting equipment to better control process.</li>\n<li>Determine product characterizations methods for durability testing.</li>\n<li>Educate others on statistical analysis and scientific investigation.</li>\n<li>Collaborate daily with other members of Manufacturing Engineering.</li>\n<li>This is an exciting opportunity to build a world class manufacturing facility right here in the Bay Area. Tesla is a demanding and fast-paced environment where you will work on a critical subsystem of incredibly exciting products.</li>\n<li>The ideal candidate takes pride in his/her work, analytical ability, ability to explain technical issues to non-technical people, and attention to detail. He/She appreciates an environment where superior work is encouraged, noticed and rewarded and where individuals carry tremendous responsibility.</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>PhD or MS in engineering, physics, mathematics, or equivalent.</li>\n<li>5 - 10 years relevant experience.</li>\n<li>Excels in experimental design.</li>\n<li>Excels in data-driven optimizations.</li>\n<li>Excels in documentation of research and results.</li>\n<li>Exemplary verbal and written communication skills.</li>\n<li>Proficiency with data analysis languages including R, Python - Matlab and/or SAS is a plus.</li>\n<li>Proficiency in statistics and data visualization.</li>\n<li>Proficiency creating process documentation.</li>\n<li>Able to work under pressure while managing competing demands and tight deadlines.</li>\n<li>Well organized with meticulous attention to detail.</li>\n<li>Knowledgeable about production quality metrics.</li>\n<li>Experience in a factory organization.</li>\n</ul>"}