{"job title": "Data Scientist, Routing/Dispatching", "company": "Tesla", "city state": "– US-CA", "rating": "3.4", "job description": "<div><div>The Digital Products Engineering team is at the forefront of building a consistent, global customer experience across all digital touchpoints and, by way of www.tesla.com, we are the face of Tesla worldwide. This team is building the next generation infrastructure which allows our customers, living in 60+ countries, to understand, interact and purchase our amazing vehicles and energy products. This team also builds native and kiosk applications for our retail stores and back end systems that manage customer data and optimize scheduling for service centers and product installations.\n<br><br>\n<strong>The Role:</strong>\n<br><br>\nI this role, you will join a small team responsible for innovative software that allow our customers to schedule test drives, deliveries, service appointments and installations of our expanding suite of products. This team also owns applications that assist customers by providing optimal routes to our worldwide mobile service vehicles and technicians globally.\n<br><br>\n<strong><u>Responsibilities</u></strong> :\n\n<ul>\n<li>Design, implement and optimize real-time vehicle routing algorithms</li>\n\n<li>Design and develop robust, scalable, high performing, globally distributed, high-volume production applications with users across the globe participate in design and code review</li>\n\n<li>Work with vehicle navigate team to publish new Routes to Mobile service Vehicles</li>\n\n<li>Will be working in Data-driven development environment</li>\n</ul>\n<strong><u>Qualifications</u></strong> :\n\n<ul>\n<li>BS/MS/PhD, or foreign equivalent in Computer Science, Applied Mathematics, or a related field</li>\n\n<li>3+ years’ experience in a related field</li>\n\n<li>Exposure to React.js, GO, C#, Python, Java and other open source technologies is a plus</li>\n\n<li>Experience in optimization algorithms development (e.g. supply chain optimization, operations research, network design, machine learning, etc.)</li> \n\n<li>In-depth knowledge of CS data structures, algorithmic design and complexity analysis</li>\n\n<li>Knowledge of graph traversal algorithms such as Dijkstra’s, DFS, BFS, Bellman-Ford, etc.</li>\n\n<li>Good understanding of graph algorithms and data structures</li>\n\n<li>Experience defining system architectures and designs, exploring technical feasibility tradeoffs, and making data-driven decisions.</li> \n\n<li>Bonus points if you have built geospatial services and datasets before, such as maps data, routing algorithms, traffic patterns, etc.</li>\n\n<li>Architecture skills. You should have thoughts on constructing highly scalable software systems and knowledge of the principles of fault-tolerance, reliability and durability</li>\n\n<li>Capacity to evaluate tradeoffs between correctness, robustness, performance, space, and time.</li>\n</ul>\n\n</div>\n</div><div></div><strong>Apply</strong>"}