{"job title": "Data Scientist", "company": "Texas Instruments Incorporated", "city state": "– Dallas, TX", "rating": "4.0", "job description": "As a global semiconductor company operating in 35 countries, Texas Instruments (TI) is first and foremost a reflection of its people. From the TIer who unveiled the first working integrated circuit in 1958 to the more than 30,000 TIers around the world today who design, manufacture and sell analog and embedded processing chips, we are problem-solvers collaborating to change the world through technology. Put your talent to work with us change the world, love your job!\n<br><br>\nAbout the Job\n<br><br>\nIn this dynamic role within the Big Data, Data Science team, you will create the future of data driven marketing. This requires close collaboration in clearly articulating data trends, comparisons and patterns utilizing your skills in machine learning and predictive analysis. You will be a key contributor to shaping customer experience &amp; customer interactions in a multi-channel environment.\n\n\n<ul>\n<li>Apply innovative Data Science solutions that drive competitive advantage</li>\n<li>Leverage existing machine learning &amp; statistical algorithms and packages</li>\n<li>Deliver differentiated applications and ensemble models to automate highly repetitive processes</li>\n<li>Iteratively deliver solutions, focusing on rapid development and deployment</li>\n<li>Generate and communicate clear, compelling and actionable insights</li>\n<li>Be seen as a thought leader and trusted analytical partner</li>\n<li>Deliver solutions to production</li>\n<li>Collaborate across the organization to gain the business acumen to couple with Data Science capabilities</li>\n</ul>\n\nMinimum requirements\n<br><br>\nhe ability to manage and prioritize a number of concurrent tasks garnered by a drive to succeed and transform TI is critical to success.\n<br><br>\nFamiliarity with Marketing, Manufacturing or Supply Chain concepts\n<br><br>\nThe ideal candidate will have a degree in physics, statistics, mathematics, information systems, marketing analytics or related fields. Advanced degree in one of these fields is strongly preferred. Familiarity with data extracts (SQL), hadoop (Cloudera, EMR), statistical packages (Spark, R, python), reporting tools (Spotfire) and web analytics (Google Analytics or Evergage) is required. Demonstrated work experience in Data Science is required (5+ years), with domain expertise in Supply Chain or Manufacturing preferred.\n<br><br>\nQualified candidates will have a minimum of 5 years experience in Data Science with a MS degree in Quantitative Field (Information Systems, Computer Science, Industrial Engineering, Physics, Statistics or Analytics)\n<br><br>\n<strong>SQL</strong>\n<br><br>\nCloudera\n<br><br>\n<strong>EMR</strong>\n<br><br>\nSpark\n<br><br>\n<strong>R</strong>\n<br><br>\nPython\n<br><br>\nSpotfire\n<br><br>\nGoogle Analytics or Evergage\n<br><br>\nAbility to work amongst a diverse team of expertise\n<br><br>\nBuild relationships with business stakeholders to deliver game changing results\n<br><br>\nDemonstrated trust in algorithm development\n<br><br>\n<strong>Preferred qualifications:</strong>\n<br><br>\nDomain expertise in Manufacturing or Supply Chain\n<br><br>\nDemonstrated work delivery using Cloudera\n<br><br>\nDemonstrated work delivery using AWS\n<br><br>\nPhD Preferred\n<br><br>\nIf you are interested in this position, please apply to this requisition.\n<br><br>\nTexas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment. All qualified applicants will receive consideration for employment without regard to protected characteristics, including race, color, religion, sex, national origin, disability, veteran status, sexual orientation, gender identity or age.<br><br>SDL2017"}