{"job title": "Chief Data Pipeline Engineer", "company": "The Aerospace Corporation", "city state": "– El Segundo, CA", "rating": "3.7", "job description": "<strong>Requisition ID: 43088</strong>&nbsp;\n<br><br>\n<strong>All Locations:</strong> Chantilly, VA (Virginia); Los Angeles, CA (California)&nbsp;\n<br><br>\nA trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning government to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation's space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?<br>\n<div>\n<strong>Responsibilities</strong>\n<br><br>\nThe Analytics Software Department is looking to hire a Chief Data Pipeline Engineer! We're a newly-formed department with the purpose of understanding and building modern, distributed data processing and visualization systems. Our goal is to be the premier department within Aerospace for building new analytics technologies using data pipelines, processing, storage, and visualization systems. Our department is distributed between our El Segundo, CA, Chantilly, VA, and Colorado Springs, CO locations where we provide technical support and expertise for a variety of government customers. If you have the skill and talent to be one of the best, then we encourage you to apply!\n<br><br>\nThe Chief Data Pipeline Engineer provides vision and strategy for all data management activities. S/he is a champion for global data management, governance, and quality across the company. The CDPE oversees the enterprise information management, data scientists and data stewards, and data service providers.\n<br><br>\n<strong>Key Functions</strong>\n<ul>\n<li>Identify opportunities for innovation across the entire company.</li><li>Partner with leaders across the organization to develop and execute strategies for the use of data analytics to drive improvements in efficiency and effectiveness.</li><li>Initiate and obtain funding for tasks and projects beyond personal activities from internal and external sources. Tasks and projects should align with organizational goals as specified by the customer/management.</li><li>Lead cross-organizational teams and organize interfaces with customer and/or Aerospace program offices.</li><li>Act as organization's designated representative at technical meetings, and presentations.</li><li>Contribute to technical reports and other presentations to disseminate findings, guidance and technical information to as wide an audience as possible.</li><li>Comfortable working with a remote team operating in multiple time zones.</li><li>Serve as the integration leader and coordinator of a team of technical staff.</li><li>Collaborate with the data-science team to productionize ML pipeline.</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Required</strong>\n<ul>\n<li>Bachelor's degree in Computer Science, Computer Engineering, Electrical Engineering or other engineering /analytical technical area of study.</li><li>Eight or more years of experience with increasing responsibilities including experience in a lead or leadership role.</li><li>Experience in designing and building scalable analytics pipeline in cloud.</li><li>Experience with a variety of distributed data storage solutions (e.g. Elasticsearch, MongoDB, InfluxDB).</li> <li>Experience with fault tolerant message queuing/brokering systems (e.g. Kafka).</li><li>Experience developing and deploying components in a microservices architecture.</li><li>Experience working in an Agile development environment.</li><li>Presentation skills to provide updates to management to ensure project development remains aligned with management/customer vision.</li><li>Excellent communication skills and a collaborative mindset.</li><li>This position requires the ability to obtain and maintain a security clearance, which is issued by the U.S. government. U.S. citizenship is required to obtain a security clearance.</li>\n</ul>\n<strong>Preferred</strong>\n<ul>\n<li>12 or more years of increasingly responsible professional engineering/scientific experience, including multi-disciplinary systems engineering and/or program management environments</li><li>Strong practical Linux-based systems administration skills in a Cloud or Virtualized environment</li><li>Experience developing and deploying components in a multi-tenant cloud computing architecture</li><li>Advanced Degree in Computer Science, Computer Engineering, Electrical Engineering or other engineering/analytical degree</li><li>Current TS/SCI clearance</li>\n</ul>\n<strong>Transcript Requirement</strong>\n<br><br>\nNone\n</div>\n<br>&nbsp;\n<br><br>\n<strong>Additional Requisition Details</strong>\n<br><br>\n<strong>Clearance Requirement:</strong> Secret&nbsp;\n<br><br>\n<strong>Access:</strong> None&nbsp;\n<br><br>\n<strong>Polygraph:</strong> None&nbsp;\n<br><br>\n<strong>Relocation Available:</strong> Yes&nbsp;\n<br><br>\n<strong>Employment Type:</strong> Regular&nbsp;\n<br><br>\n<strong>Work Schedule:</strong> Full Time&nbsp;\n<br><br>\n&nbsp;\n<br><br>\n<strong>Company Statement</strong>\n<br><br>\nThe Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.\n<br><br>\nFrom our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world.\n<br><br>\n&nbsp;\n<br><br>\n<strong>Equal Opportunity Commitment</strong>\n<br><br>\nThe Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, age, sex (including pregnancy, childbirth, and related medical conditions), sexual orientation, gender, gender identity or expression, color, religion,&nbsp;genetic information, marital status, ancestry, national origin, protected veteran status, physical disability, medical condition, mental disability, or disability status and any other characteristic protected by state or federal law. If you’re an individual with a disability or a disabled veteran who needs assistance using our online job search and application tools or need reasonable accommodation to complete the job application process, please contact us by phone at 310.336.5432 or by email at&nbsp;ieo.mailbox@aero.org. You can also review&nbsp;The Equal Employment Opportunity is the Law&nbsp;poster and&nbsp;the supplement, as well as the&nbsp;Pay Transparency Policy Statement.&nbsp;"}