{"job title": "Sr. Data Scientist (Cross-Domain Analysis) (L2/L3)", "company": "The Aerospace Corporation", "city state": "– El Segundo, CA", "rating": "3.7", "job description": "<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong><br>\n<div><strong>Requisition ID: 43294</strong>\n<br><br>\n<strong>All Locations:</strong> Chantilly, VA (Virginia); El Segundo, CA (California)\n<br><br>\nA trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning clandestine to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation's space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?<br>\n<div>\n<strong>Responsibilities</strong>\n<br><br>\nServe as a senior data scientist in support of National Security Space, civil and commercial customers with an emphasis on applying data science techniques to cross-domain and cross-program analysis, forming and leading data science teams, articulating the value of data science to potential customers and mentoring junior personnel. This position is within the Acquisition Analysis and Information Department (AAID), which provides systems engineering and acquisition support for program planning and execution and is the corporate steward of the Acquisition Support and Systems Engineering Toolset (ASSET). AAID personnel collect, validate, manage, and leverage space and launch vehicle data with ASSET for data analytics and analyses, including anomaly and issue tracking, forecasting, and risk assessments. AAID subject matter experts (SMEs) provide front-end acquisition and systems engineering support to space, launch and ground programs and conduct studies &amp; analyses that impact acquisition or programmatic decisions.\n<br><br>\n<strong>Key Functions</strong>\n<ul>\n<li>Apply data analytic approaches to improve program acquisition planning, assess potential system threats and implications, and develop automated methods for identifying and evaluating potential market and technology trends</li><li>Apply machine learning and natural language processing techniques to the correlation and analysis of data from different programmatic domains and programs, such as anomalies, cost, schedule, risk tailoring, acquisition process, programmatic outcome</li><li>Develop predictive analytics/leading indicators to determine programmatic health from large sets of programmatic data</li><li>Develop analytical techniques to determine out of family records in large datasets for follow-up by subject matter specialists</li><li>Develop machine learning techniques to categorize and relate large sets of unstructured data</li><li>Assist ASSET developers in architecting a roadmap for providing analytics as a service</li><li>Summarize and present analysis findings to senior staff and government customers</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Required</strong>\n<ul>\n<li>A Bachelors degree in Computer Science, Engineering, Physics, Applied Mathematics or related discipline</li><li>Eight or more years of related experience</li><li>Significant experience with machine learning and other data science techniques</li><li>Statistics skills, such as analysis of variance (ANOVA) and forecasting techniques (ARIMA, ARMA, NARX)</li><li>Ability to develop data science or machine learning models in at least one language/development environment, with a strong preference for Python</li><li>Ability to research and aggregate data from multiple sources and domains, and develop predictive analytics from resulting dataset</li><li>Ability to work and communicate effectively as part of a team in a dynamic environment</li><li>Proven ability to consistently provide products of high quality</li><li>Ability to obtain SECRET clearance (SCI clearance preferred)</li>\n</ul>\n<strong>Preferred</strong>\n<ul>\n<li>PhD degree</li><li>Machine learning skills: Regression, classification, clustering, categorical data analysis, dimension reduction, feature selection, deep learning</li><li>Statistics skills: Forecasting, time series analysis, Monte Carlo simulation, analysis of variance (ANOVA), Bayesian modeling</li><li>Programming skills: Ability to develop machine learning models in Matlab, R, SAS, or Python (scikit-learn, numpy, scipy, pandas)</li><li>Additional skills: Natural language processing, computer vision, data visualization</li><li>Experience supporting DoD or Civil space programs</li><li>Published papers/articles, written reports, and conference presentations</li>\n</ul>\n<strong>Qualifications for Sr. Engineering Specialist</strong>\n<br><br>\n<strong>Required</strong>\n<ul>\n<li>A Bachelors degree in Computer Science, Physics, Applied Mathematics or related discipline</li><li>Twelve or more years of related experience</li><li>Significant experience with machine learning and other data science techniques</li><li>Statistics skills, such as analysis of variance (ANOVA) and forecasting techniques (ARIMA, ARMA, NARX)</li><li>Ability to develop data science or machine learning models in at least one language/development environment, with a strong preference for Python</li><li>Ability to research and aggregate data from multiple sources and domains, and develop predictive analytics from resulting dataset</li><li>Ability to work and communicate effectively as part of a team in a dynamic environment</li><li>Proven ability to consistently provide products of high quality</li><li>Ability to obtain SECRET clearance (SCI clearance preferred)</li><li>Evidence of using analytics or machine learning to improve business practices or make business decisions.</li><li>Experience forming and leading multi-disciplinary teams comprised of data science and other technical experts</li><li>Experience defining strategic direction of organizational data science capability and related tool development</li><li>Experience articulating the value of data science capabilities to senior management and potential new customers</li>\n</ul>\n<strong>Preferred</strong>\n<ul>\n<li>PhD degree</li><li>Machine learning skills: Regression, classification, clustering, categorical data analysis, dimension reduction, feature selection, deep learning</li><li>Statistics skills: Forecasting, time series analysis, Monte Carlo simulation, analysis of variance (ANOVA), Bayesian modeling</li><li>Programming skills: Ability to develop machine learning models in Matlab, R, SAS, or Python (scikit-learn, numpy, scipy, pandas)</li><li>Additional skills: Natural language processing, computer vision, data visualization</li><li>Experience supporting DoD or Civil space programs</li><li>Published papers/articles, written reports, and conference presentations</li>\n</ul>\n</div>\n<br><strong>Additional Requisition Details</strong>\n<br><br>\n<strong>System Job Title</strong><strong>:</strong> ENGRG SPECIALIST\n<br><br>\n<strong>Clearance Requirement:</strong> Secret\n<br><br>\n<strong>Access:</strong> None\n<br><br>\n<strong>Polygraph:</strong> None\n<br><br>\n<strong>Relocation Available:</strong> Yes\n<br><br>\n<strong>Employment Type:</strong> Regular\n<br><br>\n<strong>Work Schedule:</strong> Full Time\n<br><br>\n<strong>Company Statement</strong>\n<br><br>\nThe Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.\n<br><br>\nFrom our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world.\n<br><br>\n<strong>Equal Opportunity Commitment</strong>\n<br><br>\nThe Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.\n<br><br>\nYou can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement.</div>"}