{"job title": "Microelectronics Imaging and Analysis Scientist", "company": "The Aerospace Corporation", "city state": "– El Segundo, CA, US, 90245", "rating": "3.7", "job description": "<strong>Requisition ID: 43646</strong>\n<br><br>\n<strong>All Locations:</strong> El Segundo, CA (California)\n<br><br>\nA trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning government to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation's space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?<br>\n<div><strong>Responsibilities</strong>\n<br><br>\nThe Microelectronics Technology Department (MTD) at The Aerospace Corporation conducts basic and applied research in microelectronic and optoelectronic devices for space applications, and provides technical support to national security space programs in these areas. The MTD is seeking a member of the technical staff to support investigations of microelectronics reliability and physics of failure in advanced devices, materials, and processes for space applications.\n<br><br>\nThe staff member will perform materials and device characterization to identify root cause of failure by various techniques including x-ray computed tomography, focused ion beam analysis, and scanning electron microscopy. The staff member will apply and develop software tools for data and image analysis of x-ray computed tomography data and other large datasets to enhance perceptivity of failures and anomalies in devices. The staff member must exhibit strong written and verbal communication skills and desire to work in an environment requiring self-motivation and independence as well as project leadership and teamwork.\n<br><br>\n<strong>Key Functions</strong>\n\n<ul>\n\n\t<li>Conduct innovative basic and applied research in non-destructive fault isolation and reverse engineering of electronic devices</li>\n<li>Develop tools for data and image analysis</li>\n<li>Provide technical support to national security space programs</li>\n<li>Present results internally and at scientific meetings and publish research in refereed journals</li>\n</ul>\n<strong>Qualifications</strong>\n<br><br>\n<strong>Required</strong>\n\n<ul>\n\n\t<li>Master's in electrical engineering, physics, chemistry, computer science, or material science</li>\n<li>Coursework or experience in MatLab, C/C++, Python or a similar software</li>\n<li>Experience with materials and device characterization techniques including (but not limited to) x-ray computed tomography</li>\n<li>Coursework or experience using computational analysis techniques for image and tomography analysis</li>\n<li>Strong interpersonal skills, ability to effectively convey technical information to non-technical personnel via oral and written forms</li>\n<li>Must be able to obtain and maintain DoD Secret clearance, which is issued by the U.S. government. U.S. citizenship is required</li>\n</ul>\n<strong>Preferred</strong>\n\n<ul>\n\n\t<li>PhD in electrical engineering, physics, chemistry, computer science, or material science</li>\n<li>Knowledge of electronic device packaging and fabrication</li>\n<li>Knowledge of semiconductor physics and semiconductor failure analysis</li>\n<li>Understanding of microanalysis techniques including scanning electron microscopy, transmission electron microscopy, and other techniques which produce large amounts of image data</li>\n</ul>\n<strong>Transcript Requirement</strong>\n<br><br>\nTranscripts are required for this position.</div>\n<br><strong>Additional Requisition Details</strong>\n<br><br>\n<strong>Clearance Requirement:</strong> Secret\n<br><br>\n<strong>Access:</strong> None\n<br><br>\n<strong>Polygraph:</strong> None\n<br><br>\n<strong>Relocation Available:</strong> Yes\n<br><br>\n<strong>Employment Type:</strong> Regular\n<br><br>\n<strong>Work Schedule:</strong> Full Time\n<br><br>\n<strong>Company Statement</strong>\n<br><br>\nThe Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.\n<br><br>\nFrom our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world.\n<br><br>\nAll Aerospace employees working in organizations with technical responsibilities are required to apply for and maintain at least a Secret clearance. U.S. citizenship is required for those positions.\n<br><br>\n<strong>Equal Opportunity Commitment</strong>\n<br><br>\nThe Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, age, sex (including pregnancy, childbirth, and related medical conditions), sexual orientation, gender, gender identity or expression, color, religion, genetic information, marital status, ancestry, national origin, protected veteran status, physical disability, medical condition, mental disability, or disability status and any other characteristic protected by state or federal law. If you’re an individual with a disability or a disabled veteran who needs assistance using our online job search and application tools or need reasonable accommodation to complete the job application process, please contact us by phone at 310.336.5432 or by email at ieo.mailbox@aero.org. You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement.\n<br><br>\n<strong>Nearest Major Market:</strong> Los Angeles\n<br>\n<strong>Job Segment:</strong> \n<br>\n Chemistry, Scientific, Semiconductor, Engineer, Scientist, Science, Engineering"}