{"job title": "Vice President, Data Analyst/Data Scientist - Greenfield Infrastructure", "company": "The Bank of New York Mellon", "city state": "– New York, NY", "rating": "3.1", "job description": "The Sr. Specialist Data Analyst/Data Scientist will be part of the Greenfield Program in the New York City location.\n<br><br>\nAs you know, Greenfield is a strategic journey to modernize the application infrastructure, reduce End of Life and Critical Cyber Vulnerability risk, increase availability and reliability of the compute infrastructure, and create an agile, scalable evergreen operating model. It is one of the largest technology enabled transformation Programs in the Financial Services sector today.\n<br><br>\nBeing part of this ground-breaking Program will be exciting, rewarding and challenging, as well as representing a significant career milestone. You will be working with leading technology and transformation specialists, and be part of an energetic, committed and sophisticated team.\n<br><br>\nSr. Specialist Data Analyst-&gt;&gt; Designs and creates highly complex logical/physical data models, and data dictionaries that cater to the specific business and functional requirements of applications. Consults with businesses to identify needs and translates those needs into data architecture solutions. Develops comprehensive data/technical specifications that bridge business/product needs with system design/deliverables. Performs data extracts and creates complex data reports to analyze user metrics. Develops understanding of business needs and functionalities to determine compatibility of database with existing hardware/software applications and recommend the most cost effective methods. Consults with database administration and client areas and provides solutions in resolving issues during the translation to a physical database design. Provides knowledge and expertise of enterprise data to assist the business in the creation and definition of internal and external message flows. Provides knowledge and expertise in existing database environments and makes recommendations for opportunities to share data and/or reduce data redundancy. Analyzes market trends for data modeling tools and metadata management software. Provides input into the selection of tools and any necessary migration into the company's environment. Contributes to the achievement of area objectives. Bachelor's degree in computer science or a related discipline, or equivalent work experience required, 8-10 years of experience in data modeling, data warehousing, data entity analysis, logical and relational database design, or an equivalent combination of education and work experience required, experience in the securities or financial services industry is a plus.\n<br><br>\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's degree in computer science or a related discipline, or equivalent work experience required</li>\n<li>8-10 years of experience in data modeling, data warehousing, data entity analysis, logical and relational database design, or an equivalent combination of education and work experience required</li>\n<li>Experience in the securities or financial services industry is a plus.</li>\n</ul>\n\nFor over 230 years, the people of BNY Mellon have been at the forefront of finance, expanding the financial markets while supporting investors throughout the investment lifecycle. BNY Mellon can act as a single point of contact for clients looking to create, trade, hold, manage, service, distribute or restructure investments &amp; safeguards nearly one-fifth of the world's financial assets. BNY Mellon remains one of the safest, most trusted and admired companies. Every day our employees make their mark by helping clients better manage and service their financial assets around the world. Whether providing financial services for institutions, corporations or individual investors, clients count on the people of BNY Mellon across time zones and in 35 countries and more than 100 markets. It's the collective ambition, innovative thinking and exceptionally focused client service paired with a commitment to doing what is right that continues to set us apart. Make your mark: bnymellon.com/careers.\n<br><br>\nClient Technology Solutions provides our business partners with client-focused, technology-based solutions. These enhance their ability to be successful through world-class software solutions and leading-edge infrastructure. Client Technology Solutions provides employees with the tools and resources to enhance their professional qualifications and careers.\n<br><br>\nBNY Mellon is an Equal Employment Opportunity/Affirmative Action Employer.\n<br><br>\nMinorities/Females/Individuals With Disabilities/Protected Veterans.\n<br><br>\nPrimary Location: United States-New York-New York\n<br><br>\nInternal Jobcode: 45151\n<br><br>\nJob: Information Technology\n<br><br>\nOrganization: Project Greenfield-HR16451\n<br><br>\nRequisition Number: 1815509"}