{"job title": "Computational Scientist I", "company": "The Broad Institute", "city state": "– Cambridge, MA", "rating": "4.3", "job description": "<strong>Job Description</strong>\n<br><br>\nComputational Biologist at the Center for Microbiome Informatics and Therapeutics\n<br><br>\nPositions are immediately available.\n<br><br>\nApply your computational and mathematical skills to the analysis of large multi-modal datasets to decipher interactions between the human microbiome and the human body, advancing translational microbiome research at the Center for Microbiome Informatics and Therapeutics.\n<br><br>\nWe are looking for exceptional candidates to join our computational biology team. Our mission is to develop diagnostics, and therapeutics for a wide range of disease states associated with changes to the microbiome, such as Inflammatory Bowel Disease, Autism, and Type 2 Diabetes, and to understand the links between the microbiome and health. Directed by Ramnik Xavier (Broad and MGH) and Eric Alm (Broad and MIT), the Center for Microbiome Informatics and Therapeutics has forged strong partnerships with researchers at the Broad Institute, MIT, Harvard, and Yale and clinicians at local hospitals including Massachusetts General Hospital, Boston Children’s Hospital, and Beth Israel Deaconess to become a hub for translational microbiome research in the Boston area. Skilled computational biologists and bioinformaticians are critical to maximizing the potential of the data generated from each study so we can learn how to treat or prevent disease through manipulation of the human microbiome.\n<br><br>\nSuccessful candidates will maintain portfolios of diverse projects, that primarily are collaborations with these research faculty and clinical partners. There is also opportunity for independently conceived investigations. The breadth of projects supported by the Center will require a flexible thinker, and eager learner who is willing to conceive and develop algorithms and analysis approaches to solve the challenges posed by each study.\n<br><br>\n<strong>Example workstreams include:</strong>\n<br><br>\nConsult with collaborators to assist in designing the most effective investigations and clinical studies\n<br><br>\nDevise, document and maintain new algorithms, computational tools and approaches to data analysis\n<br><br>\nImplement and optimize successful algorithms in a data analysis pipeline, to be made available to the broader community\n<br><br>\nRegularly clearly communicate progress within the Center team, and with collaborative partners via presentations, project reports, and contributions to peer-reviewed publications\n<br><br>\nContribute to generation of protocols, publications, and grant applications\n<br><br>\n<strong>Requirements:</strong>\n<br><br>\nPh.D. in Computer Science, Bioinformatics, Mathematics, Statistics or another relevant field\n<br><br>\nExperience with analyzing complex datasets\n<br><br>\nFamiliarity with, or strong desire to learn about next-generation sequencing data analysis tools\n<br><br>\nComfortable applying relevant statistical methods\n<br><br>\nFluency in Unix, standard bioinformatics tools and programming languages (primarily Python)\n<br><br>\nOutstanding verbal and written English communication abilities\n<br><br>\nIndependent, creative, highly-motivated, highly-collaborative, and flexible team member\n<br><br>\nInterest in clinical trial design, patient-powered research, and the human microbiome\n<br><br>\nExperience in high-performance and/or cloud computing is helpful\n<br><br>\n#LI-Post\n<br><br>\nEOE / Minorities / Females / Protected Veterans / Disabilities\n<br><br>\n<strong>EEO is The Law - click here for more information</strong>\n<br><br>\n<strong>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled</strong>"}