{"job title": "Data Scientist", "company": "The Church of Jesus Christ Latter-Day Saints", "city state": "– Salt Lake City, UT", "rating": "4.2", "job description": "Posting Info\n<br><br>\nPosting Dates: 08/28/2018 - 09/11/2018\n<br><br>\nJob Family: General Mngmnt/Professionals\n<br><br>\nDepartment: Missionary Department\n<br><br>\nPurposes\n<br><br>\nPerforms root cause analysis, investigates and resolves data related inquiries and system issues. Produces and presents quantitative information requests for management, product owners, and system development. Identifies, gathers, and analyzes data to understand data cleansing and manipulation needs to ensure accurate recording of data. Analyzes data to create statistical modeling and reporting to assist department in achieving goals. Monitors system flows and data to ensure proper system functioning and data integrity. Participates on development teams to represent business needs and system development.\n<br><br>\nThe mission of this position is to help missionaries fulfill their divine responsibility to Invite others to come unto Christ by helping them receive the Restored Gospel through faith in Jesus Christ and his atonement repentance, baptism, receiving the gift of the Holy Ghost, and enduring to the end.\n<br><br>\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>50% - Collects data using system tools or ad hoc query tools. Analyzes data and processes and prepares written reports.</li>\n<li>20% - Complete root cause analysis of complex data problems, resolves by developing and implementing systems and processes where appropriate</li>\n<li>10% - Reviews current processes, identifies performance gaps, and recommends possible solutions to department management, product owners, and system development</li>\n<li>10% - Organizes and manages information from various databases.</li>\n<li>10% - Coordinates with other units, divisions, and departments to resolve data recording problems</li>\n</ul>\n\n<strong>Qualifications</strong>\n\n\n<ul>\n<li>Bachelor's Degree with 7 to 10 years of experience in a related field or a Master's Degree with 5 to 7 years of experience</li>\n<li>Strong data analysis and research skills.</li>\n<li>Ability to communicate effectively, both written and oral. Able to keep confidences and appropriately deal with sensitive data and documents.</li>\n<li>Ability to acquire in-depth knowledge of department processes and operations.</li>\n<li>Highly skilled in the use of standard desktop software including Word, Access, Excel, PowerPoint, and Visio.</li>\n<li>Proven skill in ad hoc query tools such as Oracle Discoverer, SQL, Tableau or Business Objects.</li>\n<li>Experience with software and system testing.</li>\n<li>Experience in statistical modeling and regression analysis</li>\n</ul>\n\nWorthiness Qualification\n<br><br>\nMust be a member of The Church of Jesus Christ of Latter-day Saints and currently temple worthy.\n<br><br>\nPosting Notice/More Info.\n<br><br>\nPlease Note: All positions are subject to close without notice.\n<br><br>\nFind out more about the many benefits of Church Employment at http://careers.lds.org."}