{"job title": "Data Scientist", "company": "The Cadmus Group", "city state": "– Washington, DC", "rating": "2.8", "job description": "At Cadmus, our Homeland Security Sector provides clients with pragmatic solutions to their most important analytical and policy challenges. We bring together a team of outstanding professionals who have earned a reputation of responsive and client-focused support for a wide range of homeland security, intelligence, and counterterrorism agencies at all levels of government. Our client-oriented approach, coupled with our profound and relevant subject matter expertise, enables us to bring an incisive edge to solving the most critical national security problems.\n<br><br>\nOur Homeland Security Sector seeks qualified candidates to provide data analytic support. Successful candidates will have at least 6 years of experience in data analysis, modeling, and/or data management. Candidates must have 4 years of experience providing direct support to clients and a M.A. or M.S. degree from an accredited institution. The ideal candidate will have experience working in a professional services firm and/or a government agency.\n<br><br>\n<strong>Note: This position will be located on a client site. Finalists must be able to pass a DHS Suitability check and Secret Clearance.</strong>\n<ul>\n<li>Manage data integration projects for federal client.</li><li>Liaise with federal partners to negotiate data use agreements.</li><li>Oversee the development of novel analytic approaches for biosurveillance.</li><li>Act as technical advisor on risk modeling.</li></ul>\n\n<ul>\n<li><div>M.A. or M.S. degree from an accredited institution.</div></li><li><div>At least 6 years experience supporting data analytics.</div></li><li><div>Excellent writing/editing, analytical, communications, and presentation skills.</div></li><li><div>Proficiency in relevant software programs including Microsoft Word, PowerPoint, and Excel. Knowledge of statistical software beneficial.</div></li><li><div>Command of the English language in both written and spoken format.</div></li><li><div>As a representative of Cadmus, possess the ability to demonstrate professionalism and sound judgment in interactions with clients and colleagues.</div></li><li><div>Candidates selected will be subject to a security investigation and should be able to meet eligibility requirements for access to classified information. Applicants must be U.S. citizens.</div></li><li><div>Experience working with a professional services consulting firm, DHS, Public Health, and/or the Federal Government is highly preferred.</div></li>\n</ul>\n<strong>To Apply</strong>\n<br><br>\nCandidates should submit a resume, a cover letter explaining interest and relevant qualifications, and a 2-3 page writing sample that demonstrates the ability to synthesize large amounts of information (on any topic) into a concise actionable summary.\n<br><br>\nCadmus is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other legally protected group status.\n<br><br>\nTo learn more about Cadmus, visit our website www.cadmusgroup.com\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}