{"job title": "Data Scientist", "company": "The CRS Group", "city state": "– Chicago, IL", "rating": "4.7", "job description": "Data Scientist <br>Duration: 3 month contract<br>Location: Chicago, IL<br> <br>Overview: The CRS Group is currently looking for a Data Scientist for one of our clients in the Chicago area. The CRS Group is a nationwide Staffing Firm who works primarily with Fortune 500 and Fortune 1000 corporations.<br> <br> <br> <br>Job Description:<br><br>-This contractor will assist with various projects both short and long term<br>-The team has many strategic initiatives and this contractor will help with maintenance<br>-As part of the Finance department, the Shared Analytical and Data Services team (SANDS) is comprised of highly technical resources with diverse backgrounds in data warehousing, business intelligence, analytics, forecasting, and CRM<br>-The SANDS team is responsible for delivering data solutions, analytical tools, campaign execution, and business insights to our stakeholders in Marketing, Finance, Customer Service, and Sales Operations<br><br> <br>Top Skills:<br><br>-SQL<br>-SAS<br>-Data Experience<br>-At least 2 years of experience<br><br> <br> <br> <br>Duties and Responsibilities:<br><br>-Executes and provides technical best practices and mentorship to drive the entire modeling process (requirements, design, delivery and measurement (accuracy rate and ROI)) of predicted models, forecasts and other statistical techniques<br>-These outputs can be leveraged in a variety of ways<br>-Data Mining Models - Prediction of customer behavior i.e. voluntary churn, likelihood of payment, response to an outbound campaign, fraudulent behavior<br>-Segmentation Models - customer/geographic segmentation identification i.e. target segments, store/market segments<br>-Forecasts - Prediction of enterprise metrics i.e. defects, gross ads, customer base, calls to care, device sales and bad debt expense<br>-Other analytical techniques - Performance of scenario based outcomes and predications i.e. device price elasticity, predicted impact of a credit deposit change, predicted impact of device price change<br>-Manages large intra-team projects and medium cross team projects<br>-Responsible for creating and operationalizing models and other advanced analytics<br>-Lead large analytical project and provide analytic and technical mentorship to other team members<br>-Co-manages stakeholders at the Sr. Director level and down<br>-Works with leader to provide strategic direction on how analytics can be used and sells concepts and projects to their stakeholders<br><br> <br> <br>Qualifications:<br><br>-Bachelors and 7+ yrs relevant experience required in Statistics, Math, Finance or other quantitative field or<br>-Masters degree and 5+ years of post-degree experience in Statistics, Math, Finance or other quantitative field (preferred)<br>-Significant knowledge in leveraging analytical techniques in Marketing, Finance, Credit Risk, Fraud or Receivables<br>-Advanced modeling and data manipulation skills<br>-Advanced knowledge of the entire modeling process (design, develop, test, implement, measure)<br>-Proficient leveraging financial techniques i.e ROI, NPV and Cashflow to measurement the effectiveness of the teams output<br>-Excellent ability to translate analytical findings into actionable customer strategies which will have a measured impact on the business<br>-Excellent organization and project management skills<br>-Proven ability to meet tight timelines, estimate level of effort, multi-task and prioritize workload<br>-Ability to ideate on vision for CRM infrastructure including model execution and measurement in batch and real-time channels<br>-Good presentation skills<br><br> <br> <br> <br> <br>crs_aduppler<br>crs_mgallian<br>ss #81913<br> <br> <br> <br> <br> <br> <br> <br> <br> <br>Qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or genetic information."}