{"job title": "Associate Data Scientist Internship - Customer Data&amp;Analytics", "company": "The Gap", "city state": "– San Francisco, CA", "rating": "3.6", "job description": "Our past is full of iconic moments but our future is going to spark many more. We're looking for the people who'll help make our next decade just as revolutionary as our first five. If you're one of the super-talented who thrive on change, aren't afraid to take risks and love to make a difference, you're the right fit. Come grow with us.\n<br><br>\nData Scientist Internship\n<br><br>\nGap Inc. Technology is looking for exceptional talent with freshideas, cutting-edge skills, and a passion for technology. We're not youraverage IT shop, and this isn't your average internship. In your 10 weeks withGap Inc. you'll have a voice in the room, be pushed to take risks, and play acritical role in innovative projects that are transforming retail technology.Ready to get started?\n<br><br>\nWhat's In It for You?\n<br><br>\nAs a Gap Inc. Intern, you will gainvaluable work experience in a fast paced and innovative environment, here inbeautiful San Francisco. By the end of the 10 weeks you will have completedbusiness critical projects, which you will present to your senior leadershipteam. Don't expect to be running around getting coffee. Many intern's projectshave been implemented by the business and are currently driving incredibleresults for the company. Here at Gap Inc., we like to reward success. You areinvited to participate in events, such as Giants games, happy hours, ping-pongtournaments, bowling nights, volunteering events in the community, etc.\n<br><br>\nHere's what you will do allsummer!\n\n\n<ul>\n<li>Work alongside our Customer Data&amp;Analytics team and fellowinterns on customer segmentation and descriptive analysis projects</li>\n<li>Use the latest technologies, tools, and technologies in thefield- harnessing vast pools of information available in our brands' datasystems</li>\n<li>Develop data product tools, such as dashboards and mapping tools</li>\n<li>Apply analytical and data science methods (regression, clustering,classification, text analysis) to real world datasets to solve ongoing businessproblems</li>\n<li>Present results of analysis to team members, business partners,and Gap executives</li>\n<li>Meet Sr. Data Scientists, advanced analytics experts, and ProductManagers to understand the role that analytics play in a 16 billion-dollarglobal organization</li>\n</ul>\n\nHere's what you need to get the work done\n\n\n<ul>\n<li>Undergraduate, graduate, or PhD student with one year or less left to graduate in Data Science, Statistics, Mathematics, Computer Science, Machine Learning, Management Information Systems, Information Systems, Information Technology, Integrated Systems Engineering, or related degree with a GPA of 3.0 or above</li>\n<li>Statistical and data analysis skills</li>\n<li>Languages: Python, SAS, SQL, or R. Combinations of these skills are very useful.</li>\n<li>Data visualization using tools, such as Tableau or D3</li>\n<li>Basic statistical modeling skills (regression, logistic regression, clustering)</li>\n<li>An ability to think abstractly and work cross functionally</li>\n<li>Strong communication and presentation skills</li>\n<li>A desire to evolve excellent problem solving skills; meticulous and methodical</li>\n</ul>\n\n<strong>KEY BENEFITS:</strong>\n\n\n<ul>\n<li>Merchandise discount for our brands: 50% off regular-priced merchandise at Gap, Banana Republic and Old Navy, 30% off at Outlet and 25% off at Athleta.</li>\n<li>One of the most competitive Paid Time Off plans in the industry.*</li>\n<li>Employees can take up to five \"on the clock\" hours each month to volunteer at a charity of their choice.*</li>\n<li>Extensive 401(k) plan with company matching for contributions up to four percent of an employee's base pay.*</li>\n<li>Employee stock purchase plan.*</li>\n<li>Employees receive medical, dental, vision and life insurance.*</li>\n<li>Employees can apply for tuition reimbursement.*</li>\n<li>Family care programs.</li>\n<li>Commuter benefits.</li>\n<li>Pet Discount Program.</li>\n<li>For eligible employees</li>\n</ul>\n\nGap Inc. is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. In 2016, Gap Inc. was named one of the Best Places to Work by the Human Rights Campaign for the thirteenth consecutive year and was the sole winner of the Catalyst award for equality in the workplace in 2016.\n<br><br>\nApply"}