{"job title": "Principal Research Scientist I: Informational Library Architect", "company": "The Hexagon Lavish", "city state": "– Atlanta, Georgia", "rating": "NA", "job description": "Company Description<br><br><strong>Hexagon Lavish®</strong> is a scientific research and development start-up based in the United States. The company initially was focused in machine learning techniques but now has evolved into a small company that's devoted to utilizing \"unorthodox\" research methodologies in theoretical development and uncompromised use of mathematics and science.\n<br><br>\nPIR: Premier Information Retrieval® will be a resultant product from the platform, <strong>IISS</strong> (<strong>Informational Interpretation Scientific Software</strong>). PIR will be designed as software for immediate detection, distinction, classification and analysis.\n<br><br>\n<strong><em>Desmond J. Watson</em></strong>, co-founder and chief executive officer of <strong>Hexagon Lavish®</strong>, is putting together a small team of researchers, mathematicians, engineers and programmers for this startup. If you're interested in applying your skills in efforts of turning ideas into a grand journey, submit your CV/résumé today.\n<br><br>\nApply and submit your résumé here<strong>.</strong> <br><br>Job Description<br><br>Are you turned-off to hype because you reside in a \"<em>hype-less dimension</em>\"? Is your skill-set antithetic to today's current \"<em>set standards</em>\"? Can you expediently author complicated bits of applicable mathematics \"<em>packaged impressively</em>\"? Do you harbor the quizzed-out, \"<em>anti-quantum</em>\" mind?\n<br><br>\n<strong>Hexagon Lavish®</strong> has an open/full-time position for a strategically-labyrinthine <strong><em>Informational</em></strong><strong><em> Library Architect</em></strong> that has the ability to devise methodical code construction that's not reliant on statistics or heuristics. Experience in coding for zero-root processes would be a plus. A willingness to dance with the possibility of teasing duo-decimal/sexigesimal when Base 10 just won't cut it is a second plus.\n<br><br>\nInformation organizational skills must be instinctual and interpretable for normalization to be \"stacked\" on a non-statistical basis. <strong>This position is entirely driven by human intuition</strong>.\n<br><br>\nThe ideal candidate is an individual who's found his or her self disillusioned with physics, yet still appreciates physics. If you find yourself referring to your old mathematical textbooks frequently then you need to holler at us.\n<br><br>\nThis is a <u><em>principal</em></u> research scientist position that reports directly to the <strong>Director of R&amp;D</strong>.<br><br>Qualifications<br><br><strong><u>Duties and Responsibilities</u></strong>\n<ul>\n<li>Proficient in library construction on a non-statistical basis</li></ul>\n\n<ul>\n<li>7+ years experience in information interpretation software development</li></ul>\n\n<ul>\n<li>M.Sc. or Ph.D in Applied Mathematics, Engineering, Technology or some esoteric discipline of Physics</li></ul>\n\n<ul>\n<li>Experienced in converting \"big data\" into organized information and \"structural categorization\"</li></ul>\n\n<ul>\n<li>Ability to adapt quickly to prior conducted research and development</li></ul>\n\n<ul>\n<li>Harbor an unparalleled knack for \"mining out the alpha\" of software codes</li></ul>\n\n<ul>\n<li>6 + years constructing \"clean\" algorithms for quantitative/qualitative image analysis and direct \"character\" differentiation</li></ul>\n\n<ul>\n<li>Develop PoR (points of recognition) for immediacy of perspicacious IR \"stacking\"</li></ul>\n\n<ul>\n<li>Efficient in their ability to adopt the prime benefit out of several different programming languages, even simultaneously</li></ul>\n\n<ul>\n<li>Avoid any and all implementation of \"head-fake\" innovation (i.e., \"A.I.\")</li>\n</ul>\n\nAdditional Information<br><br><strong><u>Essential Job Functions</u></strong>\n<ul>\n<li>8-15 years of exquisite and applied mathematical contribution to scientific endeavors</li></ul>\n\n<ul>\n<li>8+ years of supervisory experience in a complex, multi-site environment high-tech/scientific R&amp;D organization</li></ul>\n\n<ul>\n<li>7 years of developing a creative footprint in contrast to a \"technical record\"</li></ul>\n\n<ul>\n<li>A posteriori knowledge in numerical observations stemming from a non-theoretical origin</li></ul>\n\n<ul>\n<li>Results-oriented; able to comprehend scientific requirements and provides solutions in a rapidly changing environment and growth-oriented organization</li></ul>\n\n<ul>\n<li>Experience in creating and managing external partner relationships</li></ul>\n\n<ul>\n<li>Exceptional developmental and strategic planning skills</li>\n</ul>\n<strong><br>\n</strong>\n<br><br>\n<strong><u>Other Essential Job Functions</u></strong>\n<ul>\n<li>Sound decision-maker</li></ul>\n\n<ul>\n<li>Establish effectiveness as a mentor</li></ul>\n\n<ul>\n<li>Strong analytical skills; experience interpreting strategic plans and changes in how services are delivered into a long-term sustainable operating model</li></ul>\n\n<ul>\n<li>Excellent relationship-building skills with an ability to communicate and work effectively with a variety of internal and external stakeholders</li>\n</ul>\n<strong><u>Other Skills/Abilities</u></strong>\n<ul>\n<li>Excellent communication skills, both verbally and in written form</li></ul>\n\n<ul>\n<li>Fluent in English (and other languages)</li></ul>\n\n<ul>\n<li> Strong interpersonal skills</li></ul>\n\n<ul>\n<li>Ability to anticipate, manage and respond to legal and business needs as necessary</li></ul>\n\n<ul>\n<li>Harbor the ability to work well with people and be able to work efficiently and effectively a an integral part of an interdisciplinary team</li></ul>\n\n<ul>\n<li>Must demonstrate a high degree of integrity, trustworthiness, respect for others and the ability to deal appropriately with confidential and sensitive information</li></ul>\n\n<ul>\n<li> Must demonstrate an understanding and acceptance of the <strong>Hexagon Lavish®</strong> mission, vision and values</li>\n</ul>\n<strong>Hexagon Lavish®</strong> is an <em>equal opportunity employer</em>."}