{"job title": "Data Scientist - Personal Lines Data Science", "company": "The Hartford", "city state": "– Charlotte, NC", "rating": "3.7", "job description": "The individual will assist in development of vital analytical tools that will enable the company to better manage and monitor its products. The Data Scientist will participate on projects that utilize predictive modeling, simulation and other analytical methods to solve business problems critical to the success of the Data Science &amp; Product Management organization. There will be opportunity for projects both internal and external to the Data Science organization, presentations of completed work product, and the ability to make a difference in products that make it to market.\n<br><br>\nBeyond simply developing models, this individual will also play a role in managing a portfolio of predictive models along with the platforms used to leverage the models for answering business questions. A key responsibility will be partnering with other data scientists to maintain performance of the models, building relationships with key stakeholders to develop model evolution strategies, and managing regular requests from (internal) clients. Implementation and adoption of the assets are key success criteria for the position, which requires the development of marketing strategies and the on-going monitoring of the client experience. Strong communication skills are essential as this involves interaction with a wide variety of Hartford personnel at all levels, including product management, data science staff, and business intelligence analysts.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Build and use predictive models using various methods in support of implementation of new rating plans and other initiatives</li>\n<li>Build strong partnerships with business customers as a key point of contact</li>\n<li>Thought leadership to identify opportunities to advance model performance</li>\n<li>Communicate and influence audiences of various levels and diverse backgrounds</li>\n<li>Assist in updates to current products to ensure consistent, quality delivery</li>\n<li>Monitor the adoption and usage of assets within the product organization and elsewhere in the organization</li>\n<li>Build client artifacts to support adoption including documentation and insight briefs</li>\n</ul>\n\n<strong>Experience &amp; Skills:</strong>\n\n\n<ul>\n<li>Ability to manage multiple projects concurrently, and to set priorities and plans to meet business goals and objectives</li>\n<li>Ability to lead without having formal authority and to work both independently and in a team environment</li>\n<li>Flexibility and willingness to adapt to changing priorities of various key customers at the leadership level</li>\n<li>Strong combination of communication and problem solving skills with the ability to listen to customer needs and translate into actionable solutions</li>\n<li>3 years computer programming experience, R or Python preferred</li>\n<li>3 years of experience in statistical modeling or analysis required; 3 years of relevant insurance experience preferred</li>\n<li>Creativity</li>\n<li>Degree in quantitative field required; advanced degree preferred.</li>\n</ul>\n\nEqual Opportunity Employer/Females/Minorities/Veterans/Disability/Sexual Orientation/Gender Identity or Expression/Religion/Age\n<br><br>\nNO AGENCIES PLEASE<br><br>SDL2017"}