{"job title": "Senior Data Scientist - Advanced Analytics", "company": "The Ironside Group", "city state": "– Lexington, MA", "rating": "3.0", "job description": "The Senior Data Scientist is focused on working with other members of the practice to deliver data science services and solutions to customer-centric industries and organizations. The Data Scientist is a senior participant in a pivotal growth area for Ironside. Our Advanced Analytics practice collaborates closely with our other Enterprise Information &amp; Analytics Advisory, Enterprise Information Management, and Business Intelligence teams to build high value enterprise solutions that set our clients apart as leaders in their industries.\n<br><br>\nThe preferred candidate will reside within the NE region with a 50% travel expectation to all service regions within Ironside.\n<br><br>\n<strong>Your Contributions:</strong>\n<br><br>\nDelivery\n\n\n<ul>\n<li>Leverage your applied knowledge of statistical and machine learning methods to analyze and solve for a variety of data-centric business challenges across our entire client portfolio.</li>\n<li>Educate yourself on the client's industry, business model and key business processes in order to prescribe data science methods and approaches that will be deployable and usable, and drive the desired client business outcomes.</li>\n<li>Effectively conduct interviews with client stakeholders to derive the proper business and data contexts for any solutions that you develop.</li>\n<li>Identify and synthesize new use cases for clients to use their data and advanced analytical methods for competitive advantage.</li>\n<li>Deliver projects using the CRISP-DM methodology, produce detailed project documentation and contribute to the Ironside consulting body of knowledge.</li>\n<li>Produce and deliver presentations on project findings and results that are suitable for a variety of technical audiences from peer data scientists, to business executives with limited analytical skills.</li>\n<li>Mentor and educate clients and Ironside peers on advanced analytical methods and practices.</li>\n<li>Research and remain up to date on emerging machine learning methods, algorithms, tools and use cases, and seek to apply them to your clients' benefit.</li>\n</ul>\n\nBusiness Development\n\n\n<ul>\n<li>Assist in early discovery and pre-sale conversations with prospective clients.</li>\n<li>Assist in the development of new client proposals and sales presentations.</li>\n<li>Deliver educational client workshops on data science and machine learning to help communicate the value and potential of these business problem solving methods.</li>\n<li>Research and author thought leadership content to be published on a variety of channels including the Ironside website as well as industry publications</li>\n<li>Engage in public speaking opportunities at industry conferences and meetups.</li>\n</ul>\n\nYour Proven Track Record\n\n\n<ul>\n<li>3+ years designing and building data science applications including classification, prediction, clustering and segmentation, market basket analysis, text mining and topic modeling, recommendation engines and many others.</li>\n<li>Hands-on experience with statistical and data mining software packages (Python - SciPy, NumPy, Pandas, SciKit-Learn, R, SPSS or SAS) and a knowledge of a variety of statistical modeling and machine learning algorithms as well as their practical application.</li>\n<li>Experience or exposure to optimization, linear programming and other forms of prescriptive mathematical modeling is a plus.</li>\n<li>Experience deploying predictive models into closed-loop or automated business with process or in a real-time context is a plus.</li>\n<li>Exposure to, or use of contemporary deep learning, ensemble and boosting methods and toolsets is a plus (e.g. Keras, Tensorflow, Theano, PyTorch).</li>\n<li>Exposure to a variety of machine learning frameworks and distributed computing architectures (e.g. Spark, Hadoop)</li>\n<li>Ability to bring clarity to ambiguous situations and explain abstract concepts to all levels of stakeholders.</li>\n<li>An advanced STEM degree (PhD or MS) is preferred.</li>\n<li>Minimum BS, BA in Computer Science, Mathematics, Statistics, Economics or Finance.<br><br>SDL2017</li>\n\n</ul>"}