{"job title": "Data Scientist", "company": "The Influential Network", "city state": "– Las Vegas, NV", "rating": "3.6", "job description": "As a data scientist, you will work with our analysts and engineers to apply machine learning techniques to enrich our first-party data offerings. You will work within your team to identify, prototype, and deliver production-ready ML models and algorithms. It will be your task to innovate and push the boundaries of the influencer-marketing space.\n<br><br>\nHere's what you'll be doing:\n\n<ul>\n\n<li>Working with large sets of social-data, spanning multiple social-networks and third-party vendors (Demographic Pro, IBM Watson, AWS Rekognition, etc).</li>\n\n\n\n<li>Building and deploying ML models / algorithms at scale.</li>\n\n\n\n</ul>\n<br><br>\nHere's what we'd like to see:\n\n<ul>\n\n<li>MS+ in Statistics, Machine Learning, Applied Physics or Computer Science (or technical degree with commensurate industry experience).</li>\n\n\n\n<li>3+ years of experience working as a full-time data scientist.</li>\n\n\n\n<li>Excellent understanding of statistics, machine learning algorithms, processes, tools and platforms.</li>\n\n\n\n<li>Proficiencies: Python, numpy, scipy, scikit-learn, tensorflow, SQL, etc.</li>\n\n\n\n<li>Ability to write technical papers, as well as convey complex / abstract concepts to non-experts (Abstracts, Executive Summaries, etc).</li>\n\n\n\n<li>Innovative, creative, hungry, willing to learn and explore.</li>\n\n\n\n</ul>\n<br><br>\nBonus points if:\n\n<ul>\n\n<li>Have experience in the social-media landscape.</li>\n\n\n\n<li>Have a portfolio of written / published papers within the space.</li>\n\n\n\n<li>Have experience in Graph Mining and Link Prediction.</li>\n\n\n\n</ul>\n<br><br>\nAbout Influential\n<br><br>\nInfluential is an A.I. influencer technology and developer partner of IBM Watson. Influential’s patent-pending app is on the hip pocket of more than 10,000 of the most highly engaged influencers on Facebook, Instagram, Snapchat, Twitter, and YouTube, reaching over 5 billion users. Brands and agencies are able to make a digital media buy on social via Influential’s in-demo impression guarantee, which mirrors traditional and digital media spends. Influential conducts all campaigns through a brand-safe gateway and provides robust reporting via 3rd party analytics partners. Influential and IBM Watson have co-created technologies that allow brands and agencies to identify psychographic data on influencers, as well as three first-to-market A.I. products. Influential runs campaigns for Fortune 100 companies including Coca-Cola Company, Nestlé, General Mills, Kia Motors, Fox TV, Sony Pictures and more. Influential has offices in Beverly Hills, New York City, and Las Vegas."}