{"job title": "Data Analyst/Scientist", "company": "The Judge Group", "city state": "– Minneapolis, MN", "rating": "3.5", "job description": "Our client is currently seeking a Data Analyst/Scientist to work with our healthcare client in Minneapolis, MN!\n<br>\nThis position is responsible for delivering successful technical solutions for the department by analyzing data and developing solutions to transform that data to solutions for clinical research. The individual is responsible for development and support activities in domain with guidance from a more senior Data Analyst.\n<br><br>\n<strong>POSITION ACCOUNTABILITIES:</strong>\n\n\n<ul>\n<li>Participates in the schedule definition, system design, scope definition and development/selection of software solutions</li>\n<li>Under general direction works on team or independently to research and define user requirements and understand their needs, address those needs, handle problems as they arise, and escalate issues as required.</li>\n<li>Works on team or independently to formulate system scope, objectives, requirement and design documentation.</li>\n<li>Provides information to development schedules for assigned projects.</li>\n<li>Creation of appropriate documentation for all application modifications and new development, including the maintenance of data models for applications.</li>\n<li>Develops applications/enhancements within CIT defined architecture and following the predefined processes/methodologies.</li>\n<li>Assist in the database and systems design and construction process</li>\n<li>Analyzing and mining business data to identify patterns and correlations among the various data points</li>\n<li>Mapping and tracing data from system to system in order to solve a given business or system problem</li>\n<li>Building and supporting test data for unit, system, integration, and user acceptance testing.</li>\n<li>Proactively communicates with and coordinates activities with other members of the Development team.</li>\n</ul>\n\n<strong>JOB SPECIFICATIONS:</strong>\n\n\n<ul>\n<li>Two year technical degree. However, upon evaluation, equivalent related experience and/or education may be substituted for the degree requirement</li>\n<li>Two years technical work experience working independently and in a team-based software development environment.</li>\n<li>Informatics or healthcare background preferred.</li>\n<li>Ability to work effectively with minimal supervision, a self-starter, self-motivated team player able to work in a fast paced dynamic environment. Attention to detail with a quality focus. Possess and demonstrate strong organizational, analytical and problem solving skills; self-directed and able to work effectively independently or within project teams.</li>\n</ul>\n\n<strong>Basic knowledge of:</strong>\n\n\n<ul>\n<li>SDLC</li>\n<li>Access database</li>\n<li>Access reports and forms</li>\n<li>Visual Basic for MS Access</li>\n<li>SQL</li>\n<li>Structured Query Languages on Relational Database Management Systems</li>\n</ul>\n\n<strong>ID:</strong>  592437\n<br>\n<strong>Type:</strong>  Temp to Hire\n<br>\n<strong>Salary:</strong>  Open - provided by Dice\n<br><br>\nAnalyst, Architecture, Database, Development, Management, Project, Research, SDLC, SQL, Supervision, Testing, Visual Basic"}