{"job title": "Data Scientist", "company": "The Judge Group, Inc.", "city state": "– Irving, TX", "rating": "3.6", "job description": "Our client is currently seeking a<strong> Data Scientist</strong> \n<br><br>\nThis is a full-time permanent position with salary, benefits, etc. in Irving, Texas\n<br><br>\n<strong>Data Scientist</strong> \n<br>\n<strong>SQL, SAAS and R Experience</strong>\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nThe Advanced Analytics - Data Scientist would be a hands-on problem solver with a business oriented, results driven, self-starter mindset. In order to succeed in this role the applicant should be a very strong team player, eager to take on challenges and responsibility of increasing complexity, have impeccable attention to detail, be able to work independently, able to successfully complete analytics projects within time with the business outcome in mind, apply scientific rigor to analyses and models, be able to improvise and solve problems in the absence of perfect data and be able to simplify and communicate complex results to key business stakeholders via presentation and visualization tools.\n<br><br>\nIdeal candidate will design, develop, and execute key quantitative/modeling projects to drive improvement in retention and acquisition win-rates as well as contribution margin / profitability. Excellent communication and inter-personal skills are vital to success in this role.\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\nAperson in this role is expected to deliver advanced analytics solutions to business problems, with little or no reliance on supervision for technical execution of projects\n<br><br>\nMust demonstrate business value from his/her models and ensure that stakeholders are aligned with the expected and actual results\n<br>\nEager to learn, assimilate constructive feedback and grow through roles of greater responsibility\n<br>\nMust be an independent thinker, with a strong bias towards action and avoiding analysis-paralysis. Excellent attention to detail necessary.\n<br>\nPassionate about solving real business problems via advanced analytics and data science. Collaborates effectively with stakeholders to plan and implement solutions.\n<br>\nMust be a self-starter and eager to execute plans with minimal supervision. Must have strong presentation and business writing skills. Must be able to create effective documentation.\n<br><br>\n<strong>Qualifications:</strong>\n<br>\n3-5 years for Master's degree candidates\n<br><br>\n0-2 year for PhD Candidates\n<br>\nMaster's degree or PhD in Mathematics, Machine learning, Operations Research, Statistics or a related discipline\n<br><br>\n<strong>Relevant Experience:</strong> \n<br>\nSolid theoretical background in mathematics, statistics, database technology mathematical optimization, graph algorithms and related disciplines\n<br>\nStrong computer programming skills in a high-level programming language, preferably SAS, SQL and Python, refined via professional experience, PhD research, collaboration in an impactful open source project or a well-known predictive modeling open competition\n<br>\nStrong experience building original and non-trivial models with one or more tools for creating predictive /machine learning/operations research models, refined via professional experience, PhD research, collaboration in an impactful open source project or a well-known predictive modeling open competition\n<br><br>\n<strong>Please contact:</strong>\n<br><br>\n<strong>Richard Bower, Technical Recruiter, Judge Technology Solutions\n<br>\n12700 Park Central Drive, Suite 1070 Dallas, Texas 75251\n<br>\n(817) 988-7088 www.judge.com</strong>\n<br><br>\n<strong>Judge Group Job Order ID:</strong> 574809\n<br><br>\n<strong>Salary:</strong> Open\n<br><br>\nCompany Description:<br><br>Working at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions – powered by top talent – to help organizations reach their strategic goals and realize opportunities now and in the future.\n<br><br>\nThe Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}