{"job title": "Senior Big Data Engineer", "company": "The Royak Group Inc.", "city state": "– Atlanta, GA", "rating": "1.6", "job description": "The Senior Big Data Engineer will be responsible for expanding and optimizing company's data and data pipeline architecture as well as optimizing data flow and collection from cross functional sources. The ideal candidate is an experienced data pipeline builder and data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support company's Security Analysts and Data Scientists on various data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects. He/she must be self-directed and comfortable supporting the data needs of multiple teams, systems and products. The right candidate will be excited by the prospect of optimizing or even re-designing our company's data pipelines and flows to support our next generation of products and data initiatives.\n<br><br>\n<strong>Duties &amp; Responsibilities:</strong>\n<ul>\n <li>Create and maintain optimal data pipeline architecture, including implementing ETL process to import data from various existing data sources and enrich data from external data sources</li> <li>Assemble large, complex data sets that meet functional/non-functional business requirements</li> <li>Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.</li> <li>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS big data' technologies</li> <li>Assist in the construction of analytics tools that utilize the data pipeline to provide actionable insights into key business performance metrics</li> <li>Work with key stakeholders, from Executives to Data Scientists, to assist with data-related technical issues and support their data infrastructure needs</li> <li>Keep our data separated and secure across national boundaries through multiple data centers and AWS regions</li> <li>Create data tools for analytics and data scientist team members that assist them in building and optimizing our products into an innovative industry leader</li> <li>Work with data and analytics experts to strive for greater functionality in our data systems</li> <li>Select and integrate any Big Data tools and frameworks required to provide requested capabilities</li> <li>Monitoring performance and advising of any necessary infrastructure changes</li>\n</ul>\n<strong>Required Experience:</strong>\n<ul>\n <li>Advanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases (eg Postgresql, MySQL, Microsoft SQL Server, IBM DB2, Oracle)</li> <li>Experience with data extraction from non-structured data sources, eg Splunk, CRM Notes</li><li>Management of big data clusters (Hadoop, Accumulo), with all included services</li> <li>Experience with one or more of Cloudera/MapR/Hortonworks</li> <li>Ability to solve any ongoing issues with operating the cluster</li> <li>Experience with building stream-processing systems, using solutions such as Storm or Spark</li> <li>Good knowledge of Big Data querying tools, such as Pig, Hive, and Impala</li> <li>Experience with NoSQL databases, such as HBase, Cassandra, MongoDB</li> <li>Knowledge of various ETL techniques and frameworks, such as Flume</li> <li>Experience with various messaging systems, such as Kafka or RabbitMQ</li> <li>Experience with Big Data ML toolkits, such as Mahout, SparkML, or H2O</li> <li>Experience with one or more of Cloudera/MapR/Hortonworks</li><li>Experience with object-oriented/object function languages: Python, Java, C++, Scala, C#, etc.</li> <li>Operating system experience including Linux, MS Windows, Docker</li>\n</ul>\n<strong>Core Qualifications:</strong>\n<br><br>\nLooking for a candidate with 5+ years of experience in a Data Engineer role who has attained a Bachelor's degree or higher in Computer Science, Statistics, Informatics, Information Systems or another quantitative field.\n<br><br>\nExperience building and optimizing big data' data pipelines, architectures and data sets. Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement. Strong analytic skills related to working with unstructured datasets. Build processes supporting data transformation, data structures, metadata, dependency and workload management. A successful history of manipulating, processing and extracting value from large disconnected datasets. Experience supporting and working with cross-functional teams in a dynamic environment. Proficient understanding of distributed computing principles.<br><br>"}