{"job title": "Data Engineer (Spark/Scala)", "company": "The Recon Group", "city state": "– Miami, FL", "rating": "NA", "job description": "Position: Data Engineer (Spark/Scala)\n<br><br>\nDepartment: Implementation and Business Management\n<br><br>\nClassification: Exempt\n<br><br>\nReports to: Director of Program Management/ Business Development\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\ngoTRG is looking for data engineers to lead the design, development, and maintenance of enterprise business intelligence systems. Utilizing a mastery of Spark with Scala or Java. You will create scalable data science applications and models that drive operational processes in the areas of ecommerce, logistics, pricing, and more. You will also participate in the development of front-end user interfaces that visualize vast amounts of data. The ideal candidate is well-versed in the Spark framework with Scala or Java, has an intuition for building and optimizing data-intensive applications, and a passion for optimizing business processes with data.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Create applications in Spark with Scala or Java</li>\n<li>Build statistical models in the area of ecommerce, logistics, and pricing</li>\n<li>Assist in the development of data-intensive user interfaces</li>\n<li>Assist in the management of ETL pipelines of production</li>\n</ul>\n\n<strong>Technologies and Skills:</strong>\n\n\n<ul>\n<li>Spark knowledge (Scala,Java)</li>\n<li>Exceptional logical data modeling and SQL skills</li>\n<li>Familiarity of working with kudu, impala, hive</li>\n<li>Strong familiarity with Hadoop ecosystem</li>\n<li>Object-oriented/functional scripting languages: Java, Scala preferred</li>\n<li>ElasticSearch</li>\n<li>apache ETL tools knowledge such as Sqoop or flume</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Advance data analysis skills, database query construction data, warehousing, regression modeling and business analysis</li>\n<li>Ability to communicate complex quantitative analysis in a clear and precise manner</li>\n</ul>\n\nAbout goTRG\n<br><br>\ngoTRG is a leader in the implementation and execution of multi-channel and supply chain solutions. The companys innovative R1 technology powers every touch, movement and decision for the worlds largest companies resulting in superior net margins, controls and sell-through.\n<br><br>\ngoTRG has processed and sold 15 million units with a retail value of over $1 billion in the last year. 100,000 SKUs are simultaneously listed on 22 marketplaces with a retail value of over $100 million. R1 has collected and curated data for over 4 million UPCs from over 50 marketplaces in the last year."}