{"job title": "Director of Data Engineering", "company": "The RealReal", "city state": "– San Francisco, CA", "rating": "3.2", "job description": "The RealReal, is leading the way in authenticated luxury consignment, online and in real life at our brick and mortar locations. Founded in 2011, we’re growing fast and fundamentally changing the way people buy and sell luxury — a multi-billion dollar industry. With a team of in-house experts who inspect every item we sell, our commitment to authenticity sets us apart and creates a foundation of trust with shoppers and consignors. Our mission to extend the life cycle of luxury items is leading innovation in sustainable fashion. We’re proud to promote the circular economy and to be the first luxury member of the Ellen MacArthur Foundation’s prestigious CE100 USA.\n<br><br>\nEmployees at The RealReal are dedicated, collaborative and innovative, and we’re looking for exceptional talent to join our team. Build your career with us and enjoy 401K matching, health, dental and vision insurance, commuter flex spending, healthcare flex spending, generous PTO, a mother’s room, flexible work hours and Friday bagels!\n<br><br>\nAs a Director of Data Engineering at The RealReal you'll drive our automation, personalization and data pipeline initiatives. You will own critical systems throughout the platform and be responsible for their teams performance, adding new, valuable features, and ensuring that these systems perform correctly.\n<br><br>\nThis position is based in San Francisco and reports to the CTO.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n<ul>\n <li>Manage all Data Scientists</li> <li>Own Data pipelines</li> <li>Take ownership of key components, ensuring that they meet the needs of the business</li> <li>Collaborate with senior management, product management, and other engineers in the development of product requirements for the company's software.</li> <li>Mentor team members to build the company's overall expertise in Data engineering</li> <li>Work to make The RealReal an innovator in the space by bringing passion and new ideas to work every day.</li>\n</ul>\n\n<strong>REQUIREMENTS</strong>\n\n<ul>\n <li>A degree in computer science</li> <li>5+ years of Machine Learning</li> <li>Fluency in the Python language</li> <li>High degree of familiarity with:</li> <li>SQL databases</li> <li>TensorFlow</li> <li>Computer Vision</li> <li>Expertise in working with cloud systems, specifically for application hosting, file storage, and other related concerns.</li> <li>Experience working with data warehouses such as AWS Redshift or Google BigQuery</li> <li>Proven track record of building modern analytics pipelines</li> <li>Comfortable working in an environment where innovation and change are the norm.</li> <li>A passion for building great products.</li>\n</ul>\n<strong>NICE TO HAVES</strong>\n<ul>\n <li>E-commerce experience</li> <li>Recommendation engine experience</li> <li>Pricing experience</li> <li>Image similarity experience</li> <li>Personalization experience</li>\n</ul>"}