{"job title": "Principal Scientist, AR&amp;D- Mass Spectrometry", "company": "Therapeutic Proteins International", "city state": "– US-NJ-Piscataway", "rating": "2.7", "job description": "<div><div>\n<div>Adello Biologics is a privately held, U.S.-based biotechnology company that leads with science to accelerate development and drive manufacturing efficiency. The company's aim is to provide high-quality, affordable biosimilars to patients worldwide. Headquartered in Piscataway, NJ and driven by a team of highly skilled industry veterans, Adello is advancing a strategic pipeline of proteins and complex monoclonal antibodies with lead candidates in oncology and immunology. For more information, visit www.Adellobio.com\n<br><br>\nOur vision is to make biosimilar medications affordable. We are seeking candidates interested in contributing to a bourgeoning field that has the potential to help millions of patients. As a growing company, Adello Biologics offers real development opportunities for candidates excited to take on responsibility, make an immediate impact and help us achieve our vision. As part of a close knit team, you’ll have the opportunity to work in a unique, high science industry while expanding your career. We are seeking a Principal Scientist, AR&amp;D- Mass Spectrometry to be based out of our HQ in Piscataway, NJ.</div></div>\n</div>\n\n<br>Responsibilities<br>\n\n<div>\n<div>\n<div>The successful candidate will be responsible for development innovative analytical methods to test biological drug substances and drug products, the planning and execution of studies to support formulation development and manufacturing process development, analytical similarity studies, and release/stability testing using LC-MS-based detection. The incumbent must have the experience working in authoring SOPs and technical reports suitable for review by health authorities and mentoring other scientists. The successful candidate will be a highly motivated, well-organized, detailed-orientated scientist with the ability to work effectively in a fast-paced and multi-disciplinary environment.\n<ul>\n<li>Participate and lead in technology development and implementation by exploring novel concepts and innovative workflows to expand the group’s mAb analytical capabilities</li><li>Participate in all phases of mass spectrometry laboratory operations including technology evaluations, the development of sample preparation and separation methods, data analysis, interpretation, reporting and follow up discussions with the project teams on utilizing the data in appropriate decision making.</li><li>Application of regulatory guidance for assay development, data analysis, and biosimilarity testing.</li><li>Development of bioassays for characterization and product release: binding, potency, effector function, downstream signaling, reverse-signaling, etc.</li><li>Support drug substance and drug product manufacturing process development</li><li>Transfer of analytical methodologies to other laboratories.</li><li>Participate and/or lead cross-functional project teams.</li><li>Author reports suitable to support regulatory filings and responses to inquiries from regulatory authorities.</li><li>Represent the company in discussions with external parties (conferences, regulatory meetings, CROs/CMOs, business partners)</li></ul></div>\n</div>\n</div>\n\n<br>Qualifications<br>\n\n<div>\n<div>\n<div><strong>PREREQUISITES</strong>\n<ul>\n<li>D. in Pharmaceutical Sciences, Analytical Chemistry, Biochemistry with 10+ year’s relevant industrial experience.</li>\n</ul>\n<br><br>\n<strong>EXPERIENCE</strong>\n<ul>\n<li>Familiar with ICH guidelines and USP/EP pharmacopeia requirements</li><li>A strong theoretical understanding and experience in protein chemistry</li><li>Expertise in development, characterization, and implementation of biomarker assays based on quantitative protein mass spectrometry for drug development.</li><li>Experience and knowledge in operation of modern triple quadrupole and ion trap/orbitrap mass spectrometers and associated control and data analysis software systems.</li><li>Knowledge and application of complex sample preparation methodologies as applied to quantitative protein mass spectrometry workflows.</li>\n</ul>\n<strong>WORK ENVIRONMENT AND PHYSICAL DEMANDS:</strong>\n<br><br>\nGeneral Work Environment:\n<ul>\n<li>General office setting.</li><li>Must be able to work extended hours or weekend hours, as may be necessary.</li>\n</ul>\nNoise:\n<ul>\n<li>No extraordinary noise levels</li>\n</ul>\nStanding/Lifting:\n<ul>\n<li>No extraordinary requirements.</li>\n</ul>\nVisual:\n<ul>\n<li>No extraordinary requirements</li>\n</ul>\nStress:\n<ul>\n<li>High paced demanding environment to meet ambitious project goals.</li>\n</ul>\nTravel:\n<ul>\n<li>Some travel required, but not exceed 30%</li>\n</ul>\n<em>Adello Biologics, LLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Adello Biologics, LLC complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training</em>\n<br><br>\n<strong>Notice To Agency And Search Firm Representatives</strong>\n<br><br>\nAdello Biologics is not accepting unsolicited resumes from agencies and/or search firms for this job posting. Resumes submitted to any Adello employee by a third party agency and/or search firm without a valid written &amp; signed search agreement, will become the sole property of Adello. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you.</div>\n</div>\n</div>\n<br>"}