{"job title": "Data Scientist", "company": "Thermo Fisher Scientific", "city state": "– Carlsbad, CA", "rating": "3.3", "job description": "Job Description<br><br>When you join us at Thermo Fisher Scientific, youll be part of a smart, driven team that shares your passion for exploration and discovery. With revenues of $22 billion and the largest investment in R&amp;D in the industry, we give our people the resources and opportunities to make significant contributions to the world.\n<br><br>\nThe <strong>Data Scientist</strong> is part of the Life Sciences Solutions Group (LSG) which is one of five groups within Thermo Fisher Scientific and is an important part of the companys total value proposition. With an innovative and broad life sciences portfolio, a strong presence at bench, best-in-class web and e-commerce channels, industry-leading on-site supply center coverage and one of the most technically experienced sales and support teams, LSG brings incredible core strength to the broader company.\n<br><br>\n<strong><u>Summary: Data Scientist, Carlsbad, CA</u> </strong>\n<br>\nThe Data Scientist will apply advanced data mining techniques to build models to optimize marketing activities such as lead scoring, customer journey, customer acquisition, up sell and cross sell, market baskets and customer experience and retention.\n<br><br>\n<strong>What will you do?</strong>\n<ul>\n<li>Collaborate closely with marketing managers on implementing model output and evaluating the effectiveness of marketing tactics.</li><li>Develop reports, visualization, and key performance indexes to track effectiveness of marketing &amp; guide marketing decisions.</li><li>Perform AB &amp; multi-variate testing to measure impact of data science.</li>\n</ul>\n<strong>How will you get here?</strong>\n<br><br>\n<strong>Minimum Qualifications:</strong>\n<ul>\n<li>BS in computer science, data science, data analytics, or applied statistics.</li><li>3+ years of experience with machine learning, data mining, statistical modeling tools &amp; underlying algorithms.</li><li>3+ years of experience in Python.</li><li>2+ years of experience in R.</li><li>1+ year of experience in PowerBI.</li><li>3+ years of experience in SQL.</li><li>1+ year of experience in building models in Spark using R, Python &amp; Scala.</li><li>A strong background in data analysis, predictive statistical modeling, customer profiling and segmentation, experiment design and A/B and multivariate tests. Experience with collaborative filtering.</li><li>Excellent written and oral communication skills, including an ability to communicate across business areas and with global team.</li><li>Ability to work with stakeholders and communicate the benefits of data science algorithm.</li><li>Ability to lead projects and manage process and organizational change.</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>MS in computer science, data science, data analytics, or applied statistics.</li><li>Experience with Natural Language and Text processing.</li><li>Work Experience in Genetics and Bio Engineering.</li>\n</ul>\nAt Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.\n<br>\nApply today! http://jobs.thermofisher.com<br><br>If you are an individual with a disability who requires reasonable accommodation to complete any part of our application process, click here for further assistance.<br><br>Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}