{"job title": "Data Scientist (PhD or MS, Machine Learning, R, SAS, Matlab, Python) - 14928", "company": "The Syllogisteks Company", "city state": "– Creve Coeur, MO", "rating": "4.1", "job description": "Must be able to work as our W2 Employee\n<br><br>\nOur Fortune 500 Client is seeking a Research Data Scientist. The ideal candidate will have a PhD or a MS with 6+ years of experience and a strong background in data mining, statistical modeling and experimental design using R, MATLAB, SAS, and Python.\n<br><br>\nGlobal IT Analytics team within the Research and Development (R&amp;D) IT organization looks to find creative and innovative solutions to enable success across the enterprise from our research pipeline to the customer while identifying and capitalizing on new opportunities to maintain and grow our position as the market leader. The ability to examine and optimize our current methods coupled with an eye on the future lends itself to a unique opportunity within our organization.\n<br><br>\nThe Data Scientist will join our Global IT Analytics team within P&amp;E IT. The P&amp;E IT organization works directly with scientists to develop software platforms that enable cutting-edge research and development to revolutionize plant breeding and biotechnology, optimize supply chain logistics and deliver best customer experience. This position will support the Facility Platform.\n<br><br>\nThe responsibilities of this position include development of research strategies for discovery projects in the Facility platform. The successful candidate will use the latest mathematical innovations to propose R&amp;D software solutions that accommodate emerging trends in data quantity and quality. The Data Scientist will design and test algorithms and conduct prototyping to evaluate possible scenarios leveraging computational and statistical techniques for the development of novel approaches for high-throughput data analyses. The successful candidate will have the opportunity to work collaboratively with interdisciplinary scientists internal and external, organize challenging problems, develop new solutions, and work with business &amp; development teams to ensure these solutions deliver value.\n<br><br>\n<strong>Required Skills:</strong>\n\n\n<ul>\n<li>PhD or (MS with 6 years of experience) in Mathematics, Statistics, Electrical/Mechanical/Environmental Engineering, Spatial Statistics, Geoinformatics, Environmental Modeling, Engineering, Computer Science, or Computational Biology</li>\n<li>Experience with data mining, statistical modeling and experimental design</li>\n<li>Experience analyzing and presenting complex data and proven problem solving abilities</li>\n<li>3+ years experience with Statistical and Mathematical programming packages (R, Matlab, SAS)</li>\n<li>Strong publication record in leading scientific journals o patents</li>\n<li>Strong organizational, interpersonal, and written communication skills</li>\n<li>Ability to work in a matrix environment, leading &amp; influencing people at varying levels of responsibility</li>\n</ul>\n\n<strong>Desired Skills:</strong>\n\n\n<ul>\n<li>Proficiency in Temporal Statistical Modeling including experimental design</li>\n<li>Experience working with agricultural/biological scientific data is highly desired</li>\n<li>Drive for translating business problems into research initiatives that deliver business value</li>\n<li>Creativity in defining challenging exploratory projects</li>\n</ul>\n\n<strong>Additional Info:</strong>\n\n\n<ul>\n<li>This is position is part of a 5+ year old team of ~35 multi-disciplinary Data Scientist.</li>\n<li>MUST HAVES: Ph.D. in an analytics discipline with hands on experience working with real world data. Or Masters Degree in an analytics discipline with 6+ years of post-grad school experience. Strong background in statistics and machine learning. Prior programming experience in Python and R.</li>\n<li>Possibility of extension or conversion.</li>\n<li>Open to candidates who are willing to relocate.</li>\n\n</ul>"}