{"job title": "Research Data Scientist (PhD, Geospatial, Statistics, Python or R, Machine Learning) - 14922", "company": "The Syllogisteks Company", "city state": "– Saint Louis, MO", "rating": "4.1", "job description": "Our Fortune 500 Client is seeking a Research Data Scientist for Geospatial Analytics. The ideal candidate will have a PhD or be about to complete their PhD, have proficiency in statistical skills, Python or R programming skills and knowledge of machine learning.\n<br><br>\nWe are seeking a Research Data Scientist to join our Global IT Analytics team within R&amp;D IT. The R&amp;D IT organization works directly with scientists to develop software platforms that enable cutting-edge research and development to revolutionize plant breeding and biotechnology, optimize supply chain logistics and deliver best customer experience. This position will support the Field platform within our customer. The Field platform is dedicated to getting more from every acre by integrating their expertise in seed science, field science, data analysis and precision equipment to develop solutions optimized for the conditions of a farmers field.\n<br><br>\nThe responsibilities of this position include development of research strategies for discovery projects in the Field platform. The successful candidate will use the latest mathematical innovations to propose R&amp;D software solutions that accommodate emerging trends in data quantity and quality. The Research Data Scientist will design and test algorithms and conduct prototyping to evaluate possible scenarios leveraging computational and statistical techniques for the development of novel approaches for high-throughput data analyses. The successful candidate will have the opportunity to work collaboratively with interdisciplinary scientists internal and external to our client, organize challenging problems, develop new solutions, and work with business &amp; development teams to ensure these solutions deliver value.\n<br><br>\nRequired Skills:\n\n\n<ul>\n<li>PhD or PhD completion in the next 6 months in Mathematics, Statistics, Electrical/Mechanical/Environmental Engineering, Spatial Statistics, Geoinformatics, Environmental Modeling, Engineering, Computer Science, or Computational Biology</li>\n<li>Experience with statistical modeling and data mining</li>\n<li>Experience analyzing and presenting complex data and proven problem solving abilities</li>\n<li>3+ years of experience with Statistical and Mathematical programming packages (Python, R)</li>\n<li>Strong publication record in leading scientific journals</li>\n<li>Strong organizational, interpersonal, and written communication skills</li>\n<li>Ability to work in a matrix environment, leading &amp; influencing people at varying levels of responsibility\n<br><br>\nDesired Skills:</li>\n<li>Proficiency in Spatial and/or Temporal Statistical Modeling</li>\n<li>Proficiency in Machine learning algorithms and concepts (Ensembles, Deep Learning, SVM, etc.)</li>\n<li>Experience working with agricultural/biological scientific data is highly desired</li>\n<li>Drive for translating business problems into research initiatives that deliver business value</li>\n<li>Creativity in defining challenging exploratory project</li>\n</ul>\n\n<strong>Additional Info:</strong>\n<br>\n<strong>\n<ul>\n<li>TOP THREE SKILLS:</li>\n</ul>\n\n</strong>\n<br>\no Proficient in statistical skills\n<br>\no Proficient in Python or R\n<br>\no Knowledgeable in machine learning\n\n\n<ul>\n<li>Possibility of extension based on business needs and performance.</li>\n\n</ul>"}