{"job title": "Data Analyst", "company": "The Salem Group", "city state": "– NAPERVILLE, IL", "rating": "3.9", "job description": "Salem Staffing’s Oakbrook Terrace staffing center is looking for a highly professional Data Analyst for a Temporary position at our client’s office located in Naperville, IL\n<br><br>\nSNAPSHOT:\n<br><br>\nTitle: Data Analyst\n<br><br>\nLocation: Naperville, IL\n<br><br>\nHours: 8:00am -4:30pm, Monday to Friday\n<br><br>\nCompensation: $25+/hour, depending on work history/experience\n<br><br>\nDAY-TO-DAY:\n\n<ul>\n\n<li>Interpret data, analyze results using statistical techniques and provide ongoing reports</li>\n<li>Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality</li>\n<li>Acquire data from primary or secondary data sources and maintain databases/data systems</li>\n<li>Identify, analyze, and interpret trends or patterns in complex data sets</li>\n<li>Filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems</li>\n<li>Work with management to prioritize business and information needs</li>\n<li>Locate and define new process improvement opportunities</li>\n\n</ul>\nJOB REQUIREMENTS:\n\n<ul>\n\n<li>Analytical Skills: Data analysts work with large amounts of data: facts, figures, and number crunching. You will need to see through the data and analyze it to find conclusions.</li>\n<li>Communication Skills: Data analysts are often called to present their findings or translate the data into an understandable document. You will need to write and speak clearly, easily communicating complex ideas.</li>\n<li>Critical Thinking: Data analysts must look at the numbers, trends, and data and come to new conclusions based on the findings.</li>\n<li>Attention to Detail: Data is precise. Data analysts must make sure they are vigilant in their analysis to come to correct conclusions.</li>\n<li>Math Skills: Data analysts need math skills to estimate numerical data.</li>\n\n</ul>\nCOMPENSATION:\n\n<ul>\n\n<li>Flexible based on experience</li>\n<li>The benefits of working with Salem Staffing— In addition to your regular earnings, The Salem Group is proud to offer a benefits package that is second to none. Once eligible, our assignment employees can take advantage of health insurance, holiday pay, sick pay and our premier 4,000 Hours Club bonus.</li>\n\n</ul>\nQUESTIONS?\n<br><br>\nCall us at 630.932.9200 to speak with a Salem Staffing professional!\n<br><br>\nSALEM $ENTS REFERRAL PROGRAM\n<br><br>\nIf you know others as reliable and professional as yourself, refer them to Salem Staffing to receive a $50 referral bonus after they complete their first 37.5 hours of work for a Salem Group client.\n<br><br>\nEEOC\n<br><br>\nThe Salem Group considers applications for all positions without regard to race, color, religion, creed, sex, national origin, disability, sexual orientation, gender identity, citizenship status or any other legally protected status."}