{"job title": "Product Manager, Data &amp; Analytics", "company": "The Walt Disney Company", "city state": "– New York, NY", "rating": "3.8", "job description": "Disney Streaming Services (DSS) is creating the future of digital video entertainment products for one of the largest media brands in the world. We?re focused on delivering extraordinary experiences and distributing the incredible library of Disney content through all forms of interactive media. Our digital technology leadership and capabilities are married with a passion for crafting dynamic consumer-facing applications that integrate live and on-demand multimedia. We create great digital media products for millions of fans around the globe, and we're looking for strong performers who can help us improve what we do every day. This is an opportunity to impact experiences that will be used by millions of users worldwide.\n<br><br>\nWe are looking for experienced Product Managers with a specialty in data and analytics technology. The Product Manager, Analytics will lead analytics-related product development efforts, provide strong input into data tech R&amp;D and data-related critical initiatives, as well as work on the integration activities with Disney Streaming Services? analytics technology partners.\n<br><br>\nAt DSS data is central to measuring all aspects of the business, and critical to its operations and growth. Product Managers work closely with the team responsible for collecting, analyzing and distributing data using public cloud and open source technologies, and will be a key driver of transparency into customer behavior and business performance.\n<br><br>\nDisney Streaming Services has offices in New York and the San Francisco Bay Area.\n<br><br>\nWe offer a rare opportunity for any Product Manager:\n<br><br>\n+ Manage products that make use of state-of-the-art technology\n<br><br>\n+ Work with a premier product and engineering team\n<br><br>\n+ Work on award-winning video applications, and the platform that powers them\n<br><br>\n+ Influence the innovation of products used globally by millions\n<br><br>\n+ Work in a highly collaborative team environment\n\n\n<ul>\n<li>*Responsibilities :**</li>\n</ul>\n\n+ Assume product leadership for analytics-related product functionality and the end to end technology integration cycle\n<br><br>\n+ Collaborate with engineering teams, data analysts and data scientists to design and build data-forward solutions\n<br><br>\n+ Identify business problems and their solution, as well as strategic and revenue-impacting opportunities\n<br><br>\n+ Analyze existing business, operational, and engineering processes to implement and improve systems to support analytics requirements\n<br><br>\n+ Provide expert guidance on the analytics technology industry, its vendors, and emerging data tech trends\n<br><br>\n+ Work with data science, analyst, and engineering teams to analyze various business goals, current capabilities and procedures\n<br><br>\n+ Become a trusted source of information and insight for analytics across all DSS products on mobile, desktop, connected devices and smart TVs\n<br><br>\n+ Maintain and grow expertise in industry standards, technologies, partner and competitor companies? strategies\n<br><br>\n+ Define desired product functionality and work with development and QA teams to ensure successful delivery\n<br><br>\n+ Assist with technical feasibility, implementation approach, deployment strategies, and QA efforts\n<br><br>\n+ Work with project partners to define project scope and objectives, communicating requirements to engineering teams\n<br><br>\n+ Assist in estimation and management of project budgets and cross-team resource allocation\n\n\n<ul>\n<li>*Basic Qualifications :**</li>\n</ul>\n\n+ You have a successful history of product management and software delivery, with 3-6 years of experience\n<br><br>\n+ Ideally, you have experience product managing applications across a wide variety of platforms including web, mobile devices, game consoles, and OTT video devices such as AppleTV, Roku, FireTV\n<br><br>\n+ You understand IP-based video delivery, including live video delivery and related analytics technology\n<br><br>\n+ You possess strong knowledge of data and analytics technology vendors and ecosystems\n<br><br>\n+ You have strong experience with current analytics tech\n<br><br>\n+ You have excellent written and oral communication skills\n<br><br>\n+ You excel at coordinating multiple projects at a time\n<br><br>\n+ You're an analytical thinker with strong problem-solving skills\n<br><br>\n+ You have an ability to make quick decisions to solve complex technical and operational challenges\n<br><br>\n+ You're adept at handling resource, technical, and budgetary constraints while ensuring on-time and on-budget project delivery\n<br><br>\n+ You put focus on supporting team interaction, boosting motivation, and appreciating contributions\n<br><br>\n+ You value teamwork, and have the leadership skills to make it happen?\n<br><br>\n+ You're familiar with working on projects with distributed teams, making use of technology and process to overcome the challenges of working with remote staff\n<br><br>\n+ Bachelor?s degree required, MBA or technical degree preferred\n\n\n<ul>\n<li>*Job ID:** 601978BR</li>\n<li>*Location:** New York,New York</li>\n<li>*Job Posting Company:** Direct-to-Consumer and International</li>\n</ul>"}