{"job title": "Food Scientist", "company": "TH Foods", "city state": "– Loves Park, Illinois", "rating": "2.9", "job description": "<p><strong>Position Summary</strong><strong>:</strong><br> <br> With (1) significant, (2) limited or (3) minimal supervision researches, conducts experiments, gathers data, develops preliminary findings and prepares written reports for the development of new products beginning at conception through successful commercialization. Also, supports maintenance of existing brands, such as cost savings projects and nutrition improvements. Selects appropriate methods, tests and procedures for testing. Develops project timelines, creates technical proposals and reports and makes recommendations.<br> <br> <strong>Essential Duties and Requirements</strong> include the following. Other duties may be assigned.<br> </p><ul><li>Complete project objectives under the direction of department manager.</li><li>Conceptualize and develop new product prototypes to support New Product or Existing Business initiatives.</li><li>Improve existing products by optimizing product formulas or attributes (cost, nutritional profiles, and ingredient statements).</li><li>Maintain accurate and complete records of project work.</li><li>Work with pilot plant equipment and external partners with (1) significant (2) limited or (3) minimal supervision.</li><li>Conduct plant trials and new product start-ups.</li><li>Learn and utilize on-line specification system and other Company software systems.</li><li>Develop raw material, packaging, finished product and processing specifications.</li><li>Execute experiments and prepare results for review.</li><li>Responsible for recognizing and reporting food safety and employee safety issues.</li><li>Develop prototypes that deliver project objectives. This may include ordering and weighing ingredients, as well as assembling prototypes for product evaluation.</li><li>Prioritize and execute multiple projects simultaneously:</li></ul><p>(1) Projects may be of limited scope and responsibility and may require significant supervisory direction to complete successfully<br> <br> (2) Projects will be of broader scope and require limited supervision and direction to complete successfully<br> </p><ul><li>Projects will involve all areas of R&amp;D responsibility, will be primarily self-directed and will require minimal supervision to complete successfully.</li></ul><p><strong>Supervisory Responsibilities</strong><br> <br> (1 and 2) This job has no supervisory responsibilities.<br> <br> (3) May be assigned to supervise 1 - 2 R&amp;D Technicians<br> <br> <strong>Qualifications</strong><br> <br> To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br> <br> <strong>Skills</strong><br> </p><ul><li>Excellent verbal and written communication skills</li><li>(2 and 3) Able to work with minimal supervision on assigned projects</li><li>Capable of prioritizing workload to maximize team support</li><li>Strong, general reasoning and analytical skills</li><li>(2 and 3) Able to conduct customer presentations</li><li>(1) Basic or ( 2 and 3) good understanding of food processing and packaging unit operations</li><li>(1) Basic or ( 2 and 3) good understanding of ingredient functionality</li><li>(1) Basic or ( 2 and 3) good understanding of food chemistry; especially cereal and starch chemistry</li><li>(2 and 3) Working knowledge of food laws and regulations.</li><li>(2 and 3) Excellent customer service skills.</li><li>Able to function in a fast paced environment.</li><li>Able to interact with all levels of the organization.</li><li>Strong ability to maintain confidentiality.</li><li>Able to work on deadlines to meet goals and adapt to schedule changes</li><li>High level of personal, work and professional ethics</li><li>(2 and 3) Able to work independently or in a team environment with creativity and a passion for food</li><li>Proficient in basic office software applications (email, word processing, spreadsheets, presentation)</li><li>(2 and 3) Able to travel independently and as a responsible TH Foods representative</li></ul><p><br> </p><br><br>Required Background<br><br><p><strong>Education</strong><br> </p><ul><li>(1,2 and 3) Bachelor's Degree in Food Science, Chemical Engineering, Food Engineering, Natural Sciences is required</li><li>(2 and 3) MS or equivalent experience is desirable</li></ul><p><strong>Experience</strong><br> </p><ul><li>(1) Zero to three years of industry experience in either food/beverage/ingredients</li><li>(2) Three to five years of industry experience in either food/beverage/ingredients.</li><li>(3) More than five years of industry experience in either food/beverage/ingredients.</li></ul><p><strong>Physical Ability</strong><br> <br> The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br> <br> While performing the duties of this job, the employee is regularly required to sit and talk or hear. The employee frequently is required to use hands to finger, handle, or feel. The employee is occasionally required to stand, walk, and reach with hands and arms.<br> <br> <strong>Work Environment</strong><br> <br> The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br> <br> The noise level in the work environment is usually moderate.<br> </p>"}