{"job title": "Data Scientist", "company": "ThirdLove", "city state": "– San Francisco, CA", "rating": "4.5", "job description": "<div>At ThirdLove, we're literally breaking the mold on how to help women find their best size and fit online, utilizing our Fit Finder questionnaire to diagnose and alleviate bra fit issues for millions of women.\n<br><br>\nWe're seeking an experienced Data Scientist who can unlock the power of customer data to drive innovation and testing in our size/style recommendation algorithms to take our Fit Finder technology to the next level.\n<br><br>\nIn addition to developing size prediction algorithms, our first data scientist hire will engage in complex customer analysis including discovering patterns of customer behavior and value, campaign performance, and marketing results to drive personalization across all customer touch points.\n<br><br>\nWe foster an environment to make things happen, keep you constantly challenged, and learn new things everyday.</div>\n<br><strong>THE JOB</strong>\n\n<ul>\n<li>Optimize our Fit Finder size and style recommendations in collaboration with business partners in design, planning, and engineering</li>\n<li>Use established and cutting edge Machine Learning and Advanced Statistical Models to build data science products that power personalized and differentiated customer experiences</li>\n</ul>\n<strong>Examples include:</strong>\n\n<ul>\n<li><em>Customer profiles / segmentation:</em> Evaluate characteristics across multiple dimensions such as demographic, behavioral, and financial</li>\n<li><em>Personalization</em>: Implementing statistical models and machine learning algorithms to optimize for customer and business outcomes at scale</li>\n<li><em>Targeting:</em> Building predictive response models to choose best outcomes for marketing and other campaigns</li>\n<li><em>Test design</em>: Build statistical measurement capabilities to measure incremental impact of new experiences on a wide variety of outcomes</li>\n<li>Provide and support the implementation of business solutions</li>\n<li>Research new techniques and best practices within the industry</li>\n<li>Collaborate with global team: Actively engage with members of the team who are located remotely</li>\n</ul>\n<strong>THE QUALIFICATIONS</strong>\n\n<ul>\n<li>3-6 years of experience solving problems using Linear and Non-linear Models, SVMs, Boosting, Neural Networks, Ensemble Methods and applied multivariate statistical methods like Discriminant Analysis, Clustering, PCA and Factor Analysis</li>\n<li>Proficient in tools such as R, Python, and SAS. Experience with some flavor of SQL and familiarity with Big Data tools such as Hadoop/Hive, Spark, Scala, Pig, and Mahout is desirable</li>\n<li>Proficient in data access methods for large customer and transaction databases</li>\n<li>Expertise in developing high quality and reusable data science algorithms supporting a wide variety of customer and business outcomes</li>\n<li>Experience using Dynamo, Cassandra, Hbase, or other non-relational DB</li>\n<li>AWS Big Data technology knowledge in EMR, Redshift is a plus</li>\n<li>MS/PhD, preferably in a quantitative field such as math, statistics, physics, chemistry, engineering, economics, computer science, operations research focused degree</li>\n<li>Flexibility to interact/work with teams operating in different time zones</li>\n<li>Thirst for knowledge and natural curiosity</li>\n<li>Action-oriented - you love to get things done</li>\n<li>Ability to organize and prioritize workload to meet deadlines</li>\n<li>Outgoing and eager to take on increasing responsibilities</li>\n<li>Passion for start-ups, ecommerce, and rapid growth a must</li>\n<li>Extremely flexible and adaptive to changing priorities</li>\n</ul>\n<strong>THE PERKS</strong>\n\n<ul>\n<li>Comprehensive health benefits</li>\n<li>401k plan</li>\n<li>Equity</li>\n<li>Subsidized lunches</li>\n<li>Quarterly product allotment</li>\n<li>Wellness benefits including in-office massages visits</li>\n</ul>\nThirdLove® is empowering women to feel comfortable and confident in their everyday lives. We make bras that fit perfectly, feel incredible, and look stellar.\n<br><br>\nWe're a rapidly growing team (over 250 today and doubling in size this year) based in San Francisco with offices in Chico, CA and Argentina. We're funded by Tier 1 investors and are disrupting a $100 billion global market. We're one of the fastest growing consumer brands in the country, and known as 'the brand to catch Victoria's Secret'.\n<br><br>\nOur culture is collaborative, fast-paced, and data-driven with a strong focus on designing beautiful products and creating a seamless user experience. Instead of using standard industry molds, we developed proprietary half-cup sizes based on real women's measurements and created a Fit Finder® Quiz that removes the hassle in finding the best size. To date, over 9 million women have taken our easy-to-use Fit Finder® Quiz.\n<br><br>\nFive core values drive all of the work we do:\n\n<ul>\n<li>Put customers first. Do things that make our customers happy.</li>\n<li>Adaptive. Defy standard conventions. Be nimble and embrace change.</li>\n<li>Curious. Strive to always learn and grow.</li>\n<li>Engaged. Be Present. Lift others up. Be your best self.</li>\n<li>Responsible. Gain others' trust by being respectful, reliable, and accountable.</li>\n</ul>\nIf you want to impact millions of people each and every day, and you share these values, we'd love to connect.\n<br><br>\nThirdLove is an equal opportunity employer and values diversity at the company. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, genetics, marital status, veteran status, or disability status."}