{"job title": "Senior Machine Learning Engineer - Supply Growth", "company": "thredUP", "city state": "– San Francisco, CA", "rating": "3.5", "job description": "<div><strong>About thredUP</strong></div><div>thredUP is the largest online marketplace for secondhand clothing. We make buying and selling a cinch for millions of women across the globe. The company resells more than 35,000 brands across hundreds of categories at up to 90% off the original retail value. Headquartered in downtown San Francisco and backed by world-class investors, thredUP is reinventing the secondhand clothing industry and inspiring a new generation of consumers to think secondhand first.</div><br>\n<div><strong>About the Role</strong></div><div>At thredUP, were revolutionizing the clothing industry. Our marketplace introduces some unique challenges to solve in order to deliver a delightful inventory set for our customers - are you up for the challenge? You will work on a broad set of domains, from building out an inventory scoring systems to cohorting and segmenting our suppliers, to automating promotional campaigns aimed at acquiring great product offerings for our buyers. You will be working with a highly interdisciplinary team of software engineers, data scientists, and data engineers. This role will require a mixture of software engineering, machine learning, customer insight, and data science to be successful.</div> Responsibilities\n\n<ul>\n<li>Architect, build, maintain our supplier scoring systems.</li><li>Design and develop robust machine learning models for supplier segmentation and targeting.</li> <li>Partner with other engineers to design interfaces and integrate scoring and targeting models into our engagement channels (website and notifications).</li><li>Design and automate offline evaluations and online A/B testing pipelines and reporting.</li><li>Collaborate with your peers and other teams to teach, learn and execute efficiently.</li><li>Contribute to improving our processes and engineering culture.</li><li>Ownership, trust, responsibility and proactiveness.</li> <li>A data-driven approach towards continuous improvement in the user experience.</li><li>Building scalable systems using best engineering practices, while understanding the tradeoff between time and perfection.</li><li>Speaking UP. Thinking Big. Influencing Outcomes. Infinite Learning. Transparency.</li>\n</ul>\n\n<strong>Requirements</strong>\n\n<ul>\n<li>5-10 years for software engineering experience in languages like Java, Scala, Python, Julia or similar and direct machine learning application.</li><li>5+ years of experience working with data-centric systems. Experience with real-time data processing technologies.</li><li>Believer in automated testing.</li><li>Strong experience in distributed systems design and best practices.</li><li>(Bonus) API design &amp; management.</li>\n</ul>\n\n<br>"}