{"job title": "Machine Learning Engineer", "company": "thredUP", "city state": "– San Francisco, CA", "rating": "3.5", "job description": "<div><strong>About thredUP</strong></div><div>thredUP is the largest online marketplace for secondhand clothing. We make buying and selling a cinch for millions of women across the globe. The company resells more than 35,000 brands across hundreds of categories at up to 90% off the original retail value. Headquartered in downtown San Francisco and backed by world-class investors, thredUP is reinventing the secondhand clothing industry and inspiring a new generation of consumers to think secondhand first.</div><br>\n<div><strong>About the Role</strong></div><div>At thredUP we've compiled a remarkable dataset, with high quality photographs of and characteristics on tens of millions of unique garments. We are forming a team to use this data to automate what is currently manual labor in our nationwide network of distribution centers. This is an opportunity not only to play a pivotal role in the formation of a new team, but also make a huge impact on operations, the backbone of our business. If you're looking for a fast-paced environment that encourages taking the initiative and cares more about results than hours worked, we would love to hear from you.</div>Responsibilities\n\n<ul>\n<li>Developing models for classifying and tagging garments</li><li>Understanding our existing data taxonomy and find ways we might improve it</li><li>Helping to build our machine learning platform</li><li>Building the teams processes and culture</li>\n</ul>\n\n<strong>Requirements</strong>\n\n<ul>\n<li>Must have 3-5 years Industry experience with deep learning</li> <li>Experience productionizing machine learning models</li><li>Aptitude to independently learn and work on new technologies</li><li>Strong and effective communication with peers and business users</li><li>Expert knowledge of at least one programming language, ideally Python</li>\n</ul>\n\n<br>"}