{"job title": "Business Intelligence Analyst", "company": "Threshold Enterprises", "city state": "– Scotts Valley, California", "rating": "3.4", "job description": "Job Details Level Experienced Job Location Scotts Valley Headquarters - Scotts Valley, CA Position Type Full Time Education Level 2 Year Degree Salary Range Undisclosed Travel Percentage Negligible Job Shift Day Job Category Sales Description Summary of Job Duties : Responsible of ensuring and creating Data Driving tools and reporting to support the Business Intelligence Team. Will be responsible in supporting the Sales, Finance, Purchasing and the Sales Analytics team in reporting, data mining, On-going maintenance of information accuracy, integrity and reporting, strong distribution understanding, multi-cross functional position Providing tools for the All teams and management along with and or assisting as backup for both the Business Intelligence manager, VP of Sales and other staff as needed. Specific Job Duties: Responsible for organization and tracking of monthly reports, accuracy and information integrity. Responsible for checking Sales goals and understanding team s directive. Responsible for updating and maintain all sales related reporting Work closely with the team in data mining and running of ad-hoc reports as needed Work closely with the management team to assist in manipulation of data Work closely with the Purchasing and Sales team to support in reporting tools and information Assist with the coordination in task as they come in from cross-departmental requests Perform all other tasks as assigned by Threshold management. Qualifications Minimum Qualifications Required: Business needs are critical in the below areas for Knowledge, skills and abilities: ADVANCED in the ability to perform all Microsoft office Applications, Outlook, Excel, etc. Must have the ability to create and utilize Power Point applications. Must be able to communication in a professional and clear manner Must be able to multi-talk and be an independent worker, with little guidance in a fast paced environment Must be able to take direction, easily and ask questions when needed. Must have Knowledge of MRS reporting and SQL. Skills and/or Training Desired: Financial Background Sales Background Strong Analytical thought patterns Cross-functional Ability to work with others and communicate positivity and quickly"}