{"job title": "Data Scientist", "company": "ThreatMetrix", "city state": "– San Jose, CA", "rating": "3.9", "job description": "<strong>About ThreatMetrix</strong>\n<br><br>\nThreatMetrix®, The Digital Identity Company™, is the market-leading cloud solution for authenticating digital identities and transactions on the Internet. Verifying more than 25 billion annual transactions supporting 35,000 websites and 5,000+ customers globally through the ThreatMetrix® Digital Identity Network, ThreatMetrix secures businesses and end users against account takeover, payment fraud and fraudulent account registrations resulting from malware and data breaches. Key benefits include an improved customer experience, reduced friction, revenue gain, and lower fraud and operational costs. The ThreatMetrix solution is deployed across a variety of industries, including financial services, e-commerce, payments and lending, media, government, and insurance.\n<br><br>\n<strong>About the Team</strong>\n<br><br>\nThe ThreatMetrix engineering team is an international team that includes experts in digital identity, device intelligence, fraud detection, real time systems, Software as a Service (SaaS) applications, machine learning, and data analytics. We are an Agile engineering team using concepts such as Scrum, Continuous Integration, and Continuous Improvement. The team is led by Andreas Baumhof, CTO and SVP Engineering, who is an internationally renowned cyber-security thought leader and former executive director, CEO and co-founder of Australian-based TrustDefender. We leverage many powerful open source packages including Hadoop, Impala, Kafka, Spark, Cassandra, Aerospike and many more to build our solutions.\n<br><br>\n<strong>About You</strong>\n<br><br>\nThreatMetrix is seeking an outgoing, curious, interdisciplinary machine learning scientist that has a passion for modeling and data analysis.\n<ul>\n <li>Bring a combination of mathematical rigor and innovative algorithm design to create recipes that extract intelligence from billions of rows of data to improve our digital identity solutions and fraud detection capabilities.</li> <li>Build data pipeline and translate unstructured, complex business problems into well-defined feature space, implement elegant and efficient learning algorithms to work at scale.</li>\n</ul>\n<strong>Expected Personal Skills</strong>\n<ul>\n <li>Clear and effective English communicator of technical issues</li> <li>Team player who works effectively with self-managed cross-functional teams</li></ul> \n\n<ul>\n <li>Organized, methodical, and detail oriented</li> <li>Ability to work with geographically dispersed teams</li> <li>Committed to the success of the team and the company</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>Hands-on analysis on large amount of historical data leading to the understanding of the data implications.</li>  <li>Knowledgeable about statistical modeling, machine learning techniques and working experience from prototyping to production.</li> <li>Deep understanding of feature engineering and variable selection. Practical knowledge of regression models, decision trees, anomaly detection, and deep learning.</li> <li>Experience with Java, Python and Unix/Linux platform. Familiarity with best practices in software design and testing.</li> <li>Experience with latest big data computation and analytics platforms (Hadoop, Spark, Kafka, Impala, etc.).</li> <li>Experience in computer security and fraud detection is a plus.</li>\n</ul>\n<strong>Experience</strong>\n<ul>\n <li>MS or PhD in Computer Science, Statistics, Math, Operations Research, etc.</li> <li>2+ years of quantitative experience with large data-sets, from prototyping to business impact.</li>\n</ul>"}