{"job title": "Data Scientist", "company": "Throtle", "city state": "– NJ-Red Bank", "rating": "4.9", "job description": "Do you have the energy and motivation to hustle, navigate, manage and pride yourself on generating new business? Are you ready to join a team that encourages you to think outside the box and inspires you as an individual as well as a leader within new and emerging data technology? Throtle works on the belief that their best employees should be given opportunities to grow and thrive in an energetic and technology driven culture. We hire and develop great people, which means that each and every one of our employees is not only talented, they also genuinely care about the success of our customers and stand behind our company.\n<br><br>\nThrotle is looking for an incredibly smart and capable Data Scientist to join our small but growing team. Our ideal candidate is passionate about big data and eager to apply a variety of data science skills including, statistical modeling, machine learning and data management techniques to real-world problems.\n<br><br>\nWe are a small, talented team of pragmatic data management professionals who have created a culture of transparency and accountability which minimizes bureaucracy and meetings and maximizes developer freedom, autonomy and creative development time. We are looking for a Data Scientist who is driven, creative and an innovative thinker.\n<br><br>\n<strong>RESPONSIBILITIES</strong>\n\n<ul>\n<li>Design experiments and create case studies to apply the findings into production code</li>\n<li>Employ predictive modeling, data mining, graph algorithms and other data science techniques to your project with the end goal of increasing our platform’s ability to drive customer value while sustaining healthy margins</li>\n<li>Responsible for implementing data mining and statistical machine learning solutions to various business problems such as lead scoring, demand forecasting, and target marketing segmentation</li>\n<li>Model train and improve our machine learning algorithms for audience discovery and apply bid optimization strategies for real-time-bidding</li>\n<li>Provide analytical /technical leadership in a team environment for the design and developed of analysis systems to extract meaning from large scale data</li>\n</ul>\n<strong>QUALIFICATIONS</strong>\n\n<ul>\n<li>Advanced degree or MA/MS</li>\n<li>3 years experience in applied Machine Learning techniques, advanced analytics and statistical modeling</li>\n<li>Strong background in foundational mathematics such as statistics, probability and linear algebra</li>\n<li>Experience manipulating large data sets, using SQL, Hadoop, MapReduce, Hive</li>\n<li>Understanding of programming concepts and experience with programming languages, such as Python, MATLAB, R, Java, Scala or C</li>\n<li>Experience managing small teams or projects.</li>\n</ul>"}