{"job title": "Data Scientist", "company": "Thumbtack", "city state": "– San Francisco, CA", "rating": "4.5", "job description": "Have you ever tried to hire a plumber? How about a house cleaner? If you have, chances are it took you way longer than it should. In the era of instant-everything, it's crazy that you still have to waste an entire afternoon researching, calling and vetting local service professionals whenever you need one. The market for hiring them is huge $700B in the US alone but the process is inefficient and largely offline.\n<br><br>\nThumbtack is transforming this experience end-to-end, building a marketplace that matches millions of people with local pros for almost any project. In making these connections, not only do our customers get more done every day, our pros are able to grow their businesses and make a living doing what they're great at.<br><br><strong>About the Data Science Team</strong><br><br>At Thumbtack, the Data Science team combines large-scale data with machine learning to shape our product that serves millions of customers and professionals. Along the way, we leverage cutting-edge data and machine learning infrastructure built on TensorFlow, Spark and BigQuery.\n<br><br>\nOn Data Science, our focus is on the data problems that reside at the core of our marketplace. These include problems like matching customers to pros, pricing, ranking, supply &amp; demand management, detecting spam, and a variety of natural language processing tasks.<br><br><strong>About the Role</strong><br><br>As a Data Scientist, you will partner with a large cross-functional group of engineers, product managers and other data scientists to solve some of the most challenging data science problems we face at Thumbtack.\n<br><br>\nWe're looking for data scientists with deep expertise in machine learning, statistics, optimization, and/or building data products. Our process gives you full ownership over the projects you tackle, so you should be a person who dreams big, then executes well.<br><br><strong>Responsibilities</strong>\n\n\n<ul>\n<li>Play a key role in architecting anding deploy machine learning systems to production</li>\n<li>Analyze a wide variety of data: structured and unstructured, observational and experimental, to drive system designs and product implementations</li>\n<li>Design and execute experiments, collect and analyze test data to guide launch decisions</li>\n<li>Advise engineering and product teams on product modeling problems and statistical practices</li>\n</ul>\n\n<strong>Must-Have Qualifications</strong>\n\n\n<ul>\n<li>M.S. or equivalent experience in Computer Science, Engineering, Statistics, or other relevant technical field</li>\n<li>2+ years of industry experience</li>\n<li>Strong knowledge of machine learning techniques, including regression/classification, optimization.</li>\n<li>The ability to connect technical work to product impact in a cross-functional team</li>\n<li>Expert knowledge of a statistical computing language such as Python or R</li>\n<li>Knowledge of probability and statistics, including experimental design, predictive modeling, optimization, and causal inference</li>\n<li>Excellent written and verbal technical communication skills</li>\n</ul>\n\n<strong>Nice-to-Have Qualifications</strong>\n\n\n<ul>\n<li>Experience in Deep Learning</li>\n<li>Experience in NLP</li>\n<li>Experience productionizing machine learning models and/or large-scale distributed systems</li>\n<li>Experience with Spark, TensorFlow and Keras</li>\n<li>Advanced degree in Computer Science, Engineering, Statistics, or other relevant technical field</li>\n</ul>"}