{"job title": "Data Scientist", "company": "Tiger Analytics", "city state": "– Saint Louis, MO", "rating": "4.6", "job description": "Tiger Analytics is an advanced analytics consulting firm enabling enterprises to generate business value from data. Today, we are the trusted data sciences and data engineering partner for several Fortune 500 companies, who are leaders in their respective industries. We bring deep expertise in applying DS/ML/AI to industry scale problems through offerings like marketing science, customer analytics, operations &amp; planning analytics, and risk analytics. In addition to our headquarters in the Silicon Valley, our global delivery center in India and an office in Singapore, our consultants also work closely with clients from different locations in the US.\n<br><br>\nWe are looking for a Data Scientist to be based out of St.Louis, MO. In this role you will perform various activities across data science model building &amp; deployment workflow.\n<ul>\n <li>Acquire, process, wrangle data into a shape ready for modeling</li> <li>Build and / or redevelop statistical / machine learning technique based models by applying industry best practices</li> <li>Evaluate the effectiveness of models using validation techniques (build-test-validate, n-fold cross validations etc.)</li> <li>Test and support deployment models in cloud based environments for integration into other upstream / downstream systems in collaboration with other team members</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n <li>3+ years of data science experience</li> <li>Proficiency in Statistical and ML based data analysis using Python and R</li> <li>Experience in algorithm design and application development in Java and Python</li> <li>Experience with Amazon Web Services, Domino, Datarobot preferred</li> <li>Education Qualification - Bachelor's or Higher degree in Statistics, Mathematics or a related quantitative field.</li>\n</ul>\n<strong>Benefits</strong>\n<br><br>\nThe position offers a unique opportunity to be part of a small, fast-paced, challenging, and entrepreneurial environment, with a high degree of individual responsibility. Significant opportunities for professional development exist, as we continue to grow.\n<br><br>\nDesignation and compensation offered will be commensurate with your expertise / experience."}