{"job title": "Game Data Scientist", "company": "Tilting Point", "city state": "– New York, NY", "rating": "4.6", "job description": "Tilting Point is looking for an awesome Data Scientist to join us in our NYC headquarters!\n<br><br>\n<strong>Your Future at Tilting Point</strong>\n\n<ul>\n<li>Partner with all departments to meet all of their different data analysis needs by leading the design and building of both large systematic reports and small custom pieces.</li>\n<li>Collaborate with product teams and help define data taxonomies for tracking of game events.</li>\n<li>Build end-user long-term value (LTV) projections and new data models for User Acquisition Tactics and Games Growth Projections.</li>\n<li>Design and build comprehensive game, database and programmatic ad buying data analytics system tools and oversee development of system tools by junior analysts and data engineering.</li>\n<li>Serve as data team lead in communicating and presenting daily to all outside game studio partners: data findings and insights, related strategic recommendations, and status of game tool systems development.</li>\n</ul>\n<strong>Your XP &amp; Skills</strong>\n\n<ul>\n<li>Bachelors or equivalent degree in Data Science, Mathematics, Statistics, Operations Research, or Engineering Technology with an emphasis on Statistical Analysis and 1+ years of data science experience in mobile/digital analytics.</li>\n<li>2+ year's experience with: SQL; statistical, machine learning, and Bayesian knowledge with statistical significance testing, A/B testing, and predictive analytics skills; data modeling, design, and architecture principles; data mining, clustering, and segmentation; scripting languages Python, R, PHP, JavaScript.</li>\n<li>2+ year's experience building user behavior prediction using the following machine learning techniques: Linear regression; Lasso/Ridge; Logistic regression; Naïve Bayes; Decision tree; Random forest; Support vector machine; Neural network; Deep learning; K-Means; Clustering; Nearest neighborhood; and Logit.</li>\n<li>Experience creating and optimizing campaigns for Facebook ads, AdColony, Unity Ads, Apple Search Ads, TV Advertising, and Google AdWords for a programmatic ad buying system.</li>\n<li>Experience in a free-2-play mobile game company environment building automation services and working with Facebook APIs, Amazon Redshift, Amazon Web Services AWS, Lambda, EC2, Mobile Analytics, QuickSight, Kinesis, and Google BigQuery and big plus!</li>\n</ul>\nInterested? We would love to hear from you. Just send us your resume and cover letter below (and tell us about your passion for mobile and/or free-to-play games!)\n<br><br>\n*Direct applicants only - No agencies/headhunters please.*\n<br><br>\n<em><strong>Tilting Point provides equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law. Discrimination of any type will not be tolerated. This policy applies to all terms and conditions of employment, including recruiting, hiring, promotion, termination, time off, and compensation.</strong></em>"}