{"job title": "Associate Data Scientist", "company": "TISTA Science and Technology Corporation", "city state": "– Rockville, MD", "rating": "3.2", "job description": "<div><div><div><div>TISTA Science and Technology Corporation, a CMMI Maturity Level 3 company, focuses on delivering information technology and professional services to Federal and State agencies. TISTA is an Inc. 500 company, a recipient of the 2010 Top 100 Service-Disabled Veteran-Owned Businesses from Diversity Business, recognized in Washington Technology's FAST 50 list of the fastest growing small businesses in government contracting in 2012 &amp; 2013, recognized as the Top 25 Fastest Growing Small Technology companies by the Washington Business Journal in 2014 &amp; 2015, and selected as the Veteran Owned Company of the Year in 2014 by the Montgomery County MD Dept. of Economic Development.\n<br><br>\nTISTA Science and Technology Corporation is seeking Data Engineers to join our growing team using ground breaking cloud and big data technologies. These Data Engineers will collaborate with data scientists from prominent ivy league institutions to identify user needs, find solutions, and take our products from concept to launch. We have Mid, Senior and Lead roles available.</div></div></div><strong>Responsibilities</strong><div><div><div>\n\n<ul>\n<li><div>Build data pipelines using Apache Spark, Scala, Python, Apache Airflow etc.</div></li><li>Collaborate with User Experience and Engineering teams in the planning of new products</li><li>Write unit tests and get close to 100% code coverage</li><li>Work on AWS S3 for storage, EC2 and EMR for processing/analysis</li><li>Follow Agile methodology for the software development</li><li>Identify problems and propose resolutions</li>\n</ul>\n<strong>Qualifications</strong></div></div></div><div><div><div>\n\n<ul>\n<li><div> 6+ year of engineering experience; focus on back-end development and/or data engineering</div></li><li><div> In-depth programming knowledge with Java, Python, and Scala</div></li><li><div> Experience with Spark, Hadoop, or HIVE</div></li><li><div> Strong experience with AWS; including EC2, EBS, RedShift, EMR, ELB, SNS, RDS, CloudFormation, and more</div></li><li><div> Experience with tools like Maven, Jenkins, Git</div></li><li><div> Able to perform as an effective member of a geographically dispersed team across multiple time-zones</div></li>\n</ul>\n\n<strong>Education:\n<br>\n</strong>\n\n<ul>\n<li><div>Bachelors degree in computer science or closely related field</div></li>\n</ul>\n\n<strong>Clearance:\n<br>\n</strong>\n\n<ul>\n<li><div>Must be eligible to obtain a Public Trust</div></li>\n</ul>\n\n<strong>Location:\n<br>\n</strong>\n\n<ul>\n<li><div>Rockville, MD (Open to remote)</div></li></ul></div>\n</div></div></div>"}