{"job title": "Data Scientist", "company": "Tonal", "city state": "– San Francisco, CA, US", "rating": "5.0", "job description": "<div>\n<strong>Who We Are</strong></div><br>\n<div>\nTonal has built the worlds most intelligent fitness system that is changing the way people work out at home. Tonal is a fresh approach to fitness that leverages hardware, software, video content, and artificial intelligence. Everyone whos used our product, from professional athletes to fitness enthusiasts, has fallen in love.</div><br>\n<div>\nAt Tonal, we are applying our collective knowledge and creativity to reimagine fitness. We know firsthand that too many hurdles stand between each of us and our fitness goals. Drawing on decades of research and a diverse team of experts, we have created the most advanced strength training system available that makes working out more efficient, effective, and engaging.</div> <br>\n<div>\nWe're passionate about building products that transform people's lives.</div> <div>\n<strong>What You Will Do</strong></div><ul>\n\n<li>\nDevelop Tonal's data collection, analytics, and learning systems</li>\n<li>\nContribute to our AI and machine learning systems</li>\n<li>\nWork with embedded, front-end, and back-end teams to develop algorithms to meet their needs</li>\n<li>\nUse, implement, and contribute to the design of data models and repositories</li>\n<li>\nWork with product management to identify data and deliver insights</li>\n</ul>\n\n<br>\n<div>\n<strong>Who You Are</strong></div><ul>\n\n<li>\nAdvanced degree in mathematical field or equivalent experience</li>\n<li>\nExperience with machine learning including classification, prediction, training, and analytics techniques</li>\n<li>\nKnowledge of data collection, filtering and cleansing techniques</li>\n<li>\nBasic knowledge of Python, Java, or C</li>\n<li>\nTeam player with high integrity</li>\n<li>\nOpen to feedback and constantly striving to improve</li>\n<li>\nHigh degree of self awareness</li>\n</ul>\n\n<br>\n<div>\n<strong>Extra credit</strong></div><ul>\n\n<li>\nExperience with gyros and accelerometers</li>\n<li>\nPassion for health, fitness, and/or strength training</li>\n<li>\nInterest in Android development</li>\n</ul>\n\n<br>"}