{"job title": "Data Scientist", "company": "Toshiba Global Commerce Solutions", "city state": "– Durham,NC", "rating": "2.8", "job description": "<p><strong>Job Title:</strong></p><p>Data Scientist (SVCS-041218-003i) </p><p><strong>Introduction:</strong></p><p>Toshiba Global Commerce Solutions is seeking a Data Scientist to join our team in Research Triangle Park, NC. The Data Scientist will be responsible for bringing structure to large quantities of formless data to make analysis and insights possible. This candidate will also exhibit strong problem-solving skills and a passion for discovering solutions hidden in large data sets as well as working with stakeholders to improve business outcomes.</p><p><strong>Responsibilities:</strong></p><ul><li>Work with Stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions</li><li>Mine and analyze data from company databases to drive optimization, product development improvement and business strategies</li><li>Assess the effectiveness and accuracy of new data sources and data gathering techniques</li><li>Uncover and clarify data patterns to make them compelling and actionable</li><li>Deliver novel insights through the identification and integration of potentially incomplete data sources that create value-added data sets</li><li>Develop a/b testing framework and validate model quality</li><li>Use predictive modeling to increase and optimize customer experiences, revenue generation and other business outcomes</li><li>Generate and organize unstructured data into an analyzable format</li><li>Create and build solutions to complex data problems</li><li>Develop processes and tools to monitor and analyze model performance and data accuracy</li><li>Optimize and predict outcomes by developing algorithms through machine learning tools</li><li>Combine superior programming abilities, analytical skills, contextual understanding and skepticism to uncover hidden solutions to business challenges</li><li>Advise executives and product managers on the implications of the data for products, processes, and decisions</li><li>Help decision makers shift from ad hoc analysis to an ongoing conversation with data</li></ul><p><strong>Required Skills:</strong></p><ul><li>Bachelor’s degree or equivalent experience</li><li>Experience working with and creating data architectures</li><li>3+ years of experience in AI machine learning and algorithms</li><li>Experience with Hadoop and related open-source, cloud computing and data visualization tools</li><li>Knowledge of R or SAS, SQL and python</li><li>Strong communication and presentation skills</li><li>Comfortable working with a wide range of stakeholders and functional teams</li><li>Proven ability to deliver business results with data-based insights</li></ul><p><strong>Preferred Skills:</strong></p><ul><li>Advanced degree in physics, computer science, operations management, mathematics, economics, statistics or other quantitative discipline</li><li>Prior experience building AI models that are used for automated functions</li></ul><p><strong> </strong></p><p><strong>About the Company:</strong></p><p>Toshiba Global Commerce Solutions is a dynamic billion dollar global company based in Research Triangle Park, NC, providing retail store solutions to your favorite brands. Have you ever been in a hurry and made use of the self-checkout at Lowe’s Foods, earned fuel rewards at Kroger, or just paid for purchases at retailers such as Walmart, Michaels, Carrefour, The Gap, Calvin Klein, Boots, Cencosud, BJ’s, or Costco? These are just a few examples of our in-store solutions and impressive customer base that made us the world's installed market share leader. </p><p>The nature of retail is changing quickly, so if you share our'Together Commerce' vision of a seamless two-way, participatory shopping experience, let’s get together to drive the new economy. </p><p><strong>EEO:</strong></p><p>Toshiba Global Commerce Solutions is an equal employment employer and is committed to providing employment opportunities to minorities, females, veterans, and disabled individuals.</p>"}