{"job title": "Data Scientist", "company": "Touch of Modern", "city state": "– San Francisco, CA, United States", "rating": "3.5", "job description": "As the Lead of our Data Analytics team, you will be responsible for the development and execution of our business analytics strategy. You will partner with the executive leadership team to identify opportunities to grow revenue and profits, translate them into action plans, and monitor their impact. You will hire, manage, and develop a small team of high-caliber data analysts. The ideal candidate will have a proven track record of quickly developing a deep business understanding and providing actionable insight that pro-actively guides the company’s strategic direction and day-to-day operations.\n<br><br>\n<strong>What you'll be doing:</strong>\n<ul>\n<li>Be a highly analytical leader with a strong customer/vendor focus and the ability to solve highly complex business problems</li><li>Generate actionable insight in support of decisions related to business strategy, revenue and profit forecasting, performance assessment of on- and offline marketing efforts, development of pricing strategies, logistics (shipment &amp; fulfillment) and inventory optimizations, and customer segmentation</li><li>Apply advanced algorithms to large ecommerce data sets (e.g., clickstream and customer order data) in real-time systems</li><li>Perform rapid prototyping of experimental solutions and develop robust, maintainable production systems in statistical languages such as Python</li><li>Hire, train, manage and develop a small team of data analysts</li>\n</ul>\n<br><br>\n<strong>What you bring to this role:</strong>\n<ul>\n<li>Master’s or PhD in statistics, econometrics, computer science, mathematics, or similar</li><li>5+ years experience as a Data Scientist or similar role for Business Intelligence projects</li><li>Experience with Redshift, large data ETL, and advanced SQL</li><li>Experienced in machine learning and multivariate regression</li><li>Thorough understanding of Bayesian statistics and demonstrated ability to apply that knowledge effectively</li><li>E-commerce experience - comfortable handling clickstream data combined with a deep understanding of LTVs, contribution margins, CACs, AOVs, etc. and appropriate ways to model them</li><li>A deep sense of curiosity</li><li>Obsession with data and algorithms to solve business problems</li><li>Comfort working within a modern engineering environment (Linux, system architecture, Java, Python, R, multithreaded programming)</li><li>Ability to script experimental solutions, select and use the most appropriate statistical analysis tools to answer specific business questions</li><li>Thoughtful, results-driven personality, with a high level of enthusiasm, energy and confidence</li><li>Excellent analytical, communication, organizational and presentation skills</li><li>Ability to demonstrate flexibility and integrity: be able and willing to work hands on, independently or with a small team providing leadership</li><li>Experience working at a growth-stage startup company</li><li>Experience with large scale algorithm challenges</li>\n</ul>\n\n<strong>Touch of Modern is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</strong><br><br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}