{"job title": "Data Science Engineer", "company": "Toyota North America", "city state": "– Detroit, MI", "rating": "3.8", "job description": "<div><strong>Who we are</strong></div>\n<br>\n<div>Collaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world’s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We’re looking for diverse, talented team members who want to grow and start their impossible with us.</div> \n<br>\n<div><strong>Who we’re looking for</strong></div>\n<br>\n<div>Toyota’s Model Based Development Department is looking for a passionate and highly-motivated Data Science Engineer.</div>\n<br>\n<div>The primary responsibility of this role is to use data centric approaches to improve Toyota powertrain quality and performance.</div>\n<br>\n<div>Reporting to the Model Based Development Senior Manager, the person in this role will support the Model Based Development department's objective to provide innovative powertrain designs and control systems.</div>\n<br>\n<div><strong>What you’ll be doing</strong> </div>\n\n\n<ul>\n<li>Develop, access, and store large data sets suitable for applying data analytics to powertrain design and analysis</li>\n<li>Conduct analyses to extract knowledge and insights form data in various forms, either structured or unstructured, which will be used for powertrain performance and quality improvements in collaboration with powertrain designers</li>\n<li>Plan, manage, and report project tasks and responsibilities</li>\n</ul>\n\n<div><strong>What you bring</strong> </div>\n\n\n<ul>\n<li>Master Degree (or higher) with focus in data science</li>\n<li>Experience in data mining, artificial intelligence, or machine learning</li>\n<li>Reporting experience on project status to team members and project sponsors</li>\n<li>Experience using data centric approaches in the design or quality evaluation of engineered systems</li>\n</ul>\n\n<div><strong>Added bonus if you have:</strong></div>\n<ul>\n<li>Master's Degree (or higher) in Computer Science and/or Electrical Engineering</li>\n<li>Experience with powertrain hardware design, modeling, control design, diagnostics, and/or prognostics</li>\n<li>Familiarity with mechatronic aspects of control systems such as sensing, actuation, real-time computing</li>\n</ul>\n\n<div><strong><strong>What we’ll bring</strong></strong></div>\n<br>\n<div>During your interview process, our team can fill you in on all the details of our industry-leading benefits and career development opportunities. A few highlights include:</div>\n\n\n<ul>\n<li>A work environment built on teamwork, flexibility and respect</li>\n<li>Professional growth and development programs to help advance your career, as well as tuition reimbursement</li>\n<li>Vehicle purchase &amp; lease programs</li> \n\n<li>Comprehensive health care and wellness plans for your entire family</li>\n<li>Flexible work options (if applicable)</li>\n<li>Toyota 401(k) Savings Plan featuring a company match, as well as an annual retirement contribution from Toyota regardless of whether you contribute</li>\n<li>Paid holidays and paid time off</li>\n<li>Referral services related to prenatal services, adoption, child care, schools and more</li>\n<li>Flexible spending accounts</li>\n<li>Relocation assistance (if applicable)</li>\n</ul>\n\n<div><strong>What you should know</strong></div>\n<br>\n<div>Our success begins and ends with our people. We embrace diverse perspectives and value unique human experiences. We are proud to be an equal opportunity employer that celebrates the diversity of the communities where we live and do business. Applicants for our positions are considered without regard to race, ethnicity, national origin, sex, sexual orientation, gender identity or expression, age, disability, religion, military or veteran status, or any other characteristics protected by law.</div>\n<br>\n<div>Have a question or need assistance with your application? Check out the How to Apply section of our careers page on Toyota.com!</div> \n<br>\n<div>To save time applying, Toyota does not offer sponsorship of job applicants for employment-based visas or any other work authorization for this position at this time.</div>\n\n<br><strong></strong>\n<br>"}