{"job title": "Data Scientist", "company": "Trading Technologies", "city state": "– US-IL-Chicago", "rating": "3.9", "job description": "<div>\n <div>\n <div>\n Location: US-IL-Chicago\n\n \n <p>We are seeking a strong data science generalist with a background in computer science and either applied math or statistics to join our team of artificial intelligence system developers as a <strong>Data Scientist</strong>.</p>\n<p> </p>\n\n Responsibilities: \n <p>In this role, you can expect the full lifecycle of data science — everything from project ideation and data collection through modeling, results presentation, productionization, and model refinement.</p>\n \n Qualifications: \n <p>Programming:</p>\n<ul>\n<li>Java — You don’t have to be a Java expert (we have plenty of these), but you should be capable of reading and processing data from a text file or REST endpoint, writing classes, working with time-series data, and writing jUnit tests.</li>\n<li>Python, pandas, scikit-learn, and your favorite data visualization library.</li>\n<li>Experience processing data using a “big data” platform that uses the map-reduce processing pattern (Spark, Hadoop, H2O, dask, etc.).</li>\n<li>Experience processing large CSV and JSON datasetsMachine learning:</li>\n<li>Be able to explain the math and logic of your work to non-technical people in a way that they understand. This is admittedly a “squishy” requirement, but it is the most important requirement of all – because selling any AI product requires establishing customer trust in our methods. For example, the typical customer of our trade surveillance product is a lawyer, and the system is explicitly designed as a first step towards detecting potentially criminal behavior. We explain our calculations to customers in English, math, and code.</li>\n<li>Be able to work with various model types: classifier models, regression models, unsupervised models, time-series models, etc..</li>\n<li>Be familiar with common modeling trade-offs.</li>\n</ul>\n<p>Math and Statistics:</p>\n<ul>\n<li>Basic linear algebra – mainly matrix math and solving systems of linear equations.</li>\n<li>Multivariable calculus.</li>\n<li>How to explore the statistical properties of data — visualize the distribution of attributes/features, test for Gaussian distribution, test for stationarity, check independence assumptions, detect outliers, etc..</li>\n<li>Familiarity with Markov processes.</li>\n</ul>\n<p>Other:</p>\n<ul>\n<li>Familiarity with Git and Github.</li>\n<li>Basic familiarity with Linux and SSH.</li>\n<li>Basic familiarity with data security/privacy practices. In our surveillance product, our input data is confidential; our outputted results are extremely confidential.</li>\n<li>You take ownership of your work, for good and for ill.</li>\n<li>You learn independently, yet aren’t afraid to ask for help when stuck.</li>\n<li>Nice-to-haves, in descending order of necessity:</li>\n<li>Any experience with the H2O.ai platform (distributed in-memory machine learning).</li>\n<li>Trading industry experience and/or familiarity.</li>\n<li>Any experience communicating/presenting to C-level executives and/or lawyers.</li>\n<li>Familiarity with network analysis.</li>\n<li>Familiarity with signal processing.</li>\n<li>Familiarity with hidden Markov models.</li>\n<li>Other data science languages: R, Scala, etc..</li>\n<li>Familiarity developing multithreaded distributed systems.</li>\n<li>Any experience with differential equations (especially stochastic PDEs) may eventually be useful.</li>\n</ul>\n \n <div>\n \n<ul>\n\t\n \n\t<li>US-IL-Chicago</li>\n\n\t<li>Posted 10 hours ago</li>\n\n\t\n\t</ul>\n\n\n <div>\n </div>\n\n <div>\n \n \n \n <div>\n \n\t\n \n Full name\n <div>\n \n </div>\n \n \n Email address\n <div>\n \n </div>\n \n \n Message\n <div>\n \n </div>\n \n \n Upload CV\n <div>\n <div>\n\t</div>\n\n\n\n Upload your CV/resume or any other relevant file. Max. file size: 15 MB.\t\n </div>\n \n \n\t\n\t<p>\n \n \n \n\t</p>\n\n </div>\n </div>\n \n </div>\n \n\n\n <p>Trading Technologies (TT) is an equal opportunity employer. Equal employment has been, and continues to be a required practice at the Company. Trading Technologies’ practice of equal employment opportunity is to recruit, hire, train, promote and base all employment decisions on ability, rather than race, color, religion, national origin, sex, age, disability, sexual orientation, genetic information or any other protected status. Additionally, TT participates in the E-Verify Program.</p>\n </div>\n </div>\n \n </div>"}