{"job title": "Data Scientist", "company": "Transfair U.S.A.", "city state": "– Oakland, CA", "rating": "4.0", "job description": "<div><div>Fair Trade USA’s newly formed Data Team works across the organization to collect, analyze and share data about Fair Trade USA’s business and the impact of our work. The organization is committed to working quickly to create meaningful data insights that can be used to evaluate the effectiveness of our programs and deliver supply chain insights to our partners.\n<br><br>\nOne key ingredient for making informed decisions is reliable and timely access to data and that’s where you come in. As a data scientist, you will work with all of these teams to inform important decisions with actionable insights, drawn from reliable data. In this role, you must have a strong intuition for proper data management, and understand in great detail the working of our certification systems &amp; processes, how they generate data, and how to best present that data to a variety of business partners and team leads.\n<br><br>\nThe ideal candidate will be an excellent communicator, with the ability to easily understand the whole of business needs, while also bringing technical knowledge and domain context in Sustainability Certification to the team. This individual will also assist the Director of Data Science with building the future of data engineering and analytics at Fair Trade USA, which may include investigative work around machine learning and advanced statistical techniques.\n<br><br>\nSample Projects:\n\n<ul>\n<li>Create visualizations for internal and external audiences to communicate the scope and impact of Fair Trade Certified</li>\n\n<li>Communicate analysis results with relevant domain context to communicate uncertainty, variance, and limitations</li>\n\n<li>Work with team members to support the development of reproducible code-based analysis and data visualizations</li>\n</ul>\n<strong>Key Responsibilities:</strong>\n\n<ul>\n<li>Research potential solutions to business needs related to machine learning, code-based analysis, and data visualization.</li>\n\n<li>Articulate business questions and use statistical techniques to arrive at an answer using available data. Provide Translate analysis results into business recommendations, as well as assisting others in the organization make business decisions.</li>\n\n<li>Serve as a mentor to all Data Team members regarding professional development of best practices in code-based reproducible research and data visualization.</li>\n\n<li>Partner with the Technology Department to ensure best practices in coding and development are implemented in Data Team’s work.</li>\n\n<li>Utilize SQL, Python, and R to facilitate efficient analytics.</li>\n\n<li>Work with team members to structure work to capture and create training datasets, and guide the organization to machine learning applications.</li>\n</ul>\n<strong>Requirements:</strong>\n\n<ul>\n<li>At least 5 years of relevant work experience, including 3 years of data science related professional experience.</li>\n\n<li>Experience in an object-oriented programming language (Python preferred).</li>\n\n<li>Exceptional communication skills, to explain your work to people who do not understand the technical mechanics behind data analysis and code.</li>\n\n<li>Demonstrated skills in selecting the right statistical tools given a data analysis problem. Demonstrated effective written and verbal communication skills.</li>\n\n<li>Demonstrated leadership and self-direction. Demonstrated willingness to both teach others and learn new techniques.</li>\n\n<li>Advanced SQL or other querying language.</li>\n\n<li>Experience proposing/modifying database structure.</li>\n\n<li>Experience with data exploration and visualization tools, preferably Tableau.</li>\n\n<li>Relevant domain context in Supply Chain sourcing, Sustainability Standards, and data collection in a rural international development context is a plus.</li>\n\n<li>Experience working in agile fashion is a plus.</li>\n</ul>\n<strong>To Apply:</strong>\n<br><br>\nPlease submit your resume and cover letter to the attention of Clay Brown, Chief of Standards, Certification and Impact Assessment.</div> </div><div></div>"}