{"job title": "Senior Data Scientist", "company": "TransFX", "city state": "– Chattanooga, TN", "rating": "5.0", "job description": "FreightWaves is the leading provider of market, rate, economic, fuel, regulatory, and weather data and commentary for the freight industry. We are looking for a <strong><em>Senior Data Scientist</em></strong> to work on our SONAR product team.\n<br><br>\nIn this role, you will be creating data analytics insights and products based on unstructured data-sets that come from IOT and telematics data sources across the North American trucking industry.\n<br><br>\nYou will be surrounded by a group of strategic thinkers in creating a new marketplace and should be comfortable with dynamic changes in role and processes. You will be building many of the operating insights that go into helping companies buy and sell transportation capacity in the form of financial contracts and to hedge against market volatility.\n<br><br>\nThe company recently completed a fresh round of financing that includes venture funds that are funded by 12 Fortune 1000 companies and their executives.\n<br><br>\nThis role combines (1) experience with machine learning, (2) practical knowledge of working with scalable platforms for processing of huge data sets, (3) the ability to understand the data, associated processes and business implications (4) Be part of a team that supports large clients solving predictive analytics and data science problems.\n<br><br>\n<strong>Duties include:</strong>\n\n<ul>\n\n<li>Develop a deeper understanding of our SONAR Predictive Analytics platform and related solutions and ways of solving various business challenges using our SONAR Predictive Analytics platform.</li>\n\n\n\n<li>Communicate the detailed functional requirements of the analysis to solution implementation team.</li>\n\n\n\n<li>Work with the data-science team, recognizing right data sources, gathering raw data and preparing the data for downstream processing</li>\n\n\n\n<li>Work with the implementation team in calibrating and tuning the advanced analysis; gather business insights and present the findings to the client iteratively along our editorial team</li>\n\n\n\n<li>Candidate should take the complete ownership of the analytics initiative and work with client’s business executives; our editorial staff; data owners; and internal implementation team.</li>\n\n\n\n<li>Take an active role in the planning, reporting, and execution in support of various SONAR Predictive Analytics implementation</li>\n\n\n<li>Contribute to the efficiency, effectiveness, and improvement of FreightWaves data science best practices as a thought leader.</li>\n</ul>\n<strong>Skills Required:</strong>\n\n<ul>\n\n<li>At least 5 years of experience in deep learning / machine learning / data science development projects with a focus on innovation.</li>\n\n\n\n<li>Masters or PHD Degree in Computer Science, Mathematics, Statistics, Operations, Research or related field.</li>\n\n\n\n<li>Statistics, predictive modeling, operations research, informatics and tools, e.g., SPSS, SAS, R, Python.</li>\n\n\n\n<li>Excellent quantitative analysis to take mixed data as an input and derive actionable recommendations as output.</li>\n\n\n\n<li>Track record of developing novel learning algorithms and/or systems.</li>\n\n\n\n<li>Proficiency in handling of big customer datasets.</li>\n\n\n\n<li>Experience with Machine / Deep Learning software packages &amp; libraries.</li>\n\n\n\n<li>Ability to visualize data and present core insights in a clear and compelling way.</li>\n\n\n\n<li>Excellent written and communication skills in English language.</li>\n\n\n\n<li>Experience working with a lean product development process through rapid iteration.</li>\n\n\n\n<li>Experience working closely with developers and designers throughout the product development process.</li>\n\n\n\n<li>Experience collaborating with local and remote teams.</li>\n\n\n\n<li>Excellent presentation, oral and written communication skills</li>\n\n\n\n<li>Ability to manage multiple products with complex feature sets.</li>\n\n\n\n</ul>\n<strong>Ideal Candidate:</strong>\n\n<ul>\n\n<li>At least 7 years of experience in deep learning / machine learning / data science development projects with a focus on innovation. At least 3 years of project lead experience in building machine learning-based products.</li>\n\n\n\n<li>Experience using open source technologies such as R, Hadoop, Apache Spark.\n<br>\nSoftware development experience with Hive, Java, C++, JSON, Python, XML.</li>\n\n\n\n<li>Cloud-based experience with PaaS and IaaS, as well as Cloud-based, agile development environments.</li>\n\n\n\n</ul>\n<strong>We Offer:</strong>\n\n<ul>\n\n<li>An excellent start-up work environment, flat hierarchies and short decision paths.</li>\n\n\n\n<li>Relocation for qualified candidates</li>\n\n\n\n<li>Competitive salary and bonus potential packages.</li>\n\n\n\n<li>A generous benefits package including 100% employer paid health, dental, life and vision insurance, unlimited vacation plan, workout benefits, industry education and company-paid travel to industry events, student-loan reimbursement, pet insurance, family bank account, merchant discount program, and much more!</li>\n\n\n\n<li>Stock options</li>\n\n\n\n<li>Training programs and career development opportunities.</li>\n\n\n\n<li>Flexible working hours and work-life-balance options</li>\n\n\n\n</ul>"}