{"job title": "Data Scientist", "company": "Trantor Inc.", "city state": "– Norcross, GA", "rating": "3.4", "job description": "Data Scientist Contractor\n<br><br>\nLocation: On-site Norcross, GA office\n<br><br>\nTiming: Long term\n<br><br>\nTitle: Data Scientist\n<br><br>\nLeveraging our internal BI tool, we need this person to design and build new reports and queries in different systems. Then, help us solve client problems with data. Also, work with outside partners to get them data and even create new reports/views via data mapping of raw data.<strong> Qualifications include:</strong>\n<ul>\n<li>Experience in SQL programming and Business Objects Web Intelligence report writing required</li><li>4 year college degree with major in Information Systems, Computer Science, or other related field</li><li>Advanced knowledge of Microsoft Excel required</li><li>Experience using SQL Server Management Studio required</li><li>Experience using Oracle SQL Developer required</li><li>Ability to write complex queries using SQL within Oracle and Microsoft servers required</li><li>BI tool experience</li><li>Experience with data modeling and predictive outcomes required</li><li>Ability to collaborate with both technical and business staff</li><li>Ability to present information and relevant summaries to all levels of the organization, including executive level dashboard presentations</li><li>Previous financial services experience desired but not required</li><li>Expert Tableau creator and user.</li>\n</ul>\n<strong>Key Responsibilities Include:</strong>\n<ul>\n<li>Extracts qualitative and quantitative relationships (i.e., patterns, trends) from large amounts of data</li><li>Ability to work independently or with a team</li><li>Analyze and solve problems at their root, stepping back to understand the broader context</li><li>Use technology to mine complex, voluminous and different varieties of data from various sources and platforms in order to collect, analyze and compile data to meet internal and customer needs</li><li>Identify new sources of data and methods to improve collection, analysis and reporting</li><li>Interface with business customers to collect requirements</li><li>Determine technical issues</li><li>Build data solutions, tools, and capabilities to enable self-service frameworks for data consumers to monitor and report on data</li><li>Improve the quality of data use and usability by driving an understanding and adherence to the principles of data quality management including business definitions and data cleansing</li><li>Leverage data and build reports in Tableau.</li></ul>\n\n\n<ul>\n<li>provided by Dice</li>\n</ul>\n\nBI tool,Sql,Business objects,oracle,Tableau"}