{"job title": "Data Scientist", "company": "Trendalytics", "city state": "– New York, New York", "rating": "3.5", "job description": "<div>Recognized as a top 10 finalist in Google's Machine Learning Competition and by industry as Decoded Fashions top start up, Trendalytics is working on the industry's most pertinent and cutting edge problems in predictive analytics. </div><div><br></div><div>We are seeking a Data Scientist who is eager to solve complex and intellectually stimulating problems related to social media, search and e-commerce big-data sets, natural language and image processing computational challenges. We work with multiple Fortune 500 companies and disruptive online retailers, many who are interested in our next stage of development. </div><div><br></div><div>We have opportunities in both our New York City and Seattle locations. </div>Responsibilities<ul><li>Work on large data sets of structured, semi-structured, and unstructured data to discover data insights and collaborate with business partners to deliver business value through these insights.</li><li>Develop data analytics heuristic and algorithmic solutions that can be repeatedly applied to new data in a production enterprise-software environment.</li><li>Apply techniques based on predictive, behavioral or other models via statistical analysis and use of relevant modeling tools and libraries.</li><li>Design and develop production-ready code using various programming environments including Python, NoSQL, SQL and others.</li><li>Present findings to all levels of the organization, including peers, senior management and customers.</li></ul>Qualifications<ul><li>BA/BS in Mathematics, Statistics, Computer Science, Engineering or other quantitative disciplines.</li><li>3+ years of experience doing quantitative analysis.</li><li>Extensive experience solving analytical problems using quantitative approaches and a proven passion for generating insights from data.</li><li>Experience in manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources.</li><li>Strong knowledge of statistical methods generally, and particularly in the areas of modeling and business analytics.</li><li>Experience in designing data insight solutions using technologies such as Python, Hadoop/Hive, HBase, NoSQL, SQL.</li><li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner.</li></ul><div>We seek candidates in both our New York City and Seattle locations.</div><div><br></div><div>Trendalytics is an equal opportunity and affirmative action employer. Individuals seeking employment at Trendalytics are considered without regards to race, sex, color, creed, religion, national origin, age, disability, genetics, marital status, pregnancy, unemployment status, sexual orientation, citizenship status or veteran status.</div><div><br></div>"}