{"job title": "Senior Data Analyst", "company": "TribolaTech", "city state": "– Tempe, AZ", "rating": "5.0", "job description": "Long term Contract with one of the leading Banks in Tempe for the role of Data Analyst with a valid work authorization(Green Card or U.S.Citizenship)<br>Job Description :<br>\n<p><br> <strong>Job Responsibilities</strong>:</p>\n \n<ul>\n<li>Executes test, data extraction, and analysis utilizing the department's various computer software packages within established deadlines. Prepares, and documents detailed specifications of the programs utilized to pull data. Includes: creation and use of documents to facilitate the request and data integrity of the data that is provided to the internal customer.</li>\n<li>May analyze and make recommends on business, technology, and process improvement opportunities. </li>\n<li>Partners with various business lines to perform data analysis procedures as applicable to the support of ongoing projects. Generates ad hoc reports and regular datasets or report information for end-users using system tools and database or data warehouse queries. </li>\n<li>Work with senior management, technical and client teams in order to determine data requirements, business data implementation approaches, best practices for advanced data manipulation, storage and analysis strategies. </li>\n<li>Write and code logical and physical database descriptions and specify identifiers of database to management system or direct others in coding descriptions.</li>\n<li>Modify existing databases and database management systems and/or direct programmers and analysts to make changes. </li>\n<li>Test programs or databases, correct errors and make necessary modifications.</li>\n</ul>\n <strong>Qualifications:</strong> \n<ul>\n<li>Bachelor's degree in a technical field such as computer science, computer engineering or related field required. </li>\n<li>8-10 years applicable experience required.</li>\n<li>Experience with database technologies.</li>\n<li>Knowledge of the ETL process.</li>\n<li>Knowledge of at least one scripting language.</li>\n<li>Experience in building relational data structures, including relationships between tables and grouping data.</li>\n<li>Technical skills to manipulate and analyze data in a variety of formats (e.g. SAS, SQL, Access, JCL)</li>\n<li>Strong written and oral communication skills.</li>\n<li>Strong troubleshooting and problem solving skills.</li>\n<li>Demonstrated history of success.</li>\n<li>Desire to be working with data and helping businesses make better data driven decisions.</li>\n</ul>\n <strong>Additional Job Details:</strong> \n<p>Banking, Dataware housing and data Integration experience preferred</p>\n<br>"}