{"job title": "Backend Data Engineer", "company": "Trilogy Ed", "city state": "– Boca Raton, FL", "rating": "4.6", "job description": "<strong>About Trilogy:</strong>\n<br><br>\nPowered by big dreams and small egos, Trilogy is reimagining how skills-based learning can change the face of education. We work with experienced instructors, innovative employers, and top universities to create boot camps that prepare highly-motivated students for high-growth careers. And although we've successfully graduated hundreds of students, this is truly Day 1 for us.\n<br><br>\n<em>Driven by a one-team mentality, we're looking for those with the hunger, talent, and passion to ride this wave with us.</em>\n<br><br>\nTrilogy is the first of its kind to bring the successful web development boot camp model in house to academic institutions while supporting the entire student academic journey. Our platform combines coding curriculum, student recruitment, and career placement services to elevate graduates for increased job market success. We are in high-growth mode and rapidly expanding our family of partners.\n<br><br>\n<strong>Our Values:</strong>\n\n<ul>\n<li><strong>We put students first</strong></li>\n</ul>\nWe put students first because they deserve nothing less - and our university and employer partners expect nothing less. Every aspect of Trilogy's success depends on this.\n\n<ul>\n<li><strong>We never stop improving</strong></li>\n</ul>\nWe believe that continuous improvement is the source of innovation. We lend an ear to both our fans and our critics in an effort to deliver better programs, better service, better communication, and better value.\n\n<ul>\n<li><strong>We bring a \"can do\" attitude</strong></li>\n</ul>\nWe are a team of entrepreneurs who confront challenges head-on and figure things out. We value action, effort, commitment, and learning.\n\n<ul>\n<li><strong>We succeed only as a team</strong></li>\n</ul>\nTeamwork is critical to our success, and we place a tremendous value on how we work together in our immediate teams, between our business units, and across the entire company.\n<br><br>\n<strong>What you will do:</strong>\n<br><br>\nThe ideal candidate will have experience in software development, systems administration, deployment automation, quality assurance, and monitoring and maintaining large scale, mission critical services with various underlying dependencies. You will help develop the data infrastructure that supports our Company initiatives and be an integral part of building a large-scale data pipeline in our cloud platform. You will engage closely with engineering and operations teams to deliver highly available and scalable data services.\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nThis is a hands-on technical position. The ideal candidate has prior experience managing Amazon Web Service based applications and strives to solve traditional operations problems through automation and software. You must possess a high standard of excellence, solid written and verbal communication skills, have a strong customer focus, be capable of technical deep-dives, application performance, databases and storage systems.\n<br><br>\n<strong>Key responsibilities:</strong>\n\n<ul>\n<li>Extract data from various databases; perform exploratory data analysis, cleanses, massages, and aggregates data</li>\n<li>Employ scaling &amp; automation to data preparation techniques - Introduces incremental improvements to data analysis, visualization, and presentation techniques to communicate discoveries</li>\n<li>Research relevant emerging empirical methods and quantitative tools</li>\n<li>Participate in technical discussions with other engineers, architects, partners and colleagues to discuss application and platform solutions</li>\n<li>Develop data storage and pipeline infrastructure to support Marketing, Admissions, Student and Career Services and Enterprise solutions</li>\n<li>Be hands-on with cloud deployments, load balancing, CI/CD, provisioning and security of our data production and staging environments</li>\n<li>Ship clean well-crafted code</li>\n</ul>\n<strong>Required Skills and Experience:</strong>\n\n<ul>\n<li>Bachelor's Degree or Master's Degree in Computer Science</li>\n<li>4+ years experience as a Data Engineer</li>\n<li>Minimum 4 years hands-on experience with SQL and Python</li>\n<li>Demonstrated experience in a cloud-based -computing environment such as AWS, Azure, or Google Cloud Platform</li>\n<li>Strong understanding of both relational and NoSQL databases</li>\n<li>Experience working in a containerized infrastructure deployed in the cloud</li>\n<li>Avid user of open source projects and enjoy constant learning</li>\n<li>Enjoy both analytical and hands-on work to solve problems</li>\n<li>Able to focus on a problem to completion with a strong attention to detail</li>\n<li>Have a passion for working for a company that helps people change their lives for the better.</li>\n<li>Driven by the ability to self-manage - this is a 100% remote position</li>\n</ul>\nIt's great if you also have:\n\n<ul>\n<li>Experience as a backend software engineer developing services and APIs</li>\n<li>HIPAA experience</li>\n<li>Continuous Integration and Development</li>\n<li>Agile Development</li>\n<li>Written technical documentation samples, or links to open source projects (GitHub projects or documentation you have written), that you are able to share</li>\n</ul>\nIND1\n<br><br>\nIND 1"}