{"job title": "Senior Data Scientist", "company": "TripleLift", "city state": "– New York, NY", "rating": "4.7", "job description": "The Role\n<br><br>\nTripleLift is seeking an experienced data scientist to join our team full time. We are a fast growing startup in the advertising technology sector, trying to tackle some of the most challenging problems facing the industry. As a senior data scientist, you will responsible for exploring and leveraging our data in order to turn into actionable insights that help push the business forward for TripleLift and our customers. This includes optimizing our bidding algorithm, improving our computer vision logic, and planning and executing experiments to understand our real time bidding marketplace.\n<br><br>\nAbout TripleLift\n<br><br>\nTripleLift is building ads that people enjoy.\n<br><br>\nAdvertising is an essential part of the internet. Yet most ads are either never noticed, or are interruptive. We make advertising that's helpful and effective.\n<br><br>\nWe believe that by recreating the advertising experience to be seamless and focused on content, we can usher in a new era of content monetization. All day we are bombarded by ads online, many of which were created over 20 years ago. TripleLift is building the ad experience of the future.\n<br><br>\nTripleLift is focused on delivering consumer-focused, digital advertising technology that seamlessly integrate native advertising into every channel of content consumption, including web, app, branded content, and connected TV. By utilizing our proprietary computer vision technology, TripleLift is able to dynamically assemble native ads that match publisher content that are accessible through the industry's first real-time, native programmatic exchange.\n<br><br>\nTripleLift is one of the fastest growing companies in America, and has achieved a diversity of product lines, a leadership position in its industry and is regularly recognized as an innovator in its space - all while being consistently profitable.\n<br><br>\nCore Technologies\n<br><br>\nThe Data Science team employs a wide variety of technologies to accomplish our goals. From our early days, we've always believed in using the right tools for the right job, and continue to explore new technology options as we grow. The Data Science team uses the following technologies at TripleLift:\n\n\n<ul>\n<li>Languages: Python, R, Java 8</li>\n<li>Frameworks: Spark, Airflow, DataBricks</li>\n<li>Databases: MySQL, Redshift, MongoDB, S3/Parquet</li>\n<li>Amazon Web Services to keep everything running</li>\n</ul>\n\n<strong>Responsibilities</strong>\n\n\n<ul>\n<li>Optimize our estimation models in order to improve the performance of our bidding algorithm and maximize performance for our customers;</li>\n<li>Plan, execute, and analyze experiments to understand the dynamics of our real time bidding marketplace;</li>\n<li>Eagerly explore the dark corners of our data in order to push our business forward.</li>\n</ul>\n\nDesired Skills and Attributes\n\n\n<ul>\n<li>Strong Python skills, Spark is a plus;</li>\n<li>Proven experience building out predictive and forecasting models;</li>\n<li>Comfortable taking ownership of projects and showcasing key accomplishments;</li>\n<li>Strives for continued learning opportunities to build upon craft;</li>\n<li>Excellent organizational skills and attention to detail;</li>\n<li>Ability to work quickly and independently with minimal oversight;</li>\n<li>Ability to work under pressure and multitask in a fast-paced start-up environment;</li>\n<li>Desire to accept feedback and constructive criticism;</li>\n<li>Extremely strong and demonstrable work ethic;</li>\n<li>Proven academic and/or professional achievement.</li>\n</ul>\n\nEducation Requirement\n<br><br>\nA Bachelor's degree in a technical subject is preferred, although candidates with relevant experience who hold other degrees will be considered.\n<br><br>\nExperience Requirement\n<br><br>\nAt least three years of working experience in a professional, collaborative environment.\n<br><br>\nLocation\n<br><br>\nNew York, NY\n<br><br>\nBenefits and Company Perks\n\n\n<ul>\n<li>Amazing company culture</li>\n<li>Comprehensive Medical, Dental and Vision insurance</li>\n<li>Equity options</li>\n<li>401(k) program</li>\n<li>Snacks on snacks on snacks</li>\n<li>Yoga, massages, and meals</li>\n<li>Ongoing professional development</li>\n</ul>\n\nTripleLift Awards\n\n\n<ul>\n<li>Crain's Best Places to Work - three years running! (Crain's - 2015, 2016, 2017)</li>\n<li>Forbes Next Billion Dollar Companies (Forbes - 2018)</li>\n<li>Inc. 500 Fastest Growing Private Companies in America (Inc. - 2017, 2018)</li>\n<li>Crain's Fast 50, Fastest Growing Companies in New York (Crain's - 2017, 2018)</li>\n<li>Deloitte Technology Fast 500 (Deloitte - 2017, 2018)</li>\n<li>Forbes Most Promising Companies in America (Forbes - 2015)</li>\n<li>AdTech Startup of the Year Winner (New York Times - 2015)</li>\n<li>Startup of the Year Finalist (AdWeek - 2015)</li>\n</ul>\n\nNote: The Fair Labor Standards Act (FLSA) is a federal labor law of general and nationwide application, including Overtime, Minimum Wages, Child Labor Protections, and the Equal Pay Act. This role is a FLSA exempt role."}