{"job title": "Data Scientist", "company": "Tripping", "city state": "– San Francisco, CA", "rating": "4.3", "job description": "Data Scientist\n\n<ul>\n<li>San Francisco, CA</li><li>Full-time</li>\n</ul>\n\n<div>Company Description<div>Tripping.com is the world's largest site for vacation rentals. We work with top sites to offer 10 million vacation homes in over 150,000 destinations worldwide. We’re venture-backed, growing FAST, and having fun playing in a $100B market.</div>Job Description<div>Tripping.com is looking for a Data Scientist to join their world class search platform. We are a leader in the vacation rental space, but as with any search, there is room to grow. You will lead the charge into improving relevancy and speed on a fluid marketplace with varying parameters that are outside the standard search variations.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n• Design and provide insights into the latest data science technologies / tools / techniques\n\n\n<ul>\n<li>Hands on experience creating and analyzing relevance algorithms</li>\n<li>Design and evaluate experiments using algorithmic, mining, and statistical methodologies</li>\n<li>Grow our data stack</li>\n<li>Present findings to our team and the industry.</li></ul></div>Qualifications<div>• PhD in Computer Science / Mathematics / Statistics or closely related field\n<li>3 years experience in Search and Analytics</li>\n<li>Familiarity with a programming language such as Python, Golang, Erlang.</li>\n<li>Strong Data Analysis skills</li>\n<li>Experience working in a small team</li>\n<li>A self-starter mentality, who can work independently and collaboratively. We’re a small team, and communication is key in allowing us to move quickly.</li></div>Additional Information<div><div><strong>Perks</strong></div>\n\n\n\n<ul>\n<li>Great culture (we’re a tight team - we work hard and play hard)</li>\n<li>San Francisco headquarters, easily accessible by public transit</li><li>A fun team environment with frequent outings and retreats</li><li>Health insurance (medical, dental, and vision)</li><li>401K</li>\n</ul>\n<strong>Compensation</strong>\n<ul>\n<li>Compensation and equity commensurate with experience.</li></ul></div>\n<br>\nSorry, this job has expired</div>"}