{"job title": "Data Scientist", "company": "TrueCar", "city state": "– Santa Monica, CA", "rating": "3.3", "job description": "Job Description:<br><br>ALG has been the industry leader in forecasting residual values, the amount of retained value a vehicle will have at a future date, for over 50 years. Every automotive manufacturer and most of the top leasing institutions in North America utilize our forecasts. The data science team at ALG is responsible for building, maintaining and demystifying the prediction algorithms that power these residual value forecasts leveraged so heavily throughout the automotive industry.\n<br><br>\nOur team is accountable for every data point we output and strives to provide industry-leading analytics that are accurate and accessible. Right now, we're looking for a Data Scientist who will have the freedom to utilize the latest technologies to solve challenging problems, create innovative machine learning processes from the ground up and develop the tools for monitoring them. We are a mature and tight-knit data science team looking to add another top-shelf team member ready to make a difference in the automotive industry. Join us!\n<br><br>\n<strong>ABOUT THE JOB:</strong>\n<ul>\n<li>Daily emersion in automotive industry data</li><li>Build, maintain and iterate on production level machine learning algorithms</li><li>Collaborate closely with technology and engineering teams to improve existing processes and build out new ones</li><li>Work with product team to research and develop the analytics that will power new products</li><li>Create visual reports in Tableau for internal and external clients that summarize findings</li><li>Team environment that encourages sharing of ideas to build the best predictive algorithms</li><li>Ad-hoc data analysis and reporting</li>\n</ul>\n<strong>WHAT YOU NEED:</strong>\n<ul>\n<li>Enthusiasm for the automotive industry</li><li>Curiosity and passion for solving problems with data</li><li>Experience building production algorithm monitoring systems and pipelines</li><li>Ability to communicate complex ideas to any audience, ranging from teammates to business executives</li><li>1+ years of professional experience working with large datasets</li><li>1+ years of professional experience with statistical programming software (Spark, R, Python preferred)</li><li>1+ years of professional experience with database software (RedShift, Hive, SQL, MYSQL)</li><li>Master's Degree in Statistics, Data Science, Economics, or related field</li>\n</ul>\n<strong>NICE TO HAVE:</strong>\n<ul>\n<li>Experience with automotive market data</li><li>Experience building data pipelines in AWS</li><li>Some shareable examples of data visualizations you have created</li><li>Experience deploying machine learning models into production with an API</li><li>PhD in Statistics, Data Science, Economics, or related field</li>\n</ul>\n\nLocation(s): Santa Monica Offices\n<br>\nAssociated topics: data analytic, data center, data scientist, data warehouse, data warehousing, etl, hbase, mongo database, sql, sybase"}