{"job title": "Senior Data Scientist", "company": "True Fit", "city state": "– Boston, MA", "rating": "4.5", "job description": "<strong>Company Overview</strong>\n<br><br>\nTrue Fit is a data-driven platform that uses one-of-a-kind data to help people find clothes and shoes that they love and keep. We have the world's most complete fashion dataset allowing us to connect consumers, brands, and retailers across the entire industry. This dataset is the fuel for deep personalization powered by AI and driven by our Science and Engineering teams. We are looking for energetic and motivated Scientists at all levels to join us at our downtown Boston location.\n<br><br>\nOur fashion retailer dataset is unparalleled, and our work is much more than analyzing sales and return patterns.\n<br><br>\n<strong>What we do</strong>\n\n<ul>\n<li>Personalized recommendations - using Collaborative Filtering and both style and shape based recommender systems for personalized affinity predictions and recommendations.</li>\n<li>Large scale text classification - to categorize products and extract attributes which helps retailers better organize their product catalogs.</li>\n<li>Entity disambiguation - to help make sense of the thousands of different product sizes and to translate them all to a common scale.</li>\n<li>Anomaly detection - to identify strange user behavior and, to detect both internal and external system issues.</li>\n</ul>\n<strong>What you will do</strong>\n\n<ul>\n<li>Define problems, research solutions, and figure out which data to use in your solution.</li>\n<li>Query, assemble, clean, and refine datasets in preparation for analysis.</li>\n<li>Analyze data using a variety of techniques in order to build a proof of concept for your solution.</li>\n<li>Build high-quality prototypes and collaborate with the engineering team to implement the solution in a scalable framework, e.g. Spark.</li>\n<li>Communicate findings to stakeholders and a broader audience of technical and non-technical co-workers.</li>\n<li>Excellent English communications skills (written and oral).</li>\n<li>Lead projects, work on teams, and mentor junior analysts/scientists.</li>\n</ul>\n<strong>Required Experience/Skills</strong>\n\n<ul>\n<li>A Masters degree plus 5 years of experience in a quantitative field or a PhD with 3 years of experience.</li> \n\n<li>3+ years professional experience at organization(s) producing solutions based on analysis of large data sets.</li>\n<li>Experience with statistics, mathematical modeling, and/or machine learning, and experience implementing such methods to tackle real world problems using real data.</li> \n\n<li>SQL, or experience with another database technology.</li>\n<li>Experience with Python (familiarity with a statistical programming package, such as pandas, is a plus).</li>\n<li>Experience with big data tools and frameworks, such as Spark, is a plus.</li>\n<li>Excellent communication skills (written and oral).</li>\n<li>Experience with text analysis or computer vision is a plus.</li>\n<li>Willingness to learn new tools as they become needed.</li>\n</ul>\nWe are proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better product for the brands, retailers, and users that we work with. This is something we value deeply and we encourage everyone to come be a part of the digital revolution of fashion retail."}