{"job title": "Post Doctoral Research Scientist", "company": "TSR, Inc.", "city state": "– New Brunswick, NJ", "rating": "3.5", "job description": "Our client, a major pharmaceutical company in New Brunswick is seeking a talented, motivated individual as a Post-doctoral researcher in Drug Product Science &amp; Technology department on a contracting basis. The candidate will conduct specialized, innovative drug delivery research to address specific delivery problems for peptide/biologic and nucleic acid pipeline assets.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Conduct research on innovative drug delivery formulation technologies for macromolecule drugs to extend their release, stabilize and sustain their pharmacokinetics (PK), or alter PK to improve overall compliance.</li>\n<li>Explore lipid/polymer based particulate systems and gel-based systems to apply to pipeline drugs.</li>\n<li>Formulate prototypes for each delivery approach, characterize the material, test the in vitro drug release experiments, and collaborate to test the in vivo PK</li>\n<li>Contribute to the experimental design, plan and coordinate in vitro/in vivo experiments, perform chromatographic / spectroscopic analysis, analyze the data and present findings.</li>\n<li>Work collaboratively with team members to execute studies</li>\n</ul>\n\n<strong>Requirements/Education:</strong>\n\n\n<ul>\n<li>Ph. D. in pharmaceutical sciences, drug delivery, biotechnology or related field with 0-2 years of experience.</li>\n<li>Fundamental knowledge of drug delivery systems through thesis project.</li>\n<li>Hands-on expertise with drug delivery technology design, formulation prototyping, use of appropriate formulation processing unit operations, in vitro drug release testing, and material characterization is required.</li>\n<li>Strong proficiency in interpreting experimental data and good familiarity with routine analytical techniques (HPLC/UPLC chromatography, UV/fluorescence spectrometry).</li>\n<li>Collaborate to gain a broad mechanistic view of delivery performance.</li>\n<li>Highly motivated, exhibit an innovative mindset, and possess strong verbal, written, and interpersonal communication skills to effectively function as an individual contributor in a team environment.</li>\n</ul>"}