{"job title": "Business Intelligence Analyst", "company": "TTCU Federal Credit Union", "city state": "– Tulsa, Oklahoma", "rating": "3.7", "job description": "<strong>Position Summary</strong>\n<br><br>\nProvides analytical support to the Credit Union with an emphasis on marketing related activities. Proactively research and develop strategies that result in new member growth and increased member engagement by existing TTCU members. Analyze the effectiveness of ongoing initiatives and recommend ideas to improve results. Performs duties in compliance with regulatory requirements including, but not limited to, the Bank Secrecy Act.\n<br><br>\nEssential Job Functions and Responsibilities\n\n<li>Analyze data to anticipate member needs and create targeted marketing opportunities. Proactively initiate and develop strategies that drive member engagement with the goal of increasing new member growth, accounts per member, loan growth, deposit growth, and non-interest income.</li>\n<li>Collaborate with Marketing, E-Services, front-line employees, and other relevant TTCU staff when creating new strategies. Gather feedback from other TTCU departments on a regular basis to help create new ideas. All initiatives must include an effective plan to communicate with staff, such as the use of front- line cross-selling platforms (e.g. CRM) and intelligent dashboards that support outbound call campaigns. The ultimate goal is to translate member behavior into actionable intelligence.</li>\n<li>Evaluate the success of TTCU marketing promotions and sales initiatives. See through the data and analyze it precisely to find appropriate conclusions. Gather feedback from other TTCU departments on a regular basis to better understand the success of ongoing initiatives. Recommend adjustments to ongoing and future activities based on results. Track results over short and long-term horizons. Create consistent, well-organized reporting to track success. Effectively communicate results to management to facilitate more informed decisions, including efficient report distribution, formal presentations, and intelligent dashboards.Provide support to TTCU's Marketing department, including but not limited to: completing Touch Analyzer requests, compiling data files for marketing campaigns, and any other assigned tasks. Effective communication is key in working with Marketing staff. Proactively recommend, collaborate, and develop criteria for campaigns.</li>\n<li>Complete ongoing report requests to be used by TTCU management, board members, and staff. This includes recurring statistical reports and ad hoc requests from TTCU management.</li>\n\n<strong>Minimum Qualifications</strong>\n<br><br>\nEducational Requirements\n\n<li>Bachelor's degree in Business, Marketing, Research or or other related discipline required</li>\n\nCertificates/Licenses\n\n<li>Must have and maintain a valid driver's license</li>\n\nExperience\n<br><br>\n3 years experience in quantitative research including: data mining, analysis, interpretation and presentation experience\n<br><br>\n2 years experience in coordinating data-driven targeted marketing campaigns\n<br><br>\n1 year experience in banking or credit union with exposure to banking operations and terminology preferred\n<br><br>\nPosition Competencies\n<br><br>\nDrives Results\n<br><br>\nBottom line oriented, consistently pushing self and others for results.\n<br><br>\nFunctional Expertise\n<br><br>\nPossesses a sufficient level of technical and professional skill or knowledge in position-related areas; keeps up with current developments and trends in areas of expertise; actively seeks ways to grow and be challenged using both formal and informal development activities.\n<br><br>\nInterpersonal Savvy\n<br><br>\nRelates well to all kinds of people at all levels, inside and outside the organization; builds appropriate rapport; builds constructive and effective relationships; uses diplomacy and tact; can diffuse even high-tension situations comfortably.\n<br><br>\nLearning Agility\n<br><br>\nOpen to new ways of thinking; continuously learns new knowledge, skills, and abilities quickly; yet also takes the time to reflect and seek understanding of the broader view and deeper implications.\n<br><br>\nManage Complexity\n<br><br>\nGathers and analyzes diverse sources of data; separates what is relevant from what is not; determines root causes; defines situations accurately before determining problems and formulating approaches to solutions; is able to accomplish complex tasks with minimal guidance or instruction.\n<br><br>\nMember Focus\n<br><br>\nBuilds and maintains collaborative relationships with internal and external members which result in member satisfaction with both the process and the outcome.\n<br><br>\nOrg Planning &amp; Align\n<br><br>\nUtilizes sound planning principles and practices; implements broad based strategies intended to accomplish medium to long-range goals.\n<br><br>\nStrategic Agility\n<br><br>\nSees ahead clearly; can anticipate future consequences and trends accurately; has broad knowledge and perspective; is future oriented; creates competitive strategies and plans.\n<br><br>\nAdditional Requirements\n<br><br>\nJob Knowledge\n<br><br>\nAdvanced knowledge with Microsoft Office (Word, Excel, PowerPoint, Access, Point and Outlook)\n<br><br>\nWorking knowledge of report writing utilizing Crystal Reports, SQL and/or other accounting database software/systems Experience with Customer Relationship Management tool required\n<br><br>\nWell developed research skills, excellent analytical and critical thinking skills and the ability to identify, review and communicate appropriate recommendations Strong understanding of statistical methods and analysis such as probability distributions, regression analysis, correlation, causation, variance, etc\n<br><br>\nAbility to accomplish a task with knowledge of the end goal but with little direction on how to achieve it (self-directed, creative problem solver) A logical but creative mindset, being able to take a company's objectives and identify campaign strategy through research and analysis Strong project management and organizational abilities to implement promotions resulting from research and analysis.\n<br><br>\nAbility to work with confidential information and maintain confidentiality at all times Must be vigilant and like challenging problems\n<br><br>\nInterpersonal Skills\n<br><br>\nAbility to work across all lines of business and all levels of leadership to develop and implement products, services and campaigns\n<br><br>\nAdvanced written and verbal communication skills including good grammar skills, are required for working directly with vendors, co-workers and members. Demonstrated ability to lead teams and work effectively in a team environment\n<br><br>\nAbility to create an atmosphere which promotes TTCU's Core Values by maintaining a high level of personal integrity, presenting a friendly, enthusiastic and professional demeanor while providing extraordinary service to members and fostering teamwork among employees.\n<br><br>\nWorking Conditions\n<br><br>\nRoutinely perform work indoors in climate controlled shared work area with minimal noise. Must be able to perform job functions independently or with limited supervision and work effectively either on own or as part of a team. Must be able to read and carry out various written instructions and follow oral instructions. Must be able to speak clearly and deliver information in a logical and understandable sequence. Must be able to perform intermediate mathematical calculation with extreme accuracy. Must be capable of dealing calmly and professionally with numerous different personalities from diverse cultures at various levels within and outside the organization and demonstrate the highest levels of customer service and discretion when dealing with the public. Must be able to perform responsibilities with composure under stress of deadlines / requirements for extreme accuracy and quality and/or fast pace. Must be able to effectively handle multiple, simultaneous, and changing priorities. Must be capable of exercising highest level of discretion on both internal and external confidential matters.\n<br><br>\nPhysical Demands\n<br><br>\nRegularly - Perform primarily sedentary work with limited physical exertion and lifting of up to 30 lbs\n<br><br>\nRegularly - Capable of regular, reliable and timely attendance\n<br><br>\nRegularly - Must be able to operate office equipment including telephone, copier, facsimile, and calculator\n<br><br>\nRegularly - Must be able to routinely perform work on computer for an average of 6-8 hours per day\n<br><br>\nOccasionally - Must be capable of climbing / descending stairs in emergency situation.\n<br><br>\nOccasionally - Must be able to work extended hours whenever required or requested by management.\n<br><br>\nFrequently - Travel by automobile\n<br><br>\nOccasionally - Travel by commercial airlines, rental vehicles and public transportation X\n\n\n<ul>\n<li>cb</li>\n</ul>\n\nApply on Company Website\n<br><br>\nJob ID: 1131\n<br><br>\nFor your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.\n<br><br>\nTTCU Federal Credit Union\n<br><br>\nEstablished in 1934, TTCU Federal Credit Union is the largest state-chartered Federal credit union in Oklahoma with 15 branches - five in Tulsa, two in Broken Arrow, one in Bixby, Jenks, Claremore, Miami, Muskogee, Owasso and Tahlequah. The membership of TTCU is over 100,000 strong and is made up of teachers, school faculty, administrators, staff, students and over 600 select employee groups. Contact Info\n\n\n<ul>\n<li>Tulsa, OK</li>\n</ul>\n\nView Company Profile\n<br><br>\nDon't miss out on new jobs like this\n<br><br>\nGet the latest jobs delivered to your inbox. Unsubscribe at any time.\n<br><br>\nCreate Job Alert\n<br><br>\nSaving Your Job Alert\n<br><br>\nJob Alert Created\n<br><br>\nWell, this is embarrassing. We are having trouble saving your search. You can try again or come back at a later time.\n<br><br>\nMaximum Email Alerts\n<br><br>\nThis email address has reached the maximum of 5 email alerts. To create a new alert, you will need to log into your email and unsubscribe from at least one."}