{"job title": "Data Scientist", "company": "Tubi TV", "city state": "– San Francisco, CA", "rating": "4.3", "job description": "Join Tubi, the industry-leading and fastest-growing streaming service that is revolutionizing the future TV! With over 8,500 active movies &amp; TV shows, our users are watching millions of hours from the world's largest free catalog of premium content per month. Backed by leading VC firms, and working with partners such as MGM, Paramount and Lionsgate, we are disrupting the streaming media space and providing access to millions of viewers.\n<br><br>\n<strong>About the role:</strong>\n<br><br>\nWe are looking for an experienced Data Scientist to help improve data quality, build data ETL and apply various techniques and statistical analysis to understand user journey and pattern. You will be able to visualize and communicate user patterns through dashboards and reporting. Additionally, you will also work cross-functionally with Engineering, Product, Content, Growth teams and must be able to conduct AB testing, ad-hoc analysis and analyze experiments.\n<br><br>\n<strong>What you'll be doing:</strong>\n\n<ul>\n<li>Understanding user journey and patterns by applying various clustering techniques and statistical analysis</li>\n<li>Building dashboard to visualize and communicate your understanding of our users</li>\n<li>Working with engineers and product managers to set up A/B experiment and build experiment analysis pipeline</li>\n<li>Helping to improve data quality by communicating how to track various events on Mobile and OTT platforms</li>\n<li>Building data ETL to create tables that are easily used by less technical audiences</li>\n<li>Supporting product managers with Ad-hoc analysis of new features, bugs and growth initiatives</li>\n</ul>\n<strong>Your background:</strong>\n\n<ul>\n<li>Masters in a Quantitative Field, i.e. Statistics, Computers Science, Operations Research, etc.</li>\n<li>SQL, Python, Data Mining, Data Visualization, Statistical Analysis</li>\n<li>Basic understanding of Machine learning algorithms: Supervised learning algorithms, unsupervised learning algorithms, dimension reduction techniques.</li> \n\n<li>3 years experience in a similar role</li>\n<li>Strong communication, presentation, collaboration skills</li>\n</ul>\n<strong>Bonus:</strong>\n\n<ul>\n<li>PhD preferred</li>\n<li>Spark, Airflow, data ETL experiences, product analytics or growth analytics experiences in tech industry</li>\n<li>Video streaming industry experience is a plus</li>\n</ul>\n<strong>Benefits:</strong>\n\n<ul>\n<li>Help build the future of TV</li> \n\n<li>A tight-knit team of passionate people and a tech-first, data-driven business</li>\n<li>In addition to VC funding, Tubi generates healthy revenue.</li>\n<li>We offer very competitive pay, equity, full medical, dental &amp; vision benefits, catered lunch and dinner, and gym subsidies</li> \n\n<li>Your choice of hardware</li>\n<li>Open PTO</li>\n</ul>\n<em>*Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. We are an E-Verify company.</em>"}