{"job title": "Data Scientist", "company": "Turnberry Solutions", "city state": "– Philadelphia, PENNSYLVANIA", "rating": "4.6", "job description": "<strong><u>Research Scientist in Philadelphia, PA 19103</u></strong>\n<br><br>\n<strong>Interview Logistics:</strong><br><br>Phone interview then face to face.<br><br><strong>Required Skills Set:</strong><br><br><strong>Years of Experience:</strong> Masters or PhD in Computer Science, Math, Machine Learning, Statistics, or related field, 3+ years' experience working on text analytic projects using machine learning and NLP techniques, Programming in R, Python, and Scala\n<br><br>\n<strong>Education Required:</strong> Masters Degree\n<br><br>\nExperience using Spark functions within a distributed computing environment like Hadoop, Experience implementing deep learning models using TensorFlow and Keras, Experience with EMR data preferred, Record of peer-reviewed publications a plus<br><br><strong>Additional Preferred Skills:</strong><br><br>Collaborate with internal business partners to design and execute projects that leverage various text data resources. Develop Client process/pipeline for within our Hadoop distributed computing environment to execute a wide range of text analytics.\n<br><br>\nDevelop proprietary algorithms, models, and build customized solutions to a variety of business questions. Evaluate on-going technological needs for executing leading edge text analytics. Work with other research analysts and data scientists to extract features from text sources that can be used in a variety of predictive models.\n<br><br>\nTrain other research analysts and data scientists on text analytics\n<br><br>\nPresent results to end-user business partners\n<br><br>\nGuide implementation of results into business practice\n<br><br>\nPresent at professional conferences and publish results in peer-reviewed journals<br><br><strong>Project Description:</strong><br><br>This Data Scientist will lead analytic initiatives related to text mining, including NLP, document clustering and classification, and information and concept extraction. The incumbent will employ the latest text analytic methods to extract information from Electronic Medical Records (EMR), Continuity of Care Documents (CCD's), OCR'd medical charts, SOAP and progress notes, web, and social media outlets and collaborate with business areas to implement results within their business processes.<br><br><strong>Physical Environment and Working Conditions:</strong><br><br>Must be able to work on a fast paced team."}