{"job title": "Lead Data Scientist", "company": "Turo", "city state": "– San Francisco, CA", "rating": "4.6", "job description": "Turo, we are creative, mission-driven, data nerds, environmentalists and car enthusiasts who want to put the world's 1B+ cars to better use. We do this by using data to serve our customers' delightful experiences by matching them with the right car for their next adventure while keeping our marketplace safe.\n<br><br>\nAbout you\n<br><br>\nYou are creative, rigorously data-driven scientist who is excited to solve challenging problems. You must be comfortable with a range of statistical and machine learning techniques with the ability to innovatively apply them to our problem domain. This requires you to be proficient in translating unstructured business problems into an abstract mathematical framework and make intelligent approximations to make solutions practical and scalable.\n<br><br>\nYou have a passion for consumer products, shipping code, and data-driven experiments. The models you develop will have an enormous impact on our next chapter and you should be excited to play a key role in creating the product from inception to implementation and beyond.\n<br><br>\nResponsibilities\n\n<ul>\n<li>Work closely with data scientists, engineers, and product managers to develop algorithms and drive key product or modeling decisions</li>\n<li>Proactively perform exploration to improve our algorithms</li>\n<li>Develop data models and services that drive our business: risk prediction, search rank, dynamic pricing, recommendation engines etc.</li>\n<li>Research the best metrics, design and validate experiments to measure model performance</li>\n<li>Present your insights to all levels of the company</li>\n</ul>\nRequirements\n\n<ul>\n<li>PhD (or MS + equivalent) in hard sciences/engineering with at least 5+ years of relevant industry experience</li> \n\n<li>Deep understanding of mathematical methods in statistics, optimization and demonstrable experience applying them to your chosen field of study such as classification, recommendation systems, time series analysis etc.</li>\n<li>Fluent in Python programming including common data science tools such as Jupyter notebooks, scikit-learn, pandas, and matplotlib</li>\n<li>Fluent in SQL, ability to query large datasets, and visualizing the results</li>\n<li>Experience with commonly available tools and infrastructure for machine learning and parallel data processing</li>\n<li>Experience working with large amounts of data and processing at scale using Amazon EC2, Storm, Hadoop and Spark</li>\n<li>Deep product sense, self-starter and with an eye for detail</li>\n</ul>\nPreferred Qualifications\n\n<ul>\n<li>Fluency working with ETL (Extract-Transform-Load) systems</li>\n<li>Experience in deploying and scaling machine learning algorithms into production environments on cloud platforms e.g. AWS, GCP etc. as services</li>\n<li>Experience working in a rapid growth environment that requires flexibility and continuous innovation</li>\n<li>Ability to mentor junior engineers/data scientists</li>\n<li>Experience with insurance, risk or actuarial sciences</li>\n</ul>\nAbout us\n<br><br>\nTuro is a car rental marketplace where travelers can rent any car they want, wherever they want it, from a nationwide community of local car owners. Our mission is to reinvent the car rental experience and put the world's one billion cars to better use.\n<br><br>\nWe've grown the business by over ten times in the past two years and raised over $200 million from investors like Daimler, SK Holdings, KPCB, Google Ventures, August Capital and Shasta Ventures.\n<br><br>\nWe're an equal opportunity employer and value diversity at our company. We don't discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}