{"job title": "Data Scientist", "company": "Twist Bioscience", "city state": "– San Francisco, CA", "rating": "4.2", "job description": "We are searching for a data scientist that will help build, maintain, and extract value from Twist's data. This position will work closely with operations, bioinformatics, and informatics, to ensure that all relevant data is captured and annotated correctly; integrated seamlessly into our data reservoir and analytics database; and analyzed in depth to bring to light insights that will help improve Twist's operations. The successful candidate, first and foremost, will have a background in molecular biology and a strong understanding of synthetic biology, sequencing, and bench science. This position, however, will focus on data management and analysis rather than bench work. Longer-term expansion into analysis of the commercial side of Twist will be an option. Strong communications and interpersonal skills are absolutely required.\n<br><br>\nResponsibilities\n\n<ul>\n<li>Performing investigations to identify problems or inefficiencies in our process, and suggesting actions to improve operations</li>\n<li>Establishing data capture streams</li>\n<li>Helping to build and maintain Twist's data reservoir through curation, metadata capture, parsing, and custom scripting</li>\n<li>Working with R&amp;D, Bioinformatics, and informatics to define data analysis methods and metrics that track quality, with an emphasis on NGS sequencing</li>\n<li>Working with operations to set up and monitor the day-to-day data tracking in our lab.</li>\n</ul>\nRequired Experience:\n\n<ul>\n<li>Ph.D. or equivalent experience (5+ years) in molecular biology or related field</li>\n<li>Strong technical knowledge of synthetic biology techniques such as PCA, DNA assembly, cloning, next-gen sequencing, etc.</li>\n<li>Scripting/Programming: working knowledge of Python, R, SQL, or equivalent</li>\n<li>Strong statistics and data analysis skills</li>\n<li>Excellent grasp of experimental design and data interpretation</li>\n<li>Strong communication and interpersonal skills</li>\n</ul>\nPreferred Experience:\n\n<ul>\n<li>Experience with DNA synthesis</li>\n<li>Experience with databases postgres, redshift, and mongoDB preferred</li>\n<li>Experience with LIMS systems</li>\n</ul>\n<strong>About Twist Bioscience</strong>\n<br><br>\nTwist Bioscience synthesizes genes from scratch, known as \"writing\" DNA. Just as children learn to both read and write, the next phase of development for the genomics revolution is the ability to write DNA.\n<br><br>\nAt Twist Bioscience, we work in service of people who are changing the world for the better. In fields such as health care, agriculture, industrial chemicals and data storage, our unique silicon-based DNA Synthesis Platform provides precision at a scale that is otherwise unavailable to our customers.\n<br><br>\nTwist Bioscience Corporation is an Equal Opportunity Employer. Twist Bioscience Corporation provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, genetic characteristics, or any other category protected by law.\n<br><br>\nSan Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}