{"job title": "ML Modeling Engineer - Extended Environment - Cortex", "company": "Twitter", "city state": "– New York, NY", "rating": "4.0", "job description": "ML Modeling Engineer - Extended Environment - Cortex\n<br><br>\nNew York, NY\n<br><br>\n<strong>Who We Are:</strong>\n<br><br>\nCortex is the central ML/AI team at Twitter with the goal to build an ML platform and provide deep ML expertise to support our internal customers, while advancing ML inside &amp; outside Twitter.\n<br><br>\nOur team (ML Extended Environment) is building technologies that enable product teams to create that experience. We are a team of ML engineers and researchers, trying to push boundaries of ML and personalization at Twitter. We work closely with ML product teams across the company (timelines, ads, recommendations, safety etc) to define, design and develop the core components that would enable them to deliver the desired experience to Twitter users.\n<br><br>\n<strong>Example projects include:</strong>\n\n\n<ul>\n<li>Approximate Nearest Neighbor algorithms and related infrastructure at Twitter scale,</li>\n<li>Embeddings models and algorithms</li>\n<li>Embedding infrastructure that allows teams to easily train, consume and share embeddings.</li>\n</ul>\n\nMLX Blog Post: https://blog.twitter.com/engineering/en_us/topics/insights/2018/embeddingsattwitter.html\n<br><br>\n<strong>Who You Are:</strong>\n\n\n<ul>\n<li>You have a passion for machine learning.</li>\n<li>You thrive on working in concert with other smart people, including from distributed offices.</li>\n<li>You communicate fluidly, at the level of your audience, and seek to understand and being understood.</li>\n<li>You have the ability to take on complex problems, learn quickly, iterate, and persist towards a good solution.</li>\n<li>You are adamant about studying customer needs and enabling their success through our products.</li>\n<li>You take pride in polishing and supporting our products.</li>\n<li>You welcome feedback on are constantly looking for ways to improve yourself.</li>\n</ul>\n\n<strong>What You'll Do:</strong>\n<br><br>\nYou will work with our team of experts in machine learning and software engineering to build powerful and scalable models and surface the most relevant content on Twitter. Come help us make Twitter the best place for finding what the world is saying, live!\n<br><br>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Masters' or PhD in a Computer Science or Machine Learning related degree; or equivalent work experience in the field</li>\n<li>Good theoretical grounding in core Machine Learning concepts and techniques</li>\n<li>Ability to perform comprehensive literature reviews and provide critical feedback on state-of-the-art solutions and how they may fit to different operating constraints</li>\n<li>Ability to reason about and grasp the intuition behind fundamental principles of Linear Algebra, Statistics, Probability .</li>\n<li>Experience with a number of ML techniques and frameworks, e.g. data discretization, normalization, sampling, linear regression, decision trees, SVMs, deep neural networks, etc</li>\n<li>Familiarity with one or more DL software frameworks such as Tensorflow, PyTorch</li>\n<li>1+ years experience with one or more DL software frameworks such as Tensorflow, PyTorch, Theano</li>\n<li>3+ years experience leading and delivering effective ML solutions for large scale production use cases.</li>\n</ul>\n\n<strong>Desired:</strong>\n\n\n<ul>\n<li>Experience with large-scale systems and data, e.g. Hadoop, distributed systems</li>\n<li>Familiarity with distributed systems.</li>\n<li>Publications in top conferences such as ICLR, NIPS, ICML, CVPR, ICCV, ECCV, etc</li>\n</ul>"}