{"job title": "Applied Scientist", "company": "Twitch", "city state": "– San Francisco, CA", "rating": "3.7", "job description": "<div><div>Twitch is building the future of interactive entertainment. We are looking for passionate applied scientists who are excited to solve challenging and open ended problems in the domains of query understanding, ranking and relevance. As an applied scientist in the Twitch discovery team, you will help us better understand the customer intent and personalize their search and discovery experience. You will be developing next-generation intelligent products using state of the art ML/NLP models with a world class engineering team. You will help drive the engagement for hundreds of millions of viewers by enriching their interaction with Twitch discovery products such as search, browse, tags etc.</div><br>\n<div>At Twitch, which is part of Amazon, you’ll experience the benefits of working in a dynamic, entrepreneurial environment in the heart of San Francisco, while leveraging the resources of Amazon.</div></div><div><div>Responsibilities\n\n<ul>\n\n\n<ul>\n<li>Work on building a robust, scalable and extensible query understanding and ranking service that handles hundreds of millions of queries / day.</li><li>Work closely with the discovery engineering and product management team to create flexible data pipelines and ML based services for discovery products</li><li>Analyze the real user data and experiment different search algorithms to improve the quality of search for Twitch users</li><li>Research, prototype, develop and productionize innovative ML techniques to improve user engagement and add business value</li><li>Stay up to date with the state-of-the-art ML research</li><li>Continuously experiment with new techniques in order to keep pushing the boundaries of Twitch centric content discovery</li></ul>\n</ul>\n\n</div>\n</div><div><div>Requirements\n\n<ul>\n\n\n<ul>\n<li>PhD in CS, Math, Stats or equivalent hands on experience</li><li>3+ years of hands-on experience in predictive modeling and analysis, and deploying ML / DL models</li><li>3+ years experience in a general purpose programming languages: Go, C/C++, Python, Java</li><li>3+ years experience in applying algorithms and data structures for solving problems</li><li>Strong Interest in improving the high intent content discovery experience on Twitch via ranking, relevance, query understanding and suggestions</li></ul>\n</ul>\n\n</div>\n</div><div><div>Bonus Points\n\n<ul>\n\n\n<ul>\n<li>PhD with specialization in ML / NLP</li><li>2+ years of work experience in deploying ML / DL models in production</li><li>2+ years of work experience building knowledge graphs used in production</li><li>Strong software development skills</li><li>Experience in one or many of the following areas: familiarity with AWS services, search systems such as Elastic, SORL, Lucene, Algolia or working in high energy small startup environments</li></ul>\n</ul>\n\n</div>\n</div><div><div>Perks\n\n<ul>\n\n\n<ul>\n<li>Medical, Dental, Vision &amp; Disability Insurance</li><li>401(k)</li><li>Maternity &amp; Parental Leave</li><li>Flexible PTO</li><li>Commuter Benefits</li><li>Amazon Employee Discount</li><li>Monthly Contribution &amp; Discounts for Wellness Related Activities &amp; Programs (e.g., gym memberships, off-site massages, etc.)</li><li>Breakfast, Lunch &amp; Dinner Served Daily</li><li>Free Snacks &amp; Beverages</li></ul>\n</ul>\n\n</div>\n</div><div><div>Twitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at http://twitch.tv.</div><br>\n<div><strong>We are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</strong></div></div>"}