{"job title": "Data Scientist - Metrics Data Science team", "company": "Twitter", "city state": "– San Francisco, CA", "rating": "4.0", "job description": "<div>\n<div>\n<div>\n<div>\n<div>\nData Scientist - Metrics Data Science team</div><br>\n\n<div>\nSan Francisco, CA</div></div>\n</div>\n </div>\n</div><br>\n\n<div>\n<div>\n<div>\n<div>\n<div>Who We Are: Twitter is What's Happening now and an important tool for millions of people throughout the world. The Metrics team is responsible for ensuring that the company has a consistent, accurate, and practical understanding of what's happening on Twitter to ensure that it will continue to meet the demands of our customers.\n<br><br>\nWhat You’ll Do: You will be a key member of the Metrics Data Science team, working to understand the desires of our customers, measuring the impact of product changes, and communicating this information across the company. In this central role, you will:\n<ul>\n<li>Conduct analyses on vast amounts of data to ensure an accurate understanding of the current state of Twitter and communicate these findings clearly to our internal stakeholders.</li> <li>Apply statistical techniques to model user behavior and trends to identify potential opportunities for growth and improvement</li><li> Automate these results to ensure consistency and repeatability while expanding our ability to understand the platform.</li><li>Communicate findings to executives and cross-functional teams in Product, Engineering, Design, Finance and throughout the company.</li>\n</ul>\n<strong>Who You Are:</strong>\n<ul>\n<li>A curious individual who believes that data is the best tool to understand what is happening.</li><li>An eager learner who will continually seek to expand their skills to new tools, techniques, and systems.</li><li> A strong communicator who can understand complex patterns and simplify them down.</li><li> A mentor who enjoys the opportunity to teach others.</li>\n</ul>\n<strong>Requirements:</strong>\n<ul>\n<li> Master’s or PhD degree in Computer Science, Statistics, Math, Engineering, or other quantitative discipline.</li><li> 3+ plus years of industry experience working on product analysis with emphasis on A/B experimentation and/or metric definition.</li><li>Experience with scripting and/or statistical languages (Python / Matlab / R or similar).</li><li>Experience with SQL based systems.</li>\n</ul>\n<strong>Bonus points:</strong>\n<ul>\n<li> Experience with time series modeling</li><li> Experience with compiled languages (Scala, C++, Java, or similar)</li><li> Experience with Map Reduce architectures</li>\n</ul>\n<strong>﻿We are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, ethnicity, color, ancestry, national origin, religion, sex, sexual orientation, gender identity, age, disability, veteran status, genetic information, marital status or any other legally protected status.</strong>\n<br><br>\n<strong>San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</strong>\n</div></div>\n</div>\n </div>\n</div><br>\n\n<div><div><div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\nEngineering</div></div></div></div></div></div></div></div></div></div></div>"}