{"job title": "Senior Applied Scientist - Recommendations", "company": "Twitch", "city state": "– San Francisco, CA", "rating": "3.3", "job description": "<div><div>Twitch is building the future of interactive entertainment. Recommendations (matching viewers with live content they greatly enjoy), is core to that vision. As an applied scientist on Twitch Recommendations Team, you will help design, prototype and implement algorithms and techniques connect Twitch users with the right content. This is a broad problem, and may include extracting and using data from live video using computer vision (CV), or from chat using natural language processing (NLP). By improving Twitch’s recommendation products using machine learning, you will help Twitch’s viewers have a great experience, and help Twitch’s broadcasters find more passionate fans.</div><div><br></div><div>At Twitch, a part of Amazon, you’ll experience the benefits of working in a dynamic, entrepreneurial environment in the heart of San Francisco, while leveraging the resources of Amazon.</div></div><div><div>Responsibilities<ul><ul><li>Design, prototype, and implement Machine Learning (ML) recommendation products, leveraging Deep Learning (DL), computer vision (CV) and Natural Language Processing (NLP) </li><li>Keep up to date with state-of-the-art ML algorithms and techniques and be able to apply them when appropriate</li><li>Push the state-of-the-art to address Twitch’s unique requirements</li><li>Collaborate with team members in the discovery group in an effective manner</li></ul></ul></div></div><div><div>Requirements<ul><ul><li>Experience being a leader on a team that delivered at least one Machine Learning Product that demonstrated business impact </li><li>Interest in improving content discovery on Twitch via Recommendations</li><li>Deep knowledge of ML algorithms and their feasibility for implementation</li><li>Ability to apply ML theory to address Twitch viewers needs</li><li>Hands-on experience in developing Deep Learning algorithms, and experience in using Deep Learning libraries, e.g., TensorFlow, MxNet, PyTorch, Theano, etc.</li><li>Desire and ability to write production quality code</li><li>MS / Ph.D. in computer science or equivalent experience</li></ul></ul></div></div><div><div>Bonus Points<ul><ul><li>Deep knowledge in ONE of the following areas, with either published research or publically available code of algorithms</li><li>Recommender algorithms, e.g., collaborative filtering, content based recommendations, deep models for recommendations, etc.</li><li>Computer Vision: large scale object detection, activity recognition, OCR, learning with few examples, etc.</li><li>Natural Language Processing: Word/Sentence Embeddings, Topic Detection, Sentiment Analysis, Entity Extraction, etc.</li><li>Demonstrated experience in software development via an internship, work experience, coding competitions or submissions to open source projects.</li></ul></ul></div></div><div><div>Perks<ul><ul><li>Full benefits, including medical, dental, vision and life </li><li>401(k) savings plan with a company match</li><li>Catered daily lunch and dinners (and hearty breakfasts three times a week)</li><li>Unlimited snacks and drinks</li><li>Monthly in-office massages</li><li>Corporate gym membership</li><li>Commuter benefits</li><li>Flexible time off policy</li><li>Weekly happy hours and opportunity to attend one gaming event or tournament</li><li>Top of the line technology to help you build your own workspace</li></ul></ul></div></div><div><div><b>About Twitch</b></div><div><br></div><div>Twitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at http://twitch.tv.</div><div><br></div><div><b>We are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records</b>.</div><div><br></div></div>"}