{"job title": "Data Scientist - Investment Research", "company": "Two Sigma", "city state": "– New York, New York, United States", "rating": "3.6", "job description": "As machine learning and data-driven business intelligence have permeated industries, an abundance of new datasets and techniques have created opportunities for granular measurement of increasingly varied aspects of our economy. Two Sigma is looking to hire highly creative &amp; motivated data scientists to further scale our long-standing efforts to leverage these advancements to measure and predict the world's financial outcomes.\n<br><br>\nTwo Sigma's data engineering platform enables us to harness some of the world's most complex &amp; challenging content, as we structure and integrate new datasets into a diverse ecosystem of syndicated financial and industry-specific data products. Two Sigma's data scientists are focused on joining, enriching, and transforming datasets into novel creative measures of economic activity. We utilize a variety of modeling techniques to generate financially-relevant predictions feeding into Two Sigma's systematic investment management platform, we measure the performance and impact of our predictions in a variety of settings, and we further distill economic insights and thematic analyses from our data &amp; observations.\n<br><br>\nData Scientist Responsibilities:\n<ul>\n<li>Design &amp; implement granular domain-specific indicators from data, relating them to company, industry, and macroeconomic factors.</li><li>Contribute to the design of investing strategies on economic predictions through multiple investing paradigms.</li><li>Manage requirements for a set of dependent data products derived from a large portfolio of integrated data feeds.</li><li>Contribute to data sourcing strategy across multiple industry data verticals supporting our prediction efforts.</li><li>Generate a series of economic insights research reports relating trends in our indicators &amp; predictions to investment themes.</li>\n</ul>\nQualifications and Experience:\n<ul>\n<li>1-5+ years of experience in applied data analysis &amp; prediction, preferably in an industry setting</li><li>Demonstrably strong data science modeling intuition and feature engineering creativity</li><li>Expertise in applying statistical techniques for time-series measurement/estimation and prediction</li><li>Intimate familiarity with the potential flaws &amp; fallacies in the applications of specific statistical methods</li><li>Experience specifying &amp; managing requirements for datasets leveraged in your analyses</li><li>Working knowledge of SQL and common data science toolkits : Python, R, Spark, Matlab</li><li>Strong written &amp; verbal communication and presentation skills, with experience crafting a compelling narrative supported by data</li><li>A portfolio of open-data analyses or data-driven research publications would be ideal</li>\n</ul>"}