{"job title": "Data Scientist", "company": "Tygart Technology, Inc.", "city state": "– Washington, DC", "rating": "4.7", "job description": "Tygart is currently seeking <strong>Data</strong><strong> Scientist</strong> to support a Department of Justice (DoJ) organization. The successful candidate will have a background in a quantitative or technical field, will have experience working with small and large data sets, and will have some experience in data-driven decision making. This position requires that the candidate have <strong><u>a current Top Secret</u></strong> security clearance.\n<br><br>\nResponsibilities include: \n\n\n<ul>\n<li>Analyze available systems, processes, and data with the strategic view to conceptualize and recommend innovative data usage (analysis, visualization, value propositions) to meet mission need.</li>\n\n<li>Solve complex analytical problems using quantitative approaches with a blend of analytical, mathematical, and technical skills</li>\n\n<li>Apply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how our users interact with both our mission and business products</li>\n\n<li>Inform, influence, support, and execute our product decisions and product launches</li>\n\n<li>Partner with product and engineering teams to solve problems and identify trends and opportunities</li>\n\n<li>Assess/analyze approaches to obtaining value and insight into large datasets; find patterns and insights within structured and unstructured data.</li>\n\n<li>Propose analytics strategies and solutions that drive innovative uses of current and future data streams.</li>\n\n<li>Spreading best practices to analytics and product teams</li>\n\n<li>Building models of user behaviors for analysis or to power production systems</li>\n</ul>\n\n<strong>Qualifications</strong>\n<br>\nThe ideal candidate will have the following:\n\n\n<ul>\n<li>Bachelor's degree in Mathematics, Operations Research, Engineering, Information Technology, Computer Science, or related field.</li>\n\n<li>Ten (10) years of work experience in system engineering or data analysis position</li>\n\n<li>Skilled in operations research, applied statistics, data mining, machine­ learning, or a related quantitative discipline.</li>\n\n<li>Possesses a deep understanding of statistical and predictive modeling concepts, machine-learning approaches, clustering and classification techniques, and optimization algorithms.</li>\n\n<li>Able to clearly communicate complex ideas and methods in meaningful ways across the spectrum of engineers to management.</li>\n\n<li>Experience in SQL or other programming languages.</li>\n\n<li>Development experience in at least one scripting language (PHP, Python, Perl, etc.)</li>\n\n<li>Experience manipulating large data sets through statistical software (ex. R, SAS) or other methods</li>\n\n<li>Skilled in relational databases, SQL, big data analytics and technologies, to include Hadoop-based data mining frameworks.</li>\n\n<li>Experience with distributed computing (Hive/Hadoop), machine learning, semantic web, knowledge graph, and natural language processing is desired</li>\n\n<li>Must be able to well under pressure, and possess excellent oral and written communication skills, as well as excellent organizational skills.</li> \n</ul>\n\nTygart Technology, Inc. is a premier professional services and software development organization providing a broad range of Information Technology (IT) services to public and commercial sector customers. Founded in 1992, Tygart's customer first mind set and agile development methodology have led to our continued success. Tygart supports the Department of Defense, Federal Bureau of Investigation, Intelligence Community, Federal Election Commission, Pension Benefit Guaranty Corporation, and various other Federal and State organizations and maintains offices in West Virginia and Northern Virginia.\n<br><br>\n<em>Tygart Technology, Inc. is an equal opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, disability, veterans status, sexual orientation, or any other protected factor.</em>\n<br>\nFor information on Tygart and our career openings, please visit http://www.tygart.com/careers/.\n<br>"}