{"job title": "Data Scientist", "company": "U.S. Bank", "city state": "– Minneapolis, MN", "rating": "3.5", "job description": "Responsible for working on big data/analytics projects that gather and integrate large volumes of data, performs analysis, interprets results and develops actionable insights and recommendations for use across the company. Acquires data from multiple data sources in order to perform analysis. Identifies, analyzes and interprets trends or patterns in complex data in order to provide answers to business questions as well as provide recommendations for action. Interprets data and analyze results using various statistical techniques and tools. Presents data and analysis in a clear and concise manner allowing the audience to quickly understand the results and recommendations so they activate upon them and make data driven decisions. Collaborate with various partners to provide a holistic view of the analysis. Measures and monitors results of applied recommendations and present adjustments. Ensures all data acquisition, sharing and results of applied recommendations are compliant with company standards.\n\n\n<ul>\n<li>*Qualifications:**</li>\n</ul>\n\nBasic Qualifications\n<br><br>\n+ Bachelor's degree in a quantitative field such as statistics, engineering, econometrics, computer science or applied mathematics; Master?s Preferred.\n<br><br>\n+ 5-7 years of analytics experience\n<br><br>\n+ Proficiency in statistical programing languages such as R, Python and SAS\n<br><br>\n+ Experience querying large databases\n<br><br>\nPreferred Skills/Experience\n<br><br>\n+ Experience with data visualization tools such as Tableau\n<br><br>\n+ Demonstrated project management and organizational skills\n<br><br>\n+ Thorough knowledge of a specific business line or functional area\n<br><br>\n+ Strong verbal and written communication skills\n<br><br>\n+ Proven track record of seeing complicated projects through to completion\n<br><br>\n+ Work independently to drive results\n<br><br>\n+ Impeccable attention to details\n<br><br>\n+ Excited about rolling up your sleeves and getting hands-on with the data\n<br><br>\n+ Comfortable with data ambiguity\n<br><br>\n+ Great team player\n<br><br>\n+ Someone who thrives in a fast-paced, can-do environment\n<br><br>\n+ Experience in the financial services industry is a plus\n\n\n<ul>\n<li>*Job:** Information Technology</li>\n<li>*Primary Location:** Minnesota-MN-Richfield</li>\n<li>*Shift:** 1st - Daytime</li>\n<li>*Average Hours Per Week:** 40</li>\n<li>*Requisition ID:** 180032334</li>\n</ul>\n\nU.S. Bank is an Equal Opportunity Employer committed to creating a diverse workforce.\n<br><br>\nU.S. Bank is an equal opportunity employer committed to creating a diverse workforce. We consider all qualified applicants without regard to race, religion, color, sex, national origin, age, sexual orientation, gender identity, disability or veteran status, among other factors."}