{"job title": "DATA ANALYST", "company": "U.S. Federal Government", "city state": "– District of Columbia", "rating": "3.8", "job description": "<strong>Education</strong>\n\n\n<ul>\n<li>Doctoral Degree</li>\n</ul>\n\n<strong>Skills</strong>\n\n\n<ul>\n<li>Excel</li>\n<li>Visual Basic</li>\n<li>R</li>\n<li>.Net</li>\n<li>Data Mining</li>\n</ul>\n\n<strong>Benefits</strong>\n\n\n<ul>\n<li>Flexible Schedule</li>\n</ul>\n\nDuties\n<br>\nSummary\n<br>\nThis position is part of the Overseas Private Investment Corporation (OPIC), Department of Financial and Portfolio Management (DFPM). As an Enterprise Data Analyst, the incumbent will new software tools and methodologies to creatively drive innovation by aligning analysis of corporate data to support management objectives and ress strategic challenges.\n<br><br>\n<strong>Responsibilities</strong>\n<br>\nAnalyze OPIC performance in terms of risk, productivity, and mission-achievement within a framework which aligns to management's strategic planning for resources and priorities established by the Board and the U.S. Government.\n<br>\nPerform accurate and timely reconciliations, compilations, and analyses of information and distribute to appropriate internal and external stakeholders.\n<br>\nDevelop visualizations, presentations, and other communications to convey insights from analysis.\n<br>\nLead the DFPM internal and external performance measurement development and maintenance process to include establishing data definitions, developing sound measure methodologies, and managing the quality assurance reviews of performance data.\n<br>\nSupport the planning and implementation of technology and software supporting financial management and data analysis. Maintain awareness of data analysis tools and promote the adaptation and adoption of these tools into the OPIC environment.\n<br>\nResearch, analyze, and evaluate information relevant to a portfolio of financial products, accounting and financial statement data, risk information, factors relating to present value estimates, and indicators of mission-value such as development.\n<br>\nTravel Required\n<br>\nNot required\n<br><br>\nSupervisory status\n<br>\nNo\n<br><br>\nPromotion Potential\n<br>\n<strong>13</strong>\n<br><br>\nJob family (Series)\n<br>\n0301 Miscellaneous Administration And Program\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n<strong>Requirements</strong>\n<br>\nConditions of Employment\n<br>\nUS Citizenship is required.\n<br>\nSuitable for Federal employment, determined by background investigation.\n<br>\nDirect Deposit of pay is required.\n<br>\nSelective Service registration required for male applicants, unless exempt.\n<br>\n<strong>Qualifications</strong>\n<br>\nAt the GS-11 grade level, you must meet one of the following qualifications:\n<br><br>\nA. One year of specialized experience equivalent to at least the GS-9 level in the Federal service which includes experience ining analytical methods such as various modes of regression analysis; and experience in using a variety of software to analyze data, e.g., Microsoft Excel, Access and other common data management tools in support of data analysis; and experience in communicating the results of data analyses to a variety of stakeholders via reports that include charts and graphs, or in written and oral formats; or\n<br><br>\nB. A Ph.D. or equivalent doctoral degree; or three full years of progressively higher level graduate education leading to such a degree; or LL.M. in Data Science, Data Analytics, Management Science, Information Technology, or related field.\n<br><br>\nC. An equivalent combination of specialized experience and education as described above.\n<br><br>\n<strong>APPLICANTS WHO QUALIFY BASED ON SUBSTITUTION OF EDUCATION OR A COMBINATION OF EDUCATION AND EXPERIENCE MUST SUBMIT A COPY OF THEIR TRANSCRIPTS WITH THEIR APPLICATION PACKAGE.</strong>\n<br><br>\nAt the GS-12 grade level, you must meet the following qualifications:\n<br><br>\nApplicantsing at the GS-12 grade level must meet one year of specialized experience equivalent to at least the GS-11 grade level in the Federal service. Specialized experience is that which has equipped the applicant with the competencies to successfully perform the duties of the position, and that is typically in or related to the position to be filled.\n<br><br>\nSpecialized experience at this level includes experience ining analytical methods such as various modes of regression analysis; experience in using a variety of software to analyze data, e.g., Microsoft Excel, Access and other common data management tools in support of data analysis; limited experience ining less-common software languages in data management and mining - such as VBA (visual basic), python, or 'R' (*****************); experience analyzing financial statements (utilizing balance sheets, present value measures, concepts relating to loans and guarantees); and experience in communicating results of data analyses to a variety of stakeholders via reports that include charts and graphs, or in written and oral formats to convey insights from analyses.\n<br><br>\nAt the GS-13 grade level, you must meet the following qualifications:\n<br><br>\nApplicantsing at the GS-13 grade level must meet one year of specialized experience equivalent to at least the GS-12 grade level in the Federal service. Specialized experience is that which has equipped the applicant with the competencies to successfully perform the duties of the position, and that is typically in or related to the position to be filled.\n<br><br>\nSpecialized experience includes but is not limited to experienceing analytical methods across an organization, such as various modes of regression analysis; experience in performing data analysis and modeling with financial information; experience in using a variety of software to analyze data, e.g., Microsoft Excel, Access and other common data management tools in support of data analysis; experience analyzing financial statements (utilizing balance sheets, present value measures, concepts relating to loans and guarantees) and integrating market information to conduct high level analyses; experience in communicating results of data analysis in reports that include charts and graphs, or in written and oral formats to convey insights from analyses; and experience utilizing multiple less-common methods of unstructured data mining using python, VBA (visual basic) , or 'R' (*****************); and experience in developing and monitoring organizational performance measures.\n<br><br>\nOnly experience and education obtained by the closing date of this announcement will be considered.\n<br><br>\nA written test is not required.\n<br><br>\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). You will receive credit for all qualifying experience, including volunteer experience.\n<br>\n<strong>Education</strong>\n<br>\nIf qualifying based on EDUCATION you MUST provide transcripts or other documentation to support your educational claims. Unless otherwise stated: (1) official or unofficial transcripts are acceptable, or (2) you may submit a list with all of your courses, grades, semester, year, and credit for the course. All materials must be submitted by the closing date of the announcement.\n<br><br>\nOnly education from institutions which are accredited or preaccredited/candidate for accreditation may be used to meet education requirements.\n<br><br>\nFOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show that the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: *********************************************************************************************\n<br><br>\nitional information\n<br><br>\n<strong>Telework Suitability:</strong>\n<br>\nThe duties of this position are suitable for telework only during an emergency or natural disaster.\n<br><br>\n<strong>Stipulations of Employment:</strong>\n<br>\nSelection may require completion of a 1-year probationary period.\n<br><br>\n<strong>Work Schedule:</strong>\n<br>\nThis position allows for a flexible work schedule.\n<br><br>\n<strong>Miscellaneous:</strong>\n<br>\nThis position is covered by a Collective Bargaining Agreement (CBA).\n<br><br>\nOPIC uses E-Verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, please visit ***************************** .\n<br><br>\nThis position is being advertised concurrently with vacancy announcement # OPIC-19-MP-********MM using Merit Promotion procedures. If interested, refer to that announcement to determine if you meet merit promotion requirements and can to that announcement. NOTE: You must separately to each announcement in order to be considered under both.\n<br><br>\nThis vacancy announcement may be used to fill similar positions within 90 days.\n<br><br>\nIf selection is made below the full performance level, promotion up to the full performance level may be made without further competition. However, promotion(s) will depend on the performance of the incumbent and are not guaranteed.\n<br><br>\nIf you are unable to or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application: ************************************************************************************\n<br><br>\nHow You Will Be Evaluated\n<br>\nYou will be evaluated for this job based on how well you meet the qualifications above.\n<br><br>\nFor Category Rating: Once the application process is complete, qualified candidates will be assigned to a quality category. The category assignment is a measure of the degree in which your background matches the competencies required for this position. The categories for this announcement are defined as: Best-Qualified, Well-Qualified, and Qualified. Your resume and supporting documentation will then be used to determine if you are qualified for this job. If you rate yourself higher than is supported by your application materials, your responses may be adjusted and/or you may be excluded from consideration for this job. If you are found to be among the top candidates, you will be referred to the selecting official for employment consideration.\n<br><br>\nYour qualifications will be evaluated on the following competencies (knowledge, skills, abilities and other characteristics):\n<br><br>\nTechnical Competency - Data Gathering and Analysis\n<br>\nLeveraging Technology\n<br>\nWritten Communication\n<br>\nOral Communication\n<br>\nAttention to Detail\n<br><br>\nThe Category Rating Process does not veterans' preference points or the 'rule of three,' but protects the rights of veterans by placing them ahead of non-preference eligible within each category. Preference eligibles who meet the minimum qualification requirements and who have a compensable service-connected disability of at least 10 percent must be listed in the highest quality category (except in the case of scientific or professional positions at the GS-09 level or higher).\n<br><br>\nBackground checks and security clearance\n<br>\nSecurity clearance\n<br>\nPublic Trust - Background Investigation\n<br><br>\nDrug test required\n<br>\nNo\n<br><br>\nRequired Documents\n<br><br>\nRequired Documents\n<br>\nTo for this position, you must provide a complete Application Package which includes:\n\n\n<ul>\n<li>Your Resume listing work schedule, hours worked per week, dates of employment mm/yy and duties performed.</li>\n\n<strong><li>Other supporting documents:</li>\n</strong></ul><strong>\n\n</strong>\n<br>\nCollege transcript(s), if qualifying based on education or if this position has a basic education requirement\n<br>\nVeterans' Preference documentation, if applicable (e.g. DD-214 Member Copy 4 showing type of discharge/character of service, SF-15 Form and related documentation, VA letter, etc.)\n<br>\nCareer Transition Assistance Program/Interagency Career Transition Assistance Program Documentation, if applicable (e.g. Certification of Expected Separation, Reduction-In-Force Separation Notice, or Notice of Proposed Removal; SF-50 that documents the RIF separation action; and most recent performance appraisal.)\n<br>\nCover Letter, optional\n<br>\nIf you are a veteran with preference eligibility and you are claiming veterans' preference , you must submit a copy of your DD-214 or other proof of eligibility. If applicable, you must also submit an SF-15, 'Application for 10-Point Veterans' Preference' plus the proof required by that form. Failure to provide this documentation may result in a non preference determination. For more information on veterans' preference (see *********************************************************************************** ).\n<br>\nDo not submit photographs with your application package. Documents with photographs may not be seen by hiring officials - you must remove your image from any badges, licenses, etc.\n<br>\nDo not upload Adobe portfolio documents. Adobe portfolio documents are not viewable by our agency's staffing offices.\n<br><br>\nIt is your responsibility to ensure all required documents have been submitted prior to the closing date of the announcement.\n<br><br>\nCareer Transition Assistance Programs: These programs to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: 1) meet CTAP or ICTAP eligibility criteria; 2) be rated well-qualified for the position with a score of 85 or above; and 3) submit the appropriate documentation to support your CTAP or ICTAP eligibility. For more information: ************************************************************ .\n<br>\nIf you are relying on your education to meet qualification requirements:\n<br>\nEducation must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education .\n<br><br>\nFailure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\n<br><br>\n<strong>Benefits</strong>\n<br><br>\n<strong>Benefits</strong>\n<br>\nA career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Learn more about federal benefits .\n<br><br>\nReview our benefits\n<br><br>\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered."}