{"job title": "2019 PhD Data Scientist Internship - Risk", "company": "Uber", "city state": "– San Francisco, California", "rating": "4.3", "job description": "At Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 600 cities around the world. We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and lets move the world forward, together.\n<br><br>\nAbout the Role Were looking for PhD intern candidates to contribute to Risk data science in Summer 2019 (3 months) in our San Francisco and Palo Alto locations. We seek candidates with strong background in statistics, machine learning, computer science, and operations research. You will be embedded in a cross-functional team such as Payment Risk, and work closely with the engineers, risk analysts, and product managers under the supervision of a data scientist in that team. Youll be focused on modeling and algorithm development on a project defined by you and your mentor.\n<br><br>\nWhat You'll Do Work with your mentor closely to scope a project, define the problem, and develop and prototype the solutionWork alongside engineers, risk analysts and product managers to understand the business use cases and production feasibility of your work, and collaborate on the experimentation and productionisation of your workDevelop creative solutions to product problems using advanced mathematical algorithms such as machine learning and optimizationCommunicate with senior management and cross-functional teams Sample Projects Develop machine learning models to detect payment fraud and marketplace abuse on Ubers platformDevelop innovative features that leverage new sensor data and improve model performanceDevelop NLP and computer vision models for user experience improvementDevelop graph based features and machine learning models to identify bad actors What Youll Need Ph.D. student (anticipated graduation in 2020) majoring in Computer Science, Statistics, Operations Research, or any other quantitative disciplinesExperience in modeling and algorithm developmentCoding proficiency and the ability to develop statistical analysis and prototype algorithms in Python or R. Proficiency in Java is a plusAbility to communicate effectively with both technical and business stakeholders About the Team The Risk Data Science team develops machine learning models to support multiple Uber business lines (Rides, Eats, U4B, etc). We are responsible for identifying bad actors while providing magical experiences to good riders and drivers. Our team works together with product managers, engineers, and risk analysts. As a member of our team, you'll protect Uber's riders and drivers by bringing state of the art technology to bear on the world's richest dataset about how people move. You will experiment with a range of machine learning techniques including supervised, unsupervised and active learning approaches (e.g., tree-based models, CNN, LSTM, and DBSCAN), and tackle a variety of interesting and challenging problems including computer vision, NLP, knowledge graph, identity and reputation scores, mobile sensor and GPS feature development. You can learn more about us through this blog post:Advanced Technologies for Detecting and Preventing Fraud at Uber"}