{"job title": "Data Scientist - Experimentation", "company": "Uber", "city state": "– San Francisco, California", "rating": "4.3", "job description": "At Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 600 cities around the world. We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and lets move the world forward, together.\n<br><br>\nWho is the Experiment team?Experimentation at Uber starts with A/B testing but continues to peekable A/B tests, Multi-Armed Bandits, and much more! We're developing tools that allow Uber to test things like dispatching, ride sharing, and dynamic pricing algorithms applied to a real-time, stochastic marketplaces around the globe. We're looking for experienced scientists and experimentalists who're comfortable working in cross-functional teams of engineers, scientists, and product professionals to address projects that sit at the intersection of infrastructure, data science, and our business operations.What you'll doDevelop statistical models/analysis and apply them into solving real-time problemsPartner with Software Engineering and Product Management teams to create internal infrastructure and programs in a large scaleAct as a mentor to the rest of the team members, be a team player, teach others to be a team player.Define key business metrics for experimentation and running large scale experiments that deliver impactful results to the businessDesign metrics and develop SQL queries to generate reportsGuide the product teams through data-driven recommendationsAutomate analysis and pipelines via SQL and python based ETL framework.\n<br><br>\nHere are the kinds of skills we're looking for:A graduate degree or equivalent in applied statistics, computer science or a quantitative domain2+ years working experience delivering, scaling, and owning highly successful and innovative experiments and data science productsExperience with big data using technologies like Hadoop, Hive, and SparkExperience with a variety of relevant data manipulation languages (Python, R, SQL)Great communication skills PerksEmployees are given Uber credits every month.The rare opportunity to change the way the world moves. We're not just another social web app, we're moving real people and assets and reinventing transportation and logistics globally.Smart, engaged co-workers. Benefits401(k) plan, gym reimbursement, nine paid company holidays.Full medical/dental/vision package to fit your needs.Unlimited vacation policy; take time when you need it. Be sure to check out the Uber Engineering Blog to learn more about the team."}