{"job title": "Programming Systems Research Scientist", "company": "Uber", "city state": "– Palo Alto, California, United States", "rating": "4.3", "job description": "At Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 600 cities around the world.\n<br><br>\nWe welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let’s move the world forward, together.\n<br><br>\n<strong>About the Role</strong>\n<br><br>\nUber Engineering is growing quickly as we look to tackle some exciting opportunities at scale and in challenging regions around the world. As we grow our team and code base, there is a growing need for automatic analysis tools to keep our code quality and performance high while ensuring our engineers can continue to move fast. To support this need, the Programming Systems Group is looking for talented, experienced engineers to build new compiler and static analysis tools and apply them to Uber's code base.\n<br><br>\nThe team is aiming to build tools to improve performance and reliability across a variety of languages, including Java (mobile and backend), Swift, and Go. The work includes a mix of both building or extending core infrastructure and developing new optimizations / analyses targeted at key issues. Recent work by the team includes the NullAway tool for preventing null pointer crashes and upstreamed changes to the Swift compiler to improve specialization of protocol-based code. In general, we like to make our tools open source and publish papers on our work in academic conferences and blogs.\n<br><br>\nTo succeed in this position, you will have a solid understanding of state-of-the-art program analysis techniques and experience in developing static analyses or compiler optimizations. You should also be passionate about writing clean, efficient, and well-tested code.\n<br><br>\n<strong>What You’ll Do</strong>\n<br><br>\nTo succeed in this position, you will have a solid understanding of state-of-the-art program analysis techniques and experience in developing static analyses or compiler optimizations. You should also be passionate about writing clean, efficient, and well-tested code.\n<br><br>\n<strong>What You’ll Need</strong>\n<ul>\n<li>\n\n<ul>\n<li>PhD in Computer Science, Computer Engineering or related field</li><li>Previous experience with compiler optimization, static analysis, or dynamic analysis</li><li>Solid understanding of modern program analysis techniques</li><li>Excellent coding skills and software design skills</li></ul>\n\n<ul>\n<li>Published papers in program analysis or code optimization</li></ul></li>\n</ul>"}