{"job title": "Data Analyst I, Safety and Insurance", "company": "Uber", "city state": "– San Francisco, California", "rating": "4.2", "job description": "At Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 600 cities around the world.\n<br><br>\nWe welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let’s move the world forward, together.\n<br><br>\n<strong>ABOUT THE ROLE</strong>\n<br><br>\nWe're looking for a data analyst to join our Safety and Insurance Analytics team to provide data expertise as we work to make this world a safer place to move around. In this role you'll be part of and work closely with a cross-functional team consisting of engineers, product managers, lawyers, and other data scientist/analysts to support regulatory and legal data requests. This role will complete critical data requests in a timely and high quality fashion and be able to clearly communicate findings and concerns to key stakeholders. Additional opportunities will include deep dive analysis to understand root causes for safety issues and propose solutions to these issues.\n<br><br>\n<strong>WHAT YOU’LL DO</strong>\n<ul>\n<li>Support Uber’s rapidly growing and unique safety and insurance operations</li><li>Build and own periodic reporting - Take advantage of the ever-growing amount of data we have at our fingertips to help stakeholders all over the world manage and improve our operations</li><li>Deep dive to discover root causes for safety issues and changes in trends</li><li>Collaborate cross-functionally to develop interventions that address incidents and root causes</li><li>Effectively communicate results with key stakeholders</li>\n</ul>\n<strong>WHAT WE’RE LOOKING FOR IN YOU</strong>\n<ul>\n<li>2+ years of data analytics experience on a global scale</li><li>BA/BS in Economics, Finance, Math, Statistics, or similar</li><li>Strong data skills and a shown ability to use tools such as Excel, SQL, Python, and R to work efficiently at scale</li><li>Experience with Hive, Spark, and other big data tools a plus</li><li>Experience with A/B testing or Statistical Modeling a plus</li><li>Great communication skills with the ability to build relationships with key stakeholders</li><li>Balance attention to detail with swift execution</li><li>Self-driven with the ability to work in a self-guided manner</li><li>Enthusiasm about Uber!</li>\n</ul>"}