{"job title": "Data Scientist - Driver Fleet (Seattle)", "company": "Uber", "city state": "– Seattle, Washington", "rating": "4.3", "job description": "At Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 600 cities around the world.\n<br><br>\nWe welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let’s move the world forward, together.\n<br><br>\nThe Driver team at Uber is focused on accelerating driver growth, engagement, and retention across 300+ cities worldwide. Data Scientists on Driver play a central role in guiding product development and strategy through the discovery of insights from data. In this position, you will offer a data-driven perspective and work closely with product, engineering, and marketing. You will be on the forefront of analysis and leverage our data sources to propose new ideas related to every area of our product, including developing predictive models of driver behavior, studying market balance and developing a growth model in the context of a two-sided market, creating experiment designs for product changes with difficult constraints (e.g. extensive product network effects). Our team's autonomy gives us the flexibility to focus on the highest-impact projects in this adaptive and challenging role as we bring increasing numbers of riders and drivers onto the Uber platform.<br><br><strong>What you'll do</strong>\n\n<ul>\n<li>Leverage data to perform intensive analysis across all areas of our business to catalyze product development</li><li>Apply machine learning techniques to solve real world complex problems</li><li>Perform time-series analyses, hypothesis testing, and causal analyses to statistically assess relative impact and extract trends</li><li>Design experiments and interpret the results to draw detailed and actionable conclusions</li><li>Create models to enhance understanding of user behavior and predict future performance of cohorts</li><li>Generate and execute on ideas for exploratory analysis to shape future projects and provide recommendations for actions</li><li>Define KPIs, create dashboards and reports to regularly communicate results by building data pipeline and monitoring data quality</li><li>Collaborate with cross-functional teams across disciplines such as product, engineering, operations, and marketing</li>\n</ul>\n\n<strong>What you'll need</strong>\n\n<ul>\n<li>At least 2 years of working experience in a quantitative analysis role</li><li>Master in Economics, Operation Research, Statistics, Computer Science, Engineering, or other quantitative field</li><li>Ability to write code and contribute to a code base in Python or R</li><li>Experience writing and understanding complex SQL; experience working with large data sets</li><li>Experience in experimentation - A/B, sequential and multi-armed bandit</li><li>Good understanding of machine learning and statistical modeling</li><li>Collaborate closely with cross-functional teams to execute on decisions</li><li>Excellent communication and presentation skills</li><li>Experience in incentive mechanism design and/or reward program preferred</li>\n</ul>"}