{"job title": "Analytics Data Scientist", "company": "UCHealth", "city state": "– Denver", "rating": "3.9", "job description": "<div> <div><strong>Facility:</strong></div> UCHealth</div> <div> <div><strong>Department:</strong></div> UCHlth Epic Data Analytics</div> <div> <div><strong>Schedule:</strong></div> Full-time</div> <div> <div><strong>Shift:</strong></div> 1st Shift - Days</div> <div> <div><strong>Scheduled Days &amp; Hours:</strong></div> M-F 8:00 - 5:00</div> <div> <div><strong>Requisition number:</strong></div> 82083</div>\n\n<br><strong>ANALYTICS DATA SCIENTIST</strong>\n<br><br>\nSeeking a Data Scientist that will help us discover the information concealed in vast amounts of data and help us make more informed decisions to deliver even better patient care. You will support our executive leaders, physicians, nurses, and practice management teams with insights gained from analyzing patient and company data. The ideal candidate is adept at identifying opportunities for improving patient health, optimizing care delivery processes, and modeling the effects of interventions. You must have strong experience and expertise building and implementing models, algorithms, and simulations using a variety of methods and tools. You must have a proven ability to drive business results with data-based insights. You must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.\n<br><br>\nYour primary focus will be in applying data mining techniques, doing statistical analysis, and building high quality prediction systems integrated with our products.\n<br><br>\n<strong>At UCHealth, we do things differently</strong>\n<br><br>\nWe believe in something different: a focus on the individuality of every person. In big ways and small, we exist to improve the extraordinary lives of all those we serve. As Colorado's largest and most innovative health care system, we as a team deliver on the commitment to provide the best possible experience for our patients and their families. We foster a true human connection and give people the freedom to live extraordinary lives. A career at UCHealth is more than a job, it's a passion.\n<br><br>\n<strong>Job Duties</strong>\n<br><br>\n· Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.\n<br><br>\n· Assess the effectiveness and accuracy of new data sources and data gathering techniques.\n<br><br>\n· Develop custom data models and algorithms to apply to data sets.\n<br><br>\n· Apply predictive modeling in a variety of applications, including forecasting, risk modeling and scoring, process optimization, and decision support.\n<br><br>\n· Develop company A/B testing framework and test model quality.\n<br><br>\n· Coordinate with different functional teams to implement models and monitor outcomes.\n<br><br>\n· Develop processes and tools to monitor and analyze model performance and data accuracy.\n<br><br>\n· Selecting features, building and optimizing classifiers using machine learning techniques\n<br><br>\n· Data mining using state-of-the-art methods\n<br><br>\n· Extending company's data with third party sources of information when needed\n<br><br>\n· Enhancing data collection procedures to include information that is relevant for building analytic systems\n<br><br>\n· Processing, cleansing, and verifying the integrity of data used for analysis\n<br><br>\n· Doing ad-hoc analysis and presenting results in a clear manner\n<br><br>\n· Creating automated anomaly detection systems and constant tracking of its performance\n<br><br>\n<strong>Required</strong>\n<br><br>\n· High School Diploma or GED\n<br><br>\n· 5 years of relevant experience\n<br><br>\n<strong>Preferred</strong>\n<br><br>\n· Experience using statistical computer languages (R, Python, etc.) to manipulate data and draw insights from large data sets.\n<br><br>\n· Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\n<br><br>\n· Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\n<br><br>\n· Experience working with and creating data architectures.\n<br><br>\n· We're looking for someone with 5-7 years of experience manipulating data sets and building statistical models, has a Master's or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools:\n<br><br>\no Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, time series forecasting etc.\n<br><br>\no Good applied statistics skills, such as distributions, statistical testing, regression, etc.\n<br><br>\no Experience querying databases and using statistical computer languages: SQL, R, Python, etc.\n<br><br>\no Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.\n<br><br>\no Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.\n<br><br>\no Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.\n<br><br>\no Experience with common data science toolkits, such as R, NumPy, SciPy, and TensorFlow. Excellence in at least one of these is highly desirable\n<br><br>\no Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.\n<br><br>\no Experience visualizing/presenting data for stakeholders using: D3, GGplot2, matplotlib, PowerBI, etc.\n<br><br>\no Experience using web services: Redshift, S3, Spark, MS Azure, Google Cloud Platform, etc.\n<br><br>\no Good scripting and programming skills\n<br><br>\n· A drive to learn and master new technologies and techniques.\n<br><br>\n· Excellent written and verbal communication skills for coordinating across teams.\n<br><br>\n· Data-oriented personality\n<br><br>\nGoing beyond quality requires the perfect balance of talent, integrity, drive and intellectual curiosity. We are looking for individuals who recognize, like us, that the world of medicine is ever-changing and are motivated to do what is right, not what is easy. We support creativity and curiosity so that each of us can find the extraordinary qualities within ourselves. At UCHealth, we'll do everything in our power to make sure you grow and have a meaningful career. There's no limits to your potential here.\n<br><br>\n<strong>Be Extraordinary. Join Us Today!</strong>\n<br><br>\nUCHealth recognizes and appreciates the rich array of talents and perspectives that equal employment and diversity can offer our institution. As an affirmative action/equal opportunity employer, UCHealth is committed to making all employment decisions based on valid requirements. No applicant shall be discriminated against in any terms, conditions or privileges of employment or otherwise be discriminated against because of the individual's race, creed, color, religion, gender, national origin or ancestry, age, mental or physical disability, sexual orientation, gender identity, transgender status, genetic information or veteran status. UCHealth does not discriminate against any \"qualified applicant with a disability\" as defined under the Americans with Disabilities Act and will make reasonable accommodations, when they do not impose an undue hardship on the organization.\n<br><br>\nIND123\n<br><br>\n#GD1"}