{"job title": "Senior Data Scientist - Data Products", "company": "Udemy", "city state": "– San Francisco, CA", "rating": "4.4", "job description": "<div><strong>JOB DESCRIPTION</strong></div><div>From building the worlds most comprehensive knowledge graph to enabling content discovery across Udemys catalog of over 65,000 courses, data scientists at Udemy develop the algorithms and models that drive Udemys two-sided marketplace by combining software engineering best practices with rigorous quantitative approaches.</div><br>\n<div>As a senior data scientist in data products at Udemy, youll be partnering with product managers, designers, and engineers to build algorithmic and model-driven solutions to power data products that affect the user experience. Success in this role requires a combination of product intuition, data analysis skills, machine learning knowledge, and the coding chops to dive head first into development on production systems.</div>Responsibilities:\n\n<ul>\n<li>Collaborate with product managers, designers, and engineers to scope and build data products</li><li>Perform statistical analysis, key metrics, and feature engineering for data products</li><li>Develop production-grade data pipelines to power ML-based data products</li><li>Design and analyze experiments and monitor performance of data products</li><li>Proactively influence product prioritization through data-driven insights</li><li>Provide technical mentorship for other team members</li><li>Build Udemys technical brand through talks, blog posts, and publications</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>3+ years of experience building complex data products</li><li>5+ years of hands-on industry experience in a data science-oriented role</li><li>Ability to communicate effectively with non-technical stakeholders</li><li>Strong knowledge of statistics, machine learning, and natural language processing</li><li>Proficiency with SQL and 1+ programming languages (e.g., Python or Scala)</li><li>Familiarity with standard software engineering practices and distributed computing</li><li>Experience using big data technologies (e.g., Hadoop, Spark)</li>\n</ul>\n\n<div><strong>ABOUT UDEMY</strong></div><div>With a mission to improve lives through learning, Udemy is a global marketplace for learning and teaching online. More than 24 million students learn from an extensive library of over 80,000 courses taught by 35,000 instructors in over 50 languages. Whether learning for professional development or personal enrichment, students can master new skills through self-paced, on-demand courses, while instructors have a way to share their knowledge with the world. For companies, Udemy for Business offers subscription access to a collection of business-relevant courses as well as a simple platform to host and distribute their own content in one central place.</div><br>\n<div>Were a close-knit bunch that enjoys problem-solving and collaboration, and we share a serious commitment to delivering the best possible learning and teaching experiences. Udemys culture encourages innovation, creativity, passion, and teamwork. We also celebrate our milestones and support each other every day.</div><br>\n<div>Founded in 2010, Udemy is privately owned and headquartered in San Franciscos SOMA neighborhood with offices in Dublin, Ireland, Sao Paulo, Brazil, and Ankara, Turkey. Compensation includes full-time salary, equity compensation plan, and competitive benefits including healthcare, commuter benefits, parental leave, and a discretionary time off policy.</div><br>\n<div><strong>Udemy in the News:</strong></div><div>Enough With The Millennial Bashing - Kevin Johnson</div><div>5 Benefits of Building a Learning Culture</div><div>Algorithms are coming for their jobs, so workers are teaching themselves algorithms</div><div>Udemy's 2018 Workplace Distraction Report</div>"}