{"job title": "Data Scientist", "company": "UL", "city state": "– Northbrook, Illinois", "rating": "NA", "job description": "Overview\n<br><br>\n<strong>Contribute to a Safer, More Secure, and More Sustainable World.</strong> At UL, we know why we come to work. Thousands of us around the world wake up every day with one common purpose - to make the world a safer, more secure, and more sustainable place to live. We clear the way for our customers to introduce the latest products, technological advances, and systems in an increasingly complex world so they can provide peace of mind to the market. Our integrity is woven throughout our company and shapes the way we approach and deliver our solutions. We are proud that the work we do every day has a meaningful contribution to society. We continue to build upon our legacy of trusted expertise and partnership to keep our communities safe and secure as we march forward into the future. This helps us to sleep better at night, and we are confident that the millions of people we touch rest easier too.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nThe Associate Data Scientist will develop programs to collect, clean, and analyze data from the web and other digital sources. Performs statistical analysis on collected data to identify, validate and quantify trends or patterns based on guidance from business or research leaders. Uses mathematical concepts and theories to identify how patterns in data can support solutions to business problems.\n<br><br>\n<strong>Job Responsibilities</strong>\n\n<ul>\n<li> Identifies sources of credible data and develops necessary scripts to retrieve data from a variety of digital formats.</li> <li> Cleanses and transforms data to provide initial structure using appropriate methods for each data type, e.g. Efficiently applies a set of regular expressions to cleanse text data.</li> <li> Leverages natural language processing (NLP) techniques with statistical methods to provide and initial assessment of language content within a document.</li> <li> Conducts analysis of inter-connected information between datasets with efficient scripting and visualization methods.</li> <li> Executes existing data models and validates results in accordance with new or modified data; records results into an organized report.</li> \n</ul>\n\n<strong>Qualifications</strong>\n\n<ul>\n<li> University Degree (Equivalent to Bachelor's degree) in Computer Science, Mathematics, Statistics or a related discipline plus generally two years of experience in data and statistical analysis</li> <li> Working knowledge of Python; experience with numerical analysis using R or Matlab</li> <li> Knowledge of markup languages HTML, XML and structured data types JSON</li> <li> Demonstrated experience in statistical analysis and applying the scientific method</li> <li> Familiar with common data analysis / machine learning frameworks; e.g. SciKit-Learn, Pandas, NLTK, Tensorflow, Theano, etc.</li> <li> Excellent communication skills, can relate technical concepts to a general audience</li> <li> Knowledge of Unix and application logic language skills including Python, R, Scala, Java, C++, and C#</li> \n</ul>\n\nApplicants must be currently authorized to work in the United States on a full-time basis without sponsorship both now and in the future.\n<br><br>\nApplicants must be able to relocate without financial assistance.\n<br><br>\n<strong>#CB</strong>\n<br><br>"}