{"job title": "Data Scientist - Artificial Intelligence", "company": "Ulta Beauty", "city state": "– Bolingbrook, IL", "rating": "3.2", "job description": "The Data Scientist is an integral part of the Marketing Analytics team that utilizes the power of Artificial Intelligence to drive customer personalization and marketing effectiveness. This position will build machine learning applications, conduct statistical analyses and construct large scale prediction systems in a fast-paced, data-focused retail environment. The Data Scientist will also act as a subject matter expert, communicating the value and application of artificial intelligence across multiple internal business groups.\n<br><br>\n<strong>PRINCIPAL JOB DUTIES &amp; RESPONSIBILITIES</strong>\n<br><br>\n1. Design and develop autonomous programs that optimize marketing tactics and generate efficiencies across the organization.\n<br><br>\n2. Develop a strong partnership and collaboration with the internal Ulta Beauty teams, performing as a team member who consults on how to attain the business goals by leveraging artificial intelligence and machine learning.\n<br><br>\n3. Select features, construct and enhance classifiers using machine learning techniques\n<br><br>\n4. Solve business problems by leveraging advanced artificial intelligence and machine learning approaches\n<br><br>\n5. Explain and present complex approaches in a concise manner to garner buy in from business partners\n<br><br>\n6. Assess and understand the cost/benefit relationship of developing and deploying learned models based on business needs\n<br><br>\n7. Ensure data integrity by leveraging proven methodologies, including data reconciliation, data integration and data audits.\n<br><br>\n8. Mentor less experienced team members on AI/machine learning methodology and techniques<br><br>Requirements\n\n<ul>\n<li>5+ years experience in artificial intelligence with a focus on machine learning and neural networks</li><li>Masters degree in Computer Science, Data Science, Mathematics, or Statistics or related degree.</li> <li>Experience in cloud computing platforms such as Google Cloud Platform</li><li>Experience with deep learning framework (ex: Tensorflow, Torch, etc)</li><li>Proven command of R or Python or Java</li><li>Excellent interpersonal, verbal, and written communication skills - must be able to communicate complex ideas in both technical and user-friendly language.</li> <li>Excellent understanding of machine learning techniques and algorithms</li><li>Experience using statistical computer languages to manipulate data and draw insights from large data sets.</li><li>Capable of working in a dynamic environment, handling multiple projects, meeting deadlines, prioritizing appropriately and responding to issues quickly and creatively with an open and positive attitude.</li> <li>Advanced knowledge of statistical techniques and concepts (regression, statistical tests and proper usage, etc.) and experience with their application</li> <li>Energetic and self-motivated - must be extremely organized and detail oriented with an ability to make proactive recommendations.</li> \n</ul>\n<strong>PREFERRED OR SPECIAL POSITION REQUIREMENTS</strong>\n<ul>\n<li>Experience building and deploying autonomous/AI programs</li><li>Cloud/Big Data platforms</li><li>Tensorflow or similar tool</li><li>R, Python, Java</li><li>Must be able to see the “big picture” and drive towards business results</li><li>Strong sense of curiosity.</li><li>Strong attention to detail.</li>\n</ul>\n<strong>WORKING CONDITIONS</strong>\n<ul>\n<li>Dynamic, fast-paced office environment and remote stakeholders.</li><li>Occasional training/conference travel possible.</li>\n</ul>\n\n<br>"}