{"job title": "Sr. Business Intelligence Analyst", "company": "Ulta Beauty", "city state": "– Bolingbrook, IL", "rating": "3.2", "job description": "<div><div><div><div><div>\n<div><strong>Date Posted:</strong></div>11/18/2018</div><br>\n\n<div>\n<div><strong>Address:</strong></div>1000 Remington Blvd</div><br>\n\n<div>\n<div><strong>City:</strong></div>Bolingbrook</div><br>\n\n <div>\n<div><strong>State:</strong></div>IL</div><br>\n\n <div>\n<div><strong>Category:</strong></div>Supply Chain</div><br>\n\n<div>\n<div>Description</div> \n<br>\n <div><strong>GENERAL SUMMARY &amp; SCOPE</strong>\n<br><br>\nThe Sr. Business Intelligence Analyst will be responsible for the design, development, and implementation of data models and reporting solutions that meet business reporting and analytical objectives for DC Operations, Supplier Operations, and Transportation. In additional, he/she will also be responsible for helping to establish efficient processes to maintain data models, ensure data accuracy and stability. This individual will serve as a liaison between IT and business to actualize data requests and functional delivery of business reporting needs. The candidate will own reporting projects from end to end (gathering business requirement to deployment and fixes) and manage ad-hoc requests. This person must be able prioritize task and proactively communicate priorities.\n<br><br>\n<strong>PRINCIPAL JOB DUTIES &amp; RESPONSIBILITIES (*Essential Functions)</strong>\n<br><br>\n1. Develop data models to support merchandising, planning, and inventory reporting and analytical needs\n\n\n<ul>\n<li>Create reports and dashboards to measure and inform business partners on KPI’s and metrics\n<br><br>\n3. Partner with I.T. on data requirements needed to support the build of data models</li>\n<li>Partner with business teams to gather, document and maintain business requirements that will inform data modeling decisions\n<br><br>\n5. Partner with business to determine information needs and identify system requirements to ensure the use of business intelligence applications enhance business decision making.\n<br><br>\n&nbsp;</li></ul></div>\n\n\n\n\n</div><br>\n\n<div>\n<div>Minimum Requirements</div> \n<br>\n <div><strong>JOB REQUIREMENTS</strong>\n<ul>\n<li>Bachelor’s degree from an accredited college in Computer Science, Information Technology or Technical Programming</li><li>5-7 years of experience building data models, reports and dashboards</li><li>Advanced SQL experience</li><li>Experience building data visualizations using Tableau, Design Studio, Lumira, and other front end visualization tools</li><li>Strong experience using SAP business object reporting tools</li><li>Experience with SAP HANA application</li><li>Strong interpersonal, presentation and relationship building skills</li><li>Ability to conform to shifting priorities, demands and timelines while using analytical and problem solving capabilities</li><li>Ability to effectively self-prioritize and execute tasks in a high-pressure, fast-pace environment</li>\n</ul>\n<strong>PREFERRED OR SPECIAL POSITION REQUIREMENTS</strong>\n<ul>\n<li>Capability to translate technical concepts into non-technical terms to business owners in a clear and concise manner</li> <li>Strong process and system acumen</li><li>Knowledge of Distribution Center Operations, and Transportation within a retail environment</li>\n</ul>\n&nbsp;\n<br><br>\n<strong>WORKING CONDITIONS</strong>\n<ul>\n<li>Travel – Minimal ~ 10%</li><li>Ability to work long hours and weekends during critical periods</li></ul></div>\n</div>\n</div><br>\n\n<div>\nApply Now</div>\n</div><br>\n\n<div>\n<div>\n<ul>\n\n<li>\n<br><br>\nBack to Results</li>\n<br><br>\n<li>Save this Job</li>\n<br><br>\n<li>Refer this Job</li>\n</ul><br>\n\n<div>\nApply Now</div>\n</div>\n</div>\n </div>\n</div>\n\n<br>"}