{"job title": "SENIOR DATA SCIENTIST", "company": "Ultimate Software", "city state": "– San Francisco, California", "rating": "4.6", "job description": "Here at Ultimate Software, we use data science to make people's work lives better. We're a nimble, sharp, and passionate team looking for data scientists who want machine learning and statistical analysis to have a real impact on how work happens within organizations. Among other projects, you’ll work on using Natural Language Processing on performance reviews to identify employees’ true strengths, creating methods for statistical analysis on employee surveys to understand how workplaces could be improved, and building machine learning models to predict workforce dynamics such as attrition and productivity.\n<br><br>\nHere at Ultimate Software, we truly put our people first. We strongly believe in teamwork, and we encourage and trust our people to reach higher, learn more, and live up to their potential. Ultimate is ranked #1 on Fortune's“Best Places to Work in Technology” for 2018 and #3 on the“100 Best Companies to Work For” list in 2018. Ultimate is also ranked #1 on the Fortune’s“100 Best Workplaces for Millennials” for 2017 and #3 on its \"Best Workplaces for Diversity” list for 2017.\n<br><br>\n<strong>Primary/Essential Duties and Key Responsibilities:</strong>\n<ul>\n<li>Work with other data scientists and engineers to collect and categorize big data for predictive analytics and other statistical functionality of our enterprise software platform</li><li>Build data processing pipelines to analyze structured and unstructured text</li><li>Build tools to label and analyze survey data, extracting useful information from natural language text documents</li><li>Design and architect software; write production code</li><li>Experiment and prototype new ideas</li><li>Meet with clients to stay in touch with the needs of the user</li><li>Work with product and design teams to plan how to communicate data insights to non-experts</li>\n</ul>\n<strong>Required Qualifications:</strong>\n<ul>\n<li>2-3 years of experience in full stack data science including NLP product architect, data collection, data labeling, data quality validation, algorithm design, development, testing and productization</li>\n</ul>\n(Experience, Education, Certification, License and Training)\n<ul>\n<li>Major in computer science, statistics, industrial/organizational psychology, linguistic, artificial intelligence, or related field (or equivalent experience)</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n<ul>\n<li>Passion for machine learning, natural language processing, or statistical modeling</li><li>Hands-on experience with python coding, and data processing</li><li>A desire to bring data-driven decision-making and analytics to improve people's lives at work</li><li>Curiosity, friendliness, and a desire to collaborate with a dynamic team</li>\n</ul>\n<strong>Physical Requirements:</strong>\n<ul>\n<li> No unique physical demands are required for this job.</li>\n</ul>\n<strong>Travel Requirements:</strong>\n<ul>\n<li>Occasional travel may be expected</li>\n</ul>\nThis job description has been written to provide an accurate reflection of the current job and to include the general nature of work performed. It is not designed to contain a comprehensive detailed inventory of all duties, responsibilities, and qualifications required of the employees assigned to the job. Management reserves the right to revise the job or require that other or different tasks be performed when circumstances change.\n<br><br>\nUltimate Software will reasonably accommodate employees with disabilities as defined by the Rehabilitation Act of 1973, the Americans with Disabilities Act (ADA) and other appropriate statutes."}