{"job title": "Frontline Reporting &amp; Analytics Manager", "company": "Umpqua Bank", "city state": "– Portland, OR", "rating": "3.2", "job description": "<strong>JOB PURPOSE</strong>\n<br><br>\nDeliver and discover essential business information for executive management, leadership and associates. This position manages a team of Analysts that will be the central hub for understanding, defining and efficiently reporting data and business insights for all lines of business within Core Banking.\n<br><br>\n<strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong>\n\n\n<ul>\n<li>Manage and direct day to day activities of the Frontline Data and Reporting Analyst team to ensure that all timelines are met, and quality work is performed.</li>\n<li>Coach and develop talent while driving the team's vision, purpose and results.</li>\n<li>Takes personal initiative and is a positive example for Analysts to emulate.</li>\n<li>Proactively analyzes business trends and drivers providing recommendations to support business decisions.</li>\n<li>Review, consolidate and enhance current report set to ensure it meets business needs.</li>\n<li>Identify and communicate positive and negative trends to leadership for strategy and problem resolution.</li>\n<li>Work with Centralized Reporting and Customer Analytics to ensure that the Bank has a comprehensive information set to support day to day functions in Core Banking.</li>\n<li>Assess and optimize existing analytics tools and techniques, select best in class tools and technologies to support overall Data Analytics strategy.</li>\n<li>Work in partnership with other analytics teams at the Bank to create a common and centralized set of data definitions that reflect the core drivers of the business.</li>\n<li>Demonstrates compliance with all bank regulations for assigned job function and applies to designated job responsibilities -- knowledge may be gained through coursework and on-the-job training. Keeps up to date on regulation changes.</li>\n<li>Follows all Bank policies and procedures, compliance regulations, and completes all required annual or job-specific training.</li>\n<li>Maintain a working knowledge of Bank's written policies and procedures regarding Bank Secrecy Act, Regulation CC, Regulation E, Bank Security and other regulations as applicable to this job description.</li>\n<li>Embraces our vision to become \"The World's Greatest Bank.\"</li>\n<li>May perform other duties as assigned.</li>\n</ul>\n\nSUPERVISORY RESPONSIBILITIES 4+ employees\n<br><br>\n<strong>REQUIRED KNOWLEDGE, SKILLS AND ABILITIES</strong>\n\n\n<ul>\n<li>Requires bachelor's degree in business, finance, or accounting.</li>\n<li>More than 5+ years of progressively growing responsibilities with a strong focus on data analysis and reporting and 3-5 years of supervising and directing technical associates performing complex tasks.</li>\n<li>Experience developing processes, leading people and driving initiatives toward common goals.</li>\n<li>Experience with data stores, data architecture, data management, data visualization, and data analytics.</li>\n<li>Experience implementing data management processes and new applications a plus.</li>\n<li>Demonstrated ability to provide actionable insights from data and make recommendations for improved business performance.</li>\n<li>Ability to analyze and extract key trends from large data sets.</li>\n<li>Ability to present to large/executive audiences in a clear and concise manner.</li>\n<li>Experience negotiating difficult subjects between multiple executive stakeholders with different agendas.</li>\n<li>Proven experience of driving results, customer focus, managing complexity, dealing with ambiguity and strong verbal and written communication skills.</li>\n<li>Advanced understanding of Microsoft Office product suite with proficient use of Microsoft Excel, PowerPoint, and Word. Proficiency in Excel and SQL; previous experience with data visualization tools or languages (Visio, Tableau, Power BI or VBA).</li>\n</ul>\n\n<strong>PHYSICAL AND ENVIRONMENTAL DEMANDS</strong>\n\n\n<ul>\n<li>Office environment -- no specific or unusual physical or environmental demands.</li>\n<li>Occasional travel.</li>\n</ul>\n\nUmpqua Bank is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, protected veteran status, or disability. We maintain a drug-free workplace and may perform pre-employment substance abuse testing.\n\n\n<ul>\n<li>LI-UP</li>\n</ul>"}