{"job title": "Data Analyst &amp; Tessitura Administrator", "company": "UNC-Chapel Hill", "city state": "– Chapel Hill, NC", "rating": "4.0", "job description": "<div>\n \n <div>\n <div>\n \n\n\nClassification Title:\n\n\n \n </div>\n <div>\n\n \n \n Data Analyst &amp; Tessitura Administrator\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nWorking Title:\n\n\n \n </div>\n <div>\n\n \n \n Data Analyst &amp; Tessitura Administrator\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nCampus:\n\n\n \n </div>\n <div>\n\n \n \n UNC-Chapel Hill\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nRegion:\n\n\n \n </div>\n <div>\n\n \n \n Piedmont/Triangle\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nJob Summary:\n\n\n \n </div>\n <div>\n\n \n \n This position serves as the primary data analyst for Carolina Performing Arts as well as the database administrator of the Tessitura patron management application, working collaboratively with the Marketing and Development teams to fully utilize CRM data, generate custom reports, and analyze data in order to support decision making and inform conclusions related to sales and fundraising. The Data Analyst &amp; Tessitura Administrator ensures the ongoing health of the Tessitura databases and ancillary systems including but not limited to our website, e-blast client, business intelligence tools, and Tessitura integrations and ensures Tessitura and ancillary systems are meeting all user requirements.\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nMinimum Qualifications:\n\n\n \n </div>\n <div>\n\n \n \n Essential: The ideal candidate will possess the ability to learn and use complex business systems at both the technical and user levels; strong analytical skills and problem solving; the ability to adapt to rapidly changing business priorities and assignments; exceptional organization skills and oral and written communication skills; strong customer service and team oriented focus; the ability to interact and communicate with personnel at all technical levels; the ability to maintain confidentiality when necessary; knowledge of and clear demonstration of ability to learn and apply federal, state, campus, and industry policies that govern financial systems; and the proven ability to work with minimum supervision, escalate priority issues wherever necessary, and manage time effectively. Preferred: Experience in a higher education setting, including finance/accounting, reporting, data analysis, and policy and procedure interpretation. Preference will be given to a candidate with: -\tBachelor's degree in a related field -\tExperience with Tessitura or a comparable ticketing software -\tExtensive experience supporting Windows 7, OSX and other devices -\tExperience with MS Office, Adobe Creative Suite, SQL and SQL Server Reporting Services -\tExperience with PCI compliance, credit card security, and UNC security procedures and policiesRequired: Associate's Degree in Computer Programming, or Bachelor's degree with some computer related coursework from an appropriately accredited university; or an equivalent combination of education and experience. Six months of experience required.\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nPosition Number:\n\n\n \n </div>\n <div>\n\n \n \n NF0003399\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nPosting Date:\n\n\n \n </div>\n <div>\n\n \n \n 10/30/2018\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nClosing Date:\n\n\n \n </div>\n <div>\n\n \n 11/26/2018\n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\nAmerican Recovery &amp; Reinvestment Act Funded:\n\n\n \n </div>\n <div>\n\n \n \n No\n \n \n \n </div>\n </div>\n\n </div>\n \n <div>\n \n <div>\n <div>\n \n\n\n\n\n\n \n </div>\n <div>\n\n \n \n Apply Now\n \n \n \n </div>\n </div>\n\n </div>"}