{"job title": "Business Intelligence and Data Analyst", "company": "UNC-Chapel Hill", "city state": "– Chapel Hill, NC", "rating": "4.0", "job description": "<div>\n<div>\n<div><strong>Classification Title:</strong></div><div>\nBusiness Intelligence and Data Analyst</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Working Title:</strong></div><div>\nBusiness Intelligence and Data Analyst</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Campus:</strong></div><div>\nUNC-Chapel Hill</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Region:</strong></div><div>\nPiedmont/Triangle</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Job Summary:</strong></div><div>\nThe primary purpose of this position is to provide high-level programming, data analytic, and metrics to support data science and business intelligence. The incumbent works with functional areas to understand business requirements and designs and build datasets needed to accomplish those business goals by accessing a variety of campus operational and warehouse data systems. The incumbent's products generate information to meet the decision-making needs of senior administrators, members of the Board of Trustees, school and other academic unit heads (deans, associate deans, program directors, department chairs), faculty, University committees, and functional offices. The incumbent is responsible for developing and implementing web-based reporting applications and dashboards to communicate quantitative and visually-displayed information to internal UNC Chapel Hill and public constituents.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Minimum Qualifications:</strong></div><div>\nThis position requires knowledge and experience with full lifecycle reporting using multiple reporting platforms including SAS and one or more automated and/or interactive reporting platforms. The candidate must understand principles of data modeling and be able to implement data models in multiple databases including Oracle. The candidate must have experience gathering reporting requirements and analyzing requirements across clients to identify commonalities. The candidate must be able to translate information requests into accessible data visualizations and/or reports. The candidate must have demonstrated experience in designing and delivering dashboards and other web-based reports using data from a variety of sources.Bachelor's degree in Computer Science, Computer Information Systems, Computer Engineering, math, or Engineering or related technical degree from an appropriately accredited institution; or Bachelor's degree and some computer coursework from an appropriately accredited institution and one year of experience in business application consulting or development; or Associate's degree in Computer Programming and one year of experience in application consulting or development; or an equivalent combination of education and experience.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Position Number:</strong></div><div>\nNF0003315</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Posting Date:</strong></div><div>\n09/12/2018</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<strong><div>Closing Date:</div></strong></div><strong>\n </strong></div><strong>\n\n<br></strong><br>\n\n<div>\n<div>\n<div><strong>American Recovery &amp; Reinvestment Act Funded:</strong></div><div>\nNo</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div>\nApply Now</div>\n</div>\n </div>\n\n<br>"}