{"job title": "Bioinformatics Scientist", "company": "UNC-Chapel Hill", "city state": "– Chapel Hill, NC", "rating": "4.0", "job description": "<div>\n<div>\n<div><strong>Classification Title:</strong></div><div>\nBioinformatics Scientist</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Working Title:</strong></div><div>\nBioinformatics Scientist</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Campus:</strong></div><div>\nUNC-Chapel Hill</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Region:</strong></div><div>\nPiedmont/Triangle</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Job Summary:</strong></div><div>\nThe Bioinformatics Core Facility at the Lineberger Comprehensive Cancer Center provides bioinformatics and computational biology services for the cancer center. As a member of the Bioinformatics Core Facility, the Research Associate will be responsible for development and execution of software for advanced data analysis tasks to support the evaluation, development, and operation of clinical genomic testing. This individual will be the primary technical liaison between the Bioinformatics Core Facility and the UNC Medical Center Molecular Genetics Laboratory. The Research Associate will support the development, validation, and performance of clinical cancer genetics and genomics tests, primarily based on next generation sequencing-based approaches. Projects will be identified by leadership of the LCCC Bioinformatics Core and UNC Medical Center Molecular Oncology program. This position requires experience in a Linux computing cluster environment, programmatic database queries, management of large data sets, data mining, statistical analysis, and strong scientific communication skills.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Minimum Qualifications:</strong></div><div>\nThe candidate must have knowledge and experience in DNA or RNA sequence analysis, linux shell scripting, working in a cluster computing environment, R, and at least one of Python, Java, C/C++, or Perl. The candidate must have strong communication skills, especially with other individuals with limited computational experience, and be willing to work within a clinical environment. Experience working in a clinical, translational, or research support environment, with cloud technologies (Docker, OpenStack), Javascript, and with SQL is preferred. An inclination for operational management, with a proven track record of successful project management is desirable. Experience with clinical laboratory testing is desirable.A PhD and 5 years of experience or a MS and 10 years of experience in computer science, mathematics, physics, bioinformatics, genetics, statistics, or computational biology is required.</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Position Number:</strong></div><div>\nNF0003363</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Posting Date:</strong></div><div>\n10/09/2018</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div><strong>Closing Date:</strong></div><div>\n12/07/2018</div>\n </div>\n </div><br>\n\n<div>\n<div>\n<div><strong>American Recovery &amp; Reinvestment Act Funded:</strong></div><div>\nNo</div>\n</div>\n </div><br>\n\n<div>\n<div>\n<div>\nApply Now</div>\n</div>\n </div>\n\n<br>"}