{"job title": "HCS ADVANCED ANALYTICAL CONSULTANT - ENTERPRISE ANALYTICS", "company": "UNC Health Care", "city state": "– Morrisville, NC", "rating": "3.9", "job description": "<div>HCS ADVANCED ANALYTICAL CONSULTANT - ENTERPRISE ANALYTICS-INF002Z1</div><div><div>Description</div><br>\n<div>The Advanced Analytical Consultant is a system-wide expert on delivering consulting engagements that focus on applying business intelligence and advanced analytical methods and technologies to project-specific clinical and business questions. Possessing a broad combination of skills covering data (e.g., integration, aggregation, standardization), analytics (e.g., descriptive and inferential statistical theory and practice, modeling), programming (e.g., SAS, R), and consulting (e.g., needs analysis, project definition, project management, customer management, communication), this role functions as an independent consultant with internal customers to deliver custom advanced analytical engagements that provide novel clinical, financial, and administrative insights supporting strategic initiatives across the health care system. Advanced Analytical Consultants enable federated clinical and business project teams to answer more sophisticated questions by enable access to skills and experiences not otherwise available outside of EADS. This role also serves to transition custom project methods, algorithms, and deliverables to EADS functions responsible for reusable asset development and management.</div>\n</div><div><div>Qualifications</div><br>\n<div>Education Requirements:\n<br>\nMasters degree in Statistics, Biostatistics, Economics, Computer Science, Information Systems Management or a quantitative-related field.\n<br><br>\n<strong>Licensure/Certification Requirements:</strong>\n<br>\nNo licensure or certification required.</div><div>\n<strong>Professional Experience Requirements:</strong>\n<br>\nIf a Masters degree: Seven (7) years of relevant experience.\n<br>\nIf a Doctorate degree: Five (5) years of relevant experience.\n<br>\nPrior experience with R, SAS or SPSS, other data mining tools, databases, and computer programming.</div><div>\n<strong>Knowledge, Skills, and Abilities Requirements:</strong>\n<br>\nTheoretical fluency and working proficiency in the application of a broad array of statistical and quantitative methods such as description\n<br>\nand inferential statistics, multivariate regression, clustering, neural networks, predictive modeling, forecasting, machine learning, data\n<br>\nmining, and optimization algorithms. Superior computer skills are required, with knowledge in relevant software packages and languages\n<br>\nsuch as, but not limited to, SAS, R, Python, SQL, Java, and .NET. Prior experience with analytical programming (e.g. SAS, R) preferred.\n<br>\nHigh proficiency in SQL Query programming such as stored procedures, functions, temporary tables, parameterization, complex joins, and\n<br>\ngrouping. Track record in the development and delivery of analytical projects for customers, including scoping and presenting results. A\n<br>\nhigh degree of professionalism, enthusiasm, autonomy and initiative on a daily basis. Ability to work independently in a fast-paced\n<br>\nenvironment. Excellent project management, planning, communication, documentation, organizational, analytical and problem solving\n<br>\nabilities. Advanced mathematical skills including statistics, data mining/machine learning, and optimization. Ability to interpret and\n<br>\nsummarize results of various analyses in a timely and meaningful way. Ability to communicate clearly and effectively (both orally, and in\n<br>\nwriting, and in presentations) to convey technical and business value propositions to non-technical audiences is required. Excellent\n<br>\ninterpersonal and facilitation skills in order to work with disparate, and at times contentious, groups effectively.</div>\n<br>\n<div><strong>Preferred Qualifications:</strong></div><div>Education and experience in the field of operations research, building and applying discrete event simulation and optimization models to business problems.\n<br>\nExperience building predictive models using data mining and machine learning techniques.\n<br>\nCertified Analytics Professional (CAP) or Associate Certified Analytics Professional (aCAP) preferred</div></div><div>Primary LocationUnited States-North Carolina-Morrisville</div><div>DepartmentU-1000-IT ENTERPRISE APPLICATIONS</div><div>ShiftDay Job</div>"}