{"job title": "Category Strategy &amp; Analytics Manager", "company": "Unilever", "city state": "– Englewood Cliffs, NJ", "rating": "4.0", "job description": "<strong>Background &amp; Purpose of the Job\n<br><br>\nCategory Strategy &amp; Analytics Manager is responsible for accelerating the growth of Unilever category sales through all of Walmart?s platforms. Leverages eCommerce best practices, as well as category management principles, to optimize the shopper experience through optimal assortment, site navigation, and search. Has joint accountability for Turnover, Share, and PSO metrics with other key owners/CBMs on Walmart team.\n<br><br>\nUnilever is home to iconic brands such as Dove, AXE, Ben &amp; Jerry?s, Seventh Generation, and Lipton, and on any given day, over 2 billion people around the world use our products. Accelerating eCommerce enables us to get closer to our consumers and rapidly scale our brands. This role will be critical to the growth of Unilever?s business through the eCommerce retail channel.\n<br><br>\n<strong>Who You Are &amp; What You?ll Do\n<br><br>\nThe Category Strategy &amp; Analytics Manager is responsible for improving various aspects of the shopping experience across all Walmart platforms in order to accelerate category growth. They understand each category?s value drivers, and focus on bringing them to life through:\n<br><br>\n1) Optimal assortment across all platforms\n<br><br>\n2) Improving e-shelving across categories to drive category growth (Taxonomy, facets and filters)\n<br><br>\n3) Cross selling (complete the regimen)\n<br><br>\n4) Pricing and Promotional strategies\n<br><br>\nThey will also partner across Consumer Marketing Insights to understand insights relevant to eCommerce and digital journeys at Walmart and commercialize them with the retailer. Because of the nature and future potential of eCommerce businesses including Walmart, this role will have the opportunity to share your insights and learnings with the core Category Management organization, customer development teams, and senior leadership within Unilever.\n<br><br>\n<strong>You?re a born leader: This is a first of a kind opportunity to develop relationships at Walmart to determine who and how to land the growth enablers. You will define a new way of working with our Unilever Walmart eCommerce sales and insights managers.\n<br><br>\n<strong>You?re a strategy guru: You will develop a firm understanding of category and shopper dynamics, and conduct 6P analysis for each category to uncover the largest category growth enablers.\n<br><br>\n<strong>You?re a changemaker: You?ll influence Walmart to test new concepts through sound shopper and consumer insights. You can create compelling, data-driven stories that make it imperative for the customer to take the right actions.<strong>\n<br><br>\n<strong>\n<br><br>\n<strong>You?re a paradox navigator: You can identify processes or organizational problems that slow down the team and hinder the pivot to digital commerce. By using your business knowledge and problem-solving skills, you can put scalable solutions in place to help the team make progress.\n<br><br>\n<strong>What You?ll Need To Succeed\n<br><br>\n? Bachelor's degree\n<br><br>\n? 7 years? experience in CPG or Retail industry, including roles in category management and sales\n<br><br>\n? Working knowledge of eCommerce retail basics, traffic &amp; conversion drivers, Search, the consumer?s path to purchase journey, and omni-channel retailer models\n<br><br>\n? Experience interfacing with the customer and owning commercial goals\n<br><br>\n<strong>What We Can Offer You\n<br><br>\n<strong>Culture for Growth <strong> - <strong>Top Notch Employee Health &amp; Well Being Benefits <strong> - <strong>Every Voice Matters <strong> - <strong>Global Reach <strong> - <strong>Life at Unilever <strong> - <strong>Careers with Purpose <strong> - <strong>World Class Career Development Programs <strong> - <strong>Check Out Our Space <strong> - <strong>Focus On Sustainability <strong>\n<br><br>\n<strong>\n<br><br>\n[*Internal Only* By applying for this vacancy, you are confirming that you have made your Line Manager aware of your application and that you are at a point in your career with Unilever where it is appropriate for you to be applying for other positions.\n<br><br>\nUnilever is an organization committed to diversity and inclusion to drive our business results and create a better future every day for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business.\n<br><br>\nEqual Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with Disabilities.\n<br><br>\nApplicants and employees are protected from discrimination under Federal law. For more information, please see EEO is the Law<u>.</u>\n<br><br>\nEmployment is subject to verification of pre-screening tests, which may include drug screening, background check, credit check and DMV check.<br><br><strong>Job:</strong> Customer Development\n<br><br>\n<strong>Primary Location:</strong> United States-New Jersey-Englewood Cliffs-Englewood Cliffs -700 Sylvan\n<br><br>\n<strong>Schedule:</strong> Full-time\n<br><br>\n<strong>Shift:</strong> Day Job\n<br><br>\n<strong>Unposting Date:</strong> Ongoing\n<br><br>\n<strong>Req ID:</strong> 18000GK5</strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong></strong>"}