{"job title": "Associate Scientist", "company": "Unilever", "city state": "– United States-Connecticut-Trumbull-Trumbull", "rating": "4.0", "job description": "<p><b></b> </p>\n<p>The purpose of this Associate Scientist position will be to support Unilever skin care brands in North America and/or Globally. Activities will involve new product development and sourcing which create new opportunities for flexibility speed and savings. This position could also include responsibility for adapting existing formulas to meet the needs of North America or global markets. This will involve working with internal R&amp;D teams – including among others consumer insight &amp; claims, process engineering, and packaging - Procurement, Marketing, Brand and Supply Chain as well as external suppliers.</p>\n<p><b>Who You Are &amp; What You’ll Do</b></p>\n<p>You will be a product developer and work stream leader for Unilever skin care brands working with the Technical Project Leader and cross-functional R&amp;D team. You will interact daily with processing, packaging, consumer, clinical and microbiology groups to design technologies that meet consumer needs and expectations. </p>\n<p>You will formulate in the lab, support consumer testing, clinical testing, scale-up, Safety/regulatory/patent clearance, along with recipe and specification creation. </p>\n<p>You will participate in designing consumer testing protocols, and producing consumer test samples in support of consumer research needs. </p>\n<p>You will interact with R&amp;D partners from other teams – global, local - to insure the flawless transfer and execution of innovations.</p>\n<p>You will possess and build a working knowledge of functional materials for skin care in order to formulate skin care products and interact with suppliers.</p>\n<p>You will also interact regularly with our marketing partners to ensure the products you develop are a fit for our brands. </p>\n<p>You will have opportunities to communicate or demonstrate the science behind our products to our marketing and PR partners as well as to key influencers and customers. </p>\n<p>Above all, you will maintain a clean and safe working environment and support a safe workplace culture.</p>\n<p>• <b>You’re a born leader:</b> You will be working in a very dynamic work environment which will require you to be very agile and take a lot responsibility over your day to day activities without constant oversite. The group you will be working in is filled with many leaders. We lead through example collectively and through collaboration. </p>\n<p> </p>\n<p>• <b>You’re a dot connector:</b> The position works in conjunction with broader R&amp;D teams including: Process Engineers, Packaging Engineers, CTI (Consumer Technical Insights), Microbiology, Material Experts, Data &amp; Digital, Regulatory and Technical Project Leaders (TPLs).</p>\n<p> </p>\n<p>• <b>You’re a paradox navigator:</b> Unilever thrives in an ever-changing ultra-competitive business environment. Because of this we must often work under paradoxical demands and directions. Example, work faster but use less resource. In this position you must juggle these demands and constantly figure out what is best for your projects and the business.</p>\n<p> </p>\n<p> </p>\n<p><b>What You’ll Need To Succeed</b></p>\n<p>· Lead and deliver bench top product development for innovation or renovation projects based on product brief from TPLs. Lead and deliver bench top product optimization, new ingredients or ingredients from new suppliers screening and validation for quality and value improvement projects. <b></b></p>\n<p> </p>\n<p>· Perform, when required, pilot plant trials and all analytical and sensory evaluations of the samples. <b></b></p>\n<p> </p>\n<p>· Weigh out and batch formulations for pilot plant runs/product bench optimizations/samples preparation for showings/cuttings including ingredient organization and inventory management and logistics (FIFO), interfacing with suppliers to order ingredients where necessary. <b></b></p>\n<p> </p>\n<p>· Perform inventory management and logistics of product samples (pilot plant produced or delivered from factories), manage products disposals and ship samples to other Unilever sites globally. <b></b></p>\n<p> </p>\n<p>· Troubleshoot production batch out of spec situations, understand the role of chemical and physical analysis as a trouble shooting tool, and demonstrate ability to apply as needed.</p>\n<p> </p>\n<p>· Conduct product demonstrations with cross-functional teams including CTI. <b></b></p>\n<p> </p>\n<p>· Interpret analytical, testing &amp; showings results and suggest scientifically sound next steps (with appropriate assistance and support).<b></b></p>\n<p> </p>\n<p>· Lead the process of specification creation in SAP PLM from the request to the approved status and create specifications for all new ingredients and new products to be launch.<b></b></p>\n<p> </p>\n<p>· Lead the delivery of Third Party Manufacturing Manual for outsourced product launches. </p>\n<p> </p>\n<p>· Participate in factory trials for commercialization when required.<b></b></p>\n<p> </p>\n<p>· Identify improved ways of working and simplified processes. <b></b></p>\n<p> </p>\n<p>· Operates according to procedures and ways of working in line with Unilever frameworks, standards, and adheres to all company policies, programs, rules, regulations, and safety rules. policies (SHE, SEAC, etc), relevant regulations (i.e. FDA), Good Manufacturing Practices (GMPs) as well as Good Laboratory Practices (GLPs). </p>\n<p> </p>\n<p><b>What You’ll Need To Succeed</b></p>\n<p>Bachelor’s degree in Chemistry or Chemical Engineering. </p>\n<p>2 years experience in Cosmetic formulation preferred but not required. </p>\n<p>Proficient in Microsoft office packages (Excel, Word, Power point)</p>\n<p>Time management skills to coordinate multiple work streams.</p>\n<p><b></b> </p>\n<p><b>What We Can Offer You</b></p>\n<p><b>Culture for Growth</b><b> | </b><b>Top Notch Employee Health &amp; Well Being Benefits</b><b> | </b><b>Every Voice Matters</b><b> | </b><b>Global Reach</b><b> | </b><b>Life at Unilever</b><b> | </b><b>Careers with Purpose</b><b> | </b><b>World Class Career Development Programs</b><b> | </b><b>Check Out Our Space</b><b> | </b><b>Focus On Sustainability</b></p>\n<p>Unilever is an organization committed to diversity and inclusion to drive our business results and create a better future every day for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. </p>\n<p>Equal Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with Disabilities </p>\n<p>Applicants and employees are protected from discrimination under Federal law. For more information, please see EEO is the Law </p>\n<p>Employment is subject to verification of pre-screening tests, which may include drug screening, background check, credit check and DMV check. </p>"}