{"job title": "Principal Data Analyst - Commercial Analytics", "company": "UnitedHealth Group Inc.", "city state": "– Boston, MA", "rating": "3.3", "job description": "Optum's Commercial Analytics team is focused on leveraging existing and future data assets and software products to meet Pharmaceutical, Biotechonology and Medical Device Manufacturers information and insight needs on market dynamics and competitive activities. Data assets leveraged will include Optum's de-identified patient longitudinal claims database, as well as a comprehensive de-identified longitudinal virtual EHR clinical database among others. Software products that may be utilized may include Optum's Clinformatics(tm) suite of business intelligence tools, NorthStar(tm), and Optum's newest applications Cohort Builder and Patient Journey.\n<br><br>\nYou'll enjoy the flexibility to telecommute* from anywhere within the U.S. as you take on some tough challenges.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Direct and manage statistical and econometric methods to support consulting projects.</li>\n<li>Perform and manage analyses of data and interpret results to ensure validity of conclusions.</li>\n<li>Direct and manage extraction and processing of internal or external data to support client projects</li>\n<li>Develop reports and presentations based on project specifications for delivery to clients.</li>\n<li>Perform statistical quality assurance review and program validation for each project.</li>\n<li>Provide analytical and data support for case studies and business proposals</li>\n<li>Interact with other departments to ensure a high level of client satisfaction through successful execution of projects</li>\n<li>Leverage skills to support creation of product improvements and new product offerings targeted at the needs of the life science marketing and analytics community</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>BS or BA with 5 years of practical application in healthcare</li>\n<li>Expertise in data extraction from databases, data cleansing and integration</li>\n<li>Experience leveraging patient level data (claims, EHR, etc.) to support commercially oriented business questions</li>\n<li>Utilization of SAS / R to develop analyses</li>\n<li>Computer proficiency is required, specifically Excel</li>\n<li>Ability to independently perform statistical analyses of claims and clinical data</li>\n<li>Travel will be</li>\n</ul>"}