{"job title": "Senior Data Engineer", "company": "UnitedHealth Group Inc.", "city state": "– Minnetonka, MN", "rating": "3.3", "job description": "The health solutions marketplace is hungry for new ideas, innovative products and software that drive elevated performance for the business and the customer. Optum, part of the UnitedHealth Group family of businesses, is feeding incredible solutions to that marketplace every day by bringing out the best in our software engineering teams.\n<br><br>\nWe serve customers across the health system. Not only do we have more of them every day, we also have more technology, greater data resources and far broader expertise than any competitor anywhere. We're out to change the way our businesses and consumers engage with technology. If you're in, you'll be challenged like never before. It's time to join this history making.\n<br><br>\nIn this Principal Data Engineer role with in Data Solutions team, you will be responsible for supporting and maintaining various applications that supports HEDIS®/Stars. These applications helps implement controls to cross-check the HEDIS® software and vendors to ensure completed chases are closed appropriately.\n<br><br>\nThe ideal candidate has a strong entrepreneurial spirit, and the ability to teach and mentor his or her peers. This individual has the ability to advise clients and to work as a key member of the delivery team. The role will require deep, hands-on technical skills in designing, developing and implementing.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Contribute to the design and architecture to enable secure, scalable, and maintainable software and should be able to clearly articulate the implications of design/architectural decisions, issues and plans to technology leadership</li>\n<li>Design and develop software applications and application components in an agile environment</li>\n<li>Work with geographically distributed teams, with ample opportunity to learn from and mentor teammates in a fast-paced environment</li>\n<li>Provide hands-on leadership, coaching, mentoring, and software engineering best practices to junior software engineers</li>\n<li>Develop reusable patterns and encourage innovation that will increase team velocity</li>\n<li>Collaborate on the design with other team members and product owners, both inside and outside the scrum team</li>\n<li>Conduct design and code reviews to ensure code developed meets or exceeds coding best practices guidelines, unit testing, security, and scalability and maintainability guidelines</li>\n<li>Drive a quality mind set within the team</li>\n<li>Flexibility to be on call and provide support as needed during on call</li>\n<li>Anticipating issues and acting proactively to address potential issues</li>\n<li>Work with sometimes ambiguous / conceptual requirements and guide the technical team to provide functionality with the right amount of engineering</li>\n<li>Possess breadth of knowledge spanning all bodies of technologies, (e.g. databases, middleware, OS, etc.)</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Experience working in an Agile environment utilizing test-driven development practices</li>\n<li>4 years of experience in Database Programming using Microsoft Technology (MS- Sql Server, SSIS,SSRS,MS-Excel,T-SQL)</li>\n<li>4 years of experience in Software design, architecture and programming</li>\n<li>Working knowledge of different .Net Frameworks (C#.NET), IIS Web Server</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>1 year expertise in automating build processes, application deployments and continuous integration systems (such as Jenkins, Team City, Terraform, TFS, etc</li>\n</ul>\n\nHealthcare Industry experience\n\n\n<ul>\n<li>Excellent communication and presentation skills</li>\n<li>Strong experience with enterprise application architecture and enterprise integration patterns</li>\n<li>Exposure to production support</li>\n<li>Working knowledge in database administration</li>\n<li>Strong project management skills</li>\n<li>Excellent team development skills</li>\n<li>Strong interpersonal skills</li>\n<li>Strong time management and prioritization skills</li>\n<li>Strong written and verbal communications skills</li>\n</ul>\n\nTechnology Careers with Optum. Information and technology have amazing power to transform the health care industry and improve people's lives. This is where it's happening. This is where you'll help solve the problems that have never been solved. We're freeing information so it can be used safely and securely wherever it's needed. We're creating the very best ideas that can most easily be put into action to help our clients improve the quality of care and lower costs for millions. This is where the best and the brightest work together to make positive change a reality. This is the place to do your life's best work.SM\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n<br><br>\nUnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.\n<br><br>\nJob Keywords: MS- Sql Server, SSIS,SSRS,MS-Excel,T-SQL). Agile Test Driven Development Jenkins Teamcity Terraform TFS C# .NET, Minnetonka, MN, Minnesota, Raleigh, NC, North Carolina, Rocky Hill, CT, Connecticut"}