{"job title": "Senior Research Scientist for Embedded Sensing", "company": "United Technologies Corporation", "city state": "– East Hartford, CT", "rating": "3.3", "job description": "<strong>Job Description</strong>\n<br><br>\nUnited Technologies Corporation (UTC; NYSC: UTX) is headquartered in Farmington, CT, just outside of Hartford, CT. We employ over 204,000 talented individuals globally, achieve net sales in excess of $60 billion, and invest $4B each year back into research &amp; development activities. Our aerospace businesses include Pratt &amp; Whitney aircraft engines and UTC Aerospace Systems the combination of which make us the largest aerospace company in the world. Our commercial businesses include Otis elevators and escalators and UTC Climate, Controls &amp; Security a leading provider of heating, ventilation, air conditioning, fire and security systems and building automation controls.\n<br><br>\nUnited Technologies Corporation (UTC) was founded by some of the world's greatest inventors. We helped build the Second Industrial Revolution and brought about a century of urbanization and globalization. Now we need your help to build the next one.\n<br><br>\nTech@UTC is the UTC technology organization, comprised of the global engineering function, several focused centers of expertise, our skunkworks organization United Technologies Advanced Projects (UTAP), and our advanced Research &amp; Development lab United Technologies Research Center (UTRC). By combining a passion for science with precision engineering, we create smart, sustainable solutions that prove we can do the big things the right way. We put the \"T\" in UTC.\n<br><br>\nThe United Technologies Research Center (UTRC) is the corporate research center of UTC, operating at the leading edge of commercial and military aviation, aerospace systems, climate control, elevator design, and security and fire protection. At UTRC, we create new ideas and opportunities by collaborating across time zones, geographies and cultures. We are a community of high performing inventors, innovators, thinkers, manufacturers, motivators, leaders, problem solvers, dreamers and achievers. We work with universities, external research organizations, and global business units to identify, develop and demonstrate innovative technology solutions, products, services and intelligent systems. We are looking for scientists and engineers who have a passion for innovation and a high tolerance for ambiguity. You must be an independent thinker and self-starter with a demonstrated ability to produce high-quality technical content by collaborating with fellow researchers and product specialists. You will have the opportunity to continuously develop and invent new technologies, products and processes. At UTRC, you'll be part of an evolving, globally diverse company that's moving fast to shape the future of technology - one full of career opportunities and the chance to contribute and grow in a variety of ways. We are committed to recruiting and retaining the best and brightest people from the broadest and most diverse talent pool possible, so that we can serve our customers globally. If you have ideas, inspiration and expertise to continue developing products and systems that make the world a better place to live, then we have a great opportunity for you to contribute to our continued legacy of innovation.\n<br><br>\nThe Electromagnetics and Networks Group within UTRC has an opening at the level of Senior Research Scientist for an electrical engineer with expertise in enhanced edge devices for embedded sensing, and the physical layer aspects of wireless networking. Experience with short-range and millimeter-wave radar concepts for industrial sensing applications is of particular interest. The position entails development of technical concepts to support business needs, technical project leadership, preparing proposals for external resource development, and mentoring of technical staff.\n<br><br>\nEmployment Type\n<br><br>\nFull time"}