{"job title": "Senior Research Scientist, Measurement Science", "company": "United Technologies Corporation", "city state": "– East Hartford, CT", "rating": "3.3", "job description": "<ul>\n<li>*Job ID:** 76878BR</li>\n<li>*City:** East Hartford</li>\n<li>*State:** Connecticut</li>\n<li>*Country:** United States</li>\n<li>*Category:** Engineering, Physical Sciences</li>\n<li>*Job Type:** Full Time</li>\n<li>*Description:**</li>\n</ul>\n\nUnited Technologies Research Center (UTRC) is the corporate research center of United Technologies Corporation (UTC), one of the world?s largest and most respected corporations, operating at the leading edge of commercial and military aviation, aerospace systems, climate control, elevator design, and security and fire protection. UTC was founded by some of the world?s greatest inventors and pioneers who built brands such as Pratt &amp; Whitney, Hamilton Sundstrand, Goodrich, Otis, and Carrier. We helped build the Second Industrial Revolution and brought about a century of urbanization and globalization. Now we need your help to build the next one. At UTRC, we create new ideas and opportunities by collaborating across time zones, geographies and cultures. We are a community of high performing inventors, innovators, thinkers, manufacturers, motivators, leaders, problem solvers, dreamers and achievers.\n<br><br>\nWe work with universities, external research organizations, and global business units to identify, develop and demonstrate innovative technology solutions, products, services and intelligent systems. We are looking for scientists and engineers who have a passion for innovation and a high tolerance for ambiguity. You must be an independent thinker and self-starter with a demonstrated ability to produce high-quality technical content by collaborating with fellow researchers and product specialists. You will have the opportunity to continuously develop and invent new technologies, products and processes. At UTRC, you?ll be part of an evolving, globally diverse company that?s moving fast to shape the future of technology - one full of career opportunities and the chance to contribute and grow in a variety of ways. We are committed to recruiting and retaining the best and brightest people from the broadest and most diverse talent pool possible, so that we can serve our customers globally. If you have ideas, inspiration and expertise to continue developing products and systems that make the world a better place to live, then we have a great opportunity for you to contribute to our continued legacy of innovation.\n<br><br>\nThe Measurement Science Group invites qualified individuals to apply for the position of Materials Scientist / Engineer. We are the central resource within UTC to support technology development and pursue corrective actions for highly challenging technical problems in the areas of material and surface characterization across all corporate business units.\n<br><br>\nThe teams at UTRC are multi-disciplinary and work to develop and execute complex materials characterization and investigation plans. Communication of results and scientific interpretation is expected through preparation of professional technical reports, presentations and publications. Demonstration of leadership skills in process and new employee development as well as assistance with external resource acquisition is also necessary.\n\n\n<ul>\n<li>*Qualification:**</li>\n</ul>\n\nA PhD with up to three years of experience post PhD or Masters with 6+ years of experience.\n<br><br>\nAre you a highly motivated self-starter that is able to adapt and prioritize tasks? Do you thrive in a team work environment that solves challenging problems? We are looking for you!\n<br><br>\nExperience with a variety of materials characterization methods is required. Hands-on experience with at least several of the capabilities listed below, in a professional environment, is required.\n<br><br>\n+ Microscopy (SEM, TEM)\n<br><br>\n+ Chemical Analysis (EDS, WDS)\n<br><br>\n+ X-ray Diffraction analysis (XRD)\n<br><br>\n+ X-ray Computed Tomography (CT)\n<br><br>\n+ Surface Spectroscopy (Auger, XPS)\n<br><br>\nDo you have a strong knowledge of materials processing, properties and microstructure in addition to experience with failure analysis investigations. Join us! We are searching for an individual with experience in crystallography and diffraction techniques would be beneficial in supporting the team and meeting our goals.\n<br><br>\nFormal training in relentless root cause analysis (RRCA) techniques is a plus.\n<br><br>\nUS Citizen or US permanent resident required based on the body of work.\n\n\n<ul>\n<li>*Education:** A PhD or MS degree in Materials Science &amp; Engineering, Chemistry or related field.</li>\n</ul>\n\nUnited Technologies Corporation is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\n\n\n<ul>\n<li>*Qualification:**</li>\n</ul>\n\nA PhD with up to three years of experience post PhD or Masters with 6+ years of experience.\n<br><br>\nAre you a highly motivated self-starter that is able to adapt and prioritize tasks? Do you thrive in a team work environment that solves challenging problems? We are looking for you!\n<br><br>\nExperience with a variety of materials characterization methods is required. Hands-on experience with at least several of the capabilities listed below, in a professional environment, is required.\n<br><br>\n+ Microscopy (SEM, TEM)\n<br><br>\n+ Chemical Analysis (EDS, WDS)\n<br><br>\n+ X-ray Diffraction analysis (XRD)\n<br><br>\n+ X-ray Computed Tomography (CT)\n<br><br>\n+ Surface Spectroscopy (Auger, XPS)\n<br><br>\nDo you have a strong knowledge of materials processing, properties and microstructure in addition to experience with failure analysis investigations. Join us! We are searching for an individual with experience in crystallography and diffraction techniques would be beneficial in supporting the team and meeting our goals.\n<br><br>\nFormal training in relentless root cause analysis (RRCA) techniques is a plus.\n<br><br>\nUS Citizen or US permanent resident required based on the body of work.\n<br><br>\nUnited Technologies Corporation is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class."}