{"job title": "Senior Data Scientist - Twin Cities, MN or Telecommute", "company": "UnitedHealth Group", "city state": "– Minnetonka, MN", "rating": "3.3", "job description": "UnitedHealthcare is looking for a <strong>Senior Data Scientist</strong> to become a key member of a small but growing cross functional team that includes actuaries, programmers, economists, and data scientists. This role will work to expand on a successful pilot program that uses algorithms to aid in the optimization of healthcare spending. You will have the opportunity to join a small and dynamic team that has been adding substantial value to both the organization and to the broader healthcare system.\n<br><br>\nIn this position, you will be advocating the power of data science concepts and working with cross-functional teams to create actionable insight across core business lines. You will identify relevant skill and knowledge gaps needed to solve business problems and will develop training programs to close these gaps while providing hands on experience solving major healthcare problems.\n<br><br>\nWe are looking for someone who is passionate about asking and answering questions through the use of large structured and unstructured data. It is critical to have exceptional communication skills and the ability to make complex concepts simple and easy to understand.\n<br><br>\nYoull enjoy the flexibility to telecommute* from anywhere within the U.S. as you take on some tough challenges.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n<ul>\n\n<li>Be at the forefront of algorithm design and predictive modeling/machine learning development and testing\n\n</li><li>Conduct training and educational programs in data science\n\n</li><li>Document findings, including assumptions and validation work in a clear structured manner\n\n</li><li>Summarize and present findings; adjust the content and level of detail to appropriate level of the audience\n\n</li><li>Develop deep understanding for how data can be used to solve relevant business problems\n\n</li><li>Help expand/contribute to teams collective predictive modeling/advanced analytics knowledge base\n\n</li><li>Translate business problems from various stakeholders into analytic processes\n\n</li><li>Self-motivating, problem solver, teacher, flexible and adaptable\n\n</li><li>Present analyses, findings, and recommendations to a broader audience including senior leaders</li>\n\n</ul>\n<strong>Required Qualifications:</strong>\n\n<ul>\n\n<li>Bachelors degree in quantitative field, computer science, statistics, applied mathematics, or actuarial science\n\n</li><li>3+ years of experience in statistical analysis, quantitative analytics, and/or forecasting/predicting analytics\n\n</li><li>2+ years of experience with R or Python\n\n</li><li>2+ years of experience in SAS</li>\n\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n\n<li>Experience with business intelligence tools such as Tableau\n\n</li><li>Experience with healthcare data\n\n</li><li>Expertise in Microsoft Excel\n\n</li><li>Ability to recognize technical and analytical problems and solution with minimal supervision\n\n</li><li>Effective in a fast-paced, team-oriented environment</li>\n\n</ul>\n<strong>Careers at UnitedHealthcare Employer &amp; Individual.</strong> We all want to make a difference with the work we do. Sometimes we're presented with an opportunity to make a difference on a scale we couldn't imagine. Here, you get that opportunity every day. As a member of one of our elite teams, you'll provide the ideas and solutions that help nearly 25 million customers live healthier lives. You'll help write the next chapter in the history of health care. And you'll find a wealth of open doors and career paths that will take you as far as you want to go. Go further. This is <strong>your life's best work.(sm)</strong>\n<br><br>\n*All Telecommuters will be required to adhere to UnitedHealth Groups Telecommuter Policy.\n<br><br>\n<em>Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.</em>\n<br><br>\n<em>UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.</em>\n<br><br>\nJob Keywords: Machine learning, predictive analytics, data science, quantitative analytics, forecasting analytics, R, Python, SAS, Tableau, Excel, predictive modeling, Minnetonka, MN, Minnesota, Twin Cities, telecommute, telecommuter, remote, work from home"}