{"job title": "Business / Data Analyst", "company": "UnitedHealth Group Inc.", "city state": "– West Hills, CA", "rating": "3.3", "job description": "Responsible for conducting and documenting moderate to complex data analysis projects. Also responsible for planning and implementing projects that drive efficiency and quality within the Revenue Services department. Ideal candidate must be able to manipulate, analyze, and interpret data using Access, Excel, SQL, and VBA and then be able to provide answers to business questions and billing issues found through analyzing the data.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Manipulate, analyze, and interpret large amounts of data using Access, Excel, SQL, and VBA</li>\n<li>Automate processes and reports</li>\n<li>Recognize inefficiencies in processes (operational or technical)</li>\n<li>Design solutions to address billing issues</li>\n<li>Pull ad hoc reports from various billing systems</li>\n<li>Perform data validation to ensure accuracy and quality</li>\n<li>Data mining for advanced analysis of data presented in reports for management</li>\n<li>Analyze insurance medical billing denials to identify trends</li>\n<li>Recommend solutions to decrease bad debt and increase cash for receivables from laboratory tests</li>\n<li>Assist Billing department in the resolution of billing issues</li>\n<li>Provide feedback to Senior Management regarding contractual issues impacting Revenue Services</li>\n<li>Collaborate with other business units and departments on analysis projects</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>BS / BA degree in Mathematics, Statistics, Finance, Economics, or Computer Science</li>\n<li>1 years of business or data analysis experience</li>\n<li>Previous experience implementing cross-functional initiatives</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Advanced Excel and Access skills with programming knowledge using VBA and SQL</li>\n<li>Experience with insurance health plans or HMOs</li>\n<li>Ability to work to a consistent high standard under pressure</li>\n<li>Ability to work in a fast paced environment and adapt to ever changing priorities</li>\n<li>High degree of accuracy and attention to detail</li>\n<li>Demonstrate problem-solving and strong analytical skills</li>\n<li>Ability to multitask on multiple small to complex projects / tasks and meet deadlines</li>\n<li>Willingness to undertake additional responsibilities as required</li>\n<li>Self-motivated, able to work in a team, and demonstrates the ability to work independently</li>\n<li>Demonstrated ability to clearly communicate complex issues to all levels of management</li>\n<li>Excellent organizational, interpersonal, and communication (written and verbal) skills</li>\n</ul>\n\nCareers with Optum. Here's the idea. We built an entire organization around one giant objective; make health care work better for everyone. So when it comes to how we use the world?s large accumulation of health-related information, or guide health and lifestyle choices or manage pharmacy benefits for millions, our first goal is to leap beyond the status quo and uncover new ways to serve. Optum, part of the UnitedHealth Group family of businesses, brings together some of the greatest minds and most advanced ideas on where health care has to go in order to reach its fullest potential. For you, that means working on high performance teams against sophisticated challenges that matter. Optum, incredible ideas in one incredible company and a singular opportunity to do your life's best work.(sm)\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n<br><br>\nUnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.\n<br><br>\nJob keywords: Analyst, Analysis, Analytical, Accounting, Finance, Mathematics, Statistics, Engineering, Computer Science, VBA, Visual Basic for Applications, programming, Billing, Revenue Services, Data, Excel, Access, SQL, vlookup, Revenue, Business, Greenbelt, Green belt, Automation, Process Improvement, Healthcare, HMO, IPA, Insurance, Project Management, West Hills, Woodland Hills, Sherman Oaks, CA, California"}