{"job title": "Principal Data Scientist", "company": "UnitedHealth Group", "city state": "– Hopkins, MN", "rating": "3.3", "job description": "Principal Data Scientist\n<br><br>\nUnited HealthCare Services, Inc., a UnitedHealth Group company, seeks a Principal Data Scientist for our Hopkins, MN location responsible for identifying sources of truth, data domains, and attributes to support current and new hypotheses. Requires Bachelor's degree or equiv. in Information Systems, Management Information Systems, Computer Science, or related field and eight (8) years of related (progressive, post-baccalaureate) experience. Must have five (5) years of advanced analytics experience working with large-volume data, relational databases and schemas, and design applications. Must have two (2) years of development experience with data-driven applications. Must also have 12 months demonstrated ability (which may have been gained concurrently) with each of the following:\n<br><br>\n1. Healthcare experience working with healthcare data;\n<br><br>\n2. Data analysis experience using big data;\n<br><br>\n3. SAS development and programming; and\n<br><br>\n4. Experience working with external customers. Employer will accept experience gained concurrently.\n<br><br>\nEqual Opportunity Employer\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.<br><br>recblid f5e03m5bql0ekxhs4costc29iyk968\n<br><br>\nAssociated topics: data architect, data integrity, data manager, data management, data quality, data warehousing, etl, hbase, mongo database, sybase"}