{"job title": "Senior Data Scientist", "company": "UnitedHealth Group Inc.", "city state": "– Boston, MA", "rating": "3.3", "job description": "No industry is moving faster than health care. And no organization is better positioned to lead health care forward. We need attention to every detail with an eye for the points no one has considered. The rewards for performance are significant. You'll help improve the health of millions. And you'll do your life's best work.(sm)\n<br><br>\nAs a Senior Data Scientist, you will become a key member of a data science Training and Innovation function for Optum. This function will work with Optum business units to identify and deliver results on high-impact projects leveraging machine learning, artificial intelligence and big data. You will work with team members from all levels of the organization from interns to C-suite executives in order to teach and apply data science skills to important business problems.\n<br><br>\nIn this position, you will be advocating the power of data science concepts and working with cross-functional teams to create actionable insight across core business lines. You will identify relevant skill and knowledge gaps needed to solve business problems and will develop training programs to close these gaps while providing hands on experience solving major healthcare problems.\n<br><br>\nWe are looking for someone who is passionate about asking and answering questions through the use of large structured and unstructured data. It is critical to have exceptional communication skills and the ability to make complex concepts simple and easy to understand.\n<br><br>\n<strong>Primary Responsibilities:</strong>\n\n\n<ul>\n<li>Lead a team of data scientists to discover insights and identify opportunities through the use of statistical, data mining and visualization techniques</li>\n<li>Conduct training and educational programs in data science</li>\n<li>Document findings, including assumptions and validation work in a clear structured manner</li>\n<li>Summarize and present findings; adjust the content and level of detail to appropriate level of the audience</li>\n<li>Advise project teams and project sponsors</li>\n<li>Use strong business, problem solving skills and programming knowledge to quickly cycle hypotheses through discovery</li>\n<li>Work closely with clients, clinicians, data stewards, and other business and technology leaders to frame problem definition and potential solutions</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>Advanced degree in any quantitative field or similar experience with mathematical modeling</li>\n<li>2 years of statistical analysis, quantitative analytics, and/or forecasting/predicting analytics in a Corporate or Post Graduate setting</li>\n<li>Experience applying machine learning in vertically and horizontally scaled environments</li>\n<li>Experience with R or Python</li>\n<li>Office locations available in order of preference for this role: Boston, MA; Raleigh, NC; Eden Prairie, MN</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>Experience working in an Agile Software Development environment</li>\n<li>Experience with healthcare data</li>\n<li>External reputation in the industry</li>\n<li>Opportunity to travel both nationally and internationally</li>\n</ul>\n\nCareers with Optum. Here's the idea. We built an entire organization around one giant objective; make health care work better for everyone. So when it comes to how we use the world's large accumulation of health-related information, or guide health and lifestyle choices or manage pharmacy benefits for millions, our first goal is to leap beyond the status quo and uncover new ways to serve. Optum, part of the UnitedHealth Group family of businesses, brings together some of the greatest minds and most advanced ideas on where health care has to go in order to reach its fullest potential. For you, that means working on high performance teams against sophisticated challenges that matter. Optum, incredible ideas in one incredible company and a singular opportunity to do your life's best work.SM\n<br><br>\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n<br><br>\nUnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.\n<br><br>\nJob Keywords: Optumconsulting, Boston, MA, Massachusetts, Raleigh, NC, North Carolina, Eden Prairie, MN, Minnesota, analysis, analytics, agile, healthcare, data"}