{"job title": "Scientist/Senior Scientist in Biochemistry/Microbiology", "company": "University of California", "city state": "– San Francisco, CA, US", "rating": "4.1", "job description": "<div>Whole Biome is on a mission to help people improve physical and mental health by creating a new category of products that target the microbiome. We are researching, developing and commercializing a novel class of rationally-designed Live SynbioticsTM (probiotics + prebiotics) that have demonstrated clinical efficacy to treat conditions like metabolic syndrome, inflammation and neurodegeneration. <br><br>Whole Biome has created proprietary pipelines to build a unique discovery platform that identifies key, novel bacterial strains and the prebiotics that feed them. <br><br>We are a highly collaborative team of scientists, engineers, physicians, marketers and salespeople interested in improving human health by using the latest research from diverse fields, such as, microbiology, molecular biology, high-throughput genomics, distributed computing, pharmaceutical development and nutrition. We believe strongly in an individual’s transparency and strong communication to enable the most effective and efficient path to team success.<br><br>If you’re interested in building a new category of products that will help improve the lives of people globally and you love working in a cross-functional, collaborative, inspiring environment, please continue reading!<br><br>Whole Biome is seeking a Scientist/Senior Scientist in Biochemistry/Microbiology to join the Research and Discovery Team. The person will contribute to the Whole Biome mission by leading microbiology projects focused on the isolation, growth, and characterization of anaerobic strains and anaerobic communities. This role requires the design and execution of experiments inside a cross-functional team of engineers, molecular biologists, and statisticians. In addition to fundamentals of anaerobic microbial cultivation and culture collection management, the ideal candidate will have an excellent understanding of the chemical and biochemical measurements useful in understanding microbial physiology and its impacts on human health.<br><br>Key Responsibilities<br>\n<ul><br>\n<li>Execute high-throughput assays with analytical instrumentation, equipment, and associated software such as gas chromatography, liquid chromatography, (RT-) qPCR, or plate-based assays.</li><br>\n<li>Develop novel biochemical, immunological, and/or sequencing based assays and work alongside computational team to build models of complex microbial systems.</li><br>\n<li>Contribute to the isolation, cultivation, and characterization of key anaerobic and aerobic bacterial strains.</li><br>\n<li>Work in cross-functional teams to analyze genomic, metabolomic, and medical data to identify potential novel interventions.</li><br>\n<li>Troubleshoot with manufacturing team on large scale fermentations</li><br>\n<li>Responsible for individual and co-worker safety</li><br>\n</ul><br>\n<br>Key Requirements:<br>\n<ul><br>\n<li>Ph.D. in microbiology, biochemistry or related field.</li><br>\n<li>Extensive hands-on laboratory experience in microbiology and fundamental molecular biology techniques, especially DNA and RNA extraction, and PCR.</li><br>\n<li>Proven record with assay development, especially in high throughput fashion</li><br>\n<li>Experience with NGS library preparation techniques</li><br>\n<li>Experience with liquid handling and laboratory automation</li><br>\n<li>Belief in transparency and open communication and the ability for an individual’s power to improve and enable those around them</li><br>\n</ul><br>\n</div><br>\n<div>At Whole Biome, we understand that success means building great teams to solve challenging problems. We hire the best and brightest and give everyone the resources we need to succeed.<br><br>If you're someone who thrives in a fast-paced environment where autonomy and collaborative teams are equally valued, AND you are excited to dedicate your life to improving health, please get in touch with us!<br><br>​Email with your resume and cover letter to begin the application process. Even if you don't see an opening that fits you, please send us your resume if you think your background and personality would be a great fit!</div>"}