{"job title": "Statistical Data Scientist", "company": "University of California", "city state": "– San Francisco, CA, US", "rating": "4.1", "job description": "Whole Biome is on a mission to help people improve physical and mental health by creating a new category of products that target the microbiome. We are researching, developing and commercializing a novel class of rationally-designed Live SynbioticsTM (probiotics + prebiotics) that have demonstrated clinical efficacy to treat conditions like metabolic syndrome, inflammation and neurodegeneration. ​Whole Biome has created proprietary pipelines to build a unique discovery platform that identifies key, novel bacterial strains and the prebiotics that feed them.\n<br>\n<strong>​</strong>\n<br>\nWe are a highly collaborative team of scientists, engineers, physicians, marketers and salespeople interested in improving human health by using the latest research from diverse fields, such as, microbiology, molecular biology, high-throughput genomics, distributed computing, pharmaceutical development and nutrition. We believe strongly in an individual’s transparency and strong communication to enable the most effective and efficient path to team success. If you’re interested in building a new category of products that will help improve the lives of people globally and you love working in a cross-functional, collaborative, inspiring environment, please continue reading!\n<br><br>\nWhole Biome is seeking a <strong>Statistical Data Scientist</strong> to join the Compute team. The person will contribute to the Whole Biome mission by working with meaningful data to generate impactful evidence and insights on our products that improve people’s health. The ideal candidate will have experience in statistical data analysis and programming. This position will interact closely with the Clinical, R&amp;D, and Laboratory teams.\n<br><br>\nKEY RESPONSIBILITIES\n\n<ul>\n<li><strong>DIVE INTO DATA.</strong> Develop a comprehensive and deep understanding of the data we work with and foster learning with colleagues using analytical tools</li>\n<li><strong>BE AN EXPERT IN APPLYING METHODS.</strong> Adopt analytical methodologies and tools to ensure appropriate and impactful approaches.</li>\n<li><strong>PRODUCE HIGH QUALITY ANALYSES.</strong> Apply rigor in study design and analytical methods; plan for data processing; design and write analysis plan and report, assess effective ways of presenting and delivering the results to maximize impact and interpretability</li>\n<li><strong>COMMUNICATE, COLLABORATE &amp; SHAPE.</strong> Communicate findings to internal stakeholders, regulatory and scientific communities. Collaborate and contribute to functional, cross-functional, and company-wide data science, initiatives or goals on knowledge-sharing, methodologies, innovations, technology to enable broader and more effective use of data to support business.</li>\n</ul>\nREQUIREMENTS\n\n<ul>\n<li>PhD or Master + 2 years of experience in a quantitative data science discipline (e.g., statistics, biostatistics, computer science)</li>\n<li>Fluency in statistical programming languages (R, Python, etc.)</li>\n<li>Experience in Unix/Linux environments using Bash, Make and related Unix tools</li>\n<li>Sound knowledge of theoretical and applied statistics</li>\n<li>Demonstrated entrepreneurial mindset and self-direction, ability to teach others and willingness to learn new techniques</li>\n<li>Desire to work in a cross-functional, collaborative environment that values a balanced life</li>\n<li>Belief in transparency and open communication and the ability for an individual’s power to improve and enable those around them</li>\n<li>Nice to have\n\n\n<ul>\n<li>Experience implementing advanced analytics approaches (machine learning, longitudinal data analysis, etc.)</li>\n<li>Contributor to open source packages, libraries or functions</li>\n<li>Demonstrated track record of developing and execution of patient-level data analyses (e.g., real world data, surveys, clinical trials, registries, claims or genomic)</li>\n</ul>\n​​Email with your resume and cover letter to begin the application process. Even if you don't see an opening that fits you, please send us your resume if you think your background and personality would be a great fit!</li>\n</ul>\n\n​Benefits\n\n<ul>\n<li> competitive salary and equity packages</li>\n<li> health, dental, and vision</li>\n<li> 401k with corporate matching</li>\n<li> flexible schedules with a focus on work/life balance</li>\n<li>unlimited vacation policy (we're all adults and professionals, not clockwatchers)</li>\n<li>commuter benefits</li>\n</ul>\nSweet Perks​\n\n<ul>\n<li>casual culture (66% of founders usually wearing hoodies)</li> \n\n<li>​on-site gym</li>\n<li>work/life balance: we believe it, we encourage it, we live it</li>\n<li>policies that strongly support maternity / paternity leaves</li>\n<li>collaborative, team environment</li>\n<li>off-site, team building adventures</li>\n<li>walking distance to Caltrain, Muni</li>\n<li>walking distance to bars and restaurants in Dogpatch</li>\n</ul>"}