{"job title": "Assistant Lecturer - Data Scientist", "company": "University of Wyoming", "city state": "– Laramie, WY", "rating": "4.0", "job description": "Assistant Lecturer - Data Scientist The Employer invites diverse applicants\n<br>\nto consider our employment opportunities. We are also\n<br>\nespecially interested in candidates who have experience working\n<br>\nwith diverse populations and/or diverse\n<br>\ninitiatives.\n<br>\nThe Employer's College of Education invites\n<br>\napplications from dynamic, qualified candidates with a strong\n<br>\nbackground in data science for a position as a full-time,\n<br>\nbenefited Academic Professional Lecturer (APL) to serve as the\n<br>\nCollege's chief data science officer and teach 1-2 graduate level\n<br>\ncourses in applied data sciences as needed. The individual who\n<br>\nultimately occupies this position must be proficient in software\n<br>\nutilized to collect, analyze and report big data sets of various\n<br>\nsizes and types. In addition, the individual must be able to listen\n<br>\ncarefully to faculty and administrative personnel in the College of\n<br>\nEducation and to our collaborative partners in the P12 settings to\n<br>\ninterpret and meet continuous program, faculty productivity, and\n<br>\npolicy improvement needs. Ability to work effectively in\n<br>\ncollaborative settings, and autonomously is of critical importance.\n<br>\nResponsibilities associated with the position include, but are not\n<br>\nlimited to creating mathematical models, utilizing statistical\n<br>\nsoftware (e.g., SAS, SPSS, R, Minitab, Statistica, Matlab,\n<br>\nJMP, etc.), designing and development of surveys using\n<br>\nsoftware like Qualtrics to answer programmatic questions\n<br>\nand organize data for interpretation, reporting, and use in\n<br>\ncontinuous program, faculty productivity, and policy improvement.\n<br>\nPreferred qualities include an understanding of educational\n<br>\nassessment and/or educational psychometrics, as well as previous\n<br>\nexperience with national accreditation and/or specialized program\n<br>\naccreditation reviews.\n<br>\n<strong>Minimum Qualifications</strong>\n<br><br>\nAn earned doctorate in applied statistical analysis, data\n<br>\nscience, research design, applied psychometrics, or closely related\n<br>\nfield (master's or ABD in data science or closely related field\n<br>\nacceptable)\n<br>\nStrong background in applied data science to include data\n<br>\ncollection, entry, analysis, reporting, and data visualization\n<br>\nExperience working with government, accreditation, licensing,\n<br>\nand other education or policy and program agencies and staffs\n<br>\nStrong statistical and psychometric knowledge, e.g., multiple\n<br>\nregression, logistic regression, data visualization, relational\n<br>\ndatabases, SQL, IRT, generalizability, instrument design and\n<br>\neffectively presented written and verbal reports\n<br>\nExperience creating dashboards (e.g., Tableau) to report data\n<br>\nto interested parties\n<br>\nDemonstration of commitment to diversity and inclusion\n<br>\nDemonstrated or potential ability to work within and across\n<br>\nmultidisciplinary and cross-functional teams is essential (e.g.,\n<br>\nwith other data scientists across campus to answer big data\n<br>\nquestions.)\n<br>\nDemonstrated effectiveness as a college level classroom\n<br>\ninstructor at the undergraduate or graduate levels\n<br><br>\n<strong>Desired Qualifications</strong>\n<br><br>\nExperience or potential for collaborating with internal and\n<br>\nexternal stakeholders\n<br>\nExperience or potential for collaborating with faculty, staff,\n<br>\nand state licensing agencies, P12 educational constituencies, on\n<br>\nreports for accreditation (e.g., CAEP, SPAs), legislative\n<br>\ncompliance and program improvement\n<br>\nProgramming skills (e.g., Python)\n<br><br>\nThe Employer invites diverse applicants\n<br>\nto consider our employment opportunities. We are also\n<br>\nespecially interested in candidates who have experience working\n<br>\nwith diverse populations and/or diverse\n<br>\ninitiatives.\n<br>\nRequired Materials\n<br>\nComplete on-line application and upload the following as\n<br>\none document: cover letter, cv, contact information for\n<br>\nfour (4) work-related references, two (2) of which should be\n<br>\ncurrent or previous supervisors, a teaching philosophy statement,\n<br>\nand evidence of teaching effectiveness including student\n<br>\nevaluations. For further information, contact Dr. Eric Teman\n<br>\nat eteman@uwyo.edu.\n<br>\nHiring Statement\n<br>\nThe Employer is an Equal Employment\n<br>\nOpportunity/Affirmative Action employer. All qualified\n<br>\napplicants will receive consideration for employment without regard\n<br>\nto race, color, religion, sex, sexual orientation, gender identity,\n<br>\nnational origin, disability or protected veteran status or any\n<br>\nother characteristic protected by law and University policy. To\n<br>\nreview the EEO is the Law\n<br>\nPoster and its\n<br>\nSupplement, please see The Diversity &amp;\n<br>\nFairness page.\n<br>\nPursuant to Wyoming State law, W.S. 19-14-102, as amended,\n<br>\nan honorably discharged veteran who has been a resident of the\n<br>\nstate of Wyoming for one (1) year or more at any time prior to the\n<br>\ndate when the veteran applies for employment, or any surviving\n<br>\nspouse who was married to such veteran at the time of the veteran's\n<br>\ndeath, who is receiving federal survivor benefits based on the\n<br>\nveteran's military service and is applying for employment, shall\n<br>\nreceive an interview preference during the applicant screening\n<br>\nprocess with the Employer. At the time of\n<br>\napplication the applicant must possess the business capacity,\n<br>\ncompetency, education or other qualifications required for the\n<br>\nposition. If disabilities do not materially interfere with\n<br>\nperformance of job duties, disabled veterans will be given\n<br>\npreference over able-bodied veterans. Appropriate documentation of\n<br>\nveteran status must be provided at time of application as outlined\n<br>\nin the application process. No preference will be given to a\n<br>\nveteran currently employed by a public department.\n<br>\nWe conduct background investigations for all final\n<br>\ncandidates being considered for employment. Offers of\n<br>\nemployment are contingent upon the completion of the background\n<br>\ncheck.\n<br>\nApplicants with disabilities may request accommodation to\n<br>\ncomplete the application and selection process. Please notify Human\n<br>\nResources at least three (3) working days prior to the date of\n<br>\nneed.\n<br>\nWelcome to Laramie, Wyoming\n<br>\nThe Employer is located in Laramie, a town of\n<br>\n30,000 in the heart of the Rocky Mountain West. The state of\n<br>\nWyoming continues to invest in its university, helping to make it a\n<br>\nleader in academics, research and outreach. The university has\n<br>\nstate-of-the-art facilities in many areas and the community\n<br>\nprovides the advantages of a major university.\n<br>\nLocated in a high mountain valley near the Colorado border,\n<br>\nLaramie offers both outstanding recreational opportunities and\n<br>\nclose proximity to Colorado's Front Range, a bustling group of\n<br>\nmetropolitan cities including Denver, Boulder, and Fort Collins.\n<br>\nThis beautiful mountain landscape offers outdoor enjoyment in all\n<br>\nseasons, with over 300 days of sunshine annually. For more\n<br>\ninformation about the region, please visit http://visitlaramie.org/ The Chronicle of Higher Education. Keywords: Lecturer, Location: Laramie, WY - 82071"}