{"job title": "Research Scientist / Engineer 4 Music", "company": "University of Washington", "city state": "– Seattle, WA", "rating": "4.1", "job description": "As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.\n<br><br>\nUW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a \"Great College to Work For\" for five consecutive years.\n<br><br>\nThe UW Institute for Learning &amp; Brain Sciences (I-LABS) has an excellent opportunity for a Research Scientist Engineer 4 Music.\n<br><br>\nThis position will manage and expand the research program of music and speech learning in early development by designing, conducting, and publishing research studies as well as mentoring students and staff. The position will be highly interdisciplinary in nature, requiring experience in conducting basic and intervention research in music and speech neuroprocessing with various electrophysiological and neuroimaging methods. The hire will foster collaborations nationally and internationally, develop basic and intervention research aimed at understanding the relationship between music learning and development, including cortical and subcortical speech processing, cognitive skills and physiology.\n<br><br>\nThis position will be responsible for managing and expanding an ambitious research program with multiple simultaneous studies, employing a wide variety of experimental designs, data collection techniques, data analysis techniques and subject populations. The incumbent will be a fully competent professional, capable of conducting independent research using behavioral measurements, as well EEG, MEG and MRI techniques under limited supervision. The person in this position must understand the broad strategic objectives of a multi-year research program and be able to foster and maintain collaborations with partners in other departments, institutes and universities. The Research Scientist will serve as a resource in determining the feasibility of research objectives based on his/her understanding of music and speech processing, early speech learning and its neural representation, neuroimaging techniques, familiarity and experience with conducting large scale intervention studies, using behavioral and brain measurements with pediatric populations, and general problem solving abilities. The person in this position will be responsible for every aspect of this work, performing the work personally, and training and supervising other post-doctoral fellows, staff and/or students as needed to accomplish the overall goals.\n<br><br>\n<strong>Duties include :</strong>\n<br><br>\n<strong>EXPERIMENTAL DESIGN (25%)</strong>\n\n\n<ul>\n<li>design large scale intervention studies using M/EEG , MRI technologies as well as behavioral measurements, in order to study brain, speech and cognitive development in infants and adults with various music backgrounds; developing new approaches as well as adapting/modifying standard techniques, employing creative problem solving as needed.</li>\n</ul>\n\n<strong>COLLECTION OF EXPERIMENTAL DATA (20%)</strong>\n\n\n<ul>\n<li>collect brain and behavioral data from varied subject groups including infants with or without intervention</li>\n</ul>\n\n<strong>ANALYSIS OF EXPERIMENTAL DATA (45%)</strong>\n\n\n<ul>\n<li>analyze data and conduct statistical analyses using specialized tools appropriate for the specific brain imaging data. Incumbent will use MATLAB and Python programming languages extensively.</li>\n</ul>\n\n<strong>DISSEMINATION OF RESULTS (10%)</strong>\n\n\n<ul>\n<li>write papers for publication in peer-reviewed journals, and communicate findings through external seminars, workshops, professional conferences</li>\n<li>train, supervise and mentor post-doctoral fellows, staff and/or students on daily work as well as thesis work</li>\n<li>present research findings at professional conferences, write scientific articles for publication and/or grant applications. The hire may act as representative of the I-LABS MEG facility for visitors (including scientists, physicians, legislators and members of the general public), informing them about basic MEG technology and operation.</li>\n</ul>\n\n<strong>MINIMUM QUALIFICATIONS-</strong>\n<br><br>\nLimited Recruitment Open to UW Employees Only\n<br><br>\nA Ph.D. in Psychology, Linguistics, Cognitive Science, Neuroscience, Speech &amp; Hearing Sciences or related field.\n\n\n<ul>\n<li>Four or more years' experience conducting research on the development of music in infants and children, plus experience with neuroimaging techniques.</li>\n<li>Ideal candidate will have significant experience conducting research with infants and children using MEG brain imaging.cation/experience.</li>\n</ul>\n\nEquivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.\n<br><br>\n<strong>Application Process :</strong>\n<br><br>\nThe application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed."}