{"job title": "Data Scientist - Predictive Analytics", "company": "University of Michigan", "city state": "– Ann Arbor, MI", "rating": "4.3", "job description": "Clicking \"Apply Now\" opens the link in a new window.How to Apply<br> <br> A cover letter is required for consideration for this position and should be attached as the first page of your resume. The cover letter should address your specific interest in the position and outline skills and experience that directly relate to this position.<br> <br> Job Summary<br> <br> The Data Scientist works under the direction of the Division of Quality and Health Improvement (DQHI) Manager to support the implementation of the Department of Pathology's value-based (cost + quality + appropriateness) laboratory services to Michigan Medicine providers, payors, and patients. The Data Scientist designs studies, uses clinical data from appropriate Michigan Medicine databases (particularly Epic/Clarity), applies statistical analysis of data extracted, and summarizes analysis in an effective manner to Department of Pathology and Michigan Medicine decision-makers to support evidence-based decisions to identify high impact improvement projects. Works closely with the DQHI Director and Manager, other DQHI staff, Michigan Medicine Quality Analytics, and Department of Pathology Vice Chair for Quality and Clinical Affairs to deliver quantitative insight of clinical care processes that affect laboratory services and vice versa.<br> <br> Responsibilities*<br> <br> * Design, analyze, and implement targeted statistical studies to generate data and insights used to innovate, plan and support improved healthcare outcomes and processes.<br> <br> * Design statistical studies to properly frame improvement opportunities (determine sample size, define data collection methodology and set parameters).<br> <br> * Translate clinical or business needs into analytical solutions.<br> <br> * Apply quantitative data analysis skills to sort through large data sets in an efficient and effective manner.<br> <br> * Apply knowledge of inferential statistics and study data to model the impact of improvement opportunities on a broader population to ensure efficient and effective quality improvement efforts.<br> <br> * Apply knowledge of regression analysis to estimate the relationships among multiple variables contributing to problematic workflow or practices.<br> <br> * Apply scientific method/critical thinking skills to solve complex problems.<br> <br> * Apply proficiency with R, Python, SAS or similar statistical/analytical tool to assigned work.<br> <br> * Validate data quality and reasonableness in reports and/or analyses of health services prior to distribution.<br> <br> * Present findings clearly to project stakeholders to inform decisions and share with larger audiences for informational and educational purposes.<br> <br> * Accurately capture customer goals (both spoken and unspoken) through effective interviewing and questioning skills.<br> <br> * Present analytical findings in clear and understandable manner to non-statistician decision-makers.<br> <br> * Be able to learn and apply a continuous improvement approach to his/her work.<br> <br> * Be able to work effectively in a team environment.<br> <br> * Be able to apply a natural curiosity to one's work.<br> <br> * Be able to help others apply statistical analysis tools and techniques to support their continuous improvement efforts.<br> <br> * Be able to communicate effectively.<br> <br> * Be able to use Excel, Word, and PowerPoint proficiently.<br> <br> Required Qualifications*<br> <br> * B.S. in Statistics or similar quantitative discipline with 3+ years-experience with data science job responsibility.<br> <br> * Working knowledge of statistical/analytical tools such as R, Python, or SAS.<br> <br> * Strong analytical and problem-solving skills with the ability to interpret large amounts of data with business insight to support patient care.<br> <br> * Ability to clearly present statistical solutions to non-statistical people, articulating value and insights to the business.<br> <br> * In-depth knowledge and experience in data mining and statistical modeling techniques (regression, decision tree, time series, etc.).<br> <br> * Knowledge of optimization theory and statistical model application.<br> <br> Desired Qualifications*<br> <br> * Working knowledge of SQL to guide and validate extraction of relevant data from the appropriate Michigan Medicine relational databases.<br> <br> * Knowledge of Clarity database to assigned work.<br> <br> * Background in healthcare to frame problem accurately.<br> <br> * Familiarity with navigating and extracting data from financial databases to assigned work.<br> <br> * Master's degree in Statistics or similar quantitative discipline<br> <br> Background Screening<br> <br> Michigan Medicine conducts background screening and pre-employment drug testing on job candidates upon acceptance of a contingent job offer and may use a third party administrator to conduct background screenings. Background screenings are performed in compliance with the Fair Credit Report Act.<br> <br> Mission Statement<br> <br> Michigan Medicine improves the health of patients, populations and communities through excellence in education, patient care, community service, research and technology development, and through leadership activities in Michigan, nationally and internationally. Our mission is guided by our Strategic Principles and has three critical components; patient care, education and research that together enhance our contribution to society.<br> <br> Application Deadline<br> <br> Job openings are posted for a minimum of seven calendar days. This job may be removed from posting boards and filled anytime after the minimum posting period has ended.<br> <br> U-M EEO/AA Statement<br> <br> The University of Michigan is an equal opportunity/affirmative action employer.<br> <br> Job Detail<br> <br> * Job Opening ID 160947<br> <br> * Working Title Data Scientist - Predictive Analytics<br> <br> * Job Title Statistician Senior<br> <br> * Work Location Michigan Medicine - Health Sys<br> <br> Ann Arbor, MI<br> <br> * Full/Part Time Full-Time<br> <br> * Regular/Temporary Regular<br> <br> * FLSA Status Exempt<br> <br> * Organizational Group Um Hospital<br> <br> * Department UMH Pathology DQHI<br> <br> * Posting Begin/End Date 8/01/2018 8/31/2018<br> <br> * Paid Time Off Yes<br> <br> * Career Interests Pathology / Laboratory Services<br> <br> Research<br> <br> Apply Now<p>SDL2017</p>"}