{"job title": "Research Scientist - Social Work", "company": "University of Houston", "city state": "– Houston, TX", "rating": "4.2", "job description": "<div>The University of Houston Graduate College of Social Work is seeking an exceptional candidate to add to our diverse team of scholars as a Research Scientist in the Center for Drug and Social Policy Research. Duties include: developing and submitting grant proposals to NIH and other funders; conducting mental health and substance abuse intervention research with historically underserved communities; developing abstracts for presentations and manuscripts for journal submissions; mentoring MSW and PhD students; professional development of research center staff; service to the College and University; and other duties as assigned by the primary supervisor. The successful candidate is expected to begin submitting grant proposals immediately to support his/her salary.</div> \n<br>\n<div>\n<div>The University of Houston is a Carnegie-designate Tier One public research university. The mission of the Graduate College of Social Work is to address complex challenges and achieve sustainable social, racial, economic and political justice locally and globally. The GCSW is home to the Virtual Reality Clinical Research Lab, and four diverse research Centers including the Center for the Study of Drug and Social Policy Research, The Child and Family Center for Innovation Research, the Center for Latina Maternal and Family Health Research and the Center for Mental Health Research and Innovations in Treatment Engagement and Service Utilization.</div> </div><br>\n<div>The University of Houston is an Equal Opportunity/Affirmative Action Institute. Minorities, women, veterans, and persons with disabilities are encouraged to apply.</div> \n<br>\n<div>\n\n<ul>\n<li>PhD in Social Work; Masters in Social Work and/or Masters in Public Health Preferred</li><li>Certification in Public Health</li><li>Licensed Social Worker (LMSW or LCSW)</li> <li>Bilingual English/Spanish preferred</li><li>5 years of direct practice and research experience working with historically underserved communities including immigrants, racial and ethnic minorities, and individuals with substance abuse concerns.</li> <li>Experience developing grant proposals.</li></ul></div><br>\n\n<div>The desired candidate must also possess excellent interpersonal communication and leadership skills, and be able to manage multiple complex projects simultaneously. Must work successfully as part of a multidisciplinary team. Preferred candidates will evidence knowledge in budgeting and grants management, and have experience seeking federal and foundation-based external funding. A record of publications in mental health and/or substance abuse commensurate to the position is required.</div>"}