{"job title": "Data Analyst", "company": "University of Virginia", "city state": "– Charlottesville, VA", "rating": "4.3", "job description": "**GENERAL INFORMATION FOR ALL POSTINGS**<br> <br>Posting Summary:<br> <br>Click here for an example.<br> <br>The Center for Diabetes Technology at the University of Virginia is seeking a Data Analyst to provide data management and analysis support. This position assists the Principal Investigators by managing multiple databases and records, conducting data analysis, providing editorial assistance, providing clinical trial assistance which may involve compiling, coding, categorizing and storing data electronically. The incumbent also manages the hardware equipment, monitors the research software program, provides technical support, and collaborates with other team members to further research study and meet office needs.<br> <br>Qualified applicants must have a Bachelor's degree in hand by start date. Relevant experience may be considered in lieu of a degree. At least two years of experience performing data analysis in a scientific environment is preferred. Experience in healthcare is also preferred. Experience or skills with machine learning is highly preferred. Experience gained during pursuit of degree may be considered.<br> <br>** This is a restricted position and continuation is dependent on funding and satisfactory performance **<br> <br>To apply, visit http://jobs.virginia.edu and search on Posting Number #, complete the application and attach a cover letter, a resume/CV contact information for 3 references. This position is open until filled.<br> <br>For questions about this position, please contact Chris Black at cmb2ej@virginia.edu.<br> <br>The University of Virginia is fundamentally committed to increasing the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.<br> <br>**Univ.Staff - Operational &amp; Administrative (O&amp;A;), Managerial &amp; Professional (M&amp;P;)**<br> <br>EO/AA Statement:<br> <br>The University of Virginia is an equal opportunity and affirmative action employer. Women, minorities, veterans and persons with disabilities are encouraged to apply.<br> <br>**Univ.Staff - O&amp;A; or M&amp;P; - EMPLOYMENT CONDITIONS**<br> <br>Employment Conditions:<br> <br>Criminal History<br> <br>Sexual Offender Registry<br> <br>Degree Validation<br> <br>*Posting Number:* 0624505<br> <br>*Position Type:* University Managerial and Professional Staff<br> <br>*Employment Posting Category:* University Staff<br> <br>*Type of Application:* Staff Application<br> <br>*Organization (Position Organization):* 40480 MD-CDBT Ctr for Diabetes Tech<br> <br>*Department:* Center for Diabetes Technology<br> <br>*Location:* Charlottesville<br> <br>*Working Title:* Data Analyst<br> <br>*Anticipated Hiring Range:* $50,000-$55,000<br> <br>*Is this position funded in whole or in part by the American Recovery &amp; Reinvestment Act (Stimulus Package)?:* No<br> <br>*Posting Date:* 11-15-2018<br> <br>*Closing Date:* Open Until Filled<br> <br>*Required Applicant Documents:* CV / Resume<br> <br>*E-mail a Friend:* jobs.virginia.edu/applicants/Central?quickFind=86048<br> <br>*Area of Interest:* No Response<br> <br>*FLSA Exemption Status:* Exempt<br> <br>*Posting for UVA Employees Only:* No<br> <br>*Shift:* Day<br> <br>*Number of Work Hours Per Week:* 40<br> <br>*Number of Months/Year:* 12<br> <br>*Optional Applicant Documents:* Contact information for 3 References - name, email, phone<br> <br>*Required Education:* *Degree or Equivalent Experience Required<br> <br>*If degree or equivalent experience:* B.S. in Computer Science, Data Science, Engineering, Information Technology, Data Management, or similar.<br> <br>*Preferred Education:* *Degree Preferred<br> <br>*Required Experience:* Some - up to 4 years<br> <br>*If any experience is:* At least two years of experience in scientific, experimentation and research techniques applicable to the branch of science involved.<br> <br>*Preferred Experience:* Some - up to 4 years<br> <br>*Knowledge, Skills and Abilities:* Knowledge of Diabetes technology.<br> <br>*Computer Applications:* MS Visual Basic for Applications (VBA), Python (or other scripting language)<br> <br>*Drug Testing Required?:* No<br> <br>*Is this position eligible for Telecommuting?:* No<br> <br>*Is this position eligible for an Alternate Work Schedule?:* Yes"}