{"job title": "Healthcare Data Scientist", "company": "University of Maryland Medical System", "city state": "– Linthicum, MD", "rating": "3.4", "job description": "I. <strong>General Summary</strong>\n<br><br>\nThe Healthcare Data Scientist position will join our Advanced Analytics group at the University of Maryland Medical System (UMMS) in support of its strategic priority to become a data-driven and outcomes-oriented organization. The successful candidate will have 3+ years of experience with Machine Learning, Predictive Modeling, Statistical Analysis, Mathematical Optimization, Algorithm Development and a passion for working with healthcare data. Previous experience with various computational approaches along with an ability to demonstrate a portfolio of relevant prior projects is essential. This position will report to the UMMS Vice President for Enterprise Data and Analytics (ED&amp;A).\n<br><br>\nII. <strong>Principal Responsibilities and Tasks</strong>\n<br><br>\n• Develops predictive and prescriptive analytic models in support of the organization’s clinical, operations and business initiatives and priorities.\n\n\n<ul>\n<li>Deploys solutions so that they provide actionable insights to the organization and are embedded or integrated with application systems</li>\n<li>Supports and drives analytic efforts designed around organization’s strategic priorities and clinical/business problems</li>\n<li>Works in a team to drive disruptive innovation, which may translate into improved quality of care, clinical outcomes, reduced costs, temporal efficiencies and process improvements.</li>\n<li>Builds and extends our analytics portfolio supported by robust documentation</li>\n<li>Works with autonomy to find solutions to complex problems using open source tools and in-house development</li>\n<li>Stays abreast of state-of-the-art literature in the fields of operations research, statistical modeling, statistical process control and mathematical optimization</li>\n<li>Creates, communicates, and manages the project plans and other required project documentation and provides updates to leadership as necessary</li>\n<li>Develops and maintains relationships with business, IT and clinical leaders and stakeholders across the enterprise to facilitate collaboration and effective communication</li>\n<li>Works with the analytics team and clinical/business stakeholders to develop pilots so that they may be tested and validated in pilot settings</li>\n<li>Performs analysis to evaluate primary and secondary objectives from such pilots</li>\n<li>Assists leadership with strategies for scaling successful projects across the organization and enhances the analytics applications based on feedback from end-users and clinical/business consumers</li>\n<li>Assists leadership with dissemination of success stories (and failures) in an effort to increase analytics literacy and adoption across the organization.</li>\n\n</ul>"}