{"job title": "Associate Scientist, Data Science", "company": "Universities Space Research Association", "city state": "– Mountain View, US-CA", "rating": "3.3", "job description": "The Universities Space Research Association (USRA) has a mission to advance space-related sciences and exploration through innovative research, technology, and education programs that involve universities, governments, and the private sector for the benefit of humanity. Supporting that mission, the USRA Research Institute for Advanced Computer Science (RIACS) collaborates with the Data Science Group at NASA Ames Research Center to support the goal of better organizing, extracting and presenting relevant information buried in a variety of large real-world data sets using machine learning techniques.\n<br><br>\n<strong>Position Summary:</strong>\n<br><br>\nAssociate Scientist for Data Sciences will conduct applied research and development on the application machine learning techniques to a portfolio of NASA applications with focus on aeronautics applications. Associate Scientist will work with other data science team members, and serve as technical lead related to aeronautics applications. Associate Scientist will also be involved with development of proposals for new collaborations involving both academia and industry, for joint public-private initiatives to address key national challenges.\n<br><br>\n<strong>Essential Duties/Responsibilities:</strong>\n<br><br>\nSatisfy USRA's non-profit mission by making a distinctive impact through scientific and technical\n\n<ul>\n<li>Engage academic, industrial, and government research communities in collaborative research through activities such as seminars and other talks, workshops, and conferences.\n\n\n<ul>\n<li>Prepare and deliver briefings and presentations to various national and international seminars, talks or lectures for dissemination of knowledge including educational outreach.</li>\n\n<li>Write several publications of considerable interest and value to the field as evidenced by favorable reviews, by citation in the work of others, by presenting papers to professional societies, and/or will have contributed inventions, new designs or research, which are of material significance in the solution of important applied problems.</li>\n\n<li>Engage the academic community in research work through research collaborations, visits, invited guests, workshops, conferences, etc.</li>\n\n<li>Act as a mentor for student interns involved in machine learning research.</li>\n</ul>\n\n</li>\n</ul>\n\n\n\n<ul>\n<li>Plan, schedule, and conduct activities in all phases of research projects, as a PI or Co-I and as a member of a larger research team.\n\n\n<ul>\n<li>Assess suitability of different methods for targeted applications, and develop new methods and embody in software implementations as needed.</li>\n\n<li>Prepare research results for publication in reports, papers, journals, books, and other media.</li>\n\n<li>Prepare reports of your scientific and other activity for purposes of periodic reports to NASA and USRA management, including for self-evaluation for annual performance appraisals.</li>\n\n<li>Support strategic planning and annual metrics reporting including analyzing and anticipating relevant research trends and their implications, and for program development including efforts to broaden and strengthen the NASA relationship and to diversify the sponsor/customer base.</li>\n</ul>\n\n</li>\n</ul>\n\n\n\n<ul>\n<li>Support goal to better organize, extract and present relevant information buried in a variety of large real world data sets</li>\n\n<li>Other job duties as assigned</li>\n</ul>\n<strong>Required Qualifications</strong>\n<br><br>\n<strong>Education:</strong>\n\n<ul>\n<li>M.S. or Ph.D. degree in Data Science, Computer Science or a related discipline</li>\n</ul>\n<strong>Skills:</strong>\n\n<ul>\n<li>Requires familiarity with efficient data manipulation techniques with various data mining and machine learning methods applied to “Big data”, data with large volume, high velocity, high variability and changing definitions</li>\n\n<li>Be familiar with typical “applied data mining research: Assessment of existing methods’ suitability for application for targeted problem, articulate inadequacies in methods if any exist</li>\n\n<li>Formulate and develop new methods or modifications of existing methods for target problems</li>\n\n<li>Ensure transparency of algorithms to user experience; develop software and visualization modes of presentation and interaction</li>\n</ul>\n<strong>Desired Experience:</strong>\n\n<ul>\n<li>Two to five years of experience applying machine learning techniques to the aeronautics domain</li>\n\n<li>A strong track record of research success as evidenced by publishing related work in peer reviewed journals, and contributing to obtaining new funding in the areas above.</li>\n\n<li>Documentation of new methods in form of technical reports and Peer Reviewed Publication</li>\n\n<li>Excellent organizational and communication skills.</li>\n\n<li>Experience as a Principal Investigator (PI)</li>\n</ul>\n<strong>Knowledge, Skills and Abilities:</strong>\n\n<ul>\n<li>Ability to work independently and effectively as part of a multidisciplinary team.</li>\n\n<li>Ability to prioritize tasks, coordinates work of others, and meets multiple deadlines.</li>\n\n<li>Ability to communicate through conference presentations and scientific publications is essential.</li>\n\n<li>Ability to propose credible and innovative research projects, develop the necessary skills to perform the work, and carry out the research, providing the required reporting to the granting agency in a timely fashion.</li>\n\n<li>Ability to interpret USRA and Federal Policies and Procedures necessary to function in a scientific research environment that is enabled through U.S. Government funds.</li>\n\n<li>Advanced experimental and analytical skills.</li>\n</ul>\n<strong>Working Conditions</strong>:\n<br><br>\nThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, etc. Keyboarding for large time spans each day will be a significant part of this position. This is largely a sedentary role.\n<br><br>\n<strong>Travel</strong>:\n<br><br>\nEmployee must be willing and able to travel. Position may require domestic and international business travel.\n<br><br>\nApplicants should apply to the posting at <strong>https://usracareers.silkroad.com/</strong> and include a letter of interest, resume, or curriculum vita. Review of candidates will begin immediately. Additional information on USRA can be found at <strong>www.usra.edu</strong>.\n<br><br>\nUSRA is an Equal Opportunity Employer Minorities/Females/Protected Veterans/Disabled/Sexual Orientation/Gender Identity<br><br>Required Skills\n<br><br>\n<strong>Required Experience</strong>\n<br><br>\nJob Location\n<br>\nMountain View, US-CA\n<br>"}