{"job title": "Metabolic Pathways Genomics Data Scientist", "company": "University of California", "city state": "– San Francisco, CA, US", "rating": "4.1", "job description": "​We are currently seeking a data scientist with experience in analyzing biological pathways in the context of biochemical/cell assay data as well as high-throughput genomics. This position will report to the Senior Staff Data Scientist and be responsible for supporting both bench and clinical scientists. Broadly, this position will involve the following activities:\n<br><br>\nDesign, analyze, interpret complex multivariate genomics pathway data in collaboration with lab biologists and fellow data scientists\n<br><br>\nProvide synthesis of actionable biological findings in presentations to internal stakeholders\n<br><br>\nDevelop and contribute to data science software packages\n<br><br>\nNice to Have:\n<br><br>\nPhD in Statistics, Computational Biology, Computer Science or related field\n<br><br>\nTraining in the interpretation of bacterial genomes and associated metabolic and/or signaling pathways\n<br><br>\nStrong understanding of bioinformatics algorithms, e.g., sequence assembly and alignment, genomic annotation\n<br><br>\nSolid knowledge of statistical techniques, e.g., EDA, regression analysis, hypothesis testing and ML methods\n<br><br>\n3 years industry experience in R\n<br><br>\n3 years in Unix/Linux environments using Bash, Make and related Unix tools\n<br><br>\n1 year of professional Python\n<br><br>\nIndependent thinker\n<br><br>\nSALARY AND CLASSIFICATION:\n<br><br>\nClassification: Full-Time position\n<br><br>\nCompensation: Competitive and commensurate with experience; includes equity package\n<br><br>\nBenefits: Medical, dental and vision; 401k with matching\n<br><br>\nABOUT THE COMPANY:\n<br><br>\nWhole Biome is ushering in a revolution in diagnostics and therapeutics where each individual’s treatment will be driven by a comprehensive understanding and a targeted equilibration of their microbiome.\n<br><br>\nWe are developing novel classes of therapeutics and diagnostics that target the human microbiome to improve the lives of patients suffering from a variety of diseases. At Whole Biome, we employ cutting-edge technology in our R&amp;D pipeline. We are passionate about building products that are best-in-class and we are looking for individuals who embody that same desire.\n<br><br>\nHOW TO APPLY:\n<br><br>\nPlease forward a cover letter and resume."}