{"job title": "Scientific Programmer, Data Scientist", "company": "University of Arizona", "city state": "– Tucson, AZ", "rating": "4.1", "job description": "The College of Agriculture and Life Sciences and Data Science Institute at the University of Arizona uses big data to improve agriculture. We seek a scientific programmer to develop and maintain data collection, transfer, and analysis pipelines. Our team develops open source software and open data to advance research for the improvement of crops and cropping systems. We develop generalized pipelines and software tools to harmonize data and enable research. Data are generated from a suite of imaging and environmental sensors deployed on UAVs, tractors, robots, and in the field. Our goal is to enable the use of such sensors, to develop and deploy algorithms, and make data work for scientific insight and engineering applications. The incumbent will work with a wide range of scientists and engineers at the University of Arizona as well as at research stations and collaborating academic institutions. The incumbent will be expected to provide leadership in the development of new software and the adoption of best-practices to support quality control, to remain current on the latest technologies, to apply new knowledge to a cutting edge system, and to provide leadership in design and implementation decisions. Outstanding UA benefits include health, dental, and vision insurance plans; life insurance and disability programs; paid vacation, sick leave, and holidays; UA/ASU/NAU tuition reduction for the employee and qualified family members; state and optional retirement plans; access to UA recreation and cultural activities; and more! The University of Arizona has been listed by Forbes as one of America's Best Employers in the United States and WorldatWork and the Arizona Department of Health Services have recognized us for our innovative work-life programs. For more information about working at the University of Arizona and relocation services, please click here.<br><br>SDL2017"}