{"job title": "Data Scientist", "company": "University of Southern California", "city state": "– Los Angeles, CA", "rating": "4.3", "job description": "<strong>Information Sciences Institute (ISI)</strong>, a unit of USC’s Viterbi School of Engineering, is a world leader in the research and development of advanced information processing, computing, and communications technologies. ISI operates one of the world’s largest academic high-performance computing clusters. ISI has three research campuses: one in Marina Del Rey, CA; one in Arlington, VA; and one in Waltham, MA.\n<br><br>\n<strong>*This position is located in Marina del Rey, CA.*</strong>\n<br><br>\nInformation Sciences Institute (ISI) seeks a Data Scientist who has expertise at the intersection of data science, ontologies, and environmental sciences.\n<br><br>\nJob Accountabilities:\n<ul>\n<li>Identifies, researches, compiles and evaluates data sources, background information and/or technology related to area of specialization.</li><li>Analyzes and evaluates research data utilizing computers and provides interpretations requiring significant knowledge of a specialized area of research. Searches literature, utilizing all available resources including electronic, regarding new methodology and designs experiments accordingly.</li><li>Contributes to the development of research documentation for publication and/or prepares technical reports, papers and/or records.</li><li>Understands how to use existing software packages and libraries to analyze different types of data, including software for machine learning, data pre-processing and reformatting, and visualizations.</li><li>Serves as a senior researcher with expertise in field. Plans, designs and conducts highly technical and complex research projects independently and in consultation with supervisor, which require the regular use of ingenuity and innovation. May contribute to the development of new concepts, techniques and standards. Exercises considerable latitude in determining research objectives and approaches.</li><li>Develops solutions to complex research problems, which require the regular use of ingenuity and innovation. Ensures solutions are consistent with research objectives.</li><li>Provides leadership, direction and guidance to staff and/or student workers regarding procedures, techniques and use of equipment as needed.</li>\n</ul>\nThe University of Southern California values diversity and is committed to equal opportunity in employment."}