{"job title": "Computational and Data Science Research Specialist", "company": "University of California", "city state": "– San Diego, CA", "rating": "4.1", "job description": "This is a 100% contract appointment that may be extended or converted to career status based on the needs of the department.\n\n\n<ul>\n<li>This position is open until filled.</li>\n</ul>\n\n<strong>DESCRIPTION</strong>\n<br><br>\nThe UC San Diego Department of Bioengineering consists of ~25 ladder rank faculty, ~650 enrolled undergraduate students, ~170 graduate students, ~ 60 postdoctoral scholars, and ~120 staff positions. The department is consistently ranked as one of the top departments of Bioengineering in the world. It has a $6M annual allocation of State and University funds and holds a multi-million research portfolio (15.5 MIL in contract &amp; grant expenditures), including awards (but not limited) from the NIH, NSF, other federal flow through, and gifts/private funding.\n<br><br>\nThe department of Bioengineering is one of six departments in the nationally ranked Jacobs School of Engineering. It enjoys close collaborations with the UC San Diego School of Medicine, the Institute of Engineering in Medicine (IEM), the Scripps Research Institute, the Sanford Burnham Institute and the Salk Institute for Biological Studies.\n<br><br>\nThe UC San Diego Department of Bioengineering offers the following graduate degrees: Masters of Engineering, Masters of Science, combined Bachelors of Science/Masters of Science, Ph.D. and (in conjunction with the UC San Diego School of Medicine) a combined M.D./Ph.D. degree program.\n<br><br>\nApplies skills as a seasoned, experienced IT research professional. Uses computational, computer science, data science, and CI software research and development principles, with relevant domain science knowledge where applicable, along with professional programming concepts for medium-sized projects or portions of larger projects.\n<br><br>\nDevelops and optimizes a variety of computational, data science, and CI research tools and components. Performs research on current and future HPC, data, and CI technologies, hardware and software projects. Works on algorithm development, optimization, programming, performance analysis and/or benchmarking assignments of moderate scope where the tasks involve knowledge of either domain/computer science research requirements and/or CI design/implementation requirements.\n<br><br>\nDevelops, analyzes and design functions for SBRG's system and network software. Duties include analyze and design new systems and enhancements to existing systems as well as determine source data (input), processing requirements (output), output formats, timing and cost estimate. Verify that all SBRG systems and networks meet performance criteria as well as design, implement, computational data and document procedures, installing and testing moderately complex software packages and maintaining operating systems and software for the SBRG.\n<br><br>\n<strong>QUALIFICATIONS</strong>\n\n\n<ul>\n<li>Advanced skills, and demonstrated experience associated with one or more of the following: HPC hardware and software power and performance analysis and research, design, modification, Implementation and deployment of HPC or data science or CI applications and tools.</li>\n<li>Thorough experience working in a complex computing/data/CI environment encompassing all or some of the following: HPC, data science infrastructure and tools/software, and diverse domain science application base.</li>\n<li>Demonstrated broad experience in one or more of the following: optimizing, benchmarking, HPC performance and power modeling, analyzing hardware, software, and applications for HPC/ data/CI.</li>\n<li>Proven experience in independently resolving broad computing/data/CI problems using introductory and/or intermediate principles.</li>\n<li>Intermediate knowledge of HPC/data science/CI.</li>\n<li>Demonstrated ability to regularly interface with management.</li>\n<li>Demonstrated ability to contribute research and technical content to grant proposals.</li>\n<li>Proven ability to understand research computing/data/CI needs, mapping use cases to requirements and how systems/software/infrastructure can support those needs and meet the requirements. Ability to develop and implement such solutions.</li>\n<li>Strong effective communication and interpersonal skills. Ability to communicate technical information to technical and non-technical personnel at various levels in the organization and to external research and education audiences.</li>\n<li>Demonstrated experience and ability to collaborate effectively with all levels of staff; technical, students, faculty and administrators.</li>\n<li>Self-motivated and works independently and as part of a team. Able to learn effectively and meet deadlines. Proven ability to successfully work on multiple concurrent projects.</li>\n</ul>\n\nApply Now\n<br><br>\nThe University of California is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected veteran status, gender identity or sexual orientation. For the complete University of California nondiscrimination and affirmative action policy see: http://www-hr.ucsd.edu/saa/nondiscr.html\n<br><br>\nUC San Diego is a smoke and tobacco free environment. Please visit smokefree.ucsd.edu for more information."}