{"job title": "Senior Data Management and Integration Scientist - Colorado Evaluation and Action Lab", "company": "University of Denver", "city state": "– Denver, CO", "rating": "3.9", "job description": "Tracking Code006077 Job Description\n<br><br>\nThe Colorado Evaluation and Action Lab (\"Colorado Lab\") is a collaboration between the University of Denver and the Colorado Governor's office. The mission of the Colorado Lab is to improve the lives of Colorado residents by partnering with state and local governments to strengthen coordinated and efficient person-centered services. A major portfolio of work at the Colorado Lab is to support state agency partners and develop the Linked Information Network of Colorado (LINC), a centralized capacity in the Governor's Office of Information Technology (OIT) that will integrate data across state agencies for approved research and analytic projects.\n<br><br>\nThe Senior Data Management and Integration Scientist (SDIS) will be working within OIT to serve as the primary staff for LINC data management and integration needs. Through June 2019, the SDIS will be a benefited employee of the University of Denver. The SDIS will report to the Director of Data Integration and Analytics at the Colorado Lab, but this person will be located within OIT and day-to-day operations will be overseen by the Chief Data Officer at OIT. OIT and the Colorado Lab will communicate frequently to ensure both organizations' objectives and direction are aligned.\n<br><br>\nThe SDIS will be responsible for linking data from state agencies for approved projects through a to-be-determined identity resolution process, then deidentifying, anonymizing or aggregating the data for requestors based on parameters established by a governing body. Critical to the success of this position is the ability to identify and implement solutions that do not presently exist to address data management and integration challenges within OIT. This will involve taking the initiative to find solutions from other jurisdictions or expert resources from organizations or online forums. While the SDIS will have direct guidance and supervision at OIT and the Colorado Lab, the expectation is that the SDIS has enough expert experience in data management and integration to make educated independent decisions.\n<br><br>\nThis is a temporary, full-time benefitted position at the University of Denver through June 2019. The role will then be transitioned to a temporary, full-time benefitted staff position located in OIT from July 2019 to June 2020, with the expectation of a permanent full-time, benefitted staff position starting July 2020.\n<br><br>\n<strong>Position Summary</strong>\n\n\n<ul>\n<li>Develop standards and best practice procedures for sensitive data management, identity resolution, data validation, data cleansing, and data anonymization.</li>\n<li>Manage multiple datasets or data flows from various sources and, maintain relational databases, and develop processes to ensure data integrity and standardization.</li>\n<li>Query and profile data to determine conformance to standards and fitness for purpose.</li>\n<li>Document and maintain records of all data management and data integration activities.</li>\n<li>Maintain up-to-date knowledge of regulatory requirements and industry best practices as it relates to data stewardship, identity resolution and obfuscation (or other means of protecting privacy and security of data).</li>\n<li>Train users on data structure to enable analytic goals.</li>\n<li>Productively engage with governmental agency staff and external researchers as needed.</li>\n<li>Perform other related duties as required.</li>\n</ul>\n\nKnowledge, Skills and Abilities\n\n\n<ul>\n<li>Knowledge of data stewardship regulatory requirements and industry best practice.</li>\n<li>Ability to establish routines for data cleansing.</li>\n<li>Excellent oral communications and experience with technical writing.</li>\n<li>Exceptional project management and problem solving skills.</li>\n<li>Demonstrated track record of documenting and maintaining records of data management processes.</li>\n<li>Self-motivated to find solutions to challenges with limited supervisory direction.</li>\n<li>Eagerness to learn, attention to detail, and ability to multitask.</li>\n</ul>\n\nRequired Qualifications\n\n\n<ul>\n<li>Graduate degree in data science or related field.</li>\n<li>At least five years of experience managing and integrating administrative data.</li>\n<li>Expertise in relational databases, scripting and coding to automate and monitor data management processes.</li>\n<li>Experience with ETL processes.</li>\n</ul>\n\nPreferred Qualifications\n\n\n<ul>\n<li>In-depth knowledge of at least two major administrative data areas (e.g., Medicaid Claims, Labor and Employment, Education, Criminal Justice, etc.).</li>\n<li>Experience with Geographic Information Systems.</li>\n<li>Coursework in statistics and/or research methods.</li>\n</ul>\n\nWork Schedule\n<br><br>\nMonday - Friday 8:00 am - 4:30 pm.\n<br><br>\nApplication Deadline\n<br><br>\nApplications will be accepted until the position is filled.\n<br><br>\nSpecial Instructions\n<br><br>\nCandidates must apply online through www.du.edu/jobs to be considered. Only applications submitted online will be accepted. Once within the job description online, please scroll to the bottom of the page to apply. For questions about the position, please contact Whitney LeBoeuf at Whitney.LeBoeuf@du.edu.\n<br><br>\nTo receive full consideration for the position, please include the following documents with your application:\n\n\n<ul>\n<li>Resume</li>\n<li>Cover Letter</li>\n<li>Summary of 3-5 projects for which candidate was responsible for managing and integrating administrative data including list of data sources (maximum of 2 pages).</li>\n</ul>\n\nPLEASE NOTE: The online system is limited to uploading 10 files. Please combine content if necessary to get all content uploaded.\n<br><br>\nThe University of Denver is an affirmative action employer and that age 40 and over, color, disability, gender identity, genetic information, military or veteran status, national origin, race, religion, sex, sexual orientation or any other applicable status protected by state or local law are not taken into account in any employment decision.\n<br><br>\nAll offers of employment are based upon satisfactory completion of a criminal history background check.\n<br><br>\nDepartmentBarton Institute (335101)Position TypeFull-Time/Regular"}