{"job title": "Associate Research Scientist", "company": "University Of Michigan", "city state": "– Ann Arbor, MI", "rating": "4.3", "job description": "Clicking \"Apply Now\" opens the link in a new window.How to Apply\n<br><br>\nPlease send CV and letter of interest to Chris Berry @erijas@umich.edu or\n<br><br>\nEmergency Medicine\n<br><br>\nAttn: Chris Berry\n<br><br>\n1500 E. Medical Center Drive\n<br><br>\n<strong>B1-220</strong>\n<br><br>\nAnn Arbor, MI 48109-5301\n<br><br>\nJob Summary\n<br><br>\nCandidate will be a team member of the RESEARCH ADMINISTRATION within the Department of Emergency Medicine. Candidate should have a clear potential of a distinguished record of scholarship, and demonstrate potential for collaborative and interdisciplinary work with a focus on statistical analytics and modeling. Candidate will assist with gathering and interpretation of data and collaborate with Emergency Medicine faculty on grants and manuscripts. Specifically, candidate will conduct research using statistical analytics and modeling, publish and present results, secure extramural funding in the co-investigator or principal investigator role.\n<br><br>\nRequired Qualifications*\n<br><br>\nPhD is required. Previous research work experience using statistical analytics and modeling. Strong record of high quality research manuscripts/publications as first or senior author is also required.\n<br><br>\nBackground Screening\n<br><br>\nMichigan Medicine conducts background screening and pre-employment drug testing on job candidates upon acceptance of a contingent job offer and may use a third party administrator to conduct background screenings. Background screenings are performed in compliance with the Fair Credit Report Act.\n<br><br>\nU-M EEO/AA Statement\n<br><br>\nThe University of Michigan is an equal opportunity/affirmative action employer.\n<br><br>\nJob Detail\n\n\n<ul>\n<li>Job Opening ID 165334</li>\n<li>Working Title ASSOCIATE RESEARCH SCIENTIST</li>\n<li>Job Title ASSOC RES SCIENTIST</li>\n<li>Work Location Ann Arbor Campus</li>\n</ul>\n\nAnn Arbor, MI\n\n\n<ul>\n<li>Full/Part Time Full-Time</li>\n<li>Regular/Temporary Regular</li>\n<li>FLSA Status Exempt</li>\n<li>Organizational Group Medical School</li>\n<li>Department Emergency Medicine Research</li>\n<li>Posting Begin/End Date 11/15/2018 11/22/2018</li>\n<li>Career Interest Primary</li>\n</ul>\n\nApply Now"}