{"job title": "Sr Research Scientist 1", "company": "University Of New Mexico", "city state": "– Albuquerque, NM", "rating": "3.8", "job description": "The UNMCCC is seeking a Sr Research Scientist 1 to join our Clinical Research Office. In addition to conventional Research Scientist responsibilities, this position will provide leadership and guidance, floating coverage as necessary, and orientation and training to our Research Scientist staff. The incumbent will also participate in the development of new and revised processes/SOPs and attend/participate in internal meetings and organizational planning.\n<br><br>\nThe University of New Mexico Comprehensive Cancer Center is the Official Cancer Center of New Mexico and the only National Cancer Institute-designated Cancer Center in a 500-mile radius. Its 125 board-certified oncology specialty physicians include cancer surgeons in every specialty (abdominal, thoracic, bone and soft tissue, neurosurgery, genitourinary, gynecology, and head and neck cancers), adult and pediatric hematologists/medical oncologists, gynecologic oncologists, and radiation oncologists. They, along with more than 500 other cancer healthcare professionals (nurses, pharmacists, nutritionists, navigators, psychologists and social workers), provided cancer care for nearly 60 percent of the adults and children in New Mexico affected by cancer. They treated 11,249 patients in 84,875 ambulatory clinic visits in addition to in-patient hospitalizations at UNM Hospital. These patients came from every county in the State. More than 12 percent of these patients participated in cancer clinical trials testing new cancer treatments and 35 percent of patients participated in other clinical research studies, including tests of novel cancer prevention strategies and cancer genome sequencing. The 130 cancer research scientists affiliated with the UNMCCC were awarded almost $60 million in federal and private grants and contracts for cancer research projects and published 301 high quality publications. Promoting economic development, they filed more than 30 new patents in FY16, and since 2010, have launched 11 new biotechnology start-up companies. Scientists associated with the UNMCCC Cancer Control &amp; Disparities have conducted more than 60 statewide community-based cancer education, prevention, screening, and behavioral intervention studies involving more than 10,000 New Mexicans. Finally, the physicians, scientists and staff have provided education and training experiences to more than 230 high school, undergraduate, graduate, and postdoctoral fellowship students in cancer research and cancer health care delivery. Learn more at http://cancer.unm.edu.\n<br><br>\nSee the Position Description for additional information.\n<br><br>\nConditions of Employment\n\n\n<ul>\n<li>Successful candidate must submit to a post-offer, pre-employment physical examination and medical history check. Additional health screenings may be required, dependent on the nature of the research conducted, as determined by Employee Occupational Health Services.</li>\n</ul>\n\n<strong>Minimum Qualifications</strong>\n<br><br>\nMaster's degree; at least 5 years of experience directly related to the duties and responsibilities specified.\n<br><br>\nCompleted degree(s) from an accredited institution that are above the minimum education requirement may be substituted for experience on a year for year basis.\n<br><br>\nPreferred Qualifications\n\n\n<ul>\n<li>Oncology clinical research experience</li>\n<li>Lead or supervisory experience a plus</li>\n</ul>\n\nAdditional RequirementsFinalists should be prepared to provide official educational transcripts if selected for hire.\n<br><br>\nApplicants must provide names of 3 past or present supervisors as references that the hiring official can contact.CampusHealth Sciences Center (HSC) - Albuquerque, NMDepartmentCRTC Clinic Rsrch Data Management (099L)Employment TypeStaffStaff TypeRegular - Full-TimeTerm End DateStatusExemptPay$3,956.33 - $5,924.53Benefits EligibleThis is a benefits eligible position. The University of New Mexico provides a comprehensive package of benefits including medical, dental, vision, and life insurance. In addition, UNM offers educational benefits through the tuition remission and dependent education programs. See the Benefits home page for a more information.ERB StatementTemporary and on-call employees working an appointment percentage of 26 (.26 FTE) or greater, per quarter, will be eligible to earn retirement service credits and thus are required to make New Mexico Educational Retirement Board (NMERB) contributions. More information pertaining to your FTE and NMERB contributions can be reviewed on the NMERB Guidelines Clarified webpage.Background Check RequiredYesFor Best Consideration Date10/29/2018Application InstructionsAPPLICANT: Please complete the official application; making sure to include all prior work experience and average hours worked per week. Attach your Current Resume; listing three former or current Supervisor References. Attach your Cover Letter that details how your experience matches the position as described above; including any Preferred Qualifications.\n<br><br>\nPositions posted with a Staff Type of Regular or Term are eligible for the Veteran Preference Program. See the Veteran Preference Program webpage for additional details.\n<br><br>\nThe University of New Mexico is committed to hiring and retaining a diverse workforce. We are an Equal Opportunity Employer, making decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran status, disability, or any other protected class.<br><br>SDL2017"}