{"job title": "Research Scientist", "company": "University of Virginia", "city state": "– Charlottesville, VA", "rating": "4.3", "job description": "**GENERAL INFORMATION FOR ALL POSTINGS**<br> <br>Posting Summary:<br> <br>Click here for an example.<br> <br>The Department of Cell Biology at the University of Virginia School of Medicine seeks Research Scientists to work in Dr. Christine Thisse's laboratory to study the transcriptional control of the formation of a ciliated epithelium by downstream mediators and regulators of the Hippo signaling pathway using the zebrafish as a model system. The work in the laboratory integrates developmental and molecular biology approaches as well as genetics and genomics. Of particular interest will be the identification of the transcriptional network regulated by downstream mediators and regulators of the Hippo signaling pathway and their functional relationships during the Left-Right organizer formation.<br> <br>The role of the person holding this position also includes supervision of undergraduate students, as well as an involvement in writing manuscripts and presenting data at various seminars and meetings.<br> <br>Candidates must have a PhD or MD, 5 years of postdoctoral experience in developmental biology, molecular biology, genomics in areas relevant to topics described above. Expertise in imaging and animal models are strongly preferred. Excellent communication skills and the ability to work independently and productively are required.<br> <br>The environment in Cell Biology at UVa is highly supportive and interactive, including joint research meetings and seminars in various aspects of cell and developmental biology. For additional information about the research in the department, please visit the department's Web site:http://www.virginia.edu/cellbiology/<br> <br>For questions about this posting or the application process, contact Gay Lynn Tonelli at glt9c@virginia.edu<br> <br>To apply, visit https://jobs.virginia.edu; and search on posting # 0624490 or visit https://jobs.virginia.edu/applicants/Central?quickFind=86035. Complete a Candidate Profile online, attach a cover letter, curriculum vitae, and contact information for three references. The position will be open until filled.<br> <br>The University of Virginia is an equal opportunity/ affirmative action employer. Women, minorities, veterans and persons with disabilities are strongly encouraged to apply.<br> <br>**Univ.Staff - Operational &amp; Administrative (O&amp;A;), Managerial &amp; Professional (M&amp;P;)**<br> <br>EO/AA Statement:<br> <br>The University of Virginia is an equal opportunity and affirmative action employer. Women, minorities, veterans and persons with disabilities are encouraged to apply.<br> <br>**Univ.Staff - O&amp;A; or M&amp;P; - EMPLOYMENT CONDITIONS**<br> <br>Employment Conditions:<br> <br>*Posting Number:* 0624490<br> <br>*Position Type:* Professional Research Staff<br> <br>*Employment Posting Category:* Professional Research Staff<br> <br>*Type of Application:* Candidate Profile<br> <br>*Organization (Position Organization):* 40410 MD-CELL Cell Biology<br> <br>*Department:* Department of Cell Biology<br> <br>*Location:* Charlottesville<br> <br>*Working Title:* Research Scientist<br> <br>*Anticipated Hiring Range:* Dependent upon qualifications<br> <br>*Is this position funded in whole or in part by the American Recovery &amp; Reinvestment Act (Stimulus Package)?:* No<br> <br>*Posting Date:* 11-14-2018<br> <br>*Closing Date:* Open Until Filled<br> <br>*Required Applicant Documents:* CV / Resume<br> <br>*E-mail a Friend:* jobs.virginia.edu/applicants/Central?quickFind=86035<br> <br>*Rank:* Research Scientist<br> <br>*Appointment Type:* Professional Research Staff<br> <br>*Academic Year for Position? (e.g. 2015):* 2019<br> <br>*FLSA Exemption Status:* Exempt<br> <br>*Posting for UVA Employees Only:* No Response<br> <br>*Number of Work Hours Per Week:* 40<br> <br>*Number of Months/Year:* 12<br> <br>*Required Education:* No Response<br> <br>*Preferred Education:* No Response<br> <br>*Required Experience:* No Response<br> <br>*Preferred Experience:* No Response<br> <br>*Drug Testing Required?:* No<br> <br>*Is this position eligible for Telecommuting?:* No<br> <br>*Is this position eligible for an Alternate Work Schedule?:* No"}