{"job title": "Computational Scientist", "company": "University of Chicago", "city state": "– Chicago, Illinois", "rating": "4.0", "job description": "Department22260 Enrico Fermi Institute\n<br><br>\nAbout the UnitThe Enrico Fermi Institute (EFI) is unit of the Physical Sciences Division of the University devoted to interdisciplinary research. The experimental disciplines currently being pursued include: high-energy particle physics, high-energy astrophysics, studies of particles and fields in the solar system and in space, infrared and optical astronomy, nuclear cosmo-chemistry, geochemistry, scanning electron and proton microscopy, and solar energy concentration. Theoretical studies include physics of elementary particles, quantum field theory, theoretical astrophysics and solar physics, plasma physics, cosmology, and general relativity. The Enrico Fermi Institute provides computational, engineering, technical and administrative support for academic members and students.\n<br><br>\nJob Information\n<br><br>\n<strong>Job Summary:</strong>\n<br><br>\nWe are seeking a highly motivated individual to join our laboratory, which advances data-intensive computation and analytics for large and medium-scale science collaborations. The position is for a Computational Scientist / Senior Computational Scientist who will advance scientific computing at knowledge frontiers through development of next generation cyberinfrastructure supporting the experiments at the CERN Large Hadron Collider and/or the Open Science Grid (OSG). Work closely with physics and computer science faculty and researchers, providing a source of expertise in data engineering, including data organization, management and access. Build distributed data caching networks optimized for science. Couple of data access with distributed high-throughput computing (HTC) systems and NSF-funded high-performance computing (HPC) centers. Measure and assess system and user experience metrics using big data analytics methods. You will interact with others on the team on compute, storage and network systems supporting the ATLAS experiment at CERN, and/or the LIGO and IceCube experiments, and/or other disciplines pursued in the EFI or OSG which push the limits of distributed, large scale data-intensive computation.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Contribute to and/or lead R &amp; D efforts and systems design, integration and deployment of novel data infrastructures for large and medium scale science, including research on (hardware) accelerated data delivery systems.</li>\n<li>Perform integration and scalability testing on purpose-built platforms, which replicate the systems features and environment dependencies of the collaborations processing systems.</li>\n<li>Provide task leadership, communication with computing teams from the collaborations, and other engagement activities to drive progress towards research and experiment deliverables.</li>\n<li>Participate in collaboration computing meetings (telecons) and workshops (in-person), and related advanced cyberinfrastructure and data science R &amp; D projects in the EFI.</li>\n</ul>\n\n<strong>Competencies:</strong>\n\n\n<ul>\n<li>Ability to effectively communicate and collaborate with team members, supervisors, and researchers.</li>\n<li>Ability to identify problems and contribute to their solution.</li>\n<li>Initiative, interactivity and capacity for teamwork and creativity are required.</li>\n<li>Excellent written and verbal communication skills in English are required.</li>\n<li>Ability to produce high quality documentation and to present results publicly is required.</li>\n</ul>\n\nAdditional Requirements\n<br><br>\n<strong>Education, Experience, and Certifications:</strong>\n\n\n<ul>\n<li>A Masters degree in Computer Science, Engineering , Physics, Astronomy and Astrophysics or closely related field in the Sciences is required; PhD degree is preferred.</li>\n<li>Two years of scientific programming experience is required.</li>\n<li>Experience with data analytics tools and statistical methods preferred.</li>\n</ul>\n\n<strong>Technical Knowledge or Skills:</strong>\n\n\n<ul>\n<li>Proficiency in one or more programming languages (such as C++, Fortran, C, Java) and in one or more scripting languages (such as Python, Perl, etc.) is required.</li>\n<li>Proficiency in advanced Python tools and processing frameworks is preferred.</li>\n<li>Continuous integration methods for software development is required.</li>\n<li>Knowledge of HPC (high performance computing) systems, tools, techniques preferred.</li>\n<li>Knowledge of HTC (high throughput computing) systems, tools, techniques preferred.</li>\n<li>Knowledge of Docker, Kubernetes, Helm preferred.</li>\n<li>Knowledge of analytics tools (Elasticsearch, Spark, JuypterLab) preferred.</li>\n<li>Knowledge of storage systems, file systems, and network attached storage preferred.</li>\n<li>Knowledge of grid or cloud services (e.g. AWS, Google) preferred.</li>\n</ul>\n\n<strong>Required Documents:</strong>\n\n\n<ul>\n<li>Resume/CV</li>\n<li>Cover Letter</li>\n<li>References</li>\n</ul>\n\n<strong>NOTE:</strong>\n<br>\nWhen applying, all required documents\n<br>\n<strong>MUST</strong>\n<br>\nbe uploaded under the\n<br>\nResume/CV\n<br>\nsection of the application\n<br><br>\nBenefit EligibilityYes\n<br><br>\nPay Frequency\n<br><br>\nPay Range\n<br>\nDepends on Qualifications\n<br><br>\nScheduled Weekly Hours40\n<br><br>\nUnionNon-Union\n<br><br>\nJob is Exempt?Yes\n<br><br>\nDrug Test Required?No\n<br><br>\nDoes this position require incumbent to operate a vehicle on the job?No\n<br><br>\nHealth Screen Required?No\n<br><br>\nPosting Date2018-10-12-07:00\n<br><br>\nRemove from Posting On or Before2019-04-12-07:00\n<br><br>\n<strong>Posting Statement:</strong>\n<br><br>\nThe University of Chicago is an Affirmative Action/Equal Opportunity/Disabled/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University's Notice of Nondiscrimination.\n<br><br>\nStaff Job seekers in need of a reasonable accommodation to complete the application process should call ************ or submit a request via Applicant Inquiry Form.\n<br><br>\nThe University of Chicago's Annual Security &amp; Fire Safety Report (Report) provides information about University offices and programs that provide safety support, crime and fire statistics, emergency response and communications plans, and other policies and information. The Report can be accessed online at: *********************************** Paper copies of the Report are available, upon request, from the University of Chicago Police Department, 850 E. 61st Street, Chicago, IL 60637."}