{"job title": "Business Intelligence Analyst", "company": "Unyson Logistics", "city state": "– US-MO-St. Louis", "rating": "3.1", "job description": "<div>Hub Group, Inc. (NASDAQ: HUBG) is a $4 billion provider of multi-modal transportation services. Our 4,000 employees deliver innovative solutions and industry leading service to help our customers better control their supply chains and associated costs. Our collaborative and inclusive culture offers extensive career development and learning opportunities. We were recently ranked in the top 25 of America’s Best Midsize Employers by Forbes.</div>\n<br>\n<div></div><div><strong>JOB SUMMARY:</strong> </div><br>\n<div>Provide decision support through data compilation, analysis, and distribution. Develop and maintain reporting and analyses that measure Hub’s performance across all lines of business. Perpetuate a strong understanding of various analytical and reporting tools, data warehousing structures, and key operational metrics.\n<br><br>\n<strong>ESSENTIAL JOB FUNCTIONS:</strong></div><div>\n\n<ul>\n<li>Work with various internal business groups to customize and design reports using Business Objects, SQL Server, Tableau, and Access</li><li>Gather, refine, and analyze data to provide information that supports corporate decision making and process improvements</li><li>Provide insight by transforming large sets of data into simplified, meaningful, and actionable trends and visualizations for use by executives, operations, finance, sales, and other internal departments</li><li>Determine which data sources, key fields, and reporting tools best address business issues</li><li>Responsible for report availability and data accuracy and integrity</li><li>Collaborate with IT to maintain reporting environments and design new data warehousing strategies to meet business analytical needs</li><li>Assist with administration of key reporting repositories and distribution methodologies</li><li>Develop special purpose ad hoc reports as needed to address specific operating and financial issues</li><li>Identify and reconcile various data integrity and consistency issues: investigate, document, and where possible, address differences, across operating and financial data sources for key measures</li><li>Assist with implementation of data quality improvement processes and initiatives</li><li>Other responsibilities as assigned</li></ul></div>\n\n<ul>\n<li>Undergraduate degree required, preferably in an analytical discipline such as Finance, Operations Research, Statistics, or Math</li><li>Demonstrated aptitude for critical thinking, analysis and problem solving</li><li>Strong computer skills and experience working with large databases and database analysis tools preferred</li><li>Experience in the use of statistical analysis and report writing software such as SQL Server, Business Objects, Tableau, Access preferred</li><li>High level of proficiency in Microsoft Office Suite, including Excel, PowerPoint, and Access</li><li>Excellent oral and written communication skills, including ability to interact with and present to all levels of corporate staff</li><li>Experience in freight transportation operations, processes, and systems preferred</li><li>Self-directed; able to work without significant management oversight</li><li>Task and deadline oriented; committed to working beyond normal business hours to complete critical projects</li>\n</ul>\n\n<div><div>We are committed to a policy of Equal Employment Opportunity and will not discriminate on any legally recognized basis, including but not limited to race, age, color, religion, sex, marital status, national origin, citizenship, ancestry, non-job related handicap or disability or veteran status. Hub Group is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a disability, you need a reasonable accommodation for any part of the employment process, please send an e-mail to careers@hubgroup.com and let us know the nature of your request and your contact information.\n<br><br>\n<strong>H</strong></div></div>"}