{"job title": "O &amp; E Data Analyst", "company": "Uplift Family Services", "city state": "– Campbell, CA", "rating": "3.8", "job description": "<div><strong>Title:</strong> Outcomes &amp; Evaluation Data Analyst\n<br><br>\n<strong>Classification:</strong> Non-Exempt\n<br><br>\n<strong>Salary Range:</strong> $28.51-$39.91<em>Actual offers will be determined by the candidate’s creditable years of experience in conjunction with internal equity considerations and based on the organization’s current compensation practices.</em>\n<br><br>\n<strong>Job Code:</strong> 648\n<br><br>\n<strong>Job Summary</strong>\n<br><br>\nThe O&amp;E Data Analyst is responsible for the development of centralized databases to be utilized for internal and external reports and dashboards. In addition, the O&amp;E Data Analyst will manage database, review quality of databases, and clean up databases. This position will collaborate with the Information Technology department to identify data points, determine the most effective and efficient process for data collection/tracking, and develop database structure.\n<br><br>\n<strong>Essential Duties</strong>\n\n<ul>\n\n<li>Import data from various sources into centralized database</li>\n\n\n\n<li>Database review and cleaning by using decisions and techniques as well as mapping data in preparation for analysis</li>\n\n\n\n<li>Design and manage database, as needed for various reports (external, electronic data visualization, etc).</li>\n\n\n\n<li>Collect data using a variety of methods, such as data and hardcopy or electronic , to improve or expand databases.</li>\n\n\n\n<li>Developing and implementing data analyses, data collection systems, and other strategies that optimize statistical efficiency and quality</li>\n\n\n\n<li>Acquiring data from primary or secondary data sources and maintaining databases</li>\n\n\n\n<li>Identify, analyze, and interpret trends or patterns in complex data sets</li>\n\n\n\n<li>Interpreting data, analyzing results using statistical techniques</li>\n\n\n\n<li>Filter and “clean” data by reviewing reports, outcome measures, and performance indicators to locate and correcting coding problems</li>\n\n\n\n<li>Work with management to prioritize business and external needs</li>\n\n\n\n<li>Locate and define new process improvement opportunities</li>\n\n\n\n</ul>\n<strong>Education Requirements</strong>\n\n<ul>\n\n<li>High school diploma and five (5) years of experience required</li>\n\n\n\n<li>Bachelor’s Degree in Psychology or other related fields (computer science, research, statistics, mathematics, information management, psychology, public health, epidemiology, health science AND One (1) year of experience</li>\n\n\n\n</ul>\n<strong>Experience Requirements</strong>\n\n<ul>\n<li>OR Six (6) years of experience</li>\n</ul>\n<strong>Other Specific Requirements</strong>\n<br><br>\n• Must pass Department of Justice (DOJ), Federal Bureau of Investigations (FBI), and Child Abuse Index Check (CAIC) background clearance.\n<br><br>\n• Valid California Driver's license with two years experience driving and clean driving record may be required.\n<br><br>\n<strong>Work Environment/Conditions</strong>\n<br><br>\nThe work environment conditions as described below are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.\n<br><br>\nWhile performing the duties of this job, the employee is occasionally required to stand; walk; sit; use hands to handle, or feel objects, tools or controls; reach with hands and arms; climb stairs; balance; stoop; kneel, crouch or crawl; talk or hear; taste or smell. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.\n<br><br>\n<strong>Employee Statement of Understanding</strong>\n<br><br>\nI have read and understand the job description for my position. I am able to perform all of the essential functions of this position. I agree to successfully complete all required training indicated for this position. I agree to keep all of my required certifications and licenses current and up to date and provide proper documentation of the same to the Human Resources Department. I agree to comply with all Agency policies and procedures. I agree to comply with the agency compliance plan and all laws, rules, regulations and standards of conduct relating to my position. As an employee, I understand my duty to report any suspected violations of the law or the standards of conduct to my immediate supervisor. As an employee, I will strive to uphold the mission and vision of the organization. All employees are required to adhere to the values in all their interactions with youth and families and fellow employees.</div>\n\n<br>"}