{"job title": "Data Modeler (Data Integration Engineer) - STTAS", "company": "UPS", "city state": "– Southfield, Michigan", "rating": "3.4", "job description": "Data Modeler (Data Integration Engineer) - STTAS<br><br><strong>Data Modeler</strong>\n<br><br>\nWere the obstacle overcomers, the problem get-arounders. From figuring it out to getting it done our innovative culture demands yes and how! We are UPS. We are the United Problem Solvers.\n<br><br>\n<strong>About Information Management at UPS Technology:</strong>\n<br>\nOur Information Management teams are responsible for designing and supporting data solutions to meet UPSs rapidly changing business needs. Our team is comprised of individuals who are experts in data management, compliance and governance. We ensure quality, completeness, availability, protection, understanding and effective use of our data assets. Our ability to organize and design the wealth of data we receive each day provides the foundation which enables many of UPS core processes.\n<br><br>\n<strong>About this role:</strong>\n<br><br>\nThe <strong>Data Modeler</strong> interacts with functional representatives, business analysts, database administrators, data architects, and Applications Development project teams to assist with developing data models for supporting the effective storage of data. In this role you will assist with developing subject area and application-specific data models across the enterprise and support the transformation of business requirements into logical data models and preliminary physical data models. This position develops an understanding of applications transformation of data into business information and the manner in which information supports and enables key business processes within applications. You will work with supervision on one or more data models of moderate to high complexity or independently on a single data model of low to moderate complexity. You will work with a Lead Data Modeler to develop small non-complex data models for our Airline, Freight, Fleet Solutions Delivery Group creating standardized data elements, maintaining and publishing the data model to stakeholders.\n<br><br>\n<strong>Minimum Qualifications:</strong>\n\n<ul>\n<li>Knowledge of Data Modeling, SQL Language, Data Mapping, Erwin Data Modeling Tool, Microsoft Office</li>\n<li>Familiarity with Data Analytics, Data Analysis</li>\n<li>Ability to work independently with minimal supervision. Good analysis and elicitation skills. Good communication skills. Good time management skills. Good understanding of Application Development Lifecycle; Meeting faciliation; Requirements Elicitation</li>\n</ul>\n<strong>Preferred Qualifications:</strong>\n\n<ul>\n<li>Bachelor's and/or Master's degree in Computer Science or related discipline</li>\n</ul>\n<em>This position offers an exceptional opportunity to work for a Fortune 50 industry leader. If you are selected, you will join our dynamic technology team in making a difference to our business and customers. Do you think you have what it takes? Prove it! At UPS, ambition knows no time zone.</em><br><br>UPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law"}