{"job title": "Digital Data Platform Analyst (CDP)", "company": "UPS", "city state": "– Atlanta, Georgia", "rating": "3.4", "job description": "Digital Data Platform Analyst (CDP)<br><br>This is an exciting opportunity to join a growing organization within UPS, leveraging new technologies to help make UPS's marketing efforts more data and analytics driven. The Digital Data Platform team partners with campaign owners, channel owners, media agencies, data scientists, and IT to understand their data needs. They convert these data needs into a strategic data roadmap identifying the data sources, gathering the data, structuring it (when appropriate), synthesizing it with other data and building out the long term collection/retention plans.\n<br><br>\nThe Digital Data Platform Analyst is responsible for the operation of the companys customer data platform in support of Marketings business objectives. He/She ensures the data collected into the Customer Data Platform supports the analysis, segmentation and performance measurement needs of marketers, Marketing Data Sciences teams and agencies across all digital channels. The Customer Data Platform Analyst leads generation and execution of the data roadmap for UPS cloud based customer data platform.\n<br><br>\n<strong>Responsibilities and Duties</strong>\n\n<ul>\n<li>Collects data requirements from stakeholders in marketing, marketing data sciences and agencies</li>\n<li>Identifies the acquisition sources of the data and designs the data stitching to build out the most robust data source possible</li>\n<li>Builds the roadmap for data acquisition through retirement</li>\n<li>Curates the data within the Customer Data Platform ensuring quality and timeliness of data</li>\n<li>Advises data sciences, analytics and Audience manager end users on the structure, relationships and use of the data</li>\n<li>Build jobs and routines to summarize data as needed by end user groups to facilitate most efficient use of time to get data in the hands of end users to make data driven decisions</li>\n<li>Works with software vendors, IT, and ups.com channel owners to deploy tags and code updates to UPS properties to obtain data if it is not readily available from an existing source</li>\n<li>Supports business users in the usage of customer data platform data through formal training and ongoing day-to-day support</li>\n</ul>\n<strong>Knowledge and Skills</strong>\n\n<ul>\n<li>Strong technical knowledge around digital advertising delivery, platforms involved and media tagging</li>\n<li>Ability to translate campaign owner requirements into technical specifications</li>\n<li>Ability to design, build and maintain data tables in a local, cloud and HDFS environment</li>\n<li>Ability to identify and troubleshoot data collection issues on owned and paid channels</li>\n<li>Strong organization and project management skills</li>\n<li>Experience running large scale Customer Data Platforms</li>\n<li>Experience with data visualization tools such as Microsoft Power BI or Tableau</li>\n<li>Experience with Python or R</li>\n<li>Experience in Hive, Spark, SQL, and other big data skills</li>\n<li>Knowledgeable in digital campaigns and digital audience management</li>\n<li>Bachelor's Degree in Computer Science, Mathematics, Analytics or related field - Preferred</li>\n</ul>\n\nUPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law"}