{"job title": "Data Management Platform Analyst", "company": "UPS", "city state": "– Atlanta, Georgia", "rating": "3.4", "job description": "Data Management Platform Analyst<br><br>This is an exciting opportunity to join a growing data sciences organization within UPS, leveraging new technologies to help make UPS's marketing efforts more data and analytics driven. The Data Management Platform (DMP) team partners with campaign owners, channel owners, media agencies, data scientists, and IT to develop new audiences and deliver them to the activation platforms that support the targeting and personalization of all channels, including ups.com, paid media, and email. In addition, the team ensures that quality performance data is captured and tools are developed to support digital performance reporting and audience insights mining.\n<br><br>\nThe DMP Analyst is responsible for the operation of the companys DMP (Adobe Audience Manager) in support of Marketings business objectives. He/She ensures the data collected into the DMP supports the segmentation needs of marketers and agencies across all digital channels. The DMP Analyst leads development of new audience traits and segments, performing testing, and deploying segments to agency media buying platforms, the ups.com personalization platform and other programmatic activation platforms. Once the audience is identified, it is validated, sized and reviewed with the stakeholders. These can be straight audience segments or seed audiences for look-alike modeling. These audiences will be used on internal and external targeting and advertising platforms. Additional information will be collected with each interaction with our system or ads to further enrich our information.\n<br><br>\n<strong>Responsibilities and Duties</strong>\n\n<ul>\n<li>Creates traits and segments in the Data Management Platform to support new campaign requests</li>\n<li>Monitors segment sizes for all segments actively part of a digital campaign and monitors match rates with activation/media buying platforms, ensuring that high quality segment data is continually delivered throughout the campaign</li>\n<li>Works with software vendors, IT, ups.com channel owners to deploy DMP tags and code updates to UPS properties, and with media agencies to ensure DMP tags are deployed on creative for all media campaigns</li>\n<li>Works with channel partners to deploy and test segments developed in the Data Management Platform and/or Customer Data Platform to channel activation platforms (e.g. ups.com personalization engine, marketing automation, etc.)</li>\n<li>Supports business users in the usage of campaign and audience data through formal trainings and ongoing day-to-day support</li>\n</ul>\n<strong>Knowledge and Skills</strong>\n\n<ul>\n<li>Strong technical knowledge around digital advertising delivery, the platforms involved and media tagging</li>\n<li>Ability to translate campaign owner requirements into technical specifications</li>\n<li>Ability to identify and troubleshoot tag-based data collection issues on owned and paid channels</li>\n<li>Strong organization and project management skills</li>\n<li>Experience running a Data Management Platform such as Adobe Audience Manager, BlueKai, or Krux for another advertiser or for a media agency to analyze cookie-level data using querying languages (SQL) and visualization tools (Tableau, Power BI, etc.) to unearth new audience insights and troubleshoot any issues that may arise in data collection or segment delivery</li>\n<li>Experience with data visualization tools such as Microsoft Power BI or Tableau</li>\n<li>Bachelor's Degree (or internationally comparable degree) in Computer Science, Mathematics, Analytics or related field - Preferred</li>\n</ul>\n\nUPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law"}