{"job title": "Marketing Senior Data Analyst", "company": "UPS", "city state": "– ATLANTA, GA", "rating": "3.4", "job description": "<div>Marketing Senior Data Analyst</div>\n<br>UPS is seeking a Senior Data Analyst to retrieve, analyze, and convert customer, operation, and revenue data into useful information to be used by various groups (i.e., Pricing, Revenue Management, and other groups in Marketing). He/She creates and presents requested reports that assess business results and provide suggestions for senior management decision-making.\n<br><br>\n<strong>Responsibilities and Duties</strong>\n<ul>\n <li>Review data requests to identify and understand the information needed</li> <li>Develop a data retrieval plan to pull the data efficiently from different data repositories</li> <li>Perform development of highly complex queries, stored procedures and views using SQL as well as ETL processes</li> <li>Identify, analyze, and interpret trends or patterns in complex data sets. Interpret and prepare analytical reports summarizing the findings.</li> <li>Prepare final reports and present findings to senior management to drive business and marketing decisions</li> <li>Document changes, updates, and formulas during the process to ensure a complete record of the request is created</li>\n</ul>\n<strong>Knowledge and Skills</strong>\n<ul>\n <li>Strong proficiency in MS SQL Server, highly complex SQL queries, stored procedures and views</li> <li>Expertise with MS Excel, and standard visualization software such as MS Power BI OR Tableau</li> <li>Demonstrates a basic knowledge of statistical terminology and understanding of analyses and/or tests (e.g. measures of central tendency, standard deviation, correlation, analysis of variance (ANOVA), simple linear regression, significance testing, etc.); displays the ability to calculate basic statistics</li> <li>Bachelor's Degree (or internationally comparable degree) in Engineering, Information Management, Computer Science, Mathematics, Economics, Statistics, or equivalent experience</li>\n</ul>\n\nUPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law"}