{"job title": "Data Scientist", "company": "UPS IT", "city state": "– Wayne, NJ", "rating": "4.3", "job description": "<strong>Data Scientist</strong>\n<br><br>\nWere the obstacle overcomers, the problem get-arounders. From figuring it out to getting it done our innovative culture demands yes and how! We are UPS. We are the United Problem Solvers.\n<br><br>\n<strong>About Data Science at UPS Technology:</strong>\n<br><br>\nThe <strong>Data Scientist</strong> gathers data and performs analysis necessary to develop and evaluate UPS Strategy. Successful candidate will work under supervision of a Senior Data Scientist and a team lead, as well as internal Subject Matter Experts to assist in identifying the best approach to gathering information and solving business issues in various areas of UPS business, ranging from Customer Accounts to Package Delivery to Workforce Analytics. The candidate will possess ability to demonstrate experience with analytics, data gathering and data mining tools to assist in guiding the business strategy.\n<br><br>\nThis position is responsible for the development of leading edge optimizations and analytics based decision support tools throughout the organization.\n<br><br>\n<strong>Duties:</strong>\n\n<ul>\n<li>Involved in Scoping, Design and Development of Advanced Analytical Models</li>\n<li>Collaborates with senior developers, team leads, Business Analysts and various IT teams to gather, curate and build data sets needed to successfully construct the foundation of our Analytical Models</li>\n<li>Provides input to Design of prototypes and utilizes algorithms to ensure optimization results satisfy problem statements and business needs</li>\n<li>Monitors and Maintains Analytical Models in Production Environment</li>\n<li>Develops hypotheses, approaches (i.e., analytic plans and methodologies), tools, products, and solutions to solve problems and increase profitability/efficiency</li>\n<li>Creates and develops solutions to solve short and long-term problems and address business needs</li>\n<li>Gathers and compiles data for analyses and decision making</li>\n<li>Processing, cleansing and verifying of data used for analysis</li>\n<li>Provides consultation to functional partners to support the design/development of systems</li>\n<li>Monitors the industry to gain knowledge of hardware and software technologies, emerging technologies, and analytic techniques to ensure UPS is utilizing state-of-the-art tools</li>\n<li>Determines relevance and potential value of new technologies to support business objectives and strategies</li>\n<li>Work with team on project lifecycle, including project scope, resources, schedule, development, and deployment to ensure success</li>\n<li>Identifies requirements to design optimization tools that will reduce costs and improve efficiency</li>\n<li>Assists with plan creation to maximize the value proposition and improve effectiveness</li>\n<li>Develops subject matter expertise on internal and external sources of information</li>\n<li>Ad-hoc data analysis and presentation</li>\n</ul>\n<strong>Primary Skills:</strong>\n\n<ul>\n<li>Predictive Modeling and Machine Learning (Survival modeling, SVM, neural networks, decision tree, Time Series Modeling, Clustering, etc.) Intermediate</li>\n<li>Python, R, Stata Intermediate</li>\n<li>Google Cloud Platform (Kubernetes, StackDriver)</li>\n<li>Data Analytics Intermediate</li>\n</ul>\n<strong>Additional Skills:</strong>\n\n<ul>\n<li>Experience with database systems, SQL and NOSQL</li>\n<li>Experience with SCALA or JAVA helpful</li>\n<li>Experience with parallelization platforms such as Hadoop/MapReduce</li>\n<li>Familiarity with big data storage and processing tools such as Hadoop</li>\n<li>Strong analytical, presentation and writing skills</li>\n<li>Strong MS Office skills; including Excel</li>\n<li>Ability to present ideas in both technical and non-technical terms</li>\n<li>Experience/understanding of business process reengineering and business modeling concepts, business systems development and analysis</li>\n<li>Awareness of business and IT strategy</li>\n<li>Able to prioritize and execute tasks in a high-pressure environment</li>\n<li>Be a creative problem solver who can deliver design support, analysis</li>\n</ul>\n<strong>Minimum Qualifications:</strong>\n\n<ul>\n<li>Deep understanding of machine learning and statistical methods with their underlying theory and math</li>\n<li>Degree in a relevant field is desired</li>\n<li>Demonstrated work in building, deploying and demonstrating business value from predictive models and data products</li>\n<li>Proficient in Python and R, Java experience a plus</li>\n<li>Experience with distributed machine learning frameworks, like Spark, etc.</li>\n<li>Strong and persuasive communication skills</li>\n</ul>\nThis position offers an exceptional opportunity to work for a Fortune 50 industry leader. If you are selected, you will join our dynamic technology team in making a difference to our business and customers. Do you think you have what it takes? Prove it!<br><br>UPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law\n<br>"}