{"job title": "Data Scientist - Statistical Modeling Specialist", "company": "Upstart", "city state": "– Columbus, OH", "rating": "3.6", "job description": "Upstart is the first lending platform to leverage artificial intelligence and machine learning to price credit and automate the borrowing process. Our engineering and data science teams collaborate to use non-conventional variables at scale in an underwriting model that improves constantly. After exciting success over the past few years, Upstart is looking to double down on its competitive advantage by expanding its data science team!\n<br><br>\nUnderwriting more accurately and using variables that no other lender considers are what allow us to give people the rates they deserve, so your role at Upstart will drastically impact our company's success. Our current Data Scientists summarize some of their favorite aspects of our team as:\n\n\n<ul>\n<li>Having a direct impact on the company's success</li>\n<li>Collaborative, intelligent, and open team</li>\n<li>Mentorship, growth, and friendship</li>\n<li>Leader committed to challenging and growing team members</li>\n<li>Feeling safe asking for help when it's necessary; feeling trusted to get the job done when it's not</li>\n</ul>\n\nWe are looking for a statistical modeling specialist that enjoys working in a very fast-paced environment. Because our challenges are so new, this person will need to have strong creative problem solving skills and the technical background to implement such solutions. If you think that this could be the right role for you, we would like to learn more about you.\n<br><br>\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Published research in high-quality statistical journal(s) with a preference for one of the following topics: missing data, survival analysis, consumer credit risk</li>\n<li>Expertise in predictive modeling and inference using GLMs, longitudinal, mixed-effects, and time-series models, among others</li>\n<li>Comfort designing experiments using A/B testing and multi-armed bandits</li>\n<li>Familiarity with schemes for data imputation and the appropriateness of each when data is missing completely, missing at random, and missing not at random</li>\n<li>3+ years academic or professional experience in statistical research</li>\n</ul>"}