{"job title": "Data Scientist", "company": "Uptake", "city state": "– Chicago, IL", "rating": "3.2", "job description": "<strong>What We Do</strong>\n<br><br>\nUptake helps industrial companies digitally transform with open, purpose-built software that delivers outcomes that matter. Built on a foundation of data science and machine learning, our vision is to create a world that always works — one where the machines and equipment we depend on daily don’t break, and industrial companies are once again the creators of economic growth and opportunity.\n<br><br>\n<strong>Why Work Here</strong>\n<br><br>\nUptake is a values-driven organization, and we are excited about what we do. We’re flexible, honest, hardworking, and collaborative. As a team, we bring our diverse backgrounds, beliefs, and experiences together to solve tough, important problems. We support and challenge one another to bring out the best in each of us, and we might have a little fun along the way. We’re also proud to be one of Chicago’s best places to work in 2018 according to Forbes and Great Place to Work Institute.\n<br><br>\nWe offer generous benefits including health, dental, vision, parental leave, 401K match, and unlimited vacation. We are lifelong learners, and our Uptake University program offers training and professional development on a wide variety of topics. We also have employee-led community groups including Women@Uptake, Pride@Uptake, Science@Uptake, Parents@Uptake, and many more. Learn more at https://www.uptake.com/careers.\n<br><br>\n<strong>What Data Scientists Do Here</strong>\n<br><br>\nData science is at the core of what we do at Uptake. We collaborate with engineering, UX, product, and other teams to contribute insights and data science best practices to all parts of the business.\n<br><br>\nTypical day to day tasks for a <strong>data scientist</strong> might include:\n\n<ul>\n<li>Collaborate with teams to analyze problems</li>\n<li>Learn a new programming language or data science technique - we continually build our skills and explore new things.</li>\n<li>Build, test, and deploy supervised or unsupervised learning models</li>\n<li>Write data analysis reports for internal use</li>\n<li>Build tools to enable other data scientists to scale their knowledge and increase impact</li> \n\n<li>Work with customers to develop analyses that help them solve business problems and drive value</li>\n</ul>\nFor more on what we look for in data scientists, visit https://upt.ac/16ee15fc.\n<br><br>\n<strong>What We Are Looking For</strong>\n\n<ul>\n<li>Passion for data science! We want candidates who love data science and are excited about what they do.</li>\n\n\n<ul>\n<li>Some ways previous successful candidates have demonstrated this are:</li>\n\n\n<ul>\n<li>Actively writes relevant blog posts and/or articles</li>\n<li>Active participant in relevant online communities</li>\n<li>Recognized via professional or academic awards (example: Most Valuable Employee, scholastic grants)</li>\n<li>Expressing detailed knowledge of and genuine interest in Uptake’s unique methods, products, data, and technology within a cover letter.</li> </ul>\n\n\n</ul>\n\n<li>Ability to write sophisticated machine learning and data analysis code in R, Matlab, or Python</li>\n\n\n<ul>\n<li>Some ways previous successful candidates have demonstrated this are:</li>\n\n\n<ul>\n<li>Contributing to influential Open Source Projects like sklearn, XGBoost, tidyverse, Tensorflow, pytorch, Kafka, Spark, Elasticsearch etc.</li>\n<li>By describing a data science model they developed that is deployed in a live setting within a resume or cover letter</li>\n<li>Made a high quality data science project available in a public forum like GitHub or Kaggle</li>\n<li>Published work in Data Science related journals or conferences such as ICML, NIPS, JML, KDD, and INFORMS</li></ul>\n\n\n</ul>\n\n<li>Experience communicating effectively with people at all levels of an organization. Our data scientists regularly share complex insights with all kinds of people.</li>\n\n\n<ul>\n<li>Some ways previous successful candidates have demonstrated this are:</li>\n\n\n<ul>\n<li>Teaching data science to non-data scientists in an academic or professional setting</li>\n<li>Elaborating in a cover letter or resume ways that they have professionally collaborated with others in the organization and the impact that collaboration had on the organizations KPIs</li></ul>\n\n\n</ul>\n\n<li>Bachelor's degree or higher in a quantitative or relevant field</li>\n<li>Candidates must be authorized to work in the US.</li>\n</ul>\n<strong>Nice to Have</strong>\n\n<ul>\n<li>2+ years professional experience working in an analytics focused role</li>\n<li>Experience writing production code in one or more of: C++, C, Java, Scala, or Spark</li>\n<li>Experience working with IoT systems, ranging from DIY home projects to industrial IoT deployments</li>\n<li>Have made substantive contributions to open source projects in the areas of data science or machine learning</li>\n<li>Experience developing software projects with large teams using technologies like; git, mercurial, jenkins, travis, jira, asana, etc.</li>\n<li>Master’s degree or PhD in a quantitative or relevant field</li>\n</ul>\n<em>Uptake welcomes and encourages applications from all individuals, without regard to any prohibited ground of discrimination, including from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.</em>"}