{"job title": "Senior Data Scientist", "company": "Upwork", "city state": "– San Francisco, CA", "rating": "3.7", "job description": "<div>Upwork is the world's largest freelancing website. Each year $1.5 billion of work happens through Upwork, allowing businesses get more done and helping professionals break free of traditional time and place boundaries and work anytime, anywhere on projects they love. At Upwork, you'll help build on this momentum. Together, we'll create economic and social value on a global scale, providing a trusted online workplace for businesses to connect with extraordinary talent and work without limits.</div><br>\n<div>Despite our success, we believe we can do better, which is why weve assembled a diverse team of graduates from Stanford, MIT, and Berkeley in fields ranging from computer science and electrical engineering to economics and statistics.</div> <br>\n<div>Your job as a Sr. Data Scientist will be to help us create the algorithms that match people who need to get work done with the exact person who can do the job. This isn't an easy problem to solve considering the multitude of complex factors involved, including but not limited to: (1) clients job requirements and preferences, (2) freelancer availability, cost, skill and prior job success, and (3) Upworks policies targeting overall marketplace health and growth.</div> <br>\n<div>We believe that this <strong>multi-sided match problem</strong> is one of the most challenging data and machine learning problems that currently exist. Unlike traditional matching problems in Information Retrieval and Recommender Systems, the right answer for php developer depends on whos making the request, whos available to work, and whether the matches help to optimize the labor marketplace exchange and promote overall growth. We have a world-class team and the largest closed-loop online dataset of jobs, job seekers, job progress and job completion feedback to lead research &amp; engineering in the online world of labor. If youre passionate about solving hard problems at big data scale, knowing that your contribution to Upwork is enabling massive economic value and creating social value globally, then please read on.</div><br>\n<div>The ideal candidate for this role will have over five years of experience from a major consumer Internet brand well-studied in search, recommender systems and machine learning. You dont have to have a degree from one of the worlds top schools, but youve already done a few big things in your career and can hang with some of the brightest data scientists in the world. One of your hallmarks is your ability to reconcile business needs with what the data is suggesting to come up with new ideas and approaches. In the process, you derive much of your joy at work knowing that your inventions and your job matters.</div><div>If you and the team youre on are successful, you will change the company and the world.</div>In this role, you will:\n\n<ul>\n<li>Build machine learning models that will become core components driving our marketplace</li><li>Dive deep into the data and share your insights across the business</li><li>Collaborate with product and engineering on key initiatives</li><li>Work with freelancer engineers, analysts and data scientists from around the world</li>\n</ul>\n\n<br>\nTo win in this role, you need:\n\n<ul>\n<li>Deep knowledge of machine learning, information retrieval, recommender systems, natural language processing or related fields</li><li>Solid programming skills that enable you to retrieve, analyze and process data, and build machine learning models from the ground up (e.g. SQL, Python, Scala, Java).</li><li>Superior ability to analyze and interpret the results of product experiments</li><li>Employment history at both start-ups as well as at least one job at a recognizable consumer Internet company</li><li>Strong communication skills, both written and verbal</li>\n</ul>\n\n<div><strong>Come change how the world works.</strong></div><br>\n<div>At Upwork youll help shape the future of work. From our offices in San Francisco, Mountain View and Chicago, together were creating exciting new opportunities for a world of professionals. Youll be part of a vibrant culture built on shared values: Inspire a boundless future of work, Put our community first, Have a bias towards action, and Build amazing teams. Along the way youll have fun and enjoy the perks of a people-first company: Work from Home Wednesday's, daily breakfast and lunch, regular in-office happy hours, top-notch benefits and more. Check out Upworks spotlight on The Muse for a glimpse of our daily work/life balance.</div><br>\n<div>Upwork is proudly committed to recruiting and retaining a diverse and inclusive workforce. As an Equal Opportunity Employer, we never discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</div>"}