{"job title": "Data Analytics Manager", "company": "US Bank", "city state": "– San Francisco, CA", "rating": "3.5", "job description": "US Bank is seeking a Data Analytics Manager to contribute to the development and implementation of a data analytics program within the Consumer Channels Group. The Data Analytics Manager is responsible for creating and implementing advanced analytics capabilities, designing complex prospecting models, performing advanced business intelligence analyses and other predictive methodologies, interpreting results and developing actionable insights and recommendations to improve products and services and grow our business.\n<br><br>\nThe Data Analytics Manager also plays a liaison role between the front-office and technology groups including Market and Business leaders, Business Development teams, Relationship Managers of other Lines of Business, Operations, Finance, and Marketing. This role will work closely with key stakeholders on key department initiatives to understand and deliver on user requirements\n<br><br>\n<strong>Additional Responsibilities:</strong>\n\n\n<ul>\n<li>Acquires data from multiple data sources in order to perform analysis.</li>\n<li>Identifies, analyzes and interprets trends or patterns in complex data in order to provide answers to business questions as well as provide recommendations for action.</li>\n<li>Interprets data and analyze results using various statistical techniques and tools.</li>\n<li>Presents data and analysis in a clear and concise manner allowing the audience to quickly understand the results and recommendations so they activate upon them and make data driven decisions.</li>\n<li>Collaborate with various partners to provide a holistic view of the analysis.</li>\n<li>Measures and monitors results of applied recommendations and present adjustments.</li>\n<li>Ensures all data acquisition, sharing and results of applied recommendations are compliant with company standards.</li>\n</ul>\n\nBasic Qualifications\n\n\n<ul>\n<li>Bachelor's degree in a quantitative field such as econometrics, computer science, engineering or applied mathematics, or equivalent work experience</li>\n<li>Five to seven plus years of statistics or analytics experience</li>\n</ul>\n\nPreferred Skills/Experience\n\n\n<ul>\n<li>Advanced working knowledge of large data manipulation and data mining using SQL</li>\n<li>Experienced in data science tool, Python or R</li>\n<li>Great written and verbal communication and presentation skills</li>\n<li>Exceptional problem solving, technical and data analysis skills</li>\n<li>Knowledge of Omniture/Adobe Analytics including tagging conventions and analytics tools such as SiteCatalyst, ReportBuilder, Analysis Workspace</li>\n<li>Advanced Reporting skills using tableau and powerBI</li>\n<li>Thorough knowledge of data science and management</li>\n<li>Demonstrated leadership skills</li>\n<li>Banking or financial industry experience<br><br>SDL2017</li>\n\n</ul>"}