{"job title": "Sr Digital Analytics Manager", "company": "US Cellular", "city state": "– Chicago, IL", "rating": "3.4", "job description": "Sr Digital Analytics Manager - MAR001095\n<br><br>\nThis role is responsible for overseeing the development of digital marketing and website analytics functions and managing analyses to measure the effects of U.S. Cellular ecommerce/digital marketing online and in stores. The role identifies critical business questions, conducts analyses, and translates the data into meaningful information that drives results.\n<br><br>\n<strong>Essential Duties and Responsibilities:</strong>\n<br>\nLeads analyses to determine the effects of all U.S. Cellular digital marketing and digital experiences, both online and offline. Manages the analysis of current marketing performance to assess what is working and what isnt, and recommends actions and solutions to maximize investment of $100MM+ annual marketing budget. Uses a profit and loss mindset to drive analytical approaches.\n<br>\nWork with digital marketing and ecommerce senior leadership in a consultative capacity, advising and influencing the distribution and outcomes of the annual marketing budget\n<br>\nLead, define, execute and communicate USCC digital analytics strategy, plan and current performance to the organization including executive leadership to ensure continuity and alignment to goals and priorities\n<br>\nEnsure the creation of comprehensive implementation plans to ensure proper data collection and evaluation of initiatives; own strategic initiatives analyses and appropriate communication/dissemination of this information\n<br>\nWork across and integrate data from multiple digital analytics platforms and manage a distributed organization of agency partners\n<br>\nProactively identifies critical business questions and analyses, conducts analysis related to a range of unique business questions, interprets the data in a meaningful way, and translates the information into \"marketer-friendly\" results\n<br>\nDrive implementation of large analytic platforms and projects in partnership with eCommerce and other teams\n<br>\nProvide subject matter expertise support for digital analytics/web initiatives\n<br>\nDefine and own the strategy, development and implementation of a/b and multivariate testing programs to optimize company-wide digital marketing and ecommerce KPIs\n<br>\nManage the development, consolidation and dissemination of business intelligence data and reporting to provide respective teams with information that contributes to decision-making; manage incoming data requests and outgoing needs to ensure information is provided, and to the right parties\n<br>\nReview and streamline reporting approach and standards across digital marketing and ecommerce, including both internal and external groups\n<br>\nInvestigate/oversee the assessment/trial of emerging analytics platforms and make recommendations for adoption.\n<br>\nOwn relationship with all U.S. Cellular marketing analytics departments; partner with internal analytics and information technology groups to ensure digital marketing and ecommerce data is incorporated in enterprise-wide reporting, as well as obtaining assistance with advanced analytics projects to serve the digital marketing and ecommerce group\n<br>\nIdentify, retain and manage digital analytics agency and analytic teams at digital/creative/media agencies and other external vendors and consulting resources; manage vendors, contracts/Statements of Work and budgets\n<br>\nProvide technical and analytical guidance to analysts who support daily information needs across the enterprise including external agencies as well as internal analytics groups\n<br>\nLead operational improvements to analytics platforms to improve the business\n<br>\nCreate business cases for sound digital investments; partner with Finance, eCommerce and Executive Leadership teams to drive Digital Strategic Plans and Roadmaps, including Analytic features/capabilities\n<br>\nStay abreast of industry and market trends and use information to nhance job and business performance\n<br>\nProvide Quality Assurance (QA) support for digital analytics/web initiatives\n<br><br>\n<strong>Job Requirements:</strong>\n<br>\nBachelors degree required. Mathematics, statistics, economics, finance, business or related discipline preferred; advanced degree in related discipline a bonus.\n<br>\n8+ years of digital analytics experience in a fast-paced business environment with responsibility for reporting and analyzing data for multiple channels including web and in-stores required; digital marketing experience in an ecommerce environment strongly preferred\n<br>\n5+ years of experience managing large analytic platform implementations, including the ability to facilitate the establishment of clear project goals, objectives, plans and key performance indicators (KPI); demonstrated ability to successfully lead large analytic projects and implementations.\n<br>\nDemonstrated leadership experience managing internal and external resources.\n<br>\nHigh attention to detail and quality assurance of analytic methods and outputs\n<br>\nExperience working across multiple layers of an organization from executive and senior leadership to frontline\n<br>\nKnowledge and experience with profit and loss models and ability to analyze the effects of digital marketing and our properties on our enterprise sales both online and offline, reporting/presenting to ecommerce and Senior Leadership required\n<br>\nExcellent oral and written communication skills with experience with business case and deck development required as this role is a key contributor to business cases for strategic planning / investments for our digital properties, supporting VPs, Senior Director, Directors and the greater Leadership Team\n<br>\nAnalytic approach to problem-solving and aptitude for conveying the why and so what using data and analytic insights\n<br>\nAbility to design/develop performance measurement reports and dashboards and adapt data capture and reporting processes\n<br>\nPrefer experience in selection and implementation of data management platform (DMP)\n<br>\nDemonstrated ability to build credibility and rapport across cross-functional teams\n<br>\nKnowledge of query tools and best practices, including deep proficiency with at least one major web analytics platform (e.g. Google Analytics, Webtrends, Coremetrics, Adobe Analytics etc.)\n<br>\nFamiliarity with attribution modeling and software (e.g. Adometry or Attribution 360, VisualIQ, Neustar)\n<br><br>\n<strong>#LI-CC1</strong>\n<br><br>\n<strong>Job :</strong> Marketing\n<br>\n<strong>Location(s) :</strong> Illinois-CHICAGO_IL\n<br>\nU.S. Cellular® is an EEO employer and gives consideration to qualified applicants without regard to race/color/age/religion/sex/sexual orientation/gender identity/national origin/disability/veteran status, pregnancy or genetic information."}