{"job title": "SCIENTIST", "company": "US Department of Defense", "city state": "– Indian Head, MD", "rating": "4.0", "job description": "<div>\n\n\n<ul>\n\n \n<li>\n<br>\n Videos</li>\n\n</ul>\n\n </div><br>\n\n <div>\n\n\n<ul>\n\n \n<li>\n<br>\n Duties<br>\n\n <div>\nHelp\n<br>\n Help\n<br>\n<br>\n Duties\n<br>\n Summary\n<br>\n <div>You will serve as a SCIENTIST in the HIGH ENERGY MATERIALS BRANCH, RESEARCH AND TECHNOLOGY DIVISION, RDT&amp;E DEPARTMENT of NAVSURFWARCEN IHEODTECHDIV.<br><br>Learn more about this agency</div>\n\n<br>Responsibilities\n<br>\n <div>\n\n\n<ul>\n\n <li>You will conceive, initiate and develop programs for the synthesis and application of new materials across multiple DoD/Navy areas of interest.</li>\n<li>You will consults, instructs and develops procedures for safe execution of experiments involving explosives.</li>\n<li>You will make recommendations for staffing and other resource management decisions based on technical direction and workload.</li>\n<li>You will mentor branch scientists and engineers in synthesis chemistry and other disciplines.</li>\n<li>You will lead semi-annual in person meetings with current and potentially new program sponsors to discuss current and future work.</li>\n</ul>\n\n </div><br>\n\n<div>\nTravel Required<br><br>Occasional travel - You may be expected to travel for this position.</div><br>\n\n <div>\n<div>\nSupervisory status<br><br>No</div> \n<br>\n <div>\nPromotion Potential<br><br>None</div> </div>\n </div>\n</li>\n\n<li>\n <div>\nJob family (Series)<br><br>1320 Chemistry</div>\n</li>\n\n<li>\n<br>\n Requirements<br>\n\n <div>\nHelp\n<br>\n Help\n<br>\n<br>\n Requirements\n<br>\n Conditions of Employment\n\n\n<ul>\n\n <li>Must be a US Citizen.</li>\n<li>Must be determined suitable for federal employment.</li>\n<li>Must participate in the direct deposit pay program.</li>\n<li>New employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/.</li>\n<li>Generally, current federal employees applying for GS jobs must serve at least one year at the next lower grade level. This requirement is called time-in-grade. Time-in-grade requirements must be met by the closing date of this announcement.</li>\n<li>You will be required to successfully complete a pre-appointment physical examination.</li>\n<li>You will be required to obtain and maintain an interim and/or final security clearance prior to entrance on duty. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.</li>\n<li>Successful completion of a pre-employment drug test (including marijuana) is required. A tentative offer of employment will be rescinded if you fail to report to the drug test appointment or pass the test. You will be subject to random testing.</li>\n<li>This position may require travel from normal duty station to CONUS and OCONUS and may include remote or isolated sites. You must be able to travel on military and commercial aircraft for extended periods of time.</li>\n</ul>\n\n<br>\n<div>\nQualifications<br>\n\n <div>\nIn addition to the Basic Requirements for this position, your resume must also demonstrate at least one year of specialized experience at or equivalent to the ND-04 (GS-12/13) grade level or pay band in the Federal service or equivalent experience in the private or public sector; as a professional scientist representing an organization's role within the technical community through publications or communications of energetics or explosives testing, research and development.\n<br><br>\nAdditional qualification information can be found from the following Office of Personnel Management website:\n<br>\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=GS-PROF.\n<br><br>\nhttps://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1300/chemistry-series-1320/\n<br><br>\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.</div>\n </div><br>\n\n<div>\nEducation<br><br>Applicants must meet the following positive education qualifications requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual: Applicants must possess Degree: physical sciences, life sciences, or engineering that included 30 semester hours in chemistry, supplemented by course work in mathematics through differential and integral calculus, and at least 6 semester hours of physics.\n<br><br>\n<strong>OR</strong>\n<br><br>\nCombination of education and experience -- course work equivalent to a major as shown in A above, including at least 30 semester hours in chemistry, supplemented by mathematics through differential and integral calculus, and at least 6 semester hours of physics, plus appropriate experience or additional education.</div>\n </div>\n</li></ul></div>"}