{"job title": "Data Scientist", "company": "US Venture, Inc.", "city state": "– Appleton, WI (US)", "rating": "3.9", "job description": "<strong>Work location will be:</strong><br><br>425 BETTER WAY<br><br><strong>Make your mark with us!</strong>\n<br><br>\nTo learn more about working at U.S. Venture, watch this video: Life at U.S. Venture\n<br><br>\n<strong>POSITION SUMMARY</strong><br><br>The data scientist utilizes data to build custom models and algorithms to derive business value. Using data from one to many sources, the data scientist will build, test, validate, and deploy solutions to predict outcomes. These activities will occur as part of a project team. The data scientist must be self-motivated to learn and utilize the latest technology and techniques to achieve optimal results.<br><br><strong>JOB RESPONSIBILITIES</strong>\n<ul>\n<li>Build complex data sets from multiple data sources, both internally and externally.</li><li>Build learning systems to analyze and filter continuous data flows and offline data analysis.</li><li>Conduct advanced statistical analysis to determine trends and significant data relationships.</li><li>Demonstrates up-to-date expertise and applies this to the development, execution, and improvement of action plans</li><li>Develop custom data models to drive innovative business solutions and train algorithms to apply models to new data sets.</li><li>Scale new algorithms to large data sets.</li><li>Validate models and algorithmic techniques.</li><li>Work with cross-functional partners across the business</li>\n</ul>\n<strong>QUALIFICATIONS</strong>\n<ul>\n<li>Advanced degree in Computer Science, Mathematics, Economics, Statistics, or related field</li><li>Programming experience in one or more of Python, R, JAVA</li><li>Experience with big data technology such as Hadoop, Hive, Data Lake</li><li>Knowledge of statistics and experience using statistical packages for analyzing datasets</li><li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li><li>Ability to write queries, generate reports, and present findings</li><li>Strong communication and facilitation skills</li><li>Excellent planning and organizing skills</li>\n</ul>\n*CB*\n<br><br>\n<strong>EOE/Disabled/Veterans</strong>"}