{"job title": "Technician - Vacuum Scientist and Cleanroom, Job ID", "company": "Utah State University, Space Dynamics Laboratory", "city state": "– North Logan, UT", "rating": "NA", "job description": "<ul>\n<li>Create a Job Alert</li>\n<li>Login</li>\n</ul>\n\nTechnician - Vacuum Scientist and Cleanroom, Job ID 9948\n<br><br>\nVacuum Science and Cleanroom Technician\n<br><br>\nThe Space Dynamics Laboratory (SDL) has been developing innovative technologies and solutions for cutting-edge DoD and intelligence programs for almost six decades. Our expertise is in space and airborne IR, VIS, UV, and RF sensors, small satellite technologies, test and calibration, cybersecurity, data assurance, and ground stations.\n<br><br>\nWe are seeking an Vaccum Science and Cleanroom Technician to work with day-to-day critical hardware handling, chamber operations, and general laboratory maintenance tasks.\n<br><br>\nResponsibilities include, but are not limited to:\n\n\n<ul>\n<li>Support all thermal-vacuum and space simulation testing operations, including setup and execution of thermal vacuum tests, vacuum bakeout of high outgassing components, and maintenance of high vacuum pumps and chambers in between tests.</li>\n<li>Cleanroom and general operations tasks will include day-to-day precision cleaning of flight hardware parts and verification of cleanroom performance.</li>\n<li>Employee will also perform special processes associated with surface preparations, stress stabilization or heat treatments, passivation, and dimensional verifications.</li>\n<li>This position will require data processing skills and the ability to generate technical test reports, traveler entries, calibration certifications and equipment maintenance records.</li>\n<li>Perform other duties as assigned</li>\n</ul>\n\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>B.S. degree in chemistry, physics, or associated laboratory science discipline; or minimum of 4 yrs. laboratory experience in a related field.</li>\n<li>Excellent interpersonal and customer service skills</li>\n<li>Ability to perform multiple tasks in parallel</li>\n<li>Must be able to obtain a DoD security clearance</li>\n<li>Must be a US citizen</li>\n</ul>\n\nAbout SDL: SDL offers competitive salaries and benefits. As a University Affiliated Research Center (UARC), SDL also offers unique benefits, such a flexible work schedule and discounted USU tuition of 50% for employees and dependents."}