{"job title": "Data Scientist", "company": "Uyandiswa", "city state": "– ", "rating": "4.0", "job description": "<div>Uyandiswa is a dynamic, level 1 B-BBEE 100% Black Woman Owned (BWO), value-adding organization based in Johannesburg with the presence in Durban, Cape Town and Botswana. We specialize in project management, risk and liquidity management, business analytics and organizational effectiveness across all major industries.\n<br><br>\nUyandiswa services are delivered through turnkey projects, resource augmentation as well as managed services, thanks to our flexible model which aligns to your needs.\n<br><br>\nWe deploy the use of various best practice methodologies, including PMBOK and AGILE. Our expertise also extends to LEAN SIX SIGMA, SQL Development, Qlikview, JAVA, and others.\n<br><br>\nWe pride ourselves on delivering an excellent management consulting experience and providing world-class services in strategic planning, project management, business analytics, PMO set-up and Business Process Optimisation.\n<br><br>\nWith a significant and increasing pipeline of work, we are looking to recruit highly talented, ambitious and motivated individuals to join us on our journey. Its an exciting time to join Uyandiswa and a great place to work. If you have the skills and experience as stipulated above, can demonstrate a strong level of achievement in your career and want to join a thriving solution-driven organisation where you can continue to develop your skills, we would like to hear from you. Suffice to say, we offer a competitive salary and benefits package, commensurate with your experience and will provide appropriate training to assist you in achieving your personal goals.</div><div>An exciting opportunity exists in the Data Analytics team. This senior role will be key in supporting the Business Unit Account Managers and assisting to build out the new DataLab capability.\n<br><br>\nWe are looking for an individual with experience in using a variety of data tools, analysis methods and machine learning algorithms to build and implement predictive models with demonstrable business impact.\n<br><br>\n<strong>Job Requirements:</strong>\n<br><br>\n<strong>Requirement Gathering</strong>\n<br><br>\n· Work with stakeholders throughout the organisation to identify opportunities for leveraging data to drive business insights, improve understanding and seek solutions to business problems\n<br><br>\n<strong>Data Preparation</strong>\n<br><br>\n· Assess the effectiveness and accuracy of new data sources and data gathering techniques\n<br><br>\n· Extend companys data with third party sources of information when needed\n<br><br>\n· Enhancing data collection procedures to include information that is relevant for building analytic systems\n<br><br>\n· Processing, cleansing, and verifying the integrity of data used for analysis\n<br><br>\n· Identify valuable data sources and automate collection processes\n<br><br>\n· Undertake pre-processing of structured and unstructured data\n<br><br>\n<strong>Analysis and Model Building</strong>\n<br><br>\n· Mine and analyse data to drive optimization and improvement of product development, marketing techniques and business strategies\n<br><br>\n· Analyse large amounts of information to discover trends and patterns\n<br><br>\n· Select features, building and optimizing classifiers using machine learning techniques\n<br><br>\n· Use predictive modelling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes\n<br><br>\n· Develop custom data models and algorithms to apply to data sets\n<br><br>\n· Combine models through ensemble modelling\n<br><br>\n· Develop company A/B testing framework and test model quality\n<br><br>\n<strong>Stakeholder Engagement</strong>\n<br><br>\n· Present information using data visualization techniques\n<br><br>\n· Propose solutions and strategies to business challenges\n<br><br>\n<strong>Implement and Monitor</strong>\n<br><br>\n· Coordinate with different functional teams to implement models and monitor outcomes\n<br><br>\n· Develop processes and tools to monitor and analyse model performance and data accuracy\n<br><br>\n<strong>Team Effectiveness</strong>\n<br><br>\n· Collaborate with engineering and product development teams\n<br><br>\n· Work with data and analytics experts to strive for greater functionality in our data systems\n<br><br>\n· Mentor junior data scientists\n<br><br>\n<strong>Qualifications and Experience:</strong>\n<br><br>\nProven experience as a Data Scientist\n<br><br>\nMasters or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools:\n<br><br>\nCoding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.\n<br><br>\nExperience querying databases and using statistical computer languages: R, Python, SQL, etc.\n<br><br>\nKnowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.\n<br><br>\nExperience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modelling, clustering, decision trees, neural networks, etc.\n<br><br>\nExperience using web services\n<br><br>\nExperience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, MySQL, etc.\n<br><br>\nExperience visualizing/presenting data for stakeholders using.\n<br><br>\nStrong problem solving skills with an emphasis on product development.\n<br><br>\nExperience using statistical computer languages (R, Python, etc.) to manipulate data and draw insights from large data sets.\n<br><br>\nExperience working with and creating data architectures.\n<br><br>\nKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\n<br><br>\nKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</div>"}