{"job title": "IAM Data Analyst", "company": "VanderHouwen", "city state": "– Renton, Washington", "rating": "4.5", "job description": "<div>Job ID: 37256</div>\n<br><strong>IAM Data Analyst</strong>\n<br><br>\nOur client is looking for a IAM Data Analyst to join their team. The Data Integrity Technician is responsible for audit and clean-up of duplicate records in the Identity Warehouse.\n<br><br>\n<strong>IAM Data Analyst Responsibilities</strong>\n<br><br>\nFocuses on identifying and merging records from a number of disparate source applications based on demographic criteria.\n<br><br>\nCorrects demographic information where necessary.\n<br><br>\nAccurately merges records in Epic from disparate source systems based on set, specific criteria.\n<br><br>\nAssures that correct patient information is updated in Epic and other downstream systems in accordance with company policies and procedures.\n<br><br>\nAnalyzes daily and monthly reports for discrepancies, corrections, and modifications, and follows up with the responsible individuals when an internal merge is needed or merges the accounts themselves whenever a cross facility merge is required.\n<br><br>\nInvestigates, resolves and performs follow-up tasks on Identity issues and works towards timely resolution.\n<br><br>\nPerforms other special projects as required by Management.\n<br><br>\n<strong>IAM Data Analyst Qualifications</strong>\n<br><br>\nHigh School Diploma or GED required.\n<br><br>\nIntermediate to advanced computer proficiency required.\n<br><br>\nPrevious data management and/or data entry experience required.\n<br><br>\nSome college preferred.\n<br><br>\nAbility to make sound decisions based on set, specific criteria.\n<br><br>\nAbility to work with minimal supervision.\n<br><br>\nIntermediate to advanced knowledge of personal computers and network applications.\n<br><br>\nExcellent organizational and communication skills.\n<br><br>\nSkills in problem solving and analysis.\n<br><br>\nAbility to proactively identify opportunities and issues, formulate recommended course of action, then persevere to achieve results.\n<br><br>\nMust meet tight deadlines and make sound judgments.<br><br>Benefits\n<br><br>\nBenefits are available to eligible VanderHouwen contractors and include coverage for medical, dental, vision, life insurance, short and long term disability, and matching 401k.\n<br><br>\nAbout VanderHouwen\n<br><br>\nVanderHouwen is an award-winning, Women-Owned, WBENC certified professional staffing firm. Founded in 1987, VanderHouwen has been successfully placing experienced professionals throughout the Pacific Northwest and nationwide. Our recruitment teams are highly specialized in either Technology and IT, Engineering, or Accounting and Finance career markets. Our recruiters value building meaningful, professional relationships with each candidate as well as developing honed knowledge of companies' staffing needs and workplaces. Partner with us to land your next exciting career.\n<br><br>"}