{"job title": "Data Analyst", "company": "VanderHouwen", "city state": "– Redwood City, California", "rating": "4.5", "job description": "<div>Job ID: 37947</div>\n<br><strong>***Not able to use 3rd Party Agencies***\n<br><br>\nData Analyst</strong>\n<br><br>\nOur client is seeking a Data Analyst to join their dynamic team in California. A key component of Security for our internal systems is ensuring user access levels are appropriate. Our Access review program is performed quarterly and takes all 12 weeks to complete. This role will be asked to take direction from the Access Review Program Manager who will detail the work that needs to be done each quarter. Being detailed oriented is critical for this role as there will be a lot of data sources and all work will need to be tracked and stored as evidence for internal and external auditors.\n<br><br>\n<u><strong>Data Analyst Responsibilities:</strong> </u>\n<br>\nThis role will help facilitate reviews of user access across dozens of systems. Specifically, the tasks include:\n<br>\nCreating Service Requests to track each review.\n<br>\nCompiling user entitlement data from in scope environments and from Oracle's Identity Management system.\n<br>\nFormatting data extracted from systems to ensure easy review and analysis.\n<br>\nCreate and initiate survey to be completed by designated reviewers.\n<br>\nFollow up on completion of surveys until 100%, and ensure deadlines are met.\n<br>\nWork with Oracle's Identity Management team to use OIM functionality to certify user entitlements.\n<br>\nConfirm identified reviewers by asking management to review list of reviewers.\n<br>\nCompile user entitlement data, ensuring audit evidence is captured effectively.\n<br>\nSubmit Service Request to OIM team detailing requirements for certification creation.\n<br>\nPerforms analysis of user access data, formats and organizes data for access reviews.\n<br>\nFollows up with individuals to ensure assigned work is completed by deadlines.\n<br>\nTypically reports to a supervisor or manager.\n<br>\nRelies on limited experience and judgment to plan and accomplish goals.\n<br>\nPerforms a variety of tasks.\n<br>\nWorks under general supervision.\n<br><br>\n<u><strong>Data Analyst Qualifications:</strong> </u>\n<br>\nRequires a bachelor's degree in area of specialty and 3-6 years of experience in the field or in a related area.\n<br>\nA certain degree of creativity and latitude is required.<br><br><strong>Benefits</strong>\n<br>\nBenefits are available to eligible VanderHouwen contractors and include coverage for medical, dental, vision, life insurance, short and long term disability, and matching 401k.\n<br><br>\n<strong>About VanderHouwen</strong>\n<br>\nVanderHouwen is an award-winning, Women-Owned, WBENC certified professional staffing firm. Founded in 1987, VanderHouwen has been successfully placing experienced professionals throughout the Pacific Northwest and nationwide. Our recruitment teams are highly specialized in either Technology and IT, Engineering, or Accounting and Finance career markets. Our recruiters value building meaningful, professional relationships with each candidate as well as developing honed knowledge of companies' staffing needs and workplaces. Partner with us to land your next exciting career."}