{"job title": "Senior Data Scientist", "company": "Vanguard", "city state": "– Malvern, PA", "rating": "3.3", "job description": "To build models using advanced analytic techniques, driving targeting, treatment and segmentation insights.<br><br><strong>Duties and Responsibilities:</strong>\n<br><br>\n1. Develops queries and performs extensive programming to access, transform and prepare data for statistical modeling. Identifies and diagnoses data inconsistencies and errors, forages to fill data gaps and blazes new data trails. Creates derived characteristics.\n<br><br>\n2. Designs and develops models to target marketing and service offers. Supports production implementation of models, and validates models. Creates model documentation.\n<br><br>\n3. Performs deep dive diagnostic, predictive and prescriptive analytics for customer behavioral segmentation, look-alike targeting, growth opportunity estimation and next best action identification.\n<br><br>\n4. Prepares and delivers insight presentations and action recommendations. Communicates complex material in layman's terms. Educates leaders and crew on analytical findings and implications using storytelling, data visualization and graphical artisanship.\n<br><br>\n5. Designs analytic plans, translating business problems/opportunities into analytic approaches. Engages with project sponsors and stakeholders to understand each business question. Probes for hidden questions and goals. Brings structure to each request and translates requirements into an analytic approach.\n<br><br>\n6. Analyzes data to describe client behavior and preferences, understand channel usage, diagnose client experience problems, size marketing opportunity, target clients for treatment and measure the impact of marketing and servicing initiatives. Identifies and utilizes appropriate analytic methods and specialized tools to generate insights, answer the business questions and fulfill project objectives. Seeks out innovative approaches and techniques.\n<br><br>\n7. Guides test design, research design and model validation. Provides statistical consultation services. Serves as the analytics expert on cross functional teams for large strategic initiatives.\n<br><br>\n8. Develops and applies domain knowledge of Vanguards businesses and data to shape the analytic road map.\n<br><br>\n9. Contributes to the growth of the analytic community.\n<br><br>\n10. Participates in special projects and performs other duties as required.\n<br><br>\n<strong>Qualifications:</strong>\n<ul>\n<li>Undergraduate degree in Analytics, Applied Mathematics, Economics, Statistics or related analytical field of study or equivalent combination of training and experience. Graduate degree preferred.</li> <li>A minimum of five years general experience and five years relevant professional experience in analytical roles.</li><li>Experience developing creative analytical solutions to marketing and client service problems and opportunities.</li><li>Able to take disparate data and understand it, process it, extract value from it, visualize it and communicate it.</li><li>Experience consulting to understand business problems/opportunities, translating needs into analytic projects and applying results.</li><li>Data wrangling - Programming skills to access, transform and prepare large scale data for statistical modeling.</li><li>Experience utilizing statistical and machine learning methods: data imputation, propensity models, regression (logistic, linear), clustering (k-nearest neighbors, hierarchical), decision trees (CHAID, CART), random forest, uplift modeling, optimization, simulation, time series, hazard function and survival analysis, Bayesian methods, principal component analysis, support vector machines, association rules, ensemble methods, forecasting, model validation, design of experiments, text mining.</li><li>Skills in the data science tool stack: SQL, Python</li><li>Domain experience in marketing analytics: customer acquisition, digital marketing, response modeling, identifying customer needs, predicting customer behavior, next best action, diagnosing customer struggle, attrition/churn, customer lifetime value, sales territory analytics.</li><li>Strong communicator of complex concepts and analysis, able to handle a variety of audience knowledge levels. Data visualization and storytelling skills.</li>\n</ul>\n<strong>Additional information:</strong>\n<ul>\n<li>Vanguard is not offering visa sponsorship for this position.</li>\n</ul>"}