{"job title": "Data Scientist II", "company": "Vanguard", "city state": "– Malvern, PA", "rating": "3.3", "job description": "For over forty years, Vanguard has been on a very special mission to change the way the world invests. From our unique ownership structure to our low cost options, we are committed to our belief that nothing should stand in the way of investors meeting their goals. Our Center for Analytics &amp; Insights (CAI) is dedicated to removing obstacles to these investors by using advanced analytics to solve our most difficult, messiest problems.<br><br><strong><strong>The mission</strong></strong>\n<br><br>\nThe CAIs mission is to apply innovative analytical and research approaches to help tackle complex and strategically important problems facing Vanguards businesses and clients, to become a hub for deep client insights, and to support, and enable, the entire organization to continuously develop new capabilities and solutions along the data analytics maturity curve.\n<br><br>\nAs a Data Scientist in our Center for Analytics &amp; Insights, youll lead analytics and insights engagements to support marketing and business efforts that deepen the understanding of Vanguard clients and investors. You will then deliver comprehensive, holistic, and actionable insights to leaders, including consulting on implementation and ongoing support needs, resources, and constraints. In addition, you will coach, mentor, and guide junior data scientists to help them excel and advance their career development.\n<br><br>\n<strong><strong>The team</strong></strong>\n<br><br>\nThe CAI at Vanguard has been recently established as an enterprise center of excellence for advanced analytics and market research to transform how data, analytics, and insights are used to support strategic decisions and serve Vanguards clients.\n<br><br>\nThe CAI hosts a team of highly talented, cross-disciplinary individuals including data scientists, advanced data analysts, data engineers, consultants, and market researchers who work closely together in a dynamic environment to partner with leaders across Vanguards Retail, Institutional, Intermediary, and International businesses to drive innovation and transformation.\n<br><br>\n<strong><strong>Your challenge</strong></strong>\n<br><br>\nYou will be expected to lead and execute challenging, analytic projects that provide insights into client needs and behavior thus supporting marketing and client servicing decisions. You will be required to innovate and establish yourself as a subject matter expert and a thought leader in your area of expertise.\n<br><br>\nMore specifically, in this role, you will be required to help the business formulate the problem, and then use your expertise to obtain, investigate, transform, and curate data. Next, you will use this data to build cutting edge, analytical solutions that will help Vanguard serve its clients and give them the best chance for investment success.\n<br><br>\nTypical initiatives involve understanding our clients behavior, preferences, and channel usage, diagnosing client experience problems, identifying size marketing opportunities, targeting clients for different marketing treatments, and measuring the impact of marketing and servicing initiatives.\n<br><br>\nYou will also be expected to support business partners as they seek your guidance on the interpretation, implications, and use of these analytic solutions.\n<br><br>\nVanguard's Center for Analytics and Insights careers overview\n<br><br>\n<strong><strong>Qualifications:</strong></strong>\n<ul>\n<li>Graduate degree in a quantitative/analytical field such as Data Science, Machine Learning, Mathematics, Statistics, Economics, Computer Science, Engineering, Operations Research, Physics, or other relevant scientific field; PhD preferred.</li><li>A minimum of five years of relevant professional experience in progressive analytical roles.</li><li>Deep understanding and experience building models using Deep Learning, Machine Learning and Optimization methods (for example CNN, RNN, LSTM, Regression (Generalized linear models), Decision Trees (CART/CHAID), SVM, Random Forests, GBM, Time-series analysis, Linear/Non-Linear/Integer programming, etc.)</li><li>Demonstrated experience in using the above methods to solve complex business problems thereby generating insights and providing best-in-class data driven solutions for customers.</li><li>Demonstrated experience in managing and leading large complex projects, including (but not limited to) formulating the business and analytical problem, extracting, cleansing, and manipulating large, and diverse data sets, building descriptive, predictive and prescriptive solutions and deploying these solutions in the cloud and/or on premise systems.</li><li>Demonstrated experience in communicating complex analytical solutions, data relationships and results, and their business impacts to multiple business partners and stakeholders, through superior data visualization and storytelling skills.</li><li>Strong proficiency in Python, R, Spark (Scala, PySpark).</li><li>Experience in data visualization tools such as D3.js, Tableau etc.</li>\n</ul>"}