{"job title": "Associate Data Scientist", "company": "Vans", "city state": "– Cypress, California", "rating": "3.9", "job description": "<strong>“It was never about waving the brand like a flag, it was always about the people” – Paul Van Doren</strong>\n<br><br>\nVans is the original action sports footwear company rooted in authenticity and creativity. Founded in 1966, Vans has thrived on a legacy of impacting our greater community through Vans’ four pillars: action sports, music, art and street culture. We are constantly inspired by the expressive creators within our company and community as they bring new and innovative perspectives to help shape and transform the future of our business.\n<br><br>\nAt Vans our culture sets us apart and it influences everything we do. Everything we do supports creativity and we are driven by our five values. We are determined. We are connected to our consumers and to each other. We are inclusive. We are expressive and Fun. And most of all, we are a family.\n<br><br>\nVans is a subsidiary of VF, the world’s largest apparel and footwear company comprised of over 30 brands. We are the leading drivers of retail as our global footwear, apparel and accessory brand is available in 170 countries worldwide. As we continue to expand, we take great measures in developing and growing our people.\n<br><br>\nVans is founded on a culture of learning. We take great pride in our ability to facilitate learning opportunities by providing the resources and tools necessary to support each individual’s pursuit of growth to achieve future goals. In order to prioritize career growth within our company, Vans offers courses on topics such as leadership, communication, collaboration and technical skills to ensure our employees are self-motivated and developing to the pace of our rapidly growing business.\n<br><br>\nBy joining the Vans family, you will be immersed into an environment of incredibly supportive and collaborative people. We work very hard across a multitude of large initiatives to bring the Van Doren spirit to life. We live for what we do.\n<br><br>\n<strong>Associate Data Scientist, Consumer Lifecycle Management: Become the Newest Member of the Vans Family</strong>\n<br><br>\nAs the Associate Data Science, CLM, you will you will support the loyalty team’s analytic needs, your broader focus will be on general data analysis and insights creation for the whole organization. You will provide important and relevant analyses of transactional and consumer data to drive our marketing and business decisions that result in increased revenue, consumer experience and brand affinity. You will collaborate with various internal clients to add value to their field of expertise by understanding our consumers’ behavior, recommend action plans and analyze critical results.\n<br><br>\nWith this opportunity, you will use your master skills in Alteryx, Tableau, SAS and other systems. You are familiar with navigating the pitfalls of analyzing transactional and consumer data. You have foundational knowledge in advanced analytic methodologies, such as regression, cluster analysis and predictive modeling. Your attention to details and strong analytical and data qualifications will help you manage plans and projects simultaneously and ensure a high level of accuracy of your results. You have an inherent passion for data and data driven thinking, and can extract patterns from volumes of data to drive insights and operational efficiencies. You can also take that data and tell an easy to understand brand story with actionable items for others. Additionally, you have a connectivity to youth culture, creative expression and live the Van Doren Spirit: work hard, collaborate well and most importantly, have fun.\n<br><br>\n<strong>How You Will Make a Difference:</strong>\n\n<ul>\n<li>Lead analysis of consumer data, including cross-tabulations and statistical analysis, to generate and test hypotheses about consumer and product trends.</li>\n<li>Perform transactional and/or consumer basket analysis to provide business with insights into consumer purchasing patterns.</li>\n<li>Develop standard reporting tools, such as business performance dashboards and/or scorecards, for key partners to utilize for business planning.</li>\n<li>Perform independent data mining and database research to identify consumer opportunities.</li>\n<li>Perform analyses related marketing and in-store testing, such as evaluation of segment performance within digital marketing campaigns.</li>\n<li>Support consumer data acquisition efforts to further internal knowledge of consumers</li> \n\n<li>Collaborate with functional partners to ensure the right business questions are being answered.</li>\n<li>Participate in continued efforts of improving and/or developing new data analysis methodologies to further enhance CLM team capabilities.</li>\n<li>Collaborate with VF Corporate consumer analytics group to coordinate and align on key projects.</li>\n<li>Present key insights and business recommendations to large groups and/or senior leadership teams.</li>\n</ul>\n<strong>Skills for Success:</strong>\n<br><br>\nYears of Related Professional Experience: 4+ years\n<br><br>\nEducational/ Position Requirements:\n\n<ul>\n<li>A Bachelor’s degree in business, economics, statistics or related field and a minimum of 4 years general management experience in the business or marketing analytics field or an equivalent combination of experience and training that provides the required knowledge, skills and abilities.</li> \n\n<li>Master’s Degree Preferred.</li> \n\n<li>Strong analytical skills. Curiosity.</li>\n<li>Attention to detail and data accuracy.</li>\n<li>Proven experience working with large datasets and relational database analytical tools, such as Alteryx, Tableau, SAS, JMP or similar.</li>\n<li>Highly skilled in Excel; proficient with PowerPoint or Keynote.</li>\n<li>Advanced statistical skills a plus (multi-variate analysis, cluster analysis, etc.)</li>\n<li>CRM, retail, consumer and/or loyalty analytics experience highly desired.</li>\n<li>Excellent project coordination and management skills.</li>\n<li>Comfortable with reaching out to business partners and adept at cross-functional collaboration.</li>\n<li>Must be able to develop analytic plans and manage multiple projects simultaneously.</li>\n<li>Adept in translating data into concise, insightful and business friendly executive summaries and presentations.</li>\n</ul>\nSpecial Physical and/or Mental Requirements:\n\n<ul>\n<li>Travel by air and overnight, as required 10% amount of time.</li> \n\n<li>Lifting and/or bending 5 pounds amount of weight.</li> \n</ul>\n\nAug. 28, 2018, 4:18 p.m. Costa Mesa CA Vans<br><br><strong>Vans: Be a Part of the Original</strong>\n<br><br>\n<strong>It was never about waving the brand like a flag, it was always about the people Paul Van Doren</strong>\n<br><br>\nVans is the original action sports footwear company rooted in authenticity and creativity. Founded in 1966, Vans has thrived on a legacy of impacting our greater community through Vans four pillars: action sports, music, art and street culture. We are constantly inspired by the expressive creators within our company and community as they bring new and innovative perspectives to help shape and transform the future of our business.\n<br><br>\nAt Vans our culture sets us apart and it influences everything we do. Everything we do supports creativity and we are driven by our five values. We are determined. We are connected to our consumers and to each other. We are inclusive. We are expressive and Fun. And most of all, we are a family.\n<br><br>\nVans is a subsidiary of VF, the worlds largest apparel and footwear company comprised of over 30 brands. We are the leading drivers of retail as our global footwear, apparel and accessory brand is available in 170 countries worldwide. As we continue to expand, we take great measures in developing and growing our people.\n<br><br>\nVans is founded on a culture of learning. We take great pride in our ability to facilitate learning opportunities by providing the resources and tools necessary to support each individuals pursuit of growth to achieve future goals. In order to prioritize career growth within our company, Vans offers courses on topics such as leadership, communication, collaboration and technical skills to ensure our employees are self-motivated and developing to the pace of our rapidly growing business.\n<br><br>\nBy joining the Vans family, you will be immersed into an environment of incredibly supportive and collaborative people. We work very hard across a multitude of large initiatives to bring the Van Doren spirit to life. We live for what we do.\n<br><br>\n<strong>Associate Data Scientist, Consumer Lifecycle Management: Become the Newest Member of the Vans Family</strong>\n<br><br>\nAs the Associate Data Science, CLM, you will you will support the loyalty teams analytic needs, your broader focus will be on general data analysis and insights creation for the whole organization. You will provide important and relevant analyses of transactional and consumer data to drive our marketing and business decisions that result in increased revenue, consumer experience and brand affinity. You will collaborate with various internal clients to add value to their field of expertise by understanding our consumers behavior, recommend action plans and analyze critical results.\n<br><br>\nWith this opportunity, you will use your master skills in Alteryx, Tableau, SAS and other systems. You are familiar with navigating the pitfalls of analyzing transactional and consumer data. You have foundational knowledge in advanced analytic methodologies, such as regression, cluster analysis and predictive modeling. Your attention to details and strong analytical and data qualifications will help you manage plans and projects simultaneously and ensure a high level of accuracy of your results. You have an inherent passion for data and data driven thinking, and can extract patterns from volumes of data to drive insights and operational efficiencies. You can also take that data and tell an easy to understand brand story with actionable items for others. Additionally, you have a connectivity to youth culture, creative expression and live the Van Doren Spirit: work hard, collaborate well and most importantly, have fun.\n<br><br>\n<strong>How You Will Make a Difference:</strong>\n<li>Lead analysis of consumer data, including cross-tabulations and statistical analysis, to generate and test hypotheses about consumer and product trends.</li>\n<li>Perform transactional and/or consumer basket analysis to provide business with insights into consumer purchasing patterns.</li>\n<li>Develop standard reporting tools, such as business performance dashboards and/or scorecards, for key partners to utilize for business planning.</li>\n<li>Perform independent data mining and database research to identify consumer opportunities.</li>\n<li>Perform analyses related marketing and in-store testing, such as evaluation of segment performance within digital marketing campaigns.</li>\n<li>Support consumer data acquisition efforts to further internal knowledge of consumers</li> \n\n<li>Collaborate with functional partners to ensure the right business questions are being answered.</li>\n<li>Participate in continued efforts of improving and/or developing new data analysis methodologies to further enhance CLM team capabilities.</li>\n<li>Collaborate with VF Corporate consumer analytics group to coordinate and align on key projects.</li>\n<li>Present key insights and business recommendations to large groups and/or senior leadership teams.</li>\n<strong>Skills for Success:</strong>\n<br><br>\nYears of Related Professional Experience: 4+ years\n<br><br>\nEducational/ Position Requirements:\n<li>A Bachelors degree in business, economics, statistics or related field and a minimum of 4 years general management experience in the business or marketing analytics field or an equivalent combination of experience and training that provides the required knowledge, skills and abilities.</li> \n\n<li>Masters Degree Preferred.</li> \n\n<li>Strong analytical skills. Curiosity.</li>\n<li>Attention to detail and data accuracy.</li>\n<li>Proven experience working with large datasets and relational database analytical tools, such as Alteryx, Tableau, SAS, JMP or similar.</li>\n<li>Highly skilled in Excel; proficient with PowerPoint or Keynote.</li>\n<li>Advanced statistical skills a plus (multi-variate analysis, cluster analysis, etc.)</li>\n<li>CRM, retail, consumer and/or loyalty analytics experience highly desired.</li>\n<li>Excellent project coordination and management skills.</li>\n<li>Comfortable with reaching out to business partners and adept at cross-functional collaboration.</li>\n<li>Must be able to develop analytic plans and manage multiple projects simultaneously.</li>\n<li>Adept in translating data into concise, insightful and business friendly executive summaries and presentations.</li>\nSpecial Physical and/or Mental Requirements:\n<li>Travel by air and overnight, as required 10% amount of time.</li> \n\n<li>Lifting and/or bending 5 pounds amount of weight.</li>"}