{"job title": "Data Scientist", "company": "Varian Medical Systems", "city state": "– Palo Alto", "rating": "3.8", "job description": "<strong>Position Title</strong>\n<br>\nData Scientist\n<br><br>\n24-Jul-2018\n<br><br>\n<strong>Auto req ID</strong>\n<br>\n<strong>13837BR</strong>\n<br><br>\n<strong>Business Unit Name</strong>\n<br>\nOncology Systems (ONCG)\n<br><br>\n<strong>Job Description</strong>\n<br>\nWe are looking for Machine Learning Scientists to help drive Varian's innovations in analyzing medical images and patient data to improve cancer therapy. The algorithms that you help design and the neural nets that you help guide &amp; train will be used in newly designed medical devices, will be used in the cloud and will be used in thousands of hospitals around the world that already have Varian Medical Devices.\n<br>\nIf you have a passion for analyzing data and also have a familiarity with some aspects of how cancer is presently treated, then please contact us.\n<br><br>\n<strong>Responsibilities</strong>\n\n<ul>\n<li>Work with various Varian engineering teams to apply Deep Learning techniques to analyzing medical image data sets of anonymized cancer patients.</li><li>Train Neural Nets on medical image segmentation, registration and reconstruction.</li><li>Develop automated means of applying sanity checks to the inference output of trained AI systems.</li><li>Assist in the collection, curation and assessment of various sets of Training Data.</li>\n</ul>\n\n<strong>Job Type</strong>\n<br>\nRegular Full-Time\n<br><br>\n<strong>Location-City</strong>\n<br>\nPalo Alto\n<br><br>\n<strong>Job Requirements</strong>\n<br>\n<div> <strong>Typical Education and Experience</strong>\n\n<ul>\n<li>Experience in machine learning analysis of image data.</li><li>Experience in areas of feature engineering, normalization, regularization, model optimization.</li><li>Experience with applying Deep Learning/Neural Networks to longitudinal data sets is a big plus.</li><li>Familiarity with the underlying principles of medical image acquisition and reconstruction is an asset.</li><li>Experience with linking medical images with non-image data in a machine learning application is also a big plus.</li><li>Experience with Keras &amp; TensorFlow is an asset.</li><li>Doctorate / Masters / Bachelors degree in Computer Science / Information Technology / Statistics / Mathematics or equivalent.</li> </ul></div>\n\n<br><strong>Job Function</strong>\n<br>\nMarketing\n<br><br>\n<strong>Location-State</strong>\n<br>\nCalifornia\n<br><br>\n<strong>Location-Country</strong>\n<br>\nUnited States\n<br><br>\n<strong>About Varian</strong>\n<br>\nWhen you join Varian, you’re joining an organization with nearly $3 billion in annual revenue, and more than 6,500 team members across more than 30 countries. You’ll be backed by a culture that is centered on fostering your creative potential, and experience the full support of an organization and leadership committed to inspiring you to do your best work. Bring your talent to a place where your work will help fight cancer. Join Varian’s Oncology Systems team, and the work you do can make a difference by helping to create a world without fear of cancer. We develop and manufacture products and solutions that innovate, support and streamline cancer-fighting solutions worldwide. Our teams have a common drive to help others, and a passion for excellence. Join Varian and add your talent to the fight against cancer.\n<br><br>\n<strong>EEO Policy</strong>\n<br>\nAll qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status, or on the basis of disability.\n<br><br>\n<strong>Become part of our team</strong>\n<br>\nAt Varian, our culture is centered on fostering the creative potential of every employee through teamwork and collaboration. Our technologies touch millions of lives every day, and this inspires us to do our best work – every day. By using your talent, ambition and creativity, you can build a career that allows you to make a real difference in people’s lives. You’re just one click away from the most impactful work you’ll ever do. Apply now and join our mission to help save lives. Someone, somewhere, will be glad you did.\n<br>"}