{"job title": "Scientist II - Protein Purification", "company": "Varite, Inc.", "city state": "– Carlsbad, CA", "rating": "4.0", "job description": "<p>VARITE is a global IT company providing software and engineering consulting and team augmentation services to Fortune 100 Companies in USA, CANADA and INDIA. VARITE is currently a primary and direct vendor to the leading corporations in the areas of Networking, Infrastructure Application Software, Semiconductor, EAI, Portal technologies, ERP, Wireless Service Providers, Lending - Mortgage and Financial Services.</p><p>We’re looking for a Scientist II - Protein Purification for one of our client in Carlsbad, CA 92008.</p><p> </p><p><strong>Requirement: TMO-REQ-007914</strong></p><p><strong>Job Description:</strong><strong> </strong></p><p>TMO-REQ-007914 - Scientist II - Protein Purification <strong>Salary: </strong> Open, <strong> Position Type: </strong>Contract, <strong> Project Duration: </strong>12 Months, <strong> Number Of Openings: </strong>1, <strong> Location: </strong>Carlsbad, CA 92008<br></p><p><strong>Position Summary:</strong> Work in a team based environment to perform all tasks related to the production of purified proteins for use in research and commercial products for use in the life sciences industry. Complete all production in compliance with site Quality Management System and ISO 9001.</p><p><strong>Key Objectives of the role:</strong> <br>• Responsible for manufacturing product(s) in a lab setting following standard operating procedures. Will utilize basic laboratory techniques, calculations, materials measurement, operation of laboratory equipment and record keeping necessary to manufacture products. <br>• Will perform column purification/ chromatography, buffer preparation, SDS-Page Analysis, Western Blotting, and other protein characterization techniques.<br>• Responsible for Batch Data Records, notebooks, customer reports and work order documents. <br>• Utilize specialized technical knowledge and skills to make detailed observations and analyze data to ensure within operating parameters. Advise manager of factors that may affect quality of product. Suggest options/ideas for corrective actions.<br>• Maintain equipment, product inventories and related records as assigned. Note variances on manufacturing documents; audit and evaluate process documents and propose revisions. Complete, distribute and file records as required in accordance with Document Control Practices.<br>• Identify potential issues in the production process; report findings to team management and members for resolution or participate in troubleshooting.<br>• Write technical documents which may include standard operating procedures and batch records.<br>• May lead process improvement projects or product transfer projects<br>• May perform other related duties as required and/or assigned.</p><p><strong>Minimum Qualifications (must have):</strong><br>• Must have a bachelor’s degree in Biology, Chemistry, Biochemistry, or other related discipline with a minimum of 4 years relevant protein purification experience demonstrating laboratory techniques in a manufacturing environment or research laboratory. OR Must have a master’s degree in Biology, Chemistry, Biochemistry, or other related discipline with a minimum of 2 years relevant protein purification experience demonstrating laboratory techniques in a manufacturing environment or research laboratory. <br>• Demonstrated proficiency in the use of scientific laboratory techniques, equipment and materials required. Experience in the use of basic laboratory techniques, including buffer preparation, column purification/chromatography, SDS-Page Analysis, Western Blotting, and other protein characterization techniques are beneficial. <br>• Proficient with GE AKTA FPLC protein chromatography equipment and Unicorn software, or equivalent FPLC platform.<br>• Experience with different modes of chromatography such as: affinity, ion-exchange, size exclusion, hydrophobic interaction<br>• Lifting up to 35 lbs will be required on a frequent basis. <br>• May be required to stand for long periods of time while performing duties and daily work in +4C Cold Room. <br>• Must be flexible to work varying schedules and hours as needed.<br>• Must be able to work safely with chemicals and hazardous materials.</p><p><strong>Preferred Qualifications (nice to have):</strong><br>• Consistent, dependable and accurate in carrying out responsibilities<br>• Displays positive attitude toward job and others<br>• Follows and provides direction accurately and efficiently<br>• Excellent documentation and communication skills<br>• Demonstrated ability to carry out scientific procedures and make recommendations for improvement required.<br>• Good problem solving skills necessary. <br>• Working knowledge of manufacturing related computer software preferred.<br>• Intermediate Excel skills<br>• This position has not been approved for Relocation Assistance.</p><p><strong>Key Skill/Experience/Education <br>Mandatory:</strong><br>Scientist II, Protein Purification</p><p> </p><p> </p><p>You can also search all the open jobs with VARITE and apply online at: http://www.varite.com/careers/</p><p> </p><p>VARITE is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p> - provided by Dice<br><br>Minimum of 2+ years relevant protein purification experience and proficient with GE AKTA FPLC protein chromatography equipment and Unicorn software, or equivalent FPLC platform."}