{"job title": "Data Scientist", "company": "VDart Inc.", "city state": "– San Jose, California", "rating": "4.1", "job description": "<strong>Role: Data Scientist</strong>\n<br><br>\n<strong>Location: San Jose, CA</strong>\n<br><br>\n<strong>Duration: Long Term Contract</strong>\n<br><br>\n<strong>Note: Candidate should have experience in Fraud Detection System.</strong>\n<br><br>\n<strong>Job Description:</strong>\n<br><br>\nJob Purpose and Background/Context: To be a part of the Analytics Solutions team. The Analytics Solutions team helps in identifying strategic decisions and business innovation for pioneering the next generation enterprise practices in the Analytical &amp; Advisory space across domains. The Analytics Solutions supports classifying future growth initiatives, market opportunities and charting the roadmap with competitive offerings, new products and services besides identifying scales and means for optimization. The position supports development and maintenance of quantitative models and provides analytical leadership to one or more functions Technology, Insurance, Telecommunication, Travel, Banking, Mortgage, Retail, Healthcare, and Government.\n<br><br>\n<strong>Key Responsibilities</strong>:\n<br><br>\nSet the vision and direction to the team strategically, technically and tactically - Establish and improve data collection, engineering, analysis and modeling practices and processes - Support senior management with integrating data science, analytics into decision making and the portfolio of products and services - Challenge the team to drive new solutions - Provide independent in-depth strategic modeling approach for specific domain - Model Validation and Ensuring proper model implementation through analytics with proper documentation of analytical findings for record - Attract, mentor, manage, and develop data analyst and data scientist talent - Participate in Analytics Solutions Training events to impart industry knowledge - Support Competency development by providing materials supporting Analytics solutions Initiatives in marketing and solutions - Support Product R&amp;D initiative by providing Advanced Statistical Insights &amp; Algorithms The selected candidate will be involved in the whole process of model development, including developing a research agenda to support internal and external client needs, model calibration, testing and documentation, assisting in the production-quality model implementation, and writing and presenting research papers.\n<br><br>\n<strong>Person Specification Knowledge/Experience</strong>:\n<br><br>\n<strong>5-8 years of relevant and hands-on work experience in Analytics &amp; Data Science</strong> firms - Very good verbal and written communication skills, Analytical skills and storytelling skills - Demonstrates Leadership skills including: communicates authentically; strong business acumen; ability to execute strategic vision; takes accountability for driving excellent results; manages change and ambiguity. - Experience in managing large, complex projects with multiple deliverables simultaneously - Must have hands-on experience developing data science solutions - from concept to production - Must have experience prototyping and implementing data science solutions in an enterprise - Analyze client needs and drive towards impactful business outcomes - Understanding of the issues and future challenges in more than one domain on Analytics ( Technology, Insurance, Telecommunication, Travel, Banking, Mortgage, Retail, Healthcare, and Government) by working for a research or consulting company / Financial Services organization\n<br><br>\n<strong>Competencies/Skills:</strong>\n<br><br>\nConceptualize, build, implement and improve solutions using a variety of Statistical models, Machine Learning. Deep Learning and Optimization techniques, on large data sets - Present advanced concepts and techniques to senior executives and develop trusted and highly respected relationships with customers and colleagues. - Collaborate with Data Scientist and Software Developer colleagues to research, debate, experiment and devise highly effective solutions based on Original Thinking. - Drive client engagements focused on Big Data and Advanced Business Analytics, in diverse domains such as product development, marketing research, public policy, optimization, and risk management. - Expertise in text analytics. Experience Word2Vec, GloVe, LDA etc. - Programming skills in Python or R - Knowledge of Big data technologies like Hadoop, Spark etc., - Proficiency in statistical analysis languages and software packages (such as SAS, SPSS, R, etc. - Expertise in supervised and unsupervised learning. Experience in libraries such as Scikit learn etc. and use of machine learning in at least 2 projects - Experience in Deep learning and Neural networks such as CNTK, MXNet, TensorFlow. Should have done at least 2 projects using one of the mentioned technologies - Be able to navigate data sources from converting raw data into meaningful and actionable insights to gathering qualitative information from stakeholders. - Very good with Excel, Powerpivot, data models et al. - Experience in data access from databases, ability to write complex SQL queries - Experience in BI tool such as Tableau, PowerBI, Tibco Jasper soft etc.,\n<br><br>\n<strong>Educational Qualifications:</strong> - Advanced degree with Math, Statistics or Computer science - Strong mathematical background with ability to understand algorithms and methods from a mathematical viewpoint and an intuitive viewpoint"}