{"job title": "Data Scientist", "company": "Verb Surgical", "city state": "– Mountain View, CA", "rating": "2.7", "job description": "<div>\n<div><strong>Data Scientist</strong></div><br>\n\n<div><strong>Verb Surgical - A Google and Johnson &amp; Johnson joint venture</strong>\n<br><br>\nThe Data Scientist will work with a top-notch multi-disciplinary team to develop predictive analytics software for a digital surgery platform. We are seeking a talented individual to develop and validate robust, state-of-the-art deep learning algorithms across large datasets from multiple disparate sources to generate actionable insights and solutions for product enhancement and predictive analytics. Expected contributions include algorithm design and implementation, testing on a large dataset, to name a few.\n<br><br>\n<strong>Professional Experience/Background to be successful in this role:</strong></div>\n\n\n<ul>\n\n\t<li>2+ years of technical experience in development of analytics platform</li>\n<li>Preferred experience in electromechanical and/or medical devices</li>\n<li>Solid understanding of deep learning and other machine learning algorithm</li>\n<li>Development of custom algorithms for predictive analytics</li>\n<li>Solid understanding of software concepts - data structures and algorithms</li>\n<li>Proven ability to develop predictive analytics from multiple data sources including sensor, field, vendor, test and manufacturing data</li>\n<li>Proficiency with Tensor Flow, Keras, Caffe, Torch</li>\n<li>Ability to create a front end dashboard</li>\n<li>Working with cross-functional teams in fact pace environment: collecting requirements/inputs and reporting results</li>\n<li>Knowledge of statistical and reliability analysis techniques is strongly preferred</li>\n<li>Masters or PhD candidate or recent graduate in electrical engineering, computer science, biomedical engineering or other related field.</li>\n</ul>\n\n<strong><div>\nKey Responsibilities:</div>\n\n<br></strong>\n\n\n<ul>\n\n\t<li>Investigate, prototype, and refine new algorithms in deep learning and data analytics to enable predictive analytics</li>\n<li>Create a potential pathway to deploying these algorithms on a real-time basis.</li>\n<li>Investigate the scalability of the algorithms and the needed data pipeline to do so.</li>\n<li>Assist identification of tools and resources required to develop the predictive analytics platform.</li>\n<li>Develops predictive model based on inputs and requirements from Design, Quality, NPI/Manufacturing, and Service.</li>\n<li>With inputs from Quality, NPI/Manufacturing and Service develops actionable dashboards.</li>\n<li>Identifying gaps in data collection and coverage and taking action to close these gaps via design and process changes.</li>\n</ul>\n\n<div><strong>Who is Verb Surgical?</strong>\n<br>\nVerb Surgical is shaping the future of surgery. A new future, a future unimagined even a few years ago, which will involve machine learning, robotic surgery, instrumentation, advanced visualization, and data analytics. A future of surgery that aims to achieve improved patient outcomes, lower costs, and greater hospital efficiency. Verb Surgical was founded with technology, expertise, and funding from Verily (formerly Google Life Sciences) and Ethicon, a medical device company in the Johnson &amp; Johnson family of companies. This company will continue in strong partnership with Verily and Ethicon (Google and Johnson &amp; Johnson Teams for Robotic Surgery) to advance the surgical tools and capabilities available to surgeons and OR professionals today.</div>\n</div>\n<br>"}