{"job title": "Data Scientist", "company": "Verizon Wireless", "city state": "– Basking Ridge, NJ", "rating": "3.6", "job description": "<strong>What you’ll be doing...</strong>\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\nBusiness Intelligence in support of Valued Based Marketing, is building up its advanced analytics center specialized in Investment Valuation and Optimization at its core. This is a unique opportunity to be a part of a growing team in a fast-paced and evolving environment that delivers business impacts from data science driven recommendations. Working in close partnership with internal business partners (including Finance, Marketing, Channel Operations, and IT), participate in the design, delivery and implementation of innovative and complex analysis providing rich insights into consumer behavior and improving business performance.\n<br><br>\n<strong>Analytical Work Management:</strong>\n<br><br>\n- Hands on active participation in analytical projects delivering improvements in decision-making and business strategies via advanced analysis.\n<br><br>\n- Work in close collaboration with IV&amp;O partners to leverage expertise in data management, advanced modeling, scoring etc...\n<br><br>\n- Participate in the design, implementation and interpretation of advanced multi-factor experiments to evolve current single factor testing approach.\n<br><br>\n- Prepare presentations and documentations of complex statistical concepts and research results to be shared with non-statistical audience.\n<br><br>\n- Help foster a continuous test &amp; learn culture and process - i.e. rapid cycle learning.\n<br><br>\n<strong>Business Partnership:</strong>\n<br><br>\n- Develop strong relationships with business partners to transform the role of analytics in decision making moving from a decision support role to decision guidance role (analytics as partner not as support function)\n<br><br>\n- Build strong cross-functional relationships and become a recognized subject matter expert.\n<br><br>\n<strong>Learning and Development:</strong>\n<br><br>\n- Continually broaden and strengthen knowledge of analytical methods, vendors and tools.\n<br><br>\n- Participate inknowledge/best practice sharing opportunities.\n<br><br>\n<strong>What we’re looking for...</strong>\n<br><br>\n5+ years of active experience in:\n<br><br>\n- Developing and implementing advanced analytical solutions to complex business problems/opportunities.\n<br><br>\n- Predictive modeling, analysis and visualization to realize absolute and incremental commercial gains.\n<br><br>\n- Working in the Consumer/Retail space within the Financial Services, Telecommunications, Technology or other related mass market industries preferred, however, related work in the Public Policy, Bio-statistics and Scientific Research industries will be considered.\n<br><br>\nExperience in the Wireless industry.\n<br><br>\nHands on usage of SAS or SPSS required. Ability to program in SQL, MATLAB, Python, R or other related tools a plus.\n<br><br>\n<strong>When you join Verizon...</strong>\n<br><br>\nYou’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.\n<br><br>\n<strong>Equal Employment Opportunity</strong>\n<br><br>\nWe're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}