{"job title": "Data Scientist", "company": "Vesta Corporation", "city state": "– Lake Oswego, OR", "rating": "2.1", "job description": "We are looking for a <strong>Data Scientist</strong> to become part of our outstanding risk management team. The role of the <strong>Data Scientist</strong> is to discern fraudulent transactions from a large pool of legitimate ones. You will achieve this by leveraging all the data available to build complex models and rules for real-time decisions. To succeed in this role, you must demonstrate the ability to leverage new technology and advanced machine learning to analyze and discover new insights to achieve the company's operational and strategic goals. The ideal candidate for this position has strong analytical skills, enjoys problem solving, and is passionate about fighting fraud.\n<br><br>\n<strong>Position Responsibilities:</strong>\n<ul>\n<li>Manage large customer accounts by optimally balancing transaction approval rates and loss rates</li><li>Analyze large volumes of data to understand consumer behavior, identify patterns of good and fraudulent activities, and eventually take effective actions</li> <li>Monitor for newly developing fraud patterns and determine when to take further actions</li><li>Develop and implement predictive models for fraud detection</li><li>Analyze and implement decision rules to combat developing fraud attacks</li><li>Be capable of making decisions with limited information and ambiguous situations</li><li>Be capable of taking initiatives in identifying and solving problems</li>\n</ul>\n<strong>Qualifications:</strong>\n<ul>\n<li>M.S. or PhD in Computer Science, Statistics, Applied Math, or a quantitative field with a strong background in machine learning or data mining</li><li>Strong knowledge and experiences in machine learning and statistical modeling (e.g. neural networks, decision trees, clustering and regression analysis) is required</li><li>Expertise in data warehouse and SQL programming is required</li><li>Expertise in one of the statistical programing languages (Python, R, SAS/Base, SAS/Stats, SAS Enterprise Miner) is required</li><li>Experience in payment fraud detection and prevention is a plus</li> <li>Familiarity with open source Python based ML libraries is a plus</li><li>Experience with cloud computing (AWS) is a plus</li>\n</ul>"}