{"job title": "Data Scientist", "company": "Vettery", "city state": "– New York, NY", "rating": "4.7", "job description": "<strong>Here's the gist:</strong>\n<br><br>\nVettery is fundamentally changing the way people hire and get hired. Leveraging machine learning models that track real-time data, monitor trends and predict hiring behavior, we're able to help companies grow their teams with more accuracy, speed, and compatibility. We're currently working with over 4,000 companies of all sizes, ranging from Fortune 500 giants to startups based out of co-working spaces.\n<br><br>\nThe focus of the data science team is digitizing recruiting - from candidate sourcing, to profile \"vetting\" and curation, to making the best matches between candidates and companies. Vettery data scientists work on decision support, product optimization, and operation scaling projects across these areas. Vettery is growing quickly and this role has the potential for huge impact on our trajectory. You'll be reporting directly to our VP/Head of Data Science and working closely with the product and engineering teams. The ideal candidate is a critical thinker and a good communicator who excels in a fast-paced environment. Get in on the ground floor of our expanding data science team!\n<br><br>\n<strong>Who you are:</strong>\n\n<ul>\n<li>Ph.D. in Statistics, Operations Research, Mathematics, Computer Science, or other quantitative field.</li> \n\n<li>2+ years of industry experience delivering and scaling successful and innovative machine learning products (e.g. recommendation engines, experimentation systems).</li>\n<li>Track record of success working both independently and with key stakeholders to identify and solve data science problems.</li>\n<li>Strong skills in statistical languages (e.g. Python/R) and querying languages (e.g. SQL).</li>\n<li>Experience with NLP a plus! (but not required)</li>\n<li>With the above said, we always encourage people of all backgrounds and experiences to apply. We understand that job listings don't always allow your unique work history to shine so we invite you to show us what you know!</li>\n</ul>\n<strong>What you'll do:</strong>\n\n<ul>\n<li>Move quickly to deliver amazing data science products, developing creative solutions to our biggest data science and engineering challenges</li>\n<li>Build machine learning infrastructure and models (e.g. recommendation engines, statistical models, NLP engines) that drive activity on our platform, scale our business, and enhance the user experience.</li>\n<li>Collaborate with engineering and product leaders, as well as the co-founders, to frame and tackle a problem, both mathematically and within the business context</li>\n<li>Communicate rationale and findings from analyses to facilitate operational decisions</li>\n<li>Design and track experiments for data science products as well as analyses throughout the organization</li>\n<li>In short, own all phases of the data science product lifecycle (exploratory data analysis, model development, model productionizing, rollout, and evaluation)</li>\n</ul>\n<strong>Benefits:</strong>\n\n<ul>\n<li>Competitive salary</li> \n\n<li>Open vacation &amp; sick time</li>\n<li>Medical, vision, and dental insurance</li>\n<li>Apple laptop computer</li>\n<li>Frequent team outings, lunches, and team building events</li>\n<li>A beautiful office located in a sunny corner in the Flatiron district, recently named one of Crain's 100 Best Places to Work in New York City</li>\n<li>Lots of free food: stocked kitchen + beverages</li>\n</ul>"}