{"job title": "Dickies - Data Scientist (Ft. Worth)", "company": "VF", "city state": "– Texas", "rating": "3.5", "job description": "<u><strong>Job Description</strong></u>\n<br><br>\n<u><strong>Summary:</strong></u>\n<br><br>\nThe primary purpose of this position is to design and build statistical models and to use simulation tools to address business problems and support complex business decisions. Regular activities include data collection, pre-processing of data, analysis, and presentation of information using data visualization techniques and technology. This role will utilize machine learning based tools and artificial intelligence to automate certain supply chain processes. Over time, this work will build the next generation operations function.\n<br><br>\n<u><strong>Responsibilities:</strong></u>\n<ul>\n<li>Engage in the business to understand strategic direction, comprehend key challenges and opportunities, and lead hypothesis development of likely solution sets to test.</li><li>Research, design and develop statistical learning models for data analysis, to inform Supply Chain decisions with deep insights from models and analysis.</li><li>Collaborate cross-functionally throughout the Workwear organization to execute data analysis and projects.</li><li>Communicate results and ideas to key decision makers.</li><li>Present information using data visualization technology.</li><li>Keep up to date with the latest technology trends with machine learning, artificial intelligence, neural networks, natural language processing, etc. to further enhance supply chain operations.</li>\n</ul>\n<u><strong>Qualifications:</strong></u>\n<ul>\n<li>Bachelor’s degree from an accredited university in Computer Science, Statistics, Applied Mathematics or related field. Master's degree preferred.</li><li>5 years+ experience in data analytics, data mining and statistical analysis.</li><li>Excellent pattern recognition and predictive modeling skills.</li><li>Ability to program in languages such as Python, R, Java would be an asset.</li><li>An understanding of how to leverage open source tools to automate certain analytical processes.</li><li>An understanding of machine learning tools/processes to improve analytical efficiency.</li><li>Working knowledge of statistical programming such as Python or R, and a working knowledge of database querying languages like SQL.</li><li>Solid understanding of statistical tests, causal analysis, classification, distributions, confidence tests, regression, sampling, etc.</li><li>Familiarization with machine learning methods, algorithms, etc.</li><li>Familiarization with data visualization tools such as Tableau, Alteryx, GitHub, etc.</li><li>Effective communication skills (verbal and written). Able to make the technical understandable.</li><li>Basic understanding of the wholesale apparel supply chain business.</li>\n</ul>"}