{"job title": "Social Media Analytics Manager - Research Analytics, Business Intelligence", "company": "Viacom", "city state": "– New York City, New York", "rating": "3.4", "job description": "Job Locations US-NY-New York\n<br><br>\niCIMS ID 2018-9722\n<br><br>\nOverview and Responsibilities\n<br><br>\nViacom International Media Networks\n<br><br>\nViacom is home to premier global media brands that create compelling television programs, motion pictures, short-form video, apps, games, consumer products, social media and other entertainment content for audiences in more than 165 countries and territories. Viacom's media networks, including MTV, VH1, CMT, Logo, BET, CENTRIC, Nickelodeon, Nick Jr., TeenNick, Nicktoons, Nick at Nite, Comedy Central, TV Land, SPIKE, Channel 5 (UK), Tr3s, Paramount Channel and VIVA, reach a cumulative 3.2 billion television subscribers worldwide. Paramount Pictures, America's oldest film studio, is a major global producer and distributor of filmed entertainment.\n<br>\nThe Research Analytics team is responsible for all BI research reporting outputs across Viacom's International linear and non-linear platforms (TV channels, website/apps and social media). The role of the Analytics teams is to provide stakeholders with regular analytics, data-led insights and business expertise. Using reporting tools, we manage and publish numerous weekly, monthly, quarterly and annual reports on performance and forecasting across all major metrics that inform and guide the business. Stakeholders (brand groups, regional clusters, business lines and HQ) look to the team for analytical insights and expertise relating to performance and trends across VIMN's properties and the markets in which we operate.\n<br>\nIn addition, the Analytics branch brings together dedicated BI operations, expertise, and support. Influencing all levels of the data flow from source through to report production, the group ensure business reporting is reliable, impartial, consistent and timely. The team is also involved in projects to build bespoke tools and dynamic dashboards to democratize research data across the business for self-service.\n<br><br>\nThe Role\n<br><br>\nWorking closely with the brand digital media leads the role will involve monitoring, reporting and analyzing performance of content across VIMN properties on digital media platforms, primarily social. This will include regular reporting and analysis across all key performance metrics, identifying trends and helping guide content strategy and audience development. In addition the role will provide competitive context and proactively anticipate industry trends and issues. As part of the Business Intelligence Research Analytics team the role will also proactively contribute to our aims of developing, enhancing and automating our reporting and analytics solutions in line with stakeholder and business requirements.\n<br><br>\n<strong>Responsibilities:</strong>\n\n\n<ul>\n<li>Provide regular reporting and analysis of shortform/social media content across key performance metrics (views, time spent, engagement rates, view through rates, sentiment etc)</li>\n<li>Provide day to day insights on the performance of individual assets/content pieces and in turn be able to offer the best course of action based on the insight</li>\n<li>Highlight trends and tell the story of content performance, identifying any anomalies or issues that need addressing</li>\n<li>Run competitor analysis on other content types, brands and channels and use this insight to help guide our content strategies and give key insights in how we can adapt in order to grow</li>\n<li>Be able to provide in-depth analysis and case studies on particular topics on request and report findings back to relevant teams</li>\n<li>Deliver ad-hoc cross-platform (Websites, Apps &amp; Social) reports &amp; insights quickly to assist stakeholders with time sensitive business decisions</li>\n<li>Manage forecasting process for nominated brand and advise on performance to estimate</li>\n<li>Define workflow in internal and external systems to ensure correct data is captured and reported</li>\n<li>Manage and understand requirements across stakeholder groups and be able to support business objectives for these groups</li>\n<li>Work with the Reporting Operations group to develop, enhance and automate reporting solutions</li>\n</ul>\n\nBasic Qualifications\n\n\n<ul>\n<li>Experience of providing digital/social research analytics and data to senior stakeholders in an international business</li>\n<li>Excellent knowledge and understanding of digital metrics and the wider digital industry</li>\n<li>Excellent communication and presentation skills with the ability to demonstrate subject matter authority and expertise</li>\n<li>Experience of key digital media reporting tools (e.g. Falcon, Tubular Labs, Adobe Analytics)</li>\n<li>Understand concepts behind Business Intelligence (e.g. - data warehouses, automation) and how information can be used to drive competitive advantage</li>\n<li>Hands-on technical BI skills, ideally including experience using BI reporting tools (e.g. Tableau)</li>\n</ul>\n\nAdditional Qualifications\n\n\n<ul>\n<li>Ability to accurately interpret and translate varied and complex requests into actionable tasks</li>\n<li>Proactively identify opportunities to improve processes and services provided</li>\n<li>Demonstrate ability to quickly communicate timelines, prioritize, maintain focus, delegate if necessary and deliver results in a timely manner when faced with numerous urgent tasks</li>\n<li>Have excellent attention to detail and ability to monitor and review the quality of work done by self and others to maintain appropriate standards</li>\n<li>Be able to demonstrate Viacom Core Competencies and share VIMN values</li>\n</ul>\n\nOptions"}