{"job title": "Data Scientist Intern", "company": "Viasat", "city state": "– US - CA - Carlsbad", "rating": "4.0", "job description": "Job description\n <div><div><div>Bigger challenges. Bolder ideas. Global impact. At Viasat, we\u0092re on a mission to deliver connections with the capacity to change the world. We\u0092re the company behind the world\u0092s fastest satellite internet service, with technology that\u0092s helping to bridge the digital divide and improve life for our customers around the globe. By providing powerful new ways for people to connect with one another, gain greater access to education, entertainment, medical research, commerce, and much more, our team is empowering millions of customers worldwide. </div><div><br></div><div>We\u0092re growing rapidly and looking for passionate, innovative professionals to join our team and connect the world to more. You\u0092ll work in a collaborative and inclusive environment that values diverse perspectives and continuous learning, and provides industry-leading benefits with unmatched opportunities for career growth. Our team is fearless in pursuit of new ideas and uncompromising in our quest to become the world\u0092s first truly global Internet Service Provider. Interested in joining our mission? Take a look at career opportunities at Viasat today.</div></div><div><br></div><div><div><br></div><div><strong>WHAT YOU\u0092LL CONTRIBUTE\u0085</strong><br><br>The Cyber Security Data Science Engineer will leverage cutting edge technologies to perform statistical analysis and inference, data modeling, clustering and predictive analysis. As a key member of the technical team, you will translate cyber and network security related questions into sophisticated models and help derive new insights to drive business decisions and defend against cyber attacks. You will be working with unique data sets, security appliances, services and product teams to create complete and holistic analyses. You will help create an elaborate model focusing on network traffic due to malware and cyber threat detection that will analyze and predict and their security risks.<br><br><strong>WHAT YOU\u0092LL GET TO DO\u0085</strong><ul><li><strong>Parameterization and Abstraction</strong>: Use data-driven methodologies to discover/develop and abstract key security and malware metrics across multiple models and network segments to support network traffic due to malware and security threat evaluation and analysis, including evaluation of alternate threat detection and network bandwidth consumption due to malware models and future business scenarios</li><li><strong>Modeling</strong>: Architect, Design, Build and Support data models using both real time and historical analysis approaches to support security, business, technical planning, and decision-making.</li><li><strong>Visualization</strong>: Create visualizations and reports to effectively convey the information discovered through data analysis</li></ul></div><div>Requirements</div><div><ul><li>Currently pursuing a bachelors or masters in Computer Science, Computer Science &amp; Engineering, Engineering &amp; Computer Science, Math &amp; Computer Science, Mathematical Engineering, Mathematical Science, Mathematics, Statistics</li><li>Strong data wrangling skills</li><li>Strong Python and/or SQL skills</li><li>Ability to manipulate JSON/XML data</li><li>Experience with Splunk</li><li>Experience with other data manipulation platforms</li><li>Experience with Ansible, Puppet, Jenkins, and Chef</li><li>Experience with XML, SQL</li></ul></div></div><div>To learn more about this site and other office locations, please click here!</div></div>\n \n Additional requirements\n\n <div>\n <p>Minimun education:</p>\n <div>High School Diploma or GED</div>\n </div>\n \n <div>\n <p>Years of experience: </p>\n <div>0-1 years</div>\n </div>\n \n <div>\n <p>Travel: </p>\n <div>None</div>\n </div>\n \n <div>\n <p>Citizenship: </p>\n <div>US Citizenship Required</div>\n </div>"}