{"job title": "Data Scientist University Grad", "company": "Viasat", "city state": "– US - CA - Carlsbad", "rating": "4.0", "job description": "Job description\n<br>\n <div><div>Bigger challenges. Bolder ideas. Global impact. At Viasat, we\u0092re on a mission to deliver connections with the capacity to change the world. We\u0092re the company behind the world\u0092s fastest satellite internet service, with technology that\u0092s helping to bridge the digital divide and improve life for our customers around the globe. By providing powerful new ways for people to connect with one another, gain greater access to education, entertainment, medical research, commerce, and much more, our team is empowering millions of customers worldwide.\n<br><br>\nWe\u0092re growing rapidly and looking for passionate, innovative professionals to join our team and connect the world to more. You\u0092ll work in a collaborative and inclusive environment that values diverse perspectives and continuous learning, and provides industry-leading benefits with unmatched opportunities for career growth. Our team is fearless in pursuit of new ideas and uncompromising in our quest to become the world\u0092s first truly global Internet Service Provider. Interested in joining our mission? Take a look at career opportunities at Viasat today.\n<br><br>\n<strong>Job Responsibilities</strong>\n<br><br>\nBecome a personal contributor in our mission to connect the world. Viasat Data Scientists innovate in an environment that encourages collaboration while challenging the status quo. Join the industry leader in satellite communication and technology and take control of your professional pathway.\n<br><br>\nOur culture empowers us to do the right thing and explore technology that will benefit people across the globe. It is uniquely Viasat and, intentionally, not like any other company.\n<br><br>\nAs a new graduate, we understand that seeking your dreams is your ambition…and achieving them is ours.\n<br><br>\nViasat Impact:\n<ul>\n<li>Residential broadband service – over 700K customers and growing</li><li>Viasat Satellite technology holds the Guinness World Record for highest capacity communication satellite</li><li>Our in-flight Wi-Fi connectivity is presently streaming Amazon Prime and Netflix on providers like JetBlue and United Airlines</li><li>Secure communication services - trusted encryption and networking solutions (government, military, critical infrastructure &amp; utilities)</li>\n</ul>\n<strong>Requirements</strong>\n<ul>\n<li>Bachelor of Science or Arts degree or higher in Computer Science or Masters of Science or PhD candidate in a discipline requiring strong mathematics and statistical methods</li><li>1+ years developing software in Java, python, C++ and other high level languages.</li><li>Relevant experience as described above with a solid background in machine learning, statistical analysis, and software development.</li><li>Solid background in machine learning, statistical analysis, and clustering algorithms</li><li>Strong software development skills</li><li>Up to 10% travel</li>\n</ul>\n<strong>Preferences</strong>\n<ul>\n<li>Knowledge and experience with predictive modeling including: Multivariate Regression, Logistic Regression, Combinatorial Optimization, Stochastic Processes, Complex Analysis, Principal Component Analysis and Time Series Analysis.</li><li>Experience with Matlab, R , or Weka.</li><li>Experience with using the Agile software development methodology to develop and deliver software so as to support a continuous integration/continuous deployment process.</li><li>Working knowledge of Linux</li><li>Strong communication and presentation skills – you must be able to explain and present hypotheses and analysis results to a wide audience in a clear and concise manner.</li><li>Experience developing distributed systems</li>\n</ul>\nIf you are ready to take control of your career and help illuminate the world for those who have been in the dark, you might be ready to join our team. Please take a minute to submit your resume. We will let you know once we’ve received it and will follow up with you if there is a possible match. This could be the start of something amazing!\n</div><div>To learn more about this site and other office locations, please click here!</div>\n</div>\n\n<br>Additional requirements<br>\n\n <div>Minimun education:<br>\n<div>MA/MS</div></div><br>\n\n<div>Years of experience:<br>\n<div>0-1 years</div></div><br>\n\n<div>Travel:<br>\n<div>Up to 10%</div></div><br>\n\n<div>Citizenship:<br>\n<div>US Citizenship Required</div></div>\n<br>"}