{"job title": "Data Scientist", "company": "ViaSat", "city state": "– San Diego, CA", "rating": "4.1", "job description": "Viasat designs, builds, and operates high-capacity satellite networks - bringing broadband Internet access to the world.\n<br><br>\nOur Team\n<br>\nWe employ the latest technologies (Spark, Kafka, Impala, Hadoop) to analyze the Petabytes of data our operational systems produce. We employ developers, data scientists, and engineers to gain insight; solving both business and technical problems. Our innovative solutions are a result of the diversity of our team.\n<br><br>\nYour Opportunity\n<br>\nAs a team member, youll build a breadth of knowledge including distributed systems, predictive analytics, and machine learning. You will design, develop, and deploy analytic pipelines to answer questions across multiple business areas and disciplines.\n<br><br>\nOur Ideal Candidate\n<br>\nWe encourage learning through immersion, collaboration and action. We value adaptability and curiosity. Our ideal candidate is someone focused on solving tough problems using data and loves doing so.\n<br><br>\nAs a Data Scientist, you will contribute with:\n<br>\nExploratory Analysis: Architect, design, and build data analysis pipelines working with large and complex data sets.\n<br>\nVisualizations: Create visualizations to effectively convey the information discovered through analysis.\n<br>\nProduct Operations: Design experiments, build dashboards, and evaluate &amp; define metrics to improve business performance.\n<br><br>\nRequirements\n<br><br>\nBachelors degree or equivalent experience\n<br>\n10% travel\n<br>\nAt a minimum, we are looking for people with the following skills:\n<br>\nExcellent understanding of several statistical and machine learning models\n<br>\nExtensive experience with data analysis tools such as R, Python, Matlab\n<br>\nFamiliarity with Big Data technologies such as Spark, Impala, Hadoop\n<br><br>\nPreferences\n<br><br>\nYoull be especially competitive if you have any of:\n<br>\nExperience with Scala or Java\n<br>\nMS/PhD in a data related field such as mathematics, computer science, physics, or similar"}