{"job title": "Data Scientist", "company": "VideoAmp", "city state": "– Los Angeles, CA", "rating": "4.4", "job description": "<div><div><b>Data Scientist: </b>Perform complex data analysis and develop data algorithms and solutions to provide market insight on viewership to advertisers for TV, internet, and other digital media platforms. Execute complex SQL queries of large data sets and aggregate results to generate viewership data and discern patterns and trends. Perform comparative analyses of different TV datasets, including comparing viewership from different TV data sources and analyzing OTT, cable, and internet audiences. Analyze user profile clusters and perform behavioral analysis to analyze the profiles of viewers and determine the most significant clusters of user interest. Develop algorithms for data analysis, forecasting, and reporting using computation tools including MATLAB/Octave, R, SQL, and programming languages including JavaScript, HTML/CSS, and XML. Develop and implement data analysis techniques including regression analysis, queue modeling machine learning, and neural networks to derive intelligence outcomes and impacts from large-scale data. Develop predictive and machine learning models and algorithms to forecast viewership for specific segments and track dynamic and seasonal changes in different targeted audiences. Evaluate models for feasibility issues and ensure solutions meet rigorous security and information requirements for data collection, storage, and management. Establish automated analytical processes, automate manual processes, and develop methods to enable analysts to exploit data holdings. Stay abreast of the latest technological advances and industry trends in data science and identify and recommend data science solutions for various product initiatives.</div><div><b> </b></div><div><b>Requirements</b>: The position requires a Master’s degree in Computer Science, Mathematics, or Physics, or a related field and three months of experience in the job offered or a related position. The position requires skills and knowledge in statistical tools including regression analysis, queue modeling, machine learning, and neural networks as well as computation tools including MATLAB/Octave, R, SQL, and programming languages including JavaScript, HTML/CSS, and XML.</div><div> </div><div>40 ours/week. <b>Job Interview Site: </b>Los Angeles, CA <b>Email Resume to: </b>VideoAmp, Inc. at careers@videoamp.com. </div><div><br></div><div><br></div></div><div><div><br></div></div>"}