{"job title": "Senior Scientist", "company": "View, Inc.", "city state": "– Milpitas, CA, United States", "rating": "2.9", "job description": "Our mission is to create delightful human environments.\n<br><br>\nView manufactures View Dynamic Glass, a new generation of smart windows that let in natural light and views, and enhance mental and physical wellbeing by significantly reducing headaches, eyestrain and drowsiness. In addition, View’s windows reduce glare and heat, improving the energy efficiency of buildings by 20 percent. View’s windows are digital, connected, and can be controlled from anywhere, including your phone – no blinds or shades required.\n<br><br>\nView Dynamic Glass is already installed in over 400 buildings in multiple markets including commercial offices, airports, hospitals, multi-family residences, including major airports like San Francisco, Boston and Charlotte Douglass, and the offices of WeWork, Overstock.com, FedEx, Kaiser Permanente, Wells Fargo, and Hewlett Packard Enterprise.\n<br><br>\nOur culture at <strong>View</strong> is full of thinkers, explorers and builders. In the great tradition of disrupting industries and challenging the way we think about everyday essentials, the team at View has reinvented something that hasn't changed for centuries - the simple window - and by doing so is transforming the largest industry in the world: real estate.\n<br><br>\nIf you have ever dreamed of changing the world to make it a better place - join us.\n<br><br>\n<strong>POSITION SUMMARY</strong>\n<br><br>\nView is in search of a Senior Scientist for our R&amp;D organization. In this role, you will conduct research into materials systems to improve upon the optical and electrical performance of device stack. Your goal will be to deliver manufacturable solutions based on a practical approach to research. You will employ scientific principles that will allow you to break down a problem into it’s smaller parts and then conduct research into solution strategies.\n<br><br>\nIn this role you will have the flexibility to define the scope of work and run your own experiments. You will be working with a group of people with advanced degrees in areas like Physics, Chemistry, and Engineering to add to View’s intellectual property and define alternative applications/uses of our core technology.\n<br><br>\n<strong>ESSENTIAL POSITION RESPONSIBILITIES</strong>\n<ul>\n<li>Conduct research on advancement of thin film coatings for future generations of product</li><li>Be able to interface with Operations and Durability teams on the deposition and testing aspects</li><li>Work with the Production teams on process transfer</li>\n</ul>\n<strong>DESIRED SKILLS AND EXPERIENCE</strong>\n<ul>\n<li>Detailed understanding of Sputter Deposition is required</li><li>Strong foundation in electrochemistry is required</li><li>Knowledge of typical thin-film characterization techniques (SIMS, RBS, XPS, etc.) is required</li><li>Hands-on knowledge of statistical data analyses methods and tools is required</li><li>MS or PhD (preferred) in Engineering, Physics, or Chemistry</li><li>3+ years of work experience is required</li><li>Travel: &lt;10%</li>\n</ul>\nView, Inc. is an equal opportunity employer\n<br><br>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}