{"job title": "Data Scientist", "company": "Viome", "city state": "– New York City, NY", "rating": "5.0", "job description": "<div>Viome is a wellness as a service company that applies artificial intelligence and machine learning to biological data – e.g., microbiome, transcriptome and metabolome data – to provide personalized recommendations for healthy living. We are a small, fast growing, interdisciplinary team of passionate experts in biochemistry, microbiology, medicine, artificial intelligence and machine learning.</div><br>\n\n<div>We are seeking an experienced Data Scientist to join our team at our NYC office. Working closely with data scientists and machine learning engineers, you will analyze Viome’s unique biological dataset and model customers’ wellness outcomes, resulting in actionable healthcare insights. Tasks will include developing custom models to cluster our customer data into meaningful groups and demonstrating the effects of certain microbes on various health markers. This role will give the right candidate unparalleled experience pushing the boundaries of microbiome research. Seniority will be determined based on the candidate’s experience.</div><br>\n\n<div>This is a full-time, onsite position at our offices in New York City, NY.</div><br>\n\n<div><strong>Responsibilities:</strong></div>\n<ul>\n<li>Visualization and exploratory analysis of large datasets</li>\n<li>Define clear technical problems from high-level business requirements</li>\n<li>Work collaboratively and cross-functionally to analyze and model large sets of data</li>\n<li>Determine the most fruitful approaches, and explore them independently</li>\n<li>Communicate effectively with our team of experts in biotech and healthcare, and draw on scientific literature for guidance</li>\n<li>Present technical results to a non-technical leadership audience</li>\n<li>Technical writing, contributing to publications describing our findings</li>\n</ul>\n\n<div><strong>Skills &amp; Qualifications:</strong></div>\n<ul>\n<li>4+ years professional experience in a data science role</li>\n<li>MS/PhD in Statistics, CS or related field</li>\n<li>Thorough mastery of supervised and unsupervised learning algorithms</li>\n<li>Python (numpy, scipy, pandas), SQL, Java</li>\n<li>Health/bio background, or experience with RNA/DNA data a plus</li>\n<li>Be able to work independently and pivot quickly</li>\n<li>Be able to thrive in a fast-paced startup environment</li>\n</ul>\n\n<div>Viome is 100+ person start-up offering a successful commercial product that has generated high demand. With offices in California, New Mexico, New York and Washington, we are looking to hire team members capable of working in dynamic environments, who have a positive attitude and enjoy collaboration. If you have the skills and are excited about Viome’s mission, we’d love to hear from you.</div>"}