{"job title": "Data Analyst", "company": "Virginia Government", "city state": "– Virginia Beach, Virginia", "rating": "3.7", "job description": "Working Title Data Analyst\n<br><br>\nRole Title\n<br><br>\nJob Open Date 10/15/2018\n<br><br>\nJob Close Date\n<br>\nJobs close at 11:59pm EST/EDT.\n<br><br>\nJob Type Detail\n<br>\nDefinition\n<br><br>\nIs this position funded in whole or in part by the American Recovery &amp; Reinvestment Act (Stimulus Package)?\n<br><br>\nHiring Range $55,000-$60,000\n<br><br>\nAgency VA Commonwealth Univ (236)\n<br><br>\nAgency Website\n<br><br>\nLocation\n<br><br>\nSublocation Varies Upon Assignment\n<br><br>\nPosition Number ******\n<br><br>\nJob Posting Number\n<br><br>\nDoes this position have telework options?\n<br><br>\nBilingual/Multilingual Skill Requirement/Preference\n<br><br>\nType of Recruitment\n<br>\nDefinition General Public - G\n<br><br>\nJob Type\n<br>\nDefinition\n<br><br>\nPay Band\n<br><br>\nJob Description The Data Analyst will be responsible for analyzing and interpreting data to support the fundraising and alumni engagement efforts of Virginia Commonwealth University. This position will develop advanced data lists, visualizations and reports using a variety of business intelligence, statistical, charting as well as other reporting tools. This position will work with the core CRM support team as well as the offices of Annual Giving, Alumni Relations, Events, Donor Relations, Communications, Prospect Management, and Data Integrity to ensure that data analysis and reporting needs are met to support the department's goals. A strong understanding of both CRM data elements and data presentation fundamentals are needed to help support the Office of Development and Alumni relations in building and measuring effective strategies.\n<br><br>\nMinimum Qualifications ?Demonstrated experience using Business Intelligence (BI) reporting tools like SAS Visual Analytics, Tableau, Power BI ?Ability to create data sets using ??drag and drop' and filtering interfaces. ?A passion for data. Great analytical skills. Able to define problems, establish facts, draw valid conclusions and provide actionable recommendations. ?High attention to detail and the ability to audit work for accuracy and quality. ?Ability to manage multiple projects/campaigns simultaneously ?Ability to read, understand and translate complex and highly detailed user requirements into accurate project specifications. ?Must have the ability to work in a diverse environment. ?Excellent communication and customer service skills are essential. ?A degree in computer science, information systems, data science or a related field or training and work experience at a level that equates to a degree.\n<br><br>\nPreferred Qualifications\n<br><br>\nSpecial Requirements\n<br><br>\nSpecial Instructions to Applicants\n<br><br>\nOptional Applicant Documents Resume\n<br>\nCover Letter\n<br><br>\nRequired Applicant Documents\n<br><br>\nContact Information\n<br><br>\nName\n<br><br>\nPhone\n<br><br>\nFax\n<br><br>\n<strong>Email:</strong>\n<br><br>\n<strong>Address:</strong>"}