{"job title": "DPS Risk Services, Data Analytics Manager", "company": "Visa Inc.", "city state": "– Highlands Ranch, CO", "rating": "3.4", "job description": "<strong>Common Purpose, Uncommon Opportunity</strong>. Everyone at Visa works with one goal in mind – making sure that Visa is&nbsp;<em>the best way to pay and be paid, for everyone everywhere</em>. This is our global vision and the&nbsp;<strong>common purpose</strong>&nbsp;that unites the entire Visa team. As a global payments technology company, tech is at the heart of what we do: Our VisaNet network processes over 13,000 transactions per second for people and businesses around the world, enabling them to use digital currency instead of cash and checks. We are also global advocates for financial inclusion, working with partners around the world to help those who lack access to financial services join the global economy. Visa’s sponsorships, including the Olympics and FIFA™ World Cup, celebrate teamwork, diversity, and excellence throughout the world. If you have a passion to make a difference in the lives of people around the world, Visa offers an&nbsp;<strong>uncommon opportunity</strong>&nbsp;to build a strong, thriving career. Visa is fueled by our team of talented employees who continuously raise the bar on delivering the convenience and security of digital currency to people all over the world. Join our team and find out how Visa is everywhere you want to be.\n<br><br>\nThe DPS Risk Services vision is to partner with our clients to provide future-ready risk products and services that enable them to achieve superior performance. Our fraud analytic consultants and data analysts play an integral part in helping our clients realize this vision. By coupling in-depth analysis of fraud trends with DPS best in class risk products, we ensure our clients perform significantly better than industry averages. The position will require you to leverage large and varied data sets with current and future data analytics tools and technologies to deliver timely, actionable insights that drive value for customers.\n<br><br>\nDPS Risk Services is looking for person who is a self-starter, results oriented and is focused on delivering innovative analytical insights to internal and external audiences.&nbsp;\n<br><br>\n<strong>Responsibilities</strong>\n<ul>\n<li>Develop and maintain standard and customized operational and fraud performance insights across various measures.</li><li>Provide data support for Visa clients, team members and other internal resources.</li><li>Research and implement better methods to streamline data collection and automate reporting efforts.</li><li>Work effectively with internal/external resources to define analytical objectives, data requirements, obtain data and perform in-depth analyses to achieve a defined business objective.</li><li>Assist with examining client performance against industry best practices with an eye to identifying opportunity for performance improvements and/or increased profitability.</li><li>Examine data sources and ensure that reporting and presentations are accurate, logical, and actionable.</li><li>Translate and present data to management and team members in a straight forward, understandable manner.</li><li>Present key insights to varying audiences: internal teams, clients, senior management (internal and client), and industry meetings/conferences.</li></ul>\n\n<ul>\n<li>Requires a minimum of 5 years’ experience working in analytics or a related field.</li> <li>Bachelor's degree required, advanced degree preferred.</li><li>Strong verbal, written, and interpersonal skills are required.</li><li>Must be proficient in all MS Office applications (Excel, Word, PowerPoint and Access) with advanced Excel spreadsheet skills.&nbsp;</li><li>High level of proficiency manipulating and aggregating data in both standard and non-standard formats from a variety of sources. Big data skills (Hadoop, Hive, Impala, Pig) and SQL skills are required.</li><li>Advanced Tableau Desktop and Server skills are required.</li><li>Visa experience or knowledge of the bankcard industry (including payment processing, operations and risk) a plus.</li>\n</ul>\nAll your information will be kept confidential according to EEO guidelines.<em>“Visa will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Article 49 of the San Francisco Police Code.”</em>"}