{"job title": "Data Scientist", "company": "Visionist, Inc.", "city state": "– Columbia, MD", "rating": "5.0", "job description": "<strong>Type:</strong> Full Time\n<br>\n<strong>Clearance:</strong>\n<br>\n<strong>Experience:</strong> 1-5+ years\n<br>\n<strong>Status:</strong> This position is Open\n<br>\n<strong>Location:</strong> Columbia, MD<strong>Job Summary:</strong><br><br>Visionist is currently seeking Data Scientists who will be responsible for data analytics support across a variety of areas, from the development of advanced data analytics to understanding, evaluating, and implementing customer requirements. The positions offer an opportunity to stay current with the latest trends, technologies, and future industry movement in relation to data analytics.<br><br><strong>Core Responsibilities:</strong>\n\n\n<ul>\n\n<li>Develop, design, maintain, and enhance data analytic solutions for customer</li>\n<li>Drive the collection of new data and the refinement of existing data sources</li>\n<li>Experience working with large datasets, experience working with distributed computing tools (MapReduce, Hadoop, Spark, etc.)</li>\n<li>Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner</li>\n<li>Build conceptual, knowledgeable, and physical data models</li>\n<li>Produce innovative and creative solutions to analytic problems</li>\n\n</ul>\n\n<strong>Qualifications:</strong>\n\n\n<ul>\n\n<li>Bachelors degree in a quantitative field (e.g., Computer Science, Mathematics, Engineering, Statistics, Quantitative Economics etc.). Master’s Degree in a related field a plus.</li>\n<li>3+ years practical experience with programs such as Python, R, Scala, or Julia a plus</li>\n<li>Strong familiarity with data science applications such as association analysis, graph/network analytics, clustering, text analytics, classification and regression (multivariate and logistic)</li>\n<li>Experience designing and implementing static and dynamic visualizations in R, Python, Tableau, or similar visualization software</li>\n<li>Comfortable with various data structures and common methods in data transformation</li>\n<li>Experience with programming languages such as Java, Scala, Python a plus</li>\n<li>Knowledge of machine learning methods (neural networks &amp; deep learning) and platforms (Scikit-learn, TensorFlow, H20) a plus</li>\n<li>Previous work on analytics for real-time/streaming data (Spark Streaming or Flink) a plus</li>\n<li>Previous work on advanced Natural Language Processing (NLP) a plus</li>\n<li>Ability to work independently and as a member of a team</li>\n<li>Excellent oral and written communication skills</li>\n\n</ul>\n<strong>Interested in this position? Send us a resume today.</strong>\n<br>\nDue to government contract and security clearance requirements, US citizenship is required.\n<br><br>\nVisionist, Inc. is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions are based on business needs, job requirements and individual qualifications, without regard to race, religion, color, sex (including pregnancy and gender identity), sexual orientation, parental status, national origin, age, disability, family medical history or genetic information, political affiliation, military service, or any other non-merit based factor. These protections extend to all management practices and decisions, including recruitment and hiring practices, appraisal systems, promotions, and training and career development programs. Visionist, Inc. will not tolerate discrimination or harassment based on any of these characteristics."}