{"job title": "Data Scientist", "company": "Vituity", "city state": "– Emeryville, CA", "rating": "3.3", "job description": "<strong>Help Us Enhance Patient Care Across America</strong>\n<br><br>\n<strong>The Vituity Team.</strong> Our corporate healthcare team includes change makers with a broad range of training and expertise. We innovate using our diverse business, analytic, and communications skills to tackle the challenges of today’s complex healthcare landscape. We collaborate, cooperate, and celebrate our unique contributions because we know we can achieve more together than we can alone. We have a passion for building a culture that cares for our employees, our clients, and our patients.\n<br><br>\nFrom our administrators and management consultants to our recruiters, data and financial analysts, developers, and marketers—we help the providers and health systems we serve improve patient outcomes, operational efficiencies, revenue, and job satisfaction.\n<br><br>\nAs a member of the Vituity team, you’ll put your skills to work helping our providers improve the care of the 6 plus million patients our providers treat annually in over 250 practices throughout the United States. You’ll have the recognition and support you need to grow professionally. And you’ll have the opportunity to discover work you love in a family oriented company that wants you to succeed.\n<br><br>\n<strong>Position Summary</strong>\n<br>\n<strong>The Data Scientist</strong> is responsible for mining complex data and designing new ways to incorporate vast information and data with a focus on managing statistical data. Create different models based on the full-scope needs of Vituity. Process research information for easier consumption and transform it into actionable plans. Provide value-added enterprise level reporting and business analytics through findings and thoughtful insights. This role’s primary focus will be in applying data mining techniques, doing statistical analysis, and building prediction systems that can be assimilated into our products or provide value as a stand-alone project. The position will be a part of our Applied Analytics team, with a focus on developing meaningful ways to track, understand, and ultimately improve our business. This individual will need to provide high quality work in a constantly changing environment and work effectively in a team environment, including interactions with customers, peers, clinicians, and management.\n<br><br>\n<strong>Essential Duties and Responsibilities</strong>\n<br>\nData Mining and Modeling (50%)\n<br><br>\n<ul>\n<li>Mine complex data and design new ways to incorporate information for Vituity staff.</li> \n\n<li>Apply data mining techniques, conduct statistical analysis, and build prediction systems to be assimilated into Vituity’s products or provide value as a stand-alone project.</li> \n\n<li>Collaborate with appropriate stakeholders and SMEs to understand the full-scope business needs.</li> \n\n<li>Develop innovative value-added analytical processes to support client and provider goals.</li> \n\n<li>Create different models based on the full-scope needs of Vituity.</li> \n\n<li>Process research information for easier consumption and transform it into actionable plans.</li> \n\n<li>Provide value-added enterprise level reporting and business analytics through findings and thoughtful insights.</li>\n<li>Gather requirements for customized solutions and provides alternative solutions. With an understanding of business needs, translate data models into long-term solutions.</li> \n\n<li>Understand and communicate project activity, and produce measurable improvements in business performance metrics.</li>\n<li>Perform and interpret data studies and product experiments concerning new data sources or new uses for existing data sources.</li>\n</ul>\nDevelop Intra-Team Collateral (20%)\n\n<ul>\n<li>Develop prototypes, proof of concepts, algorithms, predictive models, and custom analysis.</li> \n\n<li>Provide analytical and research services to support enterprise level reporting and business analytics.</li> \n\n<li>Extend company’s data with third party sources of information as needed.</li> \n</ul>\nProcess Improvement (10%)\n\n<ul>\n<li>Research new and existing data sources in order to contribute to new development, improve data management processes, and make recommendations for data quality initiatives.</li>\n<li>Design and build new data set processes for modeling, data mining, and production purposes.</li> \n\n<li>Create automated anomaly detection systems (signal/noise).</li> \n\n<li>Determine new ways to improve data and search quality, as well as predictive capabilities.</li> \n\n<li>Process, cleanse, and verify the integrity of data. Cleanse and transform data from raw data inputs.</li> \n</ul>\nDocumentation (10%)\n\n<ul>\n<li>Create documentation of business processes, training procedures, and standard operating procedures.</li> \n\n<li>Define data specification, flow mappings, and business logic documentation associated with new or modified product data capture requirements.</li> \n\n<li>Adhere to specific, strict company and industry guidelines concerning privacy and confidentiality of electronic health records (EHR).</li>\n<li>Observe data privacy rights to avoid legal issues and maintain compliance with applicable federal and state health privacy laws and organizational policies regarding electronic health information exchange.</li> \n</ul>\nAd Hoc (10%)\n\n<ul>\n<li>Perform ad-hoc analysis and present results in a clear manner.</li>\n<li>Help build and routinely extraction from Hadoop for analytic purposes.</li> \n\n<li>Work on complex problems where analysis of situations or data requires in-depth evaluation of various factors. </li>\n</ul>\n<strong>\n<br>\n<strong>Qualifications:</strong>\n<br>\n<strong>Formal Education &amp; Certification</strong>\n\n<ul>\n<li>An advanced degree (M.S., PhD.), preferably in Statistics, Computer Science, Applied Mathematics, Physical or Life Sciences, Economics, or a related technical field.</li> \n</ul>\n<strong>\n<br>\nKnowledge &amp; Experience</strong>\n\n<ul>\n<li>SQL skills, including experience querying large, complex data sets.</li>\n<li>Minimum five years of experience with MS SQL Server TSQL or Oracle RAC, PL/SQL, including experience with query optimization, indexing, replication, data presentation to business users.</li> \n\n<li>Experience with supervised and unsupervised modeling.</li>\n<li>Strong analytical and problem-solving skills.</li>\n<li>Organized, goal-oriented, self-starter, able to manage multiple tasks from start to completion with limited supervision.</li>\n<li>Proficiency using data analysis tools such as SAS, R, Stata, or Python (numpy, pandas).</li> \n\n<li>Experience working with relational and NoSQL data sources.</li>\n<li>Experience using statistics and machine learning to solve complex business problems.</li>\n<li>Solid foundation in analytics, with proven history of data-oriented project completion.</li>\n<li>Experience in the healthcare industry is a plus.</li>\n<li>Knowledge of BI tools such as Tableau and Qlik is a plus.</li>\n</ul>\n<strong>\n<br>\nWhy Vituity?</strong>\n<br>\nWhen you work at Vituity, you share your talents with an awesome team that makes coming to work empowering and fun. That’s why our employees have voted us a Best Place to Work in the Bay Area for nine years. That, and some pretty incredible benefits:\n\n<ul>\n<li><strong>Competitive benefits package:</strong> Superior health plan options, best in class 401(k) plan (with a very generous company match like you’ve never seen before), 3 weeks paid vacation in your first year, tuition reimbursement policy, paid sabbaticals, and more!</li>\n<li><strong>A Culture of Caring:</strong>We not only like working together, but care about one another personally and professionally. We host fun staff activities, health and wellness programs, employee recognition programs, and so much more.</li> \n\n<li><strong>Location:</strong> We are located in the Emeryville Watergate business park overlooking the San Francisco Bay -- just minutes away from San Francisco and the East Bay.</li>\n</ul>\n<strong> Your Life. Your Career. Your Success. Apply Today!</strong>\n<br>\n<strong>\n<br><br>\nVituity</strong>is an Equal Opportunity Employer.</strong>"}