{"job title": "Data Scientist", "company": "VoiceGlance", "city state": "– Albany, New York", "rating": "4.5", "job description": "Sepsis is the body's overwhelming response to uncontrolled infection. Up to one half of people who develop sepsis die. Projections indicate that, by 2050, sepsis will be responsible for more deaths than cancer. A major cause of sepsis is bacterial resistance to treatment that comes from increased use of broad-spectrum antibiotics.\n<br><br>\nILÚM is working to dramatically reduce sepsis and represents a significant advance in mankind's fight against infectious bacteria. The ILÚM system reduces the use of broad-spectrum antibiotics by using data science to help physicians select appropriate narrow-spectrum agents. At the population level, we help hospitals recognize trends that could require action to reduce the spread of resistant bugs.\n<br><br>\nILÚM is scaling up and looking to fill multiple positions in Albany, NY. These are on-location, 1099 opportunities.\n<br><br>\nThe ILÚM system helps providers treat their patients by delivering the right information at the right time. At the individual patient level, we use data science to personalize treatment recommendations through our clinical decision support tools. At the population level, we help hospitals recognize trends that could require action.\n<br><br>\nResponsibilities\n<ul>\n<li>Collaborate with the clinical team to understand the clinical scenario</li> <li>Perform pre-processing and validation on new and existing data sources</li> </ul>\n\n<ul>\n<li>Design and develop models to address customer and/or business needs</li> <li>Communicate results and create data visualizations</li> <li>Work closely with the development team to select technologies with implementation in mind</li> <li>Document the model development process</li> <li>Contribute to scientific conference research submissions</li> </ul>\n\n<ul>\n<li>Stay up-to-date on emerging data science tools and methods</li>\n</ul>\nRequirements\n<ul>\n<li>Experience working with structured and unstructured clinical data</li> <li>Solid understanding of machine learning algorithms and use cases</li> <li>Experience building and deploying supervised and unsupervised learning models, including clustering for anomaly detection</li> </ul>\n\n<ul>\n<li>Experience with bioinformatics and/or NLP is a plus</li> <li>Experience working with Amazon AWS and/or Microsoft Azure services</li> <li>Proficient in Jupyter, Python, Spark and SQL</li> <li>Able to explain technical concepts and results to a non-technical audience</li> <li>BSc/BA in Computer Science, Engineering or relevant field; graduate degree in Data Science or other quantitative field is preferred</li> </ul>\n\n<ul>\n<li>Experience with bio-statistics and research methodologies would be an additional asset</li>\n</ul>\nOur client is an equal opportunity employer that is dedicated to build a diverse environment. All suitable applicants will receive due consideration for employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\n<br><br>\nVoiceGlance is an innovative workforce solution, connecting human potential to the power of business. VoiceGlance serves both large and small organizations across all industry sectors. Given the unpredictable nature of hiring and the rise of web-based applicant tracking systems, job aggregation sites and social networks, we set out to develop a unified and streamlined recruiting platform to identify, recruit and hire your most critical asset high performing employees. For employers, we promise to deliver the best service, price and guarantee combination available in the industry. Visit voiceglance.com for more information.\n<br><br>\nCONFIDENTIALITY: We appreciate all expressions of interest, however, as a practical matter, only select candidates whose backgrounds best match our client's requirements will be contacted. All resumes are retained and treated confidentially for consideration against future opportunities."}