{"job title": "Data Scientist", "company": "Voya Financial", "city state": "– CT - Windsor", "rating": "2.9", "job description": "As part of the application process, a candidate account is required to log in and view application(s). Please be sure to check email regularly for information regarding our employment process.\n<br><br>\n<strong><strong>Profile Summary:</strong></strong>\n<br><br>\nVoya Financial in Windsor, CT is looking to hire a Data Scientist to work in the Analytics Center of Excellence. The Data Scientist will be responsible for expanding the use of big data technologies in the COE.\n<br><br>\n<strong><strong>Profile Description:</strong></strong>\n<ul>\n<li>Supporting and enhancing partnerships with business stakeholders and subject matter experts</li><li>Identifying opportunities to expand the business impact from data analytics through the use of big data</li><li>Evaluating and recommending big data platforms and technologies</li><li>Identifying and assessing the value of big data sources</li><li>Performing data analytics and predictive modeling using big data sources in combination with traditional structured data sources</li><li>Working with the COE's Data Team to integrate big data sources with traditional in-house and 3rd-party data</li>\n</ul>\n<strong><strong>Knowledge and Experience:</strong></strong>\n<br><br>\nOur ideal candidate will have strong academic qualifications in a quantitative discipline and hands-on experience answering key business questions using big data analytics.\n<br><br>\nRequired:\n<ul>\n<li>Advanced degree or equivalent work experience in a quantitative discipline such as statistics, computer science, actuarial, applied mathematics, or engineering</li><li>In-depth knowledge and experience selecting and applying appropriate data analytics algorithms such as decision trees, regression methods, stochastic models, neural networks, and time series analyses</li><li>Expertise in SQL query development, Hadoop, Python, and data visualization</li><li>Experience with Big Data Analytics tools required; Experience with Cloudera Data Science Workbench preferred.</li><li>Solid business acumen with the ability to quickly learn about Voya's core businesses (Retirement, Annuity, Insurance, Employee Benefits, Investment Management)</li><li>2 - 4 Years of experience in related field</li><li>Knowledge of IBM SPSS Modeler a plus.</li> \n</ul>\n#CB\n<br><br>\n#LI-NA1\n<br><br>\n<strong>Critical Skills</strong>\n<br>\nAt Voya, we have identified the following critical skills which are key to success in our culture:\n<ul>\n<li>Customer Focused: Passionate drive to delight our customers and offer unique solutions that deliver on their expectations.</li><li>Critical Thinking: Thoughtful process of analyzing data and problem solving data to reach a well-reasoned solution.</li><li>Team Mentality: Partnering effectively to drive our culture and execute on our common goals.</li> <li>Business Acumen: Appreciation and understanding of the financial services industry in order to make sound business decisions.</li> <li>Learning Agility: Openness to new ways of thinking and acquiring new skills to retain a competitive advantage.</li>\n</ul>\nLearn more about Critical Skills."}