{"job title": "Web Analytics Manager, VSP Vision Care", "company": "VSP Global", "city state": "– Rancho Cordova, CA", "rating": "3.5", "job description": "VSP Global is comprised of five complementary businesses that combine high-quality eye care insurance, high-fashion eyewear, customized lenses, ophthalmic technology and retail solutions, with employees in over 23 countries. No matter the role, we're all focused on a singular mission: to help people see. Learn more by visiting https://vspglobal.com/cms/careers/\n<br><br>\nGeneral Summary\n<br><br>\nWith minimal direction, increase our understanding around customer acquisition, engagement, purchase, and retention. Develop new and better analytics approaches to discover opportunities, address questions, and solve problems in a creative way.\n<br><br>\nEssential Functions\n<br><br>\nOversee collection of data from multiple sources across multiple devices and applications, and for all US and international ecommerce websites to analyze and report on effectiveness, attribution, and ROI of advertising and digital media efforts, social media outreach, organic/paid search initiatives, site changes, tests, external events, and other key drivers of web visitor behavior\n<br><br>\nCollaborate with the digital marketing team and make recommendations to enhance the future effectiveness of all marketing channels supporting all ecommerce sites\n<br><br>\nCollaborate with the category management team to capture data to help improve sales, profit, and customer satisfaction across multiple products and services\n<br><br>\nWork closely with UX and platform management to track, capture, and interpret both successful and challenging customer experiences to improve overall customer experience\n<br><br>\nSet measurement and reporting strategy to align with business ROI requirements and other goals; provide guidance to business partners on data to capture and how to map data needs to business questions\n<br><br>\nRecommend and lead testing and research projects that incorporate web traffic and behavior, site conversions and funnels, customer feedback and satisfaction ratings\n<br><br>\nProvide relative quantitative strengths and weaknesses to business and marketing partners to inform strategic planning and spur tactical initiatives (e.g. pricing tests, conversion optimization tests)\n<br><br>\nResponsible for evaluation and ensuring proper installation and use of all analytics technology solutions\n<br><br>\nConsult with internal and external marketing services providers/agencies to help them set performance goals for any marketing programs/investments, review their tracking and analytics set-ups and methods, and ensure proper program management with accurate reporting\n<br><br>\nJob Specifications\n<br><br>\nTypically has the following skills or abilities:\n<br><br>\nBachelor degree in statistics, economics, math, marketing research, finance, or related field or equivalent experience\n<br><br>\nMinimum of 8 years of experience in the use and interpretation of data &amp; analytics, with proven record of web marketing achievements resulting from data insights\n<br><br>\n5+ years of experience and high proficiency in Adobe Analytics, Google Analytics, or similar web analytics application including the set up and deployment of custom variables\n<br><br>\n2+ years of experience using a tag management application like Tealium, Ensighten, etc.\n<br><br>\nHighly analytical, confident and persuasive leader with ability to use analytics to influence senior leaders in developing and implementing both tactical and strategic plans\n<br><br>\nExperience creating reports using data visualization and dash-boarding to deliver meaningful insights &amp; recommendations\n<br><br>\nSolid understanding of digital marketing tactics (PPC, SEO, Social, etc.) and metrics\n<br><br>\nExperience with website A/B and multivariate testing tools\n<br><br>\nKnowledge of digital technologies, such as HTML, JavaScript, log files, etc. and business intelligence tools, database structures, and ETL processes\n<br><br>\nExperience with statistical packages, e.g., SAS\n<br><br>\nStrong database skills with working knowledge of SQL or similar\n<br><br>\nAbility to work effectively as part of a team, and with all levels within the organization\n<br><br>\nExcellent written, analytical and communication skills\n<br><br>\nAbility to handle multiple priorities\n<br><br>\nAbility to regularly exercise discretion and independent judgment in the performance of job duties, as well as proven success in collaborative environments\n<br><br>\nHighly proficient with MS suite, especially Excel\n<br><br>\nWorking Conditions / Physical Demands\n<br><br>\nThe working environment is generally favorable. Lighting and temperature are adequate, and there are no hazardous or unpleasant conditions caused by noise, dust etc.\n<br><br>\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.\n<br><br>\nVSP Global is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to gender, race, color, religion, sex, national origin, gender identity, sexual orientation, disability or protected veteran status. We maintain a drug-free workplace and perform pre-employment substance abuse testing."}