{"job title": "Data Analyst, VSP Vision Care", "company": "VSP Global", "city state": "– Rancho Cordova, CA", "rating": "3.5", "job description": "VSP Global is comprised of five complementary businesses that combine high-quality eye care insurance, high-fashion eyewear, customized lenses, ophthalmic technology and retail solutions, with employees in over 23 countries. No matter the role, we're all focused on a singular mission: to help people see. Learn more by visiting https://vspglobal.com/cms/careers/\n<br><br>\nGeneral Summary\n<br><br>\nPerforms research and analysis for future and current strategy developments business opportunities, performance monitoring and operational enhancements. Improve data quality, data collection and analysis processes; develops data analysis methodologies and reporting.\n<br><br>\nEssential Functions\n<br><br>\nIdentify, gather and analyze data to examine patterns &amp; trends, and provide insights to enhance business decision making capability in business planning, process improvement, solution assessment, forecasting, etc.\n<br><br>\nRecommend actions for future strategic developments &amp; business opportunities, performance for existing initiatives and partnerships, as well as enhancements to operational programs/tactics\n<br><br>\nPerform data analysis through methodologies that include statistical analysis, forecasting and predictive analytics\n<br><br>\nJob Specifications\n<br><br>\nTypically has the following skills or abilities:\n<br><br>\nBachelor's degree in Business, Statistics, Data Analytics or other related fields, or equivalent experience\n<br><br>\nThree years of experience using business intelligence analytic software such as SAS, Cognos or SPSS to perform statistical, strategic, data and operational analysis\n<br><br>\nThree years of experience performing data analysis\n<br><br>\nDemonstrated ability to proactively develop, communicate and recommend solutions based upon business acumen and analysis performed\n<br><br>\nExcellent written and verbal communication skills with the ability to network, influence and build relationships with internal and external business partners and to express complex analytical and technical information to a variety of audiences at all levels\n<br><br>\nProficiency in management, interpretation and analysis of large datasets and report production and automation\n<br><br>\nProficiency with Microsoft Suite applications such as; Excel, Access, Visual Basic, etc.\n<br><br>\nRegularly exercises discretion and independent judgment in the performance of his/her job duties\n<br><br>\nPreferred Skills\n<br><br>\nFamiliarity with Data Warehouse tables such as claims, group, revenue, consumer and provider\n<br><br>\nAbility to interpret requests from clients and brokers\n<br><br>\nExperience working with GeoAccess and Network Analysis tools\n<br><br>\nExperience using ReportCaster and WebFOCUS\n<br><br>\nWorking Conditions / Physical Demands\n<br><br>\nThe working environment is generally favorable. Lighting and temperature are adequate, and there are no hazardous or unpleasant conditions caused by noise, dust etc.\n<br><br>\nThe above information in this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.\n<br><br>\nVSP Global is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to gender, race, color, religion, sex, national origin, gender identity, sexual orientation, disability or protected veteran status. We maintain a drug-free workplace and perform pre-employment substance abuse testing."}