{"job title": "Sr Data Scientist", "company": "W.W. Grainger, Inc.", "city state": "– Lake Forest, IL", "rating": "3.4", "job description": "<strong>Primary Function:</strong>\n<br><br>\nAs a Sr. Data Scientist on Grainger's analytics team, you will use your machine learning and statistical expertise to optimize our site experience and marketing activity. You will contribute actionable insights and build automated systems to help Grainger realize our mission of providing useful information and time-saving solutions to our customers. Areas of particular interest include: applying supervised learning techniques to understand marketing ROI and customer value; extracting insights from unstructured text to understand industries, job roles, and products; and combining automated intelligence with expert content curation to deliver the most relevant search results.\n<br><br>\n<strong>Principal Duties &amp; Responsibilities:</strong>\n\n\n<ul>\n<li>Exploring and visualizing data to understand the most relevant features that impact Grainger's business</li>\n<li>Conducting analysis of text data to understand the relationship between Grainger's product assortment and user search queries, industries, and job functions</li>\n<li>Researching and building machine learning applications (structured and unstructured data, regression, classification, dimensionality reduction, clustering)</li>\n<li>Designing, implementing, and validating your solutions using Python and SQL;</li>\n<li>Providing data-driven recommendations of relevant products to customers</li>\n<li>Identifying marketing opportunities and optimizing marketing spend across multiple channels</li>\n</ul>\n\n<strong>Preferred Education &amp; Experience:</strong>\n\n\n<ul>\n<li>Masters' or graduate degree in a quantitative field required (statistics, economics, mathematics, computer sciences, etc.) or equivalent work experience; PhD preferred</li>\n<li>Hands-on software engineering and data science experience beyond coursework</li>\n<li>Ability to develop algorithms and predictive models to derive insights and business value from data</li>\n<li>Demonstrable proficiency in coding (Python, Spark, R, Java, Scala) and programming concepts</li>\n<li>Ability to build, test, and validate machine learning applications in Python, R, or other programming language (Python preferred)</li>\n<li>Ability to explore data sets and identify data transformation and data quality needs for targeted applications</li>\n<li>Deep knowledge of database design and logic (SQL)</li>\n<li>Curiosity, enthusiasm, positive attitude and passion to build. Willingness to learn and research new concepts.</li>\n<li>An iterative approach to developing data science solutions (build, test, improve)</li>\n<li>Biased toward action, great collaborator and master simplifier, constantly pushing toward clarity and delivery</li>\n<li>Strong product mindset: you ask and tackle the most important analytical questions with the goal of driving product impact</li>\n<li>Experience with Natural Language Processing preferred</li>\n<li>Experience with Recommender Systems preferred</li>\n<li>In-depth knowledge of search engine design and optimization preferred</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Outstanding analytical skills</li>\n<li>Outstanding and proven project management skills; ability to manage multiple projects in a high-pressure, tight-deadline environment</li>\n</ul>\n\nGrainger is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.\n<br><br>\nJob Segment: Database, SQL, Developer, Java, Testing, Technology<br><br>SDL2017"}