{"job title": "Data Scientist", "company": "Wade &amp; Wendy", "city state": "– New York, NY", "rating": "4.4", "job description": "<strong>What Is Wade &amp; Wendy?</strong><br><br>Wade &amp; Wendy is an AI-Powered Recruitment Conversation Platform. We deploy automated conversations across the recruiting process to increase engagement, optimize workflows and inform decisions.\n<br><br>\nWendy is an AI recruiting chatbot that joins teams to expand their recruiting bandwidth. Her current capabilities include personalized qualifying conversations, profile enrichment, and intelligent filtering. Wendy learns from each engagement, to expand her capabilities over time, becoming a more valuable member of the recruiting organization.\n<br><br>\nOur team is backed by Slack, ffVC, Randstad and other great VCs, as we bring AI and machine learning to the recruiting/HR space - all in order to make the process of building teams more human.<br><br><strong>Who are the people building Wade &amp; Wendy?</strong><br><br>Our diverse team comes from a wide variety of backgrounds (plus has seen more than a few exits): we have a former physicist whose work helped win a nobel prize, a fine-dining chef who returned to their first love: coding, and people who have tackled problems with novel solutions like using Google Glass in farming and voice recognition in manufacturing.\n<br><br>\nWe are linguists and psychologists and technologists and writers, all committed to learning, iterating and pushing things forward.\n<br><br>\nAnd we get most excited about working together to tackle this challenge: to help teams grow meaningfully and help people find meaningful work.<br><br><strong>What's the Role?</strong><br><br>We're pushing the edge of the field: using a proprietary data set to transform the way people understand the hiring process and skills market.\n<br><br>\nYou'll experiment with and optimize our framework for the algorithms we use, and then help put those things into production. You'll work with machine learning techniques like contextual bandits, and a variety of natural language processing methods and systems. You'll rocket everything forward: from our dynamic NLP chatbots to our scoring engine that powers our clients' hiring decisions.\n<br><br>\n<strong>What have you done?</strong>\n\n<ul>\n\n<li>Real-world experience in bringing public-facing projects to completion?</li>\n<li>Written production-quality code and wrangled engineering systems into working order?</li>\n<li>Learned through study and experience to deeply understanding machine learning of various types?</li>\n<li>Earned a Ph.D. in any mathematical, quantitative, or hard-sciences topic?</li>\n\n</ul>\n\n<strong>Who are you?</strong>\n\n\n<ul>\n\n<li>Do you want to get your hands dirty in a startup environment and build stuff from scratch?</li>\n<li>Do you love working with smart, fun, and engaged people to solve important hard problems, like finding the right job, that affect almost everyone?</li>\n<li>Do you want to tackle the challenges of collecting and understanding unstructured data, like conversations?</li>\n<li>Do you want to automate everything?</li>\n</ul>\n\n<strong>Join our team</strong><br><br>If what we described and the questions we asked excite you, then let's definitely speak!<br><br>Curious about Wendy?<br><br>Apply to this role to chat with Wendy!"}