{"job title": "Machine Learning Data Scientist", "company": "Walgreens", "city state": "– Deerfield, Illinois", "rating": "3.1", "job description": "<strong>Job Summary</strong>\n<br><br>\nThe Machine Learning Data Scientist will be primarily responsible for design, execution and delivery of exploratory concepts, rapid prototypes, and pilot solutions designed to test hypothesis and incubate transformative new capabilities by applying Machine Learning, data mining techniques, doing statistical analysis, and building high quality prediction systems. Key activities will consist of optimizing existing and new business process with the use of Machine Learning and data analysis, guiding and approving the appropriate technology to fit the requirements, and building a quick prototype or pilot to support the hypothesis. Primary responsibilities include leading research and development of statistical learning models for data analysis; design and build predictive models and algorithms for experimentation and eventual adaption within the enterprise; documenting and articulating solution architecture and lessons learned for each exploration and accelerated incubation; encouraging new transformative thinking, trail blazing, and facilitate imagination and ideation sessions; maintaining current knowledge of technology landscape and emerging developments; employing practical approach to incubation and eventual platform integration; driving and orchestrating external partner or vendor collaboration to satisfy the needs of any given exploration; working with dedicated Innovation team and with various other Product and Enterprise teams to execute explorations as part of accelerated incubation of new capabilities and ensuring alignment, knowledge transfer and transition of proven concepts and incubated capabilities to Product and to the Enterprise teams across Walgreens Boots Alliance for productization and scaled up operationalization.\n<br>\nThis role requires an imaginative, creative mind set with substantial hands-on experience in utilizing, exploring and adopting technologies to build viable and innovate solutions, while working within a global team, and adhering to delivery excellence for execution and lifecycle management.\n<br>\nThe successful candidate will be will be a Data Science and Machine Learning generalist who is experienced and successful with innovation, understands how to adopt their technology in the Enterprise and understands how to move take advantage trends and technologies to test hypotheses, prove feasibility, viability and fail fast.\n<br><br>\n<strong>Job Responsibilities</strong>\n\n<ul>\n<li>Develops algorithms to determine relevant products, drugs, and content to display to users. Develops and maintains the end to end A/B testing plans including strategy, roadmap, and execution. Analyze search patterns and customer behaviors to inform strategies</li><li>Integrates machine learning techniques for continuous improvement of results.</li><li>Leads personalization efforts by incorporating customer models and site data.</li><li>Influences product decisions for internal tools that support search relevancy.</li><li>Performs as the subject matter expert for the specified functional area and may become actively involved, as required, to meet schedules and resolve problems highly complex in nature.</li><li>Develops highly complex programs that establish and enhance standards. Develops the specifications of highly complex projects and may perform as implementation project lead.</li><li>Develops and executes operational activities that have moderate to significant impact on the direction of the specified functional area and/or the organization, and may include responsibilities, such as:\n\n<ul>\n<li>*Develops the highly- complex or industry- approaches to drive the development of broad reaching strategies.</li> <li>*Defining, deploying and institutionalizing functional area research approaches and related knowledge basis.</li> <li>*Forecasting and assessing industry trends and their impact on designs and methods of the specified functional area.</li> <li>*Establishing research guidelines, best practices and standards.</li> <li>*Analyzing, summarizing and presenting results to functional teams and decision makers.</li> <li>*Interprets highly complex results and analyzes trends.</li><li>*Identifying and establishing relationships with internal/external partners.</li> </ul></li>\n<li>Shares complex information related to areas of expertise and/or to gain acceptance of new or enhanced business solutions. \"Evangelizes\" new ideas / solutions to gain acceptance from a wide range of audiences</li><li>Develops business approaches and new or enhanced processes.</li><li>Guides and mentors a wide range of audiences. May provide subject matter expertise to the business. May participate in teaching and training members of the work team.</li>\n</ul>\n\nWalgreens, one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc., the first global pharmacy-led, health and wellbeing enterprise. More than 10 million customers interact with Walgreens each day in communities across America, using the most convenient, multichannel access to consumer goods and services and trusted, cost-effective pharmacy, health and wellness services and advice. Walgreens operates 8,175 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands. Walgreens omnichannel business includes Walgreens.com. Approximately 400 Walgreens stores offer Healthcare Clinic or other provider retail clinic services.\n<br><br>\nAs the neighborhood drugstore and retailer, our goal is to make health and happiness simpler, easier and within reach. And we remain a trusted wellness provider offering convenient access to important health services, such as immunizations and an array of pharmacy services that can help patients improve their health. To our team members, Walgreens represents a unique opportunity to excel in their careers in a welcoming and inclusive environment. We offer the chance to work in a truly supportive environment, and be a part of a progressive organization dedicated to the well-being of our customers, team members and the communities we all call home.\n\n<ul>\n<li>Bachlers degree in a quantitative field such as Computer Science, Statistics or Mathematics and at least 5 years of experience in data science OR a High School Diploma/GED and at least 8 years of experience in data science.</li><li>Experience establishing &amp; maintaining relationships with individuals at all levels of the organization, in the business community &amp; with vendors.</li><li>Experience using time management skills such as prioritizing/organizing and tracking details and meeting deadlines of multiple projects with varying completion dates.</li><li>Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement of results and find solutions.</li><li>Experience identifying operational issues and recommending and implementing strategies to resolve problems.</li><li>Experience with project management (for example: planning, organizing, and managing resources to bring about the successful completion of specific project goals and objectives).</li><li>Experience leading cross-functional teams.</li><li>At least 2 years of experience in indirect management of team members, including assisting in the development, training and assignment of work/projects to other team members.</li><li>Willing to travel up to 10% of the time for business purposes (within state and out of state).</li></ul>\n\n<ul>\n<li>PhD</li><li>At least 8 years of experience in data science</li><li>Experience in the field of Data Science and Statistical Research, Data Mining and Data Analysis</li><li>Knowledge of Machine Learning theory</li><li>Experience with R&amp;D and innovation type activities</li><li>Experience using query languages such as SQL</li><li>Experience with R and Python or Java</li><li>Knowledge of probabilistic and statistical techniques and algorithms, such as k-Nearest Neighbor, Naive Bayes, SVM, Hidden Markov Model</li><li>Experience with common data science toolkits, such as Weka, Anaconda or others</li><li>Experience with data visualization tools</li><li>Experience in working with large data sets using Hadoop, Hive, Pig</li><li>Experience with NoSQL databases, such as MongoDB, Cassandra, HBase or others</li><li>Experience with applied statistics skills, such as distributions, statistical testing and regression</li><li>Experience with pattern recognition, predictive modeling and data mining skills</li><li>Experience with Machine Learning and Data APIs</li><li>Knowledge of Cloud environments - like Azure and Google Cloud - within the context of Machine Learning and data</li><li>Experience with innovation accelerators</li><li>Global experience</li><li>Knowledge of Pharmacy or Healthcare industry</li>\n</ul>"}