{"job title": "Statistical Data Mining Analyst/Cognos", "company": "Walker Medical Solutions", "city state": "– Little Rock, AR", "rating": "NA", "job description": "Description\n<br><br>\nThis position will be responsible for rapidly developing dimensional models based on a foundation of 3NF physical models.\n<br>\nDimensional Modeling\n\n\n<ul>\n<li>1-5 year hands on experience designing and implementing Star Schemas</li>\n<li>Comprehensive Knowledge of Ralph Kimball's Data Modeling Concepts including Transaction dimensions, conformed dimensions and facts, slowly changing dimensions, multi-Star/ Snowflake Schema Modeling, different types of Fact tables</li>\n<li>Prior experience implementing DW presentation layer - including design and definition of logical tables, physical sources, dimensions, columns and aggregation rules.</li>\n</ul>\n\n3NF (Relational) Logical and Physical Modeling\n\n\n<ul>\n<li>1-5 year hands on experience Logical Data Modeling (3NF)</li>\n<li>Comprehensive Knowledge of Bill Inmon's Data Modeling Concepts (Logical and Physical) including 3NF, Supertypes, Subtypes, Abstraction, Associative entities / tables</li>\n<li>Teradata Physical Modeling and Performance Tuning including Primary, Secondary index, JIs, AJIs, PPIs (SLPPI, MLPPI) etc</li>\n</ul>\n\nSQL &amp; Tools\n\n\n<ul>\n<li>Advanced skills in writing SQL queries, views, and optimization of SQL queries are necessary.</li>\n<li>Teradata</li>\n</ul>\n\nBusiness Intelligence\n\n\n<ul>\n<li>Extensive experience with BI application architecture and development</li>\n<li>Experience with MicroStrategy or BusinessObjects or Cognos or Tableau at the minimum</li>\n<li>Hands-on experience in designing technical architecture, installation and configuration of BI Stack components</li>\n<li>Extensive knowledge in Presentation layer such as MOLAP, ROLAP, HOLAP, Ad-hoc reports.</li>\n</ul>\n\nOther\n\n\n<ul>\n<li>Knowledge of Hub-n-Spoke Architecture and Bus Architecture</li>\n<li>Experience with Software Development Life Cycle, including requirements gathering, documentation testing and knowledge transfer is required.</li>\n<li>Collaborates with business and technology resources to identify key business requirements for Business Intelligence (BI)</li>\n<li>Data Integration, Data Mapping, ETL</li>\n</ul>"}