{"job title": "Data Scientist", "company": "Walmart", "city state": "– SUNNYVALE, CA", "rating": "3.2", "job description": "<strong>Position Description</strong>\n<ul>\n<li>A Data Scientist is responsible for analyzing large data sets to develop custom models and algorithms to drive business solutions. Data Scientists work on project teams in order to provide analytical support to projects (for example, email targeting, business optimization, consumer recommendations) for Walmart eCommerce. Data Scientists are responsible for building large data sets from multiple sources in order to build algorithms for predicting future data characteristics. Those algorithms will be tested, validated, and applied to large data sets. Data Scientists are responsible for training the algorithms so they can be applied to future data sets and provide the appropriate search results. Data Scientists are responsible for researching new trends in the industry and utilizing up-to-date technology (for example, HBase, MapReduce, LAPack, Gurobi) and analytical skills to support their assigned project.</li><li>Build complex data sets from multiple data sources, both internally and externally.</li><li>Build learning systems to analyze and filter continuous data flows and offline data analysis.</li><li>Combine data features to determine search models.</li><li>Conduct advanced statistical analysis to determine trends and significant data relationships.</li><li>Demonstrates up-to-date expertise and applies this to the development, execution, and improvement of action plans</li><li>Develop custom data models to drive innovative business solutions.</li><li>Develop models of current state in order to determine needed improvements.</li><li>Models compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity</li><li>Provides and supports the implementation of business solutions</li><li>Research new techniques and best practices within the industry.</li><li>Scale new algorithms to large data sets.</li><li>Train algorithms to apply models to new data sets.</li><li>Utilize system tools including (MySQL, Hadoop, Weka, R, Matlab,ILog).</li><li>Validate models and algorithmic techniques.</li><li>Work with cross-functional partners across the business\n</li></ul>\n<strong>Minimum Qualifications</strong><br><br>.<br><br><strong>Additional Preferred Qualifications</strong>\n<br><br>\n<strong>Company Summary</strong><br><br>The Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.<br><br><strong>Position Summary</strong><br><br>The search algorithms team at Walmart Labs is dedicated to the mission of helping millions of customers every day in finding the right products. We are at the forefront of attacking one of the most complex problems of e-commerce. Whenever a user types in a query or browses through product categories on the web site, phone or the iPad, our service goes to work. We mine billions of search queries and tens of millions of products to find the most relevant products for our customers. Team members take end-to-end responsibility in analyzing large amounts of data, creating complex models, improving their accuracy and deploying these models to serve customers.\n<br><br>\nE-commerce product search, much like web search, has always been a fertile area of AI innovation. Search algorithm team at Walmart Labs working on fascinating AI/ML problems like deep NLP based query understanding, improving relevance ranking of products, semantic matching of query item pairs using embeddings, visual search to enable search by image, interleaving based fast online experiments etc. As part of this team, you'll solve some of the most challenging and impactful problems in machine learning, information retrieval, natural language processing, computer vision or statistical measurement. Your work will be visible to hundreds of millions of customers and you will have a direct impact on the goals of the Fortune #1 company. If you speak and think machine learning then we want to talk to you. Come join our team and be part of this exciting journey.\n<br><br>\nIn this role you will\n\n\n<ul>\n<li>Build advanced machine learning models and improve the accuracy of those models</li>\n<li>Crunch terabytes of data and build models from large dataset</li>\n<li>Deploy the models in production where it will serve customers in real time</li>\n<li>Work alongside senior machine learning researchers and define the right solution to implement</li>\n<li>Put on the hacker's hat quickly convert an idea to a demonstration</li>\n</ul>\n\nPresent your work to the internal and external community\n<br>"}