{"job title": "Data Scientist Intern - Summer", "company": "Walmart eCommerce", "city state": "– SAN BRUNO, CA", "rating": "3.2", "job description": "<strong>Position Description</strong><br><br>YOUR INTERN PROGRAM EXPERIENCE\n<br><br>\nFar beyond your specific assignment, the program immerses you in business, allows you to develop cutting edge technology, and shows off your socials skills, all in between a lot of fun! Over the 10 to 11 week periodcross-functional you connect with executives, learn advanced skills, participate in HackDay, and network at social events. Whether you are playing in the Intern Olympics or going to a Giants game, there is always something going on. With the San Francisco Bay Area as your playground the opportunities both inside and outside of work are endless!\n<br><br>\n#undergradinternships\n<br>\n#gradinternships<br><br><strong>Minimum Qualifications</strong><br><br>ABOUT YOU\n\n\n<ul>\n<li>A visionary technologist with a passion for learning new technologies and translating data into business solutions.</li>\n<li>Demonstrated analytical and quantitative skills with the ability to build innovative complex models to illustrate various scenarios and compare KPIs</li>\n<li>Experience with statistical analysis, data mining, financial analysis, and quantity modeling.</li>\n<li>Expert in MS-Excel, MS-Access, VBA, and SQL</li>\n<li>Proficient in MS-PowerPoint and comfortable building presentations to tell a clear story</li>\n<li>Capacity to communicate complex concepts in easy-to-understand terminology</li>\n<li>Works effectively both independently and as a member of a cross functional team</li>\n<li>Strong follow-through skills and acute attention to detail</li>\n<li>Passionate about user experience</li>\n<li>A keen analytical mind with high levels of creativity and quick solving capabilities to change the world in a huge way!</li>\n</ul>\n\n<strong>EDUCATIONAL REQUIREMENTS</strong>\n\n\n<ul>\n<li>Currently enrolled and pursuing a Masters or PhD in Computer Science, Statistics, Econometrics, Electrical Engineering, Operations Research, Computational Mathematics or a related field.</li>\n<li>Graduating December 2019 or later<br><br><strong>Additional Preferred Qualifications</strong><br><br>None mentioned at this time<br><br><strong>Company Summary</strong><br><br>The Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.<br><br><strong>Position Summary</strong><br><br>ABOUT DATA SCIENTIST INTERNS</li>\n</ul>\n\nThe teams within @WalmartLabs design, prototype and build technology-fueled products that bridge the gap between what's next and what's best. Data Scientist Interns work on project teams that are responsible for analyzing large data sets to develop custom models and algorithms to drive business solutions. The project teams provide analytical support to cross-functional projects (for example, email targeting, business optimization, consumer recommendations) within Walmart eCommerce. They assist in building large datasets from multiple sources in order to build algorithms for predicting future data characteristics. The intern projects involve researching new trends in the industry and utilizing up-to-date technology (for example, HBase, MapReduce, LAPack, Gurobi) and analytical skills to support their assigned project.\n<br><br>\n#undergradinternships\n<br>\n#gradinternships\n<br>"}