{"job title": "Data Engineer III, International Data Engineering (eCommerce)", "company": "Walmart", "city state": "– SUNNYVALE, CA", "rating": "3.2", "job description": "<strong>Position Description</strong><br><br>Data Engineering, Database Engineering, Business intelligence and Business analytics\n<br>\nWriting highly-optimized SQL queries across large data sets\n<br>\nWorking with Big Data Technologies (Hadoop, Hive, Kafka, Spark, etc.) and Data Warehousing/Scripting( ETL, RDBMS,BI, Python, Java)\n<br>\nParticipates in medium- to large-scale projects\n<br>\nProvides and supports the implementation and operations of the data pipelines and analytical solutions\n<br>\nModels compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity\n<br>\nWork with cloud technologies in Azure and/or Google Cloud Platform<br><br><strong>Minimum Qualifications</strong><br><br>Bachelor or Masters Degree in Computer Science or similar, and 3 to 5 years of experience\n<br>\nUnderstanding of Agile, Scrum, and DevOps methodologies\n<br>\nBachelor Degree in Computer Science, Computer Engineer, Management Information Systems or similar and 1 to 3 years experience.\n<br>\nUnderstanding of Agile, Scrum, and Continuous Improvement methodologies\n<br>\nExperience with database platforms including Oracle and Teradata as well as file system experience in Hadoop.\n<br>\nExperience with Java,Python, DataStage, Cognos, Tableau, Thoughtspot, and Lookr.\n<br>\nUnderstanding of cloud based systems including Infrastructure as a Service and Platforms as a Service\n<br>\nAdaptable to flexible schedules involving teams located in Europe, Asia, and LATAM.<br><br><strong>Additional Preferred Qualifications</strong><br><br>Background as an application developer or data engineer<br><br><strong>Company Summary</strong><br><br>The Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.<br><br><strong>Position Summary</strong><br><br>*Position/Project Summary\n<br>\nThe Software Engineer II will be creating software and data engineering components that will assist in establishing and maintaining the International eCommerce Data Lake. In this role, you will assist in defining system architecture and tactical solutions for product development, drive the execution of multiple business plans and projects and ensure business needs are being met. As such, key measures of success are:\n\n\n<ul>\n<li>Ensures delivery success</li>\n<li>Ensures efficient delivery of quality product</li>\n<li>Improves, optimizes, and identifies opportunities for improved software development life cycle</li>\n<li>Manages the testing of a functional domain of the technology platform and builds solutions with directors and above to align with business strategy</li>\n<li>Promotes and supports company policies, procedures, mission, values, and standards of ethics and integrity</li>\n<li>Supports continuous process improvement and innovation</li>\n</ul>"}