{"job title": "Data Scientist PhD", "company": "Wayfair", "city state": "– Boston, MA", "rating": "3.5", "job description": "<strong>Introduction to the team:</strong>\n<br>\nThe Data Science group is made up of team members with diverse skill sets across math and engineering, dedicated to solving some of the most analytically challenging problems here at Employer. The work we do encompasses:\n\n<ul>\n<li><strong>Data mining</strong> - uncover deep insight hidden in our vast repository of raw data, and provide tactical guidance on how act on findings</li><li><strong>Algorithm design</strong> - develop quantitative models, leveraging machine learning and advanced data analysis techniques</li><li><strong>Algorithm platform engineering</strong> - architect and build technical platforms for our algorithmic engines to run at scale</li><li><strong>Influencing business decisions</strong> - relentlessly leverage our work and encourage adoption across our business partners, to drive real business value</li>\n</ul>\n\nAs part of this role, you will be a creative thinker in how to solve problems, utilizing quantitative/technical skills along with business understanding to devise solutions. You'll work within Employer's big data technology infrastructure in order to dive deep into our data sets and develop innovative new capabilities.\n<br>\nThe Data Science department covers three main topic areas. You will work in one of the following:\n<br>\n<strong>Data Science Personalization</strong> builds sophisticated platforms designed to personalize customer experience to millions of unique shoppers across site and email. This includes working on different types of recommendations engines, as well as algorithms that machine-learn complex shopping behavior. The goal is to be intelligent and automated in making the experience more relevant for every user.\n<br>\n<strong>Data Science Marketing</strong> builds the framework and algorithms that help guide Employer's $250M+ annual marketing investment. The work touches all marketing channels (TV, catalog and digital) and aims to improve our ability to measure marketing impact, improve our customer targeting and optimize our investments across millions of marketing campaigns.\n<br>\n<strong>Data Science Operations</strong> builds data-driven solutions to support Employer operations teams, including Merchandising Operations, B2B, Supplier Performance, and Customer Service. The big goals are to enhance Employer's behind-the-scenes operational capabilities through rigorous use of algorithms and analysis.\n<br>\n<strong>Responsibilities:</strong>\n\n<ul>\n<li>Partner closely with business leads in Marketing, Product, or Operations to plan out valuable data science projects</li><li>Work in complex data systems and wrangle data from multiple sources including sales, customer, and clickstream databases</li><li>Conduct analysis and build models to uncover key learnings from data, leading to appropriate strategy recommendations</li><li>Serve as an algorithm and engineering lead to build advanced quantitative solutions into our overall technical platform</li><li>Work alongside business stakeholders to apply our findings and developments and continually improve the Employer customer experience</li>\n</ul>\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>2+ years of experience in a quantitative or technical work environment or <strong>advanced degree (PhD)</strong> in quantitative field (e.g. mathematics, economics, computer science, physics, neuroscience, operations research etc.)</li><li>Intuitive sense of how quantitative and technical work aligns closely with business priorities and business value</li><li>Ability to effectively work with business leads: strong communication skills, ability to synthesize conclusions for non-experts and desire to influence business decisions</li><li>High comfort level with programming, e.g. languages such as SQL, Python, R, Scala, Java, C++, C#, PHP, etc</li><li>Knowledge of quantitative methods - statistics, machine learning, general data analysis</li><li>Intense intellectual curiosity - strong desire to always be learning</li><li>Analytical, creative, and innovative approach to solving open-ended problems</li><li>Highly collaborative, team-player attitude</li>\n</ul>\n\n<strong>About Employer Inc.</strong>\n<br>\nEmployer believes everyone should live in a home they love. Through technology and innovation, Employer makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Employer is reinventing the way people shop for their homes - from product discovery to final delivery.\n<br>\n<strong>The Employer family of sites includes:</strong>\n\n<ul>\n<li> Employer , an online destination for all things home</li><li> Joss &amp; Main , where beautiful furniture and finds meet irresistible savings</li><li> AllModern , unbelievable prices on everything modern</li><li> Birch Lane , a collection of classic furnishings and timeless home décor</li><li> Perigold , unparalleled access to the finest home décor and furnishings</li>\n</ul>\n\nEmployer generated $5.2 billion in net revenue for the twelve months ended March 31, 2018. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 8,700 people.\n<br>\nEmployer does not accept unsolicited candidate referrals or resumes / CVs from third-party vendors, including recruitment agencies. Employer will not be responsible or liable for any fees or costs associated with such unsolicited submissions.\n<br>\nTag: ANLT-BIDS"}