{"job title": "Machine Learning Data Scientist", "company": "Wayfair", "city state": "– Boston, MA", "rating": "3.5", "job description": "<strong>Introduction to the team:</strong>\n<br><br>\nThe members of Wayfair’s Data Science group come from a range of highly quantitative backgrounds (think astrophysics, economics, cognitive science, and operations research, engineering and math)\n<br><br>\nThe projects that our teams work on are driven from the ground up – we look for entrepreneurial individuals that want to take ownership over their own agenda and thrive in a collaborative team environment.\n<br><br>\n<strong>Check out some of our work here: https://tech.wayfair.com/team-data-science/</strong>\n<br><br>\nMany of our projects are new and mostly projects that have never been worked on before. The work we do encompasses:\n<ul>\n<li><strong>Algorithm design</strong> - develop quantitative models, leveraging machine learning and advanced data analysis techniques</li><li><strong>Algorithm platform engineering</strong> - architect and build technical platforms for our algorithmic engines to run at scale</li><li><strong>Influencing business decisions</strong> - relentlessly leverage our work and encourage adoption across our business partners, to drive real business value</li><li><strong>Data mining</strong> - uncover deep insight hidden in our vast repository of raw data, and provide tactical guidance on how act on findings</li>\n</ul>\nAs part of this role, you will be a creative thinker in how to solve problems, utilizing quantitative/technical skills along with business understanding to devise solutions. You’ll work within Wayfair’s big data technology infrastructure to dive deep into our data sets and develop innovative new capabilities.\n<br><br>\nThe Data Science department covers these main topic areas. You will work in one of the following:\n<br><br>\n<strong>Computer Vision:</strong>\n<br>\nImagery and style is at the core of Wayfair’s catalog offering. At Computer Vision, we use the latest in the research community to build algorithmic intelligence of Wayfair’s millions of images for our customers, suppliers, and in-house scientists\n<br>\n<strong>Pricing:</strong>\n<br>\nOur algorithms dynamically price millions of products everyday. We are constantly automating real-time experiments at scale and running complex statistical models to infer optimal prices via our understanding of customer and competitor behavior.\n<br><br>\n<strong>Marketing:</strong>\n<br>\nWayfair invests hundreds of millions of dollars in annual marketing spend, and we optimize the return using attribution, segmenting, and forecasting.\n<br><br>\n<strong>Business to Business (B2B):</strong>\n<br>\nWe use machine learning to understand customer behavior on our B2C site to better identify customers who could be good B2B customers to enroll in our Wayfair Professional Program. Once enrolled, we then use customer signals to help prioritize customers for outreach that would drive incremental value with surgically precise sales engagement.\n<br><br>\n<strong>Qualifications:</strong>\n<ul>\n<li>2+ years of experience in a quantitative or technical work environment or <strong><em>advanced degree (PhD)</em></strong> in quantitative field (e.g. mathematics, economics, computer science, physics, neuroscience, operations research etc.)</li><li>Intuitive sense of how quantitative and technical work aligns closely with business priorities and business value</li><li>Ability to effectively work with business leads: strong communication skills, ability to synthesize conclusions for non-experts and desire to influence business decisions</li><li>High comfort level with programming, e.g. languages such as Python, R, Scala, Java, C++, C#, PHP, etc</li><li>Knowledge of quantitative methods – statistics, machine learning, deep learning, NLP, general data analysis</li><li>Intense intellectual curiosity – strong desire to always be learning</li><li>Analytical, creative, and innovative approach to solving open-ended problems</li><li>Highly collaborative, team-player attitude</li>\n</ul>\n<strong>About Wayfair Inc.</strong>\n<br><br>\nWayfair believes everyone should live in a home they love. Through technology and innovation, Wayfair makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Wayfair is reinventing the way people shop for their homes - from product discovery to final delivery.\n<br><br>\nThe Wayfair family of sites includes:\n<ul>\n<li>Wayfair, an online destination for all things home</li><li>Joss &amp; Main, where beautiful furniture and finds meet irresistible savings</li><li>AllModern, unbelievable prices on everything modern</li><li>Birch Lane, a collection of classic furnishings and timeless home décor</li><li>Perigold, unparalleled access to the finest home décor and furnishings</li>\n</ul>\nWayfair generated $5.7 billion in net revenue for the twelve months ended June 30, 2018. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 9,700 people.\n<br><br>\n<em>Wayfair does not accept unsolicited candidate referrals or resumes / CVs from third-party vendors, including recruitment agencies. Wayfair will not be responsible or liable for any fees or costs associated with such unsolicited submissions.</em><br><br>Tag: ANLT-BIDS"}