{"job title": "Senior Data Scientist", "company": "Weatherford International Inc", "city state": "– Houston, TX", "rating": "5.0", "job description": "<strong>ORGANIZATION SUMMARY</strong>\n<br><br>\nWeatherford is one of the largest multinational oilfield service companies providing innovative solutions, technology and services to the oil and gas industry. The Company operates in over 90 countries and has a network of approximately 1,000 locations, including manufacturing, service, research and development, and training facilities and employs approximately 29,500 people. For more information, visit www.weatherford.com and connect with Weatherford on LinkedIn, Twitter, YouTube and Facebook.\n<br><br>\nWeatherford delivers innovative technologies and services designed to meet the world's current and future energy needs in a safe, ethical, and sustainable manner. Grounded by our core values and inspired by our world-class people, we are committed to being a trusted business partner to those we serve.\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nPerform exploratory data analysis (EDA), develop predictive models utilizing machine learning and A.I. and deliver insight driven prescriptive analytics to help Weatherford improve performance.\n<br><br>\nThe Data Scientist will be part of Weatherford's Global S&amp;OP organization and will be assisting the S&amp;OP process by finding insights in the different sources of data, internal and external, modeling the data to obtain accurate predictions, and producing prescriptive analytics solutions to improve various business outcome indicators.\n<br><br>\n<strong>DUTIES &amp; RESPONSIBILITIES:</strong>\n<br><br>\nEnable the decision making of the different functions of the S&amp;OP process by:\n<br><br>\nPerforming data wrangling and EDA on internal and external data sources to understand the data.\n<br><br>\nProducing machine learning models for finding patterns in the data, classifying observations, predicting demand, forecasting family of products and budgets utilizing multivariate machine learning models with external and internal continuous and categorical variables.\n<br><br>\nProducing accurate outputs.\n<br><br>\nExplaining and justifying the outputs.\n<br><br>\nProducing and presenting prescriptive analytics that will enable the S&amp;OP decision making process.\n<br><br>\nSuccessfully develop, conceptualize and test various statistical and machine learning models\n<br><br>\nIntegrate the outcomes as real time analytics to elevate the S&amp;OP organization ability to create value for the different company functions through means not immediately apparent to them.\n<br><br>\nThe Data Scientist is expected to collaborate with other S&amp;OP team members, as well as, with subject matter experts of the different company's functions to deliver strategic advanced analytics projects from design to execution.\n<br><br>\n<strong>QUALIFICATIONS</strong>\n<br><br>\nOil &amp; Gas domain knowledge and experience in the upstream segment.\n<br><br>\nExperience with end-to-end modeling projects, from research to solutions to analytic products.\n<br><br>\nStrong hands-on skills in sourcing, cleaning, manipulating and analyzing large volumes of data\n<br><br>\nStrong oral and written communication skills.\n<br><br>\nStrong interpersonal and leadership skills and ability to influence others and lead small teams.\n<br><br>\nExperience with projects involving Exploratory Data analysis, Pattern Recognition, machine learning.\n<br><br>\nExperience and expertise with the R and Python languages and Tensorflow.\n<br><br>\nExperience working with unstructured data and unstructured databases.\n<br><br>\nMasters or Ph.D. (Data Science, Computer Science, Statistics, Mathematics, or Economics).\n<br><br>\nMinimum 5 years of Data Science experience for Ph.D. candidates or 7 years for Masters candidates.\n<br><br>\nMinimum 5 years of work experience in one or more of the Oil &amp; Gas upstream industry domains with hands on experience handling data driven decisions.\n<br><br>\nMinimum 5 years of experience in several or all of the following: Supervised and Unsupervised Learning, Classification Models, Cluster Analysis, Neural Networks, Non-parametric Methods, Multivariate Statistics, Reliability Models, Markov Models, Stochastic models, Bayesian Models, Deep Learning, Genetic Algorithms, Fuzzy Logic, Inference Systems\n<br><br>\nMinimum of 5 years of experience in various statistical and machine learning models, data mining, unstructured data analytics in corporate or academic research environments.\n<br><br>\nMinimum 5 years of experience in statistical/ML software: Python, R, and 2 years of Tensorflow.\n<br><br>\nMinimum 5 years of programming experience with Python and R.\n<br><br>\nTrack record of strong cross-functional leadership.\n<br><br>\nLeadership/participation of successful continuous improvement projects.\n<br><br>\nExperience interacting with and presenting to executive level management.\n<br><br>\nAbility to implement training.\n<br><br>\nAbility to quickly and correctly prioritize tasks.\n<br><br>\nAbility to summarize and effectively and simply communicate the output of complex analysis.\n<br><br>\n<strong>Hours of work/work schedule/flex-time:</strong>\n<br><br>\nFull time salaried position.\n<br><br>\n<strong>Preferred:</strong>\n<br><br>\nFamiliarity with operations research (i.e. linear and non-linear optimization).\n<br><br>\nFamiliarity with relational databases and advanced level knowledge of SQL.\n<br><br>\nAbility to think creatively to solve real world business problems.\n<br><br>\nAbility to work in a global collaborative team environment.\n<br><br>\nExperience leading or collaborating with a cross-functional team in developing and delivering machine learning models that work in a production setting.\n<br><br>\nExperience working with large data sets and tools like MapReduce, Hadoop, Hive, etc.\n<br><br>\nExperience working with large data streaming technologies like Spark, Flink, etc.\n<br><br>\nFamiliarity with relational databases and intermediate level knowledge of SQL.\n<br><br>\nExperience working with unstructured data and unstructured databases.\n<br><br>\nProficient verbal and written communication skills.\n<br><br>\nBI experience (Power BI a plus).\n<br><br>\n<strong>POSITION SPECIFIC DETAILS</strong>\n<br><br>\nWeatherford offers competitive compensation and benefits upon hire; including paid vacation to start, matching 401K program, comprehensive benefits program, and employee stock purchase program (ESPP) and opportunities for on-going training and career development. VEVRAA Federal Contractor Priority Referral Requested\n<br><br>\nWeatherford is an Equal Opportunity Employer Females/ Minorities/ Veterans/Disabled and gives consideration for employment to qualified applicants without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."}