{"job title": "Senior Data Engineer", "company": "Webroot", "city state": "– Westminster, CO", "rating": "3.8", "job description": "<div><strong>In this role you will:</strong>\n<ul>\n<li>Work with internal business customers in understanding the business requirements and develop prototypes and proof of concepts for selected projects</li><li>Implement complex big data solutions with a focus on collecting, parsing, managing, analyzing and visualizing large sets of data to turn information into insights using multiple platforms</li><li>Work with our global team and provide technical direction in building solutions and architecting distributed systems</li><li>Actively participate in knowledge sharing sessions, code and design reviews etc.</li><li>Develop scalable data lake for data acquisition, storage, access, and analysis required for structured, semi-structured, and unstructured data in a cloud (AWS) environment</li><li>Enhance the data infrastructure framework by evaluating new and existing technologies and techniques to create efficient processes around data extraction, aggregation, and analytics</li><li>Assist in establishing and maintaining standards and guidelines for the design, development, tuning, deployment, and maintenance of information and advanced data analytics</li>\n</ul>\n<strong>You bring to the table:</strong>\n<ul>\n<li>6+ years in Data Engineering\n\n<ul>\n<li>Hands on experience building Data Lake on AWS while sourcing data from heterogeneous sources</li><li>Experience with Massively Parallel Processing (MPP) databases</li><li>Experience with AWS technologies, such as S3, Redshift, Kinesis, EMR, etc.</li><li>Experience with distributed systems and NoSQL databases</li></ul></li>\n<li>Hands on experience with Big Data technologies e.g. MapReduce, Hadoop, Hive, Presto, and Spark</li><li>Hands on experience with Scala, Python and PySpark</li><li>You enjoy learning new technologies, data analysis, and identifying data patterns and trends</li><li>Ability to recommend innovative solutions to solve business and technical problems in a straight forward manner to business partners</li><li>Track record of successfully building scalable Data Lakes solutions that connects to distributed data storage using multiple data connectors</li><li>Extensive experience with SQL programming (TSQL, PLSQL)</li><li>Strong communication skills</li><li>Strong problem solving and analytical skills</li>\n</ul>\nYou are an experienced Sr. Data Engineer with a passion for transforming the companys data into actionable information. You seek an opportunity with a company that is willing to invest in order to get the best return out of their data and analytics. At Webroot, in Broomfield, CO, we seek to empower a data engineer to work on building new cloud-based (AWS) solutions with our data. Your role will be critical in building functional and scalable data infrastructure to provide the organization the ability to make informed decisions. You will develop end-to-end solutions in Cloud (preferably AWS) with a strong background in and application of, data architecture, SQL and data warehousing. Your expertise in AWS will provide our company clear feedback and inform direction for the future. You will add your knowledge in the how vision for data engineering and will help to drive leading-edge data warehousing and business intelligence practices at a company which is high on collaboration and innovation, but low on egos. This is an opportunity to have a definitive impact on a company's data practice. Apply today!\n<br><br>\nAt Webroot, we do more than secure our customers' personal computers, mobile devices and networks. We also nurture our employees' most critical assets their talents, experience, and career aspirations. Webroot has the energy of a start-up with the strength and stability of an Internet security market leader. We foster the innovative culture you'd expect of a company that's making a statement. Webroot is a company in which you can invest yourself fully, knowing that you're not only protecting our customers around the world, but also that your talents and innovation will be recognized and rewarded. We encourage you to learn more about us and explore our job openings. Secure your future. Ensure the same for your career. Principals only - no third parties, please. Webroot Inc. is an Equal Opportunity Employer. At Webroot, we believe in rewarding success. Our total rewards philosophy includes highly competitive salaries and a robust benefits package that you can view here.<br><br>(463380889)\n<br><br>\n(WEBR-SrDataEngineer)</div>"}