{"job title": "Data Analyst", "company": "Webster Bank", "city state": "– New Britain, CT", "rating": "3.5", "job description": "If you're looking for a meaningful career, you'll find it here at Webster. Founded in 1935 by Harold Webster Smith, our focus has always been to put people first--doing whatever we can to help individuals, families and businesses achieve their financial goals. And while we've grown into a leading commercial bank, we remain passionate about serving our customers, supporting our communities, and making a difference in people's lives. We can make a difference in your life, too. By empowering you to build the meaningful career you've been looking for. <br><br>Responsibility, respect, trust, teamwork and citizenship are the values on which Webster was founded. Together we call them The Webster Way, and they are what set us apart as a bank and an employer. Guided by these values, we put people first - working hard to live up to our customers, and each other, every day. <br><br>This individual will be responsible for documenting inputs to enterprise models, ensuring consistent data definitions, and putting into place governance of those data elements for consistency and accuracy. This individual will be responsible for working closely with business partners (internal and external) to clearly define and document business needs around data. Research, analyze and assess data sources and structures to effectively and collaboratively define solutions to data needs within the organization. Serves as a subject matter expert for the data sources, definitions, lineage and transformation of data within the Central Data Repository. Defines, documents all inputs to enterprise models, ensures consistent data definitions, and champion governance of data for consistency and accuracy. <br><br>In this role, you will: <br><br> <br><br> <br>* Serve as a strong liaison and partner to all business lines for all data needs <br>* Elicit, analyze, interpret and document business requirements that accurately describe data needs <br>* Research, document and maintain data lineage, data dictionaries and data source to target mappings <br>* Monitor overall data quality for assigned data entities in the model and reports utilized <br>* Define and document processes to monitor adherence to data governance policies and procedures for Webster master data, and making policy recommendations as needed. <br>* Work closely with line of business representatives in all areas of the bank to establish standards around referential and conditional master data values related to the model. <br>* Identify and manage the resolution of data quality issues, such as uniqueness, integrity, accuracy, consistency, and completeness in a cost-effective and timely fashion. <br>* Collaborate with business and IT partners (internal and external) to define and document data solutions inclusive of integration of new data elements and sources. <br>* Participate in meetings to discuss data quality and governance <br><br>The qualified candidate will have: <br><br> <br><br> <br>* BA/BS in Computer Science/Business (or equivalent work experience to substitute for education) <br>* 3+ years' experience analyzing data using basic sql utilities <br>* 3+ years as an established and successful Business/Systems Analyst <br>* Proven problem solving skills <br>* Demonstrated research/analytical skills with attention to detail <br>* Excellent documentation skills <br><br> <br>* Excellent communication skills <br>* Demonstrated desire and ability to work independently with initiative <br><br> <br>* Demonstrated skills that reflect the ability to work with multiple business lines to drive governance and stewardship <br>* Prior financial services experience related to data in loan or accounting. <br>* Excellent communication skills <br>* Demonstrated desire and ability to work independently with initiative <br><br>*LI-LT1 <br><br>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}