{"job title": "Data Scientist", "company": "Wegmans Food Markets", "city state": "– Rochester", "rating": "4.0", "job description": "<strong>Availability Requirement for this role:</strong><br><br>Morning, Afternoon, Evening<br><br><strong>Age Requirement:</strong><br><br>Must be 18 years or older<br><br><strong>Time Type:</strong><br><br>Full time<strong>Why Work Here</strong><br><br>Working at Wegmans provides opportunities to grow, flexible scheduling, incredible benefits, and the experience of working for a company with a reputation you can be proud of.<br><br><strong>Job Description:</strong><br><br>There’s never been a better time to be on the Consumer Insights Team at Wegmans! Wegmans is on a journey to transform its digital strategy and we are quickly growing our digital and e-commerce businesses. You’ll be part of a new team of Data Scientists that support our Marketing and Merchandising teams with providing important customers insights that help our business leaders make quick decisions. If you are a creative and passionate problem-solver who can think big, work quickly and are motivated to develop new ways to optimize our business, this could be the job for you!\n<br><br>\nWhat will I do?\n<ul>\n<li>Work with stakeholders throughout Wegmans to identify opportunities for leveraging company data to drive business solutions</li><li>Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies</li><li>Oversee measurement and impact of marketing tests within each Agile team/campaign</li><li>Provide continuous support for various marketing and merchandising teams, evaluating and prioritizing requests</li> <li>Identify and present business opportunities to the marketing organization based on customer behavioral and industry trends</li>\n</ul>\nRequired Qualifications\n<ul>\n<li>2 or more years of experience in data science</li> <li>Bachelor’s Degree in a related field (Computer Science, Statistics, Data Science)</li><li>Advanced knowledge of data modeling and understanding of different data structures</li><li>Highly proficient with common statistical software and database platforms, such as R, Python, SPSS, SAS, Hadoop, Tableau, Alteryx, Postgres, SQL, etc.</li><li>Understanding of A/B and MVT testing</li>\n</ul>\nPreferred Qualifications\n<ul>\n<li>Master’s Degree in Data Science or a related field</li><li>Experience in data science within B2C or retail setting</li><li>Machine Learning</li>\n</ul>"}