{"job title": "Data Scientist / Analytic Consultant 4", "company": "Wells Fargo", "city state": "– Phoenix, AZ", "rating": "3.5", "job description": "<strong>Job Description</strong><br><br>At Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.\n<br><br>\nHelp us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.\n<br><br>\n<strong> Data Management and Insights (DMI)</strong> is transforming the way that Wells Fargo uses and manages data. Our work enables Wells Fargo to empower and inform our team members, deliver exceptional experiences for our customers, and meet the elevated expectations of our regulators. The team is responsible for designing the future data environment, defining data governance and oversight, and partnering with technology to operate the data infrastructure for the company. This team also provides next generation analytic insights to drive business strategies and help meet our commitment to satisfy our customers financial needs.\n<br><br>\nThe Data Management and Insights organization (DMI) is building a best in-class data science team, focused on delivering enterprise-wide data driven insights based in both traditional and emerging analytical techniques. Our team supports the DMI service model by providing LOBs with machine learning and predictive analytic consulting and guidance.\n<br><br>\n<strong> KEY RESPONSIBILITIES INCLUDE:</strong>\n\n\n<ul>\n<li>Lead machine learning projects, including working with business partners to define the scope and deliverable, developing the analytic plan and time line, leading deployment and delivering results.</li>\n<li>Provide technical advice to other members of the team and across the organization on topics including machine learning code, machine learning algorithms and traversing across multiple big data platforms.</li>\n<li>Identify and lead the evaluation of new software techniques and technologies, including delivery of results.</li>\n<li>Identify new applications for machine learning across the company and work with business partners to pilot.<br><br><strong>Required Qualifications</strong></li>\n\n</ul>\n\n\n<ul>\n<li>6+ years of experience in one or a combination of the following: reporting, analytics, or modeling; or a Masters degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 4+ years of experience in one or a combination of the following: reporting, analytics, or modeling</li><li>2 + years of experience using quantitative machine learning techniques</li><li>2+ years of Python experience</li><li>2+ years of SQL experience</li>\n</ul>\n<strong>Desired Qualifications</strong>\n<ul>\n<li>Extensive knowledge and understanding of research and analysis</li><li>Strong analytical skills with high attention to detail and accuracy</li><li>Excellent verbal, written, and interpersonal communication skills</li><li>Experience with Tensorflow, Theano or Keras</li>\n</ul>\n<strong>Other Desired Qualifications</strong>\n\n<ul>\n <li>Solid understanding of and 5+ years of experience applying machine learning techniques such as neural networks, random forest, GBM and SVM, to form a story</li> <li>Experience with signal processing or optimization techniques</li> <li>Advanced knowledge of statistical techniques (e.g. sampling, probability, multivariate data analysis, regression, PCA, time-series analysis)</li> <li>Strong ability to retrieve, combine and transform data from numerous information systems</li> <li>Strong acumen in diagnosing and resolving data issues</li> <li>Experience working with big data infrastructure with tools such as Hive, Spark and h2o</li> <li>Exceptional analytical, critical thinking, quantitative reasoning skills, and problem-solving skills. Ability to relate complex analysis and insights to effective business strategy</li> <li>Oher advanced statistical tools such as SAS, R and Weka</li>\n</ul>\n\n<strong>Disclaimer</strong><br><br>All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.\n<br><br>\nRelevant military experience is considered for veterans and transitioning service men and women.\n<br><br>\nWells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}