{"job title": "Scientist, Lab", "company": "West Pharmaceutical Services", "city state": "– Exton, Pennsylvania", "rating": "3.0", "job description": "<strong>Scientist, Lab</strong>\n<br><br>\n<strong>Exton</strong>\n<br><br>\n<strong>Pennsylvania</strong>\n<br><br>\nWest Pharmaceutical Services, Inc. is a leading manufacturer of packaging components and delivery systems for injectable drugs and healthcare products. Working by the side of its customers from concept to patient, West creates products that promote the efficiency, reliability and safety of the world's pharmaceutical drug supply. West is headquartered in Exton, Pennsylvania, and supports its customers from locations in North and South America, Europe, Asia and Australia. West's 2017 sales of $1.6 billion reflect the daily use of approximately 112 million of its components and devices, which are designed to improve the delivery of healthcare to patients around the world.\n<br><br>\n<strong><u>POSITION SUMMARY:</u></strong>\n<br><br>\nIndependently provide analytical support for internal and external customers.\n<br><br>\n<u><strong>ACCOUNTABILITIES:</strong></u>\n\n<ul>\n\n\t<li>Perform analysis using various techniques including established and experimental test methods.</li> \n\n<li>Use instrumentation both qualitatively and quantitatively where appropriate.</li>\n<li>Manage projects from protocol to final report.</li> \n\n<li>Train and certify analysts as appropriate.</li> \n\n<li>Develop and validate methods.</li>\n<li>Keep current with new analytical technology.</li>\n<li>Possess ability to work independently and as part of a team with self-motivation, adaptability, and a positive attitude.</li>\n<li>Prepare technical reports based on data from multiple analysts utilizing multiple analytical techniques.</li>\n<li>Prepare work instructions, SOPs, and qualification documentation.</li>\n<li>Prepare lab study designs and prepare study plans and protocols.</li>\n<li>Interact with internal and external clients as needed.</li> \n\n<li>Willingness to learn and apply new analytical techniques.</li>\n<li>Perform lab investigations, OOS, and OOT as required.</li>\n<li>Meet individual and departmental goals as required.</li>\n<li>Apply required cGMP regulations and internal QA procedures</li>\n<li>Adhere to established laboratory safety procedures.</li>\n<li>Other responsibilities as assigned.</li>\n</ul>\n<strong><u>BASIC QUALIFICATIONS:</u></strong>\n<br><br>\nEducation: Bachelor’s\n<br><br>\nMinimum of a BS degree in Chemistry or related field with 5 years experience.\n<br><br>\nMinimum 2 years GMP experience required\n<br><br>\nStrong oral and written communication skills and attention to detail required\n<br><br>\nDirect/Indirect Reports: None\n<br><br>\n<u><strong>PHYSICAL &amp; TRAVEL REQUIREMENTS:</strong></u>\n<br><br>\nTravel: Minimal\n<br><br>\nPhysical: Must be able to stand for long periods of time.\n<br><br>\n<em>The job description reflects the general details considered necessary to describe the principal functions of the job identified and shall not necessarily be construed as a detailed description of all of the work requirements that may be inherent in the job.</em>\n<br><br>\nWest is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sex, gender identity, sexual orientation, age, marital status, veteran status, or disability status. If you have a disability or special need that requires accommodation, please send an email to peggy.tayloe@westpharma.com. Where permitted by law, an offer of employment with West Pharmaceutical Services, or any of its subsidiary or affiliate companies, is contingent upon the satisfactory completion of background screening and/or a pre-employment drug screening."}