{"job title": "Principal Scientist, Applied Science", "company": "WeWork", "city state": "– Boston, MA", "rating": "3.3", "job description": "WeWork manages 300 buildings and serves 250,000 members around the world. Workspace intelligence is critical for building a community that enhances productivity, encourages innovation, and strengthens collaboration.\n<br><br>\nWorkspace intelligence relies on datahow to gather it, how to analyze it, and what to do with the knowledge derived from it. We invest in areas such as pervasive computing, data management, machine learning, and computational social science to understand the environment, the people, as well as how they interact with other. Furthermore, we also analyze data in the digital world: We uncover social dynamics from digital communication including emails, messages and social networks.\n<br><br>\n<strong>Roles &amp; Responsibilities</strong>\n<br><br>\nWe collect, manage, and perform sophisticated analysis on a large variety of data that involve spaces, people, events, and their interplays.\n\n<ul>\n<li>Sensor networks and ubiquitous computing</li>\n<li>Data management and query processing</li>\n<li>Distributed systems and cloud computing</li>\n<li>Social network analytics</li>\n<li>Machine learning (computer vision, NLP, etc.)</li>\n</ul>\nResponsibilities vary based on candidates passion and experiences. Key responsibilities includes conducting research in the abovementioned disciplines, designing and implementing prototypes as well as scalable solutions, collaborating with cross-functional engineering teams, including teams that work on smart buildings, core platforms, growth and engagement, etc., in order to make impact in workspaces all around the world.\n<br><br>\n<strong>Qualifications</strong>\n\n<ul>\n<li>Ph.D. / M.S. / B.S. in Computer Science, or related field.</li>\n<li>Knowledge &amp; experience in one or multiple of the following areas: natural language processing, computer vision, image recognition, speech recognition, and data management systems.</li>\n<li>Knowledge &amp; experience in large scale data analysis and lange scale data management systems.</li>\n<li>Experience in developing and training neural network models.</li>\n<li>Experience in C++, Python, Java, SQL (or other programming languages and scripting languages)</li>\n<li>Excellent written and verbal communication skills, ability to communicate effectively to both technical and nontechnical audiences</li>\n</ul>\nWe are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br><strong>Apply now!</strong>"}