{"job title": "Senior Data Scientist Engagement", "company": "WeWork", "city state": "– New York, New York, United States", "rating": "3.3", "job description": "<strong>Position Outline</strong><br><br>As a Senior Data Scientist in the Engagement Mission, you will build data products that drive the way in which technology plays a more meaningful role in fostering connections between our members and the things that make them happier &amp; more successful.\n<br><br>\nYou will work closely with engineers, analysts, product managers and designers to evolve WeWorks member experience by focusing on creating intelligent environments and connected, consciously-engineered communities in all of our spaces.\n<br><br>\nThe ideal person for this role is highly analytical, feels comfortable bringing structure to complex systems, is passionate about generating hypotheses for business problems, excels at delivering actionable insights, and sees data science as a powerful tool to impact the business through data products rather than as an end in itself.<br><br><strong>Responsibilities</strong>\n\n\n<ul>\n<li>Work with Product &amp; Engineering teams to identify and prioritize data science opportunities</li>\n<li>Build analytical systems that use predictive modeling, recommendation systems, statistical inference, and optimization algorithms to infuse intelligence in products and business workflows</li>\n<li>Collaborate with Software Engineers to implement algorithms in production environments</li>\n<li>Develop next-generation prediction and optimization algorithms where existing ones either fall short or are inadequate</li>\n</ul>\n\n<strong>Requirements</strong>\n\n\n<ul>\n<li>5+ years of hands-on experience building data products powered by machine learning and/or optimization algorithms in non-academic environments.</li>\n<li>Ability to break down and understand complex business problems, define a solution and implement it using advanced quantitative methods.</li>\n<li>Meaningful experience with and deep technical understanding of statistical analysis, machine learning (classification, regression, unsupervised, reinforced, etc.), predictive modeling, and optimization algorithms.</li>\n<li>Strong programming skills with an emphasis on libraries for cleaning, exploring and visualizing data.</li>\n<li>Strong oral and written communication skills, especially around analytical concepts and methods.</li>\n<li>Strong work ethic and intellectual curiosity.</li>\n<li>Masters or Doctoral degree in a quantitative field (e.g., mathematics, computer science, physics, economics, engineering, operations research, quantitative social science).</li>\n</ul>\n\n<strong>Nice To Have</strong>\n\n\n<ul>\n<li>Experience in Recommendation Systems, Bayesian Inference or NLP</li>\n</ul>\nWeWork Technology is bridging the gap between physical and digital platforms, providing a delightful, flawless &amp; powerful experience for members and employees. We build software and hardware that enables our members to connect with each other and the space around them like never before.\n<br><br>\nWe augment our community and culture teams through the tools we build. We believe theres a macro shift toward a new way of workingone focused on a movement towards meaning and purpose. WeWork Technology is proud to be shaping this movement.\n<br><br>\nWe are a team of passionate, fearless and collaborative problem-solvers distributed globally with one goal in mind - to humanize technology across the world.\n<br><br>\nWeWork is an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br><br><strong>Apply now!</strong>"}