{"job title": "Metabolic Pathways Genomics Data Scientist", "company": "WHOLE BIOME", "city state": "– San Francisco, CA", "rating": "NA", "job description": "Job DescriptionWe are currently seeking a data scientist with experience in analyzing biological pathways in the context of biochemical/cell assay data as well as high-throughput genomics. This position will report to the Senior Staff Data Scientist and be responsible for supporting R&amp;D activities, especially those related to biochemical pathways and genomics.\n<br><br>\n<strong>Nice to Have:</strong>\n\n\n<ul>\n<li>PhD in a related scientific field, especially with heavy use of statistical analysis programming</li>\n<li>Training in the interpretation of bacterial genomes and associated metabolic and/or signaling pathways</li>\n<li>Strong understanding of bioinformatics algorithms, e.g., sequence assembly and alignment, genomic annotation</li>\n<li>Solid knowledge of statistical techniques</li>\n<li>industry experience in R</li>\n<li>experience using Unix/Linux environments, Bash, Make and related Unix tools</li>\n<li>experience with Python</li>\n<li>Independent thinker</li>\n</ul>\n\nMust be prepared to contribute code in R or Python, and relevant peripheral supporting languages.\n<br><br>\n<strong>Nice to have:</strong>\n<br><br>\nR (tidyverse, data.table, ggplot2, rmarkdown, Shiny, caret)\n<br><br>\nPython (Numpy, SciPy, Pandas, Scikit-learn, Matplotlib, jupyter notebooks)\n<br><br>\nLinux, bash, Git, AWS\n<br><br>\nthe absence of an inclination for MATLAB, perl, java\n<br><br>\nhttps://www.wholebiome.com/metabolic-pathways-genomics-data-scientist.html\n<br><br>\nCompany DescriptionWhole Biome is an early-stage, venture-backed microbiome company located in the historic Dogpatch neighborhood of San Francisco. We are developing novel classes of therapeutics and diagnostics that target the human microbiome to improve the lives of patients suffering from a variety of diseases. At Whole Biome, we employ cutting-edge technology in our R&amp;D pipeline. We are passionate about building products that are best-in-class and we are looking for individuals who embody that same desire.\n<br><br>\nAt Whole Biome, we understand that success means building great teams to solve challenging problems. We hire the best and brightest and give everyone the resources we need to succeed."}