{"job title": "Research Data Scientist", "company": "Whole Biome", "city state": "– San Francisco, CA, US", "rating": "NA", "job description": "We are currently seeking a data scientist with experience collaborating with \"wet lab\" scientists on interpreting assay data as well as automating these interpretations for high-throughput scale up. This position will report to the Senior Staff Data Scientist and be responsible for supporting both bench and clinical scientists. Broadly, this position will involve the following activities:\n\n<ul>\n<li>Design, analyze, interpret complex assays in collaboration with lab biologists and fellow data scientists</li>\n<li>Provide synthesis of actionable biological findings in presentations to internal stakeholders</li>\n<li>Develop and contribute to data science software packages</li>\n</ul>\nNice to Have:\n\n<ul>\n<li>PhD in Chemistry, Physics, Statistics, Computational Biology, Computer Science or related field</li>\n<li>Training in the interpretation of biological assay data</li>\n<li>Strong understanding of bioinformatics algorithms, e.g., sequence assembly and alignment, genomic annotation</li>\n<li>Solid knowledge of statistical techniques, e.g., EDA, regression analysis, hypothesis testing and ML methods</li>\n<li>3 years industry experience in R</li>\n<li>3 years in Unix/Linux environments using Bash, Make and related Unix tools</li>\n<li>1 year of professional Python</li>\n\n<strong><li>Independent thinker</li>\n</strong></ul><strong>\nSALARY AND CLASSIFICATION:</strong>\n<br>\nClassification: Full-Time position\n<br>\nCompensation: Competitive and commensurate with experience; includes equity package\n<br>\nBenefits: Medical, dental and vision; 401k with matching\n<br><br>\n<strong>ABOUT THE COMPANY:</strong>\n<br>\nWhole Biome is ushering in a revolution in diagnostics and therapeutics where each individual’s treatment will be driven by a comprehensive understanding and a targeted equilibration of their microbiome.\n<br><br>\nWe are developing novel classes of therapeutics and diagnostics that target the human microbiome to improve the lives of patients suffering from a variety of diseases. At Whole Biome, we employ cutting-edge technology in our R&amp;D pipeline. We are passionate about building products that are best-in-class and we are looking for individuals who embody that same desire.\n<br><br>\n<strong>HOW TO APPLY:</strong>\n<br>\nPlease forward a cover letter and resume."}