{"job title": "Principal Machine Learning Engineer", "company": "Williams-Sonoma Singapore Pte, Ltd.", "city state": "– San Francisco, California", "rating": "NA", "job description": "Requisition Number: SS-13219\n<br>\nArea of Interest: Information Technology\n<br>\nOrganization: Corporate\n<br>\nBrand/Division: Shared Services\n<br>\nPosition Type: Full-time\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nLocation: San Francisco, CA\n<br><br>\nAt Williams-Sonoma Technology, we reach beyond the code to lead and communicate. We're there to lend a hand anytime our brand and shared service partners need a technical guru. Whether it's helping an associate with a day-making tech fix, creating an online shopping experience that sails through with ease, taking our business into the next frontier, or finding new ways to run green, each of us is committed to creating a user experience that's as unique and rich as the products offered in our stores and online.\n<br><br>\nThe Williams-Sonoma Technology organization is seeking an energetic and talented Principal Machine Learning Engineer to assisting the development strategy and road mapping as a member of our developing Machine Learning &amp; AI team(s). At Williams Sonoma, we are harnessing the power of machine learning and predictive analytics to discover trends across our business. We are working on challenging problems in information retrieval, entity resolution, and developing an in-depth knowledge of multiple aspects for Williams-Sonoma, West Elm, Outward, Mark and Graham and the Pottery Barn family.\n<br><br>\n<strong>What you will be doing:</strong>\n\n\n<ul>\n<li>Work with internal customers on solving business-critical data-driven problems</li>\n<li>Coach junior team members</li>\n<li>Solve technical issues and shape an overarching strategy</li>\n<li>Create proof of concepts and demonstrations on future opportunities and challenges for the company</li>\n<li>Continue to learn /research about new things in ML</li>\n<li>Make analytical recommendations regarding current and future projects</li>\n<li>Be a pivotal member to vote for next years preferred coffee vendor -- really!</li>\n</ul>\n\n<strong>REQUIREMENTS AND QUALIFICATIONS</strong>\n<br><br>\n<strong>Required Qualifications:</strong>\n\n\n<ul>\n<li>MSc or Ph.D. in a STEM Field</li>\n<li>Strong hands-on programming experience with Java, Scala, Python and/or C++</li>\n<li>8+ years' work experience in Machine Learning, Data Science, and Software Engineering</li>\n<li>Solid experience in technical leadership of products, people, and organizations</li>\n<li>Proven experience in taking ideas to actual products</li>\n<li>Deep understanding of data structure, performance optimization, and algorithms</li>\n<li>Good knowledge of big data such as Spark, Hadoop, Kafka, Hive, and ElasticSearch</li>\n<li>Strong communication, analytical, and people skills</li>\n</ul>\n\nWork With US\n<br><br>\nWilliams-Sonoma is a company of lifestyle brands that emphasize good living and good eating. We are a People First organization that values our customers, quality craftsmanship, corporate responsibility and a healthy work/life balance.\n<br><br>\nWe are continually working to achieve our business goals while improving our social and environmental performance. As a framework to guide our efforts, we've committed to a positive impact in 3 key areas: Operations, Products and Materials, and People and Communities.\n<br><br>\nOur responsibility extends to every part of our business-- from our home to your home, to the world's home.\n\n\n<ul>\n<li>Work with emerging technologies</li>\n<li>Team First culture</li>\n<li>Full-time Associate Discount at all WS brands (40% off)</li>\n<li>Competitive salary and 401k plan</li>\n<li>Bonus plans and/or LTI plans for some positions</li>\n<li>Shuttle to/from SF BART and Caltrain</li>\n<li>Pre-tax health and commuter benefits</li>\n<li>Bike share program</li>\n<li>Pet Insurance (Starting July 2018)</li>\n<li>Quarterly sample sales</li>\n<li>Wellness program and quality health insurance options</li>\n<li>Mothers' rooms and onsite showers</li>\n<li>Discounts on nearby gyms and restaurant</li>\n</ul>\n\n<strong>#LI-JQ1</strong>\n<br><br>\nWilliams-Sonoma, Inc. is an Equal Opportunity Employer.\n<br><br>\nWilliams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances.\n<br><br>\nNearest Major Market: San Francisco\n<br>\nNearest Secondary Market: Oakland\n<br>\nJob Segment: Engineer, Developer, Java, Learning, Software Engineer, Engineering, Technology, Human Resources"}