{"job title": "Sr. Data Scientist", "company": "Williams-Sonoma, Inc.", "city state": "– San Francisco, CA", "rating": "2.8", "job description": "Requisition Number: SS-13973\n<br><br>\nArea of Interest: Marketing\n<br><br>\nOrganization: Corporate\n<br><br>\nBrand/Division: Shared Services\n<br><br>\nPosition Type: Full-time\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nAbout the Team\n<br><br>\nYou will be part of the Marketing Strategy and Analytics team responsible for providing business and customer insights, building customer and product level models, creating direct marketing audiences, and enhancing data quality\n<br><br>\n<strong>About the Role</strong>\n<br><br>\nIn this Senior Data Scientist role, you will be responsible for building predictive models for use in marketing campaigns. You will work with the marketing organization to test marketing strategies and analyze results. You will participate in the creation of custom audiences. You will provide analytics support for strategic marketing projects. You will work with IT to trouble shoot data issues and test marketing data impacts of IT systems changes.\n<br><br>\nYou're excited about this opportunity because you will...\n\n\n<ul>\n<li>Deliver production strength models on-time and error-free</li>\n<li>Develop custom models for specific brand initiatives and productionalize as needed</li>\n<li>Ideate, develop and promote new modeling assets within the marketing organization</li>\n<li>Create custom audiences using available data sources for segmentation and targeting for all marketing channels</li>\n<li>Assess the value of 3rd party data sources and work with vendors on segmentation initiatives</li>\n<li>Participate in the development of LTV metrics for marketing programs</li>\n<li>Work with CRM teams to test catalog and digital contact strategy, ensure proper test execution, analyze results and provide recommendations</li>\n<li>Partner with other analysts to offer analytics support for strategic marketing projects like personalization and customer journeys</li>\n<li>Work with IT on automating jobs, devising data requirements around new initiatives, and helping test impact of system changes</li>\n</ul>\n\nWhy you will love working at Williams-Sonoma, Inc.\n\n\n<ul>\n<li>We're a successful, fast-growing company with an entrepreneurial vibe</li>\n<li>A technologically and data-driven business</li>\n<li>Competitive salaries and comprehensive health benefits</li>\n<li>We're at the forefront of tech and retail, redefining technology for the next generation</li>\n<li>We're passionate about our internal and external clients and live/breathe the client experience</li>\n<li>We get to be creative on a daily basis</li>\n<li>A smart, experienced leadership team that wants to do it right and is open to new ideas</li>\n<li>We believe in autonomy and reward taking initiative</li>\n<li>We have fun!</li>\n</ul>\n\n<strong>REQUIREMENTS AND QUALIFICATIONS</strong>\n<br><br>\nWe're excited about you because...\n\n\n<ul>\n<li>You have a Master's degree or equivalent experience in statistics or a similar quantitative field</li>\n<li>You have superior coding skills</li>\n<li>You love digging into data to find trends and understand consumer behavior</li>\n<li>You are able to communicate analytical findings to a non-technical audience and influence putting the results into action</li>\n</ul>\n\n<strong>Technical Competencies required:</strong>\n\n\n<ul>\n<li>Well-versed in databases, SAS, SQL, R, Python, UNIX</li>\n<li>Retail industry experience a plus</li>\n</ul>\n\nAbout Williams-Sonoma, Inc.\n<br><br>\nFounded in 1956, Williams-Sonoma, Inc. is the premier specialty retailer of high-quality products for the kitchen and home in the United States. Our family of brands are Williams-Sonoma, Pottery Barn, Pottery Barn Kids, PBteen, West Elm, Williams-Sonoma Home, Rejuvenation, and Mark and Graham. These brands are among the best known and most respected in the industry. We offer beautifully-designed, stylish and functional products for every area of the home, including the kitchen, living room, bedroom, home office, closet, laundry room and even outdoor spaces. We've seen some big changes since our first brick-and-mortar store opened more than half of a century ago. What hasn't changed is our passion for high-quality products, functional design, outstanding customer service, and enhancing the lives of our customers and the communities where we operate. Today, we're a multi-brand, multi-channel, global enterprise supported by state-of-the-art technology and some of the most talented teams in retailing - and we're always looking for new energy and ideas.\n<br><br>\nThis role is not eligible for Visa sponsorship or relocation assistance.\n<br><br>\nWilliams-Sonoma, Inc. is an Equal Opportunity Employer.\n<br><br>\nWilliams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances.\n<br><br>\nNearest Major Market: San Francisco\n<br><br>\nNearest Secondary Market: Oakland\n<br><br>\nJob Segment: Database, Scientific, Developer, Direct Marketing, SQL, Technology, Engineering, Marketing"}