{"job title": "Sr. Data Scientist", "company": "Williams-Sonoma Inc.", "city state": "– San Francisco, CA", "rating": "2.8", "job description": "Requisition Number: SS-13249\n<br>\nArea of Interest: Marketing\n<br>\nOrganization: Corporate\n<br>\nBrand/Division: Shared Services\n<br>\nPosition Type: Full-time\n<br><br>\n<strong>JOB DESCRIPTION</strong>\n<br><br>\nAbout the Team\n<br><br>\nYou will be part of the Marketing Strategy and Analytics team responsible for providing business and customer insights, building customer and product level models, creating direct marketing audiences, and enhancing data quality.\n<br><br>\n<strong>About the Role</strong>\n<br><br>\nIn this Senior Data Scientist role, you will be responsible for independently designing and building complex models to produce assets that drive positive bottom line impact. You will work with the marketing organization to test these assets and analyze results. We have a multi-dimensional customer data landscape that you will leverage to provide analytics support for strategic marketing projects.\n<br><br>\nYou're excited about this opportunity because you will...\n\n\n<ul>\n<li>Build and deliver models at the various levels of customer and product identity for direct marketing campaigns, site enhancements, customer segmentation, and personalization efforts applying both traditional and machine learning algorithms</li>\n<li>Ideate, develop and promote new modeling assets within the marketing organization</li>\n<li>Work with cross-functional marketing teams to validate models through live testing</li>\n<li>Create custom audiences using available data sources for segmentation and targeting for all marketing channels</li>\n<li>Assess the value of 3rd party data sources and work with vendors on segmentation initiatives</li>\n<li>Build in-brand and cross-brand product recommendation systems</li>\n<li>Participate in the development of LTV metrics for marketing programs</li>\n<li>Partner with other analysts to offer analytics support for strategic marketing projects like personalization and customer journeys</li>\n</ul>\n\nWhy you will love working at Williams-Sonoma, Inc.\n\n\n<ul>\n<li>We're a successful, fast-growing company with an entrepreneurial vibe</li>\n<li>We're a technologically and data-driven business</li>\n<li>Competitive salaries and comprehensive health benefits</li>\n<li>We're at the forefront of tech and retail, redefining technology for the next generation</li>\n<li>We're passionate about our internal and external clients and live/breathe the client experience</li>\n<li>We get to be creative on a daily basis</li>\n<li>A smart, experienced leadership team that wants to do it right and is open to new ideas</li>\n<li>We believe in autonomy and reward taking initiative</li>\n<li>We have fun!</li>\n</ul>\n\n<strong>REQUIREMENTS AND QUALIFICATIONS</strong>\n<br><br>\nWe're excited about you because...\n\n\n<ul>\n<li>You have a Master's degree or equivalent experience in statistics or a similar quantitative field</li>\n<li>3+ years of hands-on experience in data mining and model building</li>\n<li>Superior coding skills in Hive, SQL, R, Python, Spark, Scala</li>\n<li>You love digging into data to find trends and understand consumer behavior</li>\n<li>You're well-organized, have high attention to detail, and are deadline-oriented</li>\n<li>You can communicate analytical findings to a non-technical audience and influence putting the results into action</li>\n</ul>\n\n<strong>Technical Competencies required:</strong>\n\n\n<ul>\n<li>Well-versed in databases, SQL, R, Python, UNIX, Spark, Scala</li>\n<li>Machine learning algorithms and predictive models (Linear, Logistic, Proportional Hazards, Boosted Regression Trees)</li>\n<li>Clustering (K-means, Fuzzy, C-means, Hierarchical, Mixture modeling)</li>\n<li>Classification (Decision Trees, Logistic, Neural Net, SVM, Random Forest)</li>\n<li>Natural language processing, sentiment analysis.</li>\n<li>Retail industry experience a plus</li>\n</ul>\n\nAbout Williams-Sonoma, Inc.\n<br><br>\nFounded in 1956, Williams-Sonoma, Inc. is the premier specialty retailer of high-quality products for the kitchen and home in the United States. Our family of brands are Williams-Sonoma, Pottery Barn, Pottery Barn Kids, PBteen, West Elm, Williams-Sonoma Home, Rejuvenation, and Mark and Graham. These brands are among the best known and most respected in the industry. We offer beautifully-designed, stylish and functional products for every area of the home, including the kitchen, living room, bedroom, home office, closet, laundry room and even outdoor spaces. We've seen some big changes since our first brick-and-mortar store opened more than half of a century ago. What hasn't changed is our passion for high-quality products, functional design, outstanding customer service, and enhancing the lives of our customers and the communities where we operate. Today, we're a multi-brand, multi-channel, global enterprise supported by state-of-the-art technology and some of the most talented teams in retailing - and we're always looking for new energy and ideas.\n<br><br>\n<strong>Benefits:</strong>\n<br><br>\nOnce you are here, you can look forward to a wide variety of benefits. Our corporate vision--to enhance our customers' quality of life at home--extends to the lives of our associates. To that end, we offer an extensive benefits package designed to help you grow, personally and professionally, to keep you healthy, to prepare you for the unexpected, to care for your family and to build a secure future. Depending on your position and your location, here's a look at what you might be eligible for:\n\n\n<ul>\n<li>A generous discount on all Williams Sonoma Inc. brands through multiple shopping channels</li>\n<li>A 401(k) plan and other investment opportunities</li>\n<li>Paid vacations, holidays and other time-off programs</li>\n<li>Health benefits, including health, dental and vision insurance; health and dependent care tax-free spending accounts; medical, family and bereavement leave; same-sex domestic partner benefits; short- and long-term disability programs; life and travel insurance; an employee assistance program</li>\n<li>Tax-free commuter benefits</li>\n<li>A wellness program that supports your physical, financial and emotional health</li>\n<li>In-person and online learning opportunities through WSI University, LearnIt and AcademyX</li>\n<li>Cross-brand and cross-function career opportunities</li>\n<li>Quarterly sample sales</li>\n<li>A business casual work environment</li>\n<li>A bike share program</li>\n<li>Time off to volunteer</li>\n<li>Matching donations to qualifying nonprofit organizations</li>\n<li>Company-sponsored walks and runs</li>\n<li>Healthy, organic options in the cafeteria and an awesome salad bar</li>\n<li>Discounts on nearby gyms and other local businesses</li>\n</ul>\n\nWSI will not now or in the future commence an immigration case or \"sponsor\" an individual for this position (for example, H-1B or other employment-based immigration\n<br><br>\nThis role is not eligible for relocation assistance.\n\n\n<ul>\n<li>LI-JC1</li>\n</ul>\n\nWilliams-Sonoma, Inc. is an Equal Opportunity Employer.\n<br><br>\nWilliams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances."}