{"job title": "Data Scientist", "company": "Wipro Technologies", "city state": "– East Brunswick", "rating": "3.4", "job description": "Wipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO) is a leading global information technology, consulting and business process services company. We harness the power of cognitive computing, hyper-automation, robotics, cloud, analytics and new ground breaking technologies to help our clients adapt to the digital world and make them successful. A company recognized globally for its comprehensive portfolio of services, strong dedication to sustainability and good corporate citizenship, we have over 160,000 hard-working, respected employees serving clients across six continents. Together, we discover ideas and connect the dots to build a better and exciting new future. Wipro is looking for an Advanced Analytics professional with commercial acumen. You will have strong domain specific analytics experience in the Oil and Gas industry. You are currently performing in the Data science area Master’s in Business Engineering, Statistics, Operations Research or Computer Science Main responsibilities Every single day, you will champion Advanced Analytics solution consulting to engage with business function Guiding and educating the client on analytics adoption &amp; journey Conceptualize and drive development of Analytics solutions Lead Analytics consulting engagements You will have: A pedigree with Statistical Modelling, Strength in Data Prep, Visualization Experience Process Experience R Python SAS SQLAt Wipro, applicants are considered for employment solely on the basis of their qualifications and competencies. As an employee you will enjoy equal opportunity in all aspects of employment, including recruitment, training conditions of service and career progression. Furthermore, we are all committed to maintaining a workplace where each employee's privacy and personal dignity is respected and protected from offensive or threatening behaviour including violence and sexual harassment."}