{"job title": "Data Scientist", "company": "WorkFusion", "city state": "– New York", "rating": "3.5", "job description": "<div><strong>What we do</strong></div><div>WorkFusion creates technology that makes economies work. The rapid rise of AI and automation, along with the changing roles of people in the workforce, have created both complexity and opportunity for individuals, businesses and entire countries. Our companys purpose is to reduce this complexity and help our customers exploit the opportunity through products that pair people with intelligent software robots.</div><div>WorkFusion is headquartered on Wall Street in New York City with teams throughout the U.S., Europe and Asia.</div><br>\n<div><strong>Position</strong></div><div>We are looking for a creative data scientist with machine learning experience to join our team. You will help us develop and improve customized models and implement into production by working with software developers and machine learning engineers. You will collaborate closely with technologists and business stakeholders on the transition of your machine learning models into high value business applications.</div> \n<br>\n<div><strong>You will work on:</strong></div><div> Build and evaluate machine learning models to deliver use case requirements.</div><div> Use our Auto-ML framework and iteratively improve performance through new data representations, feature engineering and model optimization.</div><div> Implement analytical models into production by collaborating with software developers and machine learning engineers.</div><div> Communicate the analytic solution to stakeholders and provide improvements to clients operational systems.</div><div>This position requires expertise in acquiring, processing, analyzing and modeling of information from massive amounts of structured and unstructured data. A track record of data-driven implementation and strong experimental design cannot be overemphasized.</div> <div></div><div><strong>Qualifications/Experience</strong></div><div> 3+ years of experience using machine learning in an applied setting.</div> <div> Masters or PhD in a related field such as CS, Machine Learning, Statistics, Physics, etc.</div> <div> Excellent programming skills in Java or Python</div><div> The ability to work collaboratively and be a team player in a dynamic and fast paced environment.</div> <div> Clear oral, written and communication skills</div><div> The ability to think out of the box to combine multiple possibly unrelated solutions to solve a single complex problem</div><div>If you thrive on mastering new technical challenges and desire the opportunity to use your expertise to generate creative solutions to real-world problems, we want to hear from you!</div>"}