{"job title": "Data Scientist", "company": "Workday", "city state": "– USA, CA, San Francisco", "rating": "3.8", "job description": "<strong>Join our team and experience Workday!</strong>\n<br><br>\nIt's fun to work in a company where people truly believe in what they're doing. At Workday, we're committed to bringing passion and customer focus to the business of enterprise applications. We work hard, and we're serious about what we do. But we like to have a good time, too. In fact, we run our company with that principle in mind every day: One of our core values is fun.\n<br><br>\n<strong>Job Description</strong>\n<br><br>\nWorkday is seeking a curious, out of the box thinker and interdisciplinary data scientist to work as an applied machine learner and algorithm designer. You will bring your expertise to efficiently extract patterns and insights from millions of rows of transactional data to help optimize our workflow and come up with data-driven products using machine learning to help customers in optimizing their business.\n<br><br>\n<strong>About the Team</strong>\n<br><br>\nAs part of the Data Science team, you will partner directly with the core decision makers at Workday to help optimize customer experience and help answer business questions. You will work with some of the smartest data scientists to analyze user transaction data and build machine learning models to optimize search, recommendation and personalization across the suite of Workday products including HR, Financials, Payroll and others. You will work on delivering actionable insights and predictive models to help answer business questions around organizational and employee performance.\n<br><br>\n<strong>Responsibilities</strong>\n<br><br>\n• Proficient in translating unstructured business problems into an abstract mathematical framework.\n<br><br>\n• Excited to learn and apply new methodologies in the intersection of applied machine learning, computer science and statistics and make approximations where needed to build scalable algorithms.\n<br><br>\n• Excellent interpersonal and communication skills and ability to convey concise and actionable story through data to different parts of the company.\n<br><br>\n<strong>Requirements</strong>\n<br><br>\n• MS/PhD degree in Statistics, Computer Science, Operations Research or related field.\n<br><br>\n• 2+ years of work experience with proven track record of data science and/or algorithmic development.\n<br><br>\n• Proficiency in at least one high level programming language like Java, Scala, Python or C++.\n<br><br>\n• Experience in large scale data analysis in Pig, Hive or Spark is a plus.\n<br><br>\n• Proficiency in atleast one statistical modeling tools from among R, Matlab or Weka is a plus.\n<br><br>\n• Experience in predictive analytics and machine learning algorithms especially for supervised (e.g. SVM, Logistic Regression, Boosting) and unsupervised (e.g. k-means, LDA, EM) methods."}