{"job title": "Senior Data Scientist -", "company": "Workbridge Associates", "city state": "– Chicago, Illinois", "rating": "3.2", "job description": "<strong> Senior Data Scientist (Deep Learning, NLP, Computer Vision)</strong>\n<br><br>\nA Sports Analytics company located Downtown Chicago is looking to add a Senior Data Scientist to the team. The company is looking for a Senior Data Scientist that use Deep Learning and Computer Vision tools to work on a variety of projects. The Senior Data Scientist will be working using Basketball Analytics to support some of their clients which include Professional US teams, D1 College teams, High School and Youth teams.\n<br><br>\nIf youre a passionate Data Scientist with a love for Sports, join an innovative team that values employee and company growth!\n<br><br>\n<strong> Required Skills &amp; Experience</strong>\n<li> Bachelors or Masters Degree in Statistics or relevant field</li> <li> 4-7 years of Data Science Experience</li> <li> Heavy Machine Learning experience (Python, Pandas, NumPy, etc.)</li> <li> Professional Deep Learning Experience (Tensorflow, Keras, etc.)</li> <li> Professional Computer Vision Experience (OpenCV)</li>\n<strong> Desired Skills &amp; Experience</strong>\n<li> Exposure to AWS</li> <li> Experience building and deploying production ready code to AWS</li>\n<strong> What You Will Be Doing</strong>\n<br><br>\nTech Breakdown\n<li> 100% Machine Learning</li> <li> 100% AWS</li>\nDaily Responsibilities\n<li> 100% Hands On</li> <li> 100% Team Collaboration</li>\n<strong> The Offer</strong>\n<li> Competitive Salary: Up to $130K/year, DOE</li>\nYou will receive the following benefits:\n<li> Medical Insurance &amp; Health Savings Account (HSA)</li> <li> 401(k)</li> <li> Paid Sick Time Leave</li> <li> Pre-tax Commuter Benefit</li>\nApplicants must be currently authorized to work in the United States on a full-time basis now and in the future.\n<br><br>\nWorkbridge Associates, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) in major North American markets. Our unique expertise in todays highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients."}