{"job title": "Principal Data Scientist", "company": "Workbridge Associates", "city state": "– Philadelphia, Pennsylvania", "rating": "3.2", "job description": "Join one of the top pharmaceuticalpanies in the world develop a forecasting model to predict the emotional effects of prescribed narcotics. This is cutting-edge research that will change the way people view the importance of mental health and the way we perceive prescription drugs. One of their offices is in Radnor Pennsylvania and looking to hire a Principal Data Scientist to build out a team and take on this difficult challenge. They must have experience with designing optimization models, machine learning tools and implementing a Hadoop environment (Kafka is a plus).\n<br><br>\n<strong> Required Skills &amp; Experience</strong>\n<li> 3 or more years experience using Machine learning</li>  <li> Must have a Masters degree in biology</li>  <li> Extensive experience with optimization models</li>  <li> Working and implementing a Hadoop environment</li> <li> Experience with Python libraries (NumPy, SciPy, Pandas)</li>\n<strong> What You Will Be Doing</strong>\n<br><br>\nTech Breakdown\n<li> 30% Utilizing Machine Leaning processes</li> <li> 40% Neural Networks</li>  <li> 30% Scripting in Python</li>\nDaily Responsibilities\n<li> 50% Research and Development</li> <li> 20% Designing Optimization Models</li> <li> 30% Team Collaboration</li>\n<strong> The Offer</strong>\n<br><br>\nYou will receive the following benefits:\n<li> Medical Insurance &amp; Health Savings Account (HSA)</li> <li> 401(k)</li> <li> 20% Bonus Package</li> <li> Fully stocked cafeteria and kitchen</li> <li> Annual Christmas Ball</li> <li> 25 days of PTO</li> <li> Pre-taxmuter Benefit</li> <li> Bring your pet to work day</li>\nApplicants must be currently authorized to work in the United States on a full-time basis now and in the future.\n<br><br>\nThis position does not offer sponsorship.\n<br><br>\nWorkbridge Associates, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) across 11 major North American markets. Our unique expertise in todays highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients."}