{"job title": "Data Scientist", "company": "World Bank", "city state": "– Washington, District of Columbia", "rating": "3.8", "job description": "<div>Our team is looking for a <strong>Data Scientist</strong>. We are part of the central IT unit at the <strong>World Bank.</strong>\n<br><br>\n<strong>Qualification:</strong></div><strong>\n<br>\n</strong>\n\n<ul>\n<li>Master's degree in Engineering, Computer Science, Information Systems, Mathematics / Statistics, or related engineering, scientific or technical discipline or equivalent experience with 5 years relevant experience or Bachelors Degree with a minimum of 7 years relevant experience.</li><li>Experience using statistical languages (R, Python, SQL, etc.) to manipulate data and draw insights from large data sets.</li><li>Experience in data architecture, defining data retention policies, monitoring performance and advising any necessary infrastructure changes.</li><li>Experience with Web Services, including XML/JSON, SOAP, or RESTful.</li><li>Experience in Cloud Technologies such as AWS, Microsoft Azure Data Lake Storage (ADLS) and Azure Data warehouse (DW).</li><li>Experience working with major database platforms such as Oracle, SQL Server, PostgreSQL, or MySQL.</li><li>Demonstrated knowledge and experience in geospatial data and spatial modeling.</li><li>Knowledge of best practices for data standards, data management, data quality.</li><li>Experience in data architecture, defining data retention policies, monitoring performance and advising any necessary infrastructure changes.</li><li>Experience in the integration of published views/services with tools like Power BI, Tableau, and Microsoft technologies such as Analysis Services.</li><li>Ability to work independently and as part of a team.</li><li>Strong client engagement and negotiation skills to identify and prioritize the product demands.</li><li>Ability to learn new technologies quickly, self-starters and motivated, and able to work with others, and communicate effectively.</li><li>Proven ability to collaborate with other team members across boundaries and contribute productively to the team's work and output, demonstrating respect for different points of view.</li><li>Ability to use strong interpersonal and teamwork skills to cultivate effective, productive client relationships and partnerships across organizational boundaries.</li><li>Excellent communications skills (both written and verbal) in English.</li>\n</ul>\n\n<div><strong>Responsibilities:</strong></div><ul><li>The IT Officer, Business Solutions is primarily responsible for all data related contexts ranging across addressing small to large data sets, structured/unstructured including imagery data, extraction, transformation, curation, modeling, building data pipelines, identifying right tools, and writing code.</li><li>Participates in the feasibility analysis for new systems, tools, and applications supporting collection, management and discrimination of the Banks development data and geospatial solutions.</li><li>Connects and models complex distributed data sets to build repositories, such as data warehouses, data lakes, using appropriate technologies.</li><li>Designs and develops highly scalable and optimized data models. Applies data science methods to improve and optimize our clients performance needs, captures meaningful insights from data and turn them into competitive advantages.</li><li>Develops and supports mission-critical digital solutions in cloud environments that include analytics and big data solutions.</li><li>Partners with clients to model their data landscape, obtain data extracts and define secure data exchange approaches.</li><li>Contributes to the design, development, and documentation of assets within a Data Virtualization environment.</li><li>Integrate a diverse set of data into custom data solutions.</li><li>Determines approaches to successfully deliver data solutions in compliance with ITS Strategy, standards, and policies.</li><li>Plans and executes secure, good practice data integration strategies and approaches. This is a fantastic opportunity to be involved in end-to-end data management for cutting-edge Advanced.</li><li>Analytics and Data Science.</li><li>Participates in systems design and provide direction and guidance to the design team to define the product user experience.</li><li>Responsible to write user stories, functional requirements, technical requirements, acceptance criteria, product roadmap to describe solutions, the benefits and timeline in detail.</li><li>Owns the product roadmaps, including prioritization and scheduling process for the product from concept to design, prototype, testing, production and support.</li><li>Contributes to the move of already existing data applications and platforms to Cloud-based hosting solutions and consolidates the platforms appropriately.</li><li>Participates in systems integration efforts, executing as needed to integrate new applications into the installed base.</li><li>Performs coding and/or configuration to meet documented needs, utilizing standard procedures and techniques.</li><li>Researches new database technologies and recommends solutions to improve performance, scalability, and storage.</li><li>Successfully troubleshoots most applications problems independently.</li>\n</ul>"}