{"job title": "Senior Data Scientist", "company": "World Wrestling Entertainment", "city state": "– Stamford, CT", "rating": "3.1", "job description": "<p></p><p></p><p>The<b> Data Scientist (or Senior Data Scientist) </b>role will be instrumental in helping <b>WWE</b> continue its evolution into a data driven, analytics driven organization. The Data Scientist will execute analytical tasks such as model development, scoring, and deliverable production to support <b>WWE </b>decision makers. Projects/tasks will range from deep dives on specific topics, creation of analytical models, to building reports and dashboards with KPIs and trends. S/he will partner with business stakeholders through hands-on quantitative analytics of transactional and behavioral data.</p><p></p><p><b>Key Responsibilities:</b></p><ul><li>Drive end to end analytical process: from formulation of requirements, data acquisition, identification of analytical methods, creation/validation of models to business-friendly summarization of results</li><li>Develop predictive and descriptive models using advanced statistical, optimization, and big data techniques including: multivariate, regression, decision trees/classification, and time series</li><li>Supervise and mentor junior Data Scientists and Analysts and act a Team Lead</li><li>Identify critical questions to be answered and contribute to developing analytics-driven solutions and KPIs to enable more effective decision making</li><li>Conduct analysis and data modeling to draw insights that drive critical decision making and to uncover subscriber patterns, user content consumption, and customer behavior patterns</li><li>Create models, KPIs, and dashboards to operationalize outcomes of analytics</li><li>Monitor effectiveness of analytical models and ensure accuracy of all data from source to final deliverable through a systematic data quality control process</li><li>Work in complex data environment comprising several heterogeneous internal and third party data sources, manipulate large data sets and navigate a variety of servers, data types, and data structures to complete statistical and other analyses</li><li>Partner with business stakeholders to develop analytical insights, and with technology partners on self-serve delivery of dashboards and reports</li><li>Work with IT partners (e.g., data warehousing team) to design optimal data architecture for analytics and BI tools</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>At least 3 years of experience in marketing/sales analytics, segmentation and forecasting</li><li>At least 3 years of experience with a statistical analysis tool like R, SAS or SPSS</li><li>At least 2 years of experience performing data management, mining, and manipulation</li><li>At least 1 year of experience in on-shore/off shore delivery of analytics</li><li>Working knowledge of SQL and relational data model</li><li>Working knowledge of at least two technologies: Python, Big Query, Google Analytics, Spotfire or Tableau</li><li>Proficiency in a wide range of analytical methods including multivariate, time series, classification, and machine learning </li><li>Ability to translate quantitative results into clear and concise business presentations/reports using compelling data visualization techniques</li><li>Ability to write code to query and transform both unstructured and structured data</li><li>Proven track record of identifying and highlighting key insights, signals, and trends deep within the underlying data</li><li>Bachelor’s degree in Statistics/Mathematics, Econometrics/Economics, Engineering/Computer Science, Business/Finance, or related quantitative field</li><li>Advanced degree preferred</li></ul><p>_</p><p>WWE is an Equal Opportunity Affirmative Action employer and is subject to federal regulations pertaining to employment. WWE does not unlawfully discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, marital status, veteran status, or any other basis prohibited under federal, state or local laws governing non-discrimination in employment in every location in which the Company has facilities. WWE also provides reasonable accommodation for qualified individuals with disabilities in accordance with the Americans with Disabilities Act (ADA) and any other state or local laws. For information about Privacy and Information Security for WWE employment candidates, please review our Candidate Privacy Policy. For information regarding Terms and Conditions for this and other WWE websites, please review our Terms and Conditions of Use.</p>"}