{"job title": "Data Scientist", "company": "World Wrestling Entertainment", "city state": "– Stamford, CT", "rating": "3.1", "job description": "<p></p><p></p><p>The<b> Data Scientist </b>will be instrumental in helping WWE continue its evolution into a data driven, analytical culture. This role will support internal stakeholders through hands-on quantitative analytics, including, but not limited to, video streaming data; applying appropriate advanced analytics for key business initiatives; and automating the reports that are generated as a spinoff of findings.<br><br>This position will be based in our Stamford, CT headquarters, but there will be some flexibility to work out of our NYC office once fully up to speed and when face-to-face meetings are not scheduled and/or mandatory.</p><p></p><p><b>Key Responsibilities:</b></p><ul><li>Interact with stakeholders to identify critical questions that need to be answered in order for the Analytics function to provide effective KPI’s -- actionable insights, rather than just reports</li><li>Conduct analysis and data modeling to draw insights that drive critical decision making and to uncover subscriber patterns, user consumption, and behavior</li><li>Analyze data to identify outliers, missing, incomplete, and/or invalid data</li><li>Ensure accuracy of all data from source to final deliverable by creating automated quality checks</li><li>Assist in the coordination of data collection from various sources which may include contacting various groups outside the company to resolve questions, inconsistencies, and/or obtain missing data</li><li>Assist in the development of analytic tools, KPIs, dashboards, and systems to help build out the analytics platform</li><li>Create, automate, and maintain reports and visualizations (e.g., behavioral trends across customer segments, global consumption of VOD and live stream, digital media attribution, etc.)</li><li>Work with data warehousing team to design optimal data architecture for BI tools</li><li>Work as a client contact for analytics, partnering with various departments to identify priority dashboards and reports to better serve the company</li><li>Design and build dashboards and automated reports with embedded visualizations</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>Minimum of 4 years of experience</li><li>Proven track record of identifying and highlighting key insights, signals, and trends deep within the underlying data</li><li>Well-rounded individual with the ability to write code to query and transform both unstructured and structured data</li><li>Experience publishing reports using visualization and presentation tools</li><li>Should enjoy generating actionable insights by mining and modeling data and be passionate about answering challenging questions and telling stories with data and visualizations</li><li>Self-motivated, attentive to detail, and driven to continuously improve analytics skill set</li><li>SQL, SAS, Python, Big Query, Google Analytics, Excel, and Tableau</li><li>SPSS and/or R</li><li>Bachelor degree in Mathematics, Statistics, Econometrics, Actuarial Science or related quantitative discipline</li></ul><p>_</p><p>WWE is an Equal Opportunity Affirmative Action employer and is subject to federal regulations pertaining to employment. WWE does not unlawfully discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, marital status, veteran status, or any other basis prohibited under federal, state or local laws governing non-discrimination in employment in every location in which the Company has facilities. WWE also provides reasonable accommodation for qualified individuals with disabilities in accordance with the Americans with Disabilities Act (ADA) and any other state or local laws. For information about Privacy and Information Security for WWE employment candidates, please review our Candidate Privacy Policy. For information regarding Terms and Conditions for this and other WWE websites, please review our Terms and Conditions of Use.</p>"}