{"job title": "Data Scientist", "company": "Wpromote", "city state": "– El Segundo, CA", "rating": "4.4", "job description": "<strong>About Wpromote</strong>\n<br><br>\nHere at Wpromote, one of the nations leading digital marketing firms, we invite you to Think Like A Challenger and push our clients to take on the 800 lb. gorillas of their industries. Our crew of 300+ digital marketeers breathes in marketing and exhales ROI, and we challenge our clients and ourselves each and every day to surpass yesterdays expectations! Our award-winning campaigns have helped hundreds of companies from startups to Fortune 500 brands thrive. If youve heard of Toyota, Verizon, Forever 21, Marriott, Wienerschnitzel, or Papyrus youve heard of our clients. And we want you to join us in making our clients even better.\n<br><br>\n<strong>The Perks</strong>\n<br><br>\nIf youre not already convinced, our amazing perks have made us one of the Best Places to Work in the US two years running according to Ad Age, and one of Los Angeles best places to work 5 years in a row. Heres why:\n\n<ul>\n<li>80% coverage of basic medical, vision, and dental insurance.</li>\n<li>Traditional 401k and/or Roth 401k matching.</li>\n<li>Quarterly team social events, birthday celebrations, chili cook offs, holiday half days and summer half day Fridays, and more.</li>\n<li>Yoga sessions once a week to help you de-stress and recharge. Stretch it off; its the new norm.</li>\n<li>Generous PTO and an innovative Work From Anywhere policy that gives our employees freedom to stretch their wings - and catch the cable guy.</li>\n<li>Coffee, tea, juice, and cereal. A vending machine that has every snack imaginable.</li>\n<li>Fresh fruit Mondays, Veggie Tuesdays, Yogurt Wednesdays, Throwdown Thursdays, and Bagel Fridays!</li>\n<li>Dog friendly office. Seriously.</li>\n<li>Beautifully designed and modern office: standing desks, outdoor seating, courtyard, and breakout rooms.</li>\n<li>Break time: ping-pong, shuffleboard, and Bocce ball. Any time is break time.</li>\n<li>But wait, we have more! We have electric full body massage chairs so you can work while getting a massage.</li>\n</ul>\n<strong>You Will Be</strong>\n\n<ul>\n<li>Interfacing with business and engineering stakeholders to define projects</li>\n<li>Performing hypothesis-driven statistical analysis and communicate results</li>\n<li>Conducting deep and continuous exploration of heterogeneous data</li>\n<li>Building models for time series forecasting, supervised and unsupervised machine learning, and optimization</li>\n</ul>\n<strong>You Must Have</strong>\n\n<ul>\n<li>At least 1 year of experience applying data science to business problems</li>\n<li>A minimum of a Bachelors degree (advanced degree preferred) in statistics, applied math, engineering, computer science, physics, or any other quantitative field</li>\n<li>Working knowledge of digital marketing, along with a passion for driving business value</li>\n<li>Deep understanding of experimental design and statistics</li>\n<li>Top-notch analysis skills and the ability to explore complex data sets and extract insights</li>\n<li>Experience working in SQL, along with Python or R</li>\n</ul>\nThis employer participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S. If E-Verify cannot confirm that you are authorized to work, this employer is required to give you written instructions and an opportunity to contact Department of Homeland Security (DHS) or Social Security Administration (SSA) so you can begin to resolve the issue before the employer can take any action against you, including terminating your employment. Employers can only use E-Verify once you have accepted a job offer and completed the Form I-9. For more information on E Verify, or if you believe that your employer has violated its E-Verify responsibilities, please contact DHS."}