{"job title": "Data Analyst", "company": "WPS Health Solutions", "city state": "– Madison-Wisconsin-United States", "rating": "2.5", "job description": "<p><strong>Who We Are</strong></p><p>We are a leading not-for-profit health insurer in Wisconsin, and our services have grown to reach active-duty and retired military personnel, seniors, and families in Wisconsin, across the U.S., and around the world. Learn more!</p><p>WPS receives World's Most Ethical Company Award for 9th Year in a Row<strong><em> </em>- </strong><strong>2018 Most Ethical Companies Announcement</strong></p><p><strong>At Our Core</strong></p><p>WPS Health Solutions has earned a reputation as a leader in the insurance and benefits administration industry through our commitment to excellence and high-quality service. Our corporate values reflect the core of who we are and how we conduct business every day.</p><div> <p><strong>Customer Focused</strong></p><p><strong>I recognize how my actions impact internal and external customers</strong> by being responsible for the customer experience. I look beyond the immediate issue to recognize and solve the problem.</p> <p><strong>Individual Responsibility</strong></p><p><strong>I own my actions.</strong> I am accountable and dedicated to achieving the best results for WPS Health Solutions and our customers. I embrace my role in helping the company achieve a high-performance workplace.</p> </div><div> <p><strong>Mutual Respect</strong></p><p><strong>I lead by example and act ethically, honestly and am trustworthy.</strong> I show appreciation for others by giving and taking constructive feedback and encouragement. </p> <p><strong>Driven and Passionate</strong></p><p><strong>I approach my work with enthusiasm, and personal commitment to the success of our business.</strong> I keep the importance of the work we do for our customers alive in my attitude and interactions with others, and demonstrate pride in the worthiness of our purpose.</p> </div><p><strong>Position Summary</strong></p><p>The<strong>Data Analyst</strong> conducts data analysis to identify existing and future areas of fraud, abuse, and waste in Medicare. You will have responsibilities include analyzing, interpreting, and visualizing claims and clinical data from various sources and recommending best approaches for intervention.</p><p><strong>In this role you will:</strong></p><p><strong>Data Analysis&amp; Reporting (65%)</strong></p><ul><li>Interpret and analyze clinical data from various sources and recommend best approach. Perform data analysis to identify aberrant trends and providers for potential corrective actions or focus areas impacting the Medicare Trust Fund, including potential overpayments.</li><li>Oversee stored, maintenance, and proactive reporting (including monthly, semi-annual, and yearly reporting requirements).</li><li>Manage project timelines to ensure that internal and external requests are completed on time and in accordance with contract requirements.</li><li>Present data findings at various internal and external meetings to various levels of staff and collaborate on outcomes.</li><li>Keep current with industry analytic topics and proficiency with business intelligence tools.</li></ul><p><strong>Administration and Management (35%)</strong></p><ul><li>Support and participate in workgroup meetings and represent WPS as a claim data expert in litigation and fulfill any law enforcement/litigation requests.</li><li>Fulfill CMS Technical Direction Letter (TDL) and Change Requests (CR).</li><li>Identify and recommend additional opportunities for data extraction and analysis or process improvement.</li></ul><p><strong>You should have:<br></strong></p><ul><li>Bachelor’s degree in Healthcare Informatics, Statistics, Economics, Mathematics, Computer Science or related field OR equivalent post high school education and/or work-related experience</li><li>1 or more year of experience with business intelligence/analytic tools or programming languages (e.g., R, Python, SAP Business Objects, SAS, SQL), interpreting analytic results and creating summarizations for presentations</li></ul><p><strong>In addition, we prefer:</strong></p><ul><li>Exposure to evaluation of both clinical and business processes</li><li>Experience with Medicare, Medicaid, TRICARE, VA, or Healthcare claims</li><li>Professional healthcare analytic experience</li></ul><p> </p><p><strong>Stay connected: Join ourTalent Community! </strong></p><p><strong>FOLLOW US!</strong></p><p><strong>Facebook</strong></p><p><strong>Twitter</strong></p><p><strong>LinkedIn</strong></p>"}