{"job title": "Risk Data Analyst", "company": "WSECU", "city state": "– Olympia, Washington", "rating": "4.4", "job description": "We look forward to reviewing your application!All applicants must include a resume.\n<br>\nVisa sponsorship not available.\n<br>\nContact us at 1-800-562-0999 ext. 11111 with any questions.We are an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, national origin, ancestry, sex, age, physical or mental disability, veteran or military status, genetic information, sexual orientation, gender identity, marital status, or any other legally recognized protected basis under federal, state or local law.<br><br><strong> Risk Data Analyst</strong>\n<br><br>\nAs the Risk Data Analyst you’re responsible for strategies, organization, and execution of fraud prevention investigations and functions for the credit union. You’re ensure our fraud prevention initiatives align with business objectives throughout the organization.\n<br><br>\nYou accurately interpret transactional patterns, implement correlation analysis of the data, and determine unusual member behavior in transactional activity, recommending effective risk mitigation strategies. You also create ad-hoc queries and reports, manage emerging trends, and provide ongoing department reporting and analytical support.\n<br><br>\n<strong>Your day may include:</strong>\n<ul>\n<li>Assuring quality member service through responsive and positive interaction with members, staff, vendors and outside parties</li> <li>Resolving problems, exercising sound judgment and supporting employee efforts to offer empowered solutions</li><li>Analyzing member account activity and working alerts generated by the system, using a variety of tools to detect potential suspect or fraudulent transactions</li> <li>Taking decisive action to mitigate risk and loss to WSECU and/or members</li><li>Creating ad-hoc queries and reports to identify transactional patterns</li><li>Monitoring existing fraud strategies to ensure they meet expected results; implementing new fraud strategies</li><li>Developing mitigation strategies to address risk</li><li>Investigating and analyzing outside trends, tendencies, best practices and events to improve WSECU’s risk management practices</li><li>Handling the merging of data in multiple databases for performance of risk data analysis; maintaining database repository and tools</li><li>Serves as a resource for credit union staff and members for all department-related initiatives by maintaining cross-training routines for all core department functions</li>\n</ul>\n<strong>What you bring to the team:</strong>\n<ul>\n<li>Two (2) years’ practical experience with a credit union or financial institution’s operating areas, functions, products and services</li><li>Two (2) years’ experience with research and analytical functions, interpreting transaction patterns and implementing correlation and analysis of data to identify activity, behaviors and trends</li><li>Strong operational problem solving skills; intellectual curiosity and a need to continually improve on processes</li><li>Understanding of, or experience with, data analytics, Database Management Studio and writing queries</li><li>Ability to effectively utilize techniques to derive data required from WSECU’s data depositories</li>\n</ul>\n<strong>Bonus points if you have:</strong>\n<ul>\n<li>Proven experience with fraud claims investigations and cardholder activity review and analysis</li> <li>Proven experience using ARCU and Tableau to interact with data with the ability to combine for impact</li> <li>Experience with Symitar and VISA DPS processing services and reporting functions.</li><li>Experience with SQL</li>\n</ul>\nInd1"}