{"job title": "Senior Data Analyst", "company": "Wunderman", "city state": "– US-DC-Washington, DC", "rating": "3.7", "job description": "Overview<br><br>With a growing portfolio of top-tier clients, <strong>Wunderman</strong> specializes in designing consumer-centric strategies focused on combining creative with data to build valuable relationships between consumers and brands.\n<br><br>\nWe are seeking a dynamic <strong>Senior Analyst</strong> to oversee, nurture and continue to build some of our fastest growing clients. This is an exciting opportunity to lead, leverage and deliver powerful solutions across the full spectrum of data, creative, technology, and marketing services, in order to help our clients maximize the opportunities provided by our integrated offering.<br><br>Responsibilities\n\n\n<ul>\n\n <li>Helping drive the targeting and campaign measurement for consumer digital marketing programs.</li>\n<li>Developing tagging instructions for website development and campaign tracking codes for digital media assets</li>\n<li>Developing and publishing integrated reporting dashboards, including interfacing with media partners to consolidate measurement reporting across all digital channels.</li>\n<li>Providing test design and implementation. Including A/B and multivariate testing</li>\n<li>Ability to develop data driven targeted and segmented contact strategies</li>\n<li>Proficient in digital analytics, including web analytics with tools like Adobe Analytics, Google Analytics and Webtrends</li>\n<li>Experienced in digital test design and implementation with current digital targeting tools (Adobe, Webtrends, X+1, etc.)</li>\n<li>Develop integrated reporting dashboards using data visualization tools like Spotfire, Crystal Xcelcius, Tableau</li>\n<li>Provide digital asset tagging instructions for website development and digital adverting content</li>\n<li>Understanding of the analytics discipline: including process, best practices, tools and techniques</li>\n<li>Solid presentation and client facing skills</li>\n<li>Excellent project management and implementation skills</li>\n<li>Service/client oriented</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Versed in a range of industries, pharmaceutical and/or healthcare experience a plus</li> \n</ul>\nWunderman is an equal opportunity employer M/F/D/V. We are proud of our diversity!<br><br>Qualifications<br><br><strong>What experience you’ll need</strong>\n\n<ul>\n\n <li>BA/BS degree required; MBA a plus</li>\n<li>3 - 5 years of experience in digital marketing analytics and database marketing</li>\n<li>Digital analytics (Adobe, Google Analytics, Webtrends, DoubleClick, Atlas, etc.), digital tag management</li>\n<li>Digital analytics experience with Adobe/Ominture suite is a requirement</li>\n<li>Data visualization dash boards</li>\n<li>Social media analytics</li>\n<li>A/B and multivariate testing</li>\n<li>SAS and/or SQL a plus</li>\n</ul>\nWunderman is <em>Creatively Driven. Data Inspired</em>. A leading global digital agency, Wunderman combines creativity and data into work that inspires people to take action and delivers results for brands. In 2015, industry analysts named Wunderman a leader in marketing database operations as well as a strong performer in customer engagement strategy. Headquartered in New York, the agency brings together 7,000 creatives, data scientists, strategists and technologists in 175 offices in 60 markets. Wunderman is a WPP company (NASDAQ: WPPGY). For more information, please visit www.wunderman.com and follow us @Wunderman."}