{"job title": "Research Scientist - Xilinx Labs", "company": "Xilinx", "city state": "– San Jose, CA", "rating": "3.8", "job description": "<strong>Description</strong>\n<br><br>\nXilinx develops\n<br>\nhighly flexible and adaptive processing platforms that enable rapid innovation\n<br>\nacross a variety of technologies - from the endpoint to the edge to the cloud.\n<br>\nXilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP\n<br>\n(Adaptive Compute Acceleration Platform), designed to deliver the most dynamic\n<br>\nprocessor technology in the industry and enable the adaptable, intelligent and\n<br>\nconnected world of the future in a multitude of markets including Data Center\n<br>\n(Compute, Storage and Networking); Wireless/5G and Wired Communications;\n<br>\nAutomotive/ADAS; Emulation &amp; Prototyping; Aerospace &amp; Defense;\n<br>\nIndustrial Scientific &amp; Medical, and others. Xilinx's core strengths\n<br>\nsimultaneously address major industry trends including the explosion of data,\n<br>\nheterogeneous computing after Moore's Law, and the dawn of artificial\n<br>\nintelligence (AI).\n<br><br>\nOur global team is growing and we are looking for bold, collaborative and\n<br>\ncreative people to help us lead the industry transformation to build an\n<br>\nadaptable intelligent world. We believe that by embracing diverse ideas,\n<br>\nstriving for excellence in all that we do, and working together as a unified\n<br>\nteam, we can accomplish anything. Come do your best work and live your best\n<br>\nlife as part of the ONEXILINX team!\n<br><br>\n<strong>Xilinx Research</strong> is working on advanced applications, tools and architectures for the next generation technology of Xilinx.\n<br><br>\nIn our Research Labs, we have an opening for a <strong>Research Scientist</strong> in the field of design methodologies or programming models for computer vision or machine learning applications on future chip architectures.\n<br><br>\nThe research activities (<strong>Responsibilities</strong>) include:\n\n<ul>\n<li>Proposing and applying innovative concepts,</li> \n\n<li>Developing prototypes and making them available to early adopters</li>\n<li>Convincing teams in the (product) engineering teams to see the benefits of these contributions</li>\n<li>Work well in teams that include multiple locations, including in the USA and Europe.</li>\n</ul><br>\n<div>We are looking for an energetic candidate with the following <strong>Qualifications:</strong>\n\n<ul>\n<li>PhD or MSc in Computer Science or Electrical Engineering, or equivalent.</li>\n<li>Experience in programming complete applications on either embedded systems or cloud computing based infrastructure. This can range from image processing on embedded systems to machine learning on cloud based infrastructure.</li>\n<li>Understanding of at least one of the following applications in detail: Image processing, machine learning or digital signal processing applications</li>\n<li>Demonstrated capability of innovative thinking. This can include publications in conferences or patents. First author is recommended.</li>\n<li>Good understanding of modern programming concepts. This includes at least one of the following: programming in Python, Java, C++, or OpenCL. Demonstrated experience of working in teams.</li>\n<li>Experience in programming FPGA based platforms is a benefit.</li>\n<li>Good presentation skills of technical material.</li>\n<li>Basic understanding of computer architecture or processor architecture.</li></ul></div>\n<br>"}