{"job title": "Machine Learning Engineer", "company": "Xilinx", "city state": "– San Jose, CA", "rating": "3.8", "job description": "<strong>Description</strong><br><br>Xilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies - from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP (Adaptive Compute Acceleration Platform), designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future in a multitude of markets including Data Center (Compute, Storage and Networking); Wireless/5G and Wired Communications; Automotive/ADAS; Emulation &amp; Prototyping; Aerospace &amp; Defense; Industrial Scientific &amp; Medical, and others. Xilinx's core strengths simultaneously address major industry trends including the explosion of data, heterogeneous computing after Moore's Law, and the dawn of artificial intelligence (AI).<br>\n\n<div>Our global team is growing and we are looking for bold, collaborative and creative people to help us lead the industry transformation to build an adaptable intelligent world. We believe that by embracing diverse ideas, striving for excellence in all that we do, and working together as a unified team, we can accomplish anything. Come do your best work and live your best life as part of the ONEXILINX team!</div> <br>\nDescription \n\n\n<li>You will be part of an R&amp;D team that develops high-performance low-power FPGA acceleration hardware and software. This position focuses on designing algorithm and infrastructure for high-performance FPGA accelerator for well-known software stacks in the area of Machine Learning.\n<br><br>\nYou will work on projects critical to Xilinx's growth, with opportunities to move among various teams and projects. You are versatile, display leadership qualities and are enthusiastic to tackle new problems across the full-stack as we continue to push technology forward. Most of all, you are driven to find creative solutions where solutions may not exist yet.\n<br><br>\nResponsibilities\n<br><br>\n• Design and develop FPGA-accelerated Machine Learning solutions\n<br><br>\n• Enable FPGA acceleration of open source deep learning frameworks like: Caffe, MxNet, and Tensorflow\n<br><br>\n• Design and modify machine learning models: reduce computational complexity by model optimization, computation using lower precision arithmetic, data flow reordering for memory bandwidth optimizations\n<br><br>\n• Work closely with customers to port their deep learning requirements to FPGA</li>\n<br><br>\nMinimum Qualifications\n<br><br>\n• MS/Ph.D. degree in Electrical Engineering or Computer Science or BA/BS degree in Electrical Engineering or Computer Science with 2+ years of industry experience\n<br><br>\n• Solid foundation in data structures, computer arithmetic, algorithms and software design with strong analytical and debugging skills\n<br><br>\n• Good understanding of common families of Machine Learning models and Machine Learning infrastructure\n<br><br>\nPreferred qualifications\n<br><br>\n• Experience with implementing machine learning computation framework on GPU, CPU or FPGA\n<br><br>\n• Experience with developing acceleration application using OpenCL or CUDA\n<br><br>\n• Experience with internals of one of more frameworks like Caffe, MxNet or Tensorflow\n<br><br>\n• Solid engineering and coding skills. Ability to write high-performance production quality code. Experience in C++, Python, and other equivalent languages is a plus\n<br><br>\n• Experience or coursework in FPGA Digital Design or EDA optimization tools"}