{"job title": "Data Scientist / Data Engineer (Remote)", "company": "XLFN Consulting", "city state": "– Denver, Colorado", "rating": "5.0", "job description": "XLFN Consulting provides large organizations with access to exceptional talent and job seekers with the opportunity to work on interesting projects at leading organizations.\n<br><br>\nWe are looking for an analytics developer with strong skills in integration of complex and interactive visualizations/analytic solutions, cloud computing and data management.\n<br><br>\nNo agencies or firms please. No C2C.\n<br><br>\nRemote work is available for this role.\n<br><br>\n<strong>Required Characteristics:</strong>\n<ul>\n<li>BS in Computer Science or equivalent field</li><li>Proficiency with Python, R, MySQL, and MS SQL</li><li>Working knowledge of Linux systems and relational databases</li><li>Experience with interactive visualization development using Python and R/Shiny</li><li>5+ years of Cloud Experience (including Azure and Google Cloud)</li><li>5+ years of experience integrating front and back-end technologies to create modern and secure interactive analytic tools and visualizations</li><li>Strong interpersonal, oral, and written communication skills</li><li>Ability to build and maintain relationships with customers and colleagues</li>\n</ul>\n<strong>Valued Characteristics:</strong>\n<ul>\n<li>Intellectually curious, passionate, and inventive</li><li>Experience with Shiny, Shiny Server, R-Studio Connect, Shiny Proxy, and / or PowerBI</li><li>Experience with Jenkins software development automation server</li><li>Experience building installation, configuration, administration, reporting of Atlassian tools Jira, Confluence, Bitbucket/Stash/GitHub</li><li>Experience with and willingness to support project management, Agile and documentation in Jira</li><li>MS/Ph.D in Computer Science or equivalent field from a high ranking university</li>\n</ul>\nJob Types: Full-time, Contract\n<br><br>\nExperience:\n<ul>\n<li>Python and / or R: 3 years (Preferred)</li><li>integrating front and back-end technologies: 5 years (Preferred)</li><li>Azure and Google Cloud: 5 years (Preferred)</li><li>interactive visualization development using Python &amp; R/Shiny: 3 years (Preferred)</li><li>relational database: 3 years (Preferred)</li>\n</ul>\nEducation:\n<ul>\n<li>Bachelor's (Required)</li>\n</ul>\nWork authorization:\n<ul>\n<li>United States (Required)</li>\n</ul>"}