{"job title": "Data Scientist", "company": "XPO Logistics", "city state": "– High Point, NC", "rating": "3.7", "job description": "<div><strong>Logistics done differently.</strong>\n<br><br>\nAt XPO Logistics, we know that the ability to capture and analyze data will help us to transform the logistics industry which means we need highly skilled people who love data. As the Data Scientist, you will be responsible for data wrangling, advanced programming, and statistical analysis (machine learning and data mining). We need you to take complex data, analyze it, draw meaningful conclusions, and communicate the findings in a manner that can be easily understood. In this role, you have the ability to positively affect XPO’s future through advice and counsel.\n<br><br>\n<strong>Pay, benefits and more.</strong>\n<br><br>\nWe are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability, and the opportunity to participate in a company incentive plan.\n<br><br>\n<strong>What you’ll do on a typical day:</strong>\n<ul>\n<li>Work with leadership to understand needs and align those to potential data and analytics efforts</li><li>Gather and integrate data from various sources for use in advanced analytics efforts</li><li>Identify, analyze, and interpret trends, patterns, and relationships in complex data sets using advanced analytics tools and models</li><li>Prepare findings in a professional manner, presenting on results and providing actionable recommendations to leadership</li><li>Promote a data-driven culture through ongoing partnership and dialog with the business</li>\n</ul>\n<strong>What you need to succeed at XPO:</strong>\n<br><br>\nAt a minimum, you’ll need:\n<ul>\n<li>Bachelor’s degree in Statistics, Mathematics, Data Science, Economics, Physics, or analytics related field</li><li>1 year of experience in quantitative analytics</li><li>Proficiency with Microsoft Office (Word, Excel, and Power BI), D3.js, Python, and R</li><li>Strong knowledge of database design, data models, and integration/extraction technologies</li><li>Strong knowledge of statistics and experience using statistical modeling (logistic regression, SVMs, etc.) to solve business problems</li><li>Knowledge of statistical modeling techniques: Linear/logistic regression (including advanced predictor selection techniques), classification (decision trees, random forests), Support Vector Machines (SVMs), neural networks, etc.</li>\n</ul>\nIt’d be great if you also have:\n<ul>\n<li>Master’s degree in data science or related field</li><li>5 or more years of experience in quantitative analytics</li><li>Experience with text analytics (e.g. semantic analysis)</li><li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate information with attention to detail and accuracy</li>\n</ul>\n<strong>Be part of something big.</strong>\n<br><br>\nXPO provides cutting-edge supply chain solutions to the world's most successful companies, including Disney, Pepsi, L'Oréal, Toyota and many others. We’re the fastest-growing transportation company on the Fortune 500 list and we’re just getting started.\n<br><br>\nWe are proud to be an Equal Opportunity/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran, or other protected status.\n<br><br>\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed.</div>"}