{"job title": "Engineering - Data Science Engineer", "company": "Xyntek, Inc", "city state": "– Newtown, PA", "rating": "4.7", "job description": "<strong>Position: Data Science Engineer</strong>\n<br><br>\n<strong>Location: Pennsylvania **can work remote if out of state**</strong>\n<br><br>\n<strong>Type: Full Time</strong>\n<br><br>\n<strong>Min. Experience: Mid-Level Experience</strong>\n<br><br>\nXyntek is seeking entrepreneurial, dedicated, and motivated employees that are interested in joining a fast-paced Engineering &amp; Technical Integration Services Team. The ideal candidates will be involved in all aspects of Big Data projects ranging from defining requirements and design activities to hands on integration activities.\n<br><br>\n<strong>General Responsibilities:</strong>\n<br><br>\nThe ideal candidate will have a proven track record of project success and is able to follow instructions unsupervised and address highly-technical issues in a timely manner.\n<br><br>\nThe Data Science Engineer will combine their technical and analytical knowledge to carry out the responsibilities of this role. We are looking for a Data Scientist that can help us discover the information hidden in vast amounts of data to help the company make smarter decisions when delivering products or solutions.\n<br><br>\n<strong>Project Responsibilities:</strong>\n\n<ul>\n<li>Development, construction, maintenance, and testing of architectures such as databases and large-scale processing systems;</li>\n<li>Data mining using state-of-the-art methods;</li>\n<li>Evaluate big data solutions within the organization;</li>\n<li>Creating various Machine Learning-based tools or processes within the company and perform statistical analysis;</li>\n<li>Work cross-functionally with smaller teams while multi-tasking unrelated work.</li>\n</ul>\n<strong>Required Qualifications:</strong>\n\n<ul>\n<li>Masters or Bachelors degree in Data Science Engineering, Bioengineering, or Bioinformatics</li>\n<li>5+ years' of Pharmaceutical Manufacturing Experience</li>\n<li>Experience with Execution Systems [ISA-88/ISA-95]</li>\n<li>DevOps AWS Certifications and/or Azure Certifications</li>\n<li>SCM Automation</li>\n<li>JAVA certification and/or at least 5+ years experience using Java in Pharma Progressive proficiency across technology stacks in current use</li>\n<li>Ability to follow detailed technical instructions and work unsupervised in agile-based SDLC using industry-standard work patterns</li>\n<li>Able to write/maintain short execution scripts for services in an array of technology environments</li>\n<li>In-depth knowledge of Data Science including simple-to-complex Data Structures in a 'Big Data' Environment [100's TB - 10's PB range]</li>\n<li>Excellent Technical Writing and Communication skills</li>\n<li>Ability to respond quickly to address issues</li>\n</ul>\n<u><strong>About Xyntek:</strong></u>\n<br><br>\nEstablished in 1986, Xyntek, Inc. is an Information Technology and Automation Systems Engineering Consulting, Design, Development, and Implementation firm. Our solutions and services are provided to Fortune 100 companies within various industries, including:\n\n<ul>\n<li>Pharmaceutical / Biotech</li>\n<li>Medical Device</li>\n<li>Healthcare (Hospital IT)</li>\n<li>Government and Department of Defense (DOD)</li>\n</ul>\nAt Xyntek, employees are our most valuable resources, and an integral part of our success. We work hard and play to win. Xyntek offers excellent benefits, competitive salaries, and a high energy work environment. Benefits include:\n\n<ul>\n<li>Health plan insurance plan covers (medical, dental, &amp; vision). Plan is 100% paid by the company;</li>\n<li>401K with company match &amp; profit sharing. Fully vested after one year of full time employment;</li>\n<li>Paid vacations &amp; holidays equivalent to one month's salary;</li>\n<li>100% company paid lunches when working in the office;</li>\n<li>100% company paid expenses for attendance at professional conferences and events;</li>\n<li>100% company sponsored social gatherings &amp; events;</li>\n<li>Annual performance based raises &amp; bonuses;</li>\n<li>Engineering mentorship programs;</li>\n<li>Fast track technical &amp; management career growth.</li>\n</ul>\n<em>Xyntek is an Equal Opportunity Employer with a strong commitment to supporting and retaining a diverse and talented workforce.</em>"}