{"job title": "Data Scientist", "company": "Yablon &amp; Associates", "city state": "– New York, NY", "rating": "NA", "job description": "DATA SCIENTIST - New York - New York CityJob Category: Information Technology - Business Intelligence - Data Science Unfortunately we are unable to sponsor Visas or work with third parties for this position Join the Data Science Artificial Intelligence team at New York s #1-ranked healthcare provider This major healthcare provider in New York is now leveraging the most innovative and transformative technologies to provide the highest quality care. This is your opportunity to provide world class technology solutions that will directly impact the quality of a patient s life. Thrive in our fast-paced environment, as you lead enterprise-wide implementation of AI. Join and collaborate with a tight-knit team of creative and ambitious data analysts, engineers, and developers, working on the most important enterprise initiatives in our healthcare system. You will be a critical part of building the future, as integrating of A.I. into all aspects of healthcare delivery and make a huge positive impact on patient lives. Artificial Intelligence team is seeking an innovative, results-oriented Data Scientist to support, enhance, and expand artificial intelligence program in redefining company s healthcare delivery operations. Company s mission is to enhance healthcare delivery through integration of machine learning, extracting knowledge from millions of data points from the electronic medical record and clinical documents to generate actionable insights for our clinical, operational, and enterprise teams.As a critical member of our A.I. deployment team, you will oversee machine learning algorithm generation and be responsible for establishing and maintaining a quality pipeline of models. Working with senior executives and clinical leadership, you will have a prominent voice in shaping strategic decisions and process redesign across the enterprise. Preferred Criteria for the Data Scientist positionPh.D. in Computer Science, Bioinformatics, Physics, Mathematics, or other data science related field. Bachelor's is required.Demonstration of predictive modeling, hypothesis testing, and rapid prototyping in machine learning or data scienceDemonstration of performance improvement or process redesignExperience in neural network frameworks and modelingExperience in natural language processingPrevious work related or research experience in algorithm design or analytics related to operational or business problemsExperience working with large datasets in SQL or NoSQL databasesProficiency in data-science related languages and packages (python, R, Tensorflow, etc.)Proficient in data analytics and engineering, able to clean, transform, and merge dataStrong background in statistics methodology Required Criteria for the Data Scientist positionBachelor s degree in Computer Science/related discipline or related work experience six to eight yearsSix to eight years of related work experience - provided by Dice Data Science, SQL, Python,Tensorflow, statistics, data analytics,statistics, machine learning, algorithm, machine learning\n<br>\nAssociated topics: data administrator, data architect, data manager, data scientist, database, database administrator, etl, erp, mongo database administrator, sybase"}