{"job title": "Data Scientist", "company": "Yale University", "city state": "– New Haven, CT", "rating": "4.3", "job description": "Essential Duties\n<br><br>\nThe Data Scientist will function in a multidisciplinary team environment, providing comprehensive machine learning data analysis with a focus on deep learning methods for multiple clinical and epidemiological studies of cardiovascular outcomes research conducted by investigators at the Center for Outcomes Research and Evaluation (CORE). This role involves planning, development, and implementation of methodology for specific research projects.\n<br><br>\nUnder the direction of the Principal Investigator and Program Co-Director, the ideal candidate will perform a variety of duties involving the application of machine learning skills to the analysis of research studies, and will work as a member of a research team to provide input in the design of study, perform data analysis, and lead or assist drafting analytical sections for peer-review publication for various projects. The candidate is expected to lead several efforts for which recent deep learning methods are appropriate, and for which large amounts of complex data are available. All research and programming code must be regularly documented and archived per best practices. Responsibilities will also include participating in the design, implementation, and maintenance of high performance computing (HPC) environments with graphical processing units (GPU) for accelerated deep learning computation. General responsibilities of the Data Scientist will be to coordinate and lead regular meetings that include agenda and materials preparation as well as meeting minute documentation, and to develop and manage timelines and research activities for research projects to ensure project goals and deliverables are met. The Data Scientist will communicate information and data in written and verbal form to colleagues as well as project and senior management teams. The individual will also be responsible for contributing to the development of training and presentation materials and assisting with the planning and coordination of training and seminars.Develop and execute new and/or highly complex algorithms and statistical predictive models and determine analytical approaches and modeling techniques to evaluate potential future outcomes. Establish analytical rigor and statistical methods to analyze large amount of data, using advanced statistical techniques and mathematical analyses. Manage analytical projects from data exploration, model building, performance evaluation, through implementation. Develop work plans and monitor progress and project timelines. Document coding and changes to work plans using established work group methods in GitHub. Interact with a multidisciplinary team of internal and external peers to regularly, effectively, and openly communicate progress and outcomes of planned work. Attend weekly team meetings to discuss team and project-related activities, issues, change, communications, and updates.\n<br><br>\nRequired Education and Experience\n<br><br>\nMaster's Degree in computer science, applied/computational mathematics, engineering, biostatistics, statistics, or a quantitative field such as astronomy or geology, and 2 years of hands-on experience in deep learning or an equivalent combination of education and experience.\n<br><br>\nBackground Check Requirements\n<br><br>\nAll candidates for employment will be subject to pre-employment background screening for this position, which may include motor vehicle, DOT certification, drug testing and credit checks based on the position description and job requirements. All offers are contingent upon the successful completion of the background check. Please visit www.yale.edu/hronline/careers/screening/faqs.html for additional information on the background check requirements and process.\n<br><br>\n<strong>Position Focus:</strong>\n<br><br>\nThe Data Scientist will function in a multidisciplinary team environment, providing comprehensive machine learning data analysis with a focus on deep learning methods for multiple clinical and epidemiological studies of cardiovascular outcomes research conducted by investigators at the Center for Outcomes Research and Evaluation (CORE). This role involves planning, development, and implementation of methodology for specific research projects.\n<br><br>\nUnder the direction of the Principal Investigator and Program Co-Director, the ideal candidate will perform a variety of duties involving the application of machine learning skills to the analysis of research studies, and will work as a member of a research team to provide input in the design of study, perform data analysis, and lead or assist drafting analytical sections for peer-review publication for various projects. The candidate is expected to lead several efforts for which recent deep learning methods are appropriate, and for which large amounts of complex data are available. All research and programming code must be regularly documented and archived per best practices. Responsibilities will also include participating in the design, implementation, and maintenance of high performance computing (HPC) environments with graphical processing units (GPU) for accelerated deep learning computation. General responsibilities of the Data Scientist will be to coordinate and lead regular meetings that include agenda and materials preparation as well as meeting minute documentation, and to develop and manage timelines and research activities for research projects to ensure project goals and deliverables are met. The Data Scientist will communicate information and data in written and verbal form to colleagues as well as project and senior management teams. The individual will also be responsible for contributing to the development of training and presentation materials and assisting with the planning and coordination of training and seminars.\n<br><br>\n<strong>Preferred Education, Experience and Skills:</strong>\n<br><br>\nExperience in leading conference publications, particularly in the deep learning field. Strong background in data analysis with a diverse set of platforms (e.g. R, Python). Knowledge of advanced analytic approaches, including signal processing, image analysis, and supervised and unsupervised machine learning. Experience with version control, unit testing, and continuous integration environments.\n<br><br>\nPosting Disclaimer\n<br><br>\nThe intent of this job description is to provide a representative summary of the essential functions that will be required of the position and should not be construed as a declaration of specific duties and responsibilities of the particular position. Employees will be assigned specific job-related duties through their hiring departments.\n<br><br>\n<strong>Affirmative Action Statement:</strong>\n<br><br>\nYale University considers applicants for employment without regard to, and does not discriminate on the basis of, an individual's sex, race, color, religion, age, disability, status as a veteran, or national or ethnic origin; nor does Yale discriminate on the basis of sexual orientation or gender identity or expression. Title IX of the Education Amendments of 1972 protects people from sex discrimination in educational programs and activities at institutions that receive federal financial assistance. Questions regarding Title IX may be referred to the University's Title IX Coordinator, at TitleIX@yale.edu, or to the U.S. Department of Education, Office for Civil Rights, 8th Floor, Five Post Office Square, Boston MA 02109-3921. Telephone: 617.289.0111, Fax: 617.289.0150, TDD: 800.877.8339, or Email: ocr.boston@ed.gov."}