{"job title": "Data Scientist", "company": "Yamaha Motor Corp", "city state": "– Cypress, CA", "rating": "3.4", "job description": "Yamaha Motor Finance Corporation, U.S.A. is a growing and dynamic organization with superb financial products that supports our customers and dealers in the purchase of motorsports products that Rev your Heart.\n<br><br>\nYamaha has an excellent opportunity for a Data Scientist to join Yamaha Motor Finance Corporation, U.S.A., in Cypress, CA. This is a highly visible role that will primarily be responsible for analyzing and evaluating the risk in portfolio decisions, forecasting potential losses, and deciding how to curb potential losses and volatility. He/she will be instrumental in helping YMFUS minimize credit and financial risk exposure to improve business results. In addition, they will lead the analytical initiatives to formulate YMFUS' Credit Risk Strategies and other business initiatives. The areas of focus include database design, credit scoring systems, acquisitions and portfolio management strategy/criteria design, vintage analysis and portfolio segmentation, demographic analysis, portfolio loss forecasting and modeling to maximize risk/reward trade-off.\n<br><br>\nSpecific duties include, but are not limited to:\n\n\n<ul>\n<li>Develop statistical models, machine learning-based tools or processes to measure and manage business performance.</li>\n<li>Develop recommendation engines or automated scoring and decisioning systems to improve business efficiency</li>\n<li>Assist in evaluating the adequacy of internal processes and reduce all forms of exposure ranging from credit risk, efficiency/cost and regulatory impact.</li>\n<li>Lead monitoring and assessment of the post-implementation impact of risk management strategies.</li>\n<li>Perform research, quantitative analysis, modeling, and monitoring of the company's credit, collateral, and customer performance, such as scorecard development; strategy design or adjustments.</li>\n<li>Assist in developing, implementing and monitoring YMFUS's credit and servicing policies and procedures</li>\n<li>Conduct comprehensive analyses to assess levels of credit risk- including summarizing results with opinions and recommendations for actions.</li>\n<li>Develop, produce, monitor, examine and interpret advanced MIS/statistical reports</li>\n<li>Apply SAS, database and computer science knowledge to evaluate risk management strategies.</li>\n<li>Provide analytical and strategic support in a fast-paced start-up environment.</li>\n<li>Develop, recommend, and assist with the implementation of business strategies to manage credit risk, increase revenues, and reduce risk exposure.</li>\n<li>Predict the future trends from the current developments in the economy and recommend the management accordingly to plan the strategies.</li>\n<li>Liaison with and maintain relationship with Scorecard and Decision Engine service provider.</li>\n<li>Ad hoc reporting. If necessary meet with internal and external customers to establish requirements.</li>\n<li>Performs other duties as assigned.</li>\n</ul>\n\n<strong>Requirements:</strong>\n\n\n<ul>\n<li>Bachelor's degree in Statistics, Computer Science, Economics, Business Administration or related field</li>\n<li>Master's degree in Computer Science or Statistics preferred</li>\n<li>7+ years' relevant work experience</li>\n<li>Hands-on experience in using advanced statistical techniques like Machine Learning, Artificial Intelligence, Deep Learning is required.</li>\n<li>Thorough understanding of Multivariable Calculus and Linear Algebra</li>\n<li>Extensive knowledge with SQL / Oracle, SAS, KnowledgeStudeo, R, Python</li>\n<li>Experience in a financial and/or technical analysis business related environment</li>\n<li>Experience in Auto / Motorcycle lending a plus</li>\n<li>Ability to manage multiple projects with competing deadlines a must</li>\n<li>Must possess strong analytical thinking and problem-solving skills</li>\n<li>Good presentation skills and ability to present data to Senior Management</li>\n<li>Strong interpersonal skills and ability to interact seamlessly with all levels of management</li>\n<li>Successful experience working in a fast-paced start-up work environment a plus</li>\n<li>Travel required (approx. 10%)</li>\n</ul>\n\n<strong>#LI-MO1</strong>\n<br><br>\nYamaha Motor Finance Corporation, U.S.A. is proud to be an equal opportunity employer."}