{"job title": "Data Scientist", "company": "YapStone, Inc.", "city state": "– Walnut Creek, California", "rating": "3.4", "job description": "Description\n<br><br>\nAt YapStone, we approach payments with the same startup mentality that we had when we launched our first payment solution in 1999. We are now focused on combining our entrepreneurial spirit with our immense payment expertise to take our company and our partners to the forefront of innovation. As one of the leading payment companies, YapStone is continually searching for passionate thinkers to join us in changing how the world pays.\n<br><br>\nWe are looking for a Data Scientist who will support our Risk and Technology teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.\n<br><br>\n<strong>PRIMARY RESPONSIBILITIES:</strong>\n<br><br>\nDesigns, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse big data sources to generate actionable insights and solutions for client services and product enhancement.\n<br><br>\nAnalyzes complex business problems and issues using data from internal and external sources to provide insight to decision-makers.\n<br><br>\nIdentifies and interprets trends and patterns in datasets to locate influences.\n<br><br>\nConstructs forecasts, recommendations and strategic/tactical plans based on business data and market knowledge.\n<br><br>\nCreates specifications for reports and analysis based on business needs and required or available data elements.\n<br><br>\nMay provide consultation to users and lead cross-functional teams to address business issues.\n<br><br>\nMay directly produce datasets and reports for analysis using system reporting tools.\n<br><br>\nUses advanced mathematical and statistical concepts and theories to analyze and collect data and construct solutions to business problems.\n<br><br>\nPerforms complex statistical analysis on experimental or business data to validate and quantify trends or patterns identified by business analysts.\n<br><br>\nConstructs predictive models, algorithms and probability engines to support data analysis or product functions; verifies model and algorithm effectiveness based on real-world results.\n<br><br>\nDesigns experiments and methodologies to generate and collect data for business use.\n<br><br>\nProjects may include a focus on quantitative finance or help identify new business opportunities.\n<br><br>\n<strong>REQUIREMENTS:</strong>\n<br><br>\nWe're looking for someone with 5-7 years of experience manipulating data sets and building statistical models, and has a Master's or PHD in Statistics, Mathematics, Computer Science or another quantitative field.\n<br><br>\nPrevious experience with either fraud or payments required.\n<br><br>\nKnowledge and experience in statistical and data mining techniques\n<br><br>\nStrong problem solving skills with an emphasis on product development.\n<br><br>\nExperience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\n<br><br>\nExperience working with and creating data architectures.\n<br><br>\nKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\n<br><br>\nKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\n<br><br>\nExcellent written and verbal communication skills for coordinating across teams.\n<br><br>\nA drive to learn and master new technologies and techniques.\n<br><br>\nExperience querying databases and using statistical computer languages: R, Python, SLQ, etc.\n<br><br>\nChanging how the world pays is a mission that inspires us daily. It gets us up in the morning and keeps us up at night. And just in case we need an extra dose of inspiration during the day, our team can take in the stellar view from our Santa Monica office or visit the Yap Caf in our Walnut Creek office to choose from a notably large selection of snacks. From comprehensive health insurance to gym memberships, you'll find plenty of benefits and perks that reflect our appreciation for all of the thinking and doing that goes on at YapStone.\n<br><br>\nAbout YapStone\n<br>\nYapStone is a provider of online and mobile payment solutions for global marketplaces, software, and large vertical markets, powering electronic payments for sharing economy marketplaces, such as HomeAway and VRBO, and thousands of apartment and vacation rental companies, homeowners' associations, self-storage companies, and many other markets.\n<br>\nYapStone processes $20B in payment volume annually and has been recognized on the Inc. 5000 list of Fastest-Growing Private Companies for ten consecutive years, as well as San Francisco Bay Area's Best and Brightest Company to Work for by the National Association for Business Resources.\n<br>\nThe company has raised over $120 million from investors including Premji Invest, Accel Partners, Meritech Capital and MasterCard. Headquartered in Walnut Creek, California, YapStone has additional offices in Santa Monica, California and ************************\n<br><br>\nYapStone is an equal opportunities employer."}