{"job title": "Data Scientist - Fall Intern", "company": "Yelp", "city state": "– San Francisco, CA", "rating": "3.3", "job description": "<div><div>At Yelp, it’s our mission to connect people with great local businesses. Yelp’s unique dataset contains billions of interactions between users and local business around the globe, from a user reviewing a neighborhood coffee shop to requesting a repair quote with a photo of a leaky faucet.</div> <br>\n<div>The Data Science team performs analyses, builds models, and designs experiments that directly impact Yelp’s business and users. Our centralized team is the most wide-ranging consumer of data at Yelp, adept at tasks from modeling content growth and user behavior to sharing insights about the health of local economies.</div> <br>\n<div>We’re looking for interns to work side-by-side with our Data Scientists at Yelp to make sense of these interactions to deliver impactful analyses and products to our users, business partners and the general public.</div> </div><div><div>We Are Looking For:\n\n<ul>\n\n\n<ul>\n<li>Pursuing a BA/BS, MS, or PhD in Statistics, Math, Physics, Economics, Computer Science or related quantitative discipline.</li><li>Fluency with SQL and Python or R for data analysis.</li><li>Solid understanding of statistical inference, experimental design and analysis.</li><li>Enthusiasm for clean code and sharing reproducible results.</li><li>Communication skills to work with partners on engineering, product and business teams.</li><li>An eye for great data visualization with Matplotlib, Plotly, ggplot, or Tableau.</li><li>Endless ideas about how to leverage Yelp's unique data set.</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>What You Will Do:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>Define key metrics to track Yelp’s performance and inform product decisions.</li><li>Assess and frame questions from partners into actionable deliverables.</li><li>Design, execute, and analyze complex experiments impacting millions of users.</li><li>Devise and evaluate models for diverse business needs, such as identifying growth opportunities, personalizing user experience, and matching consumers to businesses.</li><li>Own analyses start-to-finish and communicate key insights to stakeholders.</li><li>Share your technical skills to develop and maintain high-quality, reusable analysis tools.</li></ul>\n</ul>\n\n</div>\n</div><div><div>Interested in applying?</div> <br>\n<div>Sweet! Share with us why you want to work at Yelp and don't forget to mention any side projects, academic papers, and personal websites/blogs.</div></div></div>"}