{"job title": "Business Intelligence Analyst", "company": "Zenreach", "city state": "– San Francisco", "rating": "3.3", "job description": "<div><div><strong>Zenreach was created to solve one of the most important problems in the modern economy—the majority of our time is being spent online, yet over 90% of purchasing still happens offline — and there is no link between the two systems. Brick-and-mortar merchants are working decades behind their online counterparts without essential data and tools. We created Zenreach to give them the same level of technology and transparency that anyone operating online has come to expect.</strong></div><br>\n<div><strong>Zenreach is backed by leading investors with decades of experience in building enterprise hardware and software. Interested in closing the loop between the online and offline worlds? Join us!</strong></div><br>\n<div>Responsible for supporting and formulating analytical strategies for solving key business problems, with a charter to uncover insights that can help drive the growth of the company. This role will be critical in helping drive key inputs to the corporate model and developing data pipelines that will scale with the business. Although technical in nature, this role will work closely with FP&amp;A in helping develop the KPI layer for the company.</div><br>\n<div>This position will be extremely critical in generating and democratizing a standard level of data across the company, and will work closely with business partners and technology teams to define and prioritize key questions, build data acquisition processes and business-friendly datasets.</div> <br>\n<div>As Zenreach continues to grow, and the business continues to expand, this person will be responsible in keeping up with system changes, and vital in making sure the system is reflected correctly across all levels of the business and business functions.</div> </div><div><div>Roles and Responsibilities:\n\n<ul>\n\n\n<ul>\n<li>Design, build and maintain analytical infrastructure across the organization</li><li>Work closely with business stakeholders and engineering to make sure data definitions and technical logic specifications align with business requirements</li> <li>Handle data extractions and translations from multiple data sources in order to build and support sustainable, high-performance data model solutions</li> <li>Automate ETLs to acquire, process, and curate data, with an eye for reproducible analysis</li><li>Recommend data standards and best practices to improve quality of data and speed to insight</li><li>Design and build business metrics for our corporate reporting; build dashboards in analytical/BI tools for business stakeholders</li><li>Translate analytical insights into actionable recommendations for business and process improvement</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Requirements:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>3 + years of relevant experience in Business Intelligence, Analytics, or other quantitative disciplines</li><li>Experience solving ambiguous and complex data problems</li><li>Experience mapping business objectives into actionable analyses, and explaining technical concepts, and implications to a broad audience</li><li>Analytics industry Knowledge with a comfortable sense of the tooling landscape</li><li>Proficient in SQL and working with large datasets, and knowledge of system architecture</li><li>Knowledgeable in one or more leading BI Analytics platforms</li><li>Plus: Experience with Looker</li><li>Proficient in ETL and data modeling best practices</li><li>Experience with designing and building data pipelines, or using ETL tools</li><li>Strong scripting language experience (Python)</li><li>Experience with AWS, or any on-demand cloud computing platform, and maintaining a cloud-based analytical infrastructure</li><li>Strong interpersonal and communication skills - able to work with people with different levels of technical skills and explain technical concepts to a broad audience</li></ul>\n</ul>\n\n</div>\n<br>\n<div><div>Perks and Benefits:\n<br>\n\n\n<ul>\n\n\n<ul>\n<li>Excellent and comprehensive health plans (medical (including HSA/FSA and free access to One Medical), dental, vision, 401K)</li><li>Flexible Vacation Policy</li><li>Fully stocked kitchen with healthy (and unhealthy) snacks and beverages</li><li>Catered dinners during weeknights if you so choose</li><li>Enhanced Paternity/Maternity Programs</li><li>Access to onsite gym with views of the Golden Gate Bridge</li><li>Organized volunteer events to give back to our community</li><li>Off-sites, events and happy hours</li> </ul>\n</ul>\n\n</div>\n</div><div><div><strong>Zenreach is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, provincial, or local law.</strong></div><br>\n<div><strong>*Zenreach is an E-Verify participant</strong></div>\n</div></div></div>"}