{"job title": "Data Scientist, Machine Learning", "company": "ZestFinance", "city state": "– Pittsburgh, PA, United States", "rating": "3.8", "job description": "As a Data Scientist at ZestFinance, you will develop radically new methods for manipulation and prediction that will enable us to provide fair, transparent credit. Using a combination of machine learning technology and vast amounts of data sources, we seek to transform the credit market while expanding our team into interesting and revolutionary frontiers within the credit world.\n<br><br>\n<strong>In this role you will:</strong>\n<ul>\n<li>Translate unstructured business problems into well-defined machine learning projects</li><li>Collaborate with a cross-functional team of Engineers, Product Managers, and Business Analysts to identify and manage high leverage opportunities for modeling work</li><li>Design and implement highly generalizable models for predicting various outcomes</li><li>Take responsibility for modeling implementation in real world settings to solve real world problems</li><li>Mentor junior team members in modeling artistry</li>\n</ul>\n<strong>We are looking for:</strong>\n<ul>\n<li>Bachelor’s Degree in a quantitative discipline; advanced degrees preferred</li><li>Expert experience designing, developing, and implementing machine learning models/algorithms</li><li>Successful Kaggle competition experience is encouraged</li><li>Extensive programming experience in R or Python and an interest in learning new languages and technologies</li><li>Knowledge of data structures and parallelization</li>\n</ul>\n<strong>Perks and benefits:</strong>\n<ul>\n<li>People – the best part of Zest</li><li>Robust healthcare plans, matching 401K and unlimited vacation time</li><li>Dog friendly office with lounge areas, video games and gigantic jigsaw puzzles</li><li>On-site gym with yoga, salsa and other employee run fitness classes</li><li>Generous family leave policy (6 month maternity leave/3 month paternity leave)</li><li>Tuition reimbursement, conference allowance and Zest talks</li><li>Complimentary massages, manicures, pedicures and more</li><li>Daily catered lunches from LA’s best restaurants and fully stocked kitchen</li>\n</ul>\n\n<strong>About ZestFinance:</strong>\n<br><br>\nZestFinance, Inc. applies its unique credit-decisioning technology platform — based on data science and machine learning — to help lenders effectively predict credit risk so they can increase revenues, reduce risk and ensure compliance. ZestFinance was founded in 2009 by Douglas Merrill and a team of former Google employees with the mission of making fair and transparent credit available to everyone.\n<br><br>\nWe are committed to diversity in hiring, professional development, and everyday discussion. Zest is determined to hire crazy smart people who are different from each other to create broad thinking, lots of different ideas, and by extension, the best team possible."}