{"job title": "Data Scientist", "company": "ZF TRW", "city state": "– Livonia, Michigan", "rating": "3.1", "job description": "<strong>Job Title</strong>\n<br>\nData Scientist\n<br><br>\n27-Aug-2018\n<br><br>\n<strong>Department</strong>\n<br>\n48301I0961 - IS - Digitalization\n<br><br>\n<strong>Business Unit</strong>\n<br>\nGDF - Information Systems\n<br>\n{\"QuestionName\":\"Job Description\",\"AnswerValue\":\"<br><br><strong><u>Purpose &amp; Overall Relevance for the Organization:</u></strong>\n<br>\nThis role will be responsible for researching, designing, engineering, and scaling advanced analytics models (statistical, neural networks, genetic algorithms, and others) in a designated area such as “customer”, “quality”, “plant” etc. The role will be tightly interlinked to ZF’s divisions / functions and IT, closely partnering with respective technical and business teams and data subject matter experts to deliver a comprehensive model strategy, roadmap, and actual models leveraging data sets synthesized from multiple data sources by the data engineering teams. The Principal Data Scientist will constantly seek to improve the performance and business impact of Advanced Analytical Models, as well as support the Digital Monetization team in monetization of Data and Analytics.\n<ul>\n<li><strong>Principal Subject Matter Expert for Data Science:</strong>\n\n<ul>\n<li>Serve as an expert internal consultant for Data Science and Advanced Analytics and its integration with Enterprise IT systems, IoT, I4.0, Data, and Analytics across all ZF Divisions and Function</li><li>Strong background, knowledge and understanding of Data Science both in “traditional” statistical based methods as well as “machine learning” methods such as neural networks, genetic algorithms, etc. Ph.D. or similar level of accomplishment evidenced by patents or papers.</li><li>Proven track record of working across the enterprise and with IT.</li></ul></li>\n</ul>\n\n<strong></strong><ul><strong></strong><li><strong>Data Science Management:</strong>\n\n<ul>\n<li>Serve as the Single Point of Contact (SPOC) for Data Science and Advanced Analytics in a designated functional domain.</li><li>Work with Senior technology stakeholders to articulate opportunities for Advanced Analytics across the ZF portfolio.</li> <li>Identify and facilitate x-division/function synergies and collaborative Data Science opportunities – deliver “whole is greater than the sum of the parts” in the designated area.</li><li>Manage the technical content, education, best practices, and technical competency in data science and advanced analytics in designated domain.</li></ul></li>\n</ul>\n\n\n<ul>\n<li><strong>Manage and Oversee Lighthouse Data Science Initiatives:</strong>\n\n<ul>\n<li>Overall responsibility for achieving the quality outcomes of the lighthouse Data Science projects to create large scale Advanced Analytics models that provide significant business outcomes.</li><li>Develop modules and implementation patterns on the ZF platforms to accelerate delivery of Lighthouse Data Science and Advanced Analytics and other capabilities.</li></ul></li>\n</ul>\n\n<strong></strong><ul><strong></strong><li><strong>Manage the Transformational Change:</strong>\n\n<ul>\n<li>Foster company-wide commitment for Data Science and Advanced Analytics as part of the digital strategy and prioritize initiatives per the company needs, and align it with the overall strategy of the company.</li><li>Act as the ambassador within the company for Digital transformation</li><li>Act as a spokesperson in the external community helping ZF positioning as a Digital leader, attracting highly talented workforce</li></ul></li>\n</ul>\n\n<strong><u>Key Responsibilities:</u> </strong>\n\n<ul>\n<li> Relationship management with Divisions/Functions to ensure buy in to Data Science and Advanced Analytics.</li><li>Coordination work and relevant communication with other cross functional teams within the broader ZF organization (IT, R&amp;D, …) to assure seamless and “Team Beats Silos” delivery.</li><li>Act as the change agent in building credibility for the Digital organization by consistently delivering to business expectations</li><li>Work with the internal teams (Digital Labs, Digital Factory, …) to maximize synergy.</li><li>Support the build-up of an efficient organization that allows for realization of ZF’s Digital goals</li><li>Lead and manage necessary project teams to successfully deliver the stated objectives for lighthouse Data Science and Advanced Analytics projects.</li><li>Use appropriate and effective communication methods to engage and manage stakeholder expectations.</li><li>Hands on development of key models leveraging data wrangling required and Analytical Data Assets delivered by Data Engineering.</li>\n</ul>\n\n<strong><u>Authorities:</u></strong>\n\n<ul>\n<li>Technical leadership in Data Science and Advanced Analytics</li><li>Business Relationship Management</li><li>Life cycle ownership for models</li><li>Responsibility for realizing stated objectives for Data Science</li>\n</ul>\n\n<strong><u>Key Relationships:</u> </strong>\n\n<ul>\n<li>Divisional / Functional technical leaders, decision makers, and subject matter experts</li><li>Project teams within the ZF Digital Organization</li><li>Project vendors for development</li><li>Cross Functional Coordination with IT, R&amp;D</li>\n</ul>"}