{"job title": "Data Scientist", "company": "Z Gallerie", "city state": "– Berkeley, CA", "rating": "3.1", "job description": "<strong>Purpose of Position</strong>\n<br><br>\nAs a Data Scientist on our rapidly growing team, you will have the opportunity to make a large impact at Z Gallerie. You will be embedded within our highly analytical marketing team. The team moves fast and is focused on one thing: getting more people to shop for home furnishings at Z Gallerie both online and in store . You will identify key metrics, design experimentation and incrementality tests, conduct deep and rigorous analysis, and deliver insights to the team for marketing scale and optimization. You will also be working across all channels in the business which means interfacing with many business leaders. You will be a trusted partner in the team tackling the toughest and most impactful analytical problems while making the data accessible to your teammates and cross-functional colleagues.\n<br><br>\n<strong>Essential Duties and Responsibilities</strong>\n<br><br>\n<ul>\n<li>Conduct quantitative research and analysis of our brand strategy requiring complex data retrieval that results in actionable insights and recommendations</li><li>Collaborate with store operations, marketing, merchandising, and planning teams to identify opportunity areas, translate them into structured analyses, and generate actionable insights</li><li>Identify key questions, problems, and KPIs using your sharp business acumen and judgment and past retail analytics experiences</li><li>Design and analyze rigorous experiments and incrementality tests</li><li>Build predictive models to better understand and forecast users behavior.</li><li>Work daily with marketing leadership and a team of marketing professionals to discover and guide the most impactful marketing investments</li><li>Provide access to data through dashboards and other analytical tools to empower the marketing team and cross-functional partners through self-service. Look for opportunity to automate insights through alerting and anomaly detection.</li><li>Make conclusions from your analysis, present your results, and advocate for proposed next steps to key decision makers</li><li>Develop and deliver on the marketing and retail analytics roadmap</li><li>Build analytical tools from scratch (like a customer LTV model, a budget optimization model and campaign effectiveness tools) that will enable marketing to acquire new users in the most efficient way</li><li>Other tasks as required</li>\n</ul>\n<strong>Position Specifications</strong>\n<br><br>\n<em>Education &amp; Formal Training</em>\n<ul>\n<li>Bachelor’s degree</li><li>Prior retail experience a plus</li>\n</ul>\n<em>Experience &amp; Skills</em>\n<ul>\n<li> Passion for, and track record of leveraging data for business impact in a multi-channel marketing environment (including ad servers, social networks, RTB platforms, and offline channels).</li><li>Thorough understanding of the digital marketing / ad tech ecosystem and the best practices for measurement in it.</li><li>Ability to write complex and performant queries in your dialect of SQL.</li> <li>Experience building tools and automated processes to extract, clean, and distill data in a procedural language of your choice such as Python, Julia, or R.</li><li>Understanding of A/B testing and other forms of statistical analysis using statistical packages similar to R, SAS, or Pandas.</li><li>Effective data visualization skills with analytical tools.</li><li>Growth mindset; the ability to thrive in a dynamic and collaborative environment.</li><li>Previous experience with measurement in offline channels.</li><li>Data modeling, ETL and data pipeline development experience.</li><li>Advanced degree in statistics or other quantitative field.</li><li>Experience in SQL; ability to extract and manipulate data.</li><li>Demonstrated ability to create insightful analytic results and communicate results and methodology effectively with partners.</li><li>Skilled in working with data at varying levels of granularity and the issues inherent in building data sets across different platforms and systems of record.</li><li>Demonstrated advanced Excel reporting skills.</li><li>Interest in learning about and testing new customer acquisition strategies.</li><li>Experience with other data and analysis tools/languages a plus (Google Analytics, Tableau, etc.).</li><li>Proven capability to build strong partnerships and work with business partners to effectively negotiate priorities and scope of work.</li><li>Ability to gather information and create both business and technical requirement documentation, as well as, drive the requirements process with both technical and business partners.</li>\n</ul>\n<strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}