{"job title": "Data Scientist (Decision Science)", "company": "Zillow", "city state": "– Seattle, Washington", "rating": "4.1", "job description": "About the teamZillow Group is currently seeking a Data Scientist to join the Decision Science team in our Seattle office. Our team is tasked with absorbing billions of rows of data from dozens of sources, organizing them, analyzing them, and visualizing them to help inform both short- and long-term decision-making.\n<br><br>\nOur structure is very flat and you will soon find yourself communicating directly with Senior Leadership. Each team member focuses on a cross-section of the Zillow Group community. Below are some of the areas in which our Data Scientists focus their energy.\n<br><br>\nBusiness - Build data-driven insights to fuel the future of each of Zillow Groups businesses (e.g., Agent, Rentals, New Construction). Find opportunities for innovation and assess performance of current initiatives.\n<br><br>\nMarketing - Develop strategies for B2C and B2B marketing efforts through a wide range of marketing channels and measure their performance.\n<br><br>\nProduct - Analyze how our consumers are interacting with our web and app products to ensure we are providing them with a delightful experience.\n<br><br>\nSales - Analyze the intersection of human behavior, incentive structures, and sales process to build a more efficient sales force.\n<br><br>\nPricing - Develop and implement pricing strategies that deliver the best value possible for our clients (Premier Agents, Lenders, Landlords, etc).\n<br><br>\nTools - Create data-focused information products from billions of data points we collect every single day for internal and external clients.About the role<br><br>Once you're here, you'll work to make important, strategic decisions that influence the direction of the company. More specifically:\n<ul>\n<li>Dive into Zillow's internal and third party data (think Hive, Presto, SQL Server, Redshift, Python, Mode Analytics, Tableau, R) to make strategic recommendations (e.g., personalized user flows, segmented marketing audiences, more accurate pricing forecasts).</li><li>Assist in the scoping and development of new product features and business initiatives. Compile and analyze data describing the performance of those initiatives (e.g., AB tests, pilots, incrementality tests).</li><li>Develop a common language and approach to analyzing and communicating information and insights across teams.</li><li>Create, maintain, and document a robust set of metrics to monitor day-to-day bug detection and long-term performance tracking.</li><li>Tell stories that describe analytical results and insights in meetings of all sizes with diverse audiences.</li><li>Consult with business partners and provide analytics-oriented thought leadership across a variety of non-technical audiences to ensure that all levels of Zillow Group make data-driven decisions.</li>\n</ul>\n\nWho you are<br><br>You will not shy away from complexity or uncertainty. You will develop a deep understanding of our mission, business models, and personas. We want you to use that intuition you've developed (both in business and real life) to find opportunities for growth and cultivate insights from our massive data sets. We're looking for a seasoned data scientist who has:\n<ul>\n<li>An undergraduate or Master's degree in a quantitative field (e.g. science, engineering, economics, finance, statistics, or similar) or demonstrable experience within data science and analytics.</li><li>2+ years of work experience involving quantitative data analysis and complex problem solving (preferably focused on consumer-facing internet products).</li><li>Foundational analytical skills (demonstrated understanding of SQL, command of Excel, and experience using R and/or Python) and is a Tableau pro.</li><li>Experience directly querying multi-terabyte-sized data sets (e.g. with Hive and Presto) including clickstream data and raw data ingested from non-standard platforms (e.g., homegrown systems).</li><li>An understanding of concepts, terminology, and measurement issues related to web traffic.</li><li>Strong written, verbal, and visual communication skills to concisely communicate in a way that provides context, offers insights, and minimizes misinterpretation.</li><li>The skills to work cross-functionally and push business partners to focus on realistic goals and projects.</li>\n</ul>\n\nGet to know us<br><br>Zillow Group is owned, fueled and grown by innovators who help people make better, smarter decisions around all things home. We encourage one another at every level, and our efforts are supported by employee-driven, world-class benefits that enable us to enjoy our lives outside the office while building fulfilling careers that impact millions of individuals every day.\n<br><br>\nZillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know."}