{"job title": "Data Scientist", "company": "ZipLine", "city state": "– Half Moon Bay, CA", "rating": "3.8", "job description": "<ul>\n<li>Ramp up on Zipline's systems, learning how our software, hardware, and operations systems work together to deliver life-saving medical supplies</li>\n<li>Lead a key analytics project from question to completion, operationalizing your key results into a real-time dashboard</li>\n<li>Become an expert user of our data analysis tools</li>\n</ul>\n\nWithin 3 months you will\n\n\n<ul>\n<li>Take ownership of our automated analysis suite, managing and improving the evaluation of tracking metrics</li>\n<li>Build out key metrics and dashboards as part of our automated release process</li>\n<li>Evangelize data visualization best practices throughout the company</li>\n</ul>\n\nWithin 6 months you will\n\n\n<ul>\n<li>Become a go-to internal resource for finding relevant telemetry/logs</li>\n<li>Routinely drive decision-making at Zipline through your work</li>\n</ul>\n\nMust Haves\n\n\n<ul>\n<li>Programming - proficient in Python scripting and data analysis, e.g. Pandas, Numpy, Scipy, Matplotlib</li>\n<li>Data Visualization - ease in summarizing large datasets visually, e.g. histograms, contour plots, parallel axis diagrams</li>\n<li>Math/Stats - confident with descriptive statistics, probability, linear algebra</li>\n<li>Engineering/Physics conversant - comfortable working with engineering data, e.g. circuit currents/voltages, rotating coordinate systems</li>\n<li>Technical communication - capable of interpreting a general question into specific analysis, and vice versa</li>\n<li>Real-world prioritization - adept at ruthlessly prioritizing projects, triaging analysis requests in real-time</li>\n<li>Eligible to work in the US</li>\n</ul>\n\nUseful Experience\n\n\n<ul>\n<li>Interactive dashboarding tools like Kibana or Tableau</li>\n<li>SQL or Elasticsearch</li>\n<li>Amazon Web Services</li>\n<li>Machine learning</li>\n<li>Aerospace</li>\n<li>Spark</li>\n<li>Git</li>\n<li>Linux CLI<br><br>SDL2017</li>\n\n</ul>"}