{"job title": "Sr. Scientist/Principal Scientist Bioassay Development", "company": "Zoetis", "city state": "– Kalamazoo, MI", "rating": "3.2", "job description": "Senior Scientist BioPharmaceutical Analytical Development\n<br><br>\nZoetis is a global animal health company dedicated to supporting customers and their businesses. Building on 60 years of experience, we deliver quality medicines, biopharmaceuticals and vaccines, complemented by diagnostic products and genetic tests and supported by a range of services. We are working every day to better understand and address the real-world challenges faced by those who raise and care for animals in ways they find truly relevant.\n<br><br>\nZoetis discovers, develops and manufactures a diverse portfolio of animal health medicines, biopharmaceuticals and vaccines designed to meet the real-world needs of veterinarians and the livestock farmers and companion animal owners they support. Zoetis has the first monoclonal antibody therapy for treating atopic dermatitis in dogs. We are currently seeking to fill new positions to support our growing biopharmaceutical portfolio.\n<br><br>\nZoetis Veterinary Medicine Research and Development, Analytical Sciences in Kalamazoo, MI is seeking an analytical scientist at the Senior Scientist/Principal Scientist level.\n<br><br>\nResponsibilities include, but are not limited to the following:\n\n\n<ul>\n<li>Develop test methods to evaluate the potency and binding of biopharmaceuticals, including cell-based bioassays and ligand binding assays.</li>\n<li>Lead cell-based bioassay and ligand binding assay method development, optimization, qualification/validation and method transfer studies.</li>\n<li>Manage outsourced assay development projects at contract research organizations involving cell line development, cell-based bioassay and ligand binding feasibility, optimization and validation studies.</li>\n<li>Represent Analytical Sciences on project teams, collaborating closely with scientists from Process Development, Therapeutic Research, Clinical, Regulatory, Project Management, and Quality Control to deliver robust methods and products. Provide input into project plans, keep relevant sections of project plans current, and execute plans according to agreed timelines and budgets.</li>\n<li>Develop and/or adopt new analytical technology, as appropriate, to advance programs with significant analytical technical and timeline challenges.</li>\n<li>Support Analytical Sciences assay-specific Critical Reagents and Reference Standards programs. Optimize, qualify, monitor performance and maintain inventory of assay specific Reference Standard and Critical Reagents used in cell-based bioassays and ligand binding assays. Create technical protocols and reports for Critical Reagents and Reference Standards.</li>\n<li>Trend and report method and Critical Reagents performance data.</li>\n<li>Document and communicate results in laboratory notebooks, technical reports, and oral presentations. Assist in the preparation and writing of regulatory filings.</li>\n<li>Collaborate with other scientists in a variety of technical disciplines including Process Development, Biological Research, Clinical, Regulatory, Project Management, Quality Control and Manufacturing.</li>\n</ul>\n\n<strong>Minimum Qualifications:</strong>\n\n\n<ul>\n<li>PhD in Biology, Biochemistry, Immunology or a related discipline</li>\n<li>BS/MS with at least 5 years' hands-on industry experience in cell-based bioassay and ligand binding methods development.</li>\n<li>Excellent oral and written communication skills</li>\n</ul>\n\n<strong>Preferred Qualifications:</strong>\n\n\n<ul>\n<li>PhD in Biology, Biochemistry, Immunology or a related discipline with a minimum of 5 years of post-graduate experience in cell-based bioassay and ligand binding methods development in an industrial laboratory setting.</li>\n<li>BS/MS with 10+ years hands-on industry experience in cell-based bioassay and ligand binding methods development in an industrial laboratory setting.</li>\n<li>Individual with experience leading teams and/or managing scientists in the development of cell-based bioassays and ligand binding assays used to assess quality attributes of biopharmaceutical products in development.</li>\n<li>An understanding of protein engineering and post translational modifications as they relate to receptor binding and biological activity.</li>\n<li>Skills and past experience in design of experiments (DOE), technical problem solving and continuous improvement</li>\n<li>Experience with G-protein coupled receptor (GPCR) pharmacology, biochemistry or cell biology.</li>\n<li>Experience with biopharmaceutical development and product licensure.</li>\n<li>Knowledge of the regulatory requirements (FDA, EMA, USDA) that apply to the development of tests to assess the biological activity of biopharmaceuticals tested under GMP release of biopharmaceuticals.</li>\n</ul>\n\nFull time\n<br><br>\nRegular\n<br><br>\nColleague\n<br><br>\nZoetis is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status or any other protected classification. Disabled individuals are given an equal opportunity to use our online application system. We offer reasonable accommodations as an alternative if requested by an individual with a disability. Please contact Zoetis Colleague Services at zoetiscolleagueservices@zoetis.com to request an accommodation. Zoetis also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must possess or obtain authorization to work in the US for Zoetis. Zoetis retains sole and exclusive discretion to pursue sponsorship for the acquisition or maintenance of nonimmigrant status and employment eligibility, considering factors such as availability of qualified US workers. Individuals requiring sponsorship must disclose this fact. Please note that Zoetis seeks information related to job applications from candidates for jobs in the U.S. solely via the following: (1) our company website at www.Zoetis.com/careers site, or (2) via email to/from addresses using only the Zoetis domain of \"@zoetis.com\". In addition, Zoetis does not use Google Hangout for any recruitment related activities. Any solicitation or request for information related to job applications with Zoetis via any other means and/or utilizing email addresses with any other domain should be disregarded. In addition, Zoetis will never ask candidates to make any type of personal financial investment related to gaining employment with Zoetis."}