{"job title": "Decision Analytics Consultant (Princeton, NJ)", "company": "ZS Associates", "city state": "– Princeton", "rating": "3.8", "job description": "<strong>ZS</strong> is the world’s largest consulting firm focused exclusively on helping companies improve overall performance and grow revenue and market share, through end-to-end sales and marketing solutions – from customer insights and strategy to analytics, operations and technology. From our worldwide offices, ZS experts draw on deep industry and domain expertise to help companies make smarter decisions quickly and cost effectively. We are particularly known for our strong presence in the pharmaceutical and health care sectors, yet work across a range of industries.\n<br><br>\n<strong>ZS's Business Consulting group</strong> delivers solutions to a broad spectrum of sales and marketing challenges. We also help our clients transform their sales and marketing organizations to implement these solutions. Our solutions and recommendations are based in rigorous research and analysis underpinned by deep expertise and thought leadership.\n<br><br>\n<strong>DECISION ANALYTICS CONSULTANT</strong><br>\n<div>Decision Analytics Consultants deliver high-quality sales and marketing projects to clients. Consultants possess unstructured problem solving skills as well as strong analytic and communication skills. Consultants may work on multiple projects simultaneously. As Consultants advance in their career, they specialize in a particular industry, practice area and/or client relationship.<br>\n\n<div><strong>Responsibilities:</strong></div><ul><li>Work with project leadership to define project scope and develop approach;</li><li>Lead project task execution by ensuring progress, organizing project data and coordinating team meetings;</li><li>Conduct issue analysis and develop hypotheses on the key client issues;</li><li>Design and execute qualitative or quantitative analyses to test hypotheses and improve client commercial effectiveness;</li><li>Synthesize findings, develop recommendations and communicate results to clients and internal teams;</li><li>Provide thought leadership and innovation within projects and practice areas;</li><li>Participate in business development;</li><li>Contribute to internal firm activities;</li><li>Coach and mentor junior team members.</li>\n</ul>\n​<strong>Responsibilities:</strong>\n<ul>\n<li>MBA with bachelor's (and often graduate) degrees in Operations Research, Applied Mathematics, Management Science, Data Science, Statistics, Econometrics or Engineering with a strong academic record. Alternately, candidates may possess a PhD in marketing, economics, decision sciences or related field with a business application. In lieu of an MBA or PhD, 5-8 years of relevant work experience may substitute;</li><li>Up to 3 years of post-MBA relevant work experience, and 3-5 years of pre-MBA relevant work experience;</li><li>High motivation, good work ethic, maturity and personal initiative;</li><li>Aptitude for, and enjoyment of, leading and managing teams;</li><li>Strong oral and written communication skills that enable personal impact with senior-level decision makers;</li><li>Strong attention to detail, with a quality-focused mindset;</li><li>Analytic problem solving skills, with a creative and innovative outlook;</li><li>Client service orientation.</li></ul></div>\n<br>ZS is a global consulting firm; fluency in English is required, additional fluency in at least one European or Asian language is desirable.<br>\n<div>Candidates must possess work authorization for their intended country of employment. An on-line application, including a cover letter expressing interest and a full set of transcripts (official or unofficial), is required to be considered.\n<br><br>\nZS Associates offers a competitive compensation package with salary and bonus incentives, complete medical/dental/life insurance programs and retirement benefits. We are an Equal Opportunity Employer.<br>\n<div><strong>NO AGENCY CALLS, PLEASE.</strong></div><div><strong>Connect with ZS on social media:</strong>\n<ul>\n<li>Like ZS Careers on <strong>Facebook</strong></li><li>Follow ZS Careers on <strong>Twitter</strong> and <strong>Instagram</strong></li><li>Follow ZS on <strong>LinkedIn</strong> for more job opportunities</li><li>Subscribe to the ZS <strong>YouTube</strong> Channel</li>\n</ul>\nZS has been recognized globally for its expertise in consulting and its flexible work environment. View <strong>ZS’s accolades</strong><strong><u>.</u></strong></div></div>"}