{"job title": "Data Scientist", "company": "Zume Inc.", "city state": "– Seattle, WA", "rating": "4.1", "job description": "<strong>WHO WE ARE</strong>\n<br><br>\nZume is on a quest to be the most powerful source of health and well-being on the planet. To achieve our objective, we must facilitate the provision of wholesome, affordable food on a global scale and in a sustainable manner. We are meeting this challenge by providing an end-to-end, scalable platform that reduces the time and distance between clean food sources and dense population centers, using cutting-edge automation and transportation logistics. By developing better tools and processes, we can feed people healthier, sustainably-grown food, delivered fresh and free from chemical stabilization.\n<br><br>\n<strong>THE ROLE</strong>\n<br><br>\nWe're expanding our fleet of vehicles that can autonomously prepare food in-transit. We've proven that we can do it with Pizza now we're going to scale it to all prepared food.\n<br><br>\nThe problem we need to solve is a combination of Uber's ride scheduling problem with Amazon's autonomous supply chain problem, but to make things more tricky food needs to show up freshly prepared, so timing is critical. And that just the tip of the iceberg of where we're going. To scale we're going to need to solve lot of really hard problems that call for a world class data science team. That's where you come in.\n<br><br>\nYou should have a broad understanding of data science in general, but we're also looking for specialists in at least one of (convex) optimization, stochastic processes, time series, and machine learning. Graduate work in any of these fields is a plus. You'll need to be proficient in programming (python), and not afraid to get your hands dirty in implementation. Experience with hardware a plus, but not required.\n<br><br>\nThis is a rare opportunity to get in at the early stages of a growing team, in a rapidly growing company. We're looking for one of the next leaders in the industry. If that's you, lets talk.\n<br><br>\n<strong>WHO YOU ARE</strong>\n<br><br>\nA generalist in data science with deeper experience in either Optimization, Stochastic Processes, Deep Learning or reinforcement learning.\n\n<ul>\n<li>Degree CS, Applied Math, Statistics, or other scientific field. Graduate degree a plus</li>\n<li>Experience building models on real world problems</li>\n<li>Software development experience in python</li>\n</ul>\n<strong>BONUS POINTS</strong>\n\n<ul>\n<li>Familiarity with hardware / robotics</li>\n<li>Understanding of supply chains</li>\n<li>Previous experience at a start-up</li>\n</ul>\n<strong>WHAT WE OFFER</strong>\n\n<ul>\n<li>100% company-paid Medical, Dental, and Vision for you and 75% for your dependents</li>\n<li>Ownership via Stock Options</li>\n<li>Flexible Time Off</li>\n<li>Daily catered lunch</li>\n<li>Free and discounted pizza!</li>\n<li>The opportunity to work with an incredibly supportive team of thinkers and innovators</li>\n<li>Dog friendly office</li>\n</ul>"}