{"job title": "Scientist, Analytical Chemistry", "company": "Zymergen", "city state": "– Emeryville, CA", "rating": "3.3", "job description": "Zymergen is hiring a Scientist to work on analytical chemistry tech transfers with partner companies and general assay development for a wide variety of compounds produced through bench-scale and microtiter plate-based fermentation processes. The incumbent will develop new assays as well as identify and implement assays described in the literature to support these fermentation processes. These assay development projects include working alongside equipment providers to build out the facilities to run the assays in high throughput (HTP).\n<br><br>\nAn ideal candidate for this position will handle the following responsibilities:\n<br><br>\n<em>Assay Development</em>\n\n<ul>\n<li><em>Develop HTP assays to measure titer of a variety of target molecules including new bio-derived compounds generated through plate-based fermentation</em></li></ul>\n\n\n<ul>\n<li>Provide theoretical and practical expertise in chromatographic (HPLC, GC), mass spec and spectroscopic (UV/VIS, fluorescence, FTIR, Raman, etc.) methods to develop improved HTP assays for target compounds</li></ul>\n\n\n<ul>\n<li>Make use of ELISA and enzyme-coupled assay expertise to develop HTP methods for measuring titer of target molecules</li></ul>\n\n\n<ul>\n<li>Test new analytical techniques to be used in the context of high throughput screening</li>\n</ul>\n<em>Assay Operationalization</em>\n\n<ul>\n<li><em>Convert and further improve protocols from partner companies to protocols for operations within highly automated workflows</em></li></ul>\n\n\n<ul>\n<li>Work with automation and fermentation teams to ready assays for the operations team</li></ul>\n\n\n<ul>\n<li>Improve existing detection techniques to increase the quality of data acquired and to decrease the associated costs and timelines</li></ul>\n\n\n<ul>\n<li>Establish analytical equivalency between Zymergen and partner companies</li></ul>\n\n\n<ul>\n<li>Perform ongoing monitoring and support for analytical work in operations</li> \n</ul>\n<em>Equipment, Data and Team Management</em>\n\n<ul>\n<li><em>Purchase and maintain separations and detection equipment</em></li></ul>\n\n\n<ul>\n<li>Upgrade systems through third party vendors and by adding peripheral components, and improve systems through custom upgrades and custom workflows</li></ul>\n\n\n<ul>\n<li>Maintain relationships with vendors, repair support staff, and consumables and parts providers</li></ul>\n\n\n<ul>\n<li>Interact with software engineers for the capture, storage, and processing of measurement and process data</li>\n</ul>\n<strong><em>Qualifications/Experience</em></strong>\n\n<ul>\n<li><em>MSc with 6+ years working in a relevant field (biochemistry, chemistry, chemical engineering, or related) or PhD with 1-3 years working in a relevant field.</em></li></ul>\n\n\n<ul>\n<li>Track record of both excellence in operations and creativity in assay development</li></ul>\n\n\n<ul>\n<li>Familiarity with the tools of statistical process control, including use of control charts and software such as JMP.</li>\n</ul>\n<em>Based in the San Francisco Bay Area, Zymergen is a technology-driven company applying radical new methods to design and improve microbes by rewriting their DNA. This capability allows us to generate novel chemicals, advanced materials, and pharmaceuticals far faster and at lower costs than competing technology. Our approach combines biology, robotic automation, and proprietary computational and analytic methods to industrialize what is otherwise a slow, risky process.</em>"}