{"job title": "Data Scientist 4, Poker", "company": "Zynga", "city state": "– Austin, TX, United States", "rating": "3.6", "job description": "Zyngas data science team uses our unique and expansive data to model and predict user behavior, making our games more personalized and more fun to play! We strive for a better understanding of our players which translates into challenges and features that delight them and increased social engagement within our games.\n<br><br>\nHeres where you would come in: identify and formalize problems predicting user behavior. Then create and implement your models to find solutions. Be innovative, be creative, use every bit of that key commodity data. Millions of people play Zynga games every day, so our data is tremendously rich and we have a lot of it!\n<br><br>\nWe will rely on you to communicate your findings to your peers both technical and non-technical. Your solutions will need to be demonstrably impactful and visual. You will work with our game teams to put your models into production.\n<br><br>\n<strong>Responsibilities:</strong>\n<br>\n· Work with large amounts of data to identify opportunities that would help improve the experience that Zynga provides to its players\n<br>\n· Apply predictive modeling and Data Mining techniques for a variety of user modeling tasks within Zyngas Game Network\n<br>\n· Work closely with game teams to design, test, verify and implement statistical models with Zyngas games that impact the daily life of millions of users\n<br>\n· Behavior modeling, including the ability to determine where our current player action logging needs improvement\n<br>\n· Automated flagging of players for fraud investigation\n<br>\n· Correlating data points from in-game complaints against players\n<br><br>\n<strong>Required Skills and Experience:</strong>\n<br>\n· BA in Computer Science, Math, Statistics, Economics, or other quantitative field; Masters or PhD strongly preferred\n<br>\n· 3+ years of work experience in data science or analytics roles\n<br>\n· Experience with some or all of the following: data mining, predictive modeling, statistics, experimental design, computational analytics, econometric modeling, data visualization, bot detection\n<br>\n· Fluent in SQL\n<br>\n· Fluent in R and/or Python\n<br>\n· Experience working with large datasets, preferably in a Hadoop or Spark environment\n<br>\n· Ability to work independently to get an idea from inception to implementation, including knowledge of techniques for validation and testing\n<br>\n· Strong experience with programming\n<br>\n· Strong written and oral communication skills\n<br>\n· Ability to work effectively in a fast-paced environment with changing priorities\n<br>\n· Ability to collaborate effectively with engineers, product managers, analysts, business, and marketing functions\n<br>\n· Strong business acumen\n<br>\n· Excellent client management skills<br><br><strong>Note: To apply for this job, submit your application by clicking on the <u>Apply Now</u> button on this page</strong>"}