{"job title": "Data Scientist 4, Words with Friends", "company": "Zynga", "city state": "– San Francisco, CA, United States", "rating": "3.8", "job description": "Data Scientist 4\n<br><br>\nZynga has one of the largest and most feature rich data sets in the tech industry, and we’re seeking a Principal Data Scientist to help us drive key product insights that will have big impacts to our games and company! The successful candidate will enjoy combining analytic skills with business acumen to provide our game studios with insights and tools that will drive our continued success.\n<br><br>\nThe Principal Data Scientist will serve as a data-driven advisor and partner on strategic issues and should enjoy both working with people and undertaking rigorous statistical analyses. The candidate must be proactive and self-driven with the ability to understand macroeconomic trends within the mobile gaming industry. This role will require someone who is intellectually curious and wants to learn the gaming business inside and out. This individual will need to be able to tie together structured and unstructured information to help make decisions that delight our players and maximize revenue.\n<br><br>\nResponsibilities:\n<ul>\n<li>Product Operations</li>\n\n<ul>\n<li>Provide analytical and data-driven decision-making support for product launches and key projects</li><li>Develop predictive models and execute quantitative analyses that translate data into actionable insights</li><li>Provide reporting and performance monitoring to game studios using data drawn from diverse sources</li>\n</ul>\n\n<li>Product leadership</li>\n\n<ul>\n<li>Provide guidance on the Data Science and Analytics roadmap: what matters and what should we being doing next?</li><li>Serve as an evangelist for our data-based solutions. Educate others through formal presentations and other forms of knowledge sharing</li><li>Advocate for the adoption of best practices regarding experimentation, coding, and reporting</li> \n</ul>\n\n<li>Infrastructure and Tooling</li>\n\n<ul>\n<li>Automate data pipelines, models, analyses, and reporting using distributed infrastructure</li><li>Transform theoretical and strategic goals into technical products that support live operations and other studio objectives</li></ul>\n</ul>\nRequired Skills:\n<ul>\n<li>Enjoys playing mobile games (preferred)</li><li>Ability to identify and execute research projects, and generate practical results and recommendations</li><li>Excellent presentation and communication skills; comfortable explaining technical topics to non-technical users</li><li>Experience building predictive models in a distributed environment using regression / ensemble methods, clustering analysis, etc.</li><li>Experience automating analysis using analytics packages in languages like R, Python, and specifically PySpark (ML, MLlib)</li><li>Experience using tools like Tableau for creating dashboards, reports, and general data exploration (strongly preferred)</li><li>Comfortable manipulating, transforming, and analyzing complex, high-volume, high-dimensionality data from varying sources; demonstrated expertise with SQL</li><li>Proven ability to work in a fast-paced environment, and to meet changing deadlines and priorities on multiple simultaneous projects; Able to work effectively as an individual and as part of a team</li><li>Experience with A/B testing design and read-outs</li><li>5+ years of experience performing quantitative/statistical analysis, preferably for an internet or technology company</li><li>B.S. or B.A. in Math, Statistics, Comp Sci, Engineering, or other technical field required; advanced degrees strongly preferred</li>\n</ul>"}