{"job title": "Data Science Intern", "company": "Øptimus Consulting", "city state": "– Washington, DC", "rating": "NA", "job description": "<strong>Job Description</strong>\n<br><br>\nØptimus Consulting, a data science and software company, is seeking a data science intern in their Washington D.C. area office. Interns with the Data Science &amp; Predictive Analytics team will participate in all aspects of work at Øptimus. In an environment where a long-term project lasts one or two weeks, no two days are the same. You won't be getting coffee. You'll sit in on meetings and work on multiple projects: writing call scripts that are used in hundreds of thousands of calls, streamlining our current workflow, and creating statistical models to meet the needs of our clients, just to name a few. You'll be doing the work that a full-time employee does. We'll match what you're good at with what you enjoy and what we need.\n<br><br>\nWe don't guarantee full-time employment after an internship, but we're a growing firm and are always looking for bright, hard-working talent. If you're looking for a full-time job, this is a good first step and puts you ahead of the competition!\n<br><br>\n<strong>Qualifications</strong>\n<br><br>\n1. Must be able to learn quickly and juggle multiple projects with moving deadlines.\n<br><br>\n2. Must have strong analytical skills.\n<br><br>\n3. Must have at least one course in statistics or equivalent real-world experience.\n<br><br>\n• Having courses or experience in machine learning, data mining, regression, generalized linear models, experimental design, and/or GIS is especially desired!\n<br><br>\n4. Must have killer Excel skills and be incredibly competent in Word, PowerPoint, etc.\n<br><br>\n5. Must have experience in R or Python - both is a plus!\n<br><br>\n6. A passion for politics is strongly preferred.\n<br><br>\n7. Experience with computer programming is a plus.\n<br><br>\n8. Experience with political campaigns or similar recruitment efforts is a plus.\n<br><br>\n• Knowing how campaigns work, even if you don't think it's relevant like going door-to-door in a neighborhood or working phone banks can be very helpful!\n<br><br>\n9. Experience with statistical modeling is a plus.\n<br><br>\n<strong>Compensation</strong>\n<br><br>\nInternships with Øptimus are paid commensurate with professional and academic experience.\n<br><br>\n<strong>Company</strong>\n<br><br>\nØptimus Consulting is a family of statisticians, graphic designers, data scientists, programmers, social media marketing analysts, and recovering politicos. We handle a wide variety of projects and use many different technologies and programs to meet our clients needs, so our culture here is one of constant learning and curiosity. Our product quality is unparalleled. We like to do things carefully and do them the right way. We boast an office in Old Town Alexandria, no cubicles (think a cross between Slugline from House of Cards and CTU from 24), and a nacho cheese machine and kegerator. If you live by the work hard, play hard philosophy, then you'll be a great fit with the Øptimus team."}